{"video_id": "-cT495xKvvs", "comments": ["This is a perfect example of how you do a teaser trailer. You’re not getting a synopsis or plot of the the entire movie, but it perfectly gives you a setting and a vibe. That’s a teaser!!!", "I love how this teaser doesnt really show a problem, but it shows a vibe and an introduction of the world and the behavior of the characters.", "It's really cool to see not only such dynamic character designs, but also environment designs from Pixar again. Sure, we still get very interesting worlds and characters, but modern movies seem to all match the same general character design. ", "I love Ember's voice, it just has that slight, spicy, huskiness to it that just says fire, without being overly obvious or dramatic, it just fits. I hear the voice, and instantly it is what I imagined a fire would sound like. Not destructive, not too warm, but a neutral in between ground that is the same potential to be warm and destructive and bright and all things fire can do. Lovely", "How does it take Pixar only one teaser for me to be completely obsessed with its new world and characters?", "Everything. The lightings, the design, the way each characters act and every single thing about this teaser shows how great it is going to be. Can't wait", "The transition from the Pixar lamp to the boat train, that was incredible", "I love how this teaser trailer is awesome, with incredible animation and not using parts from other movies or trailers to create it. Well done!", "There's something very weirdly calm and nice about this teaser trailer.", "The little details in this teaser are fantastic. The book the dirt guy was reading, the dust cloud guy wearing a \"wind breaker\" and the way she avoids touching anyone on the train. Also, her jacket is so cool. I want one!", "I absolutely adore this. The animation is STUNNING. can’t wait for this to come out. I also noticed that at the start, you can see how the effect of her fire (hair?) is burning through the hood, amazing attention to detail ", "I was expecting it to be like the emoji movie and didn’t have high expectations, but this looks like a really cool movie! I looooove the way they animated the water", "I like that Ember's actually careful not to bump into anyone.  It's a nice change of pace from the usual clumsy character.", "okay but the fact that leah lewis is gonna be voicing ember is making me even more excited for this. ", "See Disney’s getting back into the swing of things. This is the type of Disney Pixar film I know ", "Eu amei o estilo do desenho, e a musica de fundo é realmente muitp boa, espero q lançe logo!", "I absolutely love how the clouds in this trailer look just like the ones in Pixar’s “Partly Cloudy” short", "I really loved the water boy and fire girl series as a kid, so seeing it turn into a movie Is even better!", "I can’t help but notice the emphasis on the interaction between characters; everything one character does ends up benefiting another in some way. The only negative reaction is when Wade tries to help Ember, and slightly hurts her. Ember is also the only fire person in the train, and is seen moving carefully to avoid others. Perhaps that’s what the movie will focus on, Ember living in a world where it feels like everything she does either gets her hurt or hurts someone else.", "The characters are so cute, can’t wait to watch it. This is gonna be a masterpiece, I’m sure", "So beautiful. Beauty is literally in every frame. Eyes can not get enough of the drawn picture. BUT recently, Disney has had problems with the script content of their films. I don't remember when I admired the history of this studio. Beautiful art does not guarantee that the plot and characters will be as amazing. Disney no longer thinks about conveying deep thought. They don't take risks, they don't experiment, they don't try something new. Now they are thinking how not to offend anyone. What is the risk here? ", "I have to hand it to Pixar here- The setting looks amazing, and it's visually stunning.", "This looks absolutely adorable and I’m into it. Great teaser trailer to for not showing too much.", "Ember feels like a very ambitious character design for cgi type animation. Cant wait to see more", "Some important things to note: not only is Ember the only fire elemental on the train, the train is designed to accommodate all elements except for fire.", "i love the vibe! the music is very well done, and the character designs are amazing, as always :3", "Now this looks like a Pixar film that has its creative freedom. It really has that old Pixar vibe that the flops didn’t really have, you know? Really hoping that this is a nice bounce back!", "Can't wait to see this. Played the game in middle school, and the animation in this looks phenomenal. I just hope Disney didn't have a hand in on making the plot.", "The fact that Ember is the only fire person on the train makes me think that fire people might looked down upon, like the carnivores from Zootopia", "I love it, the clouds in this are straight up from the Pixar 'Partly Cloudy' short and I can't be more excited about that. I love it!!!!", "ember's clothes look to be some sort of metal linked fabric that shields others from getting burned by her. that's pretty cool. I like how you can still see her flames through the small gaps in the material, so her flame isn't getting smothered but others are still protected.", "i love the animation style and character designs, the music is smooth and gives off such a good vibe, i can't wait to see how this movie turns out, it seems so good <3", "0:56 the kid is reaching out to ember and the parent pulls them back \nsome of the clouds also give her a side glance (not in a nice way) as she walks by\nonly one willing to help her out is wade interestingly enough hes the only element that she can cause the most harm to ", "Kinda reminds me of the game fire boy water girl, but I love this teaser and I like how the characters are all mixed elements and the way they are designed, can't wait for this movie ", "I haven’t been as invested in a film like this since Spiderverse. Can’t wait to see it!", "Even though story could be or maybe kinda predictable I think the environment, characters and setting are so pretty and creative. I like the music too that's in the trailer. I will watch this on my own and hopefully it will change it do something differently with the \"forbidden\" romance trope or they do something different entirely. This is definitely on my list to watch", "This is actually what a teaser is. It doesn't spoil like 80% of the movie for you but it also gives you enough to get intrigued about it. It's nice that Pixar is doing a theatrical movie non-sequel related now. Also, it's kind of cute to see the subversion of the rebellious tough boy and nice and fun girl in this movie . The last time I saw that subversion was probably in Atlantis.", "now THIS is an example of a good trailer. Nice vibe, doesn't give away the plot. Looking forward to seeing this movie", "To me this kind of seems like something that (in theory) would make sense to be in the inside out universe since it’s pretty similar in concept.", "I love love love every pixar and Disney duo, awesome ️", "This is the kind of Pixar movie I really love ️", "Pixar really does go for quality over quantity, all their movies feel unique", "I LOVE how the different elements are involuntarily helping each others! Like the water guy sneezing on the earth guy and making his grass grow! I feel like this could be a theme that will be developed more in the movie...", "i really hope this is well-developed because it just feels like it wouldve been and stayed as concept art", "I never thought we would get a movie like this on Disney", "by seeing tht last part .. i already can tell tht it's gonna be \"it doesn't matter if you're both different, you can still be suited for one another\" and it looks interestign to just enjoy the animation and story in one!", "Really loving the designs of Wade and Ember. They almost look 2D.", "Really cool character design and awesome idea! Very excited to see this now, and I didn't even know it existed 5 minutes ago!", "I’m so excited for this movie to come out!!! I literally ship both Wade and Ember! They’re so good together as opposite elements", "i love the music that plays when ember puts on her headphones, it gives that good morning vibe :D", "This looks really good! I’m down on seeing this when it comes out!", "Actually loving the animation and mostly the texture, it's something new in the animations", "This is what Pixar excels at. Taking the audience to a new world, whether it be that of toys, bugs, monsters, robots, rats, or emotions. And this elemental world looks like a feast for the eyes, so I for one am very excited to see where this goes", "Absolutely incredible teaser trailer. I want to see the full movie! It reminds me of Inside Out", "Wowwwww! I can’t wait when this movie comes out! It looks so exciting!!! I’m definitely watching this teaser trailer again!", "The 100th year anniversary of Disney... incredible. I'm crossing my fingers that the movie is as good as the teaser.", "No other fire elementals on the bus, interesting. Ember is also wearing a protective coat. But who is it actually protecting, her from getting snuffed out or others from getting burned, maybe both? I wonder what kinds of messages this story will tell. The animation looks gorgeous.", "This looks like it will be a fun movie! Especially the visuals!!", "I’m absolutely loving the animation + the concept of how the characters were reacting with each other", "Animation is flawless as always ", "wowowow. the visual storytelling is impeccable!! i love how nothing was really given away. excited to see this !!", "Fun concept, no spoilers, great music! A lovely trailer!", "For some reason I’m getting a heavy Romeo and Juliet vib from this. Dunno why  looks good the animation looks fluid and solid", "This looks extremely interesting, although it seems heavily inspired by zootopia so i hope it does end up being its own thing, because it certainly has a lot of potential", "Pixar really knows how to make really gorgeous 3D animation. Each movie has an unique art style. This looks amazing. I think this will be a very fun movie ", "I love how they're not telling the entire plot of the movie, I love when trailers keep it vague but still show it in a way that makes you wanna watch it without spoiling, I always avoid trailers because they literally just spoil the movie.", "I know this might seem simple, but I actually like the fact that water is a male for once as in aloof media you see that the female is usually the main gender on water based characters, so it’s nice to see a swap for once.", "I love this for so many reasons\nThe way Ember moves literally like flame when she pulls her hand back, unlike the more blunt way Wade pulls beck\nThe irritated glare the cactus man gives the mother of 4 when they all start screaming", "This is the perfect movie for the game fire boy and watergirl. I can’t wait to watch it!", "Can’t wait to see what this movie has in store!!!", "I like how you can see Ember's head glowing through her hood. There's so many little details like that in this trailer alone, I can't wait to see more.", "No cap i got a chiver down my spine anddd goosebumps when she said ember. Lets say i was not expecting an animated disney/ pixar character to have the same name as me. So cool lol!", "Man it’s been awhile, this actually feels Disney. Love everything about it so far.", "Pixar is still in the game to save Disney  this looks and sounds amazing", "I’m so happy to see a non-generic human 3d movie. This feels really close to Pixar’s roots.", "Finally, a Pixar movie that looks really, geniunely cool", "I swear Pixar comes up with some of the most creative and gorgeous looking films on the planet", "oh boy another one of these. im so excited right now. cant you hear the excitement in my voice. i am so stoked for another one of these fire x water movies. we definitely do not have enough. no matter how beautiful this animation is, itd take a miracle for this plot to be interesting", "I bet this story is about a young lady who has a mix of all elements and is needed to fight the fire nation by using all of her elemental powers, totally original", "One of the more intriguing trailers recently. I love it.", "the style looks cool its a simple concept im excited to see this when it comes out", "I can tell you the plot right now, because this is so predictable, but it still looks really really good, wasn’t sure if they were going to go with the five elements, or with the elemental table, looks like they went with the five elements.", "I can dig this just being a cute little love story. Great to see Pixar making smaller-scale films like this more often.", "Can we all just admire the fact that he is THIS dedicated to making us happy?", "I’m getting huge inside out vibes from this and that isn’t a bad thing.", "I love the look of the animation. Idk if it is just me but I am a bit scared. I really really hope that this movie is a beautiful story to go hand and hand with the animation but I am worried it might have a simple basic story with nothing as a selling point other than the animation. It is way too early to judge but i just am worried I want the movie to be great.", "not sure how to explain, but i am genuinely excited and interested in this movie !! can't wait", "I’m already OBSESSED WITH THIS WORLD. \n\nTHIS WATER AND FIRE LOVE TROPE is what i’m living for!", "Pixar absolutely THRIVES when it comes to their original movies, and this does not seem to be an exception. I can’t wait to learn more about these characters and this new world", "wow this looks amazing. i will watch it when it releases. i hope that it will be a great movie.", "Actually excited, Pixar movies lately have been thematically and cinematically beautiful", "I remember playing this game at school, so proud of their transition!", "So good to see indie game developers getting a chance on the big screen", "Disney going eco friendly! I love it", "I love the style and how all the characters are so different from each other, can't wait to see it", "I watched this trailer 100 times in 2 days it's amazing. Looking forward to the full movie. Good luck with your work. Make sure to make the movie to the end. All of the 8000 comments are positive. And about 5,000,000 people are waiting for him. Please make the movie as soon as possible ", "Wow, this looks amazing. The look of these characters is so wonderful. I'm really curious how they accomplished the technical part.", "Interesting how the bus has visible features for every element (mini pools for water people, beds of soil for earth people, seats on the ceiling for air people) excluding fire people. \nAlso I just noticed at 0:56 an earth kid smiles and waves at her but the parent pulls him back.", "I can’t wait for the original soundtrack to drop! and the film 2!", "The new Teaser Trailer for Elemental is fantastic! I’m going to love this movie when it comes out next year!"]}