{
    "video_id": "-cT495xKvvs",
    "comments": [
        "what in the firegirl and waterboy",
        "Is this about like different people or different skin colored ppl?",
        "aw this is so cute im looking forward to watching!",
        "Not a new concept but I do love it",
        "The SONGGG",
        "Notice how this is based on a guy who made a fake Pixar movie",
        "Just imagine all the gushy Puns they’ll make to each other\nWade to his parents: Ember she’s just ahh she’s so hot\nAmber to her parents: oh that Wade he’s just so cool and such a tall drink of water\nMe:️That will make my day in the theaters",
        "As a teaser trailer this looks really cool! I can't wait to see the official trailer and movie to see what these characters bring us. I also love forbidden romances so this should be good! Pixar never disappoints ️",
        "This is like Zootopia and Monsters University mixed together",
        "Ждем 2023, надеюсь он будет лучше всех до него)",
        "0:04 Все это время Пиксар был поездом(─.─||）",
        "1:12 Isn’t She Lovely, Isn’t She Beautiful.",
        "its either a hit or miss tbh",
        "excited!",
        "1:00 The city's design remembers me Shark Tale",
        "Omg the music and bibe is 100/100 perfect!!!!",
        "This give me BIGGG watergirl and fireboy vibes 1:06",
        "The mario movie be looking better though",
        "Fire girls outfit when hooded is honestly slaying",
        "0:43 my favourite part",
        "Coolmath games  fire boy and water girl reference",
        "Fire girl and water boy",
        "They get together, even though society/parents/etc. don't want them to.",
        "Oh it’s a actual movie not a short film ",
        "Am I the only who sees them as characters in the Fireboy and Watergirl games??? (Yes, I know their elements are switched but same thing.)",
        "Id just like to take a moment to admire the eyes on the characters. Im obsessed with how they seem like almost watercolour.",
        "Esse filme me lembra o jogo fireboy and watergirl só q com os gêneros opostos,tipo, firegirl ans waterboy, espero q o filme seja bom",
        "I’m absolutely loving the animation + the concept of how the characters were reacting with each other",
        "It would be great if Wade was voiced by Ryan Raynolds.",
        "Ooh! This is a very good concept! Exited to see the end result",
        "I thought the voice of the water guy was Adam Driver at first",
        "They missed the chance to name him Walter.",
        "Zootopia elements version lol",
        "WHY ARE THEY SWAPPED",
        "HARİKA",
        "When I saw the thumbnail ngl I thought it was some Gacha edit.",
        "I'm just saying amber doesn't look that good",
        "Consept seem a bit plain/cliche but this is just a trailer and I'm exited to watch the movie nonetheless. Definitely hoping for some major subversion of expectations or something! The movie looks amazing as always and it is though the style isn't my favorite it does give me slight inside out vibes witch I like. Interesting that ember is the only fire elemental we've seen so far, wonder if that's relevant to the plot?",
        "Im literally addicted to this teaser, I love the song that goes on, how smooth the animation is, and the lighting has to be the BEST since Monsters University, I can already see myself giving the theatre my money.",
        "Ugh, I hate when I see these fake looking clouds or smokes",
        "Love the whole star-crossed “it can never be” theme between the fire person and water person",
        "Fire and water falling in love is such a fun idea -- and the elemental puns/visual gags look like they'll be on point! (Wade as in wading through the water, Amber tweaked to Ember)",
        "Fire boy and water girl reference",
        "Fire boy and water girl will finally have a romance movie",
        "I absolutely love how the clouds in this trailer look just like the ones in Pixar’s “Partly Cloudy” short",
        "No way the Elements in the world around us now have feelings.",
        "Русские где???",
        "\"I... like the word MOIST, okay? It's who I am. And if you can't accept that, then what's the point.\"",
        "Wade looks and sounds like Dream ",
        "\"I- like the word moist... ok?? Its who I am!!!!\"",
        "So there’s cloud guy dirt guy aqua guy and flame gal",
        "This is amazing! Hope it reaches the silver screen!",
        "Ill try to spoil it\nWanna ask why\nBecause yes\nOkay so",
        "I didn't think I'd live to see a movie of this classic Fire Boy & Water Girl, but I'm so excited and looking forward to it! A movie about the elements of nature, it was bound to at some point, it's one of the few things Pixar haven't made a movie out of yet.",
        "looks interesting",
        "bro really had to take inspiration from the game fireboy and watergirl",
        "Leaked ending: They turn into obsidian",
        "now THIS is an example of a good trailer. Nice vibe, doesn't give away the plot. Looking forward to seeing this movie",
        "See Disney’s getting back into the swing of things. This is the type of Disney Pixar film I know ",
        "Ah yes. Pixar about to drop the next insane and beyond imagination Animation Movie that will make your  local psychology teacher go up the walls and scream.\n\nCan't wait to see it",
        "Can't wait to see it , Pixar always make great stories",
        "1:13 internet: \"she's hot.\"\n\nme: \"you mean in temperature, right?\" ",
        "Pixar Obviously been playing Fire boy & Water girl Recently . Peak",
        "How she listening to music through the hoodie? Sure she can probably still here it, but it's probably muffled, right? Then again, what am I saying? This an animated kids movie.",
        "A lot of people thought this was official and it does look good",
        "This looks so cool! I love how Pixar is able to convey emotions of characters without them even being humans in such a creative way, and even finding out ways to make the world seem relaxed and normal.",
        "I LIKE THE WORD M O I S T",
        "I LOVE how the different elements are involuntarily helping each others! Like the water guy sneezing on the earth guy and making his grass grow! I feel like this could be a theme that will be developed more in the movie...",
        "“I like the word moist…” “It’s who I am!”",
        "круто, ждём",
        "This I can already tell is gonna be the exact opposite of lightyear, and I’m here for it!",
        "Looks promising. Might check it out.",
        "This takes a W",
        "Is it just me or is no one else talking about Embers clothing being made of metal? Essentially chainmail? You can see her glow coming from the cracks. Love that touch, considering regular fabric clothing wouldn't survive well.",
        "man didn't know they were adapting fireboy and watergirl",
        "If you think about it, fire is the only element that can inactively be harmful & cause damage",
        "I'm honestly excited to see more sneak peaks and trailers for this movie. It looks so good and the creativity here is astounding.",
        "oh hey pixar got some new computers and developed a fancy new particle simulator",
        "Ain’t no way they banned from Ba Sing Se ",
        "OMG! Can't wait!",
        "DUDE I FOUND THIS TRAILER UNDER A VIDEO ABOUT IT",
        "This feels a lot more down to earth than your usual Disney Pixar movie. It’s calmer. Not some big blockbuster adventure with lives on the line. I think I’ll like this movie!",
        "Why did they make Ember’s hoodie a fire resistant material? It doesn’t make any sense. Shouldn’t she be naked?",
        "U know a movie is gonna be something special when u cant stop smiling through out the entire trailer.",
        "Whats the song called?",
        "Наконец-то долгожданная экранизация замечательной игры огонь и вода",
        "I actually love this idea, the art is amazing and the different element ideas are great",
        "Wade and Ember that's cute ",
        "The literal definition of forbidden love. Pixar never disappoints! ",
        "I’ve waited for Pixar to make a movie based on elements, sniffs and now it finally happens!",
        "YouTube decided that I must love this movie and everything barely related to it ever since I watched Kevin Tremmer Tunes' fake trailer for this movie",
        "I AM YOUTUBE \nMERA TECH CHANNEL HAI \nMERE CHANNEL SE AAPKA HELP HO SAKATA HAI\n️NICE VIDEO ",
        "This is the perfect example of a reaser, no plot reveal, just a simple grasp of the location and the main 2 characters and the atmosphere surrounding them",
        "im sorry but is it that one team game water and fire game thing",
        "I like the Zootopia like wordbuilding",
        "Alternate Title: Watergirl and Fireboy: The Movie",
        "From the studio that brought you Toy Story, Inside Out, Monsters, Inc., Luca, Finding Nemo, Coco, The Incredibles, Cars and Turning Red",
        "The 100th year anniversary of Disney... incredible. I'm crossing my fingers that the movie is as good as the teaser.",
        "i really hope this is well-developed because it just feels like it wouldve been and stayed as concept art",
        "Ember and Wade don't seem like good names for these characters",
        "when out fo ideas on new designs...",
        "Pixar is always amazing!",
        "Pixar fazendo uma arte linda, como sempre",
        "This is perfect!!",
        "They made a huge mistake knowing each other",
        "Looks good. As long as they focus on giving us a good story and not “the message” this will do well",
        "The animation for the characters are SO SMOOTH, and everything looks so realistic as well!",
        "I like the water guys voice.",
        "ok, while it's a very well done teaser trailer, this is some no-heart student film stuff right here",
        "The pixal teory getting stronger!",
        "yo i always loved this game on coolmath glad theyre finally making a movie, osmosis jones will be perfect for the role",
        "cool",
        "You could hold both my parents at gunpoint and offer me 12 thousand bucks and I still wouldn't watch this",
        "Hope it's in an actual theater",
        "Why does it have be a romance movie? Other than that, it seems cool.",
        "\"I like the word moist....\"",
        "YA PAL SUNSTONE IS NOW SMALL AND A 20 YEAR OLD",
        "This has to be the most beautifully animated Pixar film in years, and you can tell that by just seeing the teaser. This is gonna be so good!!",
        "This has going downhill",
        "Yet again Pixar back at it again with a masterpiece. Tbh I think Pixar is the only studio that is so god at making a “kids movie” that appeals to everyone and every age. They have made some of the best movies in animation and I can’t wait to see this one. Also very good teaser already gives you the vibe and setting without spoiling and really gets that hype going for the movie.",
        "After Soul and Luca it didn't seem like Pixar could go anywhere else and here we still see something visually new and fresh while managing to feel like a Pixar film.",
        "Bekliyorum sabırsızlıkla",
        "In Elemental 2023 June",
        "Wades design almost reminds me of Alberto from Luca",
        "Hold up pause at 00:27 the rock guy nosed guy looks like the koala from the movie back to the outback the koala looks similar to him",
        "Interesting ideas polar opposites. Looks like they’re gonna fall in love.",
        "Love their voices so far, they fit their looks perfectly imo",
        "My only problem is that there’s no synopsis\nThey basically gave us a bad trailer, delete this and give us a trailer with a plot to have.\nAll the comments here are jokes, don’t take them seriously",
        "At the beginning I thought it's based on the game\n\"Fire boy & Water girl\",\nbut it turns out it's the exact opposite",
        "Here's a concept for a movie how about it's about the alphabet",
        "They stole the idea from the Guy bruh",
        "0:23\nthe cloud guy from inside out",
        "fireboy and watergirl but the roles switch.\n\n\n \n\nedit: Is it just me or the animation looks weird.",
        "I cant help but notice the emphasis on the interaction between characters; everything one character does ends up benefiting another in some way. The only negative reaction is when Wade tries to help Ember, and slightly hurts her. Ember is also the only fire person in the train, and is seen moving carefully to avoid others. Perhaps thats what the movie will focus on, Ember living in a world where it feels like everything she does either gets her hurt or hurts someone else.",
        "Rule 34?",
        "This looks kewl!",
        "I love how this trailer doesn't just try to appeal to children, and genuinely as an adult makes me excited and intrigued to watch.",
        "Wade : I’m Wade\nEmber : I’m ember\nMe : I’m hyped",
        "solid: earth\nliquid: water\ngas: cloud\nplasma: fire, probably and electric",
        "This trailer is amazing! I can’t believe how much visual information they gave us on such a short amount of time.",
        "Bruh what is this I thought this was a joke ",
        "YOOOOO this looks AMAZING  \nI really love the vibe. Pixar does a really good job capturing everyone’s personality, from the main protagonists to the side characters! Can’t wait for this!",
        "Gosh this looks incredible! - Tim",
        "water boy and lava girl like that cool math game",
        "Even though story could be or maybe kinda predictable I think the environment, characters and setting are so pretty and creative. I like the music too that's in the trailer. I will watch this on my own and hopefully it will change it do something differently with the \"forbidden\" romance trope or they do something different entirely. This is definitely on my list to watch",
        "Wade? As in Wade in the water???",
        "ember’s design is so satisfying",
        "WHY WOULD YOU TURN THE GAME INTO THAT AND WHY IS THE FIRE A GIRL INSTEAD OF WATER?",
        "Such beautiful animation, and the creativity in all of these characters is unbelievable. Seems like it's going to be one of the more mature Pixar films. Can't wait!",
        "Rip off the teaser is too short even if it’s supposed to be short",
        "Si habra un antagonista creo que sera el trueno oh el rayo",
        "I immediately know what's gonna happen.\nEmber and wade fall in love, and that's a bad thing and everyone thinks it's weird",
        "fireboy and water girl is finally canon.\nthey just swapped genders guys dont worry",
        "This hits hard in the feels when you've played that fireboy and waterboy game on coolmath\n\nThose were the days",
        "No way they put the moist meme guy in the movie XD",
        "графика все лучше и лучше, молодцы ребята",
        "The fact that Ember is the only fire person on the train makes me think that fire people might looked down upon, like the carnivores from Zootopia",
        "okay but the fact that leah lewis is gonna be voicing ember is making me even more excited for this. ",
        "I’m not here for it ️",
        "I like the word moist!",
        "I find it very telling that she was the only fire elemental present. Subtle details like this can say a lot.",
        "cool math games coming in clutch for this",
        "One itty bitty thing I noticed is how Ember has a hard time being in a relationship with every other element whereas Wade is the opposite. \n\nWade is compatible with earth because fertilization. Wade is compatible with wind/air because water creates precipitation/rain. Wade can be with water. Wade CAN be with fire, although it's a harmful relationship for the fire - and if the relationship is too heated he can evaporate. So essentially, if he pushes too hard for her, she'll be harmed and so will he if he stays in her life for too long.",
        "So cringy",
        "Well, after Lightyear, it's very nice to see something fresh, new and original from the studio. I’m not sure what else to say about the trailer, other than having wonderful animation that's flowing with life and wonder, and wonderful voice acting. I’m hooked, and I can’t wait to see more.",
        "wuts this song?",
        "They tried making sth new that seemed genuine and interesting. and then the stereotypical bus meeting / boy whose nature is hurting the girl, kind of thing. that's why management people should not touch scripts.",
        "That’s some pretty cheesy voice acting so far.",
        "afraid of rule 34",
        "So far it looks good",
        "I can already tell I’m gonna love this. The little interactions between the elements was so cute and fun to watch 🥹🫧",
        "God I love Pixar",
        "Me gusta la animación impecable como siempre emocionado de ver está película 🇻🇪🇻🇪🇻🇪🇻🇪",
        "This teaser gives off serious Zootopia vibes, but that’s not a bad thing in my book. The teaser is really pretty and it looks like Pixar is constantly upping their animation and if this is a clear sign of where they company can do in future films, I’m all in for it.",
        "Alfin hacen una pelicula del fuego y agua gracias disney",
        "a trailer that doesn’t spoil the plot of the movie, very rare these days.",
        "I love how graceful she is!! Beautiful animation! Also I love their voices!! AND HER OUTFIT IS SO STUNNING WITH THOSE SUBTLE SPARKLES!!! EEEEEE",
        "Will this be the first movie not in the Pixar theory?",
        "Calling it right now: They get married and have steam babies.",
        "Water. Earth. Fire. Air. Long ago, the four nations lived together in harmony. Then, everything changed when the Fire Nation attacked. Only the Avatar, master of all four elements, could stop them, but when the world needed him most, he vanished. A hundred years passed and my brother and I discovered the new Avatar, an airbender named Aang. And although his airbending skills are great, he has a lot to learn before he's ready to save anyone. But I believe Aang can save the world.",
        "On second thought, I thought the thumbnail was a gacha art-",
        "Es imposible que esto no sea una referencia al juego  “fuego y agua”",
        "The song is so good",
        "why is this so cute. this teaser is a good teaser.",
        "I love that they made her clothes fireproof",
        "Wow ",
        "So exited for this! The worldbuilding alone looks so neat. I want to know everything about this little element society",
        "So, I'm guessing the story will be society says Wade and Ember can never be together due to their differing elements, but by the end of the movie, they decided to shun society and make Steam.",
        "what if elements had feelings",
        "Is this Bakar ?",
        "1:08 Was it only me who remembered the game fireboy and watergirl with this scene?",
        "Im in love with it already.",
        "This is definitely a movie of all time",
        "IM SO HYPED",
        "It's gonna be interesting how the animators are going to work on a character who is constantly on fire. The way the flames flicker... but its Pixar so I have faith!",
        "Waterboy And Firegirl The Movie:",
        "Imdontai made this fr",
        "wow i like it",
        "Why can it not be nowwwww WHY PIX WHY WHEN I SAW IT ONCE I WANT IT TO BE NOWWWWW WHYYYYY U DO THIS TO ME PIX WHYYYYY",
        "WAIT I THOUGHT THIS WAS MADE UP",
        "Hmm ,IM EXCITED \nSick of water being feminine and fire being guys! Besides this makes more sense since fire is more graceful and elegant and water is more sloppy and movable.",
        "I love the interactions between every element! This looks like a great movie.",
        "This looks really cute!",
        "The end is why I hate it and don't want to see it way too played out and moronic and predictable",
        "Come ON PIXAR SWAP THOSE GENDERS was so hyped to call this 'Fire Boy and Water Girl' AAAAAA",
        "Anyone remember the Fireboy and Watergirl game? It's them but the other way around, i love it!",
        "Me who thought it was a gacha video",
        "Bellisimo,simplemente bellisimo",
        "It should be Water and Fire the movie",
        "can't wait for disney's 100th birthday",
        "Dang, didn't know Fireboy and Watergirl was finally made into a movie.",
        "The characters look lke theyre made in gacha",
        "This looks like a bad    movie",
        "As you grow older, and after watching dozens of Pixar movies, they all feel... the same.",
        "Pixar is the last movie company that hasn't let us down yet ️",
        "The animation is stellar. I like this world being introduced, and this looks like a really good movie.",
        "This reminds me of a Korean small animation about all 4 elements doing a project on creating earth",
        "ember looks like a gacha oc-..",
        "oh my god you guys its actually so deep you see its actually a metaphor",
        "New ATLA movie looking decent, Ba Sing Se looks hella different though",
        "I can already tell Im gonna love this. The little interactions between the elements was so cute and fun to watch",
        "There are so many clever concepts in just this one little teaser trailer, I am sure the rest of the film is going to be incredible!!!",
        "Yeah let’s make a love story out of elements ",
        "If elements had feelings☭",
        "Sad movie huh",
        "BRO I THOUGHTBTHE THUMBNAIL WAS A YASSIFIED GACHA CHARACTER ️️",
        "Pixar: \"What if we gave elements thoughts and feelings this time?\"",
        "I’m not sure if it’s on purpose, but does anyone else notice how there is no fire characters in this trailer besides amber ? The scenes show a lot of cloud,water and earth character scenes but just not fire ones. I just might be overthinking but I wanna hear what others think",
        "ember's clothes look to be some sort of metal linked fabric that shields others from getting burned by her. that's pretty cool. I like how you can still see her flames through the small gaps in the material, so her flame isn't getting smothered but others are still protected.",
        "Can't wait! The animation, details (Pixar's best quality) and bg music made this much more wholesome than it already is.",
        "It's A INCRIBLE history....for a short ...",
        "hey, is that sharkboy and lavagirl?",
        "Van hacer pelicula de un cuento ilustrativo de hace años ? Se ve prometedora",
        "The most cutest movie in a long long time",
        "I am loving this trailer! I love that it just gives you a vibe- a good vibe, as if your really there. I also noticed that that Embers clothing material looked kinda it was made to be “un-flammable”, which is pretty cool since, most clothing is flammable, and the other elements just have flammable clothing, right? I’m so excited for the this movie!",
        "1995: What if Toys had feelings?\n2001: What if Monsters had feelings?\n2006: What if Cars had feelings?\n2012: What if Scottish people had feelings?",
        "He likes the word moist, it's who he is, and if you can't except that, then what's the point....",
        "We like the word moist",
        "I really wanna watch this movie rn but it comes out in 2023 ",
        "water girl and fire boy from the flash games",
        "Fire boy and water girl online game???",
        "Nice video",
        "Fireboy and Watergirl movie, Nice",
        "I LIKE THE WORD MOIST OK!?",
        "can’t wait for another visually amazing movie",
        "Reminds me of Adventure Time with all the different elementals.",
        "A pretty good teaser all around. A lot of trailers, let alone teaser trailers, more or less give away the entire plot. But this did a good job of giving you exactly what it's supposed to: A quick glimpse into the world of the movie.",
        "lovin' the character designs, hope this film will be worth the watch!",
        "Already emotionally invested in these characters ",
        "Genshin?",
        "The new fire boy and water girl movie looking great\n\nNot sure why they swapped the roles though",
        "They making movies about anything now",
        "Wait, I thought it was just a meme character made by one guy to mock Disney",
        "Forbidden love indeed",
        "This might turn out amazing!",
        "i got this when searching for E_lemental (the cw youtuber)",
        "THIS, This is what people want from Disney, this seems like a very creative idea and the teaser was perfect, I’m so excited to see this in the future and hopefully this is much better than the recent movies Disney has created.",
        "ok so it's gender swapped fireboy and watergirl",
        "i could already guess what the plot is",
        "El niño fuego y la chica agua es canon pero invertido jaja",
        "meh.",
        "Did they seriously make a movie out of a cool math game?",
        "Yall are really running out of ideas huh?",
        "The animation doesnt look great",
        "i remeber a while ago a short about fire and water I wonder if that project grew into this?",
        "Hell N Back - Bakar",
        "This looks awesome!!  The opening to this is fantastic and very well done.",
        "Would absolutely love if this turned out to be a friendship story rather than a love story and how their newfound friendship helps Ember overcome the hardships she most likely faces as a fire elemental",
        "fireboy and watergirl gender swap",
        "This looks Incredible",
        "",
        "I like how in the title Elemental, the E and M at are fire-y colours representing Ember and the first two letters of her name!  1:22",
        "Ok I did some research and we should expect the official trailer to come out in February or March ️",
        "I predicted the name of the girl I said at the start \"ember?\"",
        "You’ve made it this far I look forward to it.",
        "PLEASE be a good movie, we've had enough letdowns the last couple of years",
        "Omggg they like totally just reversed the gender roles of fireboy and watergirl, omgggggg how inspiring",
        "Hi I Love The Trailer Of Elemental I Can’t Wait To See The Second Trailer and The Movie",
        "Bro they ruined fire boy and water girl they turned them into fire girl and water boy ",
        "I hope they sneak in a fireboy and watergirl Easter egg in here",
        "Wow they really made an animation of the fire boy and water girl but switched the elements",
        "Okay, after watching those fan arts and now this, this looks promising. I hope they won't ruin it and it still release in theaters. And I hope there will be a villain in the movie just like it was shown in the fan art. And for a fire element, she's pretty. Can't wait for this movie!!",
        "I like the word  M O I S T",
        "omg fire boy and water girl? only its fire girl water boy here",
        "amazing music... WHEN IS IT OUT IN SPOTIFY!!",
        "From fire boy to water girl:\nTo fire girl and water boy:",
        "it's all gonna be good until rule 34\nartists come around.",
        "The way animation keeps getting better throughout the years is just astonishing. The art is so beautiful",
        "In a few years this would be the nostalgic sience movie",
        "Despite the cliche of the girl dropping something and the boy leaning down to pick it up as she does, this movie looks great! This is how you do a teaser.",
        "Zootopia, but the Elements. I’m vibing.",
        "I liKe tHe wOrD MoiSt OkaY ??!",
        "This is kinda goofy",
        "I can’t stop watching this teaser, the animation is so beautiful and satisfying to watch can’t wait to see this when it comes out!",
        "This movie is gonna be very moist indeed",
        "I like how you can see Ember's head glowing through her hood. There's so many little details like that in this trailer alone, I can't wait to see more.",
        "Here's my guess on what's gonna happen\nEmber (the protagonist) is gonna be a girl who has trouble controller feelings so she almost ruins others by burning them. \nthat's my guess",
        "I love the character designs on everyone!! The vibe of it is very comfy, definitely gonna be a comfort movie for me!",
        "I can’t help but notice the emphasis on the interaction between characters; everything one character does ends up benefiting another in some way. The only negative reaction is when Wade tries to help Ember, and slightly hurts her. Ember is also the only fire person in the train, and is seen moving carefully to avoid others. Perhaps that’s what the movie will focus on, Ember living in a world where it feels like everything she does either gets her hurt or hurts someone else.",
        "I wonder if there’s lightning, very unlikely but I think if there’s one the design gotta be pretty cool",
        "Знаете, это мне очень напомнило анимацию TEAM(2017) ",
        "Pls make the movie",
        "Did y’all just gender swap, fire boy and water girl?",
        "fire girl and water boy finally getting a movie adaptation",
        "Mid",
        "Do you know these two actually remind me of water girl and fire boy from an pc game?",
        "when a character has Ur name",
        "looks good but the artstyle is horrid. its actually hard to look at because of how bad the artstyle is",
        "I’m so excited for this. I remember seeing the concept art. Such a great idea.",
        "It's gonna be steamy",
        "I can hear Deviantart users stamping their feet to make cursed art of Ember.",
        "Bruh fire boy and water girl ripoff ",
        "0:56 the kid is reaching out to ember and the parent pulls them back \nsome of the clouds also give her a side glance (not in a nice way) as she walks by\nonly one willing to help her out is wade interestingly enough hes the only element that she can cause the most harm to ",
        "1:10 \nBRO WHAT IS THAT ",
        "this movie bouta be so basic asl",
        "cloudys many",
        "2015 kids: \"it's just a movie\"\n2000-2010 kids: * watergirl and fireboy *\n\"Ahh yes the good old memories\"",
        "Oh my god I really hope this movie doesn’t have a villain or something. I just want a normal love story.",
        "Only pixar could get people to ship fire and water just from a teaser trailer.",
        "oh yes, the screen version of \"fireboy and watergirl\" looks great",
        "God this is cringe",
        "That transition from the Pixar lamp, the 2D looking faces with 3D forms, Zootopia vibes, and the MUSIC! I dig this",
        "0:48 the guy in the back is me when baby are crying ahaha",
        "Ok this actually looks new not a copy I’m Surprisingly interested in the las 2 years lol",
        "I love how this teaser doesnt really show a problem, but it shows a vibe and an introduction of the world and the behavior of the characters.",
        "running out of ideas",
        "personally it doesn't look good for me the Wayde guy design weird but ill give it a chance",
        "그래 사람아닌 것만 만들자.",
        "Pixar 2022: What if elements had emotions?",
        "Why didn't they call it fire girl and water boy. We would have loved that :(",
        "Really loving the designs of Wade and Ember. They almost look 2D.",
        "Oh god.  Are the elements gonna be woke too. Lol!",
        "Hear me out",
        "I LIKE THE WORD RICK ASTLEY",
        "Not bad but it’s pretty good",
        "OK! ok! Feeling the vibe can tell already there will be jokes alot of good songs very nice and a And seems the main character is fire Very nice Hoping to see avatar the last air bender reference",
        "Zootopia but this time instead of furries they're dirt and fire. Great",
        "everyone has an effect or reaction caused by one another just by even the slightest interactions! cool!",
        "I LOVE THIS",
        "our hope pixar",
        "0:46  im feel bad about the water lady sad that her lipstick is stuck in her head.",
        "I love the part when water boy says he just like to be moist.\n\nJust, joking. That was a parody someone made XD haha",
        "Finally a new art style. I was getting so bored of the recent animated movies since a lot of them seemed to have the same art style in the sense that they were all soft and not really any corners existed.",
        "Fire boy water girl",
        "They have emotion AND NOW THEY HAVE ELEMENTS?",
        "This is actually what a teaser is. It doesn't spoil like 80% of the movie for you but it also gives you enough to get intrigued about it. It's nice that Pixar is doing a theatrical movie non-sequel related now. Also, it's kind of cute to see the subversion of the rebellious tough boy and nice and fun girl in this movie . The last time I saw that subversion was probably in Atlantis.",
        "This new Avatar ATLA animation looks sick ",
        "I don’t care if this is another “forbidden love” story, I think the concept of elemental people is really cool.",
        "Honestly I don’t feel like it’s going to be a whole fire race thing, everyone seems pretty chill with her making her way through the train. Even if you do see the kind of grouchy faces “”, they didn’t really look annoyed or disgusted by her, they kind of just look tired and annoyed with their day. I get like that sometimes, I’m not mad I’m just tired and need my morning coffee ️",
        "looks amazing",
        "Steamy.️️",
        "\" M O I S T \"",
        "adventure time did it way better",
        "I’m just sayin why are the characters swapped cause to like the game water girl and fire boy",
        "The art style looks amazing! Very beautiful animation. I’m starting to notice that Pixar is really trying to make different animations from what we usually see by them. 'Soul', 'Luca' and 'Turning Red' kinda showed that for me. It looks very cute. Can’t to see this movie at 2023! ",
        "\"I like the word, moist, okay? It's who I am and if you can't accept that, what's the point?\" ",
        "The characters are so cute, can’t wait to watch it. This is gonna be a masterpiece, I’m sure",
        "Bro why she the only fire in the the bus",
        "The fact that he picked a flower from his armpit",
        "the pun potential of this film is wonderful",
        "This looks like it’ll be a cool idea, the character designs are amazing!",
        "Haven't seen anything about this movie except this very nebulous teaser trailer and I can already tell it's gonna follow the usual Pixar movie formula. Create a new world with anthropomorphized non-human characters that is identical to human society in every way except physical appearance. Make a few dry jokes/puns about that world's direct analogues to specific things that exist/happen in the real world. Have a main character who's a social outcast (usually due to some glaring on-the-nose physical characteristic). One day they encounter a foil character with whom they form an unlikely bond that then gets tested before being re-formed and reinforced at the end of the movie, but in the process they learn some allegorical moral lesson and become better people (or whatever they are).",
        "Live action Waterboy and Firegirl looks great",
        "I love how everyone interacts with each other and the world around them!",
        "Definitely a movie I want to watch! Can’t wait to see it come out Pixar! From a Fan, Jojo",
        "Bro I’m ngl the r34 gonna be crazy ",
        "Да, они меня прям купили как старого фаната идеи стхиий и элементов ещё по биониклам и мульту аватару.\n\nYeah, they bought me as old fan of idea of elements from bionicle and cartoon series Avatar",
        "I love Ember's voice, it just has that slight, spicy, huskiness to it that just says fire, without being overly obvious or dramatic, it just fits. I hear the voice, and instantly it is what I imagined a fire would sound like. Not destructive, not too warm, but a neutral in between ground that is the same potential to be warm and destructive and bright and all things fire can do. Lovely",
        "I love pixar this my my childhood I will never stop watching these master pieces",
        "Thanks god it was Wade and not Johny️",
        "the logo animation looks similar to squid game",
        "Хочу быть облаком утром в метро ",
        "Is it just me or is this giving me or is this making other people think of inside out",
        "It's basically fire boy and water girl but the genders are switched.",
        "So good to see indie game developers getting a chance on the big screen",
        "\"I like the word moist\"",
        "reminds me of good ol flash game where you play as water or fire characters to traverse the platform",
        "It looks good but I got a weird flashback to the emoji movie and zootropolis, really hope it's got a unique story",
        "I love the design of that earth elemental at 0:38. All the way on the left",
        "WOW! Perfect!",
        "fire girl and water boy",
        "Sim, é o filme do jogo Água e Fogo",
        "No fue la mas digna",
        "This looks so bad im going to cry",
        "Commentaire 80k",
        "0:42",
        "i’d not know why but this makes me so so happy i’m so looking forward to this",
        "Fire and water as a team\nThis will be interesting.",
        "this reminds me of a game on play monkey but im german idk if its in america aswell Spielaffe is the gaming platform or smth",
        "This seems like it's gonna be quite a creative movie! Wade is a perfect name for the water guy, gave me a chuckle. Haha can't wait for this one",
        "Ready to cry again ️ I guess.",
        "Anyone knows what is the name of the music?",
        "This movie is looking real swag",
        "О мульт по игре Огонь и Вода\nПхех",
        "Ember can get it, not gonna lie\nSmokin character design ",
        "One word…\n\nS T E A M",
        "The artists (not the good ones) are already doing work on the ember character",
        "Idk if this is real or not lol",
        "This teaser is a nice change of pace than others. Due to the fact that it doesn’t actually focus on a problem, but it shows more of the world and characters. I found movie trailers follow the same format of mainly showing a conflict/problem. This shows dynamic looking characters as well. You can’t deny that this is a nice teaser trailer, makes you want to know what happens.",
        "I love the subtly of the different looks she get from some passengers. She is the only fire elemental in the train and some passengers dont notice her but others do. Those who do notice her dont smile but either frown or give a wary glance. The only one who does smile at her is a child who reaches out at her before being pulled backwards by their guardian, indicating that the child doesnt know any better that she could technically hurt him and the parent believes shes dangerous. Really interesting subtly details.",
        "im so happy for their transitions and how far they've come from a simple online coop game",
        "anyone else is getting the fireboy and watergirl vibes? It's like they genderswapped them just to make it not an obvious reference to that.",
        "cool math games popping off these days",
        "Firegirl and Waterboy ",
        "Looking forward to this!",
        "Pixar really does go for quality over quantity, all their movies feel unique",
        "i love the contrast between ember and her music style, as well as what we've seen of her chill personality\n\nfire is often seen as a destructive and negative force, hot-headed and angry; when fire is actually a very helpful and nice thing, as it keeps us warm and provides light, comfort, and a place to prepare food for sustainance, and allows for us to create smoke signals as a sign for other people that theres life nearby",
        "She's look like Sonic in his 1st trailer...",
        "I can already tell this is going to be artistically beautiful",
        "Can't wait to see this. Played the game in middle school, and the animation in this looks phenomenal. I just hope Disney didn't have a hand in on making the plot.",
        "moist?",
        "reminds me of the game fireboy and watergirl",
        "Looks pooy",
        "so proud of fire girl's and water boy's transition ️‍️",
        "i love the animation style and character designs, the music is smooth and gives off such a good vibe, i can't wait to see how this movie turns out, it seems so good <3",
        "This is like the after life of Inside out",
        "This literally feels like 3D and 2D mixed together. It's wonderful. I'm getting my finger crossed for this movie.",
        "I’m actually excited for this movie",
        "Some important things to note: not only is Ember the only fire elemental on the train, the train is designed to accommodate all elements except for fire.",
        "Theories ahead (possibly spoilers?*\n\nOne of the things I almost immediately noticed was that the fire girl, Ember, seems to be the only fire-type element in the area, I don’t know if this is just a coincidence or to showcase the other elements and make Ember stand out more. At first, I suspected that maybe fire elements might not be as welcome in the area as fire can be quite destructive, but watching the video, you can see that no one is surprised or frightened by her appearance as she boards the train, leading me to believe that this might just be a coincidence. However, there are a few characters on the train that send her quick looks and nearing the end of the teaser, around when Ember reaches the doors, we can see an earth-type mother pulling away her child as Ember passes them, As Ember walks passed everyone on the train, we get to see exactly how the elements air, earth and water all coexist together and how they complement each other's elements, we cannot see this with Ember or any other fire types. it might be possible that the film will showcase discrimination in this way.",
        "I like that Ember's actually careful not to bump into anyone.  It's a nice change of pace from the usual clumsy character.",
        "I like the word moist its who i am",
        "OMG ITS EMBER HEARD",
        "I love the Ali J viral video reference with that one water element lol",
        "I dunno, why do I feel like the only one who doesn’t like the look of this film?",
        "Looks like they’re going to play off the idea of how to maintain a friendship — or a romance — when you can’t touch each other. That’ll be interesting ",
        "Totally into it. Feels like it will be a remarkable story ",
        "I come early, because I like this story, because it makes me happy every time I'm sad and touches me a lot. I love the creator of this amazing animated story",
        "What I love about Pixar trailers is the fact that they release only when you least expect it. Unlike other movie studios where they're always like, \"NEW TRAILER TOMORROW\" Pixar just releases it out of the blue. God I love this studio ",
        "Next we're going to get a movie about a neutron that dreams of being a proton",
        "Disney:”so that adventure time story arc where flame princess thinks finn is an element of water!”\nAnimators:”yea?”\nDisney:”YOINK!”",
        "Yesterday I was actually thinking about how unprofessional trailers can be, and how I’ve never seen a worthy trailer, and coincidentally, this comes along. Compared to other trailers, this just shows the characters and setting, the only 2 things we should worry about right now. Kudos to the person who planned this.",
        "火と水",
        "Next Movie: A New Elemental is born… Steam",
        "Nice concept but there’s more elements than clouds, plants, fire, and water :/",
        "Fireboy and Watergirl seem changed a lot lol",
        "that's... actually a pretty good teaser trailer. it literally left me speechless, simple, unique and straight to the point with good delivery all that's left is the movie",
        "I can't believe Pixar made an animated movie based on the \"Fire Boy and Water Girl\" game.",
        "Oh yes im def watching this",
        "I like how the water element guy is the slightly clumsy one.\nFire is considered destructable and unpredictable,despite the fact that if you see a fire,it typically looks quite elegant.",
        "Fun fact: air, earth, fire and water aren't elements.",
        "Anyone else getting Zootopia vibes?",
        "yall gotta stop using that horrible looking 3d animation man i miss the old ones",
        "1:02 oof that earth elemental with the rock look going on, probably doesnt want any grass growing but he's got the water dude sleeping right on him.",
        "When this was first announced, I had zero interest in it because I thought the concept was dumb. But now that the teasers finally released, I've changed my tune, this looks absolutely gorgeous.",
        "No.",
        "I have to hand it to Pixar here- The setting looks amazing, and it's visually stunning.",
        "Once June comes, this movie will become mind blowing for long years to come. Any significant details between how we will see which villain will take the spot light. No to mention that Pixar can figure out something of it's improvements and make this movie very delicate and clean for the most part. scientifically proven this on Disney Plus besides putting in theaters, I Don't think or might aired at some point though. ",
        "Ah yes, the ideal teaser. The 2 protagonists on a train, nothing related with the plot shown in the teaser, just a train.",
        "The new Disney 100th anniversary intro almost looks like real life!\nEDIT: but also has that CGI'ed look to it",
        "Oh this is definitely a twin flame  thing. Lol.",
        "I found the A113 at 0:15!\n\nSo we have the A in the circle, and then -- in the boxes -- we have H and Al, which are Hydrogen and Aluminum, #1 and #13 on the periodic table of elements! That's so cool!",
        "i can’t wait to see more of how all these characters interact with each other, it already looks super creative so far",
        "Wow, I thought this was a troll from a guy on twitter",
        "Very cute. Nice ideas. Not too much detail",
        "How does it take Pixar only one teaser for me to be completely obsessed with its new world and characters?",
        "وش ذا العرض يجنن يخليك تسأل نفسك مليون مره وش السالفة وش ذولي الناس شكله بطل الفليم ",
        "I love it already",
        "Wheres is John lasseter",
        "The water guy, Wade, looks like Ben Platt",
        "Bro the fact that it took the trailer just the trailer for those to make the drawings️",
        "It looks like Ember is the only fire element being there. You see water, earth, and air but no fire.",
        "Please let this be as good as I want it to be",
        "Pixar movies are starting to look the same",
        "This looks great",
        "Wow just wow, the animation and shading is so clean and smooth, as expected from Pixar. Definitely going to watch when this comes out.",
        "Why did I just realize that the water guy is named “Wade” for “wading in water”?? That’s genius to me lol",
        "Ahh I can’t wait!",
        "\"I'm Ember and my prounds are they/them\"",
        "This music is a vibe",
        "It's actually really interesting to see different reception to this trailer on different platforms. Here, it's all love and appreciation for the art and the detailed animation, the personality shown within the animation, analysis of the trailer, general praise on the fact it's a trailer and not a spoiler. Whereas Twitter has ppl think this is too basic of a plot premise ('forbidden lovers/friends' - although this is just speculation) and missed opportunities for environment design (e.g. they're elements but they just use regular public transport all in one lump) the things about the character and suggested narrative (e.g. this trailer has ppl side-eying ember and she appears to be the only fire character. having a fire character in world of plant + water could create some really interesting conflicts but ppl are speculating it's going to a cliche plot)",
        "This is giving me fire girl and water boy gb vibes :> loved every second of that trailer.",
        "water boy and fire girl the movie",
        "I love the part where an earth child saw ember and wave then the mother pulled him closer to her, and I just knew the earth people would hate her",
        "Everything. The lightings, the design, the way each characters act and every single thing about this teaser shows how great it is going to be. Can't wait",
        "I want to see mercury now",
        "Fireboy and Watergirl game, just",
        "Water. Earth. Fire. Air.\nLong ago, the four nations lived together in harmony. Then everything changed when the Fire Nation attacked.",
        "bruh why does Wade sound like a Minecraft youtuber? ",
        "I'm remember fire boy and water girl but they're switch genders.",
        "I wonder if it's \"fire is sad because she is bad-looked by the other elements but in the end she discovers she is useful for the ecosystem too and everyone is happy\"",
        "I would’ve never thought I would hear bakar on tv..",
        "Why is romance so glorified all the time!? Make a movie about an Ace guy or something, it'll be far better.",
        "I’ve noticed that she’s the only fire element on the train, and you can see some of the other elements notice and look at her. But Wade doesn’t look afraid, and I think this will have a big plot in the storyline. Like how Zootopia was afraid of predators, maybe they’ll be afraid of fire?",
        "Does anyome know how can I find the song?",
        "This song reminds me of the one in Casey Neistat's Emirates video.",
        "He likes the word moist ok, it's who he is. If you can't accept that then what's the point?",
        "Yang paling berkuasa mengatur seluruh dunia  &  akhirat adalah Pencipta Dunia.\n(semua manusia di seluruh dunia diciptakan oleh Pencipta yang sama.  Tapi di dunia ada banyak      agama      &  aliran kepercayaan serta ada juga yang atheis.    Siapakah Pencipta manusia   &  dunia ?   Banyak orang mengakui bahwa  Pencipta Dunia itu antara lain   :   Maha  Kuasa,   Maha  Kasih.     Maka  Pencipta  Dunia memberitahu siapa diriNya,  pasti  dengan cara yang sangat / paling mudah.      Supaya manusia bisa dengan sangat mudah juga mengetahui Pencipta  manusia).",
        "my name is wade",
        "Fire boy and watergirl reversed",
        "Ember?",
        "Disney doing an original romance story? I’d see this.",
        "i love the vibe! the music is very well done, and the character designs are amazing, as always :3",
        "What if elements had feelings? The clouds remember me of an older shortclip of pixar.\n\nAlso the \"I hear music on a train\" remembers me of zoomania.",
        "This looks absolutely amazing, I can't wait, Pixar and its animation is constantly evolving and the bond with Elemental will be even better.. I can't wait..",
        "Fire Boy and Water Girl: The movie.",
        "firegirl and waterboy",
        "Looks woke",
        "Similar to Zootopia\nBut can’t wait",
        "Wade and Ember! Ha! I don't get it."
    ],
    "comments_disabled": false
}