{
    "video_id": "-mwkAYKvypQ",
    "comments": [
        "Can you imagine a game releasing in a state like this back on the SNES or before patches were a thing? Yeesh",
        "“The game’s wavering performance did nothing do diminish the excitement of discovering the new Pokémon”\n\n“The developer gets away with it just thanks to things it does get right with the open world”",
        "Day 1 update should help with fps problems right?",
        "Those performance issues are brutal. The game looks fun but it's unacceptable to release a game in this state. I'm tired of this crap. And people need to stop being okay with games released in a poor state and hoping it gets patched.",
        "Gamefreak needs to go back to 2d. This looks horrendous",
        "Looks absolutely boring. Thanks for the review.",
        "Every Pokémon review I hear “it’s a step in the right direction”. After so many tries, it’ll never get to that final destination.",
        "I literally could not care less about FPS and I'm tired of every game review being obsessed with it, sorry",
        "Absolutely gutted with how bad the graphics can be ",
        "Wow it is really distracting how poorly this is running",
        "well shit.....sigh, I guess I'll keep playing Arceus I guess.",
        "Both mountable legendaries have ride-on/ridon in their names...hmm",
        "Ffs if they just updated that prehistoric switch hardware it could actually handle modern games. Of course there is a chip shortage but even so to make modern game development that much harder just to accomodate the switch is baffling.",
        "dont worry guys, emulation will fix this too. ghghghgh i love how ppl keep wasting actual money on games.. while everyone know the videogames era is over and atm there are like 2/3 GOOD companies out there. Nothing last forever guys... thank god we got elden ring before the great storm at least xD",
        "Are you kidding me? Another crab pokemon? ANOTHER CRAB POKEMON??\nThey're running out of innovative crab pokemon designs. This one just looks like a normal crab. Don't even call it a \"pokemon\" (pocket monster). Just call it a pokecrab.\nAlso the motorcycle pokemon design you ride will never not look incredibly dumb. What were they thinking?",
        ">Truckasaurus\nSee, this is why I trust you guys for game reviews",
        "Yall are so negative lol. This review was overall very positive aside from the technical aspects. Do you play Pokémon for the tech? If so, how have you stuck around this long?",
        "wont buy myself but if i am given as a gift or can get for free why not. Would LOVE to play this on steam deck!",
        "The gyms sound disappointing. I was hoping they would have implemented a scaling system which would scale up gyms based on the order they are taken on. Too much to hope for from Game Freak.",
        "The Pokemon main series stumbles yet again. Put a fork it in.",
        "It boggles my mind that the incredibly popular Pokémon franchise are okay with releasing games that look THIS bad lol\nI’ve played BOTW & in comparison, Pokémon games consistently look like they’re 10+ years in the past. \nLegends Arceus was so fun but looked like ass. Why can’t mainline Pokémon games look/run better & incorporate some of the new mechanics that worked SO well in Arceus 🫥 ",
        "glad I never pre ordered I had a suspicion this release would be the final nail in the coffin, I would rather they remade sun/moon or followed a similar world style (with better gfx) to sun moon i mean arceus wasn't great but the world was broken up knowing this was completely open it was obvious it was gonna run like a turd outta water",
        "…Tough crowd…",
        "I love how siglis can't do anything bc he's always trapped, It really made my day, I also love how he's just tormented! =O:)",
        "A minute in and this looks utterly awful.",
        "Hopefully the incremental improvements Pokémon has made on the switch continue. The system probably has a few year left of new games. It might get a true GOTY level game in 2025.",
        "THAT G DANG 6 FPS SUNFLORA ",
        "As someone who thinks the performance issues in games like SMT V are over exaggerated, my god this game looks awful.",
        "def a skip for me,i dont get the hype",
        "This game should have come out in a year. We literally had another big Pokemon game THIS year. They could have polished up this one for another year and made it so much better clearly.",
        "The footage speaks for itself. Glad your criticism turned out to be valid, since other apologist channels tried to claim you were lying or exaggerating or were playing a beta not representative of the final product.",
        "Honestly I think gamefreak should just hire other studios to work on the game while they come up with the \"story\" and new pokemon.",
        "Can’t wait to play it. Should super fun",
        "I cannot believe the game looks like this.",
        "still no bought legends arceus might buys it or wait fe enrage",
        "I think I'll pass on S/V. This whole time I've been watching trailers, I've  been waiting for something to impress me but to this day I haven't seen anything. Legends Arceus was more of a change to the formula than I think S/V is, and that's more what I'm looking for. At this point, I've accepted the performance issues as standard with gamefreak. I just want them to change the formula more and bot just slight tweaks around the edges.",
        "this looks absolutely horrid, why on earth would they even be okay with releasing this?",
        "Man oh man do some of these clips look bad",
        "Frame rate is soooooo bad.....",
        "Spoilers near 13:20 name of a pokemon that hasnt been  officially announced in the tm materials",
        "I was expecting this review to be scathing judging by the overwhelming negativity in the comments but it got a 7/10. \n\nI’m personally still looking forward to the game but those performance issues are unfortunate considering Pokémon games usually don’t have too many performance issues or glitches aside from occasional lagging.",
        "What the hell is that sandwich animation near the end..? That looks like it would be a bad phone ad.",
        "This is why I don't buy Pokémon games, minimal effort put into every new release. This is GameCube quality.",
        "Smt V was more bearable than this garbage.",
        "For 2022 and how successful GameFreak and Nintendo are, this game is simply unacceptable. It looks like trash graphically and performs like trash just by looking at this video alone. But bots will buy it and make them richer and give them no incentive to improve. Same thing happened to Halo, Call of Duty and Overwatch. These devs are liars and thieves.",
        "Still boycotting until they get rid of forced exp share ",
        "It’s also time for Nintendo to make a much more powerful switch 2. It’s 2022. Sub 30fps and 540p-720p res especially with graphics this bad is a joke smh",
        "OOF this is a new low level for gamefreak, those sunfloras, the wind hill and the NPC walking on 3 fps are hard to watch.",
        "I played Pokémon ruby and sapphire on Gba (my last Pokémon) and I feel I haven't really missed anything.",
        "The reviewer: \"The performance did nothing to take away from the excitement of pokemon..\" \n\nThese comments: \"Performance is trash, game is thus trash, skip, lulz\"",
        "Yeah.. No. Maybe later.",
        "This is a game in 2022 by the biggest franchise on Earth, and it looks like a ported GameCube game. I'm so tired of the incompetence of GameFreak.",
        "Can't trust what Alana hypes up about",
        "The graphics and performance look a joke.",
        "If you enjoyed Sword and Shield, and don't mind the buggy mess that it currently is, then you could buy it.\n\nCould.",
        "Welp. glad I checked this before I got any more tempted to get S/V. As soon as I saw all those sunflower pokemon running at once at a chopped up frame rate, I could tell it would be a waste of money.",
        "gosh this game is so ugly",
        "I’m sorry, I’m not really interested until they stop being stuck on releasing a yearly handheld title",
        "I had to choose this game or Xenoblade 3.....It sounds like ill be happy with XB3 for now....",
        "It's still a positive review, really the only bug issues I see with all reviews are in regards to performance which kinda sucks but that's not why I play these games\n\nPeople saying the game itself is trash aren't listening to the actual review",
        "I don't think I can give Game Freak any more of my money. I did buy Legends Arceus, and it did a few things right. But overall, it left so much to be desired. These games could have came out 10 to 15 years ago, and still be dated.",
        "Can't Marry Nemona 0/10 Trash Game.",
        "HOW IS THIS A 7/10 AND SONIC FRONTIERS A 4/10, I SWEAR THERE'S AN AGENDA AGAINST SONIC",
        "I've seen games with a fraction of the budget and tiny team have better graphics, gameplay and performance. Looks like a fan game tbh.",
        "Runs abysmally but expected",
        "It just a complete rush job. They should've held it back 12 months.",
        "Crazy how we got a game that performs and run like this but also got games that can run 60fps continuous cut with beautiful graphics like gow ragnarok. Crazy how 2 companies can have such different approaches and passion and the bad one is the bigger one lmao",
        "Why does it look like it’s in early access",
        "So you say frame rate was almost a deal-breaker....but it wasn't because there are new pokemon?",
        "I don't think any more Pokémon games should be made on Switch. The next game should be on the successor system.",
        "Jesus those drops..",
        "Guess I’m waiting for a sale then",
        "Looks like crap ngl",
        "I've been on the fence with this one after experiencing a bit of Pokemon burnout from Arceus. With the framerate issues on top of Scarlet/Violet leaving out some of the better features included in Arceus (sneaking, tossing pokeballs to catch, and it looks like also the visual/audio cues for shinies appearing in the wild), I think I'll give this a pass. Instead, I'll look forward to a much better, more complex game hitting Switch in just a few weeks: Siralim Ultimate. For any Pokemon fans who haven't yet played Siralim, I highly recommend it. It's like Pokemon for adults... even though I'm an adult who also likes Pokemon, ha. In any case, that game offers far better value, more complexity, etc than this one. It also scratches that \"gotta catch 'em all\" itch. I'll put a thousand or so hours into that, rather than a few hundred into this. All for a much lower price.",
        "If game freak doesn't issue a patch for the awful frame rate, I will lose my shit.",
        "Looks like @BabishCulinaryUniverse will be busy recreating some food",
        "This game would have been good if it came out on the GameCube or the wii. But at this day in age, it somehow doesn’t feel like a new or next gen Pokémon. \nBeen waiting for an open world 3d Pokémon game since being a kid, and somehow it’s still looks utterly dissapointing",
        "Only Nintendo fans buy something like this in 2022 :,D",
        "Well dang I thought this was finally the Pokémon game that got me back into the series, but nah, I’ll pass. Didn’t even play Sword and Shield because it didn’t seem excited or fun. ",
        "“For us the developer gets away with it.”\n\nThat’s just… sad. Each generation since black and white has been worse and worse. More and more taken away. Now the games just flat out struggle running. And fans just let it happen because… nostalgia, I guess? No other dev would get away with this. Gamefreak has never responded positively to feedback post-launch, so if you honestly think they will, maybe temper your expectations. This is just sad.",
        "Wow..this game looks bad",
        "It's honestly pathetic that something as huge as Pokémon has such lazy and souless devs.",
        "Definitely not paying $60 plus tax for this also geez it’s dam near 2023 and still no voice acting ️",
        "I think I'll just get Temtem instead",
        "I remember when you bought a finished game, buying a future patched game is not my thing.",
        "For those who want to justify with \"b-but Switch\" please look or (please) play the 3 Xenoblade games on Switch\n\nThese games are in every possible aspect more demanding than Pokémon, and have a lot of shit happening with a great performance, gameplay, soundtrack and graphics all on Switch.",
        "There are no excuses. There are 3 Xenoblade games with huge, detailed, dynamic open worlds with shit tons of things going on at the same time, BOTW, Bayonetta, come on.",
        "The game should be at least 60fps  damn",
        "Jesus Christ, get rid of game freak already and give Pokemon to another developer who will actually put some effort into for once, with great visuals and good performance.",
        "damn this game looks like a powerpoint presentation",
        "Honestly I've played undocked for 18 hours now and the game looks amazing to me, almost no technical issues. Except for a few times in the academy city",
        "I love how she gets inspired by movies, anime, and all types of popular tv shows to just keep us entertained. We love you Jess",
        "They should have kept legend arceus graphics",
        "As a competitive player I’m very glad I don’t have to deal with any of this",
        "You would think with a game that looks so boring visually they would at least figure out how to make it run.. But they don't care, suckers will buy it either way.",
        "Not the goofy ahh sound effects",
        "Genius Sonority should replace Game Freak!",
        "Jesus christ how can the graphics look like a wii title and still stutter so much",
        "Nintendo needs to upgrade their hardware for real what's wrong with these people they multi billionaires",
        "I’m very, very concerned about what’s going to happen when online co-op launches, I can’t imagine the performance being any better in that mode and I don’t think people are going to tolerate an even choppier framerate",
        "Those frames at 30s, the Pokémon are moving at 5fps ",
        "Is it just me or does this game look like one of those Pokemon knockoff mobile games.",
        "I can't believe how terrible this AAA game from one of the most profitable companies in the world looks. \nGames from the (glorious) Nintendo Game Cube look years ahead from this graphic quality, and they came out 20 years ago in a 3 generations-old machine! \nXenoblade games and many other titles are a testament to the raw power the Nintendo Switch has. The hardware is no excuse. ",
        "Toby Fox (undertale creator) does music for the new Pokémon!!!???",
        "The graphics and performance just look god awful. Lol. Simple graphics don't have to look this ugly.",
        "I remember watching this for the first time and knowing who techno is, it felt surreal. it's like one of us, the guys who grew up watching the Skydoesminecraft generation of YT. he wasn't even really \"Minecraft famous\" at that point. but there he was, stabbing ALL OIF THEM. it was epic. I couldn't believe it. \nI'm almost the same age as techno and it really hit hard how easily it can all just stop.",
        "This is all about the setup for Generation 10",
        "If pokemon went pixel art 2d i'd be back on board. The 3D doesnt look fun in the slightest.",
        "The j is an h sound in naranja",
        "I still don’t understand how game freak manages to produce such low quality games, especially when they’re only developing for the Nintendo switch.",
        "I’ve played the beginning of Pokémon Legends but hearing this makes me want to finish this game first before finishing Legends",
        "Seems like another one of those - dump your game and emulate kind of games... or use jailbreak and overclock the Switch in hopes of it helping. Since overclocking didn't help with Bayonetta 3 all that much because of the Switches awful memory bandwidth.",
        "I think the company rushes thier employees, they are vomiting out pokemon games so fast",
        "nintendo life was to generous this game deserves a 6 for having so many technical issues",
        "EDIT: I just overclocked my switch and it’s running pretty well, reminds me of Botw graphics and performance maybe? closer to Arceus, but yeah it’s pleasant when overclocked \n\nI’m playing it right now on a modded switch and wow it’s actually bad, a shame because apart from the tragic and unacceptable performance it looks very fun",
        "Seems I will once again be buying the game 'used' locally so that I am not paying full price for a haphazard game and not putting any $ in their pockets. Stay petty, trainers",
        "Here's my thoughts after getting it early.\n\nIs it a good game? Sure???? Are there some major issues in presentation, technical state, balance, design, game play and more? Absolutely! This game is a huge step forward from sword and Shield but several steps back from what Legends had done. The fact that the battling system is just as poorly done as sword and Shield is a huge flaw in this game when Legends had almost perfected turn based combat in the series. It's slow, sluggish and has serious balance issues due to the open world. You could hit a gym that technically should have been the second but it's your last and you stomp the gym with no problem. Or you could hit a brick wall due to the gym badges limiting how strong of pokémon you can catch and have them obey you. I'm at the 7th gym and I can only catch pokémon under level 50 despite the fact that the gym is hitting in the low to mid 50s in levels.",
        "No buying this garbage.",
        "How many times are we going to say \"Well its not realllly there yet but it means pokemon has a promising future\" until we admit pokemon is consistently behind the times in terms of game design and quality.",
        "I had my suspicions, money saved. Thank you",
        "This game is infuriating and garbage.",
        "Man those characters animated at 5 frames per second are jarring.",
        "Guess ill pirate it",
        "Damn, just watching the video this game looks like it runs in slow motion. Such a shame.",
        "At this point it’s unforgivable how bad these games are. Every generation seems to be a step in the right direction but like cmon now! They’ve had too many steps! It’s inexcusable.",
        "How does it look this bad.... like there are too many technical differences between this and botw to compare but like, that was literally the first game on the switch and its a HUGE game. Game freak I'm begging you...work with game companies that focus on performance.. stop making ur own code! U have great game ideas! Focus on those! Outsource ur coding plz...",
        "I pre-ordered yesterday for THIS?!",
        "I’m sorry but wtf gamefreak. This is embarrassing. There are games that look better on the Xbox 360. These frame rates just aren’t acceptable.The switch can handle much better looking games smoothly so this is clearly a developer issue. Nintendo should have never let this game release and should have forced gamefreak to work with another studio to fix the performance issues… really hoping a fix comes out soon for this games seriously rough performance. This was gonna be a day1 buy for me but now? I’m holding off. And I hope other people do as well. Nintendo shouldn’t be rewarded with great sales when this is the quality their willing to release to people.",
        "I’m still going to play but I will stay I’m disappointed the performance is so poor. I could forgive Arceus because that was such a big step forward for the franchise but it seems like they did not make an effort to improve. It’s moments like this where it feels like GameFreak doesn’t care about the fans after all the years of supporting Pokémon. Real shame.",
        "There's nothing in the overworld? Like really? How can they do that really is it so hard to make a tower that has a legend or a myth like they did in DPPT or HGSS",
        "\"Fixing this with patches\" only worked in Gen 6. And that's because they HAD to fix a game breaking glitch that destroyed your save data. \nUntil Nintendo develops new hardware, this will be the staple of how Pokemon games work for the Switch.\nAnd with the president of Nintendo wanting \"Players to continue playing the Switch for years to come\" That doesn't sit well with me.",
        "Gamefreak still using a Wii development kit. Somebody buy them a newer one, they can’t afford it",
        "4:07 PAIN  THE FPS is unbearable",
        "highest grossing media franchise ever btw",
        "A 45 minute video from ACookieGod??? Yes. Im going to watch it all @12:30AM. Youre the best. I love you :",
        "Honestly gamefreak should be ashamed of how soulless they are. They puto in as little effort as is possible to still make a profit.",
        "This is an absolute embarrassment and inexcusable. Sure, the Switch is showing it’s age, but we’ve seen many examples of open world games running well on it. \n\nI think this falls down due to Gamefreak’s laziness and/or incompetence. More so the former as they know, regardless of how poorly optimised the game is, it’ll still sell well.",
        "So to add to my previous point, I genuinely think that if the performance is so bad that it is a noticeable detriment to the playability and user immersion of the game, then reviewers should be giving the game very poor marks across the board. That goes for IGN, NintendoLife, _insert review outlet here_. It doesn't matter how much fun various aspects can be, if certain aspects really weigh the game down, then the game should really be getting 4s across the board. Then when Nintendo comes knocking wondering why nobody's buying the new Pokemon game, they have the evidence before them. I don't really know how else to get the message across, because it seems like Nintendo and TPC just do not and will not care otherwise. A 7 just isn't scathing enough.",
        "I don’t really get why people want voice acting in these games so bad lol it would be terrible",
        "oh my god the performance looks atrocious",
        "are those sunfloras for real?!!? yikes!!!!",
        "Is it hard to make a open world game for switch like xbc3? The game for me is a\nMaster piece for the hardware they had in hand… come on gamefreak step up your game.",
        "Why is fps so important  to some poeple",
        "lol. lmao.",
        "i hope in a few patches they'll fix the performance, atleast to a somewhat stable 30.",
        "Sounds like unfinished trash just like Arceus. Wish they would actually take more time on their games.",
        "This game does not look good, I may just buy Brilliant Diamond instead of this. It just looks like Pokemon Company gave up on creativity years ago.",
        "that framerate tho",
        "1:27 Oh... MY God what a wonderful showcase of how unstable the open world is.... A whole lotta pop ins, sluggish, and downright bad stuff happening in the background... Lets recap here shall we\n\n1. Once again not even the slightest intentions of voice acting...",
        "The 'Step on the right direction' saga. I don't get why this traditional and consistent dissapointment sells that well, with only the promise than the next one will be better.",
        "Pokémon died a long time ago",
        "God the framerate looks atrocious",
        "and we thought sword and shield had a rough start...",
        "Yeah I think I'll hold off on buying the game for now and see if they are going to bother patching the performance of the game or at the bare minimum wait until I can find the game used so that way I'm not financially supporting the state this game is being released in.",
        "Well, thanks. Gonna stay with fireRed, soulSilver, Y, Moon and Arceus. But why the Legends one feels so bland, grey and boring....",
        "7 out of 10 for the biggest franchise in the world is not great, let's be honest. After watching several reviews today, the pop in and frame rate issues are pretty distracting. While I get the Switch is aging and we seriously need a Pro model to bump up those framerates and load ins (Hyrule Warriors needed it way before now!), Game Freak are once again sadly showing their budget and staffing doesn't match the quality and depth the franchise should be getting...",
        "Now this is a game I'm definitely not buying, not even in second hand or at a discount... it looks horrible and probably plays horribly as well. I'll say it cause the reviewers cannot, but it looks like a shitty game because of this. Pretty sure they could do way better, but they won't and the fans will eat all of it without a second thought, so this kind of development will continue further into future releases. To the people that will buy this game, good luck, hope you enjoy. If you do not, learn not to pre-order, specially a Pokemon game.",
        "I can't get over how jaggy everything looks with a lack of AA and in general, the peformance is just sad. Typical modern Pokemon...so frustrating.  Thinking on some of the technical feats on Switch, this is just so sad. At least you can make a sandwich though..",
        "GameFreak should adopt the Xenoblade engine.",
        "pokemon powerpoint",
        "Even the health bars just remind me of a Roblox game (from someone who only played Roblox once)",
        "Just wait for the day 1 patch. Why is everyone so quick to review before the official release date",
        "This game is a joke, right?",
        "Game freak wanted to develop this game as quick as possible and it just shows...",
        "Pokémon fans: don't play this crappy game challenge (ultimate difficulty)",
        "cant take it seriously that they put a 60$ price on this piece of garbage, you just cant even defend it",
        "So relieved I didn’t pre-order this.",
        "The game looks so bad it’s hilarious",
        "The technical issues are certainly emblematic of Game Freak's general quality bar, but it also has to be due to the limited Switch hardware. This year has shown the Switch really struggling technically and I think i'll wait to play games like this until new hardware is available. Hopefully TotK will still run well...",
        "Ugh... I really really really want to like pokemon, but holy hell. They managed to worsen performance and neither the environment or animations look better to compensate. They halfway backpedaled on Legends Arceus' very solid gameplay loop. And while Terastallizing might be the most competitively interesting gimmick of the last few generations, the stupid little generic hats and accompanying bad \"crystal\" visual effects will never compete with the intentionally-designed-to-be-cool mega evolutions (and to lesser extent gigantamax, though regular dynamax was kinda boring too).",
        "I know everyone expected this to build on the barebones, proof of concept game that was arceus. But it seems like they didn't take the best parts of that game.....which seems extremely odd.",
        "GameFreak has no shame at all, they don't give a F at all at this point, it's amazing ahahahah",
        "I wish Nintendo would hire another game studio to make mainline pokemon games, and maybe cycle between Gamefreak and the new studio... this would create a sort of competition and would inspire and motivate the studio's to make the best Pokemon games",
        "INSANELY happy to see Mick getting the redemption he deserves. A subreddit I was in when this all went down two years ago crossposted the original letter and was full of comments like \"That sucks, I always liked his songs\" or \"I always knew he was a hack\", etc. Going back to that subreddit now, there's no mention of Mick's response. It consistently surprises me that people buy in to the very first side of the story when it comes out, no matter how unbelievable it is.",
        "Skip to @16:13 for a real review.. not another \"pass\" at a franchise that gives nothing back",
        "Naranja is Spanish for orange  and uba is grape ",
        "We keep rewarding garbage efforts from Gamefreak. They won’t care to fix things as they just rake in the money no matter what",
        "Bro that performance is hilarious",
        "It bothers me how Sonic Frontiers got a lower score than this. Nice review though.",
        "It’s a shame my favourite franchise is stuck on the switch with 900 year old hardware. I can’t imagine what Pokémon would look like if it had always been developed for PC or other consoles.",
        "It's always a step in the right direction because GF always take several back steps every Gen. This game is a shame and insult to consumers.",
        "Did not think I would hear a 'Bottom' reference in a Pokemon review in 2022 but here we are",
        "Looks like a fun game If they can fix the performance issues then sure i am gonna buy it .",
        "Disappointing.",
        "Im 40 hours into No Mans Sky on Switch….the performance wont bother me",
        "Its unforgivable how the most profitable franchise in the world keep making such shitty games. Pokemon has so much potential tho.. This looks like a freaking ps2 game. How the fuck it doesn't have recorded voices?? Its 2022! Besides, the game is easy so that a 5 year old with mental disabilities can beat it, and the battle system is still identical to the first game from 30 years ago..",
        "Mandatoryquest, is that you?",
        "Gotta give them Props for stepping outta there comfort zone AkA old ways watching the game evolve just like a Pokemon its very amazing thing to watch over the decades.",
        "I believe they will release a day one patch with 1gb size update. Hope this will fix the issues",
        "wow that looks like it runs on 5 fps lmao",
        "Jesus Christ.. The part with all those sunflora's is painful the watch. It's like your switch is choking.. Desperately gasping for some fresh air..",
        "That's probably the worse performance I've seen from a triple a game ... With new releases like bayonetta and xenoblade Chronicles 3 this is just pure lazy in every way .\nZelda looks and run better and that's a basically a Wii u port .",
        "I see alot of folks saying its a step in the right direction, so imma wait until they actually get there.",
        "So glad I waited for the new Pokemon games to come out so they could lead us into \"the right direction\". Only 12+ more years tops!",
        "If nintendo life is saying how performance is making game essentially unplayable, then please nintendo start expediting the new hardware that we know you need. In the meantime I hope gamefreak gives it a patch.",
        "How are you reviewing a game before it even came out ",
        "Why was the original upload deleted? Lol",
        "I didn't expect stellar performance...but wow...I would ask how anybody could release a game in this state, but then I remember it's Pokemon so it will still sell millions even at 10 fps. \nI've been excited for the game but after seeing that performance it's really put a damper on that excitement. Feeling a lot more patient to play than I was before.",
        "I loved the design of the Mermaid. Kinda sad that they didn't spend that much time with the fates. So many interesting female characters.",
        "im excited for the game but my question is hooooow did this happen when they make so much money? how does the performance suffer this bad. i just dont get it i really hope the performance doesnt take me out of the immersion.",
        "Pokemon makes more money than some countries... and yet... why is it that all of their games look like they are built on the budget of an indie game? Hell, I've played indie games that look, play, and sound better than Pokemon Games. Game Freak has all of the resources to make something amazing and they choose to continue to make the same bland thing over and over again for the obvious reason of they know people will buy it no matter what so why bother putting actual effort into it. Look, I love Pokemon and I think that there is some stories and things that this world can tell but these games aren't it. Don't fans deserve something so much better at this point?",
        "Like many times in the past towards the end of a console's life, this game yells that it was originally created to be released with the switch pro or second generation switch. The next switch was Probably delayed due to a shortage of parts because of a pandemic. Either way, I truly feel like the second generation Nintendo switch should have been released this holiday and was probably held back a year so developers had to struggle to work with a underpowered system like they did when they converted dozens on Nintendo 64 DD games back to regular Nintendo 64 cartridges. Just my guess.",
        "Pls don't tell me the sunflora run like that in the game with like 10 fps? ",
        "I think I'll buy the game then emulate it to potentially fix some of those performance issues. Either there needs to be better optimization, or we need a new fucking console.",
        "That footage of sunflora running is embarrassing. How does the biggest media franchise on earth release products like this? I don't understand.",
        "I have been a huuuuge fan for over 20 years and I truly do not care about games being technically advanced. I still need to play the game and decide on how I feel about this, but what has been shown in the videos would understandably take me out of the game. Those sunfloras have been an issue since the reveal trailer and they still are on launch. If I have to expect such performance throughout the whole game... I don't know. I won't say the developers are lazy or whatever, who knows what kind of schedules and working conditions do they have, but to me it's clearly an issue that such a franchise would present this as a finished main line product. As said on the conclusions, it looks so VERY unpolished...",
        "Hate that the Legendaries are actual mechanical bikes with exhaust systems. It makes them feel less like legendary monsters and more like cybernetic beings designed to serve humans.",
        "I was already going to buy it now I'm going to buy it just out of spite. For stupid B reviewers who keep putting ****ing graphics over fun in their reviews.",
        "Damn",
        "And, once again, the apologists who claimed \"they still have time, they will iron out the technical issues\" were wrong. Like they were also wrong with Sonic Frontiers. Like, you know, they are always wrong. Lol",
        "Looks so laggy",
        "Nintendo needs to follow Playstation and XBox route and release games on PC. Sure we got emulators but would prefer an optimized experience from Nintendo, Plus it would sell. Imagine a Pokemon game designed from the ground up for PC, how well it would run on steam deck or Nintendo's future more powerful platform (I don't expect them to move away from handheld)",
        "I’m really hoping it will run well enough to enjoy. It’s Pokémon, doesn’t need to be 60 frames per second or 4K for me to have a good time. But I would rather it didn’t chug along at 10 frames per second. Let’s cross our fingers for a few patches in the first week that clean things up.",
        "if you want a good pokemon game please save your money to show them that they cant fool their fans anymore and start playing games like pokemon reborn or pokemon insurgence. so many romhacks and fangames are so much better than gamefreak could ever",
        "The texture- and object popping in is horrible.",
        "The transition from the Pixar lamp to the boat train, that was incredible",
        "If Xenoblade Chronicles 3 can run on Switch there’s no excuse for Pokemon looking this poor. \n\nThree Pokémon games in a little over a year sounds cool on paper but I wish they’d slow down and polish up their games instead of rushing them out in an unfinished state like this.",
        "Theres details like wild pokemon cheering you when you battle in the wild, the sound of rain when tou take refuge under a sombrilla, the message spoiling switch pro on the player’s console on his bedroom….\nAh, and the fact that every single pokemon is textured now…… almost nothing",
        "Thank god for Alex's voice of reason at the end of the video. \n\nPokémon fans deserve better. This is just getting ridiculous. I called out GF when SW/SH dropped and stopped playing the series because I didn't like the direction, and people said things like \"Give them time it'll get better\". How many more mediocre games that are a \"Step in the right direction\" will it take for there to actually be a great Pokémon game again? But it won't matter, this game will be yet another top 10 selling switch game and fans that actually want the series to get better will be dying in a ditch somewhere.",
        "I would say its worth playing, but has it is right now only if its on sale around 30-40€ cause with the performing issues and with Gamefreak knowing about it and still has the balls to sell to the customers is just a massive disrespect, but is good cause that way we can see how fans will defend the company and blame other things like the console for a terrible optimization work by gamefreak, thankfully i followed my guts and didnt buy the game cause i had a bad feeling about the game, probably in a year i will get it when dlc's drop and buy it has a pack of course if gamefreak fix the game or else i will skip it.",
        "I am so glad I did not preorder this and put my money on GoW instead",
        "Jesus that sunflora scene looks like fall guys on switch lol",
        "Thank you for the honesty at the end. I'm tired of these \"let's not be too mean\" reviews. The game is an utter mess. Game Freak does not know how to make rich open world games. Going off their track record it’s unlikely that they’ll fix much if any of the performance issues. This is perhaps one of the worst Pokemon games in the series.",
        "I never played pokemon games, and planning to buy this one, I have a stupid question to ask\ndo you ever get to play with gen 1 or gen 2 (basically older pokemons) in these new ones? Or each game comes with a new set of gen pokemons?",
        "Seems like people are disappointed with the performance and low frame rates \nI'm gonna play the game laughing at the 10 fps Sunflora \nI think it's funny",
        "its a skip, those fps issues are egregious and need a higher critique after 5 games in, 160+ workers directly at GF divided in half and it shows, the games are too big for their small group that haven't ever gotten 3D completely right\naudience excusing it doesn't mean its fine to have, especially given their brand loyalty to excuse issues by brand bias",
        "I like the pokémon games and i loved them when I was younger. Pokemon silver was may favourite one. But all the switch games have been pretty average at best. I would say I actually liked let’s go the best and that’s probably only because of my nostalgia  for gen 1. It should be so easy to make a good pokémon game and to be honest with the budget they have now there is NO excuse for not having voice acting even if it was in Japanese only with english subs.",
        "Arcues legends will still be the better Pokémon.  I’m calling it rn",
        "Gonna be great on emulators ",
        "We need to start rooting for TemTem to become a threat to GF/TPC. This is beyond ridiculous, they need to start developing the mainline series with more time on their hands otherwise we'll be stuck with this quality for the next 5 generations.",
        "I don't need to bathe my pokemon I don't need to bathe my pokemon I don't need to bathe my pokemon\nI won't spend 60+ dollars just to bathe a whooper",
        "they need to go back to pokemon xd and colosseum type games",
        "The open world textures look like something from the N64 era.",
        "So long as it’s not worst than S&S wild area I’ll be fine. No I don’t like it’s this bugged & stuff, but my hopes weren’t ever high for this game. So long as I can find some level of enjoyment then I’m fine waiting for a patch down the line. ",
        "A friend in college said she went to one of his shows in Toronto, she liked some songs he played, but the crowd had to sing literally entire songs for him. She described it as \"I forgot the entire show right after I saw the show\". Definitly one of the performers of all time.",
        "The only problem I see Pokemon having is frame rate wise but it's trying",
        "PLA and SV being described as steps in the right direction is a bummer cause I want a new game that is THE definitive experience rather than being something that a future game can benefit from",
        "I think at this point we genuinely dont expecting graphical greatness from pokemon games anymore lol",
        "8.3? it looks and runs like complete trash.",
        "Why do adults still buy these games, just play the ones you're nostalgic for they're probably better",
        "This seems like a massive step backwards since Legends Arceus. It looks so disappointing.",
        "Im really hyped about getting this game since it's gonna be my first 3d pokemon game",
        "3d pokemon is just a failure with switch… going back to HG",
        "I don’t understand why Nintendo doesn’t have Monolift soft helping the Pokémon company out to optimize these games… It’s probably because they’re always rushing to put them out. Really, the Pokémon company needs to start getting some consulting firms in there to help them evolve their formula and push the games into the modern era (especially considering they have the largest IP on the planet)",
        "Which would you say is the better game? Legends Arceus or Scarlet/Violet?",
        "I love how GameFreak managed to get this running at 15fps....\n*slow clap",
        "They should've married the Let's Go feature with the option to catch Pokemon more easily instead of just auto-defeating them. Sounds like a missed opportunity.",
        "It sounds like a good game but the technical and graphical issues are big. I’ll get the game but they better sort out these issues in the next main line series. The story sounds better than Sun/Moon and Sword/Shield. These games are just a blur in my mind, hopefully this one will stick.",
        "Buying used copy then",
        "Only legends know this is a Reupload",
        "It's back!",
        "Damn. The games looks horrible. Looks like a mobile game",
        "glad someone else saw that reddit post! I was amazed that someone suggested it before hand and no one talked about it.",
        "Of course they aren’t.",
        "the biggest franchise in the world should have AAA budgets, production times and optimisation. instead we get uninspired visuals and a technical nightmare alongside a few bright ideas. if TPC want Game Freak to make massive games on an indie development cycle and schedule, revert to 2D pixel art and give us a massive Pokemon experience that will at least run well on Nintendo's own hardware. still waiting to buy a compelling Pokemon title on Switch (New Snap does look good though)",
        "Been playing Scarlet from the first day it was leaked, have been having fun with it (a bummer more Pokemon aren't in yet again though) and have also indeed seen the slowdowns & other issues. Wild pokemon stuck in buildings & other things (like that lighthouse at the start of the game), the Pokemon that are walking with people, walking through the ground & on the air, along with some NPC's doing an odd rather quick 360 spin at times during battles. But the slowdowns, are the worst bit. But that's games nowadays for you, releasing in broken states & fixed later. Is also far too easy to level your pokemon up just as it is in Sword & Shield, my Meowscarada is already level 95 thanks to those EXP candies, and very soon will be at level 100, thanks to the same things. And since TPC makes utter boatloads of cash, has virtually no competiton, they will keep slacking & not properly innovating, as they have for years.",
        "I like how low Pokemon fans’ standards are when a new game releases with low frame rates and performance. No wonder people are hyped for GOW Ragnarok and Elden Ring",
        "If Monster Hunter Rise can run as well as it does on the Switch then GAMEFREAK can totally fix it. \nThe question is…..\nDo they wanna fix it?",
        "inb4 this trash can of a game sells 30 million copies proving once again that pokemon fans have no standards and that Game Freak still has 0 incentive to ever change their ways.",
        "3:58 the reduced framerate animations on the Sunflora say everything I need to know. Amazin.",
        "Damn this even runs worse that ARCEUS, GameFreak got totally lazy",
        "I'm getting it regardless because my friend is getting lol. But at least I'm prepared for what I'm getting into. Thanks for your honest input!",
        "Game Freak needs to get hire someone to handle their 3D and open world because it seems like every decent idea lacks polish. If memory is an issue and they cannot possibly put in a national dex then they really have to focus on the performance. The formula was old, but most fans could care less. To many half baked gimmicks, too many stale designs, too many shallow stories and now a boring open world. Gold and Silver were so good, the remakes were amazing. Ruby and Sapphire were probably my favorites. They either are overwhelmed, over confident, overworked or simply creatively bankrupt and don’t care. Either way, I had so many doubts about this game and was slowly won back when I saw what they cooked up. But really? This is their second go around and it feels like they did a cram session the night before release. Seriously, C- work for anyone else, but for a “AAA” company this has to be like a D.",
        "I wish this game played more in the style of Legends Arceus tbh. Catching and starting battles in that game felt amazing to me and smooth. This still feels restricted in gameplay.",
        "I am a massive Pokemon, I pretty much love all of their stuff, but my god this is saddening to see this type of performance.",
        "That's a pass for me. I'm tired of the lack of innovation and investment in this franchise. I changed, but the franchise never did - and that's not a good thing.",
        "Honestly GameFreak needs to stop putting out a Pokémon game every year and just focus on making ONE set of games that both accomplishes their open world ambitions AND doesn’t look or play like ass.\n\nLike I’m sure people will be patient. Look at Zelda fans, we’ve waited almost 6 years for Tears of the Kingdom and that game is STILL going to sell incredibly well. Why? Because it looks polished and we know Nintendo won’t skimp on the quality or performance.",
        "Pokémon coliseum on GameCube looked 10x better",
        "Can't believe that Sonic Frontiers came out twice this month (bad performance, great ideas)",
        "They seriously need to go back to sprites. They do those better, can include all the pokemon again, and there's plenty of sprite based games that come out in the modern age. Why do they think they NEED 3D?? Imagine a 'Link to the Past' like open world pokemon game.",
        "NGL, the concept and the direction of where pokemon is going is amazing. I mean back in 1999 I was thinking to myself \"man... wouldn't it be sick if they could make a pokemon game like Mario 64 all 3D and stuff!\" 20 years later they finally got here! However, them frame rate drops and graphics just don't make sense. I mean, I know they can do better. Looking forward to the next gen console and next gen game. It's going to be a pass for me on this one though. I'll just youtube watch it.",
        "Its 2022, no reason for games to look like this anymore",
        "Good thing I grew up playing Pokémon on a emulator on a shitty ass pc",
        "I was debating whether to get this or Xenoblade Chronicles: Definitive Edition. This review settles it. Xenoblade it is! \n\nThank you for your honest review!",
        "I understand people when they say performance doesn't stop them from enjoying a game, but Jesus Christ man. I don't understand how people are willing to spend $60 dollars for a game that runs like crap.\n\nI understand the switch isn't super powerful, but it can literally run Xenoblade 3, SMT V, Astral Chain, and BOTW at a stable frame rate 90% of the time.",
        "Since PLA and S/V were being made at the same time, i hope that whatever they are doing for their next game (Be it another Legends game ) takes a lot from PLA (catching mechanics, sense of wonder) and marries it with S/V to create a game that is just fantastic. It seems like Game freak didn't think that PLA would do as well as it did, and so i hope they are starting on... Legends... Rayquaza? I know if i had a choice, I'd rather play a Legends game than a mainline game, but if they took both and put them together, I'd 100% play that",
        "lol looks like a cheap mmorpg",
        "Every Pokemon game is a step in the right direction.... but look, we don't need  another step, we need a destination.",
        "How can Nintendo accept such terrible performance? they own a part of the ip and the game is nearly unplayable which will hurt the ip.",
        "There are just so many things I wish these games were offering by now. \n\n\n\nPokémon just feels like a mindless hoarding game. You don't do anything with the creatures you collect except for battling and maybe the stupid camping feature. I want to feel a connection with them. I want to use them for traversal, exploration and for solving riddles. I want fire types to burn bushes, fighting types to smash rocks and ice types to freeze waterfalls etc. I want to ride my own Pokemon. I want to interact with interesting NPCs that give me sidequests that are fun. I want dubbed cutscenes. I want Pokémon to actually live in the overworld and not just idling and walking aimlessly. And for the love of god GameFreak needs map designers and storywriters. The past few iterations of these games just felt so unambitious, but then people are going to say it's a game for children. But in my opinion, children deserve more.",
        "The shade of putting the sunfloras scenes at the beginning of the video looool. That's fair though",
        "Just sucks these games still have the production values of a shitty 3ds game smh. Look at breath of the wild from over 5 YEARS ago and compare it to this smh. This game looks atrocious. Still no voice acting, still no proper animations, they just fade to back because too lazy to actually animate cutscenes etc. ",
        "Been playing since red and blue, but this will be the first mainline Pokémon game I’ll have passed on. Despite the bugs and glitches the new Pokémon are just hideous looking. Like they hired a 3rd grade class to doodle them.",
        "Having been someone that has been playing the game for about a week now. I think you’re over exaggerating on the performance issues. I didn’t mind the minor performance issues in my experience and overall REALLY enjoyed the game. The best Pokémon game imo.",
        "As long as I can capture pokemon again I'm happy",
        "Some of that footage from the game almost looks like stop-motion animation, which would be cool if it were intentional... but we all know it isn't.",
        "Why is sunflora so rough",
        "Being completely honest, this sums up my thoughts about this game. Underneath the issues, it's at its core a very solid experience. On the other hand, the performance and graphical hinderances holds the game back.\n\nIt's a shame because I will argue that in terms of the rivals they're probably the best in the series, each one having their own little arc that all connects to the end-game which you get to see more interactions with them and learn more as you go around parts of the game's conclusion. Everything about this game in terms of it's narrative while simple it's also charming, which honestly I'm fine with considering I'm not expecting too much out of something coming out as complex.",
        "It's amusing that nobody even mentions the lack of a national Dex anymore",
        "Ooof. Alex's comments at the end are rough. I loved Sw/Sh for adding some open world elements to Pokemon and for its giant stadium battles. I loves Arceus for completely changing the pokemon formula in an extremely positive and fun way. This game has excited some of my friends for being completely open world and having co-op, but I've been more hesitant due to the designs and removal of the stadium battles and for walking back Arceus's open world battle/pokeball system. This review doesn't change that, and Alex's comments at the end make it just worse (I mean, Arceus and Sw/Sh have some issues, and this runs even worse?)",
        "This game looks like it was released for the nintendo switch 2 and this is a bad backwards capability port.",
        "I have a question. Were the day 1 patches offered to the reviewers?",
        "Wow! I knew that performance was going to be an issue, but this is rough. The 24fps choppiness is starting to hit PS3 era levels of performance. But I'm sure this will sell like hot cakes because it's Pokemon. ",
        "This is giving too much praise. It looks like it is even lagging in a normal Pokémon battle.",
        "Damn it Pokemon, you make it really hard to keep being a loyal fan.",
        "This looks like they took NO feedback from Sw/Sd. The pop in, the frame rate, this looks like a beta. The switch runs botw, wtf is the excuse??",
        "O HE MAD. WHY HE MAD DOE?",
        "From Lunistice to Levincia",
        "Well that’s a damn shame. I wonder if it’s the hardware that can’t run this game, seeing how outdated it is, or the game itself that’s riddled with bugs?",
        "I blame the consumers that keep buying the switch nintendo is not going to make a new console because of that and this is the result low framerates and bad graphics",
        "I'm sad to see the underwhelming performance.\nI'm still excited for this game! Can't wait to pick it up tomorrow.\nGreat transparent review, as always!",
        "The performance will improve with updates.   It looks pretty good for a Pokemon Game tbh.  Kids will love it.\n\nI wonder how it will look in VR?",
        "Early Pokémon games always feel like demos to an extent, it was the following games that built upon them and made a lasting legacy.\n\nBut now we're reaching the point where they can't even use the stuff being demonstrated in those early games.",
        "The game looks like a beta.",
        "2D pokémon games are what they do best :)",
        "Please PLEASE reconsider/tone down your YouTube voice. It is so off-putting I physically can't watch your content despite wanting to hear your thoughts on the game",
        "@4:10 my god the framerate on those sunfloras. idd rather look at still pictures on the gameboy honestly",
        "I'm sorry, but this game looks terrible. This review feels like someone that doesn't have the heart to tell someone how bad things are",
        "When money holds you back instead of pushing you forwards.",
        "Pokemon Crystal Clear does open world better and also scales ..",
        "Who knew Pokémon’s transition to 3d would go as well as sonic.",
        "Such lovely outdated graphics with horrible performance lol",
        "Gamefreak needs to step their game up",
        "The Pokémon Company is no different from EAs approach to their annual sports game releases. Consistently lacking meaningful improvements or innovations. Basically the masters of minimum viable products.",
        "where is framerate?",
        "Best thing about watching smallant Is he never really shows signs of weariness so you're like \" oh this challenge Is easier than I thought\" and then you proceed to see he has spent 12 hours ;)",
        "Sounded like an 8, surprised it was a 7 considering how positively Nintendo Life tend to skew.",
        "The graphics look so bad, lmao. I’m spoiled by Xenoblade I guess ",
        "pokemon company is just as guilty as gamefreak for having stupid strict guidelines because muh merchandise",
        "Where is TM149 Earthquake? FFS I can't find this friggin thing anywhere my Garchomp NEEDS IT",
        "from nintendo life heeeeere",
        "I don’t know why y’all keep buying Pokémon since they generally all seem the same",
        "The framerate and pop in looks poor",
        "How I´ve missed that when everytime a new Pokemon Game releases and i watch some reviews that the first thing i do is check if I´ve really set the Quality to 1080p cause the Graphic looks so shitty...",
        "Yeah looks like unfinished and released to meet the holiday deadline. Such a shame.",
        "Gamefreak is a small indie company",
        "10:40 \"The game's wavering performance did nothing to diminish the excitement..\"\n\n\n\nSomeone at Nintendo Life actually sat down on their computers and typed that. Lmao",
        "This made me realize just how fun gen 9 is gonna be from interacting with friends alone",
        "I quit all pokemon games since sword and shield gamefreak need to give up the rights to another company to make pokemon games.",
        "I feel bad for GameFreak. You can tether want to expand on what they can do but they lack the time or manpower to properly do it.",
        "This game looks so ugly. Please Nintendo: release a higher spec switch followed by graphics and optimizations updates for as many games as appropriate.",
        "Honestly to me GameFreak have just shown that they are not capable of making a 3D main line pokemon game on a console.\n\nShape up or ship out. Swallow your pride and get a competent developer.",
        "You gave this a 7/10 and Sonic Frontiers a 4/10??? Are you out of your mind???",
        "Naran-ya?\n\nLol",
        "Nice N64 game.",
        "The game looks awful.",
        "Right off the bat seeing the framerate issues the game has is hilarious. Nintendo is embarrassing themselves with their own flagship games not being able to run on their own hardware",
        "Nice to know that I was completely justified in thinking that this game looked like crap from the get go. Glad I can save my money seeing as I won't be missing anything worthwhile.",
        "Remember that Gamefreak is a small indie company. They can’t polish games given their small size.",
        "A game of this state doesn't deserve full price.",
        "Much respect to Mick for being calm about this for two years and coming out with a bombshell of truth on Bethesda and Marty. The only evidence they have is \"we didn't do it, now buy my buggy game\" >:O",
        "Looks like they took a lot of development notes from the cyberpunk 2077 team.  It's just another trash game to add the dumpster bin to round out 2022",
        "If only gamefreak could be abolished, they do not have the skills or talent to handle modern video game design.",
        "So they added more dialogue text? If anything would ruin Pokémon it’s that…oh and when x and y was super linear and devs just focused on the online tournaments which I never cared about",
        "remember MissingNo? that was a fun glitch that was forgivable  even of this game \nis fun this is still a technical  failure   in  2022!",
        "I'm usually  very forgiving to game performance, it's not something I really care about in games if it's good enough to play... But this game really do not look optimized. I can't belive a franchise big like this can launch something at this state for the switch",
        "16:13 is the real review",
        "Looks like gotta wait for the modders to fix the game again",
        "I didn't plan on getting sw/sh or arceus but changed my mind at the last minute and played them and was disappointed in both, not falling for it again on this one lol.  Maybe next gen",
        "they need to move over to Capcom engine. if monster hunter and look as good as it does. The pokemon Company has no excuse",
        "Game freak is just a small indie company on a shoestring budget, let them be!",
        "This will be the first generation I skip. Not going to complain or give any reasons why because seriously just look at the game . Hey maybe gen x I mean gen 10 will finally be the pokemon game that does something right.",
        "I am unfortunately skipping this one and not just because there is no voice acting, seriously Game Freak is so cheap. But also because I am tired of the same game over and over again. I just want a game where there I'd voice acting and where you could travel to any region you desire. Seriously they better wait 4 or more years before the next so they don't have to rush another game out.",
        "Should I get this one or PAL for my 8 year old son for Xmas? He's a huge BotW fan.",
        "well, thanks to the unfortunate downfall of Scarlet/Violet on launch day, that makes Legends Arceus the pokemon game of the year",
        "11:59 Smoliv Lv- No wait... This Bean Lv. 7",
        "I stopped playing on PC because i thought the bad perfomance was caused by the emulator. but it doesnt seem to be any better on switch and at least i had solid 1080p and no pop-ins. the fps seem to drop just as much as the emulated version... im kinda shocked to be true. i didnt play any pokemon since the gba one. i knew gamefreak was slow in terms of gameplay-evolution but they seem to be very bad developer in general.",
        "Is that the frame rate of the game? ",
        "Maybe we can blame the poor graphics performance on inflation?",
        "If the performsance is really this bad I will be requesting a refund",
        "How is this game difficulty? Last Pokémon games were very lackluster because you can basically beat the whole game with one move.",
        "The Sunflora  lmaoo",
        "Wonder if a patch fixes this",
        "Premium trash, do not buy",
        "No voice acting bothers me every time I play a modern Pokémon game. It breaks the immersion so much",
        "That frame rate",
        "We need to stop them from getting away with this. The game looks almost unplayable. The frame rate honestly makes me feel sick watching it and I'm very tempted to send my double pack back for a refund. I honestly think this is a disgrace. Pokemon is the biggest/most profitable IP in the world. We deserve better.",
        "Remember when everyone said the previews weren't the final build and the technical issues will definitely get sorted?\nLook at those sunflora. Yikes",
        "I recently started playing Xenoblade Chronicles X again. That game came out on the Wii U in 2015, yet it looks better than Pokemon Scarlet and Violet, and also runs better. X is 7 year old game that has 5 huge continents to explore, and it puts this game to shame. I don't understand how Pokemon games can look so bad.",
        "Jesus Christ… it looks and plays worse than PLA on it’s first day. \nI don’t think I want to spend my money on unfinished product.",
        "GAMES LOOK ABSOLUTELY AWFUL!",
        "Pokemon will forever be \"a step in the right direction\" but never reaching its destination.",
        "The frame rate is really putting me off and the main reason I won't be getting the game on release. It's not the be all and end all but my god does it ruin the experience somewhat!",
        "I wanted to get it but fps looks abysmal and the graphics look like a mobile game shame, arceus looks to be the more functional game",
        "I know I'm a boomer but Pokémon has looked terrible for a long time now. The last one I attempted to play was Moon and I couldn't do it. It was so dull.",
        "hot damn... i know its for the switch but if the game framerate is the same as what I am seeing in this video... that sucks...\nplus still no voice acting..... and its $60?",
        "I'm glad they released this game now because the amount of hate they're going to get might just be what they need to make a decent game.",
        "It looks as the FPS is majorly tanking before he even started the review...",
        "Man im not paying 59.99 USD for a game that caps at 20 fps....",
        "The most unfortunate thing about the performance issues is that the Switch has the ability to safely overclock to the point where these framerate issues would mostly go away but Nintendo won't let devs have access to the extra power in docked mode outside of loading.",
        "I don't understand why pokemon games on switch always fell's unfinished or rushed,i hope the performance get's fix soon",
        "Why can't people leave main line generations the way they are we don't need all of the things of legends of Arceus let the gimmicks from that game stay to that game",
        "I see someone casted Stopga on Sunflora.",
        "So, open world has no landmarks? What about caves? Anything at all resembling the Undersea Cavern, Mt. Coronet, Eterna Forest? Guessing thats a no. Guessing this world that you guys are talking about consists of Catching Pokemon, Battling Trainers, and walking.\nOnce again, pathetic. I could care less about the performance, but the world being bland and empty is irredeemable.",
        "Damn this game plays like it's still in early alpha.",
        "It’s been a while since I played BotW but I seem to remember a lot of people saying the world seems empty. Would that be because they found that adding more things made the Switch really struggle to perform? Watching this video I see the world is a lot busier than BotW, isn’t it? Do XC2 & 3 or MH have as many things on screen at once or were these developers wise and kept the item count down in order to keep performance up (I’ve not played these so can’t judge for myself)?",
        "Agreed with this. The game runs abysmally .. even for game freak’s standards it’s bad. Too bad because the game does have a lot to offer. It’s just such waste. I wouldn’t even call this a “lack of polish”. I think it’s more than that. The game simply does not run properly.",
        "Even with the performance patched (if that’s even possible) I just don’t think this game is good enough. I’m having fun with it I suppose, I like some of the new designs and it’s actually impressive how many Pokémon are actually wandering around the world, it feels even more populated than Arceus did…but the fact that the human character models are still so static, the battle animations still don’t actually connect, the atrocious textures in most places (y’all seen that waterfall going into the moat in School City whatever it’s called? Christ), the pop-in, the glitches, the fact that they didn’t even model the interior of the shops or the whole academy (!!!), it just feels like another rushed mess. We give Sonic SUCH a hard time but Pokemon is always forgiven and it’s a real shame because the Pokemon Company and Nintendo are never going to change until we stop buying them. Like others have said, if they just made one per generation, took their time over it, and made it spectacular, that would be a real miracle for the series.",
        "I've been playing metal gear solid on ps1 and it looks way better than this lmao",
        "I want to like this... but the performance sucks bad :(\nJust look at how good Bayonetta 3 runs on the same hardware.\n\nI also don't think this game will pull off a Cyberpunk redemption arc in the near future :|",
        "The frame rate looks decent except for certain parts. Which is basically anytime a lot is happening on screen. I have a big back catalog anyway, so I’ll just play the waiting game on this. If they can patch these issues, I’ll be onboard.",
        "i preordered it so hopefully i’ll like it if not i’ll sell it",
        "4:03 2 FPS sweeeeet",
        "The frame rate on certain things looks like Kirby and the Rainbow Curse, but not charming",
        "It looks boring honestly",
        "I feel like they worked with sonic team, making sure they deliver a good game with ROUGH graphics at times and pop up galore… after finishing that, I honestly think the issues won’t bug me much ️",
        "Imagine if Sony released a game that looks and performs as bad as this, they'd be criticized to hell. This game will sell millions as Pokemon fans find visuals doesn't interfere with 'enjoyability', at this point the 3DS games look better honestly.",
        "Currently playing USUM and while it definitely has its weak points.. at least it looks & runs great on the 3ds. An open world pokemon game sounds amazing, but the performance looks beyond atrocious and the world looks like a barren demo version. Such a shame =/",
        "Sonic Frontiers was better than the newest pokemon games.\nWhat a world we live in",
        "It's an embarrassment, just as I expected.\nWhy does the game look even worse than Sword and Shield, which already looked quite bad (aka, a joke)? Again, the biggest money-making franchise IN THE WORLD's flagship product still looks like something made by two teenaged indie developers in their basement from 10 years in the past. It not only looks awful, it also runs *horrendously*. ",
        "Pokemon reminds me of iphones. Like people buy the same phone every time with barely any changes.",
        "We spent 15 years with steps in the right direction...just give the series to another developer",
        "Up until now I was ready to buy, but the performance issues that are mentioned in every review. I feel like I would be buying a broken game. Can't do it. If they are fixed in the near future, sure. I hope, and it's a fool's hope, people don't buy this while broken or else it will teach Nintendo it's ok to release broken games.",
        "Legends Arceus wasn't exactly a visual marvel... but my god this looks naff compared  to it...",
        "After watching this I think I finally realized that I’m far more excited for the new meta on Showdown than the actual game. Better performance and the players make their own epic stories (and salt)",
        "How are they legally allowed to release such a broken and unplayable product?",
        "I hope the performance gets better after a few patches. If not, ill pass this one/two",
        "Ever since the switch to 3D, Pokémon lost its sense of adventure, epicness, mystery and soul.  Enough of the “step in the right direction”.  I’m passing on this series until we get back the quality of gens 1-5.",
        "Billion dollar company and yet they make games that look like ps2 graphics and can't even get a stable 30 fps on it. But yeah it's Pokemon so nobody cares and will still sell 20+ million copies.",
        "I think between these games and Bayonetta 3 it's obvious the Switch is struggling and Nintendo should really prioritize giving us some stronger hardware before it dumps the next round of big titles on us.",
        "I'm on here just to see the game screw reviews i play what I want and not based on others opinions",
        "Pokémon fans deserve better.",
        "Catch ‘em all at 4fps",
        "How is the performance and frame rate overall compared to legend arceus?",
        "This looks like some really doo doo hahahaha Nintendo putting in the bare minimum as usual",
        "If it wasn't for the Pokemon name, the game would get far worse ratings. It really feels like the reviewers can't really objectively grade the game without having nostalgia feelings from their youth.\n\nAnd one of the biggest failures is to compare Pokemon only with older Pokemon games. Of course it will be the best ans biggest game, but if you compare to other open world games on the Switch like Skyrim, Witcher 3, Xenoblade Chronicles 3, even Bayonetta 3 has some open world areas, SV gets crushed.",
        "Why do Pokémon have to keep doing small steps while other games are doing big leaps? Not to mention, Pokémon is the highest grossing gaming franchise. Ever. Even bigger than Marvel and Star Wars, or any other franchise you can think of!",
        "If it sells, they won't try to make the games perform any better. My experience with Xenoblade Chronicles 2 was weird because I loved the game and also hated the frame dropping mid fight, in a moment where I had to mash a button and press another at the right time, WITH FRAME DROPS. Come on, Nintendo.",
        "It honestly feels to me like developers at Game Freak exist inside of some sort of bubble that doesn't allow them to see games outside of those they've developed. They always take steps to improve from their previous games, but if you looked at the rate of improvement throughout the gaming industry as a whole, they're lagging behind significantly. Imagine a studio releasing this exact game completely unaffiliated with Nintendo or GF today. The only way it wouldn't be absolutely lambasted would be if it were from an indie studio, not one of the largest in the sphere. Like, I'm glad they're proud of their creation, but it's as if they've never seen what a finished, polished 3D game looks like, so to them this is the peak.",
        "4:26 GO FRAME BY FRAME BACKWARDS WITH THE \",\" and \".\" KEYS DURING THE CAMERA CUT FOR CREEPY LADY MODEL  ",
        "At this point they might  need to look into outsourcing their optimization of their game because it is clear they have no idea how to use the switch (as weak as it is) properly. \n\nI see a lot of comments saying “it doesn’t need to be 60 fps” then going on they only want a solid 30. Yes that is passable but you should always want something closer to 60 than 30, if it dips at 60 a bit it doesn’t become a slide show. It may be the pc gamer brain of me but I find it atrocious that people will accept the bare minimum when it is 2023 soon. Let’s face it though, if this was on a stronger system gamefreak would still manage to mess up performance but maybe just maybe they could rely on the stronger system to keep it over 30 lmao ",
        "I am so sorry Pokemon fans but even from the intro the frame rate was so bad (which isn't everything but visuals are a big deal considering the core gameplay loop hasnt changed) I got into pokemon from the anime a card game and have been waiting for a pokemon game that grabs me. Arceus was close but it looks like i will still be waiting...",
        "The visuals actually looks decent",
        "Oh man! I really wanted this game to be good ",
        "its unacceptable that the game looks and runs this poorly. Im not buying it",
        "No buy from me",
        "Do you think they will fix the performance issues with an update? I was really looking forward to this game and now I'm losing hope. I was going to buy it day one in my country, guess I'll get another switch game from the backlog",
        "From what I have read not only they doubled down on the exp share mechanic from SwSh, but they also removed the Set option. I find disappointing that most reviews so far don't mention any of this. If they keep removing options, why are these games a step in the right direction?  Most of what I have seen in this review made me nod in disapproval. Sadly, I have been playing since gen 1 and since SwSh, I have been boycotting every game and will continue to do so while they keep removing options and treating their customers as brain dead people that cannot figure out how to find the exit of a dungeon.",
        "I’m not concerned about the performance rates. I’m sure they’ll hear all the backlash and address it in the second patch.",
        "fyi these guys gave pokemon sword and shield an 8 ",
        "Wow…. This looks horrible. I mean it is Pokémon there sort of the laziest video game company in the world. Could you honestly imagine if Elden ring came out like this or Zelda. Heck or a GTA.\n\nAnd people complain about Bethesda….. stop being fanboys over your childhood series.",
        "It's a shame that the frame rate is still rubbish after the day 1 patch. Performance was my biggest fear for this game, I'll still play the game but I have to say I'm disappointed.",
        "STOP RIDING THE POKÉMON!!!!! THE FRAMERATE DROP IS MAKING ME SICK!!!!",
        "Reviewing a new pokemon game is like reviewing a new iphone. There aren't much new innovative game changing thing to be reviewed, the fans just need some little confirmation that this is indeed a new pokemon game, and it still gonna sold anyway",
        "When the rest of the gaming industry has already moved on, having good graphics and content, gamefreak is still 10 years behind. Someone needs to tell them to stop dishing out a pokemon game every years because these games are getting soulless each release. They should have just taken 2 or 3 years to polish out the entire game and not release a rushed mess.",
        "Ok... game freak needs to hire professional designers and experienced engine programmers.",
        "Let's be real, was anyone expecting Nintendo Life and Alex to give this game a positive review? Not sure why dude seems obsessed to constantly talk about a series he obviously doesn't like.",
        "Skip to 16:12 for the real review.\n\nDon't waste 15mins of your life to hear the same thing you've been hearing for the past 4 years ie \"step in the right direction, looking forward to see the new changes the next game\" etc.",
        "as a massive fan of the pokemon games the graphics don't bother me to much its the gameplay and enjoyment of the story and the adventure that I care about everybody moaning about visuals and graphics, come on its not about that, yes perfect quality would be nice but if its not dose that mean the games bad, I just don't understand dosent anybody remember playing old games that was so blocky and pixelated it hurt your eyes, nobody complained then so why ??",
        "so sunflora is just broken, period. cool lol",
        "theres some people that genuinely have nothing to lose if they get a criminal record or go to jail.",
        "all the recent switch releases are perfect examples of showing that the switch is really showing its age. Hopefully the game gets small fixes for the performance but im more hopeful for a stronger switch 2",
        "Short answer is no it's not worth it",
        "I'm sorry, no. Game Freak does not get a pass for this poor performance. I've seen Android asset flip games run better than this, unexcusable.",
        "I think its also the fact that switch is just mot meant to handle heavy games, well more power compensates for poor optimization too so yeah switch being weak is already a handicap for them devs",
        "I feel like Pokémon's sorely missing the DS gens, when subpar graphics were the expectation, and they could focus more on other aspects of the experience. I dunno, maybe I'm just missing Sun and Moon ahah",
        "The frame rate just makes me want to cry",
        "I finished the game in two days literally....I was very disappointed by the \"lenght\" of this game after playing Xenoblade Chronicles 3 which was a true masterpiece  to me it is worth buying but only at a strong discounted price maybe when you can find it second hand.",
        "I feel like this review is too forgiving about the performance issues. 7/10 is way too generous for a game that runs this poorly. I'm glad I stuck around for the final part where Alex shares his personal thoughts about the game. Thank you Alex, for calling out the bad state of this game! If Pokémon fans continue to buy these games regardless of their flaws, the Pokémon Company will keep on releasing poor products.",
        "People do realise we don't have the day 1 patch yet? Which they do with every game",
        "I was very excited for Arceus and it ended up as a huge let down for me. I was excited for Scarlet and Violet until I started watching and reading reviews. Every year more and more games are being released more and more unfinished. That’s sad.",
        "I have heard \"GameFreak is going one step to the right direction towards to the future\" since Sword/Shield and I'm sincerely tired of hearing that. That means that the product we have in our hands is mediocre and not what we were expecting. ",
        "I'm just astounded that the technical and performance issues somehow look even worse here than in Legends Arceus.",
        "8:57 Holy shit, the game froze for a full second.",
        "Yo that sunflora is looking soooooo out of place with that frame rate",
        "They should give the saga to a real company…",
        "\"The ones who are crazy enough to think they can change the world, are the ones who do.\" -Anonymous",
        "Yes! More halfbaked, poor designed and glitchy Pokemon games for me please!",
        "I think the graphics look amazing",
        "What is the deal with that sunflora",
        "These new Pokémon designs are so awful unbelievable no one talking about it.",
        "It. Looks. So. Bad. AGAIN!",
        "Dear Nintendo Life: Stop giving gamefreak a pass",
        "Wow, gamefreak is literally the worst at making games",
        "11:24 what am i looking at",
        "coming form GoW Ragnarök to this.... I dont know if I can mentally take it. How is such a difference in quality even possible?",
        "Getting real tired of hearing \"iT's a StEp iN tHe RiGhT DiReCtiOn\" in every pokemon game review. How many more steps will it take for these games to reach the bar set by RPGs more than a decade ago?",
        "Thank you for your honesty at the end",
        "Please don't let this review fool you. Yes, the game can look rough at times, but overall it is a big step up from PLA and many environments look stunning. Remember that framing is important and Nintendo Life decided to show you the same few ugly clips on repeat.",
        "Is it gamefreak that can’t optimize or the switch that’s too weak",
        "This game seems to have alot of great idea; but the way it performance is really not acceptable. Nintendo seems content in treating the Switch as a handheld more than a home console at this point. I dare say; that games being released now perform significantly worse than in the initial launch years (The first Fire Emblem Warriors, Mario Oddessy, Bayonetta 1-2 all perform better than the recent releases). These issues are made even worse; when you consider that they can use AMD Fidilety Upscaling and the \"Update Dock Firmware\" feature (things that were not available at launch) to get even better performance than the launch games. The games coming out now; are the type of games (and performance) that a console has when it's on it's last leg and the company is starting to look to their next console. However, since the Switch is a different beast than anything that has come out before; they may just keep relying on retro and indie games; with some past gen ports (which strangely also have not been performing well this year compared to launch. Allan Wake looks worse than the 360 version, yet L.A Niore and all the RE games look and run better on the Switch than any of their past gen ports).",
        "I'm really getting sick of hearing \"a step in the right direction\" with every single Pokemon review.",
        "Nintendo really needs to upgrade their hardware. \n\nNostalgia only goes so far.",
        "The fact Game Freak will get away with this garbage again because their fans just eat up whatever shit they throw at them",
        "WHY DID YOU CHOOSE THIS MUSIC. This is the most annoying music in the entire game lmao",
        "I'm still playing Arceus, too many games. I'm always late buying the latest release when they come out.\nHappy Gaming ",
        "I honestly feel like giving up on Pokemon games altogether. I will not be playing this",
        "why do mobile games like genshin look miles better  than the new pokemon game?",
        "Jus got a switch yesterday just for this game, should I jus buy and play legends instead ?",
        "im starting to think they caught on to the madden-nba2k formula.. keep putting out the same shit games every year & the masses will buy it anyway even if the graphics are shit..",
        "Pokemon fans will buy literally anything, I honestly think that there is no other gaming community with lower standards.",
        "Excusing this level of ineptitude on graphics and frame rate officially means you can't be objective... Disgusting.. they are a multi billion dollar company ... Indie devs are doing better nowdays... Nintendo simps confirmed",
        "Opportunity missed here boys! A simple update could fix a lot of this. But selling unfinished games is whack",
        "They should have brought back mega evolution. . . But my theory is that they got sued by digimon and that’s why it hasn’t come back",
        "I can honestly deal with a game having inconsistent performance as long as it’s actually a fun and enjoyable time (looks at Hyrule Warriors: Age of Calamity), so hopefully it’ll be the case with this game. It’s just a shame that the technical side of Pokémon always seems to be it’s weakest aspect, which was the same case for Legends Arceus despite still having a blast with that game.",
        "So you CAN'T change your outfit from those school uniform",
        "Anyone complaining just go play GOW and shut up, this is the best POKÉMON game of years and they will just continue getting better. Pumping out games is great when you enjoy the Pokémon aspect itself, who cares about your tech",
        "Performance isn't really an issue for me in games where fast paced action isn't the focus. If this was a fighting game, character action game, or something like Doom Eternal I would be put off.",
        "I knew this game was going to be crap. I never buy any pokemon game nowadays. Back to temtem.",
        "I'm not going to defend TPC for the game's performance, though I will say they clearly underestimated the workload moving from a portable to a \"higher\" spec console,  but people think the Switch is some kind of \"miracle machine\" because Bethesda released Doom on it.",
        "Legends Arceus can handle open-world fps smoothly (no hard drops I noticed), why can't S/V?",
        "Just play actually good Jrpgs. Problem solved. Dragon Quest XI, Xenoblade, Monster Hunter Stories, Persona 5, Shin Megami Tensei V - there are just a dozens of jrpgs on Switch which dwarf Pokémon.",
        "‘we hope that nintendo company can FIGURE OUT how to improve its performance issues..’\n\nno, they are sitting on one of the biggest pots of gold the world has ever seen, there is no ‘figuring out’. jesus christ people are doormats",
        "Can't even get the pokeball noise right after all these years...",
        "Jesus this looks terrible... I love pokemon. I've been playing since red and blue and I really hope they can come out with something worthy of how much money this franchise rakes in... I'm not looking for 150 new pokemon. I just want a good game.",
        "I'm actually a little tired of the \"it's a step on the right direction\"  statement. We've been saying that since sword and shield (maybe even since sun and moon) and they still can't figure it out. \n\nImagine you're an artist and every painting you make they just say, ya, it's a good step!. Its become more of an insult than a praise.",
        "looks like an excellent game however its a pass for that framerate. thats crazy",
        "I'm planning on playing Violet on Switch. Though after I beat it, I plan on downloading an Emulator on PC to play Violet in 4k 60fps.  Not to mention modders will add DRIP",
        "Slap Pokemon in the title and people will buy it. Easy.",
        "Breath of the wild had some FPS issues when it first launched, especially in Kakariko Village which still exhibits the fps issues on the Wii-U version (which was never fixed) so there's at least 'some' hope that they can continue to optimise and smooth out the experience post launch right?"
    ],
    "comments_disabled": false
}