{"video_id": "-mwkAYKvypQ", "comments": ["I think that GameFreak should start outsourcing some of their graphical stuff to Monolithsoft, like Nintendo did with BOTW. Xenoblade Chronicles 3 is a technical marvel on the Switch, in my opinion.", "I love how she gets inspired by movies, anime, and all types of popular tv shows to just keep us entertained. We love you Jess", "I think that Pokemon should be a once in a generation game, like Mario or zelda. It would still sell zillions of copies. They can easily make spin-off games throughout the years to get more merch, cards, TV episodes, etc. ", "I’m very, very concerned about what’s going to happen when online co-op launches, I can’t imagine the performance being any better in that mode and I don’t think people are going to tolerate an even choppier framerate", "Every Pokemon game is a step in the right direction.... but look, we don't need  another step, we need a destination.", "I’m looking forward to Digital Foundry’s coverage on this - performance this bad deserves to be criticised", "I didn't expect stellar performance...but wow...I would ask how anybody could release a game in this state, but then I remember it's Pokemon so it will still sell millions even at 10 fps. \nI've been excited for the game but after seeing that performance it's really put a damper on that excitement. Feeling a lot more patient to play than I was before.", "The story of, “its a step on a right direction but not a good contemporary game” is getting so tiring and frustrating, but the worst of it is that this will be the eternal cycle this games will be in since Pokemon as a whole will always sale well despite delivering average experiences in their main line console games… It’s sad but there’s not much that can be done… unless few people buy this games which will probably never happen…", "At this point, Pokemon really need  1 - 2 rival franchise that can show to us this type of game can have stellar performace and beautiful stylistic world. Temtem, MH Stories or even Digimon need to step up and capitalize this when many people questioning game freak capability to create a game with stable and solid performance.", "Since PLA and S/V were being made at the same time, i hope that whatever they are doing for their next game (Be it another Legends game ) takes a lot from PLA (catching mechanics, sense of wonder) and marries it with S/V to create a game that is just fantastic. It seems like Game freak didn't think that PLA would do as well as it did, and so i hope they are starting on... Legends... Rayquaza? I know if i had a choice, I'd rather play a Legends game than a mainline game, but if they took both and put them together, I'd 100% play that", "An important lesson on why competing companies is always great for product excellence. Gamefreak have no competitors in this niche so they can release whatever the hell they like and it'll pull record sales. These graphics and performance are borderline hilarious.", "I wonder how many steps multi billion dollar franchise can step in the right direction before it actually gets it right", "I hope the performance issues get fixed soon. I was really looking forward to play these games since I've been putting off on buying any Pokemon games on the switch", "I’m really excited to get Violet soon! It looks amazing to me. I hope they add some more patches to fix frame rates but other than that nothing looks bad so far.", "INSANELY happy to see Mick getting the redemption he deserves. A subreddit I was in when this all went down two years ago crossposted the original letter and was full of comments like \"That sucks, I always liked his songs\" or \"I always knew he was a hack\", etc. Going back to that subreddit now, there's no mention of Mick's response. It consistently surprises me that people buy in to the very first side of the story when it comes out, no matter how unbelievable it is.", "It would have been interesting if the gym leaders scale up and have different teams according to, for example, how powerful your starter is, or how many badges you've gotten. Oh, well -- too interesting and ambitious for gamefreak.", "Seen both this video and your review on Splatoon 3. Splatoon 3 feels like a competitive beast of a pokemon that had it's stats raised over the years through its many major improvements, but it had an everstone that prevented it from evolving in the fact that no new major game modes like Salmon Run were introduced. Still it's a great game, and if they were to add something revolutionary it should be something like a custom map maker like Halo's forge to make fun mini games like Infection (I'd call it Sanitization after Octo Expansion) possible, perhaps it was just limited by the hardware.", "I really hope that they throw a lot of patches at this game. Sounds like what I've been wanting for a long time and I'm just sad that performance sucks!", "I can honestly deal with a game having inconsistent performance as long as it’s actually a fun and enjoyable time (looks at Hyrule Warriors: Age of Calamity), so hopefully it’ll be the case with this game. It’s just a shame that the technical side of Pokémon always seems to be it’s weakest aspect, which was the same case for Legends Arceus despite still having a blast with that game.", "The 'Step on the right direction' saga. I don't get why this traditional and consistent dissapointment sells that well, with only the promise than the next one will be better.", "A real shame that the performance issues are bad enough to ruin some of the experience.  I like some of ideas here and I think it could be a fun game if not for those issues", "After watching this I think I finally realized that I’m far more excited for the new meta on Showdown than the actual game. Better performance and the players make their own epic stories (and salt)", "Every Pokémon review I hear “it’s a step in the right direction”. After so many tries, it’ll never get to that final destination.", "Can we just take a moment to appreciate Corys hardworking and appreciate him uploading this frequently", "I see alot of folks saying its a step in the right direction, so imma wait until they actually get there.", "The transition from the Pixar lamp to the boat train, that was incredible", "1:00 - this is what reviewers say every time a new generation is released. It’s always the most special feeling since Red and Blue…. except it’s really not. And once the nostalgia goosebumps go away the cracks start to show quickly.", "I'm glad they released this game now because the amount of hate they're going to get might just be what they need to make a decent game.", "As someone who's played every gen, I think I'll hold off on buying these until they've been patched (if that ever happens) or they're on sale down the line. It's just another gen where they've made few improvements that I personally care about, on top of there being huge frame rate issues (which is a big deal to me). It's too bad because the open world structure seems fun. I'll echo everyone else saying I wish they would just give these games more time and treat them like Mario and Zelda. Maybe Gen X!", "I love how Mark was almost an engineer and he didn't realize the symbols in the second room are all parts of a circuit: capacitor, inductor, resistance, voltage source, etc", "In my opinion the Let's Go Pikachu/Eevee games were the last good-looking games in the series, since then their art style has just gotten more confused and muddy.\n\nI get that they're struggling with the limitations of the hardware here, but other games have managed to do open world and make it run AND look much better than this. I guess I'm just a little sad that a series I once cared about looks like it's been developed by a small-time indie studio.", "I love how siglis can't do anything bc he's always trapped, It really made my day, I also love how he's just tormented! =O:)", "Would be interesting to hear Alex's numerical Review score with his opinions at the end.  Definitely sounded like it would be far less than the 7/10 by Alana.", "Fantastic review, Honest and direct", "Can you imagine a game releasing in a state like this back on the SNES or before patches were a thing? Yeesh", "highest grossing media franchise ever btw", "NGL, the concept and the direction of where pokemon is going is amazing. I mean back in 1999 I was thinking to myself \"man... wouldn't it be sick if they could make a pokemon game like Mario 64 all 3D and stuff!\" 20 years later they finally got here! However, them frame rate drops and graphics just don't make sense. I mean, I know they can do better. Looking forward to the next gen console and next gen game. It's going to be a pass for me on this one though. I'll just youtube watch it.", "these double uploads cant be easy on ya cory, big appreciation for providing the world with your content :)", "Wow! I knew that performance was going to be an issue, but this is rough. The 24fps choppiness is starting to hit PS3 era levels of performance. But I'm sure this will sell like hot cakes because it's Pokemon. ", "Agreed with this. The game runs abysmally .. even for game freak’s standards it’s bad. Too bad because the game does have a lot to offer. It’s just such waste. I wouldn’t even call this a “lack of polish”. I think it’s more than that. The game simply does not run properly.", "I usually play the new game during the holidays. This time I was quite excited that I would play it day 1. \nBut seeing the weak performance I think I stay with my original plan. Hoping enough patches are released to fix this problem.", "Definitely worth it!! Been playing since this morning and i love it so far. I was surprised i got it a day earlier.", "I hope that people do enjoy Scarlet and Violet, but I'm not in a big rush to pick one of these up. It's kind of hard to believe that this is the newest big Nintendo game considering how much lower quality the visuals are than something like Super Mario Odyssey or BOTW that dropped so early in the Switch's lifespan. I don't think it's a stretch to say that generation 4 or even generation 3 pokemon games look better than the 9th generation does today.", "I wish this game played more in the style of Legends Arceus tbh. Catching and starting battles in that game felt amazing to me and smooth. This still feels restricted in gameplay.", "It sounds like they should have had some kind of consultation or collaboration with Monolith Soft.\n\nThe difference in performance between S/V and games like Xenoblade or Breath of the Wild is staggering to say the least. Feels like less of a hardware issue and more of a bad development prioritization issue.", "Remember when everyone said the previews weren't the final build and the technical issues will definitely get sorted?\nLook at those sunflora. Yikes", "We spent 15 years with steps in the right direction...just give the series to another developer", "To be honest the art style and performance seem really quite offputting. I enjoyed arceus but don't think i'll pick this one up.", "It isn't great graphically but it's the best in the entire series, and to me the immersion of everything outdoes all of the hiccups.  This feels like you are playing episodes of the Pokemon series because everything is designed to make you feel like you are a part of its world.", "So glad I waited for the new Pokemon games to come out so they could lead us into \"the right direction\". Only 12+ more years tops!", "Aside the performance issues, if the affection mechanic still exists and you still can't turn off exp share, then this game is another huge blow for me. I don't want my pokemon to survive on 1HP because \"he loves me\" and i'd like to be able to manually train up my party again. The games just keep getting easier while also holding your hand in all aspects.", "The most unfortunate thing about the performance issues is that the Switch has the ability to safely overclock to the point where these framerate issues would mostly go away but Nintendo won't let devs have access to the extra power in docked mode outside of loading.", "I loved the design of the Mermaid. Kinda sad that they didn't spend that much time with the fates. So many interesting female characters.", "Sad to see this game has performance issues like this when PLA is somewhat similar and runs so much better.. PLA had its issues but performance wasnt anywhere near this level and was super pleasant... I hope they do patch this to fix this issue but as you said.. I don't see it happening. Game Freak needs to kinda step up in this department. One of the highest selling franchises shouldnt be this poor or behind the times at this point. They gotta stop sitting on their laurels in my opinion. Took too long for the series to hit this point now", "With performance and graphics issues with this game and Bayonetta, I hope Nintendo starts getting more of a push to move on from the Switch to a pro, or whatever they have planned next", "I'd just love to finally know who to blame. Is it TPC pressuring on time because of the rest of media branches (show,cards) or is it Game Freak just really being stubborn and staying as a small team (in comparison to other Devs). It's massively dissapointing either way. I hope I'll still enjoy them but dang they do look messy!", "The difficultly of gyms out of order is important and I feel like you glossed over it. Are they strictly progressive in terms of one being harder than each other?", "Man, I've been skeptical about the game but decided to preorder it after seeing some of the leaks because I had a gift card (I would never buy a pokemon game on the switch at full price) but this is just abysmal. Especially Alex's words at the end, I was hoping it would be closer to Pokemon Arceus in terms of performance, but Gamefreak just pushed the bar even lower.", "I haven't felt this addicted to a Pokemon game since Pokemon Platinum. The FPS is bad but the open world 3d pokemon environment is what I have always wanted. \nIf a patch fixes the horrible issues it has this could be the best game in the series.", "PLA and SV being described as steps in the right direction is a bummer cause I want a new game that is THE definitive experience rather than being something that a future game can benefit from", "3:58 the reduced framerate animations on the Sunflora say everything I need to know. Amazin.", "A potentially good - maybe even great - game, hampered by a studio who never did bother to learn how to optimize. I've seen like 10 reviews now, and they all feel like they more-or-less boil down to this.", "The footage speaks for itself. Glad your criticism turned out to be valid, since other apologist channels tried to claim you were lying or exaggerating or were playing a beta not representative of the final product.", "Pokémon is the biggest multimedia franchise in the world. They need to support Game Freak more. I’m in my 30s now. My hard earned cash doesn’t mean as much as the billions of dollars in card sales, plush sales, et al that can be used to hire people who are capable of making this a better quality series of games so hat things like storytelling and new Pokémon can shine. These visuals muddle all of that intention into a mushy letdown.", "I hope the performance gets better after a few patches. If not, ill pass this one/two", "I was debating whether to get this or Xenoblade Chronicles: Definitive Edition. This review settles it. Xenoblade it is! \n\nThank you for your honest review!", "I don't think they can fix these issues. As it was said at the end, could be a issue at the engine level. Will keep a eye on it thou and see how they respond to feedback.", "forgot the entire show right after I saw the show\". Definitly one of the performers of all time.", "I didn't plan on getting sw/sh or arceus but changed my mind at the last minute and played them and was disappointed in both, not falling for it again on this one lol.  Maybe next gen", "I knew there was going to be technical issues going in but wow, this is something else.", "I think it is about time that Genius Sonority stepped-up to make a \"mainline\" Pokemon game. They did an OUTSTANDING job on Pokemon Battle Revolution (Wii) that not only graphically looks better, but also ran VERY SMOOTHLY on old Nintendo hardware and that game released more than 15 years ago back in 2006, believe it or not.", "Whatever happened to Gamefreak taking its time with every new generation? Scarlet and Violet is now the fifth game that they have released within 4 years.", "I'm playing violet tomorrow and I honestly can't wait. I love the region, fuecoco and the new pokemon and professor turo. \nTypically stuff like performance/frame rate stuff doesn't happen to me anyway. Sun/moon ran fine and swsh did too.", "I think at this point we genuinely dont expecting graphical greatness from pokemon games anymore lol", "I grew up with Pokémon. Played Red and Blue when they first came out at the ripe old age of 8. Over the years, because they haven't bothered to change the formula enough. I care less and less. Looks alright I guess.", "Can’t wait to play it. Should super fun", "Yes I'm SO glad this one is being covered/narrated by Alex ", "Holy guacamole, that frame rate, that one guy jumping at 15 fps behind Iono, and he isn't even that far away, and the sunflower \nI'm still wanna buy it, but I feel i have to vote with my wallet on this.", "I miss the DS era, that 2D pixel art with some 3D was the best for Pokémon", "Looks like a fun game If they can fix the performance issues then sure i am gonna buy it .", "(MY REVIEW) Tbh is not only the technical issues, the world itself is also empty and poorly designed. You CAN'T go anywhere want, or well, i guess you can, but even if you beat or catch over leveled pokemon they won't listen to you, and koraidon won't have the tools to traverse most regions, sometimes youre actually are heavily encouraged to follow a certain path to be even able to progress since you're surrounded by unclimbable mountains and unswimmable lakes, and when you finally have the way to reach paths you weren't able before, there's nothing there. A huge cliff? Nothing on top, a cave with a lot of unreachable platforms in the beginning? A few worthless TMs, the top of an island in the middle of a lake? Just a few regular pokemon. ", "I'm sad to see the underwhelming performance.\nI'm still excited for this game! Can't wait to pick it up tomorrow.\nGreat transparent review, as always!", "Why the heck didn't they scale the level of the pokemon in an open world game?", "Such a shame that a multi-billion dollar company doesn't put more effort into their games. Worse still, these latest ones will certainly be a financial success so they'll have no reason to learn from some clear mistakes.", "Great video, as always, Alex. I am so so excited for this game. I know it clearly has issues, but I am not bothered. I will still enjoy it.  Especially playing with my wife. Cannot wait to do multiplayer.", "I’m looking past the performance issues. Still having a great time ", "I feel like they worked with sonic team, making sure they deliver a good game with ROUGH graphics at times and pop up galore… after finishing that, I honestly think the issues won’t bug me much ️", "I think I'll wait until there's some change to the games. The last 2 main games were boring to me. Sword and Shield was way to easy and Legends was just more of the same. It was a little harder and not having battle transitions was cool but it's just the same formula over and over. I feel like they need an overhaul before I'll be able to get back into it. I've played since Red and Blue. I had Blue with a blue Gameboy Pocket when it first came out. I used to love getting on the game and grinding but that joy just isn't there anymore. I'll never forget having a link cable and battling my friends", "Best thing about watching smallant Is he never really shows signs of weariness so you're like \" oh this challenge Is easier than I thought\" and then you proceed to see he has spent 12 hours ;)", "This is that franchise you can easily say they never invest their earned money into making better products.", "would of been better if they some how made it to where you can go where ever you want and battle whatever gym first.. but the game scales to your levels... so say you start out at the final gym first... well those pokemon are gonna be only around level 10-15.... and then the rest of the gyms after that level up normally like they would normally in the game but the only difference is you are choose what gyms you wanna go to first which in return could change the game quite a bit to be honest and also add for more repeatability if you wanted to do that even though i have no idea why you would unless you play... save your pokemon to the bank system and then play again i would then understand that", "Thank you so much to the Nintendo Life crew for the Black Friday sale on your website! I was able to get a discount on my copies of Scarlet and Violet. I love your channel and really trust your reviews! Thank you!", "At this point, Gamefreak just needs to partner with someone else for the tech.  Cause they have struggled more than any Nintendo studio or partner since the jump to HD and their inhouse tech just clearly isn't up to it.  Nintendo has other, significantly more accomplished teams when it comes to tech who could dramatically improve this.  Monolith Soft probably being the most obvious choice for this type of game.", "So long as it’s not worst than S&S wild area I’ll be fine. No I don’t like it’s this bugged & stuff, but my hopes weren’t ever high for this game. So long as I can find some level of enjoyment then I’m fine waiting for a patch down the line. ", "i hope in a few patches they'll fix the performance, atleast to a somewhat stable 30.", "Do you think they will fix the performance issues with an update? I was really looking forward to this game and now I'm losing hope. I was going to buy it day one in my country, guess I'll get another switch game from the backlog", "Much respect to Mick for being calm about this for two years and coming out with a bombshell of truth on Bethesda and Marty. The only evidence they have is \"we didn't do it, now buy my buggy game\" >:O", "I like the pokémon games and i loved them when I was younger. Pokemon silver was may favourite one. But all the switch games have been pretty average at best. I would say I actually liked let’s go the best and that’s probably only because of my nostalgia  for gen 1. It should be so easy to make a good pokémon game and to be honest with the budget they have now there is NO excuse for not having voice acting even if it was in Japanese only with english subs.", "How is the performance and frame rate overall compared to legend arceus?", "Crazy how we got a game that performs and run like this but also got games that can run 60fps continuous cut with beautiful graphics like gow ragnarok. Crazy how 2 companies can have such different approaches and passion and the bad one is the bigger one lmao"]}