{"video_id": "-UeGXB2NjR8", "comments": ["With a cast like this who can say no?! I am definitely watching this!", "OH WHAT A CAST! A great opportunity to see these two legends  Fonda and Tomlin again!! WHERE ARE MY GRACE AND FRANKIE FANS? ", "I don't care about sports at all, but I would watch anything starring these legendary actresses. Love them!", "I was laughing and smiling and watching and such… but I’m being straight up and honest: as a 31 year old Pats fan raised in New England, seeing Brady back in a Pats jersey actually brought tears to my eyes. Make fun if you want, but you’ve gotta understand.   ", "this movie is gonna be every thing I dream for", "GIVE LILY TOMLIN A BLOODY OSCAR", "OMG.  I love Sally Field.  Been watching her since her days in the Flying Nun.  I also adore Jane Fonda snd Lily Tomlin \n\nThis movie looks AWESOME!!!!! Can't wait til it's out", "I'm rewatching all his videos now that he has passed and that ending just really hits different. \"I'm free.\" The Great Potato War is what I believe is the ultimate display of Techno's true capacity in scary intelligence and shocking talent. His remarkable characteristics have made him so unique and embroidered in most everything minecraft by now. Mad respect. RIP :-O :D", "With a cast like this who can say no?! I am definitely watching this! indeed!", "I can't wait for this movie!!! ", "It's like watching The Golden Girls.", "OmG, Rita is a spitfire and so inspirational not to mention such a  great dancer.  Sally, \" yes, I really do like you !\"  has made me laugh my ass off and cry like noone else except maybe Robin Williams  (\"Brown football helmet\" and \"Its just my time\" kill me everytime!) Lily Tomlin has really been a trail blazer, seeing her as a toddler in a big chair is one of my earliest comedic performance memories I can remember appreciating  and thank God for Janes workouts and other amazing performances including Barbarella.  Yall have me as a big fan! Thanks !", "Oh my goodness!!!!\nWish they had kept Billy Porter a surprise though.\nBut now I'm all the more excited.Love Billy so much!! Looking forward", "Glad to see Harry Hamlin back making movies again after all these of being blacklisted.", "Can’t wait to see this! How I hope my friendships are like when I am older! What a great storyline & cast!", "4 of my favorite ladies... cant wait to watch this...... Jane Fonda and her cast mate on Frankie and Grace series are the best..... February is too far away... I wanna see it now.... lol", "Ahhhh can't wait!!! Crazy iconic cast!", "this stream changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can.  I have been able to unlock my true potential due to this stream and I owe my life life to you. I feel and see things no other being can sense. I am feeling things unimaginable to the human brain. Thanks to this stream I was awakened to many things previously considered unimaginable and my brain can comprehend things that others cannot. Thank you for this exquisite stream, I will never forget this experience.", "This movie looks like so much fun! These gals look awesome. Definitely going to  see this.", "I’m 64 For Brady.  I NEVER miss a game!!!!!!!!", "Also, something Austin didn't mention: If you take a right from the first pokemon center, there is a very strong Fletchinder you can fight. It's about level 23 and isn't always there, but often flies down from a high wall. Good early exp if you're looking to evolve some dudes early. :-O", "Can't wait to see this!", "I love everything about this!  Can't wait to see it!", "Grace & Frankie brought some friends... I'm here for it.", "The Golden girls of the NFL", "Yup, this is definitely on my must-see list. Not because of TB12(boo!), but because of these four legendary actors.", "I'm definitely watching this but I'm curious about the true story this is based on.", "Finally something to go see at the movies. I love Tom", "My favorite show Grace and Frankie with special guests Sally and Rita!  This looks so good!", " These ladies are 80?!? I'm nowhere near their age but this is the club I wanna join!", "\"There is so many layers to this onion it made Shrek shit himself\" Holy fuck Charlie that has to be one of the hardest lines ever uttered", "My favorite elders in comedy. ️", "I was kinda on the fence about this until I watched the trailer. It’s gonna be awesome ", "I have never laughed out loud through an entire trailer.... First time for everything!", "Is the part where the Brady lady fans dance to get into the Super Bowl LI game part of the true story or not?", "Agree Lyli Tomlin deserves an Oscar too.", "If Tom is in this ima be geekin", "Well I'm a total Tom Brady lovers and I love all these actresses", "I can't wait to see it!!", "Even in Colt territory in Indianapolis I'm a Brady fan big time, as soon as I seen his college football reels and how he became the quarterback for the Pats when Drew Bledsoe got hurt and Brady took over, he really took over...I just dig the guy...cool cat...", "I’m 64 For Brady. I NEVER miss a game!!!!!!!!", "Now with the release of this trailer, Tom Brady needs to star in his own Curb Your Enthusiasm spin-off during his NFL offseason.", "Finally, another movie my MIL will drag my FIL to and brag about at our weekly Glory days meetup, she will declare it's awesome, he will confirm they saw it. Fucking GOLD!!", "this is incredible. this is beautiful. i cannot wait.", "I couldn't care less about football- especially Tom Brady-  but these are four of the funniest and most talented performers of the last 100 years. I hope this movie is good.", "Amazing", "I like how you can tell that hbomb is being... very selective... with his choice of words, in order to avoid legal trouble", "If they were gonna reboot the Golden Girls, here's your cast!", "I am smiling and laughing just watching the clip… good hearted movie to watch… hope it gets released in Australia ", "I can't with to see this movie. It looks hilarious!", "I will be in theaters to see this can’t wait go Brady we love youu baaaaaaah", "This movie looks hilarious.  Have to see it", "Oh my God, I'm in!  I can't wait to see thisssss!!!!!!", "Love this!", "Paramount has another almost 100 million or more domestic movie. I mean, unless overall reception is quite bad or audiences don't show up for reasons. Right now, this looks lots of fun and for both set of audiences, older and younger.", "Oh my goodness!!!! Wish they had kept Billy Porter a surprise though. But now I'm all the more excited.Love Billy so much!! Looking forward", "The cashier and super model meme is so relatable", "Sally Field & Jane Fonda! I love the story line tho! Can't wait to see this!", "I am so excited for this. I'm a thirty something year old generic football fan from NYC. ", "What a legend imagine hanging out with him for 1 day 3:-)", "wait why does this look so good tho", "I am no Brady fan but for these 4 ladies I will be in the front row!!  :-P", "Omg this looks amazing!", "Jane Fonda is unrecognizable.", "Brady Never fails to Impress", "Ahhhh. I love them sooooooo much! I can't wait.", "The ladies who aged gracefully look so much better than the one with the facelifts and the blonde wig.", "I’ll watch any movie even remotely Associated  with the G.O.A.T", "Yep I'll be there...rocking my Brady PATS jersey. This is a cast of LEGENDS", "This is gonna be awesome.", "guy fieri, tons of product promotion, and the nfl being involved means one thing.....\nthis film will be an amazing production to rival the likes of citizen kane and the godfather", "Lmao brady back in a pats uniform would’ve never thought", "I’m trying not to die laughing in school rn", "I'm even more excited to see what happens in the sequel \"Widows for Wilson\". ", "Can't wait. I have followed the GOAT his entire career,  MICHIGAN,  New England,  CHAMPA BAY. Gronk makes an appearance,  I'm going opening night. And to the Brady (TB12) haters....", "The doc is a machine", "This looks amazing!", "i will forever rewatch these kinds of video's.\nyou have given me happiness for the longest time and i will never forget that.\nyour physical form may not be here but i will remember the love youve given us. i will spread that love throughout the years.", "OK, This movie looks high-larious!  Gonna see!", "I love your videos soooo much and they make me  happy every time, thank you aphmau", "How about that when theyre transformed as the imposter role, their voice is disguised, so they can still talk, but the crewmates dont know who it is. :*", "Kratos didnt even try to kill the fates.Good for him.", "Can't wait to see it.. love all the girls on it too!!", "Gotta Love Jane Fonda, Cooll women ", "Okay this looks so cute and fun", "Rita Moreno! Fabulous!", "I so can't wait to see this! I'm soooo excited!!!!!!!!!!", "Its kinda sad to think about how many people were sentenced to death for being a witch", "There's 5 Academy Awards in that cast.", "Brady’s just happy to be back in NE ", "Hope they didn’t spend to much making this", "Can't wait for this! Love these gals!", "This looks SOOOOO funny!! I'm going to watch it.", "Chita is the oldest, she is 90. Sally is the youngest she is in her mid 70s.", "I can’t wait! This is going to be great! ", "Inspired by true story?\nThis is fun!", "I hope that Paramount drops the Scream trailer!", "My favorite show Grace and Frankie with special guests Sally and Rita! This looks so good!", "\"Good things come to people who wait, but better things come to those who go out and get them.\" ---Anonymous", "This could be the most embarrassing thing I've ever seen."]}