{
    "video_id": "1UbzyGP7hUU",
    "comments": [
        "The editing looks insane. Good job editor <3",
        "Just to start, Randy is a great hypeman for supporting the brand and his friends  in the way he did at the beginning, and his enthusiasm got the game to start off  fluidly. What a good lad!\nEdit: My God and him on the donut holes. I'm dead ️ Whole thing has been great. Theo w/ the faces was hacking.",
        "11:26 clip it",
        "Nice",
        "whoever edited this, shout out to you for using god’s menu by stray kids for the ‘du du du du’ parts with the nerf gun",
        "Jordz is so cute",
        "We need more dannnnnyyyyyh",
        "JORDs!",
        "NAH SIMON USING A STRAYKIDS SONG AT 3:00 IS THE BEST THING ",
        "Ahhh the fact that randy is correct and it’s real place in my area",
        "So is this video from a while ago since Chip is in footasylum",
        "chip not in locked in",
        "Oi oi chip out of locked out      \nHopefully he won",
        "Danny should be in way more videos",
        "19:25 I thought the same as Theo\n24:50 Not donut hole maker because that's just waiting donut which isn't efficient unless the hole bit can be reused. You have people pushers in Japan for the trains right though?",
        "Chip at the end lmao",
        "The lil bits of Gods menu ",
        "Theo is such a strange donny. Man is jokes ",
        "Best panel yet mate that fucking killed me ",
        "No way randy is that dumb bro  no one punches holes into donuts",
        "Glad to see Lord Jordz Back",
        "Chris has elite humour",
        "Theo is unbearable. Everyone else seems funny but he’s so overpowering in a non-funny way",
        "Theory is always on point in these videos, comedy not brains",
        "Not gonna lie I’m surprised “People Pusher” was left till the very end. That’s the one I went for instantly because of the videos of Japanese trains getting crammed in ",
        "Big up my brother from another mother Mr. Danny Aarons.",
        "theo and chip, two of the funniest people on youtube",
        "nice",
        "simons gameshows>>>",
        "Seeing Chip after watching him on lockedin is a dub",
        "Earliest I've ever been",
        "Theo is so annoying",
        "Theo using his phone behind the picture of his face….. just use the phone bro you’re not in prison",
        "37:58 ",
        "They dont know that you poke a hole donuts",
        "Gynocologists exist\nJordz: Nah.. that's gycolonist",
        "0:42 well hello there Japan",
        "Chip was Og",
        "Liked the video before watching it",
        "Bro these game shows are so good ",
        "22:10 Plants aren’t only asexual, there are male and female plants. \n\nFair amount of people would have heard of female and male cannabis plants.",
        "THE BIG GAME SHOW IS BACK.",
        "Danny Aaron’s should appear on more Sidemen related videos, he’s so Goodddddd",
        "Honestly love these videos ",
        "chip smashing it where ever he goes",
        "Yes Simon I enjoyed the vid love",
        "Danny's just happy to be there",
        "Even though it's a nerf gun, makes me so uncomfortable when they were looking down the barrel.",
        "\"I'm sure this hip one will work\" - GOLD",
        "JORDZ",
        "BRI WHY IS STRAYKIDS HERE!??",
        "Yo",
        "Paul breach",
        "3:00 stays where ya at ;)",
        "Jeez i hate theo and his arrogance",
        "Love to see Jordz back I was just thinking where’s he gone",
        "arnold schwarze- what theo",
        "Minister minister",
        "Woooooow",
        "Jordz is back!!!",
        "Seeing as people have to maintain the machine randy is right it is a real job",
        "What animal is Abu in Aladdin? TTTIGERRR! I died",
        "get max khadar for a video",
        "32:06 The Who Want’s to be a Millionaire reference is amazing",
        "GOD BLESS",
        "Whas this filmed after chip left the locked in house",
        "Nahhh i cant believe simon used a stray kids song sound in his vid ",
        "Another amazing video minister ",
        "6:44 Theo said migrant fuck",
        "You released this video at the wrong time , chip is still in locked in house   footasylum",
        "I've never seen anyone eat a cracker more slowly",
        "11:23 ayo what did theo just say ",
        "Congrats on being early and finding this comment ",
        "Love these but I honestly was so bored with the sub/viewer count round. Switch it next time please. All love though",
        "I think Randy might actually have special needs lol, I love him",
        "Absolute Banger ",
        "I feel there was some real salt on the episode between theo and chris",
        "Chip with the funniest end to a video. ever…",
        "Who else hears the skz gods menu in the beginning ",
        "Such a great game show",
        "Damn chip was brutal ",
        "11:25 Almost said the N word ",
        "Need more of chip he is too good ",
        "A. Luke B. Emia C. Aaron  love the reference",
        "How did Simon manage to find Stray Kids God's menu for a clip lol",
        "chip and Theo are so funny. we need to see more of them in sidemen videos",
        "30:16 look at his eyes",
        "A Miniminter game show wouldn't be a Miniminter game show without Theo Banjo Bake in it",
        "but Jordz started streaming in 2016... I started a twitch account in November of 2016 because my friends were watching him and I wanted to join in.",
        "11:27 mans just said the hard R lol",
        "pray for theo",
        "Mann sorry to say those sidecards are worthless in 5 years",
        "\"Who makes doughnut holes??\" Man people say how Ethan can be a dad and be so stupid. I am telling you, Randy's is much worse.",
        "Notification gang ",
        "Chris calling them tp is soothing",
        "The edit on this vid was sick",
        "jordzzz is back",
        "Chip is always fucking jokes",
        "absolute masterpiece of a video",
        "Excellent game show",
        "Bro simon has so much more potential doing these gameshows if he just asks more people outside of the friend group i swear",
        "Love these shows ️ Gotta laud all the work Simon does, the videos just never stop coming yet the quality remains great.",
        "Hello",
        "Thank you Miniminter these game shows you do are awesome.  󠁧󠁢󠁷󠁬󠁳󠁿",
        "I used to be a doughnut whole maker",
        "Theos is lower than burntchip not higher",
        "im actually in tears over this. So fucking funny",
        "I wish . . . I didnt click this video",
        "Theo needs too look up how to make doughnuts…",
        "the ending is top tier",
        "Issue here, there is a man called John Dickmann, who's linked in job is, donut hole poker at spankys House of fine donuts",
        "Theo got vioalted by chip",
        "Waited 3+ months for my side cards to get all the way to NZ only to get no rares ;(",
        "Nah this is a re upload",
        "bro I did a project on weird jobs and I know all of them, I'm just different",
        "Chip was amazing in this",
        "theo needs to chill LMFAO good vibes with the other 5 he's too competitive",
        "Jack:  being confused about how Freya is getting across big gabs",
        "Lovee the gameshow videos",
        "glad to see jordz again reminds me of og miniminter days",
        "Banger of a viDeo",
        "Doughnut hole poker is a real job. Just looked it up",
        "theo is so proud of his \"tallent\"",
        "2 Girls 1 Cup Nah man I can never forget that , it will be traumatising for the rest of my life",
        "Stray Kids world domination",
        "\"Pillow Fluffer\" is a real job btw...",
        "GOD IS GOOD  GOD loves you ️",
        "Fuck I’m so so happy to see jordz ",
        "Chips been released from locked in and his just straight ruthless",
        "Santa lives in Lapland, not in north pole",
        "These game show videos are so funny. I was literally sitting here going \"BRUCE WILLIS!!!\" Screaming at my monitor.",
        "2:02 - am I tripping or was that God's Menu by Skz?\nand again - 3:01",
        "should do a video of some sort with harry and some other well known og fifa uploaders vs danny aarons and pieface and another new gen fifa uploader and call them old v new or something",
        "Theo legit said the n word… 11:24",
        "Finally, been waiting for another Episode! Most enjoyable series",
        "Wat the hell is chip doing there",
        "Not everybody on set thinking donut don’t have hole poke in them",
        "Not only is it not real why the fuck would a plant go to one of them ",
        "3:00 NOT GODS MENU BY STRAYKIDS BEING PLAYED",
        "2:02 STRAYKIDS IN THE BACK?!",
        "this video was so jokes ",
        "Editing is on point",
        "Side Cards are just Physical NFT’s\nthat work! (helps the fans make money)",
        "Who else hears the skz gods menu in the beginning",
        "Bro no way those crackers are that hard to eat",
        "YAAAAY",
        "Hearing Theo talk about how donuts are made, absolutely hurt my brain",
        "STRAY KIDS??? at around 2:59 just me?",
        "I've been saying Jim \"carry\" my whole life lmao",
        "Simon should get the sidemen to do this sort of game show",
        "the ultimate mashup of shithousery. Love it!!",
        "Congrats to everyone in the comments who’ve already managed to watch the video 🫠",
        "I’ve missed Jordz haven’t seen him in forever",
        "STRAYKIDS EVERYWHERE ALL AROUND THE WORLD ",
        "28:35 - New names?",
        "Whoever edited this, goated",
        "These google pixel ads are funny as fuck, and that's on the dead dunzels",
        "LMFAO i heard gods menu  that’s so random but chan will be so happy",
        "Big up Chippo crimes",
        "missed this",
        "How did they not see Bruce Willis",
        "That's funny game",
        "Wasn’t chip in locked in now",
        "Bro I love Danny he is so funny get him in more videos. ",
        "Heloooi",
        "Danny doing the quick fire questions had me dead ",
        "LOVE these vids Simon! Keep em coming!",
        "WAS THAT GOD’S MENU BY STRAY KIDS PLAYING AT 3:00????",
        "The stray kidz sound effects",
        "editing on this is sick",
        "At 2:56 is it gods menu from Straykids or am I hearing things?",
        "11:24 is actually insane",
        "goldfish",
        "Theo went ultra instinct",
        "Simon let me on this game show, I’m insane at this stuff",
        "Really love this series would love to see rap or crap return as well",
        "chip firing shots at the end was so funny",
        "Chip roasting Theo at the end is amazing",
        "love how theo got people pusher right but still doesn't know how donuts are made",
        "What in the stray kids Gods menu",
        "3:00 stray kids ???",
        "16:21 he made me laugh so hard lol",
        "love danny is now being in more videos",
        "3:01 was that Stray Kids DU DU DU",
        "Theo is actually so jarring in this vid",
        "JORDZ IS BACK!!",
        "The way Theo said Arnold’s name  He likes to play with fire lol\n\nTime Stamp : 11:20",
        "Theo is such a bad teammate",
        "Chip has the best one liners I swear ",
        "seeing Danny Aarons in these vids just make me happy",
        "100% a real job. 100%",
        "danny aarons x troops is jokes",
        "“That’s a slapper” is a really good line from randy",
        "This was driving me crazyyes people make donuts by taking out the center with a circular cutter not only shaping it in an O",
        "Ehh hair THATS FUCKING MADDDDD OMGGGG IM CRYINGGG CHIP THAT ONE LINER HOLY ",
        "That last joke from chip tho ",
        "Theo your hair looks nice brother! Don't take that",
        "Good video, Simon. Keep up the great work ",
        "Chips roast session at the end on Theo is golden.",
        "The roast of theo at the end by chip wow lol ",
        "Traditionally donut hole poker is completely a real job, how do tf do you think donut holes were invented? Granted now things may be done by machine but technically... ! Lol",
        "Why everyone on Theo neck ",
        "Me commenting just so there are 69 comments\nEdit: ladys and gentlemen we have done it",
        "Theo does my head in ",
        "Not sounds from SKZ gods menu",
        "They are called Timbits !",
        "Randolph is right, you usually poke a hole out of the donut, but it’s just part of making donuts, it’s not a specific job for one person to have. It’s just part of the process.",
        "Amazing been waitin time for this video",
        "Randy thinking donut made hole is hilarious",
        "this edit is insane",
        "My bedroom ceiling just fell down and so seeing a hole this is nice  Cheers",
        "OOOOOO LOOK AT ME IM GREAT AT TELLING PEOPLES FACES but I can't tell fucking businesses .",
        "such a banger of a series",
        "i never got recommended this",
        "if you didn’t put chris in the thumbnail i wouldn’t watch",
        "2:02 when he shoots it's the sound from God's Menu by Stray Kids\nEdit:\n2:36 again\nat 3:00 again but it's more this time",
        "28th",
        "wish u upload more of these types of  vidz love them .",
        "30:15 jordz becoming possessed",
        "Best miniminter video ",
        "Guys! Guys! I’m here…. ",
        "saving Grace!!!",
        "everyone this video was hilarious.",
        "Chip at 37:58 ",
        "Chipo just loves cooking theo haha",
        "Guess this was filmed before Chip went into the Locked In house",
        "Randys the real donut here",
        "Ugh why jordz",
        "Back at it again with another banger",
        "Jeez",
        "i swear nobody makes me laugh as much as theo baker does",
        "Don’t worry Theo, is Americans call her ScarJo sometimes",
        "Randy is right donut hole pusher is a job in the states dunkin donuts sells “munchkins”/mini donut balls that are the centers from when they make and push out the donuts, munchkins were created to find a use for the center after and not have so much waste just saying️",
        "w editing",
        "not gods menu being in this vid - i just know channie  is kicking his feet and giggling rn",
        "Absolute banger  Insane edited video Love you Minter 🥹️",
        "This was hilarious.",
        "kum & go is local to me so it was hilarious watching them pick everything but that one LMAO",
        "danny arons is acc so class",
        "It's supposed to be a sidemen vdo",
        "Very amazing game",
        "niko and chunkz will be jokes in this",
        "i do agree with RANDY still and the fact that he backed his answer with facts n evidence should give him a point right anybody",
        "If your reading this have a fantastic day",
        "\"Goldfish\" ",
        "Randy and his doughnut whole poker was hilarious ",
        "Chip is the best YouTuber rn , his channel bangs , he makes locked in amazing and anytime he’s a guest the video goes from a 10/10 to 100/10",
        "i was wondering where Vik went, but then i realised Vik wasn´t in the vid. It was Danny.",
        "Ayo 11:23 Theo movin mad bro  he playing with fire",
        "Chip out of locked in ??",
        "Nice to see danny more in these vids",
        "Randy ",
        "Did I just hear the stray kids \"du du du\" from gods menu",
        "Chip violating theo at the end had me creasing ",
        "\"Where is the Great Pyramid of Giza\"..... LMAO",
        "32:07 the same joke as Harry did  \niykyk",
        "Arnold who?",
        "the world definetly needs - saddong hussein",
        "You have to give credits to the amazing editor.",
        "11:24. Theo… wym by that?",
        "37:45 had me in stitches ",
        "That is very funny and amazing",
        "hello simon\nits me",
        "Nice vid",
        "21:25",
        "Chris is incredible man",
        "It's been so long since I last saw Jordz. I would love to see more of him on the channel.",
        "Such a great game show, everyone on set is so entertaining. Great video as always Simon ",
        "I CANT BELIEVE SIMON USED STRAYKIDS",
        "Too much edits at the start imo",
        "Theos obi voice was on point",
        "My boy chip is doing teo bad in this banger video",
        "I thought chip was on locked in",
        "Donut hole poker is just a baker",
        "NO WAY CHIP GOT EVICTED FROM LOCKED IN",
        "Danny is Simon’s Speed",
        "Main channel vid is a guaranteed W",
        "what the fuck did theo just say????!!!!!!!!! 11:23",
        "Danny’s a cool and new addition to the video",
        "These videos are funny, but it’s also sad that it reminds me how unintelligent a lot of YouTubers are - they don’t even have the level of general knowledge an average person would!",
        "This must have been filmed before chip went on locked in",
        "Can confirm Kum & Go is real, I live 1 min away from one",
        "I assume they were all familiar with sasha grey because she was in entourage. Otherwise...",
        "the gun shot sound effect comes from a big fan",
        "I think I’m in love with Danny",
        "Not me screeming Bruce Willis to the screen",
        "Editing on this video is sooo good",
        "\"I am the many faced God\"\nLove the GOT related line from Theo",
        "The Theo and Chris combo is GOATED!",
        "love seeing chip in vids",
        "What a cheat ChrisMD was...that cheeky LITTLE man ",
        "This video is priceless",
        "the fact that the only times i got the ad with tobi and jj in it is when i watched a sidemen or simon video",
        "The Jim Carry x Arnold face mash I thought Jim Carrey was Reev!",
        "IS NO ONE MENTIONING HOW THEO SAID ARNOLDS NAME AT 11:20",
        "Damn Chip was going in on Theo at the end",
        "Chip on fire in the end",
        "Chips underrated, he’s actually quite funny",
        "Arnold what ",
        "This vid has to be before chip went for locked in S3",
        "16:08",
        "I’ve missed Jordz so much",
        "I love these vids",
        "Danny Arrons the guy you just randomly happened to meet one day & now he da vice prime minister of the gang",
        "Ive always wondered if Aph would take revenge one of these days >:-(",
        "Randy adds nothing to these vids",
        "lowest video video... wow",
        "Alway fun when simon posts",
        "Gods menu at 3:00 ??",
        "my guy said rip joe weller",
        "No gay...  Danny is actually looking pretty good in those glasses.  Classy",
        "266th",
        "I love the sidman",
        "can you react to latest harry Mack video??",
        "Whos the black guy?",
        "Simon=best sideman",
        "11:25 what did he say? ",
        "Speed shouldve been on this",
        "11:29 I honestly thought it was Jim Carey and reev hahahaha",
        "We love Danny!!",
        "What is God’s Menu doing in a Miniminter video ",
        "Simon, you should do Christmas special of this with the sidemen crew without making it of a sidemen video.",
        "yes miniminter using stray kids",
        "Ayeee Straykids dududu playing at the 3:00 min mark! Sidemen should react to Straykids!!!!",
        "Did I just hear a Stray kids song in this video? You have taste man",
        "luke emia reference nice",
        "“How many pairs of legs do spiders have?”\n“8”\n“Correct”\nMe: ",
        "Chip was jokes in this what a great guest",
        "Chip and Theo at the end ",
        "That Vio at the last part",
        "These videos are jokes , keep them up ",
        "u actually use a cutter to make the holes in a donut but it aint a job on it self",
        "Real ones know Sasha Grey has a music career",
        "Am i the only one hearing gods menu by stray kidz as the shooting noises",
        "Theo reminds me of that Paul bloke from tiktok",
        "I’ve always liked chip but it hits different after seeing locked in s3",
        "19:58 he's not wrong",
        "Chris \"I need some more toilet paper\"",
        "skipping the part when theo said the n word",
        "hi",
        "Minister really the only entertaining individual Sidemen channel right now, much love <3",
        "The best series on YouTube!!!!!",
        "Does that mean chip got evicted from foot asylum",
        "Chips so underrated",
        "they r all so not funny",
        "Wow amazing game",
        "editing in this video is so good",
        "Lol Simon being a host is legendary",
        "was that stray kids i hear after chris shoots",
        "Chip's got that Max Khadar touch after locked in",
        "W chip",
        "Vikk did Warzone stream today and now SImon with the classic gameshow!!! What a day\n\nGIGACHAD GOATS!!!",
        "3:00 it plays gods menu by skz",
        "Wow these comments are such a short while ago",
        "Theo says the n-word at 11:20",
        "how has chip escaped the locked in house ",
        "at a buffet, i personally sneak corndogs into the buffet so others can enjoy them. I hide 6 corndogs in my jacket pockets. it then, is a joy for me to see other patrons of the establishment eat my corndogs thinking they were part of the buffet.",
        "Danny Aaron’s a legend",
        "Could not have been worse timing I just go to school",
        "Chip was so good",
        "Its always the best to come home from school and watch Cory. He's energetic and fun. Its always enjoyable to watch his videos.",
        "danny shouting answer ahaha",
        "11:49 I swear thats just cameron diaz",
        "love these game shows",
        "Haven’t seen jordz in ages!",
        "WAIT STOP️ITS NOT TO LATE TO TURN TO GOD BUT SOON IT WILL BE️YOU’RE NOT PROMISED TOMORROW REPENT AND SPREAD THE GOSPEL AND PRAY ",
        "W",
        "Wouldn’t normally watch but Danny Aaron’s is a W",
        "Randolph is right about the donut hole poker job. You do have to poke a hole manually, you can't just connect 2 ends together",
        "I was enjoying this video right up until Simon said die hard is a Christmas film because it’s not it never has been and never will be",
        "ft. stray kids",
        "hows chip here? isnt he in locked in currently?",
        "Randolph is so annoying",
        "03:46 video video?",
        "woah i’m from bremerton washington, that’s pretty crazy randolph said that ",
        "We not gonna talk about Theo’s Arnold Schwarzenegger pronunciation?!?!",
        "This gameshow has that oldschool sidemen vibe",
        "collective IQ of the contestants sub 600",
        "Chip is hilarious",
        "That’s how numbers work ",
        "reuse harry joke",
        "I don’t blame Theo, Scarlett Johansson was and still is my celebrity crush. She is a CERTIFIED BADDIE!",
        "great game , loved it",
        "JORDZZZ  he’s been MIA for so long . Missed him sm ",
        "11:23 simons set Theo up right there",
        "3:00 SKZZZZZZ",
        "Thanks yt I’ve been bored for days could of shown me this vid ",
        "Connect the ends lol they really never seen a donut before",
        "Theo is wrong about doughnuts. Bagels are made that way, doughnuts you poke holes, that's what those munchkin things at dunkin doughnuts are. They fry the dough cut from the holes",
        "Chris MD is the driest most boring guy ",
        "Nemo was a goldfish ",
        "Is it even real. After we found out the bad holiday ones are fake, I don’t believe a thing these guys do or say.",
        "stray kids everywhere all around the world even in a miniminter video who would have thought",
        "I’m confused on how chip is in this tho I swear he’s in locked in",
        "Keep up the great content ",
        "So proud of Danny Aaron’s bullied in high school for making videos look him now",
        "Before or after locked in",
        "BANGA OF A VIDEO , these trios are unmatched",
        "Watch Weller make a video about this and call chip out for a fight in a car park ",
        "Leggoooooooo",
        "Could feel beef between theo and chris",
        "Chip just burns Theo ",
        "I have just seen the thumbnail and can tell its a banger",
        "Theo tries to hard to be involved",
        "I'm ecstatic because this is my favorite series of Simon's but even more so because Jordz is back",
        "Main channel kinda dead",
        "thank for your show",
        "The edits are wild, I love it ",
        "hi m8!",
        "Chippo crimes is goated. Hes soooo fuckn funny man \nAlso theo and chris going at each other is the best",
        "i can't lie the editing in this video is so sick",
        "Theo is elite",
        "Jordz!!! :)",
        "",
        "Worlds best game show is back I missed these",
        "you need to get danny in more irl vids, hes so funny and the chemistry between you and him is mad",
        "Chip is so underrated",
        "aint this reupload?",
        "Yo fight between CHIPPO and WELLER",
        "chip just violating theo is the funniest thing",
        "29:35 What a bad ass",
        "my favourite gameshow is back",
        "That’s not how donuts are made. They all wrong. ",
        "I love you guys",
        "video video",
        "Theo insulting Chris and Chip insulting Theo was jokes",
        "Where does Chip has his Hoodie from?\nKinda wanna buy it, looks very good",
        "3:00 Straykids world domination",
        "11 22 i swear theo said the n word but i understand that was his name he was pronouncing",
        "These are so fun to watch! Keep going",
        "banger of a video",
        "How have people watched a half an hour video in 3 minutes? Madness",
        "Vik did a warzone stream today \nMore sidemen upload another among us video\nSimon did a main channel video",
        "shout out to danny aaron’s carrying the video <3",
        "Genuinely gotta believe that's a real skill how tf is Bruce Willis In that photo",
        "I'm a doughnut hole poker. Thanks Randy for standing up for me ",
        "Why does Danny look so different with glasses on",
        "Anyone else miss Gee in Simon, Talia and Freyas videos",
        "Theo saying arnolds last name is sus",
        "Be great if Chris wasn’t ever involved in these",
        "Chip’s a menace at the end lmao",
        "Chip with the jokes",
        "Chip absolutely annihilated Theo the last 25 seconds ",
        "Love chip",
        "Danny aarons is so goated, he needs to be in a sidemen sunday",
        "SONEGOOOOOOOOOOOOOOOOO",
        "my favorite series",
        "ohh I'm so happy to see Jordz! I used to be a regular viewer of his on Twitch.",
        "They definitely do poke the holes in donuts.",
        "Back again let’s go",
        "Broke my leg the other day, simons videos helping me get through it.",
        "about time",
        "Theo needed that last bit of banter from chip.",
        "But 2 girls 1 cup is real so u can find it and knowledge urself now)",
        "3:00 2:02 2:36 EDITOR ILY FOR PLAYING GODS MENU BY STRAY KIDS",
        "They actually got robbed there lol, doughnut hole poker exists",
        "Theo chip Chris and randy man",
        "11:20 Jim Carrey and who??",
        "Its nice to see this side of Chip rather than the nice one from Locked In",
        "I thought the Jim Carey/Arnold mash up was part reev hahaha",
        "Nahh Chip insulting Theo at the end was the best ",
        "GODS MENU AT 3:00 ??????? HELLO?!!?!! SKZ",
        "Yes Simon! Die Hard is indeed the best Christmas Movie",
        "Chip's last line omg ",
        "JORDZZZ, missed him man",
        "Chips insults at the end to Theo were a violation! Haha",
        "I love these game show videos ",
        "Chip at the end just had me in tears",
        "About the doughnuts it’s not done the way there saying it’s basically done before there cooked with a cutting ring and then a smaller one put inside to cut it out of the dough and a machine probably does it similar way",
        "3:00 Felix?? Gods Menu??",
        "Praying on Danny’s downfall in this video bc of the inter jersey",
        "What does chip say at 37:56?",
        "FREYA JOSH ETHAN  vs HARRY TOBI TALIA",
        "Theo get a sponsorship from keeps already god damn",
        "11:22 ayo I swear theo just said the n-word, by the way he pronounced arnis name lmao",
        "i thuogh chip was in footasylum",
        "These are so good keep there up",
        "So much fun!!!! :) Thank you!!",
        "3:00 gods menu is that you? not my two world colliding i cant  STRAY KIDS WORLD DOMINATION",
        "Pound Town is in Kingsbury",
        "I mean, a pillow fluffer is a Job, just not a \"traditional\" job, ahem....",
        "Naaah, get better guests next time\n\nEdit: Theo baker saves the video",
        "Even if this video was , Chip in the final 30 seconds would have saved it. My God",
        "This is a trivia show not a game show sorry",
        "Who does Simons editing ",
        "I remember people pusher from the only in Japan sidemen reacts vid",
        "Keep em coming",
        "Brunt chip was too funny in this video ",
        "Washington is wrong that’s now even the right state, Washington DC and Washington are two completely different things",
        "Couldn’t stop laughing at the fact 6 grown men thought a doughnut is made by connecting the ends",
        "chrismd's daily avg views is around 450k, aint 209k",
        "69th ",
        "B",
        "I'm from Bremerton, Washington. Can confirm Spankies is not real",
        "I love these high budget videos Simon!!",
        "Simons game shows are always so good",
        "you  should bring max khadar onto the show",
        "Love seeing anny daorons here",
        "37:43 chip ",
        "Thought that was jme for a good 10 mins"
    ],
    "comments_disabled": false
}