{"video_id": "1UbzyGP7hUU", "comments": ["theo just insulting chris is the funniest thing", "Chip was jokes in this what a great guest", "glad to see jordz again reminds me of og miniminter days", "I'm ecstatic because this is my favorite series of Simon's but even more so because Jordz is back", "Genuinely love seeing Danny Aaron’s getting involved with more collabs recently. Great kid and good to see him come out of his shell", "NAH SIMON USING A STRAYKIDS SONG AT 3:00 IS THE BEST THING ", "chip firing shots at the end was so funny", "The way Theo said Arnold’s name  He likes to play with fire lol\n\nTime Stamp : 11:20", "Danny's just happy to be there", "What is God’s Menu doing in a Miniminter video ", "i swear nobody makes me laugh as much as theo baker does", "Such a great game show", "Seeing Jordz every now and then is so refreshing, brings me back 4 years", "Probably the best people you could of picked for this game show ngl, probs to Chip today, made it hella funny", "The Theo and Chris combo is GOATED!", "Couldn’t stop laughing at the fact 6 grown men thought a doughnut is made by connecting the ends", "These game show's are soo much fun to watch! Keep doing them pls!", "Chippo crimes is goated. Hes soooo fuckn funny man \nAlso theo and chris going at each other is the best", "I love that Danny has become more of a part of the UK youtube scene, the dude is so funny I love watching him", "Chip roasting Theo at the end is amazing ", "you need to get danny in more irl vids, hes so funny and the chemistry between you and him is mad", "Vikk did Warzone stream today and now SImon with the classic gameshow!!! What a day\n\nGIGACHAD GOATS!!!", "Such a great game show, everyone on set is so entertaining. Great video as always Simon ", "I know he won’t see this but Simon is my favorite sideman and it is so fun watching him because he is so funny and amazing, his charity match performance was insane! He is amazing!", "Randy and his doughnut whole poker was hilarious ", "“DU DU DU” Simon using gods menu by strays kids for sound effects", "37:45 had me in stitches ", "Chip absolutely annihilated Theo the last 25 seconds ", "chip and Theo are so funny. we need to see more of them in sidemen videos", "A Miniminter game show wouldn't be a Miniminter game show without Theo Banjo Bake in it", "Danny and Randy in the last round was embarrassing ", "Theo was on smoke in the multiple faces round ngl ", "The editing looks insane. Good job editor <3", "Glad to see Lord Jordz Back", "The ending had me dying “I’m sure the hip one will work”", "Love these shows ️ Gotta laud all the work Simon does, the videos just never stop coming yet the quality remains great.", "Chips underrated, he’s actually quite funny", "Been waiting for the return of this!! Hope we get a Christmas special", "Seeing Chip after watching him on lockedin is a dub", "Chip roasting Theo at the end is amazing", "Chip absolutely destroyed theo at the end there", "We not gonna talk about Theo’s Arnold Schwarzenegger pronunciation?!?!", "How did Simon manage to find Stray Kids God's menu for a clip lol", "These are so fun to watch! Keep going", "Simon loves himself a bit of Danny, got him doing so much recently, love to see it", "Danny’s a cool and new addition to the video", "Randolph is too funny man ", "Nice to see danny more in these vids", "Danny doing the quick fire questions had me dead ", "and an amazing vibe!!! ChrisMD is class as always. Harry would have been cherry on top!", "These game show videos are so funny. I was literally sitting here going \"BRUCE WILLIS!!!\" Screaming at my monitor.", "Good video, Simon. Keep up the great work ", "\"I am the many faced God\"\nLove the GOT related line from Theo", "32:05 that legendary moment never die", "I love these high budget videos Simon!!", "“That’s a slapper” is a really good line from randy", "chip smashing it where ever he goes", "This video just made my day ️ ", "Keep up the great content ", "Chris has elite humour", "Yet another banger gameshow. Top notch from everyone", "Jack:  being confused about how Freya is getting across big gabs", "I love these game show videos ", "Chips insults at the end to Theo were a violation! Haha", "Jordz!!!! It's so good to see him again.", "love how theo got people pusher right but still doesn't know how donuts are made", "It's been so long since I last saw Jordz. I would love to see more of him on the channel.", "Love to see Jordz back I was just thinking where’s he gone", "The edits are wild, I love it ", "Theo needed that last bit of banter from chip.", "Chipo just loves cooking theo haha", "Those last 2 minutes were gold", "Not gonna lie I’m surprised “People Pusher” was left till the very end. That’s the one I went for instantly because of the videos of Japanese trains getting crammed in ", "Love seeing jordz again. The nostalgia!!!!", "Danny Aaron’s should appear on more Sidemen related videos, he’s so Goodddddd", "Really love this series would love to see rap or crap return as well", "Brunt chip was too funny in this video ", "Bro I love Danny he is so funny get him in more videos. ", "i can't lie the editing in this video is so sick", "Chip violating theo at the end had me creasing ", "Finally, been waiting for another Episode! Most enjoyable series", "absolute masterpiece of a video", "Chris calling them tp is soothing", "Chip’s a menace at the end lmao", "im actually in tears over this. So fucking funny", "This gameshow has that oldschool sidemen vibe", "LOVE these vids Simon! Keep em coming!", "Theo insulting Chris and Chip insulting Theo was jokes", "Damn Chip was going in on Theo at the end", "All quiz/game shows need to have a score tally on the screen at all times", "Its always the best to come home from school and watch Cory. He's energetic and fun. Its always enjoyable to watch his videos.", "ngl the game show videos are probably my favourite ", "Simon should get the sidemen to do this sort of game show", "I need more of this gameshow", "Bro these game shows are so good ", "This hurts to see, why’s he only got 180k views in 5 hours, under appreciated asl", "Hearing Theo talk about how donuts are made, absolutely hurt my brain", "Chip at the end just had me in tears", "ohh I'm so happy to see Jordz! I used to be a regular viewer of his on Twitch.", "Chip just burns Theo "]}