{
    "video_id": "2lFOyVEYDk4",
    "comments": [
        "I was too old to ever watch her videos so all I really know about Acacia are the racist tweets and accusations of animal and child neglect but also I don't know enough to judge 100%. Despite that, I loved this. And it was nostalgic. I still have my Too Faced bronzer and like to sniff it sometimes and my old ABH palette - fall out galore. ",
        "Brittany has shown me that I guess I still do my makeup like 2014 and I feel bullied",
        "i know brittany will never see this but i’m obsessed with her i’m i’m never obsessed with people. every ounce of my being wants to be her/her bestfriend. brittany broski, if you see this, you’re who i strive to be. phenomenally great. those are the two words i would use to describe you",
        "As someone from Sheffield, I feel seen ️",
        "Ily thank you for blessing us with this wow it THREW me tf back",
        "the way the lashes said “615” and you said “516”",
        "Looking like Miley with that eyeliner on",
        "I just met Brittany at the 1975 show in Nashville the other night and she was such a kind person! Thanks Brittany for saying hi when you didn’t have to!!",
        "not from sheffield, but i do go to uni in nottingham and i feel like thats just as bad. thanks for making me feel percieved  <3",
        "she was bullied because she’s been accused of neglecting/abusing her kids and animals",
        "I love the second wing because its like a reinforcement of the 2014ness of this. A shadow of the tumblr-MLIA-fanfic hellscape we all narrowly escaped...",
        "How do I become a meme am I too old to be internet famous ? :/:/",
        "Me cackling at those 3 palettes bc I still have all of those til this day and will never get rid of them til my fave colors run out!!!",
        "Tell me why it wasn't until 20 minutes in had a flashback of doing this exact make up look",
        "I literally just threw away my Modern Renaissance Pallette  I kept holding onto it for dear life and needed to come to terms that it’s like 5 years old and crusty",
        "The Modern Renaissance palette & the Too Faced peach & chocolate bar palette is ICONICCC!",
        "The fact that I still do my makeup like that ",
        "brittany ily but deftones is not emo nor grunge LOLLL",
        "ur literally a year and a half younger than me but i keep thinking ur like 22/23",
        "LOST MY MIND WHEN I SAW YOU RECREATED THIS VID LMAOOO this makeup tutorial changed the trajectory of my life",
        "This video teleported me back to high school thank you",
        "everyone wanted to be acacia so bad",
        "coming. now we all just want to not live lmao also not throwing away makeup gang",
        "Hi hen, I'm from 10 minutes out o Sheffield",
        "Girl I still use my original modern renaissance palette regularly lmaooo ",
        "Can’t believe we were living in the golden age of eyeshadow palettes and didn’t even know it",
        "this is everything",
        "Jeez this video took over my life and i forgot about it",
        "Brittany when you did your eyebrows you literally look like your pfp you have for your TikTok ",
        "Not me still doing this lewk as a 27 year old",
        "i love the absolute joy you exude throughout this vid and how happily you embrace the 2013-2014 energy",
        "Do a zoella one next!!",
        "I’m going to be honest, I lost interest in the beauty community in like 2017 and the two faced palettes are still like top of the line from my perspective lol, guess they’re relics of the past huh",
        "I wanted to use eos so bad, I ended up with a bit of a collection, but I am SO ALLERGIC to it  as a 13 year old, I was devastated. still carried it around with me, of course, I had an image to uphold ",
        "She comes into my work all the time with her kids it’s always a trip seeing her ",
        "No because I'm 24 and I pretty much still do the same makeup routine to this day whenever I can be bothered to put makeup on ",
        "“why did the internet bully her so hard” stop this just reminded me of her singing the “i said noOoO” please tell me someone remembers the ruthlessness going on at that time ",
        "Emo, but blonde? Congrats you're scene ",
        "18:41 no, you look like Uncle Fester actually  ",
        "ayeee 1738… yeah",
        "The editing is different? I miss the meme references like I don't know the Squidward is sick meme I want to be in on the jokes ",
        "Being in a state of drunken delirium after a heavy night out but Brittany’s video keeps the buzz going and I am HERE FOR IT!!! ️",
        "The eyelash curler description sounded like an amazon listing",
        "BESTIE I’m from Sheffield!!! hiya omg love you Britney!!! u orate babes xx",
        "Excuse me we are wearing the same strawberry earring pack from target rn and my day has been made",
        "ayeeee Sheffield close enough",
        "BROOO at 23:49 she looked like that white bug from that miss spider show on disney ",
        "the way i bought that falsies mascara bc of acacia and used it for YEARS",
        "U look like that one Elephant from one of the Barbie movies that they put lashes and eyeshadow and shi on\nLove u Britain 🇬🇧 knee",
        "i still use the modern renaissance palette all the time ",
        "23:49 I wasn't ready for the Flashback Mary jump scare ",
        "I died when the Eos lip balm egg came out",
        "ive done makeup like this since i was 14 and im almost 24 now i think i need a makeover lol",
        "idc the semi sweet chocolate bar palette is iconic it was the first pallet i ever bought for myself",
        "girl I’m still using that naked makeup brush as on of my SOLE brushes :,)",
        "Very nice",
        "We need a sibling rivalry x breaking community guidelines please",
        "the way this comes out at the same time tiktok is spilling some major tea on acacia is so funny",
        "Its not a want but a NEED for Brittany to do full traditional goth PUHHHHLEASE",
        "Timmy \"EUCALYPTUS\" is from the leaves of a Gum Tree that Koala Bears eat, it's NOT a fruit  It originally comes from here in sunny Australia  GREAT STREAM (proximity chat fucken rocks)i watched Pt's 1 & 2 LIVE cause i couldn't sleep until you finished the stream THANKYOU VERY MUCH now I have insomnia Im probably going to watch them again",
        "Not me recently finding my peach palette in the back of my under sink cabinet, and now it’s my favorite palette all over again  and I still swear by the naked brushes ",
        "If you don’t know why she was bullied, please look her up and all her drama. There’s….a lot. The latest of which being she’s abusing / neglecting her youngest daughter who has a medical condition 🫣",
        "Brittany: I set the video to 1.5x for everyone’s sake.\nAlso Brittany: AKAKIA GIRL YOU ARE GOIN ENTIRELY TOO FAST OH MA GAWD",
        "Brittany, how does it feel that I’m watching you at the age you watched her.",
        "Please be my friend",
        "This is still the same style of makeup I use 10 years later because this is how I learned how to apply makeup and I haven’t bothered to watch any tutorials since I am not ashamed",
        "I still do my makeup like this and refuse to change ",
        "Sheffield here hun ",
        "i forgot about acacia",
        "i'm from near sheffield  (actually holmes chapel lol). broski nation north of england representative",
        "I have also been getting into deftones lately beyond the fur is my fav album so far",
        "Omg I had this video memorized",
        "Oof I still use the naked brush",
        "LMAO never knew who this girl was until I saw an episode of Catfish the other day and she was on it now you’re talking about her ",
        "The way I was searching through Pinterest the other night, reliving the swag-onedirection-fangirl-tumblr-xmas lights-ugg boots era",
        "I'm officially greeting everyone with \"welcome to my face\" now",
        "I do my daily make up by sunlight to stay humble af ",
        "The way I have no idea who this girl is despite being in every relevant online space at the time that I should know her lmfao ",
        "I always watched her tutorials too but I think she was probably a few years younger in the one that imprinted in my brain. She had long hair and did it in her bathroom. I think she literally did 3-4 layers of mascara so I did too ",
        "i kinda love you",
        "\"I don't know if I have dark circles or if I just have bug eyes\" I have both",
        "doing my makeup in sunlight is INCREDIBLY humbling",
        "Monet x Brittany is what I need. Real bad.",
        "Truth is my chocolate bar also a original purchase just this year jump off the edge of the sink into the toilet so ….",
        "Well I just had a blast here! Thanks gurlie",
        "I knew that was a Colorpop brow pencil the second the spoolie end fell off",
        "\"i dont care if i live or die\" we are the same",
        "why is this giving “i love matty healy”",
        "omg the acaciabrinleyification of broski",
        "idk anything about makeup and im really stoned as of typing this but like honestly it looks good girl you continuously slay",
        "THE DIRECT SUNLIGHT PART LMAO YIURE SO FUNNY",
        "you bodied this but why tf does the wing have a drop shadow LMAO",
        "ok but brittany listening to deftones ok!!!!",
        "23:50 is giving flashback mary",
        "Thank you everyone who donated, so glad to be apart of this community, so glad I was able to see the stream and donate what money I had",
        "i still have my mini too faced chocolate bar pallete from 2016 and all of my anastasia stuff omfg",
        "I remember this makeup era so vividly because of my liner wasn’t even they’d just get bigger and bigger until I was unintentionally back into my goth faze ",
        "Would love to do this if my eye lids and face wasn’t so oily :(",
        "You have brought so much light into my worldIf you like Latin music and in particular, meaningful music, check out RESIDENTE AND ILE",
        "Thumbs",
        "Arctic monkeys aren’t emo ",
        "I love it when Brittany grabs us by the throat and moves our pov ️ also I always thought you'd slay a Bonnie Tyler look. (especially the one she used in Total Eclipse of the Heart)",
        "How I KNOW I'm getting fucking old is that I still do this look....",
        "17:10 IDK WHY BUT THIS PART IS SO FUNNY",
        "I was like 23/24 in 2014 and I can’t even remember what was trendy back then lol damn this memory",
        "Brittany is literally so gorgeous",
        "Why is nobody talking about how she called her a-cocky-a",
        "Brit, you and Sarah need to do a podcast episode on just her",
        "I LOVE that shes getting into Deftones but i wouldnt say theyre emo/grunge. More like 2000s alt metal. That genre definitely had a bit of crossover with the emo scene though",
        "brittany: perfectly blends her eyeshadow\n\"that'll have to do\"",
        "the internet bullied her because THEY WANTED TO BE HER SO BAD!",
        "Superb information",
        "Oh my god I still you the double sided naked brush",
        "Besos desde P.R.",
        "As someone in my mid-30s I'm so jealous of all of you who had YouTube to teach you how to do makeup. My \"tutorials\" were a Tyra Banks book called \"Beauty Inside and Out\" and this one girl at my school who I stared at while she put white liner all over her eyelids. That's it. Otherwise I was on my own.",
        "Greasy eyelid gang here ",
        "I have every single one of those pallates ",
        "Not me finding out that this is still how I do my makeup...",
        "This was when I started watching YouTube makeup tutorials and haven’t changed my technique since…",
        "Oh man the SPARKLY LID FINISH. Nothing says ex-cheerleader like the falsie/sparkly lid combo",
        "every time you grab the camera and say \"get over here\" it really makes me feel like i'm actually there having girl time with you <3",
        "Girl I knew I loved you!!! Deftones!!!! Aaaaahhhh. I’m from that era. My parents were strict too about what I could wear so no major emo/goth clothes for me til I moved out!!! Grunge/ emo/ rock music from. The 90’s- 00’s, the best.",
        "those acacia makeup tutorials rewired my brain chemistry",
        "The way I didn’t wanna buy the chocolate bar pallet so I got a fake tiny version of it on a random site ",
        "I have two doubled sided brushes  one is from the smokey naked palette and the other is from a smash box palette lmao",
        "Thank you for this.",
        "SHEFFIELD PEOPLE RAISE!!!! ARCTIC MONKEY YEA MUSH",
        "Conciliar is such a beautiful name for a girl ️",
        "I've never even heard of acacia girl ",
        "the makeup community provided me so much of my personality for so long…",
        "thank you for being just like me",
        "NYX marshmallow primer is actually all natural, the scent comes from the ingredients! one of my fav primers ever",
        "The 10 year old eyeshadow, okay vintage queen",
        "You have a smooth and soft brain, too. I am so kidding! You are very intelligent, very clever, and your eyes are beautiful.",
        "girl not the DEFTONES ERA im still in that era LMAO",
        "Me as Brittney trashes the pallets as “old” meanwhile they’re the only ones I currently own  _ ",
        "I’m from Sheffield! Hi ",
        "15:24 you have such an infectious laugh",
        "I dreamed with you today, Brittany. I don't remember exactlu what happened, but I know you were dancing and singing as a joke, and it was so funny I woke up laughing",
        "I'm going through it rn, Brittany, and your content gets me through a lot... Thank you, I appreciate you <3",
        "Hey, don't waste your time on emo, the funk is in the metal!",
        "the holy trinity of the eyeshadow palette omg…",
        "I would pay real money to watch Brittany and Lewis capaldi go on a date!",
        "As an acacia before acacia I can’t tell you all how distressing it is when she starts trending",
        "I LOVE THAT YOU DID THIS LMFAAAO",
        "I can't believe she felt like she needed some brow pomade in EBONY after absolutely COLORING IN those brows with the brow wiz!!! To be fair back then everyone was like wow genious what a visionary",
        "Brittany: 516\nLashes: 615",
        "I'VE BEEN WAITING FOR THIS ONE",
        "23:50,  I’m dead! ",
        "naurs",
        "I was a freshman in high school during this era and I remember basing my entire personality off of Effy from skins UK ",
        "Okay I do vividly remember this makeup tutorial, but do we also remember the og one with the 3 different mascaras and concealer on her lips",
        "I love how you keep complaining she's going too fast but you have her in 1.5x LOL",
        "I like how Brittany gets mad that the tutorial is going too fast like she isn’t the one who put it in 1.5 speed ",
        "Some of y’all weren’t there for her drama with kian Lawley and Sam pottorff back in the day ",
        "I'm glad to see I'm not the only one who still has the 2014 palettes. I have the OG chocolate bar AND the peach AND modern renaissance girl and maybe I still use them so WHAT",
        "u look like adele",
        "so iconic dude like so iconic",
        "Can we all appreciate the chaotic energy that they always bring in every single video Vanoss uploads? ;) -_-",
        "greasy eyelid gang ",
        "The fact that I still do this makeup look DAILY! My brain really be going along with the “if it ain’t broke” thing",
        "acockia",
        "As someone from Sheffield, I loved the accent attempt ",
        "Are Sarah and Brittany still living together?",
        "I would love to see a whole iceberg video about acacia, if you Google her there is an absolute rabbit hole about her past",
        "Brittany: why did the internet bully her?\nAlso Brittany ...roast most of her decisions",
        "i dont care if i live or die was so real after using the scented products i caaannttt",
        "I thought I wasn’t get called out during this video, and then she pulled out the Anastasia pallet",
        "welcome to my face! im James st James and this is transformationssss",
        "15:28 huuuuuuuge Meryl Streep in Death Becomes Her vibes. An actress!",
        "You looked a lot like katy perry! ",
        "IM FROM SHEFFIELD AND I WATCH YOUR VIDEOS!!!",
        "Brittany. I am 26 almost 27…. Believe me. No judgement here.",
        "Her saying that she applies mascara to the back of her lashes shook me to my core and I have never been the same",
        "call it a split cause I know that you will",
        "There is no way ppl still do this makeup look.",
        "I wish I could like time stamps of your videos.",
        "You did a great job. Just go ahead. Lot's of love for you from India.",
        "if you… if you fuckin attend the paramore concert and make videos of it i will Die of happiness pls brit for the emos of the brittany squad!!!",
        "i don't know who tf focaccia brinkley is but brittany is doing make up on the yew chewbs and my heart is so full in this moment.",
        "Anyone else think Leigh McClendon looks like he is her brother?????",
        "My family was poor af and me asking my mom for this stuff was such a joke  how did these kids have all these products",
        "Akakia",
        "hi, greasy eyelid gang here",
        "I’m from Sheffield!!!",
        "please for the love of our lort and saviour jesus christ do a tumblr emo look",
        "I had the chocolate bar and sweet peach and modern renaissance, I tossed the too face but kept modern lmao",
        "GET A BOB",
        "“Why did people make fun of her so bad” honestly she was a young confident woman in the early 2000’s, do I really need to say more?",
        "Just filling in on the tea, she pretty much left and deleted her account due to deciding she didn’t want her three kiddos on the internet any more especially because she felt it was a mistake sharing the way she did about her middle daughters struggles. She also stole some light room filters and a couple other silly drama things on her part, but she’s living her life now. C’est la vie.",
        "The scream I gave at the age of 28 when she asked who’s from Sheffield ",
        "Greasy eyelid gang ",
        "You look like Megan Trainor",
        "I'm 23 now and I was emo in 2012-2015 give or take, later on more goth/metalhead. 2010s were truly the vibe, the makeup, the band tees, too good!",
        "Is she on the super diet of ice cream or something else like the CEO of the FTK bit coin / this is priceless for real. .",
        "Brittany u look so beautiful u slayed that🥹",
        "watching this video as someone who has been emo since 2013 feels like my mom trying to explain to me who my chemical romance is because she saw them on a Facebook post about teenage rebellion",
        "Yes! Me! I'm from Sheffield! (I don't have a thick accent though )",
        "25!?! she looks 40",
        "Love Meowsaradas design. Could team it up with Delphox and make a magician and magicians assistant kinda thing",
        "Omg I love this. Do another one of her tuts!",
        "Trent and his mom are some of the sweetest people you'll ever meet. I've never met Lance but I know Trent is always helping and hanging out with his Uncle Lance. So glad that their story is going farther out than our little home town could push it. :-(",
        "Scent in cream causes inflammation and damage to the skin which can eventually show as wear and tear (wrinkles, yay!) I don't think scented facial cream will kill you, though hahaha",
        "Muppet vibes 23:49",
        "Not from Sheffield but im still from yorkshire which is just as good?!",
        "I was emo back then and it wasn’t a phase. Lmk if you need a gay emo big brother for music recs and to take you to the mall.",
        "\"a STEALER & A LIAR!\"",
        "The Acacia Brinley lore is my favourite internet lore",
        "She recently stole presets from another YouTuber. Look up atleeey",
        "never seen your channel before, but i love your voice lol\n\nedit: slightly different dace shape, but your eyes make you look like danny gonzalez",
        "the eos lip balm gave me war flashbacks to being 13 and humiliated that my mother wouldn’t buy me any",
        "It looks good in low light… we were really wearing clubbing makeup in first period. I would literally bring a massive makeup bag to third period to do my makeup in class how embarrassing",
        "Yaaaas. Loving this.",
        "The fact that I still have my Modern Renaissance palet that I bought like 10 years ago as well... and I still use it. It's still good........ I spray some rubbing alcohol on it to \"sanitize it\" from time to time.... ",
        "This is really bringing me back to middle school and t-shirt dresses",
        "Nice looking",
        "Deftones are soo great. As are all of Chino's other bands.",
        "I find it incredibly ironic that after Acacia has been cancelled and deleted all of her Instagram literally a few days ago Brittany makes this. Iconic.",
        "Thank you AKAKIA I HOPE I LOOK JUST LIKE UUUUUU <3",
        "Pink powder is actually a very historic cosmetic item. I remember a 50s make up video on how cosmetics would be hand mixed and then pan pressed or provided as a loose powder  to better match/color correct a person's skin tone so they had the customization game Way ahead of our modern day methods along with the Compacts you could get, I wish we could go back to refillable compacts and lipstick bullets  they were so Pretty",
        "so so thrilled that brittany is finally going emo. tumblr revival era is here lmfao",
        "Miss ma'am you should try a southern/Texan inspired makeup and hair. What you saw growing up",
        "I spent like 500$ at ulta one time when I was way too young to have that much money and I have never bought another palette since ",
        "Brittany talking about arctic monkeys ( specifically about RLIDAS) has just increased my life expectancy, do it again plz",
        "I still have the peach palette too!!! I use it almost every time I do my makeup",
        "Oh my god. I still use that naked brush. Oh fuck",
        "18:43 i was dying laughing at how the bottom of the eyes looked up close bc they definitely looked so different farther away ",
        "She def has a face that should wear makeup ",
        "Working at Sephora, doll you cannot imagine how many Too Faced Pallets we have and can’t get rid of …. They have missed their wave of relevancy please buy them",
        "Im a manchester bitch but my housemate and bestie is from sheffield xxxxx",
        "red light indicates doors are secured,,, such an amazing somg def one of my favs off the 1st album!!",
        "greasy eyelid gang 🫡",
        "shes so mean, i mean, look it up babe, shes not a good person",
        "You look liek Megan Trainer isn’t he thumbnail ",
        "This was the best make up tutorial! <3\nPLEASE GO ON YOUR MOMS HOUSE PODCAST!",
        "“That is so much foundation” like we haven’t seen how many videos you and Trixie Mattel have made together girl!!! \n\nEnjoyed seeing this though, it made me realize i hadn’t subbed. Am now though!",
        "i still use modern renaissance. it's so good",
        "17:02 dude yea I’ve learned the hard part",
        "17:27 she looks like bobsburgers",
        "17…or 38??? yeEahh BaByY",
        "getting that peach palette was like getting these damn taylor swift era tour tickets… a bloodbath.",
        "Not quite Sheffield but I'm from Blackpool which is like 3 hours away and I LOVE YOU",
        "The late 00s Emo Era to Hipster Starbucks Era to Tumblr Era to Coachella Beautyguru Era was such a SHAPING aspect of my teen years. Like literally from being 10 years old to adult. We went through PHASES. Idk so many iconic aesthetics happening in that time frame. And not enough money to explore any of them. I already feel too old to follow current trends - so sometimes I wish time could stand still and I could relive those old aesthetics, recreate them and overcome the Trauma. Lol.",
        "Living in Sheffield...and seeing Arctic Monkeys in Hillsborough next year  ",
        "Damn, as a 29 year old I have no idea who this chick making the original tutorial is lol",
        "brittany girl where the fuck did you find those ardell lashes in 615 i’ve been looking for them for years",
        "Greasy Eyelid Gang ️",
        "I still do my eyeliner like that heheheh",
        "GIRL IM FROM SHEFFERS!!!!!!",
        "haunted doll core",
        "Please I still have the renaissance and the peach pallet ",
        "can we talk about how beautiful brittany's eyes are tho?",
        "omg not the modern renaissance ABH palettttteeeeeee",
        "I’m not from Sheffield but I am from Manchester, will that do?",
        "brittany: sets video at 1.5 speed\nalso brittany: she is going TOO FAST ",
        "i lost my mind over the eos lip balm",
        "I don’t have many memories from childhood for some reason, but I noticed that a lot of the things that she loved in this we’re also big staples of mine when I was younger, so I feel like I probably got all of my staples from her. She was the icon.",
        "I forgot how many steps this tutorial was holy shittt",
        "Girl I am watching this video from my house in Sheffield !!!!",
        "we have the same earrings i feel so seen rn",
        "Brittany puts video on 1.5 speed \nAlso Brittany girl you gotta slow down",
        "Trixie collaboration?",
        "Girrrrrl teen pale me LIVED for red shadow and yes truly sickening",
        "I don't see any texture on your skin, Brittany!\n\n\"Sometimes I'm just gonna wear black tights\" LMFAO!  With you on that one, Brittany, and I\"m old enough to be your mom!",
        "“I’m not doin all that” took me out ",
        "The grip too faced palettes had on society for so many years is CRAZY !!! INSANE!!!",
        "\"COUSINS\"",
        "WHEN U SAID ANYONE FROM SHEFFIELD WATCH UR VIDEOS - IM SAT IN SHEFF RIGHT THIS MOMENT -  listen to ‘from ritz to rubble’ by AM. Ps drop us a message if ur ever in sheff for a top tier night out",
        "this video was very healing for me brittany!!! i was in college during this era and i so viscerally remember the crusty cakey foundation and diabolically uneven winged liner being staples of my going-out look. i also remember crying when i got my first naked palette. the teenager within me feels Seen and Heard by your trip down memory lane. thank u benevolent leader 🫡🫡🫡",
        "setting was never a thing in 2014 bcoz the foundation was so matte",
        "I see that Philz coffee cup, bay area Britney?",
        "the genuine joy when she pulled up that SEMI SWEET CHOCOLATE BAR lets fucking go",
        "I want you to watch those deftones memes on tik tok lmfao",
        "The modern renaissance was and honestly is still one of my favorites ",
        "This made me feel old because that makeup application seems so normal to me ",
        "how is it that I’ve never seen this tutorial yet I used to follow it every single day",
        "The captions said akakia. akakia is a real thing and its literally a dusty tapestry.",
        "Urban Decay and Too Faced had us all in a CHOKEHOLD",
        "not this coming out two days before her refund lmao",
        "i’m from sheffield ohio",
        "this is still how i do my makeup ",
        "17:22 i’m like an hour away from sheffield does that count??",
        "I STILLLL LIVVVVVVVVVE FOR THE MODERN REN. PALETTE",
        "Ummm I’m waiting for a VCG video on this woman",
        "Brittany in natural light with all that makeup is giving insidious 2",
        "I remember thinking I was a makeup pro only knowing this look ",
        "TEN YEARS?",
        "Beautiful",
        "So we're all reliving our goth/emo/scene eras currently, it's not just me, love that ",
        "Honestly the peach palette is solid. It's still sold today and I've gotten to the pan on a few shades haha",
        "The way I used to think Acacia was the unattainable peak of beauty and now I realise she really isn't lol she's just an average gal with a make up routine and who knows her angles",
        "THE SWEET PEACH EYE PALLET!!!!!!! i have used it for my everyday work makeup for two years.... and YES i remember my sister buying it for me in highschool because i hadnt even had a job yet to buy my own makeup",
        "I got a basketball game tomorrooww",
        "If jschlatt & Brittany ever collab — I’ll be a very happy viewer. 🥹 Y’all sense of humor is unbeatable!",
        "“I don’t care if I live or die!” I have never related to something so hard",
        "you are looking very adele. in this video babs",
        "You can definitely use reds and blues on fair skin for eye shadow for example. The only caveat is that you have to line the eye shadow with liquid black, like a closed banana cut crease. basically color-blocking your face.",
        "“Girl you are going entirely too fast”\nhad video at 1.5x speed",
        "The chokehold this had on me when i was in middle school is alarming",
        "I'm embarrassed because I literally still use this palette to make this exact look every day ... oh god",
        "It’s all about Secret Door by arctic monkeys baybeeee",
        "Not the modern renaissance palette giving me war flashbacks",
        "I wanna see Trixie cry while doing her makeup using Brittany's 10 year old makeup!",
        "I Need that Trixie Mirror",
        "I love how badly k relate to this video and even more to the comments  I feel like we’re all really good friends or something and shared this experience 🫶",
        "the space you have between lid n brow is that good shit",
        "Yes! Modern reneissance was that girl! my first palette! I actually loved creating red and pink looks with it even if my mother said I looked sick and I also used to go bankrupt monthly by buying makeup products too expensive for my nonexistant budget ",
        "Lmao I did that whole card thing with the modern renaissance palette that I still have lol",
        "“Why did people bully her so much?”\n\nIdk who she is, so I looked her up on yt and the only videos that came up were about her mistreating her child Brittany pls ",
        "i look her up like every 3 months to see if shes still alive since her fall off",
        "but this look isn’t even og acacia lol",
        "Sheffield girlie 🫡",
        "You’re my favorite human",
        "23:49 spiderus is that you??!?",
        "Brittany why is the camera so close to your face lmao",
        "no I still vividly remember watching this bc the eyebrows were such a topic of conversation",
        "\"That'll do donkey\" ",
        "This video made me realize that I still do my makeup this way ",
        "i love that you love Orville Peck we are so samesies & he is so lovely. i’m glad you get it.",
        "Sometimes I see the chocolate palette in tj's and marshalls maybe if you can find it you can have a fresh one w better color pay off if it really bothers you. Or you could recreate the color story with a z-palette and singles",
        "Why do I get excited when she mentions Northern cities? She gets it. Shoutouttttttttttt 🇬🇧",
        "I had the sweet peach and the chocolate bar palettes too  literally had them for 8 years and just recently forced myself to throw them away lmao",
        "The way that I literally still do my makeup like this omg",
        "legit just found my 2014 Tarteist pallete while watching this just to swatch the colors again. idk why these overpriced, chalky, barely pigmented eyeshadows had such a GRIP on our young souls but they did ",
        "thank you, brittany, for cheering me up after my breakup <3",
        "I WANNA HEAR MORE ABOUT DEFTONES BRITTANY!!!!!!",
        "17:27  I’m so cute ",
        "SEATGEEK?! GET IT GUUUUURL ️",
        "why does brittany look like Meghan Trainor?",
        "Ewahhh my hair is so greasyyyahh burp",
        "Wasn’t she called out several times for being racist? I think that’s why she got \"bullied\"",
        "still have my chocolate bar and modern renaissance palettes! they are relics",
        "this makeup style and technique is part of my dna now like…. if i were to default to something it would be this",
        "she’s a mom of 3 now I feel old",
        "My Modern Renaissance looks just as fuckin beat upppp duuuude ",
        "Anybody have a Bella swan phase during ur emo phase ??? I did and I’m reliving that era now that I have money to thrift for those tops ahhhhhhh",
        "Why is no one talking about the tattoo of the daisies are those from Oswald?",
        "Broski nation is trending",
        "not the caption translating \"Mineralized Mac Skinfinish\" to \"Mineralized Mexican\" ",
        "i remember this shit like it was yesterday",
        "PLEASE GET YOUR EYEBROWS MICROPIGMENTED ",
        "Why do I still use all of these pallets…. ",
        "Sometimes I love being a millennial",
        "Omg I subbed when you said Deftones ️️ this is the best fuckin make up video I've ever seen!",
        "”I put it on 1.5 speed” \n\n10 min later ",
        "I think you’re a doll!   Beautiful eyes…and a voice that would make Elizabeth Holmes cream",
        "Not quite from Sheffield but VERY VERY close. I’m from chesterfield, I wish I could recommend a visit but I’d give it a miss ",
        "Hi",
        "Brittany: with eyelashes “l’ll be using 516”\n\nThe eyelashes: “615”  ",
        "as a deftones girly i stan your new emo era queen",
        "this is killing me that video had a death grip on me i love u sm ",
        "My lord you have returned at long last ",
        "You pulled out that modern renaissance and my body took a screenshot. Truly a product of the day.",
        "Can’t wait for Brittany’s deftones era ",
        "My baby brain is very thankful to the yellow line for the ad time",
        "sarah baska was MY inspo in 2014 … she had the tumblr girl look down pat",
        "I got the chocolate pallette a few years ago and I was SO disappointed in the pigment of the pink. I can never get it to even look like there's pink there",
        "No thank you acockia, now I look just like you!!",
        "there are lots of reasons why the internet bullied her, rightfully",
        "this makeup suits u so much ur really pretty btw",
        "Didn't even know who she was until she posted the video about decorating her trailer. It's always so weird to find out someone you thought was a new creator definitely isn't lol",
        "when you brought out the modern renaissance palette i felt seen",
        "I LOVE YOUUUUU - WE ARE LINKING ONE DAY AND I CANT WAIT FOR ITTTT",
        "I may look like a civilized typical white southern woman. But I blast Deftones, Artic Monkeys, and Touche Amore going to work on the mornings.",
        "YASSSS THE DEFTONES BRITTANY ERA WE LOVE IT",
        "Not me still doing this eye look daily but with 500 less products",
        "Checked you out. ",
        "I wanna see scene girl Brittany. The teased hair, heavy make up, colorful clothing, RAWR XD Scene from Matel- Brittany Broski",
        "What lashes are those ",
        "Nothing makes me happier than the Southern accent",
        "this gave me flashbacks oh my god",
        "i simply always do my makeup by a window it has to be natural light or i’ll look crazy",
        "Brittany: “I have increased the speed of the video to 1.5x for all of our sakes”\nAlso Brittany: “OMG, slow dooowwwwnnnn”",
        "the fact that I did the EXACT same store-bought visa card thing but with the modern renaissance pallete......",
        "Wait but does anyone remember the other makeup tutorial she did when she was blonde?? And she would hold her eyelid to put on mascara",
        "When I heard “painterly paint pot” for the first time in 100000 years  it really was a different time",
        "3:45 me when doing anything",
        "Girl if you got dry skin you never set your base",
        "I am still kind of obsessed with this makeup look.",
        "Wait Britney didn’t you used to have bangs? Or did your hair just grow really fast",
        "brittany i have literally been crying all day but this video made me laugh out loud so much thank you queen i needed it <3",
        "I’ve never seen Akakia but I highly enjoyed how much Brittany enjoyed reliving her past ",
        "your lighting is giving period piece",
        "Why Brittany why",
        "When I tell you I still have my chocolate and peach 2 faced pallets",
        "\"have you ever done your makeup in the sunlight? It'll humble you real quick\" \n\nAbsolute facts ",
        "2014 was senior year in high school, and this is the exact makeup every white girl wore. It brings me back \nBrittany: for all our sakes, I put the video at 1.5x...\nAlso Brittany:  SLOW DOWN",
        "Brittany gives me older cousin vibes like I feel like I’ve known her forever she seems like she a good friend a good person and she’s so fun! I love her",
        "im screaming bc ur eyeliner is definitely giving 2014",
        "You do look like you're in your mid to late 30s. And you give off older woman vibes heavy. I would NEVER have believed you're 25. Mind blown! Maybe it's the extra weight on your face and deep voice...the combo ages you.",
        "You look so alike to Megan Trainor on her new video :) ",
        "I love makeup from my high school era. (2005-09) there was this scene girl whose makeup was incredibly graphic and always on point. I used to think to myself how cool it would be to watch her do her makeup",
        "Brittany, follow Sarah  into the light and get into 90’s grunge. PLS",
        "17:22 close enough",
        "thanks ACOCKIA now i look just like you!!!!!!!!!",
        "I feel like she would love the Netflix show Glow Up!",
        "greasy eyelid gang checking in",
        "brittany in her deftones era… love to see it",
        "I still have my OG semi sweet chocolate bar too… and modern renaissance … and THE chocolate bar lolol",
        "i was waiting for her make a reference to the 1975 when she said the palette smelled like chocolate",
        "I’m so excited for Brittany to find out about My Chemical Romance.",
        "As someone that PHYSICALLY cannot do makeup I have no idea what is happening besides the bands she talking abt ",
        "The most miraculous part of this video is that it was filmed during daylight",
        "She was the nice popular in high school you wanted to do your makeup before school and you had a crush on",
        "I still have that naked brush lol",
        "“A BONE colored eyeshadow” really really got me ",
        "ITS GIVING ADELE",
        "Just fyi I couldn’t get the code BROSKI to work on SeatGeek. I’ve never used it before so I made an account to get tickets to Paramore but it said the code was invalid. I will probably get the tickets anyway.",
        "No, thank you ackakia <3",
        "The hold that color pop had on everyone. And the fact I still have my pallet too.",
        "I still have 2 (two) peach pallets. They are beautiful and I will cherish them forever.",
        "\"This is who I was!\"\n She never fails to crack me up",
        "Not me looking at this tutorial and realizing I’ve been doing the same makeup for 10 DAMN YEARS",
        "I HAVE THE CHOCOLATE AND PEACH PALETTE ",
        "I love scene girls",
        "i also was bald for a long ass time and my mother was concerned as well lmao... but look at me now. full head of very fine and thin hair. anyway my brother is balding at the age of 20, so... im still winning",
        "I still have the sweet peach pallet and the modern renaissance pallet",
        "OMG IS THIS KOMBUCHA GIRL",
        "brittany: anyone here from sheffield?\nme: excited someone is mentioning where i live",
        "I’m not sure who this girl is that Brittany is following but she looks soooo much like Freddie Highmore",
        "The axe, twin blades, a frickin soul reaver blade, and now an infinite spear. This game just keeps getting better. This playthrough, specifically your playthrough, has been an absolute joy to watch.",
        "Not from Sheffield but from a town next door called Rotherham. Honourable mention from arctic monkeys-  \"You're not from New York City you're from Rotherham\"",
        "Does anyone know what shade that rose colored powder is?",
        "I’m literally from Sheffield. Your comment spooked me",
        "ME: loves spongebob but alot of people think its childish so i dont embrace it that often...\n\nsees brittany with her spongebob case ",
        "The Sonic the hedgehog music in the background of miss girls video is so damn FUNNY WHY SHE TRYNA SPEED RUN THE LOOK LIKE GIRRRRL",
        "Used to watch this exact tutorial thinking it would make Dylan O’Brien fall in love with me .. ",
        "Your episode of VCG on brittubers and now this I'm astroprojecting back to 2014 and I'm living",
        "WHEN THE MODERN RENAISSANCE CAME OUT I SPENT SO MUCH MONEY AT ULTA TO GET IT AND I STILL USE IT TO THIS DAY! can never do the red….",
        "that chocolate eye shadow pallet was the first eye shadow i ever bought cause a lady at Macy's recommended it for me. I can't believe i would see it again now.",
        "y’all gotta cover Acacia on the podcast i SWEAR",
        "I can’t lie, I used one of the shimmer shadows from the sweet peach pallet for my wedding makeup last year….",
        "brittany: \"i don't care if i live or die.\"\n\nalso brittany: has stated multiple times that her biggest fear is death and the unknowingness of death as a whole",
        "brittany: \"oh my god she's using the Naked brush y'all, remember that?\"\nme, a 29 y/o adult who has exactly 4 eyeshadow brushes and this is still one of them: ",
        "Great Video, thank you for taking the time to explain",
        "The hold Acacia Brinley had on me in 2013/2014  I wanted to be like her so bad",
        "Middle aged women still do there makeup like this and it’s just cake city and they really think it’s a serve",
        "The only YouTuber that makes me scream laughing ",
        "Tbh, never sought out a makeup tutorial in my life. However Trixie, or you, I would watch, do just about anything.",
        "No shame my naked palette is still kicking  and I refuse to let it die ",
        "I’m from Huddersfield which is like the next town!",
        "I’m using these 516… \nBox says 615…\nSame girl same all the time",
        "You should follow an old Bethany Mota or other 2014 YouTube makeup guru tutorial, see how it turns out now",
        "Is it possible that Adele was obsessed with this too!!??",
        "every brittany video that comes out convinces me further that we lived the exact same life from 12 to 25 yrs old….. feeling seen and blessed ",
        "I still have my naked eyeshadow brushes and my ABH brushes that came with the palettes lmao",
        "Seetgeeck is scam guys don't buy anything from there.",
        "Watching this while coming down from a fever is fun 10/10 would recommend",
        "Brittany: I’m gonna put this in 1.5 speed\nAlso Brittany: 9:18",
        "honestly im surprised by how good it looks, the lipstick is the only thing thats throwing me off . you SLAYED",
        "excuse me i still use the naked dual ended eyeshadow brush for every eye look",
        "I wish Brittany and Meg statler could do something together, I’m speaking this into the universe now so that it will happen!",
        "i miss when the most important thing in my life was highlighting the brow bone",
        "Lol the james st james \"welcome to my face!\" I see you boo. I see you. Shes such an ally.",
        "SHE SAID I BEEN GETTING INTO DEFTONES......I LOVE DEFTONES! AND I HOPE THEY HAVE CHANGED YOUR LIFE THEYRE AMAZING AND THEY KICK ASS! HOPE U SEE THEM IN CONCERT SOON! <3",
        "Bestie I'm gonna need you to be loud right now, because I'm not tryna have my boyfriend's family know that I'm really douching right now️",
        "0:52 cracking up with the video edit timeline pic  Shadey Stanley ️",
        "Okay the fair skin and blue eyes…..ITS HARD to get eyeshadow to work for u. Just soooooo pale it’s hard to not look like a clown",
        "do a vid where you get a bunch of wigs and try them on. give the people (me) what they (i) want, please",
        "I’m in broski nation",
        "This is giving me Jenna Marbles vibes, and I'm here for it!",
        "not you bring up the sweet peach palette because I just got rid of mine literally yesterday because i never use it  and i NEVER get rid of pallets lmfao",
        "Would you ever get a hair transplant ?",
        "Saw the scene Acacia Clark pic and clicked on immediately",
        "It’s so interesting to me how the decay of Brittany and I’s Modern Renaissance palettes are completely flipped",
        "Brittany switching over to the cool uncle  is giving",
        "for some reason i’m just realizing brittany’s southern accent is pretty strong",
        "“Greasy eyelid gang” I feel seen, recognized, and validated",
        "You look like Meghan Trainor in 2014",
        "oooooh Brittany I LOVE Philz Coffee and now I wanna know what your drink of choice is",
        "7:22 I gasped",
        "ur cousin sarah schauer made me want the ABH modern renaissance palette desperately and i used that shit so little. tragic. i used two shades all the time thi",
        "I highkey still do my eyemakeup like that",
        "I feel like I'm still doing my make up like this LOL oops",
        "The description of the eyelash curler ",
        "Me a baby drag queen in 2007 before YouTube makeup tutorials were a thing ",
        "i loved this and i loved u",
        "WAIT.... THIS LOOK.... THIS WAS WHAT ALL THE GIRLS DID!!!!! when i was 14 I didn't get how all the girls looked the same.... this is how... ",
        "I can't tell you how much I LOVE the yellow sponsored bar.",
        "ITS LIKE FROM THE SOWNG",
        "screaming that you mentioned sheffield. can’t speak for the rest of us but i watch ur videos so",
        "I lave show",
        "23:50 IS A WHOLE JUMPSCARE",
        "wow i don't think i've ever seen such an uninteresting makeup look",
        "it’s crazy how acacia is married with kids now like i swear she was posting on tumblr like yesterday",
        "okayyy Bette Davis",
        "brittany:speeds up video \nalso brittany every 5 seconds: STOP",
        "Bruh, I just watched a 7 part series about her and it was PROBLEMATIC",
        "Ok I literally have never seen Acacia in my life but THE EOS LIP BALM SENT ME BACKK",
        "I love this freaking woman so goddamn much ",
        "15:28-15:42  my high ass is crying omfg",
        "my fav old song from arctic monkeys is mardly bum",
        "Brittany really delivers the same energy Jenna gave. Jenna handed the baton over\nI'm so glad we have you",
        "was fully expecting you to do her tutorial where she was in her bathroom and used q tips to clean the mascara off her eyelids",
        "Get out if my feed, Bronski.",
        "The iconic “welcome to my fasch!” Awww i miss transformations",
        "I remember watching some OG beauty, Youtubers, using the chocolate and peach pallets. They were everywhere",
        "Yaaaasss I’m from Sheffield bitchhh ",
        "“why did the internet bully her so bad” ….ma’am pls tell me this is satire",
        "Omg Brittany mentioned monet??? My worlds are colliding "
    ],
    "comments_disabled": false
}