{"video_id": "2lFOyVEYDk4", "comments": ["brittany: puts the video in 1.5x speed\nalso brittany: “you gotta slow down girl, too much is happening all at once”", "brittany: \"i don't care if i live or die.\"\nalso brittany: has stated multiple times that her biggest fear is death and the unknowingness of death as a whole", "I want Brittany to do a goth look soo bad bc she has amazing lid space. Like full trad goth", "You pulled out that modern renaissance and my body took a screenshot. Truly a product of the day.", "When Brittany says \"why did the internet bully her so bad?\" I think this needs to be its own podcast episode.", "One thing about me is that when I was a sophomore in high school I posted a picture of the Two Faced Peach palette on my Snapchat story and captioned it “I want this so bad ” and a senior slid up and said “if I buy it will you go to prom with me?” And I said yes of course because I’m not stupid and to this day I still use it.", "the grip too faced palettes had on society for so many years is crazy", "When you did the first eyebrow and looked straight into the camera I felt myself nod in solidarity", "stanley is an unreal editor he HIGHLY lends to the quality and comedy of these vids. love the combo. have a good day everyone.", "the way i JUST finally threw away my modern renaissance palette from 2014, god we really are all the same", "Brittany: I set the video to 1.5x for everyone’s sake.\nAlso Brittany: AKAKIA GIRL YOU ARE GOIN ENTIRELY TOO FAST OH MA GAWD", "I love that Brittany has gone through all the deep dark periods of the internet, she's just like us fr  I remember Acacia had like a different fase/aesthetic every month and I ate all of them up", "I find it incredibly ironic that after Acacia has been cancelled and deleted all of her Instagram literally a few days ago Brittany makes this. Iconic.", "You and sarah need to do a deep dive into Acacia's life because it is wild. She has two kids now and used to be a mommy blogger. She doesnt post to instagram anymore  because she was caught stealing presets from another creator (filter presets like on VSCO) and sold them as her own and barely apologized.", "She is always funny", "I love how every time Brittany follows a tutorial she throws the idea out of the window and does it her own way", "I never saw this video but I love that seeing Brittany recreate it still brought back a sense of nostalgia. It truly feels like we r at a sleep over watching/recreating makeup for fun ♡ I love her", "i did not expect this at all but girl i- the hold acacia had in our 14 year old brains was INSANE", "This is still the same style of makeup I use 10 years later because this is how I learned how to apply makeup and I haven’t bothered to watch any tutorials since I am not ashamed", "fun fact actually not so fun is that acacia brinley/kersey has gotten a lot of criticism for seemingly mistreating her young child named Rosie who has special needs and she'd be seen out in the cold wearing less layers than her siblings despite her being a baby at the time and all around being treated with less care than her siblings.", "The end standing in the direct lighting being completely washed out and going “okay thanks for watching” TOOK ME OUUTT HAHA god I love you", "As someone in my mid-30s I'm so jealous of all of you who had YouTube to teach you how to do makeup. My \"tutorials\" were a Tyra Banks book called \"Beauty Inside and Out\" and this one girl at my school who I stared at while she put white liner all over her eyelids. That's it. Otherwise I was on my own.", "Girl when you said when you had strict parents and couldn't be emo, I'm right there with you. I'm going full goth now and my mom asked oh is this a phase? Bitch no I'm being me at 25 years old hahahahaha love your channel girl", "Because I was a 5sos girly, I hated her, but also couldn’t stop watching her. I was OBSESSED, but would never admit it", "I love makeup from my high school era. (2005-09) there was this scene girl whose makeup was incredibly graphic and always on point. I used to think to myself how cool it would be to watch her do her makeup", "redlight indicates doors are secure is absolutely amazing. The whole \"whatever people say I am, that's what I'm not\" album is perfection. I personally love \"perhaps vampires is a bit strong but...\"", "I was too old to ever watch her videos so all I really know about Acacia are the racist tweets and accusations of animal and child neglect but also I don't know enough to judge 100%. Despite that, I loved this. And it was nostalgic. I still have my Too Faced bronzer and like to sniff it sometimes and my old ABH palette - fall out galore. ", "The way everyone had the same makeup bag: naked palette:maybelline dream mousse foundation:babylips lip balm:maybelline falsies mascara: and urban decay 24/7 glide on eye pencil.All we needed was a feather hair extension to tie it all together", "brittany:speeds up video \nalso brittany every 5 seconds: STOP", "ngl brittany’s editing was just fine before stanley but i will say, i think the editing is perfect nowadays and it seems to really blend well with brittany’s comedy and honestly makes me laugh all on its own sometimes.", "i feel better knowing i'm not the only one obsessed with incredibly specific 10+ year old makeup videos \nthey remind me of a simpler time lol\nbless us we had no idea what was coming.\nnow we all just want to not live lmao", "The way I KNOW Brittany could’ve ate this look up… honestly her makeup artistry is too good to seriously recreate this. Thanks for staying humble queen", "The way my mother was so afraid of me walking out of the house looking like this as if my Animal Crossing ass was going to pull all the baddies ", "Thank you everyone who donated, so glad to be apart of this community, so glad I was able to see the stream and donate what money I had", "i remember seeing that pic of her with the cat nose and whiskers and being like she’s absolutely revolutionary", "I haven’t watched a makeup tutorial since like 2014 so this is definitely still how I do my makeup when I go to a wedding or something hahahahaha", "GIRL saw the 1975 last week FINALLY, after years and THEY SLAYED! Their set is absolutely stunning and I cried 3 times, joyfully. I hope you have/had an amazing time!! ️", "one of the best thing about dude is that he never takes credit for himself when he achieves something. He always respect us the audience and his team, and he is polite in all his video's we congratulate ourselves on this achievementvh", "Urban Decay and Too Faced had us all in a CHOKEHOLD", "You mentioning the Deftones made my 36 year old ass so happy. They are one of my all time favorite bands. My parents also banned me from buying any CDs with Parental Advisory stickers, but then Napster came out and the rest is history.", "I’ve never seen Akakia but I highly enjoyed how much Brittany enjoyed reliving her past ", "acacia brinley makeup tutorial??? the video I didn't know I needed until now. you are truly a woman of the people.", "Unironically the best make-up she's ever done.", "the way today has been the actual worst day of my life and instead of silently sitting in my trauma i get to watch this. thanks brittany. x", "Brittany: when I got this pallet for Christmas it was truly the last time I was happy. \nHarry: ️️", "every brittany video that comes out convinces me further that we lived the exact same life from 12 to 25 yrs old….. feeling seen and blessed ", "brittany: \"i don't care if i live or die.\"\n\nalso brittany: has stated multiple times that her biggest fear is death and the unknowingness of death as a whole", "I love how everyone is becoming a Tumblr girl again this is what the world needed", "i know brittany will never see this but i’m obsessed with her i’m i’m never obsessed with people. every ounce of my being wants to be her/her bestfriend. brittany broski, if you see this, you’re who i strive to be. phenomenally great. those are the two words i would use to describe you", "I revert back to this look any time im late for a professional obligation because Its so deeply ingrained I know I won’t fuck it up and it only takes me 10 minutes. Also it tricks people into believing I am a normal gorl and not an emo gremlin.", "She comes into my work all the time with her kids it’s always a trip seeing her ", "So we're all reliving our goth/emo/scene eras currently, it's not just me, love that ", "Trent and his mom are some of the sweetest people you'll ever meet. I've never met Lance but I know Trent is always helping and hanging out with his Uncle Lance. So glad that their story is going farther out than our little home town could push it. :-(", "I literally only really watch Brittany when I'm tipsy or drunk. She never ever disappoints", "Brittany becoming a deftones fan is so weird yet understandable and i love it", "My family was poor af and me asking my mom for this stuff was such a joke  how did these kids have all these products", "Thank you so much, my parasocial bestie, for this supreme content and the laughs! Sending love from MI!", "It looks good in low light… we were really wearing clubbing makeup in first period. I would literally bring a massive makeup bag to third period to do my makeup in class how embarrassing", "“I decided I’m going to be emo now” im fucking losing it. Thank you for the tutorial we all needed", "as a fellow pale person, I’m joining the “couldn’t make most Modern Renaissance shades work for me” club. I thought something was wrong with the way I put makeup on, cause I always looked sickly ", "I love it when Brittany grabs us by the throat and moves our pov ️ also I always thought you'd slay a Bonnie Tyler look. (especially the one she used in Total Eclipse of the Heart)", "I can't believe she felt like she needed some brow pomade in EBONY after absolutely COLORING IN those brows with the brow wiz!!! To be fair back then everyone was like wow genious what a visionary", "not me still having and using my Too Faced Peach Palette... I would still have my Modern Renaissance palette if I didn't gut and grind every damn shadow to the bone  That was my go to for YEARS", "I'm new to the channel but I wish I had found him sooner. His dry humor, the roasting of his peers, the commentary about random things, his genius fight strategies.... I love it. May his family find comfort in this sad time >:-O", "And then there's me who never really wore a lot of makeup and never followed makeup trends and I literally can't tell the difference between this and whatever we're doing today. Lmao", "IShowBalls, this stream changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience", "I got so happy when you said you've been getting into deftones. They're my favorite for like 16 years now, welcome to the fam  koi no yokan and Saturday night wrist have gotten me thru so much in my life, amazing albums!", "I can't tell you how much I LOVE the yellow sponsored bar.", "The way I was searching through Pinterest the other night, reliving the swag-onedirection-fangirl-tumblr-xmas lights-ugg boots era", "getting that peach palette was like getting these damn taylor swift era tour tickets… a bloodbath.", "Brittany getting the notification for this video gave me the first teaspoon sized of serotonin I’ve felt in weeks", "this video literally made me so happy and gave me tumblr flashbacks, that I dreamt about my 2016 perfect life with the emoboi of my dreams. never slept so good", "i thought you were going to do the tutorial i always used of hers where she just washes her face with johnsons baby shampoo and applies 5 layers of mascara, i would watch that every morning and practice my lil egirl facial expressions like she would it was such a slay way to start every single day in middle school!", "i love the absolute joy you exude throughout this vid and how happily you embrace the 2013-2014 energy", "god I want to do a 2014 look now  this was the tumblr girl dream that I could have never pulled off at 14.", "No fucking way, I saw her pictures on Tumblr but I didn’t know she had a YouTube channel and stuff. This feels like a time capsule fr. Also with Danny Gonzalez shaving his head after growing the perfect Tumblr swoopy mop, I do feel a bit nostalgic. The internet aesthetic of the 2010s was so iconic. Thanks bestie!", "I don’t have many memories from childhood for some reason, but I noticed that a lot of the things that she loved in this we’re also big staples of mine when I was younger, so I feel like I probably got all of my staples from her. She was the icon.", "I just met Brittany at the 1975 show in Nashville the other night and she was such a kind person! Thanks Brittany for saying hi when you didn’t have to!!", "i had a fan girl phase for acacia when i was 12 so deep her claws could not be seen from how deep they were in my back, and when i got the semi sweet palette for christmas i recreated the look lmao", "thank you, brittany, for cheering me up after my breakup <3", "The fact that I still do this makeup look DAILY! My brain really be going along with the “if it ain’t broke” thing", "I would love to see a whole iceberg video about acacia, if you Google her there is an absolute rabbit hole about her past", "I'm 23 now and I was emo in 2012-2015 give or take, later on more goth/metalhead. 2010s were truly the vibe, the makeup, the band tees, too good!", "Yes! Modern reneissance was that girl! my first palette! I actually loved creating red and pink looks with it even if my mother said I looked sick and I also used to go bankrupt monthly by buying makeup products too expensive for my nonexistant budget ", "Me saying “I have that but is it expired?” On the too faced chocolate pallette and Brittany pulling it out, slay", "The axe, twin blades, a frickin soul reaver blade, and now an infinite spear. This game just keeps getting better. This playthrough, specifically your playthrough, has been an absolute joy to watch.", "LISTEN, I was in my early 20s in this era, and, AND I'm from Sheffield England. I cannot stress the chokehold this had on me and ALL of my friends. Every time I left the house regardless of occasion. Work, night out, date, funeral, this was the only look.", "You remind me so much of my best friend since college (we hated each other in high school). We're hitting 50 now, and she still terrifies the general populace with her personality. Never change who you are!", "I’m always willing to see Brittany do anything 2011 to 2015", "Thank you AKAKIA I HOPE I LOOK JUST LIKE UUUUUU <3", "Britney: puts her in fast speed\nAlso Britney: complains she’s going to fast", "I don't do makeup but I'm utterly fascinated by people putting on makeup. Love this journey with you", "I am also currently reliving this era bc I had strict parents so please keep this content coming I need all the side parts, winged liner, doc martens and fishnets I can get", "Brittany curling her lashes is my new paralysis demon", "gosh, how can i just forgot her existence?? she had the whole beauty community in her grip during that era omg", "Was going through a spiral and your vid post was just the relief I needed! THANKS BESTI ", "Its not a want but a NEED for Brittany to do full traditional goth PUHHHHLEASE", "Her saying that she applies mascara to the back of her lashes shook me to my core and I have never been the same", "Moments that made me chuckle in this episode\n19:07 \"feckless bawbag\"\n24:34 \"need you to shutup\"\n45:55 \"like Disneyland?\"", "Being in a state of drunken delirium after a heavy night out but Brittany’s video keeps the buzz going and I am HERE FOR IT!!! ️"]}