{"video_id": "2x78hhWaLmU", "comments": ["The irony of women taking him down,  after years of his abuse of women, was poetic.", "Dear Attorney Opper, I know that I am speaking for a grateful nation. Your brilliance, strength, courage and grace shown through every minute as you carried the weight of the world on your shoulders. I cannot even imagine the burden of simply sitting in the room with him, much less addressing him. I live on an island off the coast of North Carolina and I am 70 years old. You, Madame, are spectacular and a wonderful credit to humanity. I join our nation in thanking you for bearing this huge huge burden you have carried and resolved. You have my eternal admiration", "It’s so nice to see her smile. She’s a tremendously professional woman. I’m so happy for her.", "Judge Dorow blew me away. I've never had a judge bring tears to my eyes reading out a sentence. She was absolutely brilliant. What a woman. Waukesha is lucky to have her.", "Sue Opper - you are an amazing attorney and I loved the fact that you held your composure in the face of Brook's insane disrespect for weeks, and then when you told him to \"Sit down and Be quiet\" during the final day of sentencing a huge smile came across my face! He deserved that from you, obviously. And I'm glad you said what you did to him in that moment.", "The prosecutors did a fantastic job on this case. Not because they had a difficult job showing it was Brooks but because they had to take a huge horrific attack and break it down for the court so that every victim could be heard and have their justice. Not to mention having a crazy man representing himself really does tie a hand behind their back. Plus they actually volunteered to help him by serving subpoenas for his witnesses. Well done Ms. Opper!", "The fact that this prosecution team was able to wrap this up before the 1 year anniversary is actually insane. Especially with this type of defendant, and the magnitude of this case. Sue, Leslie, Zach and the rest of this team did an amazing job for these victims, and of course the Judge did as well.", "I was very impressed with the prosecution team, the judge, the jury, and the people in the court room and how they all showed integrity and respect. As a viewer, I found myself wanting to yell at the monster’s behavior throughout this trial. May God be with you all as you continue to heal.", "This woman and her team did an incredible job. They had to put up with so much and they moved forward strongly and got Justice. Also note the way she said “our families” when referring to the victims and victims’ families. She took them all on and worked for them.", "From South Africa, congratulations and respect to you, your team and the judge.  Deepest sympathy to the survivors of this horror.", "After listening to the mother of the 11 year old girl, about how she had to care for her child after this horrendous event, and to the girl herself talking about the pain she suffers, and the amount of rehab she is still having to go through, I was enraged that anyone could cause so much sorrow, but was thankful that the man faced such skillful and dedicated prosecutors, Jurist, and law enforcement officers and such a focused jury, true justice was handed out to this offender, ( whom I choose not to dignify by using his name) now I hope, they will throw him in the deepest dankest cell in the most dilapidated prison in the state, throw away the key, and forget he even exists.", "Thank you to the whole prosecution team. You did such a great job for the families affected by this monster. You stood in front of them and faced evil.", "I admire this woman. So professional, steadfast and unwaivering. I wish Sue and her family nothing but good fortune.", "Thank you to the entire prosecution team led by Sue Opper you all did an amazing job to keep the focus on  justice for the victims as hard as it was with DB selfish antics  in the court room .. God bless the Judges and your families and the victims families and may the healing begin ️", "From NC .  These victims were are family and we were with them in spirit. We watched everyday of the trial,  we were offended, hurt, deeply sadden, then relieved.   We are grieving along side of you and rejoice with you, for every step of progress they make.  ", "I am from the East Coast and My heart broke for all the victims, even though this is not my community!!! As human beings we are connected no matter where we live in this world, and I think this was a situation where everyone felt the impact of this horrific attack, and crime!! Makes it clear as much as there is a God and justice… Evil is real, and walks among us!!! ", "She is so impressive professionally and did the victims justice with presenting the case.  Her team worked hard and dealt with the case so well!", "I would love a biopic for her. She’s astoundingly strong and so professional. I’m so grateful this is done and  to the community!!!!", "I accidentally ran over a baby bird hopping along the sidewalk when I was a kid on my bike. It crushed me. I still think about it and feel guilty for it nearly 30 years later. I can't understand how this man spoke for hours upon hours during his proceedings and NEVER even apologized. Prayers for his cellmate's knuckles ", "You are ONE heck of a human being, lady that represents justice and humanity! God Bless you, your family and the entire community ️", "Millions up here in Canada are with the people of Waukesha County as well.\n\nWell done to each and every one of you who prosecuted this case. And thank you.", "Judge Dorow and Sue Opper are so powerful and I know that these strong women got under Brooks' skin. So very thankful to them and the entire prosecution team and every witness who went through this trial with the patience of saints in order to put away such a horrible, conscienceless human being. Brooks tried to make a mockery of the system and had no regard for the lives lost, but Judge Jennifer Dorow gave such an amazing tribute to the victims in her closing remarks and sentencing. You can really feel how much love is in this community. I hope they all continue to find strength in each other.", "I wish I could send a message to this incredible woman and know how much I respect her and am grateful for her and her whole amazing team!! They showed so much compassion, strength, fairness, wisdom, professionalism,  integrity and service to and for their community.  Way to go guys! Prayers and love for all of Waukesha from Texas ️  ", "Gosh it's nice to see what she looks like when she smiles. It makes me feel happy that she was rewarded for all her hard work as everyone was.", "She talked about \"our families\".  That says everything.  Classy lady, but even more a very smart, very qualified, hard working person.  An excellent role model.", "So impressed with this D.A. It is so obvious that the victims are foremost to her and her team, and she never misses an opportunity to praise the investigators. Never blows her own horn. Love her.", "Job well done by all!! \nSo much love for all the victims and there family's. I truly hope they can all heal from this someday and learn to live life without fear. The victims statements were so heartbreaking and I am so glad the judge addressed them as she did. ", "Not just the whole nation... the whole world. What an amazing DA. I'm so glad for the victims and the people of Waukesha that this was the eventual result, and I feel like Judge Dorow has made certain that there will be nothing to hang an appeal on. My thoughts were with all of the people as the victims gave their statements. I hope healing comes quickly now.", "They did an amazing job for the victims and their families and God bless you all. My heart is with you all.  Praying for the community ", "I hope Sue knows what a wonderful job she did for the community.  She is what every prosecutor should be.  She stood strong, she showed her love for the community", "Not only the whole nation of the USA there are people supporting the DA from all over the world", "They all did such an amazing job. I applaud the prosecution team and the beautiful and gracious Judge Dorow for all they did. The level of patience throughout this case was made abundantly clear. Three cheers to all of them \nContinued prayers for all of the victims here, and for those who watch over the rest of us.", "Sue is a real life hero in my opinion. It had to have been an extremely heavy weight on her heart to do all she could to obtain justice for all the victims. She did it with such class, integrity, & warmth. That combined with her work ethic & determination were deeply inspiring.", "Happy Thanksgiving Sue Opper. I'm so thankful that this horrific case was assigned to such a kind, compassionate, BRILLIANT, woman. With dignity and grace you really brought justice home for your community.", "The work you all did together, Judge, Prosecutors & all Families was incredible!!! So happy for everyone involved that it ended in time  Much Blessings ", "There’s so many across the country that love you and your team, DA Opper!  Thank you all for a job well done.", "I watched the entire trial. I don't live in WI, but feel their pain and love their sense of community. I'd love to hug all the victims who showed up to speak their truth in court. When the sentences were announced I surprised myself--I burst out in tears. I didn't realize how much this case had gotten to me. Bless Waukesha and keep healing.", "I’m so in awe of the beautiful community of Wisconsin. Your love turned a horrific tragedy into a love filled healing. Prayers & love from Texas. May the peace of The Lord fill you all with peace. ", "Standing ovation for Judge Dorow , DA office and the investigation team. I had not seen the Medical Examiner's testimony until last evening. I thought of all in the medical field personel, down to housekeeping, that  examined and cared for these victims,  cleaned up the carnage that cane through the hospitals. I pray also for each of your mental health challabges,, it could not have been easy. Blessings if renewal for all.", "I want people to appreciate that they wrapped this up in LESS than a year. \n\nThat is highly unusual. For homicide cases, it can take years for a few charges. This prosecution team secured guilty verdicts on 76 charges. That is amazing. And they proved each and every count beyond a reasonable doubt. ", "Thank you Judge Dorow and Sue Opper and the entire prosecution team for your patience and determination in bringing justice before the first year anniversary.", "Well done  Justice served! My condolences to all the victims of injuries and the families and loved ones of the people who were murdered. God Bless ", "No words can describe the anger I have for brooks. My heart goes out to all the people involved in this atrocity to human life. It's refreshing to know justice was served. Now that it's over I hope the healing process can officially begin for the families and victims. Cheers to all my fellow Wisconsinites and everyone else who remained strong through this. Nothing but support from here in Milwaukee", "I loved this lady she was so good and felt for victims. Great team", "Omg what a fantastic Prosecution team, they did their community proud and got them the Justice they deserve  ️", "Everyone, aside from Brooks, has been so thoughtful and professional. They really made sure this community was taken care of.", "Sending love from My wife and I from Tennessee. We watched all that was allowed to the public. This isnt his time and it's Wakashau Parade attack victims. You're a strong community and we admire that. Sending love and healing!!", "This DA and her team and the Judge did such a wonderful job.", "Highest of respect for this prosecutor and her team! You truly honored the victims, the survivors, and your town. I’m proud as can be!", "Contrary to what Darrell said, Sue Opper, you are a brilliant, well-spoken prosecutor!  Kudos to your entire team!  Judge Dorow, thank you!  \nTo all the healing residents of Waukesha.....what a wonderful community you all have....be proud of yourselves for showing the world your resiliency!  ", "We all  you Sue Opper!!! Thank you so much for what you did for the Waukesha community ", "So happy these family's don't have to go through this trial any longer. Truly heartbreaking that they had to go through all of that. The trial was the opening of their wounds that have not yet healed.", "Congratulations to District Attorney Sue Opper! What a tremendously great job you’ve done! I can’t even imagine the organisational challenge that this trial must have been - the dimension and complexity of the case must have required a great deal of nerves and patience for sure. I hope you celebrate your success in working for justice!   Congratulations to you and your team!", "Nice to see her smile. Through court proceedings you could sure see the expression on all the prosecution's team faces of pure acknowledgement of seeing  pure evil. Hope we can rest assured some sniveling coward of a lawyer or judge will try to get him released some day for some stupid reason. You and your team did a great job as well as the judge. Hope and pray for a Happy Thanksgiving and Merry Christmas as you have put this vermin where he belongs. Now we all can never think about him again.", "🇨🇦  says thank you to everyone who spent hours , days, tears, and energy getting through this fiasco … thank you. Thank you. You have given all of these people a bit of peace , and a lot of validation. Every victim / whether physically hurt or mentally affected is blessed to have you represent them. And to have this wonderful compassionate judge. There couldn’t have been a better team", "kudos goes out to all of the people involved in this case.  From the police officers who caught him quickly, to the officers who interrogated him afterward, to the jailers who had to listen to his crap all day when not in court, and finally to the prosecuting attorney team and the judge  prayers for all the victims ", "I am in a small town far from Wisconsin but never forgot that day of infamy.  The legal system in that county is above and beyond anything I have seen.  Brooks is an evil man and I cannot help thinking that a team of many women put him away for life.  Kudos to the whole team and community.", "What an amazing job The prosecution did and Judge Dorow was awesome, you could tell this case really touched her heart when she spoke and then she handed out the best punishment possible for that Monster, never have another free day as long as he lives. My heart goes out to all the victims and their families and now this is over hopefully they can try and rebuild their lives.", "There is so much wonder and pain this episode. The trauma from losing a child is heart breaking and the voice actors have done a phenomenal job portraying the anger, hurt, and pain. Freya, choosing restraint despite her own grief is powerful. The grandmother rejecting her granddaughter because shes scared to love anyone else because they might be taken away from her again ?", "Your team and the judge showed heroic patience with the accused. I don’t think I could take the abuse he doled out on a consistent basis. You all are true professionals.", "Judge Dorow, Sue Opper, and her team will forever live in my heart!", "Thank you for your hard and amazing work. It’s so wonderful to know Justice has been served.", "Sue Opper and her team did a wonderful job. The case was presented logically and flawlessly and the witnesses chosen were wonderful. I hope that the people who were so terribly impacted by the acts of the evil creature heal and can move on. May the ones who lost their lives rest in peace. Thank you to Judge Dorow for ensuring that any appeals will go nowhere and removing the creature from decent society.", "DA Sue Opper is Brilliant her words spoken were absolutely powerful!! I hope she’s able to take a much deserved vacation! Bless her ", "Hard hard case this team was so professional under very difficult circumstances.  We still pray for healing for all the families and the Town.  Justice was served. Thank you for all your hard work. The world was watching this awful man get the sentence he deserved.   GOD BLESS AND THANK YOU!", "Thank you Sue Opper.  You and your team were amazing during this trial.  Your patients are beyond imaginable.  Thank you all.  ", "This prosecutor and her team did an amazing job. I truly have much respect for her.", "Sue Opper, the Prosecution Team, and last but not least, Judge  Dorow, you all did a tremendous service to the victims, the victims families and the community.  I wish each of you a wonderful Thanksgiving!", "She handled herself with such poise and grace throughout the trial", "DA Opper:  You did absolutely amazing job prosecuting DB under imaginable stressful situation.  Congratulations on a job well done to you and your outstanding legal team.", "Finally, justice for Waukesha.  Great job Judge Dorow. You summed up how everyone else has been feeling. Thank you to the prosecution team. You guys have served y'all's community well. Great job.", "I pray for the victims and their families that they might have some sort of peace and healing for this horrible tragedy", "The DA and judge in this case were the \"Wakasha Avengers\". Such amazing hard work bringing justice for the families and victim's /survivors of DB.\nSuch an amazing community.", "This prosecution team and the court were epitome of decorum, justice and professionalism. They have done a fantastic and compassionate job for the victims. Justice was served. Blessings to the community of Wakesha  from Ireland our heart breaks with yours ", "The most powerful sentencing statement, ever. Along with Prosecutors closing arguments.  May those families start to heal. You all have tremendous strength. Those victims will never be forgotten.", "Thank you, DA Sue Opper! You and your team did an excellent job of getting justice for all victims.", "That scene with the Norns is phenomenal! As I was watching it I realized each of their dialogue is written from the three different narrative points of view. One is a narrator speaking from a 3rd person perspective about the events transpiring, one speaks at the same time as the characters, which is basically  being in 1st person, and the other speaks directly to them as another participant in  the events, which is 2nd person. Props to everyone who worked on that scene (honesty, to everyone who worked on this whole game), that's such a cool way to write the dialogue for omniscient fates.", "Justice has been served. Well done Judje Dorow (exemplary & so likeable), & well done DA Opper (super lady too), she and her team did a remarkable job. I watched pretty much the entire trial here in France, and I'm happy that the defendant was sentenced to life in prison, it couldn't be differently given his atrocious attack/murders and his disgusting/unbearable conduct throughout this trial. A massive thought for the poor victims,  and their families, I hope they manage to live with this tragedy at some point, even though it's easier said than done of course...", "Thank you Sue for the wonderful job you and others did to get this sociopath off of the streets! I hope you all get a nice,  long,  and well deserved vacation. God bless you all! ", "Everyone did a AMAZING job ! I couldn't be  more proud . The judge .. She is the most patent human I have ever seen in my life . My heart goes out to every single person affected by all of this . I hope they can all move on and try to find a new normal . Much love from Tennessee", "I have so much respect for her and her whole team!", "DA Opper, you’re so gracious and unbelievably patient.  You did an amazing job and had the self control I can only wish for.  Thank you for your service", "I have so much respect for this woman and for the judge. The things Brooks said about her were as disgusting as he is. Atty Opper was the picture of professionalism and fairness throughout this entire process and actually did him some favors although he’s too stupid to realize it. She’s an amazing prosecutor and has incredible morals and integrity. The entire prosecution team were amazing and Judge Dorow as well. They should be the example for many people in how to handle cases like this. God bless the judge, the prosecution team, and the community.", "DA opper is an amazing woman. Great job.", "Madam DA, you and your team were awesome to watch during this trial.  So much respect and sympathy for the victims and their families.  Every DA should watch and learn from all of you!!  Congratulations on a job very well done!!!", "Love how much you did for the families.", "I’m from New Jersey and I would like to say the Judge, Prosectors, Detectives, Jurors, etc., all did an amazing job. My heart goes out to all the victims. I pray that God will ease your pains.", "Thank you for efforts!    You and your team did great.      The community thanks you.", "Thank you from Pennsylvania..you are loved around the world…we can only imagine how hard it was for everyone to deal with that piece of garbage…may the lord give everyone the comfort they need going forward", "The judge and the prosecution team were overcome with emotion in the courtroom. They all worked incredibly hard.", "Thank you & your whole team for getting this done. Amazing restraint on all involved.", "Those prosecutors held their tongues and did their job professionally, putting up with things they shouldn’t have had to endure. They can (and should!) hold their heads high. \n\nWell done!!!", "The judge was absolutely masterful.\n\nNotice the final moment of incredibly quick thinking on the part of Judge Dorow: she knew she couldn't allow applause for the whole sentence, but after it happened for the first murder victim, she allowed it to continue for them and ONLY them.", "Let's not forget the prosecution worked so hard to lay this all to rest before the anniversary of the massacre. And with an amazing judge at the helm, THEY SUCCEEDED. Now these families and entire community can mourn the anniversary finding peace in the fact that this creature is NEVER going to see the light of day again! ", "Attorney Opper did a superb job throughout pre-trial prep, the trial, and sentencing. She is a prosecutorial role model. The townspeople and state were represented by the best and the brightest in being so fortunate having Attorney Opper on the case.", "I’m so sorry and my heart goes out to all of the victims. To the judge and all involved.... Wow, you guys put up with sooooo much B.S.!", "I love you. I am a black woman from Michigan and followed this case from day 1 and your entire team was amazing. \nI want to say I found his family to be just as delusional as he  is. Some laws should be revised.  How can anyone create such trouble every where they go and really get away with it.  All theses years he's gotten away with it.  No real serious consequences.   I've prayed for the families and for the healing of the community.   God bless you and team. And I can't leave out the judge.  She made sure she crossed her T's and dotted  all her I's so there could not be any thought of a miss trial. God bless you all and have a peaceful holiday.", "Job well done, DA Opper. You did a great job and I hope the survivors and victims have a bit of peace to try to enjoy the holidays. I’ll be thinking of you all this Monday and the days ahead ️", "I loved that also, that Judge Dorow read each victim by name and the number of years being served for them.  Pure class by this court.  So much love to each of the victims and family member.", "Phenomenal job they did and they worked so hard to wrap this up for the victims before the one year anniversary.  I'm sure that's worth everything."]}