{
    "video_id": "2x78hhWaLmU",
    "comments": [
        "DA Opper:  You did absolutely amazing job prosecuting DB under imaginable stressful situation.  Congratulations on a job well done to you and your outstanding legal team.",
        "He is innocent",
        "All  he cared about was his self.",
        "The prosecuting attorneys did an exceptional job! It was touching  Judge Dorow named each victim. I’m sure this means so much to the family and friends. The entire team showed so much patience. May the fallen victims RIP. Yes, the entire nation was behind your team to get the monster Darrell Brooks put behind bars for life! It’s time for each of you to take a vacation with your loved ones.",
        "Good job le, da and judge.",
        "Ms.Opper you did an excellent job.",
        "From NC .  These victims were are family and we were with them in spirit. We watched everyday of the trial,  we were offended, hurt, deeply sadden, then relieved.   We are grieving along side of you and rejoice with you, for every step of progress they make.  ",
        "She is so impressive professionally and did the victims justice with presenting the case.  Her team worked hard and dealt with the case so well!",
        "Sue Opper and her Prosecution team and Judge Jennifer R. Dorow are The Best! To the Waukesha Community? Please keep on being strong! God bless you all!",
        "I love you, and thank you DA Sue Opper for all your hard work. May God continue to bless you and keep you. Excellent ",
        "When I first started watching the trial I thought the judge was crazy for letting him act the way he was acting. But she was making sure that she was keeping decorum and leaving him no chance to come back and say that he didn't get a fair trial. That's why he kept asking to be held in contempt. Even though she was never holding him in contempt. He kept asking. Are you holding me in contempt? Because when you're held a contempt you go back to the jail cell and then he could say I wasn't there to hear the trial even though he was hugely disruptive and did everything he could to derail. They actually did an excellent job getting his case through as quickly and professionally as possible",
        "Sue Opper was brilliant. She showed the utmost respect and professionalism, and was stoic in the face of this monster. I was so impressed with her team and the case they presented.",
        "Bravo . I hope you can finally relax and enjoy not having to deal with that monster anymore ",
        "Your team and the judge showed heroic patience with the accused. I don’t think I could take the abuse he doled out on a consistent basis. You all are true professionals.",
        "Sue Opper and the other Attorneys need a big Bonus for what they had to deal with let alone and sit and have to listen. They were all so calm and well informed. They did their job and so much more. Their respect they showed (tolerated). God Bless them for being so calm and letting him try himself. And Bless all those that are suffering from this and also Darrel’s ex baby Momma and her family. How horror his children.",
        "She remained steadfast. Great work Att. OPPER,JUDGE DOROW and team.",
        "Thank you from Pennsylvania..you are loved around the world…we can only imagine how hard it was for everyone to deal with that piece of garbage…may the lord give everyone the comfort they need going forward",
        "We watched the proceedings from Canada and the professionalism and patience of the judge and all of you on the prosecution side was amazing.  We are so grateful that justice was served for the families of the victims.",
        "We love you Mrs. Sue. You are a rock star. ",
        "God bless you.  Thank you",
        "The fact that db said this was an open and shut case speaks volumes.   He knew what was coming",
        "Sue looked like she just got back from a much needed vacation after all this.great tan",
        "Ms.sue opper u did a fine job may God continue to bless u",
        "The absolute patience of everyone in the courtroom makes them saints imo. \n\nBrooks isn’t insane. He’s simply an absolute POS human.",
        "I wouldn't want to be in jail with her",
        "I’m so grateful justice had it’s purpose done for the families involved Also I’m very for all lost their love ones",
        "Good job, Prosecution Team! I wish he was going straight to prison, but the Milwaukee trial..... Couldn't Milwaukee waive his trial and just get him on into prison?",
        "DA sue opper. I do no know u, but you are one brilliant and tough cookie. He tried to insult you, but his words are only mumbo jumbo. He cud not handle you defeating him big time at every turn. His superiority is inferior to your and your teams minority. HOORAY, hooray.",
        "Madam DA…Ms. Sue Opper…thank you so much for a job well done! And you are correct, the WHOLE USA and many many people from other countries even support Judge Darow and the entire prosecution for putting this “man” behind bars for the REST of his life. Signed, a Supporter from Pleasant Garden, North Carolina!!",
        "I have the utmost respect for DA Sue Opper.  She and her team are phenomenal and did their best work to hold “him” accountable for his heinous, unforiveable crimes against good and innocent victims.  for Ms. Opper, her team and Judge Dorow.",
        "CONGRATS, PROSECUTION TEAM!",
        "So happy these family's don't have to go through this trial any longer. Truly heartbreaking that they had to go through all of that. The trial was the opening of their wounds that have not yet healed.",
        "I wish I could send a message to this incredible woman and know how much I respect her and am grateful for her and her whole amazing team!! They showed so much compassion, strength, fairness, wisdom, professionalism,  integrity and service to and for their community.  Way to go guys! Prayers and love for all of Waukesha from Texas ️  ",
        "Absolutely amazing lady ️",
        "I love this woman. She said “ I don’t care what you care about “ after saying that he’s weak and as he sits there has no control  0 . I’m so happy that the right thing was done and he will now be behind bars for the rest of his life. I know he’s probably in his cell right now yelling “ Objection “ and “ Grounds “  he did go on for 2 hours when asked about his sentence. I honestly thought that he wasn’t gonna stop",
        "Thank you Hon. Judge Dorow and court staff, DA Sue Opper and the prosecution team, the jurors, and to the victims that testified and families that gave impact statements. Waukesha, you’re free from him. The world is. I hope they bury him under the prison, so he can continue his 1000 year sentence after death.",
        "Let’s not forget the stone faced baliff!",
        "Wonderful professional woman",
        "Self pity and hate caused this, a lifetime of mommy bailing out a punk, with no father in sight.",
        "Go Waukesha!!!",
        "Now people can stop saying hateful comments about the Judge. She knew what she was doing through the whole trial. She was very professional and wanted to make sure that everything was done by the book, all t's were crossed, eyes were dotted and no chance of Parole. EVER!",
        "I am from Ohio and I had been following this trial. It feels very satisfying to see justice being served.",
        "I watched the entire trial. I don't live in WI, but feel their pain and love their sense of community. I'd love to hug all the victims who showed up to speak their truth in court. When the sentences were announced I surprised myself--I burst out in tears. I didn't realize how much this case had gotten to me. Bless Waukesha and keep healing.",
        "DA SUE OPPER....THANK YOI AND YOUR TRSM FR A GRATEFUL NATION. YOU ARE A REAL SERVANT OF THE CITIZENRY.",
        "I followed this case from beginning and I'm from Jersey. I'm surprised I don't hear about it more. This was such an unspeakable horrific act partly because it was at a parade  among many other things. I felt so many strong emotions and learned a lot. May Darrel Brooks rot in jail",
        "She’s great but she does have a frown all the time I noticed.",
        "I was very impressed with the prosecution team, the judge, the jury, and the people in the court room and how they all showed integrity and respect. As a viewer, I found myself wanting to yell at the monster’s behavior throughout this trial. May God be with you all as you continue to heal.",
        "From Australia, been following the whole case! Really a beautiful sight to see justice served, all thoughts to the families that they can mourn and commemorate the 1 year anniversary knowing justice has been served",
        "   Not just OUR Nation! If you watch YouTube streams (esp Emily D Baker former LA Deputy DA - Warning \"Cursery Words\"), SO MUCH Love, Encouragement, Support, Prayers, & 's sent through Victim Impact Statements from AROUND THE WORLD for ALL OF YOU!! ",
        "Thank u da and the judge  for all your hard work,in my opinion  nr brooks is exactly  where he needs to be,my heart  goes out to all the victims   and familys he destroyed",
        "The amount of unnecessary patience that was shown from the DA office is remarkable. Finally we can say amen and goodbye to that person.  Send him to Colorado...",
        "Well done to you and your Team DA Opper",
        "The whole nation thanks you, DA Opper. This monster could have turned up in any community & destroyed any of our lives. I'm very relieved he'll never be free.",
        "🇨🇦  says thank you to everyone who spent hours , days, tears, and energy getting through this fiasco … thank you. Thank you. You have given all of these people a bit of peace , and a lot of validation. Every victim / whether physically hurt or mentally affected is blessed to have you represent them. And to have this wonderful compassionate judge. There couldn’t have been a better team",
        "This lawyer and her team are a credit to their profession!!",
        "Thank you Judge Dorow & DA Opper.  Awesome work for bringing justice!!!",
        "Reviewer ... Politically correct ... I know where your coming from .. you feel sorry for this him because I know why ..",
        "I was at home clapping every time She stated each conviction .......",
        "Thank you , Sue!",
        "Damn shame we're going to let him live.",
        "Jack:  being confused about how Freya is getting across big gabs",
        "Ok, I missed a LOT. Who is Darrell Brooks, and what did he do to get DOUBLE 17y in PRISON?!?! How did I miss any/all of this?!! 0_0",
        "Judge Dorow is a truly remarkable lady and my new number one hero.",
        "Not just those injured were victims in this case. All the people in attendance were.\n      Anyone watching a live feed, those people left dealing with family members' PTSD, their caretakers, and the community's mental health programs will feel this for decades. All the people who actively participate in such parades have been affected by his actions. This even cast a pall over my own joyful memories of participating in Fourth of July parades. What if this had happened to us? How do we stop it in the future? We can't really we can only be vigilant and work to reduce it's likely hood.",
        "God bless you",
        "The media's dumbest question ever, and they just can't seem to grasp what a stupid, irrelevant question it is. \"What were you feeling?........\"",
        "The fact that this prosecution team was able to wrap this up before the 1 year anniversary is actually insane. Especially with this type of defendant, and the magnitude of this case. Sue, Leslie, Zach and the rest of this team did an amazing job for these victims, and of course the Judge did as well.",
        "I would love a biopic for her. She’s astoundingly strong and so professional. I’m so grateful this is done and  to the community!!!!",
        "The legend.",
        "GOOD JOB SUE OPPER AND YOUR TEAM, WELL DONE",
        "1 less spook on the street the brother-hood is thankful",
        "Attorney Opper you and your team had the whole nation behind you all. Your patience your knowledge was outstanding. Thank you for getting that evil man out of our society. God bless everyone involved. Your a role model for my Granddaughters and I thank you for that.",
        "This Da did an excellent job!!! Great work!!",
        "Love DA Sue Opper, Judge Dorow, and the whole prosecution\n team.  What a great job they did!",
        "Waukesha is a community of Phoenixes ",
        "After listening to the mother of the 11 year old girl, about how she had to care for her child after this horrendous event, and to the girl herself talking about the pain she suffers, and the amount of rehab she is still having to go through, I was enraged that anyone could cause so much sorrow, but was thankful that the man faced such skillful and dedicated prosecutors, Jurist, and law enforcement officers and such a focused jury, true justice was handed out to this offender, ( whom I choose not to dignify by using his name) now I hope, they will throw him in the deepest dankest cell in the most dilapidated prison in the state, throw away the key, and forget he even exists.",
        "May he receive final justice soon.",
        "You and your team did a great job!  The fact that you offered options to keep things moving along, as Mr. Brooks was so difficult.  He was demeaning, at times acting like a child, and just wearing -dealing with him on a day to day basis.  Thank you for showing the families that were so tragically impacted, that you kept your commitment to put him away where he could not do harm to anyone else in the free world!!   Much respect to all of you!!  Thank you.!",
        "He will catch a shank in the big house",
        "DA Oper,what a spectacular effort from all your team and everyone in law enforcement on behalf of the state- and to the incredible Judge Daro .How u all got through this trial is beyond me with Brooks driving everyone crazy with his idiocy and courtroom outbursts! A true NARCISSIST IN EVERY WAY!!",
        "Brooks will never be a free man again. Unless, perhaps, a new DA sees fit to re-evaluate his case and release him for some BS reason like his unfortunate childhood, or his unbearable debt, or whatever. No, I do not want that outcome. But it seems to happen more often with each passing year.",
        "I love Sue ..she is an upstanding human.",
        "Sue Opper and Judge Dorow are absolute ROCKSTARS!! Putting up with this bs trial and ensuring an appeal would never be valid! The world watched your grace and intelligence and are THOROUGHLY impressed!! Now give these amazing women a much needed vacation!!!",
        "Brooks is not a man.  There are numerous adjectives to describe him.  Prosecutor Sue Opper called him a coward, a victim called him a POS.  Those were spot on.  A man he is not.",
        "Let's not forget the prosecution worked so hard to lay this all to rest before the anniversary of the massacre. And with an amazing judge at the helm, THEY SUCCEEDED. Now these families and entire community can mourn the anniversary finding peace in the fact that this creature is NEVER going to see the light of day again! ",
        "Sue, you are my hero!",
        "He'll never eat watermelon ever again.",
        "The prosecution are an example of the best of humanity! Sue Opper you’re amazing, I hope you never think twice about what he said about you.",
        "Everyone, aside from Brooks, has been so thoughtful and professional. They really made sure this community was taken care of.",
        "I like Sue. She's a bulldog! Didn't take any sh** from that piece of work",
        "I applaud Sue Opper for her powerful support of the victims it's absolutely incredible how strong/stable Sue Opper maintained her focus during the entire time ratboy abused the courts time.",
        "The judge ruined the decorum she set by letting those people cheer at the verdict. Bad move. There are people like Dahmer and the ice man out here that didn’t get that kind of treatment\n There is a reason judges don’t allow this, this case was no different than any other victims pain in any other case. The point is to above all maintain civility and decorum. Hooping and hollering for 6 life sentences isn’t either.",
        "Thank you, Attorney Opper! We love you and recognize the hard work of not only your team but of YOU as well  (your team rocked too!)",
        "Sue, you and your team are the absolute best!!!  You all need a long vacation, along with the Judge.",
        "Those prosecutors held their tongues and did their job professionally, putting up with things they shouldn’t have had to endure. They can (and should!) hold their heads high. \n\nWell done!!!",
        "Thank you Sue Opper and DA team. Thank you JUDGE DOROW \n\nTHANK YOU LORD GOD FOR EVERYTHING",
        "Sean Ford Federer",
        "It was two hours of word salad.",
        "I want people to appreciate that they wrapped this up in LESS than a year. \n\nThat is highly unusual. For homicide cases, it can take years for a few charges. This prosecution team secured guilty verdicts on 76 charges. That is amazing. And they proved each and every count beyond a reasonable doubt. ",
        "Congratulations to District Attorney Sue Opper! What a tremendously great job you’ve done! I can’t even imagine the organisational challenge that this trial must have been - the dimension and complexity of the case must have required a great deal of nerves and patience for sure. I hope you celebrate your success in working for justice!   Congratulations to you and your team!",
        "Thats unless he gets a president pardon",
        "Watched from the UK - disgusted by this noxious evil wastrel, heartbroken for Waukesha, impressed by Judge Dorrow and the prosecution team.",
        "One problem he's still alive",
        "Thank you Ma’am.",
        "OhhhDarrell...welcome to the 1st day of the rest of your worthless life!! ",
        "I watched while the Judge was reading the sentencing and heard those in attendance applaud for the first six ( deaths ) counts. I believe that the clamping, as the DA said, may not have been proper decorum but they were elated that justice was being served just as it was deserved. We need more of that in this country..Thank you to all of the “Justice” members in this case.",
        "I’m shocked how fast they were able to finish this trial. Cases with this many victims usually take years to get to trial. Great job prosecution!",
        "He spent more time bashing sue opper than he did on almost anything else️ not surprising at all. He apologizes to the judge and then five mins later does the exact tin* he apologizes for. He had no regard, regret, remorse towards the victims. Only that he got caught. Much love and support to the families and victims ️️️️",
        "Of all the people in the courtroom, Sue Opper was the COURTROOM! Her and her team were amazing.",
        "He LITERALLY had the nerve, when asked what he think he should get, to say “I mean, I have been here a year already” - Never Relax.",
        "DA's closing statement was moving and powerful.\nDA team job well done.",
        "Judge Dorow, Sue Opper, and her team will forever live in my heart!",
        "Love her and can't wait to see her as a judge.",
        "She really did a wonderful job. Her and the entire defense team. She’s an emotionally and mentally strong and wise woman.",
        "Everyone: you plowed into a parade full of innocent people, including a large proportion of children, murdering four grandmas, a grandpa, and a little boy. There’s no way we could possibly come to hate you more than we already do. \nDarrell Brooks: hold my beer",
        "... the whole nation and the world!",
        "The judge!!",
        "These are the women young girls and young women should be seeing in there social media feeds. Rockstars.",
        "Great job!! Woot woot",
        "Everyone in this case did a great job, I cant wait for Brooks to meet his new husband in prison!",
        "The DEFENDANT ",
        "I fell asleep 2x during his pity monologue.  His insulting the DA. was typical of his trying to demean people who are on to him.  I almost believed some of his crap till I heard the jail house calls...he is worse than I thought. The jury found him guilty without knowing his priors and seeing alot of his antics in court. Major kudos to the prosecution (all of them), and the judge!",
        "The most powerful sentencing statement, ever. Along with Prosecutors closing arguments.  May those families start to heal. You all have tremendous strength. Those victims will never be forgotten.",
        "Wonderful counselor!!!!! Now, may your community begin to heal!!!! Awesome that a woman presided over the case and a female prosecutor tried the case!!!!! Awesome ",
        "How about that when theyre transformed as the imposter role, their voice is disguised, so they can still talk, but the crewmates dont know who it is.",
        "He thought he was going to get off.",
        "Her and her team, and the judge all did amazing work, and this guy got everything he deserved. Unfortunately, Wisconsin is not a death sentence state, because if anybody deserved it, this guy did",
        "Thank you for all the work you’ve done to put that incel away for life. Justice has been served.",
        "Congratulations to the prosecution team",
        "LESBIAN!",
        "I want to go to the parade this year",
        "Love Sues accent.",
        "...and you madam prosecutor,  you all did fantastic, THANK YOU!",
        "The most hilarious part of the day was when the man in orange prison garb who was handcuffed and chained to the table told Sue Opper that she's not very bright.",
        "Bravo Sueyou did  everyone very proud ",
        "Had any of the previous courts saw the pattern of behavior of the defendant, the carnage of that day could have been avoided because he would have been incarcerated appropriately. Ponder that.",
        "The prosecutors did such a great job on this case",
        "Thank you Sue for the wonderful job you and others did to get this sociopath off of the streets! I hope you all get a nice,  long,  and well deserved vacation. God bless you all! ",
        "Too bad they’ve done away with the death penalty!",
        "Sue is such a wonderful attorney. Great job by all of these attorneys. The clearly care so deeply for the victims and families they represented. \nJudge Dorow is incredible.",
        "I guess Nicole Linton is next",
        "What a nightmare for all of them and what strength was shown",
        "She needs to stop smiling, that's a disgrace to rejoice over someone getting life in prison. ",
        "DA Opper is an amazing woman. Truly a great prosecution team!",
        "Thank you to Sue Opper and Judge Dorow, they showed the world how conduct yourself in court and in life. It is all so emotional and tragic, my condolences to the families.",
        "Attorney Opper should be our attorney general. Her team did a great job with an excellent leader.",
        "Thank you both, Judge Dorow and Attorney Opper!",
        "What amazing people the judge and prosecution were. Justice in its purest form.",
        "I absolutely love Charlie, always going out of his way and doing everything he can to help people in any way possible whether it's with money, with a silly competition, a serious stream to promote exposure but still being silly to make people jus laugh, a charity stream or just something as simple as streaming to thousands of viewers every day making us all laugh and constantly putting smiles on her faces. I don't know about you guys but that sure does a lot for me  thank you charlie, for just simply being new",
        "Sue is now known as the Opper Stopper",
        "I absolutely LOVE Opper! She's amazing!",
        "Great job DA.  1000 Years for that POS!  RIP to victims, prayers to families and friends.",
        "His denial, delay, and narcissist pathological behaviors is soooo very similar to DJT, it remarkable. Brooks will never make it through his sentence due to his narcissism.  His fellow inmates won't put up with it coupled it with the fact that vons don't like people who kill and/or maime children. I don't expect Brooks to survive their wrath.",
        "They did a great job!",
        "I knew a black girl named Waukeesha once.",
        "This lady right here...I love her!",
        "DA Opper is a rock star ",
        "Amazing prosecution team on this case.    Very good at their job!!  They did their best to keep calm & keep going.",
        "As a Waukesha resident I am so proud of Judge Darrow. How she dealt with DB and giving respect to all the victims by naming them during the first six homicide convictions was nothing short of amazing.",
        "Great job.",
        "after seeing brooks mom and grandma and what they had to say it's no wonder he's a demon. I wonder if they remembered he killed 6 and injured 61",
        "This lady did a fantastic job and showed the narcassist that he wasnt going to control or manipulate her . He hated the sight of her but she couldnt care less. Q very strong and powerful lady. God bless her.",
        "If for some odd reason I woke up one day and was told I did this and here's the evidence, I would be apologetic and lay my fate on the judgment of the court. His behavior, on the other hand, shows not the slightest amount of remorse.",
        "Can barely hear the reporters",
        "I was so angered that he never once apologized, and rolled his eyes and clapped his hands ",
        "Address why he did this. Address the black supremacists social media that defined his life.",
        "Lord dont u know as long as he breaths hes walkin free even if its in prison thats more than he gave those peopl he killed",
        "Sue Opper and her team did a damn good job for his victims and their families.\nJudge Dorow is most gracious and she is the Patron Saint of Patience.️\nLove to Waukesha",
        "I def appreciated her saying each name. Was it long?  Yes. But, every victim deserved to be recognized.",
        "Absolutely. Random person from Indiana here. Full support and prayers for everyone affected, from me and my family's little corner of the world.",
        "God bless you madam ",
        "DAMN THIS WOMAN IS HARD TO LOOK AT!\nWILL IT HOLD UP ON APPEAL?",
        "What a crybaby she is so unprofessional.",
        "Because he thinks he shouldn't be punished at all, that's why he had no answer for her.",
        "Fantastic prosecution team",
        " Sue Opper ",
        "Also, I thought the victims, judge and lawyers were amazing and really reflected the quality of their community.",
        "Great job all around.",
        "She deserves a long vacation",
        "Sue Oppor you are amazing  ",
        "She did an amazing job",
        "Job well done by all!! \nSo much love for all the victims and there family's. I truly hope they can all heal from this someday and learn to live life without fear. The victims statements were so heartbreaking and I am so glad the judge addressed them as she did. ",
        "Well done  Justice served! My condolences to all the victims of injuries and the families and loved ones of the people who were murdered. God Bless ",
        "DA Opper....you did a phenomenal job.",
        "I love this lady... she's able to clearly articulate herself even under this stress and emotional strain.",
        "Justice has been served for these families.",
        "From Florida: First, Bless Waukesha citizens, My deepest sympathy to you all.  Congratulation to the Prosecution Team, Judge Dorow, and Jury.   This is a trial I watched from beginning to end with very little knowledge of the incident with just headline internet news last year.  I certainly didn't know Darrell Brooks.  I became interested as I was in a jury select case for a major murder case in Broward County but was dismissed due to health reasons but it was an intriguing process to me.  Well, I learned a lot within this case in regards to Sovereign nonsense, a raging maniac that is not insane.  Gosh, I got in a lot of arguments with friends stating that he's simply an evil man with no good intentions period.  I wished I followed earlier because I would've loved to be there tomorrow and stand strong with the community.  You are all in my heart!  AGAIN, THANK YOU JUDGE DOROW, SUE OPPER/TEAM AND JURY.",
        "God bless you Sue and the rest of your team!You  all did an AMAZING JOB!!Did you see Zachary white knuckling the arm of the chair when Brooks was talking! It took everything in him not to jump up and punch that SOB!!",
        "Animals belong in a cage.",
        "The closest to an apology he got was, \"Not only am I sorry for what happened, I'm sorry you could not see what is truly in my heart\" That was not an apology, that was minimization. He is distancing himself from the crime he committed with the language he's using. If he was sincerely apologetic and taking accountability it would have been, \"I am sorry for what I did\" and that's the bare minimum.. as in, if he felt even slightly bad for the hurt he caused others then that's how he'd have worded it. Then he goes on to blame the victims for not being able to decipher his remorse. He says they're comfortable hearing what they want to hear. This man is an unscratchable itch under my skin, I can't imagine how the victims and family must feel. He regrets his actions alright, but not because of the damage, suffering, and death he caused... he regrets his actions because he doesn't like his consequences.",
        "Thank you Sue ",
        "Please give them a LONG vacation.  Let them take the rest of the year off.",
        "I love how professional DA Opper was as she sat looking at brookes for 2 hours as he blathered on and didn’t respond in any way to his insulting her abilities etc",
        "Wow, Ninja's new \"I'm loud and abrasive\" angle is not my favorite.",
        "You are correct! Lack of remorse, lack of responsibility and plenty of rudeness. He will be forever rotten in prison.",
        "All of you were amazing. including the whole community.",
        "and his license was suspended",
        "All business and laser locked on. I loved it",
        "Sue would make a great Judge too one day",
        "The support reaches across oceans, Waukesha! Love from Belgium.\nNotice how Opper doesn't even try to toot her own horn? Not even discretely. Just care for the families. She and her team did an amazing job, trying to protect the victims from Brooks' interrogations as much as possible while making a waterproof case.",
        "Thank you to the whole prosecution team. You did such a great job for the families affected by this monster. You stood in front of them and faced evil.",
        "You are a fierce opponent my girl! I would have you on my side,  of any battle, any day!  Good job all 3 of you! Hip hip hurrah!",
        "Bless them all need a long vacation",
        "Judge Dorow and all 3 SA as well as all the victims and their families deserve Oprah’s favorite things and a very long vacation",
        "GREAT WORK.DID IT BY THE BOOK.ALL DA SHOULD BE AS GREAT AS YOU.",
        "Its over.",
        "She was amazing!!  She stood up to Brooks and did not allow him to mess with her or her case at all!!  She got the job done!!  DB won't be harming anyone outside his prison ever again!!  You're a hero Sue!!!",
        "Bravo to everyone who had a hand in bringing Brooks to justice.  I'm sure there were many unnamed and unsung heroes.  Know that you are appreciated even if we don't know your names.",
        "This poor woman needs a mental health vacation the stories she heard and the comfort she continued to give the victims she is a hero as well!!",
        "DA Opper is such a skilled, compassionate attorney. Excellent at her job, firm and steadfast yet kind and endearing. She was far more respectful to him than Brooks deserved. She's set to retire in 2024 at the end of her term, and it's more than well earned.\nJudge Dorow was equally compassionate, giving Brooks all the patience and discretion she could muster, yet going above and beyond to protect the record, and not mincing words when saying how she felt. She was compassionate toward those who truly suffer from NGI-resulting mental illness, and to the 68+ victims. ",
        "We also need more prosecutors like this that don’t believe in revolving door justice. Great job.",
        "i thought she was one of the best prosecutors I've ever seen.  Her knowledge of the law and commitment to seeing the accused get a fair trial were exemplary.  All the prosecutors were exceptional, showing patience and professionalism even when they were not met with the same.  Sue Opper is stellar and a terrific role model for other lawyers.",
        "Democrats would vote for him,",
        "Job  well done DA Sue Opper and your team. Also a awesome job by the judge. Thanks to all for you amazing patients in this entire circus, displayed by this narcissist Brooks. So glad for all that this is over now !",
        "Thank You to the Jury",
        "Good job, DA! Thank you for your work and for keeping composure especially during his amazingly, self-absorbed rant.",
        "There should be a clause in every state even where death is not allowed that in cases with cruel and unusual death or In cases where extreme pain and torment is brought down on the victims the judge should have the discretion and final say so even if the death penalty is done away with.",
        "Loved watching Sue Opper fight for the victims and the law. She is Unflappable and embodies true Humanity!",
        "Hats off to the DA team, and The Judge. I watched most of the coverage, Hope you guys a long restful break and a well deserved Drink. Cheers",
        "She talked about \"our families\".  That says everything.  Classy lady, but even more a very smart, very qualified, hard working person.  An excellent role model.",
        "The police did such a great job putting this case together that Helen Keller could've tried it and won.  Given that Brooks was pro se, it was even easier.   Anyone notice at the very end after sentencing where three huge guys over 300 lbs each surrounded him and made sure he wasn't going to act up again.  Try Objecting to that Darrell.",
        "Congrats on the awesome WIN . You deserve a good bottle of wine  and a couple days off , relaxing.  I'm so glad you put that piece of sheet away for life , it deserves what it got . God bless . Adelaide South Australia 🇦🇺 ️ ️ ",
        "It was an amazing trial.",
        "DA Sue , is this the hardest craziest case you have ever had to do?",
        "The support because of being able to watch entire case is worldwide, I was in tears when️ the families clapped",
        "I found it hard to watch impact statements. Had to click away. \nThe judge's sentencing was very interesting to listen to. Very comprehensive\nHis statement was ridiculous.",
        "Thank you & your whole team for getting this done. Amazing restraint on all involved.",
        "I love Sue ",
        "Judge Dorrow, Sue Opper & team members and all the rest that helped put this lump of away! THANK YOU!!!.  If Mr. Brooks kept on talking I think I would have committed a petty crime to go to the same prison just to Break out the can of ass whooping on him…🇺🇸",
        "Patience of a Saint!",
        "Kudos to DA Opper! Well done!",
        "Stellar! You were so on point and presented a foolproof case. Awesome!",
        "TBF the evidence was so unequivocal Ronald McDonald could have secured a conviction.",
        "These people should try every case in America... or inspire the rest of the judges and prosecutors to stop going easy on criminals.",
        "I watched this trial and was shocked at how calm and tolerant the judge was…. And then when I saw her read off almost 1000 years of sentences and I understood how she kept her chill….. because she knew in the end he was going to a dark hole.",
        "Did you notice the people that spoke on Darrell Brooks behalf? Never really said anything good about him except for the ex-girlfriend. His mom and grandmother went straight into mental illness pep talk. They never said. I love you Darrell. I'm sorry this happened. It was just basically mental health hurts. This and mental health does this. And then it was. I've been a pastor for 47 years and we've done this and we've done that and I'm going to make it my job to do this. Well okay. The past 47 years of trying to help your community. Why couldn't you guys get help for your son? He wouldn't even take responsibility for what he did. The only thing that he did was make himself the victim. He cried for himself.",
        "DA SueOpper  your closing arguments was amazing. Thank you for getting Justice for the people of Wisconsin ️️️️️️",
        "Sue what a great job you and your staff done to this sub human",
        "I am in a small town far from Wisconsin but never forgot that day of infamy.  The legal system in that county is above and beyond anything I have seen.  Brooks is an evil man and I cannot help thinking that a team of many women put him away for life.  Kudos to the whole team and community.",
        "Excellent prosecution, investigation with an A+ judge. Bless the victims ",
        "I’m from New Jersey and I would like to say the Judge, Prosectors, Detectives, Jurors, etc., all did an amazing job. My heart goes out to all the victims. I pray that God will ease your pains.",
        "I can't get over the feeling that Darrell sees his sentence as a score to brag about to his new neighbors.",
        "The DA and judge in this case were the \"Wakasha Avengers\". Such amazing hard work bringing justice for the families and victim's /survivors of DB.\nSuch an amazing community.",
        "Attorney Opper did a superb job throughout pre-trial prep, the trial, and sentencing. She is a prosecutorial role model. The townspeople and state were represented by the best and the brightest in being so fortunate having Attorney Opper on the case.",
        "The whole Nation is right. I live in Oregon and I watched the whole trial and watched how great the prosecution team and Judge Dorow were and all the victims on my mind and in my heart for the whole trial and they still are.",
        "DARRYL BOUGHT ALL THIS ON HIMSELF!  CAN'T FEEL SORRY FOR HIM... HIS LUCK FINALLY RAN OUT....I PRAY THE FAMILIES CAN HEAL ONE DAY SOMETHING LIKE THIS I FEEL WILL TAKE A LOT OF TIME",
        "I would donate money to this prosecutor so she can go out and have a nice big and long drink after what she and her team went through",
        "Sue Opper for Mayor\nJennifer Dorow for President",
        "All of Brooks antics ie firing his lawyers etc. and they still got it done in less than a year. AMAZING",
        "The whole nation and round the world. 🇬🇧",
        "Great job all them did",
        "I am Canadian and the whole world was watching because humanity matters and we all bleed red so it was important to see the just prevail.",
        "This prosecution team and the court were epitome of decorum, justice and professionalism. They have done a fantastic and compassionate job for the victims. Justice was served. Blessings to the community of Wakesha  from Ireland our heart breaks with yours ",
        "DA Opper, you did a GREAT JOB. Judge Dorow is a hero, and SO ARE YOU.",
        "Great job DA!! You made a big difference in the community!!",
        "And to think that Darrell Brooks told Sue Opper she wasn't very bright. She was bright enough to put him away for 6 life sentences, plus almost 1,100 years and every dime he makes in prison will be taken away for restitution. Congratulations Sue Opper and your team. Shout out to Judge Jennifer Dorow for the way she handled the courtroom. She did an amazing job and dealt out the proper sentencing. Prayers for all the victims in this case. I don't think I could have shown the same dicipline in court as they did with this animal evil monster they had to face and deal with every day. Prayers also to the Waukesha community as you heal from this tragedy.",
        "Ms Opper  you and your team did an excellent job The country and world  thanks you",
        "Thank You Sue Opper and the whole Da staff and to judge Dorrow both did an excellent job",
        "Omg what a fantastic Prosecution team, they did their community proud and got them the Justice they deserve  ️",
        "Great job prosecution great job judge\nGod bless y'all \nHave a great holiday@",
        "She's a bad ass the judge and her!!!",
        "Brooks has specific aggression towards this DA because he couldn't manipulate her, bully or intimidate her!  She did a great professional job!",
        "She got the job done.  She cares deeply .  She is brilliant.  Thank you DA Opper.",
        "Dude deserved a short drop and sudden stop. He gets to hug his kids , mother. Live , eat ,",
        "Extremely unlikable",
        "Wonder Woman ️️️",
        "Sue Opper and her team rock!",
        "this lady was a beast!!!   yes!!!",
        "Prosecutors and Judge did a great job and I am glad they all kept their cool",
        "Judge Dorow and Sue Opper are so powerful and I know that these strong women got under Brooks' skin. So very thankful to them and the entire prosecution team and every witness who went through this trial with the patience of saints in order to put away such a horrible, conscienceless human being. Brooks tried to make a mockery of the system and had no regard for the lives lost, but Judge Jennifer Dorow gave such an amazing tribute to the victims in her closing remarks and sentencing. You can really feel how much love is in this community. I hope they all continue to find strength in each other.",
        "Sue Opper you were fantastic!",
        "Nice to see her smile. Through court proceedings you could sure see the expression on all the prosecution's team faces of pure acknowledgement of seeing  pure evil. Hope we can rest assured some sniveling coward of a lawyer or judge will try to get him released some day for some stupid reason. You and your team did a great job as well as the judge. Hope and pray for a Happy Thanksgiving and Merry Christmas as you have put this vermin where he belongs. Now we all can never think about him again.",
        "Did a brilliant job dealing with that absolute loser, glad prosecution got the result they worked for",
        "Susan Opper, you are my hero!!! But I do want to point out that \"3rd Party Intervener\" DID comment on his sentence. He said \"I do not consent to be sentenced\"!!! With ️ from Charleston, South Carolina: GO WAUKESHA!!! ",
        "And he still has a couple of cases to go. Apparently he still has to deal with the case involving the ex-girlfriend and what he did to her. Truly a disgusting individual. Glad he's going to be in jail for a very long time.",
        "Wonder if Brooks will be allowed interviews?",
        "Thanks to the DA team for bringing this to a quick end. I would also like to thank The Honorable Judge Dorow for her patience in allowing the \"Defense\" the opportunity help the Court render a just verdict. God bless the families of those who were killed or injured. Waukesha Strong!!",
        "How Judge Dorow protected the record was gracious!",
        "BRAVO!!!!! Fabulous work. Thank you.",
        "I love her, she was fantastic!",
        "Thank you Judge Dorow and Sue Opper and the entire prosecution team for your patience and determination in bringing justice before the first year anniversary.",
        "Love you! You did an AMAZING JOB, and we are GRATEFUL!!!!",
        "Ms. Opper, don’t ever let that “thing” get over-your head. That’s how he gets enjoyment. Because, he hates himself for losing, so he destroyed himself.",
        "DA opper is an amazing woman. Great job.",
        "Even his mother wouldn't take accountability or apologies to the victims. Dawn Brooks is to blame for raising her son to be a monster.",
        "What an amazing job The prosecution did and Judge Dorow was awesome, you could tell this case really touched her heart when she spoke and then she handed out the best punishment possible for that Monster, never have another free day as long as he lives. My heart goes out to all the victims and their families and now this is over hopefully they can try and rebuild their lives.",
        "I support DA",
        "You did, lady. Good job.",
        "My response, great job to the prosecution and to Judge Dorow. I live two hours south in Illinois and have been following for the whole trial. Wanted to climb through my tv or phone while watching and beat Brooks for not showing one ounce of remorse. Good luck in prison.",
        "Thank for Sue Opper, Your team!! and Judge Durrow. Judge , Thank you. Your a inspiration to are Judicial system and beyond. All in involved officers, detectives and son on. . job well done!! I admire you son much. Now it's time to start to heal!God bless Waukesha!! Bring them strength and guidance!!",
        "If there ever was a real life monster in this world…it’s Darrell Brooks. His lack of remorse for what he did is sickening. Only a monster can live with himself after all he did. Add to the fact that he thought the court had no jurisdiction over him, making a mockery of the judicial system and trying to suggest that a jury can nullify the law. In the end this creature is in a cage…where he belongs.",
        "Sue you are an angel God bless u all",
        "Justice has been served. Well done Judje Dorow (exemplary & so likeable), & well done DA Opper (super lady too), she and her team did a remarkable job. I watched pretty much the entire trial here in France, and I'm happy that the defendant was sentenced to life in prison, it couldn't be differently given his atrocious attack/murders and his disgusting/unbearable conduct throughout this trial. A massive thought for the poor victims,  and their families, I hope they manage to live with this tragedy at some point, even though it's easier said than done of course...",
        "You are mistaken.  He DID say he was sorry.  Go back and listen to his statement.  He’s right.  You aren’t that bright or you would have heard him say those words.",
        "The judge and sue and her crew are fantastic humans and did amazing work thank you",
        "What surprised me when YouTuber Norman Nicks interviewed Darrell’s girlfriend Erika about Darrell’s grandmother testifying she said this. ‘ Darrell doesn’t have a living grandmother’.",
        "She's a legend ",
        "Another UK viewer here. Totally absorbing case and I was incredibly impressed by Judge Dorow's patience throughout. Brooks is the personification of evil IMO.",
        "The DEFENDANT lmao. She the one.",
        "You couldn’t get an easier case. Brooks was such an idiot in court. He did this all himself",
        "Sue Opper and the prosecution did a great job. Brooks attacking Opper in his sentencing request just shows her power. Well done Judge Dorow as well.",
        "she is now my hero! love everything she did",
        "Thank you Sue for your service",
        "What a wonderful person and lawyer.",
        "Great work (and patience and courage to challenge) by the Defense Team!!",
        "️️️AMEN SISTER ...YOU AND YOUR TEAM DID EXCELLENT...GOD BLESS YOU ALL AND THE ENTIRE COMMUNITY..\nGOD BLESS EACH AND EVERY FAMILY THAT SUFFERED FROM THIS...\nYOU ARE A CHAMPION AND JUDGE DOROW AND THE REST OF YOUR TEAM AND THE SHERRIFS DEPUTIES ARE ALL AMAZING AND VERY PROFESSIONAL...YOU SET THE PACE FOR THE NATION TO FOLLOW ...GOD BLESS YOU ALL.",
        "HAHAHHAA that Brok impression at 1:02:25 was so good hahaha.\n\nAlso, for Jack and anyone else who was wondering, the symbol after the omega at 1:07:34 is the Greek letter lambda, and it was put on Spartan shields.",
        "Please Live Stream the Waukesha Parade on YT Dec. 4 @ 4pm.",
        "People from around the world were watching the trial/verdict and sentencing. The stream I watched for the verdict and sentencing had a fellow from Glasgow Scotland...over the course of the trial several from the UK and all 50 states.",
        "Working in Law with the name Sue should be illegal",
        "We all love you Sue!",
        "This woman was very professional, very stern. Darrell Brooks tried to make her feel like she didn’t do her job correctly.",
        "Reporters dont bother asking Brooks questions because they know he'll just ramble for hours and it will be the first time a reporter will walk away from potential content.",
        "The whole world. ",
        "DMV supports Waukesha !!! ",
        "Thankyou Ms Opper..from the bottom of my heart.. god bless you all involved from Wales UK ",
        "What's really insulting is calling Mick \"lazy\" when he was working with such an insane schedule that he ended up being forced to sleep under his desk, working 24/7 at some point, unable to spend time with family. I've seen scummy managers do this exact bs maneuver all the time to employees that they don't like; give them a completely unrealistic schedule, expect them to work insane overtime, only to berate them when they inevitably fail so that they can call them \"lazy\" and have an excuse to fire them. My heart sank when I read Mick's statement and saw this kind of abuse happening to him. When reading Marty's post vs Mick's it's clear to me who the real \"ball ache\" is. Marty's post reads exactly like a corporate rat who knows he holds all the power and can control the narrative with the help of his massive legal team. :-D",
        "Da opper is a world star    much love from maine",
        "I really hope his Cellmate shows him some new subject matter right up his Jurisdiction.",
        "Hero!!!!",
        "Love how much you did for the families.",
        "Dorow Is one of the best Judges humble patient I’ve ever seen in my life I applaud you for your patience and getting justice serve for the people ",
        "The thing about Christianity is you must first admit your sins and then ask for forgiveness. He is incapable of remorse.",
        "Thank you to the entire prosecution team led by Sue Opper you all did an amazing job to keep the focus on  justice for the victims as hard as it was with DB selfish antics  in the court room .. God bless the Judges and your families and the victims families and may the healing begin ️",
        "I accidentally ran over a baby bird hopping along the sidewalk when I was a kid on my bike. It crushed me. I still think about it and feel guilty for it nearly 30 years later. I can't understand how this man spoke for hours upon hours during his proceedings and NEVER even apologized. Prayers for his cellmate's knuckles ",
        "not just the nation, the whole of north America",
        "honestly as much as it was a childhood dream to work for one of these big game companies, i'm so glad i got into a smaller studio started by people who got out of these toxic environments and want to do better. if you want to be involved in game dev don't let these stories discourage you, just let them guide your goals.",
        "Justice was served. Great job to the prosecution team! Seriously. What a heavy case. Praying for all the victims and those effected from the attack of Nov 21. Praying they find healing and closure from all of this.",
        "Encouraging interview. DA Sue Opper looks so much more relaxed and relieved now that this demanding trial is over. It is time to reevaluate what self representation by a Defendant means. There must be some kind of rules of the Court that can limit a free for all approach by the Defendant. I did not realize that the Court is required to guide the Defendent through the process and provide him with so much written material.Darrell Brooks made my skin crawl with his ignorance and narcissistic behavior. Judge Dorow chose what she felt was the best way to handle Brooks behavior, but it became a game Brooks controlled. What a torturous daily grind for every member of the Court and all observers. Hearty congratulations to DA Opper  and her staff for a job expertly done.",
        "Thank you, Sue  and your team.",
        "GROUNDS!",
        "She's the one that did the best job in this entire case .I wish she would have been the judge, because this woman would have tore into this clown on day one and she would not have put up with any of his antics",
        "For certain, this was a victory and justice was finally served after allowing Brooks to disrespect the victims and the court each and every day of the trial and allowing his ego to bask in the focus of the spotlight of everyone's attention while he did it.  What is still rather upsetting, however, is the idea that he was a free man to commit the atrocious act of mowing down all of those people in that parade, after already demonstrating to the world that he was a danger to society by way of his documented history of crime and violent crimes, including running over his ex with the same vehicle not long before doing the same thing to all of the victims in this case.  I can not wrap my mind around how many times this sorry excuse for a man kept finding himself in custody due to his inability to conduct himself like a emotionally stable, adult, but then to have the legal system release him with minimal consequences!  The most basic of algorithms would have flagged this man as an inevitable threat to society!  Somebody in the legal system over there has the blood of these, many victims on their hands for failing to hand down the appropriate punishment to Darrel Brooks each time he was cycled through the courts, arrest after arrest after arrest.  That person (or those people) must know who they are and I pray that they fully realize how their inaction allowed this to happen and I sure hope they handle future cases accordingly so another easily identifiable monster, well on his way to committing such an atrocity is prevented from doing so by holding them accountable to their initial crimes, getting them off the streets before they can do maximum damage to their communities!",
        "He has a few screws loose and his brain just doest work right.  Yeah he didn't apologize because that would mean he did it. He still trying to get people to believe the vehicle malfunctioned..lol",
        "I love her️I respect her️\nI appreciate her️",
        "Sue Opper is an amazing prosecutor with a huge gracious heart ️ WTG !!",
        "Your whole team was amazing and Judge Jennifer and all of the DA team madam clerk the sheriffs should all be commended. Congratulations",
        "The judge gets a lot of credit for her handling of this case, but this woman deserves equal praise.",
        "Dorow/Opper for President/Veep 2024!",
        "Well Done.  D A.  For your work   stand proud Mamm",
        "It may have been a little unusual, but in this case the applause was a  respectful farewell to the víctims. It touched my heart.",
        "This woman was amazing, along with the judge. So much poise while dealing with that animal",
        "Mick clearly shows his passion in everything he creates, even 14,000 word  PDFs describing his shitty situation. What an admirable man >:-O",
        "Sue! You’re amazing! Thank you for your hard work!",
        "Alabama is behind u all!  Wishing nothing but joy and peace for the entire Wakeusha community!",
        "Excellent job.",
        "Continued prayers  for this strong community.  Kiddos need our support.",
        "Everyone did a AMAZING job ! I couldn't be  more proud . The judge .. She is the most patent human I have ever seen in my life . My heart goes out to every single person affected by all of this . I hope they can all move on and try to find a new normal . Much love from Tennessee",
        "Judge Dorow is an amazing woman , I pray Mr Brooks he's need to do some serious repenting prison is a playhouse if he doesn't",
        "To Madame Sue opera,   Hats off to You Mamm, I Envy You , and the entire team and Judge... You were the voice for All the Victims in this Horrific Crime ️️️",
        "It was a war of attrition and she outlasted Brooks",
        "Thank you for protecting the area I grew up Team Opper. You all are heroes.",
        "Love Sue Opper!",
        "The world loves Sue Opper!!!!!!!",
        "I am glad the victims including the Jury, judge, prosecutors, emergency response and the police were able to put the murdering bastard behind them with in a year. To the many so numerous it’s hard to list who have endured this brutality..you all are in a nations heart and prayers.",
        "Millions up here in Canada are with the people of Waukesha County as well.\n\nWell done to each and every one of you who prosecuted this case. And thank you.",
        "I so wish the media would discontinue any coverage on Brooks.  He received Constitutional privileges which appeared more like enabling due to his despicable behavior.  Now they need to put him away.  No appeal will be forthcoming and the victims should take preeminence in this Country.",
        "God bless sue opper",
        "He wasn't delivering a sentence recommendation; he was filibustering to stall the imposition of sentence.  He has repeatedly turned himself inside out to avoid anything that even remotely looked like responsibility.\nAlso, I'm glad he didn't apologize.  The victims, and indeed the greater Waukesha community, doesn't deserve to be subjected to an obscene parody of remorse.  He's only sorry he got caught so quickly.",
        "Prosecutor's did a great job",
        "Hope you have a great parade this year",
        "Taunting disrespecting and intimidating a judge that has the responsibility of sentencing you in case where you murdered 6 people in front of thousands of people is the definition of ignorance.",
        "We are all standing with you and with Waukesha! Waukesha STRONG ",
        "The defendant!!",
        "He knew what was coming.  Conviction on all counts, and maximum sentence imposed.",
        "i love the milwoaulkee accent",
        "You are ONE heck of a human being, lady that represents justice and humanity! God Bless you, your family and the entire community ️",
        "This man who certainly hates women being in charge of him, it was ironic, that it was a woman, DA, and a woman judge to sentence him to the rest of his life to prison",
        "I have so much respect for miss Opper and the judge Does anyone know if it's possible to write a letter to them? And if so ..how?",
        "Job well done!!!",
        "She is Smart, Intelligent, professional, great job !!!!!!!",
        "I completely agree with this man's sentence. He's pure evil. But the judge shouldn't have allowed them to clap and applause. Even the massively long 4 hour sentencing from the judge was possibly going to far. The guy deserves it all, but that stuff can be used to his advantage on appeal, to say the judge was prejudiced against him. Morally, what she did was right, but from a legal standpoint, I don't think it was a good idea.",
        "Love how she says 'our families'",
        "His entire 2 hour speech was a self-pity party.\nHe took his mask off solely to try and pull heart strings with his sad face.\nThe day before he had it on so he could laugh at his victims.\nThankyou Judge Dorow for not being swayed, and for making sure he has absolutely no basis for any type of valid appeal.",
        "I adore Sue Opper.",
        "Thank you Sue. Thank you for doing a wonderful job!",
        "Everyone on prosecution team did a commendable job.",
        "I would hate to face this PA if I was a criminal",
        "Brooks is a monster and his sentence isn’t even close to what he deserves.",
        "I think Brooks is aiming to go for an appeal on him being incompetent to be his own attorney \nFrom what he said yesterday \nNot that it will work",
        "OPPER OPPER, WHO CAN TOP HER? WHOOO! NO ONE!!!! \nSuperstar kicks\n\nAhem- I'll see myself out.",
        "Great job by the prosecution!",
        "Can’t wait to see this movie in a couple years ",
        "Fine woman Ms.Opper is , fine hard working American .",
        "He did exactly what we knew he would.",
        "Just give me 10 minutes with brooks, I only need about 10 seconds but I'll stretch it out for everyone.",
        "Quit balling... Do your job... Next case...",
        "Judge Dorow blew me away. I've never had a judge bring tears to my eyes reading out a sentence. She was absolutely brilliant. What a woman. Waukesha is lucky to have her.",
        "Tremendous drain on all with boots on the ground. Thank you to all participants. ",
        "When he told the Judge to consider time served, I was lik, WHAT!? R u serious?",
        "But Sue NEVER proved subject matter jurisdiction of the lawful law. Incompetence shouldn’t be rewarded with tv coverage.",
        "I do not know how the victims move on, but I hope they do and that despite this, they find some joy in life.",
        "Big mahalo to Sue Opper for leading the way to protect your community & send this murderer to life in prison.  Sending good vibes, prayers & lots of aloha to the people of Waukesha  God bless you all ",
        "Highest of respect for this prosecutor and her team! You truly honored the victims, the survivors, and your town. I’m proud as can be!",
        "Great job, Sue",
        "This woman truly is a queen!!!! She handled this case with absolute grace!!!!  ",
        "One of the best things about Attorney Opper’s excellent work on this case was how she allowed Judge Dorow the room to she needed, but also stuck up for the court at times saying what Judge Dorow could not say.",
        "Sue is a real life hero in my opinion. It had to have been an extremely heavy weight on her heart to do all she could to obtain justice for all the victims. She did it with such class, integrity, & warmth. That combined with her work ethic & determination were deeply inspiring.",
        "Thank you Sue Opper great Job for the Job you did .Thank you for helping put this dangerous Man behind bars .Thank you to you and Judge Jennifer Dorow for getting this Narristisistic Ass off the streets for the rest of his life ..",
        "She a great prosecutor joan of Arc",
        "Even if your slightly annoyed by how OP this team was, you gotta admit that having the whole game team against them at the end was way more entertaining then if it had been a normal tournament.",
        "Great job Attorney  Opper, all of you did a job well done.",
        "Thank you Sue Opper, you and your team were wonderful.  JUSTICE FOR WAUKESHA.",
        "She handled herself with such poise and grace throughout the trial",
        "Not only the whole nation of the USA there are people supporting the DA from all over the world",
        "DA Sue I am in Malta and was so impressed with the three of you and the judge well done he (brooks) is like covid please make him go away",
        "Sue Opper - you are an amazing attorney and I loved the fact that you held your composure in the face of Brook's insane disrespect for weeks, and then when you told him to \"Sit down and Be quiet\" during the final day of sentencing a huge smile came across my face! He deserved that from you, obviously. And I'm glad you said what you did to him in that moment.",
        "Judge Dorow not only gave the families justice, but she probably saved many more lives by getting that evil off the streets.",
        "Love her...shes a rock!!",
        "DA Sue Opper & her team, the Epitome of Professionalism, Humanity & Patience rolled up into ONE Voice for Justice in Waukesha!!\n  My presence on the DA Team would have reduced Brooks to a smoldering pool of smegma on the floor of the Courtroom. However, my sarcasm would have violated the rules of Decorum & rendered me in my own \"Time out\" room!!",
        "I can see where he gets is babble talk from he spent 2 hrs talking about nothing to hear himself… and his mother and grandmother did the same thing..they didn’t say anything about him at all..",
        "Finally, justice for Waukesha.  Great job Judge Dorow. You summed up how everyone else has been feeling. Thank you to the prosecution team. You guys have served y'all's community well. Great job.",
        "This DA is wonderful.",
        "Love and healing energy being sent from Canada  to the victims and community of Wackisha.  Standing ovation to  Judge Dorow and the District Attorney and her team. To DB's family, I pray you educate yourselves and come to the realization that DB's actions where NOT a result of mental health issues and please stop using that as an excuse as it belittles those with REAL mental health issues. DB just feels he's above the law and he's entitled to do whatever he wants to, and as his family you have seen this pattern of behaviour, so stop making excuses for him and take accountability for it.  As for DB himself, well you're just not worth my time and my hope is you're taught in jail that you need to earn respect, not demand it and are finally humbled.",
        "The judge allowed him to speak for two hours and not one word of an apology whatsoever. After all charges were read, so thorough, she got his ass out of her town that night. He looked so pitiful. Get the f out. His future is over. No money,no life. Judge your diligence alone commands respect for the judicial system, nation wide. Much respect.",
        "Thanks for everything you and your office did",
        "D-Bag Brooks is 140 pounds with long finger nails. The prison men will enjoy his sweet and sour smug package",
        "Hats off to Judge Dorow and Atty Opper",
        "I am definitely glad they were able to lock him up for life!\nOf course now there will be the appeals that I’m sure he will file. And I really hope that whatever judge he goes in front of will not overturn this verdict!",
        "Mrs Opper is one of the heroes in this story. Much respect and thanks.",
        "DA is very upset and rightly so.",
        "I Love this Woman! ",
        "This DA was the bomb when she said stack his time like he did the people in the parade I was like wow she’s tough!",
        "Judge Dorow and DA Sue Opper are rock stars",
        "all those charges yet no hate crime, weird.",
        "",
        "I hope Sue knows what a wonderful job she did for the community.  She is what every prosecutor should be.  She stood strong, she showed her love for the community",
        "kudos goes out to all of the people involved in this case.  From the police officers who caught him quickly, to the officers who interrogated him afterward, to the jailers who had to listen to his crap all day when not in court, and finally to the prosecuting attorney team and the judge  prayers for all the victims ",
        "Did anyone notice that when Dar-rell was giving his 2+ hour self-victimisation monologue that the male prosecutor was white knuckling his chair? He was gripping his chair so hard that his knuckles went white.",
        "I have so much respect for her and her whole team!",
        "If he was allowed to clap and roll his eyes after victim statements, it was fully appropriate for them to clap and cheer when he was sentenced!",
        "Well said OPPER. YOU DESERVE A VACATION!!!!!!",
        "She and the judge were truly queens!",
        "I'm So Proud Of You And Your Team",
        "Narcissist defined: no responsibility, no accountability, no compassion for others, and a victim mentality.",
        "Thank you DA Sue Opper for your amazing hard work.",
        "sue opper  did a great job",
        "I hate this monster too and glad he got what he got.  Sue said about the judge asking what sentence he should get.  THAT HE never answered her directly, I watched his whole two hour rambling.  He did answer asking first for clarification what the words were again, then said concurrent (or close to that).   For the record your honor!",
        "shes an american hero",
        "DA Sue Opper, I have no doubt, has inspired more young ladies to attend law school & become great attorneys just as she is",
        "Where was BLM! Where was Patrisse Calhun?!",
        "Every one of this court did a perfectly wonderful job ",
        "I think this prosecutor did an AMAZING job, along with her assistant DA'S. She and her team dealing with an IMPOSSIBLE defendant, Brooks had a HUGE VENDETTA against her, because she told the truth about his MISTAKE LIFE!! She had a job to do and he HATED that he couldn't hurt her with his words, and I'm sure he wanted to PHYSICALLY hurt her!! He hated that she wouldn't argue with him. When you ignore a narcissist they CAN'T HANDLE IT!! IGNORING NARCISSISTS IS THE ONLY THING THEY HATE!!",
        "DOROW/OPPER 2024",
        "FREE BROOKS",
        "Waukesha Christmas parade this year...if I could be there, I would. God Bless you ALL!",
        "DA Sue is a true pro. Bravo dear lady.",
        "DA Opper, you’re so gracious and unbelievably patient.  You did an amazing job and had the self control I can only wish for.  Thank you for your service",
        "We would not be in situations in which career criminals find their way back onto our streets to harm innocent citizens if we would stop allowing legislators to pass soft, limp-wristed laws. Waukesha’s tragedy is one in a long line of similar tragedies until citizens correct weak criminal legislation!!!",
        "THose two good women are one heck of a powerful force.",
        "Sue Opper, you’ve an amazing woman.",
        "Thank you for your hard work, and for holding this monster accountable.",
        "Darrell Brooks tried to make this entire trial about him and his precious feelings.  This court went more than the extra mile making sure that Brooks received the fair, impartial trial that he is due under the AMERICAN legal system, but also remembered that VICTIMS HAVE RIGHTS TOO that so many courts across the US forget or ignore while catering to individuals like Mr Brooks.  THIS must end.",
        "She a great job . Brooks thought he was going only get 10 - 15 years. When he realized his ship was sunk he wasn’t “a man of God” anymore. He’s going to be a big pain in the A$$ no matter where he is housed.",
        "God bless this wonderful woman",
        "“How do you think him representing himself affected the outcome of the case?”\n\nThat’s the big question that nobody asked her.",
        "THANK YOU SUE OPPER!!!!!!! Thank you for not only delivering justice, but for putting this clown in his place!",
        "I give Sue, her team and Judge Dorow the utmost respect for sitting in the court with Darrell Brooks and his antics!",
        "Whole nation! You have the whole world behind you! ",
        "Girl 17 1/2   \nYou and your team did great Ms. Sue. ️",
        "The entire prosecution team and the judge rocked.I am so sorry for victims and families.Its horrible.But I hope there is satisfaction in that the animal is in a cage.",
        "CONGRATULATIONS TO EVERYONE FROM CRAIG ALASKA ",
        "Really proud of all of you and how you've made it through this we support you all",
        "His behind should have been locked up a long time ago.",
        "DA Oppfer President",
        "I love her so much ",
        "Thank you Ms. Sue Opper. You did a fantastic job.",
        "Sue Opper is a credit to her profession.️",
        "Good job , I think she wanted to ring brooks neck.",
        "Darrell think because everyone knows hes the driver, he should be let out free because he will never get a fair trail. If only it was that easy Mr. Brooks.",
        "Great work Sue Opper",
        "Should've let him go",
        "We love you Sue....",
        "The fact that Brooks had to NERVE during his 2 hour long nonsensical statement, said that he respects the victims feelings and would never judge them for what they said or feel when the ENTIRE day before he spent the whole day rolling his eyes at them, fake clapping when they finished, making hand gestures and just being a total jerk while each and everyone of them spoke absolutely blows my mind. Definition of a narc! Hope he enjoys his new reality and dreams of subject matter jurisdiction for the rest of his life.",
        "Couldn’t care less about what happened to any individual that lives in Liberal Wisconsin.",
        "WE LOVE YOU, SUE!!!!!!",
        "I watched some of the trial... I think this lady did a great job. Very professional.",
        "When judge point blank asked him he suggested a prescription and his walking papers.",
        "Ms. Opper, you are a hero!",
        "This lady is amazing!",
        "His apology, \"I am sorry for what happened.\" That is not an apology. \"I am sorry for what I did.\" is an apology. \"I am sorry that my decisions caused death and injury and mayhem and suffering.\" That's an apology.",
        "Bring back the death penalty for cases like this.",
        "I don't think she's that bright.",
        "Kudos to the prosecution team. Job well done. My question, aside, is why does it take other cases so long to come to trial if this team did it in a year? That is totally not acceptable!",
        "I really admire this lady and her whole team did a great job, hope they get the holidays they deserve after one difficult year. I´m from México but i saw the news and keep watching the whole trial, so annoying, so disgusting that this guy is just pure evil, hope he rot in jail.  To the families, find comfort in the time and memories they shared with the people they lost, keep them in your hearts, don´t let this sick man win this battle, to the survivors keep pushing, don´t let this take your dreams away. Justice was served! Rest in Peace.",
        "Wonderful prosecuting team and wonderful\nJudge. My heart is very heavy for all of the \nVictims. May God Bless them all & help them to find some peace ",
        "Thanks to the persecution who didn’t half ass this investigation, and made sure to present a thorough and detailed report to the jury.",
        "Sue Opper (and her team of course) served her community well. She was fair, full of integrity, and patient as hell. She definitely earned the votes she received & more! Well done, attorney Opper! We see you!",
        "Sue opper is an amazing brilliant woman!   Thank you for all you e done",
        "They did an amazing job for the victims and their families and God bless you all. My heart is with you all.  Praying for the community ",
        "Brooks spoke for 2hrs, yet really never said anything.",
        "Madam DA, you and your team were awesome to watch during this trial.  So much respect and sympathy for the victims and their families.  Every DA should watch and learn from all of you!!  Congratulations on a job very well done!!!",
        "Miss Sue you have my utmost respect, please get some down time soon, this had to be taxing on your entire existence. Sending love to Waukesha",
        "Ms. Copper, You and your Prosecution Team did an outstanding Job. I was happy when you addressed that Monster on his disrespect for Ms. Dorow. It was needed. He just thought he was going to get out of his mess. I'm glad it's over for the victims families.",
        "Her team did an excellent job of processcution. Laid out his start to finish with airtight proof of his guilt thru video,witnesses and his own words.Outstanding job.They all need a vacation after this.",
        "I feel bad for all the staff in the prisons that have to deal with him!!  My god. Everyone from whoever is driving him to processing to doctors omg.",
        "Justice was served .....",
        "Bless her!! he is just a narcissistic piece of ..he won’t be so cocky now!",
        "The opper family has always stood for justice and honor . From when the time Johann Opper came here in the 1800s. Respect.",
        "She is Just awesome!!  Great job!!!"
    ],
    "comments_disabled": false
}