{
    "video_id": "3eC-tAxVdxM",
    "comments": [
        "I’m deadddddd the ending",
        "Michael said the intrusive thoughts won today lmaoooo ",
        "It was the instant snap of his neck when she she said period",
        "Samantha that was hilarious",
        "4:09 ….you welcome ",
        "Daniel and Sam telling on themselves hahaha",
        "4:11 and 5:50; the time stamps speak for themselves LMAO",
        "Sam definitely had a did I say that out loud? Moment",
        "Daniel  makes us all think nasty thoughts",
        "They are all insanely fine, good god",
        "Samantha let her inner thoughts take over",
        "this is easily the best one i’ve watched ",
        "LMAOOOOOOO",
        "When samantha said period same",
        "5:30 Omg",
        "They all look gorgeous   ",
        "I love their sense of humor this was hilarious to watch ",
        "I agree with Samantha\nPERIOD.",
        "Can we talk about Samantha’s hair?? ",
        "    Omg, what are those tweets",
        "This is just great  people are nasty ",
        "1:04 this is how you can tell they so comfortable with each other. \n5:48 Daniel said there you go like it’s casual \nI hate it wasn’t a longer video.",
        "Daniel was not lying when he said Samantha's about to become a meme... I found this video from a repost on Twitter ",
        "I feel like we are losing the plot on this show",
        "im so in love with daniel's accent",
        "They made it so fun",
        "SAMANTHA LOGAN",
        "He the star of All American but he British",
        "I’m weak “there you go”5:48",
        "Daniel and Samantha need to be together in real life. She knows how to make him not be so introverted. She knows the right buttons to push when it comes to him. I am not watching the show anymore until they put Liv and Spencer back together. I just can not look at the large forehead girl. I need to see the spice between Liv and Spencer.",
        "She said “ Period! Oh shit was that my outside voice?!?”",
        "Unpopular opinion but though usually I find British accents sexy, I prefer Daniel's American accent, it's deeper ",
        "are samantha and daniel dating?",
        "Yoooo this was so fun to watch ",
        "4:08 and 5:46 on repeat.",
        "I mean.......",
        "“You just became a meme” and that on period",
        "We need a part two",
        "Part 2? Please ?",
        "I'm glad when Samantha actually said period mistakenly  after hearing \"I wanna sit on Daniel ezra's face\" ",
        "I’m dying from laughter I got a headache because I was laughing so hard, when Sam said period I was dead!",
        "This combo is hilarious. I like how they reacted to these thirst tweets. One thing this Thirst Tweet Reaction show has shown is how aggressive women are compared to men. We're super thirsty when we're thirsty, it's slightly cringe actually.",
        "I can't unsee them as twins  and I didn't know Daniel has an accent ..",
        "two of my tweets read for sam yeah this is the best day of my life",
        "she’s so fine",
        "The way Michael's tongue   looked...Damn",
        "\" hard \" DEFFFO from London",
        "They need to do another one of these bc I need to write something ! ",
        "I thoroughly enjoyed all their shenanigans.",
        "Romans 10:9 because, if you confess with your mouth that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved.ddd",
        "I'm here for this️️️️ the 'period' though.... She likes him...",
        "Gtfoh Daniel is British?! Wow!!! Never knew that! This was hilarious ",
        "Bruh, this is the BEST thirst tweets read in awhile, I cannot ",
        "Let me summarize this video in one word only: PERIOD!",
        "The way Ezra turned quickly when Samantha said \"period\" \n\nI'm dead. ",
        "I’m high asf cackling at this whole video",
        "Omg his voice ",
        "These interviews shows how freaky women are for men and how submissive men will become over a woman ",
        "@5:29 Mike and Sam really do look like siblings lol \n\nBut Samantha @5:51 took me tf out ",
        "Okay but I agree with all the tweets ",
        "“What did I even mean by that”… girl, you know",
        "woah all american is still going ?",
        "I literally laughed when Michael did the fake eating! They all seem great. Those tweets for them were….deep.",
        "omg I’m still crying at Samantha’s face when Michael did “ahhhhh”",
        "This was epic! Love y'all!!",
        "this is so cute! ",
        "\"Period \" you go Sam ",
        "Lmfao they had me dying ",
        "5:10 hard not hot lol these subs\n5:50 maudtingg",
        "Daniel Ezra is so fine. I don’t blame them  for those comments",
        "Who here from the one TikTok",
        "4:07 AND 5:46 are my favorites. TOO FUNNY’ ",
        "micheal let his intrusive thoughts win ",
        "You can see the moment Daniel saw the whole choo choo he was FLABBERGASTED ",
        "Lmaoo",
        "He foreshadowed her being a meme",
        "Is it me or I feel Samantha and Daniel throwing shots at each  other? ",
        "Please invite RM if BTS to read thirst tweets. I am sure it would be hilarious. Armys are On a whole different level ",
        "The Way Daniel Looked At Her ",
        "“I could never be an actor bc if I he to kiss Samantha and not fall in love with her …” \n“It’s actually pretty easy” CRYING 1:05",
        "Bruh, those tweets were crazy lol I felt violated for them (especially Daniel's and Michael's)",
        "Samantha’s face at the end",
        "its the PERIOD that had me in stitches",
        "Wonder did Daniel say to Sam so you really want to sit on my face off camera",
        "Period!!! ",
        "we NEED ABSOLUTELY NEED austin butler to do thirst tweets ",
        "I don't watch this show but she clearly likes the ezra guy   For sure",
        "this was funny asf",
        "5:47 LMAOO o nah",
        "The amount of chaos in less than 10 minutes ",
        "5:50 he just like me",
        "Sam is such an introvert.. girl I get it me too",
        "When she said period and everyone’s reaction afterwards ",
        "4:04 ",
        "Oh wow this is hilarious I love this video of thirst tweets  I definitely enjoy watching All American TV show and I also enjoy watching All American Homecoming too. The cast of both shows are so talented.",
        "wait he said thts gonna follow you until the shows over?? there making another season???",
        "5:46 Nah ",
        "The whole cast is beautiful. This was HA-LARIOUS!",
        "period",
        "Nah Daniel neck almost broke when she said \"period\" My boy was hype as hell for a second lolll",
        "Can you please do this with NHL players?????",
        "Yall should do the all american homecoming cast next",
        " this was funny",
        "JONATHAN GROFF",
        "There’s only one God and that’s my father in heaven",
        "No but the way the whole cast of All American is just sooo finee",
        "Nooo but did u see how fast his tongue game isssss!!!!🫢",
        "2:18 Samantha being happy she isn’t a guy only to turn around and she gets a nasty tweet too is sending me",
        "omgggggg i didnt even know they were on here, so happy I found out",
        "5:50 LMAOOOO",
        "4:18 LITERALLY cuz I found that one clip from Twitter and came here to see the rest.",
        "4:09 HER REACTION WAS SO QUICK ",
        "Its the period. for me",
        "The intro Liv stand up",
        "the way she said period LMAOOO she meant that ",
        "Daniels head turned so fast when she said period ",
        "When I say I yelled at thisI mean I would let Daniel do whatever he wants with my body",
        "\"That's a Little bit of Heaven and Hell\" ",
        "LMAO I was laughing the whole time they are too funny ",
        "Wth Daniel got an accent 🫣 where have I been",
        "Let Trevante Rhodes and Thomas Q Jones have an episode I gotta get some things off my chest",
        "HR gon have a field day ",
        "What did Daniel do to them like honestly!!!! Because how???",
        "Mike after the ass ate comment I'm crying",
        "This whole video was so chaotic",
        "lmaoo 10/10",
        "This whole vid must’ve been uncomfy to film ",
        "But did you peep that hand on Sams lap from Daniel when she said period",
        " too funny!",
        "Lol ok Sam’s face when she read the last one was so funny to me",
        "Pov: you saw that TikTok video",
        "Love the cast of All American! Let's get that promo!  Their chemistry is amazing and they are gorgeous humans indeed. I was cracking up all the way through, had me in actual tears by the end.  ",
        "Do one for homecoming cause LANDOOOOOO",
        "I just love how quickly Daniel is reacting to these it’s wayy too funny ",
        "5:46",
        "Can we take a moment to appreciate how much time and effort he puts in the videos for us  >:O",
        "When she acted out the emojis lmaooooo",
        "Lol! They were showing out",
        "The core members plus taye diggs is the main characters",
        "His accent ",
        "I didn't know Daniel was British",
        "Samantha meant that period from the bottom of her heart",
        "2:58 5:50",
        "Bro those comment are down bad bro wtf ",
        "this episode has me in tearssss",
        "The way they startle each other with the commentary is the best part",
        "Choo Choo is crazy",
        "their chemistry is everything ",
        "Never knew spencer was British",
        "5:48 SO OUT OF POCKET",
        "Ooo these tweets are just ratchet and nasty but Hilarious at the same . But I’d take Mike and Dan in a heart beat!",
        "5:48",
        " just loved it.",
        "yup, Daniel was definitely right about Sam becoming a meme",
        "Priceless.. loved it there awesome and Daniel era is so hott.",
        "she meant ts",
        "WE WANT SVT",
        "not since seasonn 4 ",
        "This was funny",
        "Samantha is soooo cute \n\nWe need one with Geffri, Peyton and Martin next",
        "lol i love their chemistry with each other looks like good vibes all the time ",
        "We NEED one with the cast of “All American Homecoming”",
        "Hahahahaa I love this and Samantha! ",
        " I laughed so hard. They are so silly.",
        "I had no idea Daniel was British,omg. How can he be this hot ",
        "Funniest group",
        "These should be longer",
        "3:00  “should i leave?”",
        "Michael is fine tho",
        "5:50-5:53 omg Michael ",
        "Suddenly I have to watch all American",
        "Oh my god I love daniels voice",
        "I love their reactions ",
        "Samantha so fine Jesus and her voice so attractive ",
        "5:49 Jordan that is your sister !!!! ",
        "Y’all need to do Power Book II Ghost cast",
        "This was hilarious  ",
        "5:49  the There u go had me ",
        "Funny asf ",
        "let's make this a meme y'all 4:08",
        "its the 'period' for me ",
        "the chemistry!",
        "Since season 4 part had me soo weak",
        "Lmao this is hilarious!!! I didn’t realize Daniel had an accent where have I been?!!",
        "PERIOD ",
        "i understand the samantha tweets",
        "It was the way Sam said PERIOD with no hesitation and SHOULD I LEAVE it was the DESCRIPTION of the tweets the EMOJI’S the Imagery and their REACTIONS THAT TOOK ME OUT AND MADE ME COUGH WITH LAUGHTER IT WAS COMPLETELY OUT OF POCKET BUT I CANT GET ENOUGH",
        "Finally the cast and the show are getting more promotional opportunities",
        "Lmaoo the season 4 comment abt danial ",
        "She fw him haha and he fw her ",
        "Do  Spencer in Olivia get back together all American",
        "They need one for All American Homecoming because Sylvester Powell ",
        "this was so funny I was literally dying laughing the whole time LMAO I love them",
        "Bro 4:09 literally had me in stitches the way Daniel looked at her like  LMAO",
        "‘’It actually pretty easy’’ ",
        "2:03 is a mood Michael is so fucking FINEEEEEEEEEEE",
        "Lmao it’s the “period” for me ",
        "I forgot he had a accent",
        "It's the \"we are getting cancelled\" and the \"ya'll are gross.. thank you\" for me \nI laughed so hard I legit choked on my own saliva \nI love these 3 so much!!\nWhat a great job it would be to find and pick out these tweets",
        "I always thought Samantha was the finest ",
        "He's British?! ",
        "It’s crazy how they have accents then talk regular its the opposite of when we do it its mind blowing i love it",
        "This video is a prime example of what happens when you let your intrusive thoughts take over ",
        "Yay",
        "Lmfao    ",
        "Came here from Twitter had to watch the full video  she responded to quickly",
        "Daniel Ezra's British accent sounds so fake",
        "I did not know that the guy who plays Spencer James was English.  Makes him hotter.",
        "Daniel predicted the meme",
        "waltuh",
        "The way she said priod they might date in real life ",
        "This video is my new comfort YouTube video",
        "Samantha favors solange knowls",
        "They did Samantha wrong shorty come here lemme show you some nasty thoughts",
        "Period Samantha, God placed that on your heart to say for the million women who know Daniel can get it lol.",
        "Sam ",
        "Coming back to 5:52",
        "My goddaughter has me watching this show and I didn’t know they had fans like this… Also didn’t know Daniel was British. The more you know….",
        "Daniel so fineee",
        "LMAOAOA ME TOO SAM ME TOO",
        "I rewatch 5:50 five times and still cannot stop laughing",
        "Samantha Logan is cute though #period #All-American",
        "5:47 has me in stitches omfg ",
        "The fact she said PERIODT. Alright, gurl go get yourself some!",
        "the chemistryyyy",
        "in love with samantha",
        "It’s the period!! From Samantha for me ",
        "I LOVE THEMMM",
        "they’re so full of themselves",
        "It’s the eating for me  #allamerican",
        "This video made me want to watch the show because all 3 of them are hilarious",
        "The accent that Daniel has ",
        "Daniel Ezra is looks sooo goood dou, like damn sir",
        "sam is so fucking gorgeous",
        "Samanatha let her inside thoughts win on that period ",
        "I am rolling! ",
        "When she read the last tweet I was expecting one of the guys to say... PERIOD",
        "My favesssss️",
        "W vid",
        "The way Samantha said Period so all of a sudden and the said what",
        "5:51 - it's the action Michael made and the way Samantha audibly gasped for me ",
        "I felt that \"period\" ",
        "LMFAOOOOOO THIS IS TOO FUNNY",
        "He's British huh? Wtf?!?!",
        "Cory, the guy who made a lot of people smile with his way of playing games.",
        "That Daniel and Michael tweet was crazy ",
        "THEY WERE SO UNCOMFY HAHA YESSS",
        "pure chaos i love it",
        "Until Spence and Olivia get back. Im not watching. Someone tell me when it happens lol",
        "Lol Love them.",
        "She's so beutifull",
        "0:02 she’s so real",
        "These thirst tweets be WILD AF ",
        "‘I’m crying  these ppl are funny",
        "That last comment  she really deserves it ",
        "I randomly watched All American on Netflix now it’s become my favorite show",
        "The way Daniel had to prepare himself for the shows cancellation after Michaels comment is so funny ",
        "The way he \"Bro-zoned\" her after the period comment ",
        "Samantha!! IKDR ",
        "5:50 ",
        "HOW DID I NOT KNOW DANIEL WAS BRITISH? ",
        "The way he turned his head so fast ",
        "Love them these tweets be wildin I was crackling up.",
        "You just became a meme ",
        "4:06  watched it over and over again",
        "Jess is so close to 15M we need to get her there!!",
        "Much love to the Daniel, Sam, Micahel and the rest of the AA cast, been waiting to get interviews like this with them!!!! This was too hilarious!!!",
        "michael's \"aHhhAhhHAhH\" is MENTALLLL ",
        "These people so down bad",
        "Bruh Micheal at 5:51 almost made me choke. Out of pocket, that was so funny the sound and everything I love them all together, and him and Daniel at 3:05 was so cute!!",
        "4:09 Oh Samantha!! You know what that means!!!!!!! LOL!!!!",
        "i have just been waiting for daniel and samantha to get together for like 2 years now",
        "The fact I have watched this video like 4 times ",
        "@3:05, 4:08, and 5:51 ",
        "This is a video I never knew I needed, but very much needed ",
        "I NEED MORE OF THIS WITH THEM AGAIN AND MORE OF THE CAST",
        "Listening to Daniel’s real accent after watching all American is so weird",
        "I would definitely recommend my children the Flamingo channel if I had a choice  3:-)",
        "I-finally-came-back, this stream changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience :O",
        "That nut tweet was top tier ",
        "why isn’t season 5 on Netflix",
        "They are so adorable I love their friendship  5:50 sent me ",
        "Love this so much ",
        "quite literally the funniest people to be doing this",
        "5:49",
        "Can anyone explain the nut…s one to me I don’t understand",
        "5:50 The way I’m over here HOLLERING rn ",
        "Girl forget where she was",
        "had no idea he had an accent this whole time",
        "I’m still watching season 2 , I’m glad it was added to #Netflix!!",
        "this is pure entertainment ",
        "They had me dying\n\nRequest: Can y’all get Alba Baptista and Kristina Tonteri-Young from Netflix’s Warrior Nun to read thirst tweets please!!! It’s an amazing show and very popular right now.",
        "And the way Daniel looked at her when she said period!! LOL!! Yeah... mmmm hmmm ok!! We see y'all!",
        "1:08 “that’s a big ole L for me”",
        "The way Samantha did the emoji’s ",
        "Michael I saw that , ya nasty!!!! The ending took me out !!!!",
        "Alll facttss",
        "Why do these have to be so short!!!  can they do a part 2 but on one of their personal channels",
        "Funny thing is they all looking at the same comments! Samantha meant that PERIOD from her soul.... lol ... we all was thinking it, she just said it!   He fine as shit, she crushing lowkey",
        "daniel has an accent??!!!!??!",
        "All American interview ??? genuinely surprised ^^",
        "Period. ",
        "Daniel’s laugh makes me laugh",
        "Daniel been fine bruh ",
        "This is so hilarious  I didn’t know Daniel Ezra was Brit ( I’m so late I know lol) he looks even better off screen and the accent is a plus  \n\nI only watched a few episodes and the last one was when Coupe almost got arrested for murder then that lady confessed ",
        "I just love Daniel accent️️️. Damn the tweets for the guys lawd",
        " tweets were wild",
        "The tweet about sitting on his face is definitely me",
        "Hilarious #All-America",
        "They are defo feeling each other. The spark is there, intrusive thoughts say so.",
        "This was hilarious  loved it ",
        "(4:08)“you just became a meme” LMFAOAO HE WAS SO RIGHT THIS CLIP IS EVERYWHERE NOW",
        "THESE THREE SOLO IDC I’M SO HAPPY TO SEE THEM ",
        "PART TWO NEOOWWWW",
        "It’s the fact me and her said period at the same time ",
        "Samantha said PERIOD! this is hilarious",
        "5:50 I'm dead",
        "Whew this video is wild they were not holding back",
        "5:50 was so outta pocket I didn’t know how to react \n\nAnd their reactions too Sam was appalled and Daniel ",
        "PLEASE PLEASE LET TYLER HOECHLIN READ THIRST TWEETS PLZ OMFG",
        " - НАVЕ А GООD ТIМЕ - FIND YОUR LОVЕ! l",
        "LMAOOOO THIS WAS FUNNY!! \nI had to rewind back to everyone’s reaction when she said “period” ",
        "How awkward \nThese fans are …. I mean…. I have no words.\nJust waw ",
        "they way sam said \"period\" same girl same ",
        "No.2 Daniel's laugh at 3:03 was hilarious ",
        "Omg I’m dying ",
        "I’m so used to him talking English 🫶",
        "They’re all so sus about each other the “period” then the eating comment micheal made and then the nodding from Daniel for all of samathas comments",
        "Samantha is so adorable. That “period”though ",
        "But like none of those tweets were wrong tho lmfaooo ️ #AllAmerican lmfaoooo",
        "Sam is glowing.",
        "Definitely became a meme ",
        "I haven’t seen this show a day in my life but people always say I look like a darker version of the girl in the middle. And I’m pretty honored ngl ",
        "4:07",
        "BYEEEEEE",
        "",
        "She really meant that “Period” from the bottom of her heart",
        "i love them so much LMFAOOO, had be dying the entire time",
        "this is the best one yet LMAO",
        "Lmfaoooooo",
        "Samantha’s “period” comment was said for all of us women out there !! ",
        "This was funny. I love All American",
        "Yupp! She's a meme",
        "michael really said ️️",
        "i feel like this is the dirtiest & straightforward the tweets have ever been in these thirst tweet videos",
        "why hasn’t chris evans read some! THEYD BE BALLISTIC!!",
        "Why Daniel nodding like that??? ",
        "IM CRYING THEIR FACES AT THE END WHEN MICHAEL ️️",
        "Samantha and Michael's intrusive thoughts really came out in this video ",
        "I wrote all of these",
        "Wow lol wasn't expecting all of that! But I approve all tweets.",
        "The last tweet though ",
        "Samantha is wild ",
        "Where is Layla",
        "Yo Jordan Wildinn",
        "4:08 BYEE ",
        "Wonder if that was planned when Samantha said Period",
        "She said that \"period\" like she's speaking from direct experience lol",
        "\" I dont even know what I meant by that\" GIRLLL we know what you meant ! ITS OK, it slipped out. ",
        "Spencer James is british? Wtf?",
        "Wowwwwwwwwwwww",
        "This is great I love this ",
        "THIS WAS SOOOOOO RAW REAL AND FUCKINH HILARIOUS ️️️️️️ i loved it and daniel i love u ",
        "I love Samantha's expressions",
        "She was thinking about it. that way (PERIOD) came out so fast and easy lol",
        "Feel bad for the bystander that got arrested. Similar thing happened to me in Seal beach, didn't get arrested but the police forcefully took my totaled car in for investigation. It was also a chase that ended in a head onto me, shots were fired. I was sent a collection notice for $2000 for storage of that car, another $1000 for towing (to a lot 3 miles away from the crash), then a bit more just to tow it home so they stop charging more for storage. The police told me they cannot do anything about it.",
        "Ezra sounds briish ",
        "She meant that period ",
        "6:59 is just absolutely amazing, the meltdown, Puffers disbelief, the cackle, its just beautiful",
        "She said Period with no hesitation ",
        "LOL WE NEED ONE WITH THE HOMECOMING CAST",
        "Spencer James and Jordan baker y’all are the best duos in the show",
        "me too Samantha, me too ",
        "LMAOO",
        "It’s the fact that Daniel and Sam can’t deny that they messing with each other",
        "The best video everrrrrrr",
        "\"We appreciate your grossness\" ",
        "It’s too funny",
        "My dream has come true",
        "I just love Daniels laugh.",
        "This was hilarious",
        "Samantha is so gorgeous gosh ",
        "These comments on some 50 shades shiiiii",
        "Yooooooo that was funny as hell! I love it!  especially when she said period!",
        "Wow samantha is real pretty",
        "yesss I missed seeing them in interviews",
        "Cody Christian ",
        "6:00 That last one about Samantha Logan is what i woulda said lmao  no lies told there. I don't mind eating what she cooks.",
        "@DanielEzra\n@Samantha Logan \n@MichaelEvansBehling I respect you and the All American cast is there room for any more aspiring actors",
        "Omg I love her",
        "Lmfaooo this was hilarious ",
        "The way Daniel and Sam look at each other whole reading their tweets  ain’t surprised if they together in real life",
        "মাইয়াডা জোস দেখতে",
        "5:45-5:50 on repeat",
        "Bruh y'all finally got dem on here thx buzz feed ",
        "Samantha said period about sitting on his face  this was funny",
        "God loves you Jesus loves you and The Holy Spirit loves you️",
        "Daniel and Michael's bromance is so cute ",
        "This was great but I need one with JUST Daniel.",
        "She meant that “period”! ",
        "That period that’s gonna follow her for the rest of her life lol.  ",
        "This was the most wild one I've seen.",
        "The way Daniels head turned when Samantha said “ Period.” ",
        "Lmao. Please have them read more thirst tweets. This was classic ",
        "Love them  they are so funny",
        "“That’s! What! I! Want!” Daniel, baby..come see me ",
        "Sounds like Samantha wants 2 be a dominatrix yes that is hot go Samantha Logan ",
        "Love them lol!!!! They soooo attractive",
        "samantha and aubrey plaza give the same energy",
        "I screamed at “period” ",
        " ohh this was so entertaining to watch… we need more ",
        "Now it's time to bring the Homecoming cast on, especially Sylvester. I'm pretty sure all my tweets about JR would make the cut ",
        "i need ALL the outakes immediately",
        "I love them",
        "Okay Daniel Ezra is smoking hot",
        "#AllAmerican ",
        "People are down bad",
        "I'm screaming ",
        "I love them all sm",
        "They was to comfortable",
        "0:29 he liked his lips. He cannot be trusted. Trust me. I know what i'm talking about. That's one stereotype that anyone should pay attention to. They interact like human but you can clearly see that hardheaded shrewdness. The way they deliver conversations is what swayes everybody.",
        "Y’all are fine",
        "MedMen stock Moving up! Mike Tyson coming to Las Vegas MedMen in November.  Most Recognized name in the Marijuana Industry. Buy MMNFF stock!!!",
        "Daniel’s laugh is HILARIOUS! ",
        "When is season 5 dropping on Netflix",
        "\"#allamerican\" was too funny",
        "LOVEEED THISS lol soooo funny",
        "LMFAOOO",
        "I know we were focused on Sam’s comment but did y’all see Daniel’s expressions after Sam read that someone wanted her to disrespect them? ",
        "5:51 had me deaddd",
        "1:26 why you make that face sam ",
        "ok but Daniel is soo fine!!",
        "I never knew he had an accent whatttt",
        "samantha it's so beautiful",
        " Am you tuber \n मैं you tuber  हैू\n Meta tech chanel hai\n मेरा टेक चैनल हैंु",
        "OMGG",
        "I'm sorry but why haven't we had Kehlani yet",
        "Spenser does a great job at masking his accent on the show",
        "Time for me to catch up on the show. I'm glad there is promo video content apart from Leila's(Greta Onieogou) channel\n\nAlso, why is she not in here?? She would've got nasty tweets too",
        "And yes, I am here for their intrusive thoughts ",
        " she meant that ‘period’",
        "Daniel's accent is everything.  Samantha is gorgeous ",
        "The way Daniel reads is so fkn sexy",
        "My favsss",
        "I love this trio ",
        "I’m weak at Sam Mic is so fine thooo",
        "I’ve watched this way to many times  so hilarious",
        "Lmaoooo",
        "“Period” ",
        "I screamed",
        "P.S Don't watch this while eating. I choked while laughing.",
        "I BEG YOU TO DO THIRST TWEETS WITH PEDRO PASCAL",
        "Came here from tiktok, PERIOD ",
        "daniel plotting what to say after the kissing one",
        "Yoooo....",
        "Olivia said what we were all thinking ",
        "Yesssss we needed this",
        "I LOVE this and their chemistry. 5:50 I laughed SO hard. Samantha's face after Michael did that is hilarious.",
        "Did u realize they all they have the same phone same color same size ",
        "The way daniel amd michael looked at samantha after she said period",
        "i didn’t know how much i needed these three to do this video until now ",
        "They not beating the dating allegations. ",
        "Daniel aka Spencer James is swoll and in a good way…..Good Lawd",
        "Daniel is beyond fine.",
        "Samantha saying period after what Daniel said and then being confused is literally me",
        "This was funny!  Now there needs to be one with All American: Homecoming with Geffri, Peyton, Sylvester, I think they get the most thirsty comments especially Peyton and Sylvester ",
        "hahahha please get the all american homecoming cast to do this. specifically simone, damon and jr.",
        "They are all such good looking people ",
        "Samantha let those intrusive thoughts take over",
        "A lot went on",
        "I was today years old when I heard Daniel speak. My boy confused my ears smh I need to do better.",
        "Omgggg yesss.",
        "They definitely took it easy on Sam ",
        "pls this is so funny ",
        "Samantha is so gorgeous and the way she said \"period\" then realizing she said it is hilarious. ",
        "Daniel’s real voice shocks me every time",
        "Lml yesssss Spencer is bae lol",
        "Daniel Definitely About To Smash Samantha After This lol",
        "Daniel is literally like idris elba’s",
        "The way his American accent it more realistic than his actual voice. He sounds like he’s doing an unnatural accent with his regular speaking voice.",
        "She’s stunning ",
        "LMFAOOOOOOOOOO I was crying I love them",
        "I love Daniel’s laugh ",
        "I may or may not have sent a tweet or 2 about Sam️",
        "ENGLISH ACCENT?! The way I am SHOCKED RN",
        "DANIEL EZRA IS BRITISH IM EVEN MORE OBSESSED",
        "They were a whole vibe, love it",
        "This was so funny Ong ",
        "i’ve been waiting for this one!!",
        "They are all gorgeous!!!!",
        "the amount of times i've watched this lol",
        "it’s michael and daniel hitting each other during the entire video to emphasize the tweets ",
        "#AllAmerican",
        "THIS IS GREAT",
        "i cant XD",
        "Whao",
        "Nahhh these were insane I need a part two ASAP",
        "“That’s a little bit of heaven and hell” sounds so British  can’t still believe Ezra is not an American lol",
        "When she snapped back to, she say what?",
        "4:10 everyone lmao"
    ],
    "comments_disabled": false
}