{"video_id": "3eC-tAxVdxM", "comments": ["the way samantha said period without hesitation and then having pure confusion and regret after is so hilarious.", "The look on Samantha’s face when Michael said “ahhh” ", "The WAY SHE SAID PERIOD ", "She really meant that “Period” from the bottom of her heart", "Finally the cast and the show are getting more promotional opportunities", "Daniel and Sam will never beat the dating allegations", "They definitely chose the nasiest tweets for Daniel out of the three of them!!!  ", "The way Ezra turned quickly when Samantha said \"period\" \n\nI'm dead. ", "Samantha and Michael's intrusive thoughts really came out in this video ", "Daniel's accent is everything.  Samantha is gorgeous ", "Samantha is soooo cute \n\nWe need one with Geffri, Peyton and Martin next", "Bruh Micheal at 5:51 almost made me choke. Out of pocket, that was so funny the sound and everything I love them all together, and him and Daniel at 3:05 was so cute!!", "BIG THREE! Insane… I love them so much. SAMANTHA!!!! Now give us a part two. Also need the all american homecoming cast to do this immediately", "The way Sam flinched when michael started fake eating ", "The way Daniel quickly turned his head toward Samantha when she said \"period\" had me dying", "Lol im surprised they got them to do this especially Daniel lol", "The way Sam just said period and immediately regretted it ", "Samantha let her inner thoughts take over ", "It's the \"we are getting cancelled\" and the \"ya'll are gross.. thank you\" for me \nI laughed so hard I legit choked on my own saliva \nI love these 3 so much!!\nWhat a great job it would be to find and pick out these tweets", "That thing that Michael did at the end had me screaming so loud Sam was mortified And Daniel looking up and saying 'We are getting cancelled, the show is getting cancelled' Like yall actions about to make us lose our jobs. I am in tears seriously", "The way Daniel had to prepare himself for the shows cancellation after Michaels comment is so funny ", "Daniel wasn’t kidding when he said Samantha just became a meme ", "5:47 the way I face planted so hard so fast it wasn’t even the tweet but the reaction and imagery. ", "The way Daniel looks at Sam makes me think they need a private room", "Daniel’s laugh is HILARIOUS! ", "The genuine friendship these 3 have is awesome!!", "I LOVE this and their chemistry. 5:50 I laughed SO hard. Samantha's face after Michael did that is hilarious.", "Not only did she said PERIOD… she shook her head, like she was picturing it. ", "Samantha is so gorgeous and the way she said \"period\" then realizing she said it is hilarious. ", "I SCREAMEDDDD BEEN WAITING ON THIS\nWe need them to do it individually for thirty minutes each", "When Michael did the eating motion I spat out my water ", "They need to do one of these for All American: Homecoming because the way I see some fans go up for Peyton, Sylvester, Mitchell & Martin is UNMATCHED", "This was funny!  Now there needs to be one with All American: Homecoming with Geffri, Peyton, Sylvester, I think they get the most thirsty comments especially Peyton and Sylvester ", "4:09 she meant that “period”!!! She said it without thinking about it cause that’s how she really feels! Her face got so red afterwards she was so embarrassed!️️️️️", "they are so cute i love them and Michaels reaction to sam saying “period” hahaha", "The pure shock and fear in her face after Michael did that", "They not beating the dating allegations. ", "the \"period\" was way too instinctive lol...intrusive thoughts won during this whole video", "Love the cast of All American! Let's get that promo!  Their chemistry is amazing and they are gorgeous humans indeed. I was cracking up all the way through, had me in actual tears by the end.  ", "The way daniel amd michael looked at samantha after she said period", "Lmao. Please have them read more thirst tweets. This was classic ", "5:30 Her reaction got me crying ", "I know we were focused on Sam’s comment but did y’all see Daniel’s expressions after Sam read that someone wanted her to disrespect them? ", "this was so funny I was literally dying laughing the whole time LMAO I love them", "\"Period \" you go Sam ", "Please bring this back in like two months. Like they need a podcast bc this shit is hilarious", "I love this cast so much. gonna be so sad when this show ends :(", "They’re all so sus about each other the “period” then the eating comment micheal made and then the nodding from Daniel for all of samathas comments", "They definitely took it easy on Sam ", "The way he stares at her while she reads her tweets ", "1:04 this is how you can tell they so comfortable with each other. \n5:48 Daniel said there you go like it’s casual \nI hate it wasn’t a longer video.", "I literally laughed when Michael did the fake eating! They all seem great. Those tweets for them were….deep.", "omg I’m still crying at Samantha’s face when Michael did “ahhhhh”", "It needs a part 2....utter hilariousness", "You can see the moment Daniel saw the whole choo choo he was FLABBERGASTED ", "LMAOOOO THIS WAS FUNNY!! \nI had to rewind back to everyone’s reaction when she said “period” ", "their chemistry is everything ", "Yeah this might be just what I need to get into all American because they have good chemistry and are all funny asf! More cast thirst tweet readings. ", "Samantha said what she said about sitting on Daniel's face. And Daniel said what he said when she read the Tweet about getting her Behind Ate. I need to find Alchemy Daniel &  Samantha have Chemistry even when they're joking around  with each other.", "lol i love their chemistry with each other looks like good vibes all the time ", "This was hilarious them three together was amazing I need more of them Samatha reaction at 5:51 killed me this video was perfect ", "Can Samantha and Daniel just date in real life already?!!", "@5:29 Mike and Sam really do look like siblings lol \n\nBut Samantha @5:51 took me tf out ", "They are so adorable I love their friendship  5:50 sent me ", "make a separate video for daniel ezra please ,because the tweets for him are insane", "i didn’t know how much i needed these three to do this video until now ", "They’re actually hilarious ", "I never knew I needed All American cast on this series, they had me laughing for minutes straight ", "This video made me want to watch the show because all 3 of them are hilarious", "“I could never be an actor bc if I he to kiss Samantha and not fall in love with her …” \n“It’s actually pretty easy” CRYING 1:05", "5:50 was so outta pocket I didn’t know how to react \n\nAnd their reactions too Sam was appalled and Daniel ", "They were such good sports about it. The way I would’ve been like “cut..cut the cameras!” ", "The whole cast is beautiful. This was HA-LARIOUS!", "Samantha said period about sitting on his face  this was funny", "LMAO I was laughing the whole time they are too funny ", "Daniel and Samantha need to be together in real life. She knows how to make him not be so introverted. She knows the right buttons to push when it comes to him. I am not watching the show anymore until they put Liv and Spencer back together. I just can not look at the large forehead girl. I need to see the spice between Liv and Spencer.", "Samantha is so adorable. That “period”though ", "The way they startle each other with the commentary is the best part", "She said, \"Period\" with so much confidence!!!", "Seeing these two together is always great. I always feel that they have the most natural chemistry out of the crew. Sometimes they agree on the chaos, other times they don't, but there's an amazing back and forth to be found.", "We need a part 2 and one with the All American Homecoming cast. ", "I love the All American cast so much!!", "Samantha is indeed a woman I would drop everything for!\nI actually agree with all of the thirst tweets so far!", " I laughed so hard. They are so silly.", "My goddaughter has me watching this show and I didn’t know they had fans like this… Also didn’t know Daniel was British. The more you know….", "Much love to the Daniel, Sam, Micahel and the rest of the AA cast, been waiting to get interviews like this with them!!!! This was too hilarious!!!", "this is sooo hilairous the way michael repeatedly licks out his tongue in the end got mme in tears", "This is so hilarious  I didn’t know Daniel Ezra was Brit ( I’m so late I know lol) he looks even better off screen and the accent is a plus  \n\nI only watched a few episodes and the last one was when Coupe almost got arrested for murder then that lady confessed ", "It’s the fact that Daniel and Sam can’t deny that they messing with each other", "I’m dying from laughter I got a headache because I was laughing so hard, when Sam said period I was dead!", "Lol I love them reading these thirsty tweets lol hilarious.", "Samantha’s “period” comment was said for all of us women out there !! ", "I’ve watched this way to many times  so hilarious", "The Way Daniel Looked At Her ", "I think we can all agree that Samantha is FINE ASFF", " ohh this was so entertaining to watch… we need more ", "yup, Daniel was definitely right about Sam becoming a meme", "Man I really wanted to see their reaction to the thumbnails tweet . This video could have easily been 10 to 15 minutes with on going great content .", "I love Daniel’s laugh ", "I just love how quickly Daniel is reacting to these it’s wayy too funny "]}