{
    "video_id": "4YkzzhI2EoI",
    "comments": [
        "Trudeau's wife: You're not supposed tell others what we do in the bedroom.\n\nJustin: In Canada we believe in free and open and frank dialogue, and it is what we will continue to have. We will continue to work together constructively but there will be things we will disagree on.",
        "“Let’s create the conditions first” sounds like, “now we’re back to square one.”",
        "Xi said \"too naive\" when he left Justin",
        "it must be so awkward being in situations like this right in front of cameras and reporters.",
        "From Trudeau's childish response, Xi got the feeling of Trudeau. But our media says \"How Trudeau holds his ground\" lol.",
        "The walk of shame at the end by Justin is hilarious ",
        "i didn’t know Trudeau is fluent in Mandarin. He didn’t seem to bother finish listening to the translator",
        "Need to look at this in the broader context of Canada-China relations in recent years.  Canada has clearly been doing what the US told it to do against China, including detaining the Huawei CFO a couple of years ago.  That issue was finally resolved a year ago after a series of secret negotiations between the US and China.  China has realized that the only Western country it needs to have serious dialogue with is the US.  China doesn't waste time with Canada, UK or Aussie anymore.",
        "Xi was like: “I’d rather have a conversation with your father, Boy.”",
        "So ironic that justin believed in frank conversations whereas all he gave is politically well trained meaningless responses..",
        "Let me help translate what President Xi said to Trudeau,\n\n'Everything we discussed were leaked to the media, that's not appropriate, not the way sincere diplomacy should work'",
        "The Guardian didn't translate Xi's words on sincerity before Trudeau interrupted. Also I think it's very one-sided to put \"Xi interrupts\" when it was Trudeau who interrupted first.",
        "What happened was. Canada couldn’t even get a meeting with China officially, unlikely many countries that did. E.g. Australia, France, etc. Instead Trudeau bumped into Xi in the hallway, mumbled a few things. Xi obliged Trudeau to chat casually. Which should’ve been treated appropriately as a gentleman hallway conversation, not a governed discussion. But then Trudeau went to his own press and claimed he victoriously championed many serious issues and concerns to Xi’s face, he did it primarily for domestic political purposes. That’s what Xi meant when he said that’s not how the conversation was conducted. The “leak” wasn’t about national security secrets, it was about a deliberate misuse of a hallway conversation.",
        "Fair play to Xi Jinping, you don’t often see politicians be this straight forward and open with subjects like this.",
        "Most people trying to translate Xi’s words missed the most important part. Xi suggested Trudeau was lying to the media, what he had leaked wasn’t how the discussion actually went.",
        "Trudeau looked like a talk-show guest leaving early.",
        "A true canadian heritage moment.",
        "Xi Jinping's untranslated words: If there is sincerity, we will respect each other and talk to each other, otherwise the result will be hard to say",
        "“In canada we believe in free and open discussion” Ha I almost died laughing",
        "It's not about freedom and democracy, it's about credit.",
        "This is literally anyone when they bump into their not so close friend , start and end conversation awkwardly.",
        "\"Truly  naive\", Xi's last parting words",
        "The last phrase Xi said as he walked away (not translated) was \"very naive\"!!!!",
        "In fact, Xi's second sentence, \"而且我们也不是那样进行的,\" was translated (by Xi's translator) as \"That's not how the way the conversation WAS conducted \" (I don't know why the subtitle is different), which really means, \"What you told (to the media) is not the reality of the conversation we had that day.\"",
        "Freedom of speech is one thing. Being discreet about discussion over an agreement is another. As a PM you should know the difference. You should know what to say and what not to say to the public. Even in business agreement one knows that",
        "Just recently in Bulgaria, there was debate about open negotiations(between politic factions) and people speculating about politicians dealing under the table etc. What Xi states as concern reminds me of the unpopular opinion of my fav bulgarian politician, who stated that not everything must be discussed under wide public eye and there are thigns that should be kept private. Especially when we speak about different countries negotiating, trust is of superb importance",
        "Love the way how Trudeau walks away",
        "Trudeau: A trip without humiliation is a trip wasted.",
        "Xi basically said if u don't have the sincerity for top level discussion and keep leaking things to the media there won't be future dialogs.",
        "Love how Trudeau tried to turn this into a \"we value freedom of speech argument\". No bro, you value the freedom to lie, that's all.",
        "Xi Jinping looked as if he was smiling and as though they were having a normal conversation if it weren't for the interpreter translating everything.",
        "For those of you who dont know or didnt notice, the last word xi said is 大天真了 meaning 'too naive'.",
        "Truedo: But sir, in Canada we all speak freely and openly. \nXi: Have you never heard of the term \"privacy\"?",
        "Look at Trudeau’s face expression after he left the conversation. It’s like a school boy’s embarrassment after leaving the principal’s office ",
        "Honestly, Justin low-key looked intimidated by the old man.\nYou can see he tried to look firm and tough when he adjusted his stance, that's because he was intimidated.\nThat's what you get for electing a little kid to run the country.",
        "Actually i didn't find comments pointing out that from 0:15 to 0:25, Xi said \"如果有诚心，咱们就用互相尊重的态度来进行和好，否则这个结果就不好说了“, the whole sentence means \"if there is sincerity on your part, we can do the reconciliation with the attititude of mutual respect, otherwise the outcome could be unpredictable/cannot be said\". And the translator only got the chance to say \"if there is sincerity on your part....\" before interrupted by Trudeau. We have just witnessed how misunderstanding develops in international diplomacy. And that's why Xi said Trudeau was naive because he missed the most important part of the line.",
        "Xis body language said \"no more\" conversations",
        "President Xi said \"we can have a meaningful and constructive conversation based on sincerity, without sincerity, no concrete result can be anticipated\". While The interpreter started to interpret, Trudeau interrupted and began his recorded drill...",
        "“In Canada, we believe in free and open dialogue.” Yeah… no you don’t. ",
        "Xi radiates \"I am not angry, I am just disappointed.\" energy."
    ],
    "comments_disabled": false
}