{"video_id": "4YkzzhI2EoI", "comments": ["Most people trying to translate Xi’s words missed the most important part. Xi suggested Trudeau was lying to the media, what he had leaked wasn’t how the discussion actually went.", "it must be so awkward being in situations like this right in front of cameras and reporters.", "Trudeau's wife: You're not supposed tell others what we do in the bedroom.\n\nJustin: In Canada we believe in free and open and frank dialogue, and it is what we will continue to have. We will continue to work together constructively but there will be things we will disagree on.", "What happened was. Canada couldn’t even get a meeting with China officially, unlikely many countries that did. E.g. Australia, France, etc. Instead Trudeau bumped into Xi in the hallway, mumbled a few things. Xi obliged Trudeau to chat casually. Which should’ve been treated appropriately as a gentleman hallway conversation, not a governed discussion. But then Trudeau went to his own press and claimed he victoriously championed many serious issues and concerns to Xi’s face, he did it primarily for domestic political purposes. That’s what Xi meant when he said that’s not how the conversation was conducted. The “leak” wasn’t about national security secrets, it was about a deliberate misuse of a hallway conversation.", "I bet he replayed this moment in his mind with all the things 'he should have said' that evening. Lol.", "Xi said \"too naive\" when he left Justin", "Trudeau should have acknowledged the leak while at the same time ensuring integrity of conversations in the future for the best interest of both countries. Mostly he wasn't prepared, or rather shocked to hear such direct confrontation fron Xi.", "Let me help translate what President Xi said to Trudeau,\n\n'Everything we discussed were leaked to the media, that's not appropriate, not the way sincere diplomacy should work'", "“Let’s create the conditions first” sounds like, “now we’re back to square one.”", "imagine if they subtitled the second sentence correctly, there would be actual debate on if he was lying. now it looks like everyone is trying to cover up for him.", "It's not about freedom and democracy, it's about credit.", "justin trudeau was never seen again after this conversation ", "Xi basically said if u don't have the sincerity for top level discussion and keep leaking things to the media there won't be future dialogs.", "Need to look at this in the broader context of Canada-China relations in recent years.  Canada has clearly been doing what the US told it to do against China, including detaining the Huawei CFO a couple of years ago.  That issue was finally resolved a year ago after a series of secret negotiations between the US and China.  China has realized that the only Western country it needs to have serious dialogue with is the US.  China doesn't waste time with Canada, UK or Aussie anymore.", "“In canada we believe in free and open discussion” Ha I almost died laughing", "The last phrase Xi said as he walked away (not translated) was \"very naive\"!!!!", "In fact, Xi's second sentence, \"而且我们也不是那样进行的,\" was translated (by Xi's translator) as \"That's not how the way the conversation WAS conducted \" (I don't know why the subtitle is different), which really means, \"What you told (to the media) is not the reality of the conversation we had that day.\"", "i didn’t know Trudeau is fluent in Mandarin. He didn’t seem to bother finish listening to the translator", "As Xi was walking away, in response to Trudeau's meaningless remark which Trudeau made without letting the translator finish first, Xi said to his team: \"Truly naive\".", "Xi radiates \"I am not angry, I am just disappointed.\" energy.", "Leak confidential discussion between state of heads = Free and open and frank dialogue ", "Justin: A day without humiliation is a day wasted", "Truedo: But sir, in Canada we all speak freely and openly. \nXi: Have you never heard of the term \"privacy\"?", "Love the way how Trudeau walks away", "Trudeau did not even have the curtesy to wait for Xi's interpreter to finish before he started on his usual meaningless platitudes.  Those platitudes and his entitled attitude might be accepted by Canadians but they do not play on the world stage.", "I learned today that Canada put all conversations in diplomacy public as a way to show transparency", "the translator made a small mistake:\n\ntranslation of the second sentence, instead of 'not how the diplomacy work', what Xi Jinping actually said was 'that (information leaked to papers) was not how the conversation actually conducted', which basically means 'you are lying'", "That's a slap on Justin Trudeau’s face .", "feels like when you do something wrong and a dad is just about to drop on", "Actually i didn't find comments pointing out that from 0:15 to 0:25, Xi said \"如果有诚心，咱们就用互相尊重的态度来进行和好，否则这个结果就不好说了“, the whole sentence means \"if there is sincerity on your part, we can do the reconciliation with the attititude of mutual respect, otherwise the outcome could be unpredictable/cannot be said\". And the translator only got the chance to say \"if there is sincerity on your part....\" before interrupted by Trudeau. We have just witnessed how misunderstanding develops in international diplomacy. And that's why Xi said Trudeau was naive because he missed the most important part of the line.", "The Guardian didn't translate Xi's words on sincerity before Trudeau interrupted. Also I think it's very one-sided to put \"Xi interrupts\" when it was Trudeau who interrupted first.", "So fascinating to watch world leaders interact", "Now I am not a fan of China and their ideologies at this time but Xi had my respect in this conversation, he came to talk about the problem and Justin immediately went into defense mode.", "For those of you who dont know or didnt notice, the last word xi said is 大天真了 meaning 'too naive'.", "“In Canada we believe in free and open dialogue (unless we disagree with it)”", "I replayed 20 times and more, I do not know why I love this video so much!", "Justin is that one friend\n\"Trust me bro, I won't tell anyone\"", "Frank and open dialogue doesn't mean you can leak a secret which you promised to keep.", "This is literally anyone when they bump into their not so close friend , start and end conversation awkwardly.", "cant believe guardian edito doesnt understand the english here. The translator said\" thats not the conversation was conducted.” But the subtitle is \"thats not how the way diplomacy works.\"", "Fair play to Xi Jinping, you don’t often see politicians be this straight forward and open with subjects like this.", "When Xi walked away, he literally said 3 Chinese words which mean \"very naive\"", "It's a shame that apparently Xi understood everything Trudeau said but Trudeau didn't even let the interpreter finish first. Let's assume he speaks Chinese. No wonder Xi said \"Truly naive\".", "A true canadian heritage moment.", "Justin looks at Xi's eyes, but he's speaking to the camera, Xi looks anywhere but to Justin's eyes, yet he's speaking directly to him.", "Xi said, \"very naive\" in the end", "Just recently in Bulgaria, there was debate about open negotiations(between politic factions) and people speculating about politicians dealing under the table etc. What Xi states as concern reminds me of the unpopular opinion of my fav bulgarian politician, who stated that not everything must be discussed under wide public eye and there are thigns that should be kept private. Especially when we speak about different countries negotiating, trust is of superb importance", "in the last of the video,he said \"挺天真\" which means \"really naive\" lol", "I love how Trudeau quickly sauntered off to go cry in the men's room.", "Xi's response to Trudeau's \"In Canada we believe in\" speech is all of us when we call customer service hotline to complain about bad service but all we hear back is some generic scripted response that never addresses the issue", "Look at Trudeau’s face expression after he left the conversation. It’s like a school boy’s embarrassment after leaving the principal’s office ", "Can Trudeau ever say anything of substance rather than read and use cliche from a university textbook???", "The look on Xi's face as he walks away \n\"We'll see................. This guy, JFC..\"", "As a non- Chinese citizen,i can confirm whatever he said was translated correctly.", "Trudeau: A trip without humiliation is a trip wasted.", "Both the leaders are smartly quarrelling with a smiley face ", "There is a thing called a conversation within 4 walls. Confidentiality is to be remained by both parties of the conversation unless a mutual agreement have been reached to go public. You want transparency then go talk in front of the cameras, they surely have abundant of those at G20. But if you want to go private, then keep it private! Simple as that.", "Honestly, Justin low-key looked intimidated by the old man.\nYou can see he tried to look firm and tough when he adjusted his stance, that's because he was intimidated.\nThat's what you get for electing a little kid to run the country.", "This is how my dad treated me when I was 9 years old - \"if you keep lying, you don't get chocolates. First stop lying\".", "Did I hear Trudeau say in Canada we have free and open dialogue, are you kidding me.", "As a Canadian,  I have to say Trudeau is a joke.", "You can clearly see the difference in Experience and professionalism between these two leaders. One’s asking for high level talks that doesn’t concern the news or media outlets while keeping a strong connection between leaders. Justin is not even ready on how to respond to that ", "The 2nd sentence in Xi's 1st statement “... and that's not the way our conversation was conducted\".  Xi hinted Trudeau was lying to media.", "I remember Trudeau‘s last awkawd show was laughing at Trump in front of a camera，now lose face again ", "Conversations that are had behind closed doors and in confidence should never be repeated to anyone else. What an embarrassment ️", "Xis body language said \"no more\" conversations", "Justin: ´I promise this conversation is not going to be leaked´. Xi: ´well, it is leaked now. If you don´t have the sincerity for top level discussion and keep leaking things to the media there won´t be future dialogues´.", "He told him that information leaked and that it was in appropriate and Trudaeu said \"Well hopefully we can still do business\". You can't make this up!", "I like how Trudeau maintain one contact and how XI just avoid it.", "Last translated sentence by XJP : only CNA got it right, it’s “ let’s create conditions first,” not “ that’s great! Conditions first” ", "Let me write down the words I heard and I’m Chinese. 你把我们的谈话泄露给了报纸，这不合适啊！而且我们也不是那样进行的，如果有诚心那咱们就合作愉快，否则这个结果就不好说了。 创造条件，创造条件…… the translation missed this part: if you want to cooperate with me genuinely then we’ll have a happy ending otherwise it would hard to say . .Then Xi smiles at the camera adding: so naive and T walks away without hearing what Xi has added.", "Xi's 2nd statement was missed from the subtitles of the video: When Trudeau cut off the translator, what Xi said was,  \"if there's sincerity, we can talk in a professional format, that's great. Otherwise the outcome is hard to say\". Meaning unless you guys act professionally and treat the Can/Sino relation with respect it deserves, there's no point to talk.", "I like Xi's saying \"create the condition first\", Totally a slam on Justin's face, like saying \"To have a frank conversation and disagree something with me, you need to see if you can manage to talk with me first\" hahaha, totally make sense.", "This looked like a Boss or Coach scolding a player/employee on the sideline.   Which makes sense doesn't it????", "either Xi or his companion said 'still too naive', which the subtitle intentionally or unintentionally ignored", "Notice how the media purposesly doesn't subtitle Xi's last part and says Xi interupts despite Justin interrupting first.", "“Stop Jin Ping to conclusions”\n\n“But you leaked documents, is that Trudeau?”", "Xi was like: “I’d rather have a conversation with your father, Boy.”", "The translator misunderstood Xi, \"That is not how the way diplomacy can work\" should be \"That is not what we discussed\", meaning the content released to the media is different from what they discussed.", "0:44 this is the most hurtful part to watch, Xi leaves with a forced smile and Trudeau looks like he doesn't know where to go to cry...poor fellow", "E a reação dos canadenses diante desse tipo de postura?", "So, all conversations with Canada politicians could be exposed to the press?", "First it was Trump, then MBS, then Modi, and now Xi. Trudeau really knows how to make a fool of himself.", "In Canada, we believe in free and open gossiping of top-level diplomatic negotiations.", "Anyone noticed in the clip the very last words Xi said were: “Very Naive”?", "One thing to mention, what the translator said is \"That is not how the way the conversation was conducted\", however the subtitle is \"That is not how the way diplomacy can work\".", "It's like watching a school teacher talking to a disruptive pupil", "I didn't knew Xi Jinping could talk this intense", "Freedom of speech is one thing. Being discreet about discussion over an agreement is another. As a PM you should know the difference. You should know what to say and what not to say to the public. Even in business agreement one knows that", "The same vibe as when your Chinese dad  is angry at you for cheating in a test", "I was lowkey expecting him to speak in english revealing he could understand what hes saying all this time.", "Xi Jinping looked as if he was smiling and as though they were having a normal conversation if it weren't for the interpreter translating everything.", "Not just for political discussions, even corporate discussions are not supposed to be leaked unless both parties agreed.", "Trudeau: Why did you come and treat with me?\nXi: I want to see you in person and get the measure of you\nTrudeau: Well now you have.\nXi: Aye, now I have… I’m disappointed", "\"Truly  naive\", Xi's last parting words", "Actually the lost part of Xis words, \"if you don't do so, nobody knows what kind of result you bring\", he is threatening. The young prime Minister missed the part since he cut in.", "Seems like Before this convention, Tudou just leaked some “pruned” or “spinned” information about their previous meeting. That’s why he is accused with unprofessional behavior. Really this isn’t about free and open, this is about ethics and business conducts.", "What I understood was CEO Xi says you leaked inaccurately what we discussed.  Sales manager Trudeau then pontificates about transparency etc. and added though we have differences we will continue to engage with you.  Xi cuts him off by saying, let's see, let's set the conditions first.  Xi then mutters, 'naive' ie what a small boy. Trudeau then walks off realising he has just lost that contract big time by prioritising playing to his constituent instead of sincerely building trust with the second largest corporation in the world.", "'too naive' was XI's last word. listen carefully at the end ! ", "That must be the most embarrassing moment in trudeau career."]}