{
    "video_id": "5e28tV4XG7Y",
    "comments": [
        "i think the killer is the man with the hat behind the girls staring at them",
        "Why the hell are they being so secretive about what happened? Do they not know what they're doing or are they trying to be careful not to disclose information that the killer could use to evade them?",
        "Still know nothing",
        "Something like that hasn’t happened there in 8 years maybe the cops are rusty. Maybe bring some outside assistance?",
        "Simple someone in the house did it. Now find out which one.",
        "I don't think the cops have a clue who the killer(s) is/are ! That's my 2 cents.",
        "Nice OVERKILL",
        ",, ,,wait,,what,, 2 other roommates were In the house but didn't hear or see 4 people being murdered ,,,,wtf and didn't call the police til noon,, Suspect is at large but tell the public not to be afraid ,,WHAT IS GOING ON IN THAT PLACE ARE THEY CRAZY",
        "Are the police trying to track down every single person seen in the video? Maybe they should be checking neighborhood security cameras hoping to find someone lurking in the bushes... Better yet, maybe they should bring in detectives from the Boise Police Department.",
        "@ 2:38 one of the girls clearly waves to then walks over and hugs a guy in a jersey before returning with her friend and the dude clearly talks to his shady-looking friend with the hoodie while looking their direction has anyone looked into who they are? Bottom left camera. What do they know? Not accusing just curious who are they and has anyone else pointed this out yet?",
        "From 1:50 on, there at least 6 people clocking them from behind. Watch the one kid turn his face as she turns as the guy in the Number 9 jersey calls her over. Looks like a robbery gone bad.",
        "They’re lying to you they have a suspect I live up here and in the community they have a sense of suspect name they even said it was an ax, so yeah, somebody’s lying somewhere",
        "What can they do to you to kill them bro?",
        "Was it a grizzly scene?",
        "It’s the guy you interviewed .",
        "So four people are getting murdered and two other people don't hear it how can you not hear the screams of someone being stabbed to death unless all six people that were in the house we're all impaired or these maybe just maybe the two know more than what they're letting on",
        "On a side note... time for a this city to vote to change its name?!",
        "Who called 911?",
        "Disclaimer: This could be nothing at all but something that kinda caught my eye. In the video where the girls are at the food truck, at the part of the video when they draw on the red circle there is a guy with a white hoodie in the upper-middle part of the screen. He seems to stand by himself and looks like he's watching them. When the first girl moves away he's still standing there but when the second girl moves, he moves. Like I said, could be nothing but honestly everyone at that food truck is a potential suspect (as well as anyone who had access to their home) and he looked extra sus to me. That's what happens when you spend too much time watching the ID Channel.",
        "Sad my son went to grad school there, it's a beautiful city",
        "They need to check the city of salt lake in morman land",
        "Didn't knew of them have dog? Wouldn't the dog bark?",
        "So really no new news",
        "Horrendous and tragic. May God guide the investigators and I pray for the families and friends of these victims.",
        "I understand the impulse police must feel to reassure the public, but they must resist this impulse when the evidence doesn't support statements of reassurance.",
        "This makes no sense! Where were the other roommates during the murders?! What did they see? Hear?",
        "Something is off in this video. The girl in black at the food stall seemed more invested in what was going on with the group of three people. After the hug,  she flicks her fingers.  Walked passed the group with what appears to be a little nudge in the back of the girl in the white coat then  a brush against the bigger guy. When she passes back she walks directly through the group. The guy with the hat turned backwards shrugs. Don't know if they know each other.",
        "Everyone's asking how possibly those girls could have slept through this.  Well one .. was the four people awake when they were killed....    Two... If they were awake.  Have you lived ever lived in a girl's college house... Good lord there are nights you have no choice to learn to fall asleep to very loud and high pitched voices that would possibly be similar to what happened that night. It very quickly turns into a neighborhood of kids that yell \"help\" when playing. You tune it out in your sleep.",
        "The big guy gray sweatshirt",
        "He called them \"blonds\" 2:47 ",
        "Jealous ex-boyfriend?\nEx girlfriend?\nROOMATES\nROOMATES",
        "Don't think it's not right how they going to say there's something to worry about. Something isn't adding up. I'm smelling a couple up. And they calling out a crime of passion? How would they know what this is",
        "When they find the perpetrator(s), it would be nice if all they need is a body bag.",
        "How were 2 roommates at the house but they heard nothing? If a person is being stabbed, you would think one would scream out! None of this adds up. My heartfelt condolences to the 4 families affected by this horrible Tragedy.",
        "The boy has a +6 bonus to Stealth.",
        "They should've specified who opened the front door, the killer or roomates? If it were the roomates then it's suss they reported an unconscious person and not the bloodbath in front of them. If it was the killer, at least thats part of the puzzle. Also who called, was it the roomates or someone else. I feel like the killer is right under their noses.",
        "If this was one person doing the stabbing then they are highly skilled with a knife. Unless the victims were so  intoxicated they couldn't defend themselves.",
        "OK , Nancy Drew! I’m so glad you know what is going on. LOL",
        "Watch the kid in the food truck vid at half speed and watch how weird the dude is acting",
        "How deranged of the individual to murder them. Such evil rage that it takes to stab someone let alone 4 people!?!",
        "At timestamp 1:50 in the upper left screen their is a guy in the upper middle/right of the frame. Black jacket over white hoodie, hat, black pants, white shoes. Standing about 6-8 ft behind the girls, looking in their direction. Looked to me like he was by himself, didint seem to interact with anyone around in this short video. Did he order food? Im sure the investigators have identified people in the video, i hope. That guy seemed odd to me.",
        "Whats with the creepy guy watching them from behind while they are ordering food.t 3:06 he makes a move towards them when the leave the front of the truck. That has to be the gut!",
        "This is going to be the new Gabby Potato money maker for MSM\nFact!",
        "I’m telling you they need to look into the simps these girls strung along. I always thought my ex would end up like this. She had tons of guys she would keep around to use for things. She would let them all know she was banging me and had other guys around besides them to pit them against each other so they would do more stuff for her. She would make plans and then ghost them. They would show up and bang on her door for 45 min straight. Then they would see my car and say you’re with Cadillac guy aren’t you. Even though they were mad they would stick around and then they would buy her something to try and win her. This is how I always thought she would end up after messing with the wrong dudes emotions.",
        "therd person is close by and knows them all . and this was planned in  a short amount of time",
        "Why show food truck workers on the thumbnail as if they are suspects?",
        "If they have no suspect why did they say it was a crime of passion? WTF?",
        "I bet the two that were home were passed out drunk upstairs or something??",
        "How could no one hear the screams?",
        "This story isn't making sense,  how did the 2 other housemates hear nothing!!!!!! praying they catch the evil person (s) who committed such a horrific crime!!!!!!!",
        "So basically no new information except they ate food?",
        "Does IDAHO have the death penalty? If so use it. If not  shame on them.",
        ",,ITS THE GUY IN THE BACK GROUND TOP RIGHT SCREEN..HE ADJUSTS HIS HAT AND HOODIE SO YOU CANT SEE HIS FACE..HE IS WATCHING MADDIE CLOSE..THEN WHEN SHE /THEY WALK OFF TO THE LEFT HE FOLLOWING THEM...WTH..",
        "Hilarious",
        "So bizarre",
        "OMG LOOK at 1:50 in the top left screen for the guy directly  behind yellow sweater/grey hat. He follows them there, adjusts his hat, watches them, and leaves when they do. GUILTY ",
        "WHY WOULD THEY STAND THERE AND WAIT TO BE STABBED  ??",
        "They'll blame Alex Jones",
        "90% odds that this was done by a man one of the girls knew",
        "How are the two other tenants not witnesses? They were there in proximity during the event. They are 100% witnesses, even if they didn't \"see\" anything. Were they in a coma?",
        "the food truck guy did it",
        "A knife from the taco truck was used",
        "It`s most likely a crime of passion, stabbing is a very personal crime, most likely a love affair gone wrong!!!",
        "We are are living in the age of insanity. Let it be said and let it be written. My god.",
        "Can't believe roommate not heard cry for help check out maintenance worker and ex boyfriend",
        "Watching the video in the lower left corner, there are two males sitting on the short wall very close together who appeared to be watching the two girls closely, maybe they should enhance the video and see if they could be questioned??",
        "It ALWAYS creeps & freaks me out watching VICTIMS on camera before they become victims. They have NO IDEA that within minutes & or hours THE UNTHINKABLE is going to happen. It's eery knowing I'M WATCHING A PERSON THAT'S EITHER NO LONGER ALIVE , MISSING , IN THE HOSPITAL INJURED OR still ALIVE but what the story they have TO TELL IS HORRIFIC. This makes me think WHAT WILL MY \"LAST KNOWN FOOTAGE ALIVE\" catch me doing ",
        "It’s trumps fault!",
        "Somebody one of them was friends with through work or school… if it wasn’t someone they let come home with them or followed them home from food truck..smh️",
        "Knife control legislation should solve crimes like this.",
        "If it was Moscow Russia I would suspect Pootin…",
        "Amanda more like a man duh",
        "What I don’t understand was..unless they were drunk or drugged or sleeping, how does only ONE person stab four people.  I mean, if you saw your friend being stabbed, you might run to try to help them, and another might run for the phone, you know? But people don’t just STAND there and let themselves be stabbed in turn.  I think it was more than one person unless they were incapacitated already somehow",
        "Sounds like a another student killed 4 friends.Strange",
        "The media working hard to keep this covered up.",
        "No idea who did it, but don’t worry, nobody else is in danger. Huh?",
        "ted buddy managed to too his without waking anyone and he used a log. its in the realm of possibility the roommates didn't hear/see anything.",
        "Can someone explain why the state police would be taking over the case? Is it a matter of resources?",
        "Are the two suspects? We’re they threatened by the attacker or attackers not to talk? Hmmm",
        "Is this a life insurance thing? Suspicious.",
        "Maybe the police were involved in the murders?  Three of them were attractive young women, they killed the guy, then the department gang raped the women.  And of course, they then needed to kill them being their own witnesses and make it as if some psycho killer did the job.  As for the two others, they had been drugged up in another part of the house, so no need to involve.  Or what may be even sicker, they participated in the orgy.  What else to do in a small town?   Something is creepy about these police who so confidentaly told all there was no danger (yeah, unless you are an attractive female who may be next target)!  I would not trust these cops, they seem to be covering up something, and don't want the public involved.  People of Moscow, get out while you can!",
        "WE NEED MORE POLICE",
        "Magnum, Hornady Critical Defense .38 Special allways ️",
        "Hook up gone wrong!",
        "There's a suspect in the video...dude in a white hoodie...watching the 2 girls.",
        "Im curious if one of the roommates is an illegal immigrant or a gangsta thug.",
        "That fella that puts his hood over his head in the background sure is suspicious… looks like he followed them when they left as well.  What a horrible tragedy",
        "Dude is lurking  back there !! He was in line then stepped aside",
        "I never touched the red dress codes..",
        "At 1:50, in camera 1 in the upper left view, the major suspect turns his hat forward and puts up his hoodie. \nIn the full video, the girls ignore ballcap guy who appears to seek their attention as they approach the food truck. \nLater ballcap guy follows the girls after pointing at them as they leave.",
        "Passion?",
        "with the murders happening so close to moscow can we really rule out Putin? in this political climate?",
        "The video gives me the chills it's really scary",
        "It was the butler , in the library, with a candlestick.",
        "Sounds like someone owed money for drugs, gambling, or whatever...and the bad guys came to collect the debt. No mercy for whoever was in the house awake. I am starting to wonder if they left the other 2 roomates alone to intentionally put the spotlight on them for blame.",
        "At 1:49. My guess is it's the guy in the jacket with the hood and hat at the top of the top-left screen that is standing behind them, shows up when they do.  I saw another video where he walks after them as they leave.  And in this video, which I did not see before, at 3:03 watch as Kaylee gets done paying.  The moment she steps away he mimics her motion and moves with her.  Creepy as hell.",
        "What if it was the food truck manager? Wouldn’t be the first time a deranged maniac gives a tv interview shortly after perpetrating a murder.",
        "I would still look into the other two roommates...",
        "Somewhere, somehow, someone was doing the wrong thing. We have not heard the true facts.",
        "So incredibly sad, confusing and scary.",
        "they looked like bullies",
        "bruh. not the grub truck",
        "I need part 2.  Where's the rest of this story, please?",
        "All four stabbed to death? Sounds like there might have been more than one attacker? You'd think four people could find a way to subdue one person. Unless maybe the attacker was a really strong guy and the female victims had no chance.",
        "Did anyone else notice the stranger in the background with a grey sweater and black jacket on to the victims back to the left and on the right of the screen? He seems to be alone while everyone his someone with them from the video he doesn’t or or eat anything he puts his good on over his hat as if to cover himself up  and at the last seconds of the video he can be seen moving in the girls same direction as they are about to go. Jus pretty sus ",
        "I suspect no one and I suspect everyone.  Inspector Jacques Cousteau.  Everything about this tragedy is too forked up.  No screams.  Two roommates in the house who survived and heard nothing.  Door wide open.  Drugs and/or alcohol in copious amounts and someone they knew gained access.  The two roommates should be detained and grilled relentlessly because they know something.  Until the Moscow police find a real suspect, everyone in Moscow in general and that house in particular should be treated as a viable suspect.",
        "It’s very easy to kill 4 people by one attacker. Two could have been killed then the other two arrive home and are attacked also. I would say  the two room mates that survived didn’t hear the attack and the perpetrator didn’t know they were home.",
        "C I A  mk ultra.",
        "It’s probably one of the survivors that did it",
        "wow, i watch the grub truck live on twitch. thats wild.",
        "Ritual occurance",
        "Had to be someone they knew  and I can't imagine it was only one person unless he had Ted Bundy's strength.",
        "Someone in the house that is alive knows all the truth. So did they decide to keep quite for what",
        "def need to look into the roommates",
        "Hate to say it, but is this a Democrat ran city? Don’t hear anyone blaming democrats for this tragedy.",
        "Maybe this is why Netflix shouldn't be glorifying sadistic human killers.\n\nJust saying.",
        "Hoodie guy covering his face watching  the girls leaving when they left  and he was cleared  in a day  way too quick",
        "Maybe the ones who discovered them left the door open",
        "I know this sounds off the wall but in the original Scream movie the two killers who take turns playing ghost face stab each other to try and cover up there involvement by posing as victims as well , so if the other two house mates are injured certainly suspicious, so they were there the two other housemates ? One comment suggests they were ?",
        "They need to send all these kids home for the semester. Finish online.\nNot worth it.",
        "It was probably an incel did it.",
        "2 more people people in the house but didn't hear anything. Thats just f-ing strange...",
        "Nothing good happens at 2 in morning",
        "The two other roommates who were there aren’t considered witnesses. The police weren’t called until around 12 noon when the murders happened in the early morning. And the police chief waited too long to respond and report to the public. Something is very wrong about this investigation. And the police can’t tell people their safe if the killer is this on the loss.",
        "Everyone:\nItS tHe gReY HoOdie gUy.\nAlso everyone:  \nJumping to conclusions.",
        "I love your videos. Very entertaining . Hope you make more videos to entertain us.",
        "Police need to be less secretive in these cases.",
        "Why is there a place in America called Moscow? And the station reporting KREM? Unreal.",
        "You watch, the 2 room mates are involved and will end up being charged.",
        "The police probably weren't prepared for this and the statements they made were in attempt to keep the public calm for as long as possible. More than likely it was a random person on drugs or random person with a mental illness, after everything he ran away and left the door open, one of the victims wandered outside to try and get help and collapsed on the driveway by the road probably face down and a passerbyer say them laying down outside and called the police. The police came and then also walked inside the open door and found everyone else. It could have also been a group of students that did it together but that should be obvious to the coroner. How none of the roommates heard, no idea, just gotta wait for more to come out.",
        "4 people are stabbed to death and law enforcement say there is not an ongoing threat. Nice.",
        "Prayers to the Families ",
        "This is so tragic,  but a bit hard to believe that the other two roommates didn't hear anything? And with a lot of homes having Ring or some sort of cameras, someone down the street hopefully caught something on video.  Prayers to all that have passed and their families.",
        "Is it just me or is Maddie walking really weird in the video. Maybe she was intoxicated?",
        "So they have not caught the killer yet?",
        "This whole thing is fishy. Something in the air is not right.",
        "Zoinks!",
        "This is ridiculous! The police won't tell the public the truth on the fact no one is safe if this person is running loose.",
        "Do you think there was a brewing conflict between the 2 unharmed roommates and the 4 victims?  Or...did the two victims just lay low and hide out (8hrs)....at any rate, the crime will be solved by Monday. DNA and rigid investigative techniques will break the culprits!! Cowardly act for sure!!",
        "Trump's fault",
        "the murderer is at large & the pigs said that there is no threat to the public",
        "Not witnesses, but suspects? how did they NOT hear 4 people stabbed and left brutally murdered?",
        "Possibility of being drugged 4 of them?? It seemed no fighting back or struggling during the stabbing??!! Unless 4 of them slept in one bedroom, the killer must have known them very well..",
        "The guy in the hoodie and ball cap standing in the bk ground all alone and not interacting with no one there …………is the monster…………………………………who killed these poor beautiful souls…………………………………buddy just turn yourself in NOW ……………………………………maybe God will forgive you but not until he send you to the burning  hell of your soul if you don’t turn yourself IN…………………………………………NOW …………………………do it for the poor parents who need answers and to see you say you are so sorry for taking their children away from them…………………do it NOW ………………………………………and turn your self in………………………………!!!!!!!!!!!!!",
        "Is it separate suites and that is why maybe they never saw blood? How could 2 other people be in the same residence and not hear anything? Even if it was separate suites they would have heard screaming or something walls are thin. Something sounds off.",
        "Orenthal James?",
        "Looks like the sus guy had his eye on the girl who paid for food. The first girl left for a sec and he did nothing. As soon as the 2nd girl (white hoodie) left he immediately stars to move with them...",
        "Who’s the kid she went over to hug and who is his friend? Perhaps ask them? Did they all leave the food truck together?",
        "they'll get him\n\nyes it was a man",
        "A lot of residents have their .308's at the ready. Just saying but I bet the nasty ass killer is from California,Oregon, or Washington State.",
        "I didn’t know Shia LeBoeuf was running a food truck in Idaho.  JK on a lighter note.  Terrible loss for this community.",
        "4 people were stabbed to death while 2 other people were in the house and somehow didn't hear a single scream or struggle? Something seems very odd and red flags are going up.",
        "Those girls were hot how can someone done that",
        "Is Amanda trans?",
        "I think john edwards should called to help he's a physic and.he is real",
        "They did not even find a suspect or the killer and yet they saying there’s no threats to the community. Something isn’t adding about this story. So many questions. I think the police or the authorities are not telling us something. Stay safe U of I.",
        "The strange part is how the roommates are still alive. Wouldn’t you think during a chaotic quadruple murder spree that they would hear them screaming in agony and go and help. So many questions, and things aren’t adding up. Even if they were sleeping, you don’t sleep through 4 murders.",
        "It's funny that you guys have video of the guy inside his food truck. But hey I bet it got people to click",
        "This may be silly, but look at 1:54, 2:38, then at 3:10.  The small guy in the upper left quadrant, in the very back top dead center (his head appears just to our left of the blue panel):  hes alone, and first he puts his hat on down low and covers his head with a hoodie; he never takes his eyes off the girl in the white sweatshirt, and AS SOON AS she moves, he moves immediately in the same direction.   Eerie.",
        "The dude they interviewed smiling too much",
        "So, no one is speaking on it, You can clearly see that the one with the black jacket is Wasted and stumbling when she walks back to the truck unbalanced, she bumped into the fellas as she walked away, then rudely walked through their circle when she returned, not saying they did anything but there are people who find Rude actions offensive and drunk women vulnerable. ",
        "Something really stinks about this. The two roommates who were unharmed know more than they're letting on.",
        "Blondes get news coverage",
        "Grubtruckers from twitch",
        "Other roommates there????? Wth",
        " BE VIGILANT JUSTICE HAS TO COME  R.I.P. ",
        "The world is going mad. Prepare yourself for anything. This is not going to get better anytime soon.",
        "Gotta hear that 911 call.",
        "What about the guy that kicked in a few doors at Osburn Idaho this week welding a bat and knive.  I heard he was in Wallace the oc Osburn and gas station guy was going to take them from him he ran ... police have him now! it's not far away one hour ?",
        "Sadly you don't need to be a rocket scientist to be employed in law enforcement. The fact that law enforcement is a government entity stifles a lot of common sense and imaginative thinking.",
        "Why is he so smiley when talking about four murdered students? Seems sus to me.",
        "theres a guy top screen grey hoodie black cap brown jack he seems to be following them",
        "No offense. But should definitely keep an eye on food truck guy. Just saying. Hes was one of the last ones to see them.",
        "I don’t go nowhere w/ out concealed carrying my self defense weapon… this is America",
        "Heard this different yesteerdsy",
        "Come on it’s the roommates, they had better ensure they don’t flee. And everyone saying no way it was one person - it was 2 people! The roommates whoever the heck they are",
        "The manager seems shady...smerk on his face. Shaking his head no while saying I hope they find the person. Something is off. He looks like a creep...the one guy lingering probably is in on it too",
        "Energetic,  meaning  drunk ?",
        "So sad.",
        "Prayers for the families ",
        "So you’re telling me students CAN BE killed by something other than a gun??  wow I’m mind blown!!",
        "I thought it was a drug deal gone wrong , but honestly it could've been anything",
        "They're in Moscow, ID and the station is KREM 2? That seems kind of crazy to have yourself looking like a Russian news organization.",
        "Who the phogue is dancing and smiling talking about their customers who were butchered ? Have food truck knives been check. There’s murderer DNA on the victims……\nYES, very concerned that Barney Fife is in charge here…..",
        "Do any of you watching have any  idea what must be done.",
        "How did the police know they went to a food truck? Something they not telling us ️️",
        "There's no threat to the community...oh, we can't guarantee there's not threat to the community, but don't worry. We have it well in hand. It's okay. The murder is not likely to commit many more murders before he's caught.",
        "This story is going to go from tragic to weird soon.",
        "here's the latest:    We have no idea what we are doing and there is a killer on the loose",
        "Is it just me, or does it not look like a man is stalking them in the background?",
        "I hate when they say \"No sign of forced entry\"... I can't be the only one who doesn't always lock my door when I'm inside?",
        "4 people were stabbed to death and 2 roommates didn't hear anything.... I don't buy that, someone had to SCREAM!! Was the knife super EXTRA big, where it only took one stab each to KILL all 4??",
        "Extreme intoxication would account for the lack of reaction on the part of the victims and the other roommates. And also explain the delay in notifying authorities.",
        "Why was that guy smiling ..?",
        "I'm pretty sure it was someone who was close to the people that died. They will find out who did this. It's just a matter of time, which of the friends killed these innocent students.",
        "This police department kinda stupid or pretend to be stupid , but the door was still open ?  of course it's can be 2 people are in there why difficult about that just leave the door open ? don't forget why these 2 roommate still alive and they're let the time go by hours until they're decided to called 911 like they're cleaning up something",
        "...inside job",
        "I wonder if its possible that someone who was romantically rejected by one of the girls, but who kept trying and trying eventually built up grudges against other housemates who told the person to get lost or to scram trying to help out their roomate (over a period of time) and then the perp attacked?  Just a random hypothesis here.  Or maybe a city cam somewhere captured their vehicle on the way home, and maybe they were followed.",
        "So they let all this time go by so the murderer can get away and then cry wolf?  Sounds like the same kind of policing that Gabby experienced.  Or the children in Uvalde. Not good. They should have raised the alarm immediately so that people could think of any clues, locked down the area so that everyone didn't leave the area and go home for the holidays.  Sorry.  I just feel that this was very poorly done.",
        "May be the killers in the comments ",
        "That sounds like a rage of envy towards the victims. I don't know who did it, but whoever did this horrific act seemed extremely envious of the group togetherness and it sounds it was more than one person.",
        "down the hill?",
        "But don't worry. He probably won't do it again.",
        "I'm glad they got this video to trace their steps.",
        "I get strange vibes from the food trucker owner. They need to investigate him.",
        "Yeah, they was moochin' off a gadahmm food truck B4 dey waz CUT!! HOOOO!! I hope dem burritos waz good cz' IT'S THEIR LAAAAAST ONE!! UH HUH!!",
        "She was clearly intoxicated but no one wants to paint a bad pic of Idaho students. Half truths want help",
        "Eerie similarity to the Gainesville Ripper serial killer Danny Rolling. Bizarre",
        "How can the police say there's no danger to the community when they have four people stabbed to death and no suspect? I think this was all too much for this little police department and that's why the state cops have taken over.",
        "We already know all this",
        "Keypad on the door. The killer(s) most likely knew it.",
        "and no one wants to say , \" there is a KILLER on the loose \",.....they dont want to scare people , fine , but there should be a total alarm and warning and more defense manhunt being portrayed to get this filthy rotten SOB who slaughtered these innocent people !!!!    dear God deliver us from complacency to the fact of this horrific act and bring this evil to justice and end !!!!",
        "I think people were passed out drunk. I would assume the other two roommates were probably in a room in another part of the house the attackers didn’t know about and probably had their door shut and locked.",
        "Round up the usual suspects.   MS13.",
        "If someone were asleep or had headphones on they might not hear anything or be a witness. But four people is a lot for one person to stab without them being incapacitated in some way. Not to mention the suspect would have to have good aim to deliver fatal injuries every time, that just doesn’t happen in a struggle. Houses with multiple roommates don’t always lock doors either, there is a false sense of security in numbers sometimes.",
        "This sound like a inside job,friends I would say.",
        "Wtf were they doing in Russia anyway??????",
        "So it was the 2 roommates.",
        "Look at ex boyfriends. Someone who's been around and knows the coming and goings well. \nAlso I bet the reason the 911 caller had no info on the scene is because not everyone who stumbles upon a scene like that calls 911, they call dad or mom and scream, so mom or dad calls cops with less info due to the crazy call they received.",
        "Another video showed a guy that they supposedly arrived with and he stood in the back just watching him.  The girls got the food and ran off.  He threw up his hands when then ran away and possibly followed then.  Really weird video.",
        "I hope the food truck guy has been cleared! Prayers for all families! ️️️",
        "Okay, Slow down the Food Truck Video to .25 or .50 Speed. There is one behind the 2 Victims that is Watching them, literally Staring at them!! He then puts his backwards baseball cap Forwards, AND puts his Hoodie Hood OVER HIS CAP!! HE THEN MOVES A BIT AWAY FROM THEM FURTHER BEHIND THEM,.... BUT, CONTINUES TO STARE AT THE 2 GIRLS (VICTIMS!!),.... AND, THEN STARTS FOLLOWING THEM AS SOON AS THEY ARE FINISHED AT THE FOOD TRUCK AND START MOVING THEMSELVES!!!! ",
        "Look at the knife at 2:01",
        "It's about to be 2023. Camera systems are cost efficient and insanely effective for catching predators of this nature.\nShould be mandatory for housing complexes and or campus living. Complacency kills.\nKeep your head on a swivel yall.",
        "Guy who was running the food truck is irrelevant, gotta do anything you can to get those clicks huh? I suspect that the information made public will be minimal or non-existent, so these videos about absolutely nothing will be all over the place just like they did with the delphi murders.",
        "Your banner needs to be removed while you show videos… seriously how did you not think about this ever? It obstructs much of the video.",
        "Check. The. Socials  they called it a passion crime, and are not revealing something hidden- that sheds light.",
        "Really? All that to learn that 2 of them ate a couple of hours earlier?",
        "Exactly what I thought somebody in that video followed them when they were out and about.",
        "It wouldnt happen anymore if they would just outlaw all knives.that would solve the problem .right?.",
        "How did the two people not hear all those people being stabbed, what did they take? Maybe a party gone wrong.",
        "Three healthy, young women and one young man overpowered by one, lone assailant? Stabbing is a violent, noisy and messy method of murder.  Movies make it look effortless - one silent, swift cut across the neck and it's done. It's unbelievably painful, causing the victim to resist which often results in the assailant cutting or stabbing themselves. Being familiar with the layout of the house is important. What was the motive?",
        "Targeted or not, if the suspect is still at large, then the public is definitely under threat.  Obviously, we are not talking about a completely sane individual.",
        "So I have a very early theory... 2 of the girls were out at a bar and the other 2 at a party? (Guy and girl) What of the 2 girls at the bar got followed home?? Maybe someone was going to do something to them... Went in and realized their were more people and killed them? I'm really curious to know if the 2 girls came home AFTER the other two... If they did I think it adds a little credence to my theory!",
        "The Town is named Moscow and the TV station is KREM ???",
        "Who cares bout free coffee Tuesday? Coffee is a dollar",
        "Who cares boo hoo.",
        "Dagger Violence ?  Imported ?",
        "Like something out of a Thomas Harris novel.",
        "Thinking here.\nGood comments by followers \nSo, we have:\nEthan age 20; Madison 21; Xana 20; and Kaylee 21. ",
        "a therd person did it",
        "I don't fault the police chief at all for remaining silent the first few days because of the nature of this crime as well as the logistics of kids going home for the holidays and that sort of thing. I would rather them wait and not compromise the initial part of their investigation then have them say something too soon and risk something on the back end.",
        "LOVE YAHWEH ELOHIM , LOVE ONE ANOTHER.",
        "It was him!!!!!",
        "look at the man that put up his heat he moves when the lady in white walks away in the back he watch the whole time ?????????????",
        "Wtf is going on here? First it was an isolated incident, no need to worry, but now there’s a manhunt for a killer. Huh?!?! Already suspicious. If they looking for someone, they know who they’re looking for and need to say it. Makes no sense at all with these other two roommates being in the house, hearing nothing, but blood is dripping everywhere in the house, and they just in there for hours with their four dead roommates. One person cannot kill four healthy young people like that. And who called saying someone was unconscious, which clearly couldn’t have been the reality when blood was everywhere? It’s just too many questions and the secrecy going on is a mess and feels like something is being covered up. Just awful, those poor young people just gone for no reason, and four families left grieving with no real honest answers or straight forward information. I pray truth and justice will prevail.",
        "In the video at the food truck, that guy in the brown coat with the light colored hoodie underneath is really watching the 2 girls while they are ordering food. Same guy follows them when they leave but the girls took an UBER home. Did he know them?",
        "They had to all have been in separate rooms, hence no one hearing the murders taking place.\nThis is not the first time the killer has done this, you just don't wake up and kill four people with a knife.",
        "Their more to the story the police is moving in silence.",
        "Did this happen in the United States or in Russia???",
        "Drug deal went bad",
        "Imagine in this video killer is there waiting to do a kill that's messed up life goes quick",
        "If they don’t have a suspect… How can they begin to say that there’s no threat to other students or the community? Something definitely is not adding up!! Unless The person that did this is related to law enforcement or something.",
        "1:49 the guy in the football jersey was watching the two girls until one waved at him at 2:07. Is this something they're already looking into!? It's so easy to stare at the two girls because of the red circle, but I couldn't help but notice that young guy. Not trying to assume the worst, but something to consider.",
        "I would start with scorn ex boy or girl friends.",
        "Here because of grubtrucker footage, this is some sad stuff ",
        "This is either a crazy ex boyfriend... or a cocaine debt",
        "Has there been consideration to College Employees, the young Ladies presentable and one male murdered. \nHave checked Janitors, Office employees, get my drift \nOften jealousy can stir if 'attraction' to students, this jealousy of the 1 male murdered. \nEmployees, whomever, familiar with these students, who resided about 2 (?) miles from Campus.",
        "Drugs are involved, DUH!",
        "Killing 4 ppl had to make some noise you can't be that quiet, the other 2 get to live.",
        "So sad. RIP to all victims. It’s very puzzling how it happened. I would say, check food truck and workers. Could be that roommates spike their drinks, not necessarily to be alcohol drink. Roommate’s know something. Like I say, it might not come out in the wash but it will come out in the rinse. Be safe everybody.",
        "These investigators sound about as competent as those in uvalde",
        "I feel there's more than one person involved.",
        "Where is the FBI……the forensics here are huge….",
        "When they say they don’t have a suspect, they absolutely have a suspect but just say that to keep them from running/tampering with evidence and to make them drop their guard. There is absolutely no way on earth they don’t have surveillance video of the hallways. They know exactly who did it.",
        "You didn’t point out the creeper that arrived with them, hung back while they ordered, followed them as they moved and left when they left. Watch the whole video. Poor investigating. ",
        "0",
        "Our justice system sucks. I live in Ohio and just recently a man was lured into a car by two woman and was shot multiple times in the head by a man who was hired to kill the man. The women got 4 years and the killer got 13 years. Unreal",
        "Shady. Dude in hoody. Watching girls order. Check him.  Out. He menuvers puts hood on and steps to the of rears of them. Creepy motions.",
        "Police in places like this are not very good at investigations, bring in professionals like FBI ,",
        "\" hope they get the person. Hope they gey the person \" \n\n\"Person\" being singular.",
        "Maybe they ate something bad from the food truck?",
        "Sleeping drunken students neck slit can't scream. Then stabbed in chest till dead, then the next. It was below freezing there I don't think guy in video is the suspect probably the Uber driver waiting on them",
        "It would seem the kids were killed in their sleep. Tragic",
        "They broke all 4 rules of stupid sad whoever did this will be caught",
        "Something isn’t right here. There were 6 people in the house, 4 were brutally murdered… how did no one hear these attacks? Although this is horrible to say, each individual was stabbed, but no one heard screams? And, why did the person that called 911, only report “ an unconscious person “? There was no mention of the horrific scene, no mention of 4 people wounded or dead? The coroner said the scene was gruesome, so the person that called couldn’t have missed that. Did someone in that house have a psychotic break, possibly due to drugs? No forced entry as well, no screams heard by neighbors from the two surviving house mates? How could ONE person have done this? NONE of this makes sense. I pray this case is solved and the innocent victims receive justice. I pray for the families. At this point, nothing adds up.",
        "Nothing good happens after 1am",
        "no Paul pelosi video's?",
        "Bullying is real ppl",
        "When pretty wealthy people get it: Oh nooo how could this ever possibly happen?!?! \nWhen ugly people get it: I wonder what he did to deserve this?",
        "People saying how can you not hear? People sleep with fans on, tvs on, etc. Plus, college kids can sleep until well past noon.",
        "Very strange and sad.  And it looks like the small towns here where I live.   In Canada.",
        "Somebody  knew the code and maybe they knew this person",
        "They should be checking out the guys in the jerseys",
        "2 roommates unharmed are suspects.",
        "6 people lived in that house. 4 were killed. There has to be a reason 2 were left alone. The only plausible explanation at this point, since the killer(s) didn't break in, is that the victims knew their killer(s). There is more than just a likelihood if the 4 victims knew the murderer, the other 2 roommates knew them too. Only a close associate is going to be allowed inside at a late night hour. It is highly doubtful the doors were left unlocked. It is too much of a habit for people to NOT lock their door when returning home at night, even when intoxicated, especially females.",
        "May God hold these people in his Loving Arms and comfort them during this horrific time. My heart breaks for all those left behind. God Bless them every one. \nI pray the killer is caught and brought to Justice quickly!",
        "Ban all knives.",
        "My heart goes out to the victims and their families.\nWhile we all want to solve this case, making allegations based on scanty evidence can create new victims, and that may be why the police aren't sharing every little detail - they don't want some poor sap to be treated like a murderer just because he happened to be caught on camera near a food truck.",
        "That food truck is grubtruckers on twitch I watch them damn.",
        "This doesn't sound random to me.",
        "Something is really weird, 4 knife attack and no one raise alarm especially with 2 other people in the house",
        "One of the girls could of gone to the door  and it was a boyfriend ex boyfriend and even opened door to tell them to leave. Guy at food truck was wanting to talk to one of those girls and she ditched him. Maybe went to talk to her and it all happened. Looks like they new he was there and knew him but not wanting to talk to him. He left right after them probley angry at the girls for ditching him.  Happened so close to them going home he could of been right behind them and went in when they first did. Must if known him it looked like he was upset with the one girl as if they had a relationship. Her hugging other guy too in front of him . To suspicious to have him at food truck then it be this night something happened. Probley got in because he was desperate to talk to the one girl and she was wanting him to leave.",
        "3:08 saying \"I hope they get the person\" while shaking his head no...",
        "The scene was a bloody mess, but the person who called the police only said that someone was unconscious?  Whaaat?!",
        "I live in Lewiston, Id   30 minutes south of Moscow and today 3 armed guys were at LCSC campus today.  Very rare for these parts and people are wondering if it is possibly the same people?!",
        "They should study the dogs behaviour to see if it is a light sleeper and is a barker.\nI don’t get it if the dog was barking the other students should of woken up…\nRight away.\nPolice were also called a lot later than the attack. Unless the other surviving victims were super drunk in a coma sleep.",
        "look at the guy in the back watching them then he puts his hoodie on and then follows after they left",
        "Basically they are gathering proof against one or both of those present. The fact they were there is not enough and now once they have further proof they will proceed. This will be solved soon I’m sure. This is tragic",
        "If the killer is a student he's probably already left for the Thanksgiving break..",
        "Bizarre story. Makes no sense. Lots of holes in this story. Most likely drugs involved.",
        "Bottom line stay away from drugs because drug dealers will kill you , this is one reason I refuse to drive a Range rover or Mercedes cuz goons see a come up .I hope they R.I.P. & they had time to get right with God before the end",
        "Soooo... the roommates are prime suspects at this point then... right..?",
        "Find the motive. then the murderer or murderer's?  Horrific. Very sad. Praying for the families. Their lives are destroyed. Praying for an arrest.",
        "That's it, I'm turning in all of my semiautomatic assault knives.",
        "This is like a horror film...those poor kids ",
        "God bless the\n families of these beautiful young adults. Shocking this could happen.  Where were campus  police?",
        "Two Other People Was In The Home And Heard Nothing",
        "People kill over jealousy, partners, money, protection so what part do these poor souls fall under",
        "Recall, though, how long Travis, different case, laid before his roommates realized.",
        "“It’s normally a place we’re we all feel very safe”… it’s never safe around that community…. ",
        "So this killer is able to take down four kids? The way I’m reading this is he has the skills of John Wick. There had to have been more than one person in this. Poor kids man, what crazy lunatic would end four lives.",
        "Idaho Law enforcement not the brightest bulbs in the box.",
        "Nothing is adding up here.",
        "Seems like more than one assailant had to be involved. Tge roommates were playing music and couldn't hear anything? That too seems odd that they did not hear anything. Hoping law enforcement can get to the bottom of this horrific crime.",
        "Bonsoir \nBonsoir \n \n     On",
        "WTF you doing out at 1am?",
        "Idaho,  and no one had a gun to shoot the stabber? ",
        "If they Uber’d home, not sure how the “stalker” in the video could be a suspect",
        "I'm still left with questions, how do you stab four people without anyone of them making a noise and alerting others, the sheer exhaustion alone to stab one person which I'm sure they fought back as you can during a knife attack ,did they have people over and the knife wielding lunatic drugged them???...too many questions.",
        "The reaction by the food truck manager to the news is pretty suspicious. I would put him on my suspect list and thoroughly investigate him. You don't smile when talking about the stabbing death of two college girls you just served smh.",
        "It’s definitely a former boyfriend",
        "RIP ",
        "Likely someone familiar with the house. How do you stab 4 people in the middle of the night with a dog in a locked house without a lot of commotion?",
        "Cover up",
        "I'm pretty sure that Paul Pelosi answered the door.",
        "Hello… does no one else see the guy in the back standing alone who put his hood on staring at the girls in the video ",
        "They look drunk, stumbling around!",
        "Sounds like a Charles Manson thing",
        "someone was sayin on a different channel the food truck guy was suspicious because he was so calm.",
        "Roommate’s should no SOMTHN!!!!!!",
        "One guy in line steps out of line ,his hat was on backwards. Puts hoodie up and stands aside until the girls start to walk away from window! Then the guy starts to move! Person of interest or roommate? Looks fishy/ strange!",
        "Who called 911",
        "Reporter “We learned a lot this afternoon…4 students were stabbed…” lol, no news here. Just sensational fillers.",
        "Lets see if they are capable of doing their job!!",
        "No sign of forced entry and two other roommates in the home but unharmed? Ok …",
        "Although a wide guess,  could there be a possibility that the two students still alive have played a passive role in getting the others ticked of ??\nThe point why I doubt this is not only why these two were spared death but the bigger point is  \"THE DOORS WERE OPEN\"  which means these two kept it open for the assaulter to have a  free entry??",
        "Hopefully their hillbilly keystone cops are avid Dateline viewers. They just might have a chance at solving this case.",
        "joseph from the food truck is the murderer",
        "They know who did it",
        "A lot of junior superdetectives in these comments. Go back to watching dateline.",
        "Im starting to think that the 2 ppl that were found in the house alive, didnt call the police till 12.00 pm and they were murdered at 4.00 am. Also why werent they also killed, and there was no forced entry. Hmmm. They know something. Get them justice if anything.",
        "Imagine it was that food truck owner ",
        "2 people in the house were untouched said they didn't hear anything, how do you not hear 3 young women, 1 young man screaming an begging for their lives being stabbed to death‽ this doesn't pass the smell test!",
        "I feel for the family’s of all the victims……\nAwful to say but \nPolice gotta focus on who was attacked most \nFollow that ",
        "Check out the guy way in the back right( on screen) he seems to be watching them and leaves whe they do...just a thought",
        "I don't see how one person with a knife could kill four people- didn't they resist?",
        "There may be two culprits! It's still horrible and I hope they find the culprit(s) as soon as possible!",
        "The city of Moscow in America ",
        "With all the surveillance cameras in and around nearly all homes these days, how can they not have video of the suspect(s)?",
        "\"Friends\" how many of you have them?",
        "We all need home cameras\nRIP",
        "Were the four killed in the same room? Which person received the most stab wounds? The male? If so — and I don’t know if that’s the case — that could indicate that maybe the killer didn’t expect the boyfriend was there so he killed him first in a big struggle and the three women were quicker to kill. Just a theory.",
        "They all seem to know it was one ‘person’ . Strange.",
        "2:40 - 2:45 you can clearly see that shes stumbling walking back up to the window of the food truck so when I was wondering how somebody could have got them without screaming or anything if they were back at the house drunk passed out then that's how the person made this so-called \"silent attack\" ..... Also Ethan and his girlfriend were at another party so it seems like everybody in the house had some level of intoxication at one level or another that could possibly explain why everybody was caught so off guard... Also when they mentioned the two other roommates being in the home and not being witnesses I believe that they heard the attack going on and hid for as long as they had to we got to remember college town drinking everybody's not thinking straight",
        "Why is there no photo of a possible suspect????? Unbelievable!",
        "It was the food truck guy...he was too happy with the camera...smiling and jumping around. And he had a video...my opinion is the food truck manager, in the apartment, with a knife. But honestly...I'm so sorry for the loss of these people and I feel sorrow for their families. But check the food truck managers alibi",
        "Sinners gonna sin bye bye",
        "Ted Bundy copycat?",
        "How is this dude gonna walk in and stab 4 people to death all by himself. And walk out. And there was like 2 other people in the house as well????",
        "How horrible",
        "Don't read these comments. Everyone seems to be making stuff up or acting like they are psychic mediums knowing what happened. ",
        "We need to enact strict knife laws……stabbings are off the charts……….outlaw knives",
        "They knew their assailant. Smiling faces sometimes tell lies. Your enemy can't do you no harm. Because he knows where you coming from.",
        "they should’ve locked down the city. ik it’s thanksgiving and people go home to their families but if they have no leads, no witnesses, and no murder weapon the more time that passes the harder it’ll be to solve. chances are if the murderer isn’t from the area they’re gone and never coming back",
        "It's like someone's trying to reenact the movie scream",
        "I think the person had to know them & know who was going to be in the house & if they were awake or not ..",
        "Then WHY did they ever come out and say that the community has nothing to be scared of?! If a suspect is on the loose, WHY would they say something different now?! I'd be livid if I lived there.",
        "Butterboy deleted his content.",
        "Bless that guy for trying his best to say something nice about these poor girls, with whom he had such a small and generic interaction.",
        "I am sure they are checking all cameras - ring, etc -  around that house. It isnt times square.  will they solve this case?",
        "This is terrible. The poor parents of these kids.",
        "Who purchased a new cell phone in that town the next day.  I'd check all retail records (walmart, phone shops).  Possible a perp would ditch theirs after a crime like this and get a new one?",
        "The other two roommates clearly did the killing",
        "These other 2 girls either did it or know who did it how could they possibly not hear anything and why such a long period in notifying the police",
        "What the other roommates were home when this occurred ",
        "Chief Fry is a very good guy. I trust in him to catch the killer.",
        "Watching the TOP LEFT Cam! There is a guy...Behind the girls he is watching them. Then when he sees the camera he puts his gray hoodie over his head. Very strange.",
        "They need to be looking at the two surviving people real close. Why weren’t they attacked and killed?",
        "Who were the “roommates “",
        "I guarantee the internet Karen amatuer detectives will get to the bottom of this case!",
        "Look into Jake, Mogens ex bf. He is in that video too",
        "Must be multiple people",
        "We dont need the play by play....  whats the subtle social manipulative angle here...?",
        "I think it's someone in their home. This sounded like a personal crime.",
        "I wonder of the roommates had a habit of leaving their door unlocked?",
        "Ban assault knives!!!",
        "STRANGER THINGS !!!\nYES ....TRUE",
        "In that video it looks like one of the victims purposely bumped Into a female that's talking to a male... it may not be anything but may be something. As well as the female victim was drunk... wobbling, swaying and everything! She may have been more energetic and bubbly but she was buzzed for sure.",
        "And it's not that uncommon for all the roommates to lock doors and houses like that you would not hear stuff especially if you were drinking yourself or out cold I don't blame the roommates one bit",
        "Sounds like two killers to me",
        "We're the 4students asleep when they were kilked?cuz it seems hard to believe that 1person could contain 4adulys with just a knife ..so aye more than 1 attacker??or everyone was asleep??and the door was left open which tells me it happened quick and the attacker left fast as possible!so if I lived in that area I would be terrified as police don't know wo did this??&o arrest made??&i dont think it was crime of passion bullshit because yelse would all 4 be killed??makes no sence ..personally it sounds like a syko on the loose who maybe was watching them or knew they didn't lock the doors so maybe someone they knew but it could be one of those sikk weirdos tht get thrill out of killing people..?idk but serious security needs to be on that campus and also patrilcars around that neighborhood 24/7until they make arrest!",
        "IT TOOK MORE THAN 1 PERSON TO STAB AND KILL 4 !!  THERE SHOULD BE A MASSIVE MANHUNT FOR THEM RIGHT NOW!! WTF!",
        "\"More excited people.\"  They were out partying.  I went to school in Moscow.  It's such a small place, you never think anything bad could happen.",
        "I thought Moscow was in Russia",
        "Bruh the other 2 did it wtf",
        "They where all high and passed out and the murderer took advantage of that",
        "Learned a lot? Not much we didn’t already know",
        "The state police should have taken over immediately.",
        "They need to check into all of the food truck workers.",
        "To whoever is reading this keep going, you're doing fine! No matter how slow your progress, each new week is filled with tiny steps forward. Be proud of yourself, you got this. ",
        "Sorry….not! Every time I hear, “Moscow Police..”, I cringe . WTF, FBI 24 hours ago……And YES, EVERYBODY IS AT RISK…….",
        "Any video cameras  around  Were they all sleeping  Why didn’t the two other roommates hear anything ",
        "Why did the food truck guy sound like the guy that did it? Why does their energy matter? The way he explained their interaction was suspicious af or he is super socially awkward.",
        "Makes me wonder, drug related? Two home when it happened, they didn’t hear anything? Waiting to call the popo? This smells like drugs",
        "My God, What a nightmare for those families. May they rest in peace and may God give them strength to continue life. So sad!",
        "the suspect should be the guy in the video hanging around the two girls",
        "I don't see a single black person in this video so can't blame us for this one.",
        "Who,s the dark haired guy thats wearing a number 9 bears shirt that ways at one of the girls and she go over to him an he huges her . I hope police checked him out ?",
        "about 2 years ago I lived in a 7 bedroom house for I am working away from home … my roomates party all night and are loud but I lock my door and put my headphones in everday .. one of the days I woke up next day finding out they had cops called on for fighting .. I didn’t even hear a thing … the other 2 roommates probably outcasts and kept for themselves/  probably were just used to it …",
        "So who was present ? So!some is well connected to the police",
        "",
        "Going to be a lifetime movie\n.sounds Iike. The killer or killers the victims knew they'killers probably raped the girls then killed them..the killers probably were the  victims boyfriends!",
        "A city called Moscow and a news station called the Krem?  In Idaho?? Russian farmers?",
        "Some people are saying there is no posibility he or she we dont know for sure was alone Richard Benjamin Speck (December 6, 1941 – December 5, 1991) was an American mass murderer who killed eight student nurses in their South Deering, Chicago, residence via stabbing, strangling, slashing their throats, or a combination of the three on the night of July 13–14, 1966. One victim was also raped prior to her murder. A ninth potential victim, student nurse Corazon Amurao, survived by hiding beneath a bed.Corazon Amurao hid under one of the bunk beds and Speck never went looking for her--could you imagine how terrified she must have been? Speck had been drinking and was in a murderous mood. Those nurses were soo frightened they didn't even try to scream, if only they had done so they might still be alive, the walls of the townhomes were so thin. One of the nurses, I think",
        "What about the guy in the hoodie? The one woman turns around and points at him and says something to him. Then the two females talked amongst themselves, the the other woman motions her head towards him.",
        "I remember years ago in Florida (I believe) when a woman was murdered and her two roommates had no idea what happened. The deceased roommate was murdered by a jealous ex-bf/fiancé. They got him by his dropped cigarette butts, Camel Turkish blend which was a rarely purchased brand, laving his dna when he was outside watching, waiting.",
        "Police latest report: Unknown motive. Unknown suspect. But it’s safe………Is it really safe?…….really?…..",
        "Crazy nothing you hear bout but Idaho potatoes but now this",
        "Have they not see the video on these gore websites???????THERES A SNAPCHAT VIDEOOOOOO!!!!!NO ONE WILL LISTEN",
        "how could one person do this?",
        "How do you search for a suspect that doesn't exist?",
        "I walk the stage to graduate in December. I really hope they have some sort of memorial/moment of silence for those victims. #VandalStrong",
        "STRANGE WHY THE KILLER DID NOT KILL THE OTHER 2 ROOMMATES!  THE OTHER ROOMMATES DID NOT HEAR ANYTHING...HOURS LATER!!!  WOW, THAT IS VERY MESSED UP!",
        "FBI is involved...now we'll never know what happened.",
        "Rip ",
        "I lived in Moscow, that area looks familiar, what street is it?",
        "Who the heck is able to kill 4 people with a knife themselves?",
        "Person or persons",
        "the fact that the killer or killers did not check the rooms in the house means they were not looking to rob otherwise they would have found the 2 other students that were allegedly sleeping. This 100% proves that this attack was personal and targeted!",
        "I think the two left is where your gonna get answers",
        "As someone else has pointed out.  Video shows large male in brown cap and coat.  I would want to identify who that is.",
        "3:08 \"Hope they find a person...\" Disclaimer: Trigger Warning Fair, Use Act, USCon1stA, and Gods free will protect my opinion. This case from day one seems to not be alarming as one can expect. Usually there's a massive public outcry to apprehend the supects.Once again, let us keep the victim's families and friends in our thoughts and prayers.  And may truth and justice prevail.",
        "We have a lot to say….we still don’t know anything",
        "And there you have it.  The two girls went to a bar and gamed the wrong two guys.  They followed them home, things went sound and the other two were in the wrong place at the wrong time.  Luck for the other two they were sounded asleep and didn't witness anything.  That's why the cops know there is no threat to anybody. ",
        "Get a gun and a license to Carry and if ur state refuses get a lawyer and keep trying until u can carry people. This could happen to anyone at anytime. Don't be a victim. Learn every Law in ur State in firearms and take every shooting course and shoot ur firearm weekly to become a great shot stay focused and always be looking around u pay attention to people around u no matter where u are stay alert. I'm trained in self defense in 3 different ways to fight and carry my firearm 24\\7 everywhere I go not just for me but to keep those around me safe to and work on my skills in fighting and shooting weekly. Perfect urself people.",
        "There is no way, on God’s Green Earth, that two people, however wasted, slept through or didn’t hear FOUR people being chopped up. How did none of the 4 call police? If it was a charnel house as is being described, then SOMEONE would have been awoken.",
        "It was an ex of one of the girls.",
        "The food truck guy did it..",
        "Aren't the surviving roomates witnesses??? They were in the house. How could they not be witnesses???",
        "Check the roommates Roooomsss!!!! Omg I won't be okay until Cops investigates the roommate's rooms!",
        "Science, democracy, black and white",
        "Uber driver?",
        "Stay classy, humanity. ️ MDK, MDK, baby!",
        "Ive rarely heard anything about this case on a national level.",
        "No way it was just one person. I hope they catch whoever was involved. Prayers for family of victims.",
        "I am wondering if their Landlord has been checked out??",
        "\"Nothing good ever happens after midnight.\" is a frequent police repeat.  Generally true too.",
        "Suspects or 'Suspects!?'\n\nThis crime involves more than one Suspect I bet.",
        "Wait a minute there was people at the house when this happened this sounds fishy how does one person control 4 people to be able to kill them",
        "I thought crimes like this didn't happen in Trumpland",
        "Have they questioned the long haired dude and the girl with the hat on? As the blonde girl in black jacket walks past her at one time, looks like she intentionally bumps into her, (with the hat) on purpose, for some reason? Maybe they at some point called her on it? Since her roomate had to then catch up to her. Maybe that couple followed the girls home or had an altercation with the victims for doing this? You never know, people get mad if someone deliberately slams into you or people they are with.",
        "I'm pretty sure all the questions we have any competent cop has to. There's obviously more info they will not share.",
        "Were they sleeping during the attack?",
        "Obviously they knew the guy which is why there was no forced entry. These barney fife cops took 3 days to get to the most basic conclusion.",
        "The two other women could have been on Zanex or heavy drugs like these.",
        "How in the world are there 2 people in the home unharmed and didn’t hear anything?!?",
        "The two people in the house that survived arent witnesses because they are Suspects!",
        "The four went out for food and seems shortly after they are murdered then they must have been awake .They must have been attacked by more than one person .. Another two in the room? Heard nothing yes thats possible.  I stayed in a hostel felt someone at my pillow  hands moving under the pillow then down at my feet area. I kicked out with my foot pretending to be asleep still I saw the movement of the girl and what bed she got into a top bunk. ",
        "Moscow, st. If Idaho period is out if it's depth on this one, I've personally lived there, and not surprised, lots of kids, no cops, it's a sess pool of a small town wrapped in the universitys colors,.Aids is rampant, at least was 15yrs ago, maybe it's changed.",
        "Wth. Two people home and didn't hear 4 people get stabbed? Plus they weren't the ones who found them? Something sus. They weren't found til 12...and roommates didn't come out of rooms at all then???",
        "Obviously the other two unharmed have something to do with this",
        "We need Comprehensive Knife Reform Laws. No one needs a knife with a blade longer than 3 inches. Mandatory knife purchase waiting periods. Knife registration. Make it illegal to carry a knife outside the home. That will fix this Knife murder problem.",
        "The Butler did it.",
        "Maybe it was someone they or one of them brought home.",
        "Always be careful who you offend. Never know who could be a ninja. ",
        "It's obvious that it's the other guy that works on the food truck. Just look at it.",
        "Victims they known the killers",
        "This is confusing!",
        "LE needs to trust the public and give as much information to the public as they can.  Guess who solves cases…public ",
        "So either someone knew the passcode or it was someone that was staying over or someone that’s been there and had a window unlocked",
        "the butler did it!!",
        "I am confused initially the photo was of a Caucasian male and sure enough give a day or two now there a brother that's black male in case you are wondering in  the photo. I didn't know there were black people in Idaho ️",
        "Police are royally screwing this up",
        "Who is taking so much risk to kill 4 people ????",
        "So sad, it sounds like something Ted Bundy would have done.",
        "This Reminds me of this episode of Deadly Women where a young Woman and her Bf Unalived her friend its was 3 or 4. Very Horrible story.",
        "Here’s why God Almighty has a lake of fire prepared for all those who reject Him and His ways. We see here for example how great an evil someone can attain to in this life - just imagine the possibilities in eternity. We need a new heart and mind that only come through being born again by the Holy Spirit so that we can bear righteous fruit in this life to God. That process can’t begin in a person unless they’ve repented of their sins and believed in the gospel of Jesus Christ. Choose you this day whom you will serve!",
        "the guy with the hoodie at food truck where the girls were at told the other guy he was making sure those girls got home ok..How was he suppose to do that?? Those girls seem like they didn't know that guy. And when they girls took off he immediately left too...if that's not suspicious I don't know what it is..plus they say this guy lives by the girls..",
        "The roommates that weren’t attacked have a lot of explaining to do! How did you think 4 people being butchered was a party? They definitely know who did this and had a part in it!",
        "Had to be more than one unless one person attack them in their sleep and covered their mouths. Doesn't make any sense, the 2 left didn't hear anything  so this is very strange..very targeted",
        "I assume they’ve interviewed the guy who hugged one of the girls and his buddy behind him?",
        "The murderer needs to be found,  arrested , charged, trialed and imprisoned!!  There ain't no in-between!!  4  students died.  A forensic team needs to go through that house and look for any clue , handprint or DNA they can find.Im surprised that the FBI wasn't involved in this case.",
        "Strange",
        "And just like that, the first 48 are squandered. RIP.",
        "The 2 up stairs HIDING(avoid get killed) they probably heard everything that happened. When it was over they pretended 2b sleep.",
        "They've literally learned nothing. They aren't gonna find the person. Whoever killed them knew what they were doing.",
        "Idaho did it",
        "The guy behind the guy with the 9 jersey looks sus just watch him step back when the girl approached",
        "Plenty of killers have murdered multiple sleeping victims without anybody hearing anything. Danny Rollins and Ted Bundy immediately come to mind.",
        "Oh they are feminist for sure lol not ANYMORE ",
        "Good thing they are actively searching for a suspect…. that’s their job.",
        "If authorities wouldn't have downplayed the danger to the community Saturday,  this tragedy  could have been avoided .\n   is smoking good for democracy? why does obiden want to make the world an ashtray ?\nFilm at 11.",
        "Food truck guy seems very BUBBLY AND UPBEAT for there being 4 people murdered, 2 of which he spoke to. #Hmmmm",
        "4 students dying near a state college the state police should've taken the lead from the beginning.  The Moscow police chief really bumbled this and happily we won't be hearing from him anymore.",
        "Was this a murder suicide.. that was creative",
        "People forget the robber who got stabbed at the vape store in vegas. He didn't scream. I doubt they had to react due to blood loss. It's not like the movies. I'm sure they died instantly and hopefully painlessly.",
        "Yeah HOW was there 2 roommates there and they didn’t know anything ?  They didn’t call until noon ??  That’s suspicious……",
        "Wow...SOOO much doesn't make any sense at freekin all!!! \"A gruesome scene\" said the cops, but \"an unconscious person\" said the initial caller...it wasn't BLATANTLY OBVIOUS the \"unconscious\" person was savagely murdered?!?!? What the actual &#%$ is going on here??? I pray the families get true closure on this heinous storm in their lives!",
        "Prayers for the family and all students!"
    ],
    "comments_disabled": false
}