{"video_id": "5e28tV4XG7Y", "comments": ["Something isn’t right here. There were 6 people in the house, 4 were brutally murdered… how did no one hear these attacks? Although this is horrible to say, each individual was stabbed, but no one heard screams? And, why did the person that called 911, only report “ an unconscious person “? There was no mention of the horrific scene, no mention of 4 people wounded or dead? The coroner said the scene was gruesome, so the person that called couldn’t have missed that. Did someone in that house have a psychotic break, possibly due to drugs? No forced entry as well, no screams heard by neighbors from the two surviving house mates? How could ONE person have done this? NONE of this makes sense. I pray this case is solved and the innocent victims receive justice. I pray for the families. At this point, nothing adds up.", "As a person who owned a crime scene remediation company and have worked scenes like this I cant ell you that stabbings are one of the hardest scenes to forget. They haunt the first responders. This had to be more than one perpetrator. I do not know how one person could have managed to stab and kill all 4.", "This is so tragic,  but a bit hard to believe that the other two roommates didn't hear anything? And with a lot of homes having Ring or some sort of cameras, someone down the street hopefully caught something on video.  Prayers to all that have passed and their families.", "So many more questions. The 2 roommates were still in the house. Two females I believe. But who called 911 on an unconscious person at that address? It’s reported that it was a bloody, bloody scene when 1st responders arrived. So who called 911? Couldn’t be a roommate or they’d have seen the blood, I would think and freak. Certainly they’d have gone outside and waited. Good Lord, I just feel awful for all involved. Such a mystery and quite honestly, it’s horrific to even think about.", "This is so very, very sad. My prayers go to the families who are enduring this horrific pain. God bless you.", "May God hold these people in his Loving Arms and comfort them during this horrific time. My heart breaks for all those left behind. God Bless them every one. \nI pray the killer is caught and brought to Justice quickly!", "If someone were asleep or had headphones on they might not hear anything or be a witness. But four people is a lot for one person to stab without them being incapacitated in some way. Not to mention the suspect would have to have good aim to deliver fatal injuries every time, that just doesn’t happen in a struggle. Houses with multiple roommates don’t always lock doors either, there is a false sense of security in numbers sometimes.", "The killer was at that food truck location, whether it was the man they ordered the food from, or someone in the shadows. This was a heinous crime and appears targeted. There are too many questions unanswered and I don’t believe LE is unveiling just how evil this act was. Prayers for the families, may they find strength in this difficult time.", "So incredibly sad and horrific. The families will never enjoy holidays with their dear children..... Marriages, careers, grandchildren that might have been. Such a tremendous, tremendous loss and I'm deeply sorry to their loved ones.", "As a mom to young adult children and seeing the video … my heart breaks and crys .   So so sorry", "To whoever is reading this keep going, you're doing fine! No matter how slow your progress, each new week is filled with tiny steps forward. Be proud of yourself, you got this. ", "It ALWAYS creeps & freaks me out watching VICTIMS on camera before they become victims. They have NO IDEA that within minutes & or hours THE UNTHINKABLE is going to happen. It's eery knowing I'M WATCHING A PERSON THAT'S EITHER NO LONGER ALIVE , MISSING , IN THE HOSPITAL INJURED OR still ALIVE but what the story they have TO TELL IS HORRIFIC. This makes me think WHAT WILL MY \"LAST KNOWN FOOTAGE ALIVE\" catch me doing ", "This is a terrible thing that happened to these beautiful young people. My condolences to the families.", "No way it was just one person. I hope they catch whoever was involved. Prayers for family of victims.", "The police probably weren't prepared for this and the statements they made were in attempt to keep the public calm for as long as possible. More than likely it was a random person on drugs or random person with a mental illness, after everything he ran away and left the door open, one of the victims wandered outside to try and get help and collapsed on the driveway by the road probably face down and a passerbyer say them laying down outside and called the police. The police came and then also walked inside the open door and found everyone else. It could have also been a group of students that did it together but that should be obvious to the coroner. How none of the roommates heard, no idea, just gotta wait for more to come out.", "The two other roommates who were there aren’t considered witnesses. The police weren’t called until around 12 noon when the murders happened in the early morning. And the police chief waited too long to respond and report to the public. Something is very wrong about this investigation. And the police can’t tell people their safe if the killer is this on the loss.", "My God, What a nightmare for those families. May they rest in peace and may God give them strength to continue life. So sad!", "\"Nothing good ever happens after midnight.\" is a frequent police repeat.  Generally true too.", "My heart goes out to the victims and their families.\nWhile we all want to solve this case, making allegations based on scanty evidence can create new victims, and that may be why the police aren't sharing every little detail - they don't want some poor sap to be treated like a murderer just because he happened to be caught on camera near a food truck.", "the fact that the killer or killers did not check the rooms in the house means they were not looking to rob otherwise they would have found the 2 other students that were allegedly sleeping. This 100% proves that this attack was personal and targeted!", "Two other people present but they’re not witnesses, nor did they call the cops? WTF!?", "They did not even find a suspect or the killer and yet they saying there’s no threats to the community. Something isn’t adding about this story. So many questions. I think the police or the authorities are not telling us something. Stay safe U of I.", "I remember years ago in Florida (I believe) when a woman was murdered and her two roommates had no idea what happened. The deceased roommate was murdered by a jealous ex-bf/fiancé. They got him by his dropped cigarette butts, Camel Turkish blend which was a rarely purchased brand, laving his dna when he was outside watching, waiting.", "Prayers for the family and all students!", "So sad. RIP to all victims. It’s very puzzling how it happened. I would say, check food truck and workers. Could be that roommates spike their drinks, not necessarily to be alcohol drink. Roommate’s know something. Like I say, it might not come out in the wash but it will come out in the rinse. Be safe everybody.", "Bless that guy for trying his best to say something nice about these poor girls, with whom he had such a small and generic interaction.", "This is what it looks like when criminals no longer fear repercussions from their actions! 0 bail catch and release we know who are responsible for these awful policies that protect criminals at all cost while leaving innocent civilians to pay with their lives!", "Wow door was open!? \nYes if not the other two roommates then it’s someone enraged. Stabbing is an up close and personal horrible act.", "I wonder if its possible that someone who was romantically rejected by one of the girls, but who kept trying and trying eventually built up grudges against other housemates who told the person to get lost or to scram trying to help out their roomate (over a period of time) and then the perp attacked?  Just a random hypothesis here.  Or maybe a city cam somewhere captured their vehicle on the way home, and maybe they were followed.", "I walk the stage to graduate in December. I really hope they have some sort of memorial/moment of silence for those victims. #VandalStrong", "That sounds like a rage of envy towards the victims. I don't know who did it, but whoever did this horrific act seemed extremely envious of the group togetherness and it sounds it was more than one person.", "If they don’t have a suspect… How can they begin to say that there’s no threat to other students or the community? Something definitely is not adding up!! Unless The person that did this is related to law enforcement or something.", "I personally think since they’re all young people, the other two in the house were probably drinking and/or smoking the night before and passed out. Slept in until whenever they woke up late the next morning/early afternoon and called the cops, and do we actually know that more wasn’t said on the call? They said it was an unconscious person but did anyone confirm that the details weren’t mentioned in the call? Also who’s that young man in the bottom left corner of the food truck video in the jersey? Is one of the victims walking towards him? Definitely interested to see how this turns out, I hope they can put it together well and deliver justice on behalf of the victims. RIP ", "3:08 \"Hope they find a person...\" Disclaimer: Trigger Warning Fair, Use Act, USCon1stA, and Gods free will protect my opinion. This case from day one seems to not be alarming as one can expect. Usually there's a massive public outcry to apprehend the supects.Once again, let us keep the victim's families and friends in our thoughts and prayers.  And may truth and justice prevail.", "The police know a lot, and I believe they may have a suspect(s) they are watching. When things make no sense and they don't tell us much it's because they're building a case. Much will come out in the trial that the parents won't even know. I know because I was one of those parents. I had so many other victim's parents reach out to prepare me and support me.", "2:40 - 2:45 you can clearly see that shes stumbling walking back up to the window of the food truck so when I was wondering how somebody could have got them without screaming or anything if they were back at the house drunk passed out then that's how the person made this so-called \"silent attack\" ..... Also Ethan and his girlfriend were at another party so it seems like everybody in the house had some level of intoxication at one level or another that could possibly explain why everybody was caught so off guard... Also when they mentioned the two other roommates being in the home and not being witnesses I believe that they heard the attack going on and hid for as long as they had to we got to remember college town drinking everybody's not thinking straight", "What’s so troubling about this case is the WHY. Like even if it was a crime of passion or an altercation or a domestic disturbance for whatever conflict they got into ….. most people wouldn’t for one stab someone although that does happen sometimes but it’s usually a person on person crime and in the heat of the moment. Now to stab FOUR people in the same night….. seemingly sweet kids who have lots of friends and family that adore them in a safe area…. I just cannot wrap my head around how they could justify wanting to take all of their lives together. To stab one person is horrific but do it in a mass murder type of way …. Like what did young college students do to warrant that!! Even if it’s a psycho ex or stalker Iike ….the target would be attacked and then they would try to flee when they came to not make an even bigger scene or have even more murders to face when they are caught. Like this had to be planned. Whoever did this is a sadistic disturbing dangerous psychopath. It’s terrifying.", "Then WHY did they ever come out and say that the community has nothing to be scared of?! If a suspect is on the loose, WHY would they say something different now?! I'd be livid if I lived there.", "What I don’t understand was..unless they were drunk or drugged or sleeping, how does only ONE person stab four people.  I mean, if you saw your friend being stabbed, you might run to try to help them, and another might run for the phone, you know? But people don’t just STAND there and let themselves be stabbed in turn.  I think it was more than one person unless they were incapacitated already somehow", "Wait a minute there was people at the house when this happened this sounds fishy how does one person control 4 people to be able to kill them", "RIP!! All four Sweet ANGLE'S who gain HEAVEN 'S WINGS way to soon!! I as a mother of 3 beautiful girls, can't even imagine what you as loving parents are going through. Prayers  and ️ love for the families in this terrible time. May God Be With You All!! So sorry for your loss.", "Sadly you don't need to be a rocket scientist to be employed in law enforcement. The fact that law enforcement is a government entity stifles a lot of common sense and imaginative thinking.", "What was the motivation behind the killings. ???.  There is a HUGE threat in that community.", "Extreme intoxication would account for the lack of reaction on the part of the victims and the other roommates. And also explain the delay in notifying authorities.", "This may be silly, but look at 1:54, 2:38, then at 3:10.  The small guy in the upper left quadrant, in the very back top dead center (his head appears just to our left of the blue panel):  hes alone, and first he puts his hat on down low and covers his head with a hoodie; he never takes his eyes off the girl in the white sweatshirt, and AS SOON AS she moves, he moves immediately in the same direction.   Eerie.", "6 people lived in that house. 4 were killed. There has to be a reason 2 were left alone. The only plausible explanation at this point, since the killer(s) didn't break in, is that the victims knew their killer(s). There is more than just a likelihood if the 4 victims knew the murderer, the other 2 roommates knew them too. Only a close associate is going to be allowed inside at a late night hour. It is highly doubtful the doors were left unlocked. It is too much of a habit for people to NOT lock their door when returning home at night, even when intoxicated, especially females.", "I understand the impulse police must feel to reassure the public, but they must resist this impulse when the evidence doesn't support statements of reassurance.", "The murderer needs to be found,  arrested , charged, trialed and imprisoned!!  There ain't no in-between!!  4  students died.  A forensic team needs to go through that house and look for any clue , handprint or DNA they can find.Im surprised that the FBI wasn't involved in this case.", "I'm still left with questions, how do you stab four people without anyone of them making a noise and alerting others, the sheer exhaustion alone to stab one person which I'm sure they fought back as you can during a knife attack ,did they have people over and the knife wielding lunatic drugged them???...too many questions.", "I have a son and two daughters and this scares the living s*** out of me that's why I tell my daughters and my son they need to protect themselves with a gun and they need to learn some sort of MMA self-defense", "I don't see anything weird about the call not being until noon. It's pretty common for college students who have been out the night before to sleep in late. Also, if I heard screams and thuds, I wouldn't necessarily think much about it. Could be drunken shenanigans with screaming and maybe dropping stuff. In university residence I'd hear people screaming but they were just carrying on.", "Prayers for the families ", "They've literally learned nothing. They aren't gonna find the person. Whoever killed them knew what they were doing.", "RIP TO ALL LIVES LOST ", "Something isn't adding up. I understand the police not wanting to release too much info on ongoing cases, but something definitely isn't right.", "Is it separate suites and that is why maybe they never saw blood? How could 2 other people be in the same residence and not hear anything? Even if it was separate suites they would have heard screaming or something walls are thin. Something sounds off.", "God bless the\n families of these beautiful young adults. Shocking this could happen.  Where were campus  police?", "So, no one is speaking on it, You can clearly see that the one with the black jacket is Wasted and stumbling when she walks back to the truck unbalanced, she bumped into the fellas as she walked away, then rudely walked through their circle when she returned, not saying they did anything but there are people who find Rude actions offensive and drunk women vulnerable. ", "This is like a horror film...those poor kids ", "It’s very easy to kill 4 people by one attacker. Two could have been killed then the other two arrive home and are attacked also. I would say  the two room mates that survived didn’t hear the attack and the perpetrator didn’t know they were home.", "I believe the living two roommates heard the entire incident, stayed in the room, FROZEN from fear & then finally called. One of them may have been passing out from exhaustion, fear, panic etc hence the 911 call of an unconscious person. And the fact that these two roommates were STILL in the house when police arrived makes me believe they were locked in the room the entire time & heard everything. Think about it, if you woke up & saw a massacre of this magnitude, you’d run like hell OUT of the house, not stay inside. These roommates heard everything & were frozen until noon with fear. Cops came, found the bodies & the roommates were taken to safety. The cops are protecting these roommates, not releasing their names & even emphasizing they are not witnesses. I believe they are witnesses & the police are keeping them safe as this killer is still out there & now knows there are two living witnesses. If i were the roommates I’d be fearful of this killer coming for me. Living witnesses are never a good thing for a killer. Another note, the cops are very specific on the timeline, between 3-4. They said this BEFORE the autopsy, which usually can narrow down when an injury occurred. But the cops said between 3-4am within 24hrs of the crime. Pretty sure the roommates provided this information.", "Prayers sent so heartbreaking ", "Hats off to KREM being the only outlet that’s covering this. No cable news coverage", "Something really stinks about this. The two roommates who were unharmed know more than they're letting on.", "I don't fault the police chief at all for remaining silent the first few days because of the nature of this crime as well as the logistics of kids going home for the holidays and that sort of thing. I would rather them wait and not compromise the initial part of their investigation then have them say something too soon and risk something on the back end.", "When pretty wealthy people get it: Oh nooo how could this ever possibly happen?!?! \nWhen ugly people get it: I wonder what he did to deserve this?", "There's no threat to the community...oh, we can't guarantee there's not threat to the community, but don't worry. We have it well in hand. It's okay. The murder is not likely to commit many more murders before he's caught.", "\"More excited people.\"  They were out partying.  I went to school in Moscow.  It's such a small place, you never think anything bad could happen.", "Although a wide guess,  could there be a possibility that the two students still alive have played a passive role in getting the others ticked of ??\nThe point why I doubt this is not only why these two were spared death but the bigger point is  \"THE DOORS WERE OPEN\"  which means these two kept it open for the assaulter to have a  free entry??", "about 2 years ago I lived in a 7 bedroom house for I am working away from home … my roomates party all night and are loud but I lock my door and put my headphones in everday .. one of the days I woke up next day finding out they had cops called on for fighting .. I didn’t even hear a thing … the other 2 roommates probably outcasts and kept for themselves/  probably were just used to it …", "I don't think the cops have a clue who the killer(s) is/are ! That's my 2 cents.", "2 other roommates were there when this happened!? I'm kinda thinking there was at least 2 attackers, 1 killer with a knife killing 4 people has got to be almost impossible without someone escaping", "This is very tragic, 4 victims, 2 surviving victims in the house wtf ", "So either someone knew the passcode or it was someone that was staying over or someone that’s been there and had a window unlocked", "This reminds me of the guy in Napa Valley who went in and stabbed up the roommates of his girlfriend bc he thought they were the reason she broke up with him and called off their wedding.", "How are the two other tenants not witnesses? They were there in proximity during the event. They are 100% witnesses, even if they didn't \"see\" anything. Were they in a coma?", "So sorry tohear this. Thoughts and prayers to the family", "Sure , police walking back their statements is exactly what the public needs to feel safe....SMDH", "That fella that puts his hood over his head in the background sure is suspicious… looks like he followed them when they left as well.  What a horrible tragedy", "This reminds me of Danny Rolling who killed the college student at the University of Florida in the 90's. I would look in the woods to see if you can find the weapon or someone camping out there.", "Poor souls.", "Targeted or not, if the suspect is still at large, then the public is definitely under threat.  Obviously, we are not talking about a completely sane individual.", "There is no way, on God’s Green Earth, that two people, however wasted, slept through or didn’t hear FOUR people being chopped up. How did none of the 4 call police? If it was a charnel house as is being described, then SOMEONE would have been awoken.", "You’re telling me nobody screamed therefore the other two roommates who were spared didn’t hear anything? \n\nNope I’m not believing it.", "I live in Lewiston, Id   30 minutes south of Moscow and today 3 armed guys were at LCSC campus today.  Very rare for these parts and people are wondering if it is possibly the same people?!", ",, ,,wait,,what,, 2 other roommates were In the house but didn't hear or see 4 people being murdered ,,,,wtf and didn't call the police til noon,, Suspect is at large but tell the public not to be afraid ,,WHAT IS GOING ON IN THAT PLACE ARE THEY CRAZY", "We are are living in the age of insanity. Let it be said and let it be written. My god.", "They had to all have been in separate rooms, hence no one hearing the murders taking place.\nThis is not the first time the killer has done this, you just don't wake up and kill four people with a knife.", "Sad my son went to grad school there, it's a beautiful city", "wow that's crazy i hope they found out what happened", "So you’re telling me students CAN BE killed by something other than a gun??  wow I’m mind blown!!", "Also crazy when you see someone alive n you know it's their last few hrs on Earth", "LE needs to trust the public and give as much information to the public as they can.  Guess who solves cases…public ", "How can the police say there's no danger to the community when they have four people stabbed to death and no suspect? I think this was all too much for this little police department and that's why the state cops have taken over.", "I feel for the family’s of all the victims……\nAwful to say but \nPolice gotta focus on who was attacked most \nFollow that ", "Some of you need to stop playing internet detectives.  These were college students, that could have been in their room asleep and had headphones on..which is highly likely considering it was the party house. Just like when Jodi Arias killed Travis. His roommate had no idea Travis was dead in his room for days", "Seems like more than one assailant had to be involved. Tge roommates were playing music and couldn't hear anything? That too seems odd that they did not hear anything. Hoping law enforcement can get to the bottom of this horrific crime.", "The manager seems shady...smerk on his face. Shaking his head no while saying I hope they find the person. Something is off. He looks like a creep...the one guy lingering probably is in on it too", "There was a dog in the house the night of the murders. You would think the dog would have started to bark with their keen sense of hearing. Did the two surviving roommates hear the dog bark at all. Is the dog ok? I want to know more about this Jack guy who “was” Kaylee’s boyfriend.", "I live less than a block away from this apartment.  I feel so safe, thanks Moscow PD."]}