{
    "video_id": "5mTHyZqQ-QY",
    "comments": [
        "Wants a gym, but becomes a champion.  I wish we could have seen the Zolts shine more, but it's fine.",
        "Bro is on trending, that's crazy",
        "I love the quote \"its only weird until it works\" i should use it often now",
        "I just finished doing the same thing as a poison type gym leader. I used the same G max form as you and I had the head canon that me and Klara were competing for it.",
        "someone needs to do a every time shock or shocking was said XD",
        "I support Grunty Boi's dream of becoming an elf",
        "Joltik is adorable",
        "Electric type Reggie be like may I please play with you",
        "You went to the Isle of Armor and you didn't grab a Magnemite to use",
        "Can I just say I'm surprised you didn't go for \"Shock and awe\" as a catchphrase for both shocking attacks, awe inspiring battles, and just in general playing pretty aggressively which is the definition of shock and awe fighting",
        "I see you playing the sonic water level music with the water gym ",
        "So you doing this again in Violet? (As there alot of electric type in it",
        "26:42 Michael moment",
        "Mr Michael it’s Released Pokemon Scarlet and Violet",
        "My favoriete type is electric",
        "Looks like we have a new addition to the Mikeyverse",
        "I’m glad this got to #10 ON TRENDING continue the good work",
        "You can use an Eevee to evolve to a Jolteon",
        "I became Galars first flying type gym leader her name is Sheri and when you get her down to her g max corviknight she becomes crazy",
        "9p",
        "Little did he know G-Max Pikachu has perfect IVs. Maybe he would’ve kept it on the squad then.",
        "Only I thought that he was doing to use the exact same team of the 'If i was a gym leader.'' video?\n\n\nR.I.P Pincurchin",
        "7:20 Wow, Pikachu sucks",
        "Lol I was gonna do a run like that",
        "1:45 you can't use thunder wave, but other moves like stun spore and the ability static can. This confused me a lot when using a mudstale in sun and moon",
        "Mikey there is a pokémon rom hack that let's you play as a gym leader",
        "There should be a pokemon game about starting off as a gym trainer and trying to work your way up to Gym leader. You can choose which type of gym it is each time for replay value and explore the region around the gym to get better pokemon to work your way up and battle gym challengers as they come to your gym. That would be really fun.",
        "You know, I've never done a challenge like that before. I think I'll try something like that. \nDoes anyone have recommendations for which type I should use? Right now I'm thinking steel type, but I'm still not quite sure.",
        "How many times are you going to sponsor raid shadow legends",
        "I cannot be the only one here that died laughing at the magic school bus part 4:50",
        "During water type gym Sonic the hedgehog  music I like an electric hedgehog",
        "I beat Leon with chonkachu",
        "“and witness the full glory of CHONKACHU”\n-Mandjtv 2022",
        "3:16 Chonky Boi!",
        "Mikey: Why are you wearing elf ears?\nGrunty Boi: I'm going to be an elf.\n\nMe: U̴͕̠̪͒̈N̸̻̒D̵̹̳̪̈̓͝͝Ḛ̸̤̣̿͘̕R̴̨̼̘̋͑S̵̪͙͇̗̽̿̈́T̶̨̜̤̀̓͊̈Ā̷̫̪͍͂̍N̴̥̾͘D̶̼̫̞͋̃̄̌A̴̧̝͈̐͌B̴̩̯͚̐͒L̷̖̙͍͝͝Ȇ̸͔̺,̷̹̥̭́̌̀ ̵͍͉͆̉Ĥ̵̛̩͒̿A̷͈͋V̴͇̰͙̘͋̒͂̌È̵͙̻̦̬̈́̓ ̶̛͉͇͈͐̚͜Ả̸͔͇͚̿͐ ̷̲̾̉Ģ̶̛̲̫̜̅Ō̶̯͓Ȏ̸̩͇͔͉̀D̷̼͌͒̉ ̸̧̣͍͋́D̶̥̣̞̦̒̓̌A̶̙̺͉͊̈́ͅY̸͓͙͘͜.̷̱̞̇͊",
        "You can get a Vikavolt before the first gym it's crazy",
        "  Because of  love. God sent His Son Jesus Christ to die in our place. Three days later. Rose him  from the dead.   Now. By Jesus Christ alone. God has granted us the free gift of eternal life. He will save and heal you.  If you confess with your mouth the Lord Jesus and believe in your heart that God has raised Him from the dead He'll give you eternal life",
        "Vika volt is an insane early game pokemon I got it before 2nd gym an swept so hard",
        "Next video is going to be on Pokemon scarlet and violet I’m so exited I even got my little sister to try Pokemon for the first time so yeah , and what starter are you all choosing",
        "And here I thought dump truck was for some other reason",
        "Shred is shiny◇□◇◇",
        "Beginning of video I was like, \"You're playing music from the wrong franchise\"",
        "Somebody needs to make into the Mikey verse rom hack. I can already imagine: \"No I am not that Michael ice specialist, I am Mikey the Team Sky leader Master of Rayquaza and ruler of the Sky! And also wich pathetic loser would be an ice specialist?\"",
        "Yeeeesss finally someone respects electric types",
        "I tried to be a poison type gym leader for the Galar region.",
        "it's free real estate",
        "\"It's only weird until it works\"",
        "3:38 these speed clones getting outta hand ️",
        "SHOCK ON!!!!!!!!!!!!!!!!",
        "Just watching his videos makes me realize he would be great with role playing in DnD",
        "Today's sub plug was damn smart and funny",
        "If I had a nickel for everytime Mikey did this meme format, I'd have around 3 nickels which isn't a lot but it's weird that it happened that many times.\np.s - love the semi happy ending",
        "Mikey should play this gym of mine to make a flying gym for team sky",
        "Coperasha is a ground type Pokemon, why",
        "I'm glad Mikey got an Electric hat at least",
        "I don’t use amazon",
        "Mikey as just sitting there, with a monocle, sipping tea, in a box on the street, still without a gym, occasionally shouting \"SHOCK ON!!!\".",
        "You should play pokemon this gym of mine! It's a fan game where you pick a type and run a gym. I think it would make a good video.",
        "Great new video! Been waiting a bit!",
        "I am part of the hoen branch for team sky!!",
        "You should do a playthrough video/series of a sinnoh game with the team from your \"If I was the Sinnoh Champion\" video. I think that would be really cool.",
        "That first Chonkacku made me laugh far more than it should have! Great video.",
        "I find it funny that this version of Mikey would just be team sky Miley's worst nightmare",
        "I love your content sm, and it's always entertaining. i hv caught covid again and I'm glad I have your content to keep me entertained  through isolation. can't wait for your next post!! :D",
        "Another Mikey form added to the list",
        "Bro plugged the chanel so well that I subbed that I usually don’t do",
        "I really like your electric type team.",
        "Sorry Grunty Boy, high elves aren't exactly known for accepting others into their society.",
        "I love how it's known that Mikey hates Nuzlocks, but technically these playthrough do count. They aren't traditional nuzlocks, but restricting yourself to certain pokemon types does kinda count.\n\nKeep up the amazing videos mikey!",
        "I hope grunty bois (boys) dreams of becoming an elf and being accepted into an elven society comes true.",
        "This video is so quotable! \"I'm gonna be an elf!\" \"SHOCK ON!!\" \"YOU CAN'T STOP THE STUN SHOCK!!\" The latter two really seem like something a Galar Gym Leader would cheer!",
        "You're a real tough cookie\nWith a long history\nOf breaking little hearts like the one in me\nThat's okay, lets see how you do it",
        "Pikachu sad",
        "Is anyone else just happy Mikey finally gets to use a Lanturn in a play through?",
        "WHO ELSE SAY THE FIRE MYTYE IN THE BACKGROUND",
        "I love how every type Mikey role plays he loves that type and hates every other type",
        "Guys I think Grunty Boi is going to be an elf",
        "MandJTV and the Multiverse of Mikey",
        "Team Sky's natural enemy is this electric gym leader.",
        "I respect the nicknames but the best nickname for any electric type that has the move Nuzzle, is “Nuzzle UwU”",
        "the fact he named dracozolt dumptruck is the best form of  accidental comedy",
        "It’s clear that electric is the best type because those it’s powered up the this video into a shocking 10th place on trending, that surge of power must’ve shocked the competition! Shock on! Mikey!",
        "3:13",
        "For anyone wondering, Mickey Mouse said \"shock\" in some form 18 times.",
        "Your personality is shocking ahahah",
        "rillaboom is coming out let me switch out my ice type on a grass type 30:30\nps i am not trying to be hurtful i'am just trying to be funny",
        "Chonkachu",
        "#7 on trending!!!!!",
        "the vid is really long but you should react to jhonstones shiny prof oak playthrough",
        "Ooooooh, if Team Sky Michael will meet Thunder Michael they will surely create a new opposite duo, like Archie and Maxxie",
        "I’m sick and I’m home and watching him feels better",
        "We need crossover of mickeyverse of maddness",
        "u know u couldve gotten jolteon... instead of pika",
        "jojo reference maximummm overdrivveee",
        "Dude Galar's story was ass",
        "Bitbit has a higher sp attack stat than lugia",
        "Hey did you know there is a pokemon fanfare called pokemon this gym of mine where you can be a gym leader of any type",
        "Also must use Butterfree for the whole time",
        "I will now officially only call Hop \"Hoppleton\"",
        "I'm proud for how far Jaiden has become, from storytime telling animator and gamer and now as a Subathon, this is the best thing we'll ever get of Jaiden doing something awesome for us all",
        "I’m doing a team sky play through",
        "Thanks for the link it helped a LOT",
        "Mikey what's your thoughts on the stories coming out that pokemon may move on from ash's story and give us another protagonist in the anime? Or are they just troll reports?",
        "these speed clones bruh 3:37",
        "Hello I’m the leader and solo member of team thunder ️ and I would like to talk to you about perhaps joining my evil team so what do you say",
        "chonkachu is amazing",
        "Install Raid for Free  Mobile and PC: https://clik.cc/S90qp and get a special starter pack  Available only for the next 30 days\n\nalso if you remember me designing myself as an Electric Galar gym leader in that video on my other channel years ago, then thanks for sticking around long enough to remember that! you should sub to this channel in addition to the other one :)",
        "11:17 ",
        "Mikey: receives an Eevee\n\"ugh\"\nJolteon: Am I a joke to you?",
        "team sky, electric gym leader I'm starting to see a pattern here.",
        "“I don’t want to go nappy byes” ",
        "I think Michael should make a video on what our teams for scarlet and violet are on the Pokémon we know that are in the game.",
        "I am convinced the line of electric gym leader Micheal is “im gonna leave you in shock and awe!”",
        "Fun fact: the name 'Dumptruck' is from an aspitipiay episode of where someone referenced pixar moms to arcozolt's fat dumpy",
        "When he said that he was gonna be an elf. I thought it was Christmas related",
        "Has team sky come to Galar?",
        "Electric gym leader mikey will be the nemesis of the Team Sky!",
        "now I’m thinking of being the 1st flying type leader in galar..",
        "I'm impressed he's doing a monotype run of this! I have two playthroughs that I've called Duo-type runs. Both of my protagonists for these runs are siblings that aspire to be gym leaders that specialise in multiple types. One called Ashleigh who specialises in Flying types and Steel types and the other called Ricky who uses Electric types and Ground types!",
        "8:33  ???",
        "HaHA! It is I Ga-runty Elf!",
        "Fun facts no 121 is voltorb pokedex number in kantodex",
        "Your next video is for Scarlet, right? I'm getting it on Friday too and I can't wait!!",
        "Imagine a pokemòn game were you could actually run a gym though.",
        "Mikey be like i will prove that lightning is better than fire then proceeds to use water.",
        "Chonka - Chuuuuu !!!!",
        "OOOOOZZZZZZZZZZZZZZZZEEEEEEEEEEEEEEEEEEE!!!!!!!!!!!!!",
        "I loved the animal crossing voice phone call",
        "Anyone else think Mikey shoulda used the Thunder Stone on Eevee? Jolteon",
        "I can watch Mickey for 5 hours at a time and not get  board his story telling IS AMAZING",
        "All these years later Vanoss is still making great content. Love you Vanoss!",
        "1.21 gigawatts was such an awesome pull for a number",
        "24:36 Fun fact: Grimmsnarl is based on faeries from scottish folklore, and in contrast to the more modern depiction of fairies being good natured, Fae were notorious for being chaotic and playing malicious pranks on people which is similar to an imp. Thats why grimmsnarl is a fairy despite also being a straight up demon",
        "1.21 GIGAWATTS? Nice reference",
        "Mikey finally uses a Lanturn!\nThe video was good even at the first 2 seconds of the video.",
        "Didn't expect Treasure Trove Cove, but I am happy.",
        "“Someone’s 3D printing really messed up.” I’m ",
        "After playing through some scarlet and violet, this video really makes me miss sword and shield. They look so much than the new games",
        "Make a video that The Pokémon book decides your team!!!!!!!!!!",
        "He says why do you have two fire pokemon him has 6 electric types on his team",
        "Petition to clip “YES, THE BABY” when toxel evolves",
        "27:52\nI understood that reference.",
        "Sure would be a shame if a bot replies to this comment",
        "I laughed so hard when he said and becomes a bus! It was even better when he played the Magic School Bus theme.",
        "Pictures did this for one more video of sword and shield because skull and violet is coming out in a few days",
        "when are u going to do a play through of Pokemon scarlet and violet",
        "How could grunty boy be stinky if he uses dr squatch?",
        "Hey Mikey I always wanted you to do a play through of team sky  in kalos can you do it?",
        "i have to say, i have laughed, hard, everytime at the magic schoolbus joke. gets me everytime!",
        "I love how almost the first four hours of the game are completely skipped over",
        "You just have to throw your first champion battle. Then you won’t be the champion and they’ll know you’re good enough to have a gym",
        "Idea. you as a electric gym leader to get to you in the building is a bike courses with ramps and water obstacle. I got the idea because of the rotom bike",
        "Why did that guy give him a Pikachu and an Eevee and he gave Mikey a Eevee first? Is it something about let's go?",
        "I’m so happy he did another one of these !!! His I played Pokémon as / his team sky videos are my favorite ones to watch and rewatch ! Keep it up Mikey !!",
        "When you're (approximately) the same height as Toxtricity ",
        "During this video I encountered a Miltank in Pokémon go and it was shiny. Wow. The fact you hate miltank too is insane. I wasn’t even hunting",
        "5:32 OoOrcs",
        "Is team sky making a return?",
        "3:19 P E E\nI also like how he put Chemical Plant into the Water Gym. Chemical Plant is the second zone in Sonic 2, the Water Gym is the second gym in Sword and Shield.",
        "As an electric type connoisseur myself. I am quite honored that you named your Electrike after me.",
        "Imagine thinking that you could become a gym leader just because of your sub count. He he…he……ah",
        "Black sludge toxtricity is so damn good",
        "Mikey should have gotten Regieleki",
        "What do you wanna be when you grow up?\n\n5:00",
        "You should have seen Falkro's video of him playing Pokemon Shield as a Steel Gym Leader",
        "My S and S Gym would be a flying type gym",
        "I'm with you on the type emblems Mikey, should have let us pick one to rep!",
        "I loved the Phineas and Ferb reference did anyone also notice it",
        "Dioge could be a pokemon name",
        "I did this challenge a little while okay as I am doing a run of sword or shield with every type. Electric didn’t have the most diverse option so I ended up going with \nOrion the Luxray \nSet the Manetric ",
        "Good video but I feel you didn’t use Dracozolt at all. I feel if you’re not gonna use Dracozolt, you might as well cut him and replace him with Lanturn or G-Max Pikachu or something.",
        "PLEASE TELL GRUNTY BOI THAT I HAVE THE SAME EARS!!!!",
        "I swear I thought he already made this video",
        "Why not light ball chonkachu?",
        "You could have got regeleck if you wanted to.",
        "20:50 Nepotism? Pokemon? Never? (*cough* Janine)",
        "Get him to 1mil",
        "3:38 these speed clones bruh ",
        "I was in school when this was posted",
        "I’m doing my own play through of Pokémon Shield as a ground type gym leader so I could/probably beat you one Pokémon is Dugtrio my lead but not the ace",
        "You are so funny ",
        "Team Sky Leader is shaking right now",
        "Who else noticed the fire Mytey",
        "You have more patience then me try to get that one pokemon for an run",
        "NO JOLTEON!!!!!!!!!!",
        "Finally, been waiting since the \"what pokemon gym leader  I would be\"",
        "Mikey forgot about magnezone",
        "\"*I'm so scary don't hurt me* Just kidding dumb bird you're dead\"\n\"It was boosted by punk rock!\"",
        "Now we need Electric Gym leader vs Team Sky",
        "\"This is a lot, I just wanted to be a gym leader, now I'm fighting a hand with pointy dogs\" lmfao",
        "\"Its only weird until it works\" -Grunty boi. is such a good quote",
        "Love this video is super affective to TEAM SKY",
        "\"Chonkachu\" I'm gonna start saying \"chonkachu\" every time I see a dynamax pikachu lol",
        "2:40 well, guess now we’d know how Iono would get to the major leagues if she was in Galar",
        "I am covinced Mikey’s made this as an excuse to use gigantamax toxtricity",
        "Mikey the man!!!!",
        "The Charjabug over the Magic School Bus just made my day. Thank you for that!",
        " love the Phineas and Ferb reference",
        "Grunty Boy isn’t stinky! He uses Dr. Squatch!",
        "So ready for Scarlet and Violet. ️",
        "BTTF Is my Favorit movie ",
        "oh wow this was 9 hours ago ",
        "I love that Katie really doesn't even have to do anything to make Mikey look sus, he does it to himself.",
        "ELETRIC BEST TYPE",
        "The uniform doesn't make any sense u buy the one u like but can't wear it in the gym battles",
        "I started this challenge 3 weeks ago, and have been lazy about continuing it, even though I have 5 Gym Badges already…\n\nAnyways, my first encounter, it was a Grubbin too, was SHINY!! I smiled for like… hours after that, having a good feeling about the run in general.",
        "I think it's cool how I was playing pokemon sword and I had caught a Gigantamax and I said I would become the electric type gym and right after this happened XD",
        "I wonder what a meeting between this Electric Gym Leader Mikey and Team Sky Mikey would be like. Team Sky would hate this guy’s guts",
        "this was very fun well your vids usually are especially these special playtrough rounds",
        "I did a run as a steel type",
        "3:38 bro we got a Poketuber IShowSpeed now ",
        "\"It it now a bus\"\n\"CRUSING DOWN ON MAIN STREET\"",
        "for once he allows himself to use dynamax, and he instantly loses a Pokémon on the first use. now I see why he didn't in previous challenges. also because he hasnt done a gen 8 challenge for like what 2 years?",
        "Mikey... sigh. I love the little bits at the end. The being on with the Pokemon Services Hotline is a fun little bit. And The fact that you did the Electric Type Gym run in Sword/Shield was really cool. Bravo.",
        "What's the music at 15:46",
        "I love that mikey tells stories in his playthroughs instead of just “electric monotype run”",
        "Jet where did you get the max mushrooms",
        "Chonkkachu best name ever",
        "Play pet fighting simulator on Roblox.\n\n- you can only have one potion, but you can refill it.",
        "13:12 mikey just made the o's sound cooler on my 2 fav mons krookodile and pangoro",
        "Hoenn - Grass\nKalos - Dark\nUnova - Bug\nAlola - Ice ",
        "Mikey’s love for Shred perfectly demonstrates my love for my own Toxtricity, Latifah. What caused Toxtricity to become my favorite Pokémon is because of Latifah defeating Leon’s charizard after a good majority of my team were taken down by it. Now I just have mad respect for her and can’t wait to use another Toxtricity in Pokémon Scarlet.",
        "So glad toxtricity is getting shine. It’s my favorite gen 8 mon ️",
        "Another personality to add to the Mikey crew",
        "Can't wait for new \"I am a gym leader/ team...\" in the gen 9 ",
        "We now have to call him Battery",
        "Mikey saw a ground type and was quaking in his heavy duty boots",
        "New impossible challenge take a shot everytime Mike Say shoking",
        "You are worthy I knew it",
        "Electric type is the best",
        "The ultimate enemy of team sky",
        "The \"famous gym leaders\" plug reminds me of the electric scarlet and violet streamer gym leader. Are you siblings?",
        "These runs are just mono type story mode.",
        "I have to say, the art in the beginning of the electric Gym leader is absolute FIRE",
        "He finally did a electric playthrough let's gooo, (unless I didn't notice he made one back then)",
        "WHERE IS THE DIGGING PA",
        "Can you please do team sky in scarlet & violet",
        "Thanks Mikey I’ve been off sick so this has cheered me up",
        "What starter are you picking for scarlet and violet",
        "this is the dest love your vids i hap i can de like yuo wen am allder",
        "When he said if I got a nickel every time my bug fought another bug at the start of a battle I would have 2 nickels which isn’t a lot but it’s weird it happened twice is a copy of Shiloh and bros but he slightly changed the middle part",
        "Umm I’m the leader of team power so no electricity team sky",
        "I respect this",
        "4:53 now that was pure and unrivaled nostalgia",
        "Mikey is showing only female raid shadow characters. Something is going on.",
        "\"I'm gonna be an elf!\" That got me.",
        "You got evee from the boy and you got pikachu from the girl.",
        "Lets be honest, mikey didn't name Dracozolt Dumptruc because he found it in the ground...",
        "mikey",
        "Grunty boy going “I’m going to be a elf” is hysterical although I do agree that elves are pretty cool but I think I like durids more something about elemental magic is so cool to me",
        "I requested for this video months ago.",
        "Vikavolt vs Eelektross?",
        "I havent watched Your videos in a while glad to know that youre still making these fun and cute vids =(",
        "When Kratos yelled out BOY!! I knew Atreus royally fucked up because at the end of God of War 2018, Kratos went through a journey with his son where he learned to trust, rely and even move forward to calling his own son, son, insinuating that hes finally ready to be a father not just a mentor him calling Atreus boy again just feels like such a huge step backwards for the both of them",
        "Michael is just galar iono",
        "I imagine myself being a steel type gym leader",
        "Mikey turned into Kratos at 16:38 lol",
        "5:19 Grante boy is very high on the elf magic he’s also a bit addicted",
        "I have never seen a SwSh playthrough that kept me as entertained as this. I love your style of playing, and it's honestly inspired me to do my own \"gym leader\" runs.",
        "It's only weird until it works.\n                                        -Grunty Boi 2022",
        "12:47 \"I'm naming it Dumptruck, because I had to dig through a lot of dirt to get it\"\nMe, an MandJTV connoisseur: I see through the lies of the Jedi",
        "Mikey when he fights haxorus: Charm\n\nMickey fighting any hard hitting physical attacker: Charm",
        "Awesome content! Good way to give Sword and Shield a send off as well!\n\n\n\nAlso, I feel like that Grunty Boi segment is prime meme material. “It’s only weird until it works” is a great line.",
        "clearly not, meant to be a gym leader here, anyways here's my guitar\ngold",
        "I love how you changed the subscribe animation to fit with the new sub button",
        "New challenge: Take a shot whenever he says SHOCKING!",
        "Mikey: \"...but it's weird that it happened twice.\"\nMe: \"If I had a nickel for every time Michael made this reference, well I'd have 2 nickels. Which isn't a lot but it's weird that it happened twice.\"",
        "Who can get more lost zoro or leon",
        "Team YELLow like yellow electrisity",
        "4:45 got me.\n\nMy childhood backstabbed me",
        "I hope in scarlet and violet they actually add a way for you to make a minor league gym",
        "You know, funny enough, I actually did my own Electric playthrough team this year, and my final squad was Alolan Raichu, Jolteon, Rotom, Luxray, a shiny Electivire, and Amped Up Toxtricity with G Max Factor as the ace.",
        "The next sponsor is going to be Dr. Squatch isn't it.",
        "28:26\nmichael uses a pokemon 4X weak to ground and is surprised it dies",
        "Decided do flying type gym leader run in sword after watching this i think corviknight may sweep 4 gyms xD",
        "The tiny bug",
        "Can I be honest I have watched your channel for years and I must say out of all creators you are the BEST",
        "12:45 He called it in the New Pokemon Games Meme Review. He said that he was going to name a dracozolt dump truck.",
        "I'm gonna become galar's first ever steel type gym leader",
        "Milo saying \"this'll really leave you in shock and awe\" at 3:29 and you can't tell me he didnt say that on purpose",
        "Chonkachu!!! That made me laugh",
        "Haven’t watched the video yet but if you don’t name a Yamper doge coin I’m goin to die",
        "7:04 The Giant Enemy Tortoise!",
        "How can grunty boy be stinky if he uses DOCTOR SQUATCH",
        "Hey Michael it's nice to have you back, I hope that the break you took helped you recover from the stress we put you under. I hope you continue making this content we love but most importantly you love while taking care of yourself",
        "You should try playing “Pokémon this gym of mine” as team sky",
        "Does this mean your rival has the jersey number 420 and is a new and upcoming fire gym leader?",
        "The yes list:\nWatch content-yes\nSubscribe-yes\nLike video-yes",
        "Mikey should have chosen scorbunny so the Leon would have inteleon",
        "Mikey is always amazing when it comes to making videos ",
        "I was dying of laughter all video thanks mandjtv",
        "\"Because you're stinky\", clearly not a dr squatch sponsorship",
        "The lightning gym leader with team sky after they learn that any Pokémon can become any type with Tara form",
        "I noticed you're wearing a \"Coffee, it's super-effective\" shirt. Is that a reference to your Types Stereotypes video where the electric guy is asked if he's considered decaf?",
        "Mikey: Why are u wearing elveears?\nGrund boy: I´M GONNA BE AN ELVE!!!",
        "Raboot is the best starter EVER, or at least in Galar",
        "Once you've done 8 of these you should get some of your friends to take on your gym leader teams",
        "Omg the Goldeen joke ",
        "wondering if toxtricity actually used its arse ooze\n\nonly the real mvps get that reference lol",
        "Somebody, please do a Grunty Boi out-of-context video.",
        "I wonder who would win.... the electric gym leader or the leader of team Sky...?",
        "I wonder how many times Mikey said SHOCK",
        "Goddamit that was a good plug to subscribe just before the 1st gym",
        "Team voltage is happy",
        "Through back to aspitipiay where Mikey saw a meme about Pixar moms and promised to name a drakozolt dumptruck, he is honest as is dedicated.",
        "\"i'm going to be an elf\"",
        "The Glory of chonkachu. I spat my water out and couldn't stop laughing",
        "I love how he always makes his entire personality being based on just an over-the-top obsession with the type",
        "I just did a electric Type run in Sword too and defeated Leon today. So this came at the perfect time!!",
        "ELECTRIC POWER!",
        "OMG THIS REMINDS ME OF THAT ONE VIDEO “IF I WAS A GYM LEADER”",
        "Mikey \"gym leaders are pro athletes\" Gordi",
        "Micle is grunty boy",
        "Anyone else thought that Grunty Boi’s bit was that he didn’t know that Halloween was over ",
        "I beat Pokemon as a...(fill in the blank)",
        "I was the frist",
        "Hmmm Kabus arcanine looks a bit weird",
        "“Oh annnd…”\n3 long seconds of awkward silence\nboko pops\nvideo end/loops",
        "Props to Mickey for playing through the entire Isle's of Armor for a 10 seconds clip!",
        "shocking",
        "Can't wait for more Gym leader-type videos for other regions :D",
        "Phineas and ferb joke",
        "I just did a team sky run of legendes arceus",
        "I thought he was going to say “But I have asthma.” Instead of “But I have aspirations.”",
        "Hopelton hhahahah",
        "One thing i liked about isle of armor dlc is i could gigtamax my starter very early with max soup",
        "He actually went through with naming a dracozolt dump truck",
        "\"Its only weird till it works\" i mean he has a point",
        "I got vicovolt before the first gym",
        "Man dj tv",
        "Electro type only run in legends arcehs",
        "We gonna talk about he just skipped the entirety of the intro to the isle of armor and then just came back to fight Opal",
        "This is probably the best mototype run mikey has ever done! \n10/10",
        "I was waiting for this",
        "barkler should have been sbarkler",
        "He has groundaphobia",
        "Normally I don’t comment but I enjoyed the back to the future reference, clever.",
        "ARE WE JUST NOT GONNA TALK ABOUT POKEMON SCARLET AND VIOLET COMING OUT IN 2 DAYS",
        "1.21",
        "The first playthrough that lanturn was used till the 8th gym of Mikey's playthrough challenges (sadly replaced for rotom)",
        "Why don’t u do a nuzlock or yea forgot u like to have fun",
        "Watching Mikey’s other game and challenges because My parents won’t get me scarlet and violet until Christmas",
        "Pokemon gen 9 s/v has came out!",
        "Look my rotom is an oven\n\n-Michael Michael growth",
        "Mikey: \"I'm calling it Dioge. \"\n\nMe *to myself*: \"don't say it. \"",
        "NOOOOO YOU BETRAYED TEAM SKYYYY",
        "If I am not wrong, Mikey used Giovanni's theme from Pokemon Masters EX when he was battling chairman Rose. I find that music cool.",
        "I hated nessa because her stupid pelipepper kept spamming Roost Aaaahbhhhhhh",
        "I’ve always wanted u to be this concept! Thx for finally granting my wishes!",
        "I like to think the Zolts are the ancestors of Pikachu and the Pika Clones",
        "I WAS THE ELECTRIC GYM LEADER",
        "I did it but with steel types my main Pokémon was a lucario",
        "Ah yes another alter ego",
        "Have u played poképark wii?",
        "Its over 30:00 minutes long?!",
        "The music you use in these vids are amazing",
        "Thousands of tears later gets me every time",
        "How long do you think Mikey was waiting to say ROCK/SHOCK ON!!! with Toxtricity?",
        "Grunty Boy saying I’m gonna be an elf was surprisingly unnerving.",
        "Vikavolt just murdering everyone lol. He ended as my starter in my bug only run and had the same results. Hes a beast.",
        "Not a whole lot of people that originated as a meme go on to remain so successful and get even more popular. It's been a fantastic trip seeing this channel grow more and more, and it never ceases to amaze me how a community can be so cursed and so wholesome at the same time. Doing fantastic work man, keep it up o7",
        "Can we just congratulate Mikey for acting like he hasn't played the game at all but he has.  Mikey deserves an actor award",
        "I spy a fire Mytey!",
        "teams sky's enemy omg",
        "Pikachu time",
        "Kind of poetic he finished with his starter love the vid ",
        "I love how you carried over the idea you had in an older video into a playthrough of the game!\n\nI also did a full electric type playthrough of Pokemon Sword and it was pretty fun, the electric type is my favourite type and this video was a great way to represent it.",
        "USE THUNDER STONE ON EEVEE",
        "Whenever I see Mikey do these Gym Leader videos, it makes me want to see him play the ROM hack This Gym of Mine when you can actually are a gym leader",
        "I knew I should have gone for the turbo",
        "That start reminded me of my custom nuzlocke challenge. I had to start with a tiny bug and tiny dog too.",
        "High Elves? Who's their supplier?",
        "The cooler Iono.",
        "Casually saying a phineus and ferb reference",
        "Michael, you're my favorite Youtuber! Please be my friend!?",
        "I got a question for the new gen 9 Pokémon games can you get all all of the starter Pokémon from everyday generation of games and can you get all the mythical Pokemon in Scarlet and violet from Pokémon home and in the Pokémon games can you please make a YouTube video about this",
        "Legend says that up to this day, Mikey still hasn't figured out that he had applied for the wrong gym challenge. Because the \"Gym leader tryouts\" were all the way back in June.",
        "3:37 these speed clones man",
        "I was actually thinking that this run would come out because in your What if I was a Pokemon gym leader video you said grass or electric and we already have the grass type video so it was only a mater of time until this video came out",
        "Someone shared a fun challenge that I'm excited to try for Scarlet and I would love to see you do it, it's an Avatar Pokémon Challenge. You pick one of the Four Nations and you can use only four specified Types also Normal and Bug as long as they don't have a second type outside your Types.",
        "If I was you I was of chose the jersey number 456",
        "How do I join team Sky?  (:",
        "How does he only have like 750K-800K subs?!",
        "This is quite possibly the funniest grunty boi segment ever. His \"I'm gonna be an elf!\" Was glorious",
        "scarlet and violet are out  when  are  going to play it .",
        "Left a like exclusively for the BotW cooking SFX. You touched my heart today, brother.",
        "Bro realized that ue couldn't be a gym leader after he beat the champion......",
        "I have to say, I LOVE your music choice here to really lean into the Toxtricity vibe.",
        "Anyways here’s my guitar -Mandjtv 2022",
        "Fossils! Da da daaa!",
        "Thank you I was wondering if he would be an electric ️ type",
        "Ending is best️",
        "3:19 ️",
        "Defeats goldean \"Time to flush it\"\nWow",
        "The way he said, “I’m gunna be be an elf!” was hilarious ",
        "Yo can mikey become the first gym leader in hisuie",
        "Just 9 more generations until we can have a mikey specialising in every type from a different region XD (or 8 if we count hisui)",
        "What if ash went back to kanto and got primeape",
        "Grunty Boi : i gonna be  a elf Me : me too grunty boi",
        "“STRIKE IT DOWN!!!” So violent",
        "Been waiting for this vid for ages and you never fail to entertain me",
        "mikey should be a water gym leader next time just so he can spam \"take this wetness. dead\" over and over",
        "Grunty Boy OOC: I’m gonna be an elf",
        "I really enjoyed this episode.  I know the battle as X gym leader are a lot of work, but it was a treat.",
        "I can almost guarantee the the end of the promo wasn’t scripted \nEven if it was, I’m choosing not to believe it",
        "There is nothing in this world more worrying than grunty boi popping on screen with elf ears and responding \"I'm gonna be an elf!\" With absolutely no context whatsoever.",
        "i love your videos you are easy one of my favorite youtuber but you are my favorite poketuber",
        "Hey Mikey you should give Pokemon this gym of mine a try. You could finally become the gym leader you are destined to be.",
        "It's nice that you doing a sword video when scarlet and violet gonna came out",
        "New team name  the ground haters",
        "Michael what would your badge be called???? PLEASE BE THE GIGAWATT BADGE",
        "Me and my friend did something similar to this but we were a member of a team called team zap. And that was like a year ago.",
        "Why isn't this in the main channel? This is great!",
        "The amount of “shocking’ jokes are just… shocking",
        "My day Immediately gets better when he uploads",
        "Sadly he did not use his team he made in his video about being a Galar gym leader.",
        "Can't believe 8 people disliked this. ",
        "This is a disgrace to Team Sky. Why Mikey? Why?",
        "20 on trendijng?? thats amazing mikey congrats best wishes for the future",
        "theres a rom hack for gym leaders, i dont know whats its called though",
        "Maybe Barkler was the real ace",
        "28:31 wow imagine ohko-ing a giant lightning rod rockstar lizard only to be taken down by a microwave oven that had the temp on too high",
        "did someone noticed the phinias and ferb refrenca at 27:53?",
        "Congrats on making it to trending!",
        "i wonder if soon after SV release he will do a team sky challenge.(speaking of team sky i currently doing  team sky grunt run on swsh)",
        "I’ve been waiting for this one!!!!! Great play through to end off gen 8",
        "10:15 lowkey forgot about that song",
        "I created a evil electric type team in galar",
        "Me: sees how fun Mikey’s challenges are\n\nAlso me:Fine I’ll do it myself",
        "I was the guy who hit the symbol",
        "\"it's only weird until it works\"~Grunty Boi 2022",
        "6:56",
        "Just got a full odds shiny starly in my third play through of brilliant Diamond. After I got out of jubilife for the first time I got it and I’m so happy. It’s my first full odds",
        "Team Thunder?",
        "3:16 CHONKACHUUUUU",
        "I did Dragon type gym leader a few months ago as my last playthrough of Sword. Was a little harder then normal in some cases. (All shiny team :P)",
        "Bruh mandjtv using sonic songs like speed highway, chemical plant, crisis city, rooftop run, level select (sonic heroes),",
        "ALL HAIL CHONGKACHU",
        "Could’ve evolved the eevee into jolteon",
        "Mikey if you see this you should play pokemon this gym of mine it's a game in the style of black 2 and white 2 where your a gym leader",
        "3:38 I show Mickey",
        "YAy",
        "Theres a fangame called this gym of mine where you have youre own gym of any type",
        "XD it’s my ooze",
        "I remember the first time I played this game and half of my team was electric from the 2nd gym to the 7th gym",
        "You're always so fun to watch Mikey ",
        "Have you heard of the High Elves?",
        "Literally laughed out loud at Grunty Boy’s “I’m gonna be an elf.”",
        "Finally I've been waiting for this",
        "Because my favourite pokemon is melmetal",
        "The fact that he didn't get the electric style hat or glasses is so triggering",
        "I like to think of this as he becomes a gym leader, but one in the minor league.",
        "Something I've always enjoyed about these character playthroughs is they do feel like individual characters, even if they're all just Michael having fun.",
        "I know these thematic, quick playthroughs are probably a ton of work for a comparatively short video, but I just wanted to say that I love them!",
        "Let’s go! You always manage to make even these typical challenges super entertaining!",
        "28:27 I WILL BURN YOUR STUPID ELEPHANT.",
        "let dreams come true",
        "Hapy BDay Mickey",
        "Your catchphrase should be “ looks like you ran out of battery”",
        "You can see how much fun he had doing this run. I really enjoyed this one.",
        "Is this team spark ️",
        "First: good video\nSecond: why did tazer not have thunder wave\nThird: At 28:19, Shred got shredded",
        "“I’m feeling cocky and shocky” is now my new favorite MandJTV quote",
        "man that throw back to the back to the future movie was heavy",
        "Bowser's Theme suits Raihan so much",
        "My poison type playthrew of this game will remain one of my favorites. I was pretending I was training to take over the fairy gym",
        "I think this is Mikey cosplaying as iono in galar",
        "Inverted MandJTV hats soon to be on sale - Yellow with a blue M.  Coz Yellow is Electric gym",
        "That's not team sky... that is... team... erm... anti-sky... :-P",
        "Gosh back to the future is a strange movie",
        "19:30\nMakes me laugh every time I repeated it",
        "I love how Let's Dance Boys is playing during Opal's fight makes me happy as a Bayonetta fan",
        "I know it's not the best, but I did love using Bolthund in Sword.",
        "Yellow team",
        "Team sky would be scared as heck if they were to meet electric gym leader Mikey",
        "\"I'm gonna be an elf \"\nGrunty Boy, no️",
        "Has anyone else noticed that running isn’t really running in Pokémon so much as just a speed up button? I mean, all of the trainers move faster with you",
        "Remember Feast-A-Max",
        "I prefer to call it \"Pikachonk\"",
        "Oh hey, Grunty Boi i have the same elf ears as you guys ",
        "I hope in the next ad grunty boi still has one elf ear",
        "You should go to the Renaissance fair in Louisiana. It is very fun, and you can wear the elves ears more, and no one will judge you.",
        "the travesty that he can't use ampharos. Can't wait to finally use them again next gen.",
        "Wow, you hear a lot of rumors. Must be quite the gossip.",
        "Sword and Shield are just THE BEST for this kind of monotype runs! I did Shield with only Ground types and it got BRUTAL at times! I had to keep a Nincada (overleveled) on my team to contend with Hop's Rillaboom!",
        "Should have said,” SHOCK AND AWE”",
        "“He looks like a steel type gym leader!”\nPeony: am I a joke to you?",
        "He sound like steven he",
        "Finally! He plays as an electric type gym leader! I have waited so long for this, thinking I would have to do this first, but he Finally does it! Great video!",
        "I like how he used yellow joy cons to further show that he is the electric gym leader",
        "mikey why must you do this to me? i'm starting an art project that is basically just me redrawing your gym leader/evil team leader characters as sprites from pokemon insurgence.\n\ni thought i had found them all but you drop this.",
        "DRINK DA SOUP",
        "He should've unlocked toxtricity's gigantamax after the fairy gym so he couldn't use it against the dark gym XD",
        "Pikachu = kaminari =lightning =something from the sky = falling from the sky = pokemon legends arceus = mikey in pokemon legends arceus but he is team sky .",
        "Ok is there a special\nThing to do to get that form of Toxicertry (I know that’s not how you spell it) because I always get the bass form",
        "not the ooze",
        "I wonder what Electric Gym leader Mikey would think of Iono",
        "If he does my team would be Skeledirge, Frigaraf, Cyclizar, Ceruledge, Creavard and Cetitan or Klawf.",
        "Can you do pokemon scarlate and voilet gameplay",
        "Grunty boi is still my favorite part of the video. Can we get a compilation of all grunty boi's best moments?"
    ],
    "comments_disabled": false
}