{"video_id": "5mTHyZqQ-QY", "comments": ["Install Raid for Free  Mobile and PC: https://clik.cc/S90qp and get a special starter pack  Available only for the next 30 days\n\nalso if you remember me designing myself as an Electric Galar gym leader in that video on my other channel years ago, then thanks for sticking around long enough to remember that! you should sub to this channel in addition to the other one :)", "I love that mikey tells stories in his playthroughs instead of just “electric monotype run”", "This video made me really wish we could see all of the minor league leaders that didn't cut the gym challenge in the games. After Klara and Avery, this concept should have been worked upon more.", "Something I've always enjoyed about these character playthroughs is they do feel like individual characters, even if they're all just Michael having fun.", "24:36 Fun fact: Grimmsnarl is based on faeries from scottish folklore, and in contrast to the more modern depiction of fairies being good natured, Fae were notorious for being chaotic and playing malicious pranks on people which is similar to an imp. Thats why grimmsnarl is a fairy despite also being a straight up demon", "Not a whole lot of people that originated as a meme go on to remain so successful and get even more popular. It's been a fantastic trip seeing this channel grow more and more, and it never ceases to amaze me how a community can be so cursed and so wholesome at the same time. Doing fantastic work man, keep it up o7", "This video is so quotable! \"I'm gonna be an elf!\" \"SHOCK ON!!\" \"YOU CAN'T STOP THE STUN SHOCK!!\" The latter two really seem like something a Galar Gym Leader would cheer!", "Today happens to be Sword and Shield’s 3 year anniversary. Can’t believe it’s been 3 years. This game had a lot of faults but it was very fun!", "I just did a electric Type run in Sword too and defeated Leon today. So this came at the perfect time!!", "\"I mean I knew that... I'm an electric type expert, of course I knew that.\" Mikey never fails to make us laugh.", "For 300 years I’ve been waiting for this video to exist, and after so long, my expectations were exceeded, great vid \nCan’t wait to see more", "Is anyone else just happy Mikey finally gets to use a Lanturn in a play through?", "I love how Mikey broke character for a second and he was genuinely amazed he could get such an early vikavolt", "“I’m feeling cocky and shocky” is now my new favorite MandJTV quote", "As if Mikey hasn't already used like half a dozen of the same obscure nicknames I use for my Pokémon, this is the exact same head canon I have for my own Galar journey.", "Just watching his videos makes me realize he would be great with role playing in DnD", "Can we just congratulate Mikey for acting like he hasn't played the game at all but he has.  Mikey deserves an actor award", "I love how he gets so into character that every time it feels like an entirely new video and format.Hope I worded that right", "I have never seen a SwSh playthrough that kept me as entertained as this. I love your style of playing, and it's honestly inspired me to do my own \"gym leader\" runs.", "I can now only imagine the Hoenn Grass Mikey as this entirely too chill couch-surfer, the Kalos Dark Mikey as a way-too stressed, insomniac evil man and the Galar Electric Mikey as just sitting there, with a monocle, sipping tea, in a box on the street, still without a gym, occasionally shouting \"SHOCK ON!!!\".", "You can see how much fun he had doing this run. I really enjoyed this one.", "I started this challenge 3 weeks ago, and have been lazy about continuing it, even though I have 5 Gym Badges already…\n\nAnyways, my first encounter, it was a Grubbin too, was SHINY!! I smiled for like… hours after that, having a good feeling about the run in general.", "This is probably the best mototype run mikey has ever done! \n10/10", "I'm impressed he's doing a monotype run of this! I have two playthroughs that I've called Duo-type runs. Both of my protagonists for these runs are siblings that aspire to be gym leaders that specialise in multiple types. One called Ashleigh who specialises in Flying types and Steel types and the other called Ricky who uses Electric types and Ground types!", "For what is worth, I think that as a Champion you should have dibs on any gym and become the gym leader you were meant to be. Also, Team Sky in Paldea any time soon?", "Literally laughed out loud at Grunty Boy’s “I’m gonna be an elf.”", "Can't wait for more Gym leader-type videos for other regions :D", "Hey Michael it's nice to have you back, I hope that the break you took helped you recover from the stress we put you under. I hope you continue making this content we love but most importantly you love while taking care of yourself", "I absolutely love your playthroughs. You always have so much fun and I truly enjoy that about you!", "Yay my idea got into a video I’m so excited. Thanks for listening mikey!\n10/10 video!  That gym leader video was my favourite content of yours and seeing my favourite team in a play through is amazing!", "Let’s go! You always manage to make even these typical challenges super entertaining!", "Love that the electric Mikey is basically the most chill of his personas", "I love that Katie really doesn't even have to do anything to make Mikey look sus, he does it to himself.", "Grunty boy going “I’m going to be a elf” is hysterical although I do agree that elves are pretty cool but I think I like durids more something about elemental magic is so cool to me", "I know these thematic, quick playthroughs are probably a ton of work for a comparatively short video, but I just wanted to say that I love them!", "Love these challenges! This has been on my mind for a little bit but what if you were to do a steel type run, it will probably be a little more challenging.", "I can watch Mickey for 5 hours at a time and not get  board his story telling IS AMAZING", "Once you've done 8 of these you should get some of your friends to take on your gym leader teams", "You are just a delight to watch. I love adding the narrative flair, adds a layer that is missing from a lot of Pokemon videos. Can't wait to see what's next, perhaps more Team Sky?", "I love that Mikey is an amazing role-player, I absolutely respect that :)", "I love how Mikey did the runs as the types he would be as gym leader and played as them in a play through\nI also love grunty boi’s ears", "Props to Mickey for playing through the entire Isle's of Armor for a 10 seconds clip!", "Awesome content! Good way to give Sword and Shield a send off as well!\n\nAlso, I feel like that Grunty Boi segment is prime meme material. “It’s only weird until it works” is a great line.", "As an electric type connoisseur myself. I am quite honored that you named your Electrike after me.", "Mikey’s love for Shred perfectly demonstrates my love for my own Toxtricity, Latifah. What caused Toxtricity to become my favorite Pokémon is because of Latifah defeating Leon’s charizard after a good majority of my team were taken down by it. Now I just have mad respect for her and can’t wait to use another Toxtricity in Pokémon Scarlet.", "If I had a nickel for everytime Mikey did this meme format, I'd have around 3 nickels which isn't a lot but it's weird that it happened that many times.\np.s - love the semi happy ending", "I love your content sm, and it's always entertaining. i hv caught covid again and I'm glad I have your content to keep me entertained  through isolation. can't wait for your next post!! :D", "I’ve been waiting for this one!!!!! Great play through to end off gen 8", "So ready for Scarlet and Violet. ️", "Awesome content! Good way to give Sword and Shield a send off as well!\n\n\n\nAlso, I feel like that Grunty Boi segment is prime meme material. “It’s only weird until it works” is a great line.", "I love how you said they’ll give you gym once they realize how many subscribers you have. That immediately made me think about the electric type gym leader in scarlet since she’s a streamer", "My version of this was poison type. Gotta love that ending with a lot of steel types. Thankfully Salazzle exists and plenty of poison types learn fire.", "Finally! He plays as an electric type gym leader! I have waited so long for this, thinking I would have to do this first, but he Finally does it! Great video!", "I love these gym leader play throughs.", "I love how you carried over the idea you had in an older video into a playthrough of the game!\n\nI also did a full electric type playthrough of Pokemon Sword and it was pretty fun, the electric type is my favourite type and this video was a great way to represent it.", "Someone shared a fun challenge that I'm excited to try for Scarlet and I would love to see you do it, it's an Avatar Pokémon Challenge. You pick one of the Four Nations and you can use only four specified Types also Normal and Bug as long as they don't have a second type outside your Types.", "I remember when you made a video where you were an electric type gym leader and you said what your team would be. Glad to see that came around ", "I absolutely love how this part of the game plays out. The scene with the ink demon was absolutely amazing, love this serie sor far", "You're always so fun to watch Mikey ", "I’ve looked forward to this play through since he did the video on what type of gyms leader he would be. Amazing video Mikey.", "I'm proud for how far Jaiden has become, from storytime telling animator and gamer and now as a Subathon, this is the best thing we'll ever get of Jaiden doing something awesome for us all", "For having done a bug playthrough of sword having a vikavolt with thunderbolt as he evolve for nessa is so golden.", "I did Dragon type gym leader a few months ago as my last playthrough of Sword. Was a little harder then normal in some cases. (All shiny team :P)", "You know, I've never done a challenge like that before. I think I'll try something like that. \nDoes anyone have recommendations for which type I should use? Right now I'm thinking steel type, but I'm still not quite sure.", "I did a monotype electric run of sword recently too\nthe struggle to get that drake fossil and to get scald onto lanturn was real XD I getchu man", "This just proves how underrated boltound is I love it and it's really good", "My first playthrough of sword and shield I ended up playing as a poison type \"gym leader\". Definitely kept G-Max Toxtricity on my team as well. Super fun and nostalgic to watch this playthrough and see Toxticity tearing it up for you too!", "I don't know why but when Grunty boy said \"I'm going to be an Elf\" I burst out laughing", "Can I just say I'm surprised you didn't go for \"Shock and awe\" as a catchphrase for both shocking attacks, awe inspiring battles, and just in general playing pretty aggressively which is the definition of shock and awe fighting", "These videos are just great!!! I hope there are more to come in the near future. Keep up the amazing work!!!", "Always amazing content. One of my fav youtubers.", "That first Chonkacku made me laugh far more than it should have! Great video.", "Gotta love how Sword and Shield never lets you change your uniform to match your type or to show off that you are the champion.", "I loved this video Mikey! Are you considering doing another metronome league again?", "12:47 \"I'm naming it Dumptruck, because I had to dig through a lot of dirt to get it\"\nMe, an MandJTV connoisseur: I see through the lies of the Jedi", "I enjoyed this, low-key cuz I beat it with an electric team too. \nMy Bolthound and Vikavolt carried the whole thing for me. \nMy double battle I had lanturn w/ volt absorb and Heliolisk w/dry skin. I just surfed and parabolic charged lol. ", "I did a bug-type run through swsh pretending I was a bug leader. It was actually a lot of fun esp since I hunted shiny blipbug for it and I love shiny orbeetle", "Rip Gen 8 you weren’t perfect, but you gave me memories that’ll last a life time", "It’s like you’re constantly in character, love it", "I love how he always makes his entire personality being based on just an over-the-top obsession with the type", "This was a shocking experience and I'm sure that the crowd was paralyzed after your preformence", "I love the quote \"its only weird until it works\" i should use it often now", "I am glad that that I wasn't the only one that did a mono type electric run. My number was 462 the national dex number of my signature Pokemon Magnezone. I used grass form Rotom, Magnezone, Low Key form Toxtricity, Emolga, Lanturn, and Vikavolt for my team.", "duuuude i can’t wait for this guy to do a play through on violet/scarlet (also maybe some role plays in that game)", "I’m glad this got to #10 ON TRENDING continue the good work", "Chonkichu was the cutest thing I’ve ever seen, I was so sad he lasted all of 2secs in his first battle. \n\nAlso that flushing goldeen was hilarious. ", "Hey Mikey, I really enjoyed your vids on the topics like \"what's the best trade in each region\" \"what's the rarest Pokémon\" etc. & one I'd like to see is, What's the hardest type to use in each region. Taking into account what options you have available, what major battles there are, are move coverage, to figure out which type would be hardest so solo a game with", "That moment when MandJTV Plays uploads a new video like this is always a great moment!", "Sword and Shield are just THE BEST for this kind of monotype runs! I did Shield with only Ground types and it got BRUTAL at times! I had to keep a Nincada (overleveled) on my team to contend with Hop's Rillaboom!", "Oh wow, I had no idea you could change Rotom's form in this game... I went and caught the different forms of it in the Isle of Armor! ", "Been waiting for this vid for ages and you never fail to entertain me", "That pure anger in GBs eyes when Mikey called him stinky sent me", "Milo had the audacity to say “this’ll really leave you in SHOCK and awe”", "This is quite possibly the funniest grunty boi segment ever. His \"I'm gonna be an elf!\" Was glorious", "Gotta love how the game deprives Mikey of a cinematic finale", "I'm currently working through a Two-stage evos only bug type run of sword.\n\nI'm also restricting myself to only being able to have one second stage pokemon on my team for each gym after the third (just beat Kabu tonight so evolved my nincada so I'll have a flying type for Bea)", "I remember doing this as flying type specialist and it being pretty fun. The toughest challenge was Marnie’s stupid morpeko. Also: TEAM SKY!!!", "Legend says that up to this day, Mikey still hasn't figured out that he had applied for the wrong gym challenge. Because the \"Gym leader tryouts\" were all the way back in June.", "Can’t wait for your Gen 9 content! Keep it up my dude.", "You should have picked up the surf tm before the dark gym. I think that would have helped."]}