{"video_id": "5mUQyz0kukk", "comments": ["Oh Meghan, you're like fine wine  you just get better with each year!", "", "Amazing!!", "", "AMAZING", "", "This song is actually addicting. After her long break in the industry, she made it to the top again. Her song became a Tiktok trend. And i can't utter any words but just being proud of her. The fame and recognition she is getting is because of how authentic she is as a songwriter and an artist. You're an inspiration to many, Meghan.  We're proud of you!!", "Good song!!!", "I liked both versions. The only criticism I have of the previous version is the quality of the 1080p render; does not support this resolution. It was really substandard. The good thing is, now we can listen to it several times without getting bored.", "Primer día 1,245,580M vistas ", "", "", "I have the urge to go Christmas shopping at Target.  Nice epilog!", "Looks beautiful ", "", "Love the pigtails ", "slayyyy", "Meghan is a LEGEND in her own time! What an AWESOME singer, songwriter and performer!", "I love this", "love this song", "️", "Oh Meghan, you're like fine wine you just get better with each year!", "Aahhhhhhhhhh I'm freaking out here ", "Meghan deserves to be more famous. She is such a great song writer.", "Reminds me so much of  All About That Bass !!", "Beautiful ", "", "Thank goodness for this video, so much better than the last one", "LUVVVVVV ITTTT", "Amazing ️️️️️️️️", "I love this song", "Loved listening to this while working here in the UK at the early hours, thanks doc.", "", "This video is better than the original. Great song!", " ", "Wow i love it..ang ganda ng music na ito", "Love this ️🫶", "Love the songgggg", "I don’t care if it’s again I love the background I love everything I love your outfit I love the dance I love everything", "Love you Meghan!", "I really love this song", "I like this song, good job meghan..", "lagu meghan selalu enak didengar dan mudah menggoyangkan kepala", "This was a huge stream doc this is why youre number one and two .think about it !!!", "I don’t care if it’s again I fucking love it", "Semoga di undang brownis trans TV", "i love it", "Si a ella le da la gana de subirlo 100 veces yo voy a verlo esas 100 veces ", "Lagunya sangat bagus, tentu saja penyanyinya juga sangat cantik, suaramu sangat memanjakan telingaku apapun lagu yang dinyanyikan selalu suka", "all about that bass was such a good you have to make it twice ", "Meghan ", "I feel like this song is 2 min for a reason! When will a collab appear?", "", "This song has been stuck in my head since it was released!!! Love this song!! ", "i love this song", "i really like this song", "", "this is a sign for me to finallyorder white boots!!!!", "sedang mencari lirik di kolom komentar mau ikut nyanyi woi lagunya enak bgtt", "Eu estou obcecada! Passava 80% do meu tempo ouvindo \"Made You Look\" e nos outros 20% eu torcia para que alguém falasse sobre \"Made You Look\" ", "The song is more energetic than the music video", "Love her Music a lot", "", "Love it girl️", "️", "meghan é maravilhosa demais, mais uma chiclete que não sai da cabeça da gnt.", "Amazingly breathtaking..love your style ", "Love this amazing singer", "", "I  this song", "", "Awesome!", "BEST SONG EVER!!", "Banger.", "️‍", "Ur voice is amazing it sounds like me in the shower ", "Ahhh love u Megan ", "there is NOTHING wrong for running it back for those that missed it!", "Ok although i am not a fan but she can actually sing and this song is very catchy", " ", "The makeup and hair is everything", "️️", "I adore ", "really like this song.", "She is like two different people from the bass to now.", "", "Gotta start my new days with this, yeah pink", "", "glad to see Meghan is making a comeback this year :)", "Omg I love all your songs", "I love this song  ", "Nice", "This song is actually good", "Boże to wczoraj wleciało a ma ponad mln wyświetleń", "In love with it", "I love you so much your lyrics are so clever!", "I really like the continuity from the previous video. Nice. :)", "", "You look ABSOLUTELY GORGEOUS.", "Wow amazing"]}