{
    "video_id": "5mUQyz0kukk",
    "comments": [
        "When Treat Myself came out I felt like this was the end for Meghan Trainor! I was heartbroken :(\nBut then Title started trending on TikTok and basically re-famed her. I soooooo glad that this song was a hit and now it’s climbing the billboard charts :) Congratulations to Meghan Trainor",
        "It's just like \"Your lips are movin'\"",
        "I love your song",
        "Mehgan trainer bodied this song and even when she did it again this song she even kill d and bodied it again and I just love her voice she can sing and I love the way how sometimes she can sing with auto tune and then sing without it cuz that's how beautiful her voice is",
        "I love you so much MEGHAN! ️",
        "You made my day Meghan <3",
        "megan not fat trainor anymore.",
        "All these men mocking women. So gross.",
        "Oh Meghan, you're like fine wine  you just get better with each year!",
        "She's unexplainable.. She's everything",
        "What happen to the views",
        "I love this song keep up the amazing work",
        "Love this ️🫶",
        "CANDY CRUSH!",
        "You are the best !",
        "I hate pop music, and I couldn't possibly relate to these lyrics any less than I do. But I cannot get this undeniable melody out of my head. Absolutely killer track, no matter who you are or what you are in to.",
        "I  this song",
        "000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000",
        "I'm hearing this for the first time again.",
        "Not me watching this so much. (Totally not because I love it)",
        "i made you look!",
        "Honestly hoping we get more music videos from this era because i swear they have been nothing but stunning to watch.",
        "How could be so difficult for Anglo-Saxon people to say an “E” ending name correctly",
        "Her songs are always catchy. This with Title",
        "Yeeee... Sebentar lagi natal",
        "Hey Meghan! I love your songs u shot go on got talent and preform u superstar! And why don’t you make a Christmas song! I’m sure it will be amazing",
        "I said it on her original video and I'll say it again - she looks like Sarah Jessica Parker!",
        "Love it girl️",
        "This is a timeless masterpiece ",
        "I miss her old teeth she looked so cute!\nShe’s gorgeous now but the teeth are just kinda awkward. I cant put my finger on it but the super straight boxy shape doesn’t do her good.",
        "At some point, you need to change your music production. From the beat from your debut until your newly album still has it the same beat and tempo. You can dig more at this more.",
        "Absolutely love!!",
        "Meghan Trainor is a huge inspiration to me and I WILL produce a song for her one day.",
        "Love it ️️",
        "The transformation ,her body is bodying!!!",
        "I absolutely love this song! One of my fave! I love the backround",
        "nice",
        "Love love love this song!",
        "I love everything especially your songs i memorized all of them",
        "This song is so good! Love the whole thing Meghan :)",
        "I love your songs! Keep up the good work!",
        "This is so good! Love you Meghan",
        "“And no I won't be no stick-figure, silicone Barbie doll “. Oh look it’s Barbie",
        "she really did it again for chris' account lmao",
        "Love this ",
        "This song is actually addicting. After her long break in the industry, she made it to the top again. Her song became a Tiktok trend. And i can't utter any words but just being proud of her. The fame and recognition she is getting is because of how authentic she is as a songwriter and an artist. You're an inspiration to many, Meghan.  We're proud of you!!",
        "sigue bajando de peso un poco más!",
        "Is that bretman?",
        "Please add subtitle in your song sis. So we can sing with you.",
        "Brilliant!",
        "The vibe of the song is so addicting ",
        "This version is super loopable! Thank you for a great bop, Meghan!",
        "I can’t get enough of this song. Literally love it! ",
        "Ily meghan ",
        "I'm sorry you blesses us with a whole scene to this master piece...Yessss THANK YOU MRS MEGAN WE LOVE YOU",
        "Is it me or she looks different from like few moths ago",
        "What happened? Was her video reuploaded?",
        "Wowww\n\nAfter all of those years you changed a lot",
        "Nicky Mitrava me viciou nessa",
        "I was 8 when Meghan debuted with All About that bass and now I'm 16 listening to her new song. She's really a part of my childhood, I'm glad she's getting the recognition she deserves again.️",
        "good song but with all the response it got i wish the video was cooler or told a deeper story because its just a pink room with 2 camera angles- love the song tho :)",
        "Definitely all about that bass vibes and I love ittttt",
        "Me gustaba más gordita… ️",
        "Amei o look e o olhar de deboche ",
        "Crackin little song right out of the early 1960s well done megan",
        "glad to see Meghan is making a comeback this year :)",
        "It's so catchy haha I find my brain singing this out of nowhere as I'm trying to sleep ",
        "OMG I love this, Obsessed with it from tiktok",
        "Am i the only one who hears the sample to \"i got my tight pants on\" from Jimmy Fallon Show? ",
        "Good song!!!",
        "I love this song and genetics ️",
        "It’s because Chris told her to do it again but better",
        "why the hell did you do another one????????",
        "哦 咯册 哦他",
        "I'm sorry but this is her comeback. Missed her",
        "#GurSiftVlogs",
        "Meghan trainers songs are becoming hits on tik tok and I love the queens songs ",
        "Its so cool",
        "Samsung LED 40 art",
        "Good pop song  I heard it on the radio  on top 40",
        "My favorite song of yours",
        "candy crash theme",
        "I’m such a big fan of Meghan",
        "OKKK GO GIRL GIVE US NOTHING!!",
        "Instead u made me cry ",
        "Mano as músicas dessa mulher todas mexe comigo de uma forma tão boa ️️️️️️️️️️️️️",
        "Bro i love this song but tt is carzy for it ngl-",
        "This was a huge stream doc this is why youre number one and two .think about it !!!",
        "Wow. Her new appearance makes me look at her again.",
        "This catchy song is stuck in my head... She has such a nice voice though. Inspired me to use my own voice on my channel ",
        "I love Meghan, she's always speaking so highly of others including herself she's a unstoppable woman with an outstanding voice, Meghan is gonna be so much more famous than she already is, i guarantee your gonna be the top Meg, i listen to this song at 6am everyday and I feel powerful and encouraged, you are lovely and powerful Meghan keep catching your dreams<3",
        "I rarely like new music but let me just say I am obsessed with the album keep it up girly!! ",
        "Omg its from the part where he said Meghan lets start again and u rlly made it",
        "Meghan making us look twice and nothings wrong with that",
        "Hots dog shaped candy and candy for children in background. Where’s the pizza for children?",
        "This song really needs to be #1",
        "️",
        "Anyone into acoustic folk grunge stoner rock with undertones of conspiracy theories? I have songs on my channel for you.",
        "this song blows up fast lol",
        "Your talent never fade:⁠^⁠)",
        "Dudes in skirts ",
        "ako lang ba o kahawig nya si bea alonso sa hairstyle nya",
        "I remember someone saying at end u gota do this again for my profile and here it is",
        "Love ️️",
        "It's give ng me candy crush vibes",
        "what's wrong with her face?",
        "Meghan I hope somehow you see this....I just want you to know it has been a long. Ass. Time. Since I listened to a whole album at a go and loved every single track. I love love love your newest album you frigging KILLED it!!!!!",
        "and crazy how their voices match perfectly",
        "This is awesome",
        "This song is such a vibe, love your glow up!",
        "THEY ACTUALLY UPLOADED THE RETAKE OF THEIR PERFORMANCE hAHAHDKWLLD gold",
        "I saw the tiktok im so sorry about that you really need to talk to Chris about that also lovely song",
        "Lss",
        "I didn’t realise it from the original music video for this song but this version is very clearly a promotion for Candy Crush Saga. \n\nMe thinks Meghan Trainor is a tad obsessed with the game. Don’t blame her, it’s addicting! ",
        "my teacher played this song at school yesterday, but its a great song anyway",
        "I love the fact that Meghan really did it one more time! Just watched the first video and apparently Chris said \"one more time and better this time\" So hilarious!  So I guess this is the result haha ",
        "Refreshing!!!! <3",
        "This song and Clover Cage - This Is What The World Needs are the two songs keeping me sane through these tough times. I just want to send love to everyone and I want everyone to know things will get better. We are in this together..I love you",
        "This is so much better than a video of luck with your new friends but your life was really awesome",
        "I love it so funny.",
        "Love this!",
        "This song is on fire ",
        "Yay early for the again vid",
        "A queen so beautiful obsessed ️",
        "Movement's are smoother!",
        "Girl 🫦 slAy you can go ahead and wear your Louis Vuitton",
        "Wow",
        "I could have my Gucci I could with my Louis Vuitton, but even when I am nothing but damn made you look, meet your look.",
        "Good she takes advantage when her songs go re-viral unlike other artists",
        "I'm so happy for you",
        "Te amo meghannnn ️️️️️️️",
        "Me encanta  ",
        "I LOVE IT!!!",
        "You are my one and only one female singer who I love more than srilankan. God bless you ️️️",
        "Ya",
        "How can this women get even more perfect?!! Everytime keeps getting better and better its amazing. The looks the music the cuteness",
        "I am litteraly obsessed with this song",
        "So good been singing all day",
        "QUEEN ",
        "I am obsessed with this song! ",
        "I feel like this song is 2 min for a reason! When will a collab appear?",
        "This song has been getting air play so thought I'd look it up here and am not dissapointed. Fun and lighthearted.",
        "I really love this song ",
        "photoshopped waist bae?",
        "slaying and pretty as always",
        "What did I copy last",
        "what's going ooonnnn",
        "🇹🇹",
        "It’s” Versacheeee” not “versa Chi ",
        "The song's a huge bop, and an earworm thanks to TikTok (hey that's rhymes)! I've had it on repeat in my head a lot\n\nI appreciate a music video that doesn't have any extra stuff at the beginning or end. When I'm listening to music, I just want the song. And sometimes audio only isn't enough, so watching it on YouTube adds a great visual aspect.",
        "maganda",
        "Who heard the back voice \n I think its arianas",
        "Que música boa, obrigado Meghan por esse presente! ️️️",
        "she's looks great here and lovely at the same time.",
        "I remember religiously listening to Meghan Trainor as a little kid….\n\nStill am now, nothing has changed ",
        "Yeah, you made me look, beautiful Meghan saving the music industry ️",
        "this is way too overplayed bro",
        "A Mc No voltou com força, tô amando",
        "Any kind of music Meghan makes is a masterpiece I’m telling the truth it’s all a masterpiece ",
        "U deserve the crowd!!!! ",
        "I genuinely thought that was Andrew tate in the background dancing ",
        "Slay",
        "I love your voice ️",
        "Megan looks amazing in this video",
        "Nope",
        "Like this song... Mood booster every morning... ",
        "Que fea ropa le pusieron",
        "I love this song  ",
        "Nice song and voice but terrible video! The candies shouldn’t have been part of the video. It would have been better if the video clip had been in a Gucci or Versace store or kinda",
        "now tell me why cant you not love meghan trainor. Her music just easily sit in my mind without my permission. It is too addicting*",
        "We need chrismas version LIKE RN sound like one",
        "Meghan your incredible your voice is so pretty and your so pretty this is my favorite song and I have been listening to it on repeat since it came out ",
        "Who are here after the song is trending on TikTok?",
        "Finish it off… \n\nMade you look…",
        "Oh my goodness this is so good! The candy behind her remind me of a gingerbread house!! Great song, you definitely get presents this year!!",
        "Nice to see her rising up again",
        "i’m addicted to this song",
        "I love how it is not overly sexual and something kids can safely watch and dance to. We need more this none explicit music back.",
        "The way I turned my volume down",
        "I LOVE THIS SONG",
        "\"So how many music videos of the same song do you want?\"\nMeghan: \"Yes\"",
        "Oh I love this song!! It has so much potential to create a fantastic MV but sadly it’s little boring considering what she could have done with all those transition along this amazing lyrics. Not a hater keep in mind I just wished this video was more creative because the lyrics and beat is so dope!! ",
        "You're incredible!!!",
        "Why this is so catchy in my ears",
        "I'll conment here so I hope it will blow up.",
        "I remember religiously listening to Meghan Trainor as a little kid.\n\nStill am now, nothing has changed",
        "THIS SONG LIVES IN MY HEAD RENT FREE ",
        "Something about the fact that its simpler is actually really nice. Its one visually interesting set and nothing more and I really like it",
        "her voice is so smooth and sweet in a really soothing way ",
        "I love this song so much, I can’t stop playing it",
        "She looks different when losing weight..",
        "Girls been screaming I’m fat accept me and insulting skinny women and now she skinny ",
        "She has outgrown this dressing and style of dancing. Time to try something new. Its getting old. Also sounds so much of Dear Mr. Husband in beats.",
        "Such a great, catchy song and meghan you are fantastic such a babe ️. Outfit is stunning you look fabulous. ",
        "Meghan never fails to make a song that will get stuck in your head forever!",
        "Dit verdiend zoveel beter dan dit ",
        "️️️",
        "Has a Christmas feeling to it",
        "I could have my Gucci on\n\nI could wear my Louis Vuitton\n\nBut even with nothin' on\n\nBet I made you look (I made you look)",
        "she has the best clothes very nice",
        "Didnt put too much effort into that video ",
        "Nice",
        "So ordinary",
        "Siglis reaction to SSundee being of the cause of his torment that entire round made my day priceless :'(",
        "Megan is back to get her throne again. Obsessed to this song!! ",
        "Love it️️️️",
        "So love omg!!!",
        "“The Breaks Over, The Come Over”",
        "This song give  Christmas  vibe",
        "Yep",
        "This is why in the last video the director wanted to retake in the last video. 'cause MADE YOU LOOK (AGaiN).",
        "Ok",
        "노래 좋당",
        "I could have my Gucci on\nI could wear my Louis Vuitton\nBut even with nothin' on\nBet I made you look (I made you look)",
        "The song is more energetic than the music video",
        "candy crush ",
        "El video mas esperado te quedo espetacular Meghan  siempre triufando con su talento y su voz saludos desde Ecuador",
        "Every time I walk into the school building with a nice outfit on (everyday)",
        "Sounds like all her songs",
        "like the stye",
        "Now I'm obsessed with this<3 ",
        "I love this more than the first one ",
        "Aphmau never ceases to amaze us B-)",
        "0",
        "Dope",
        "smash",
        "The song is fascinating....",
        "I love this video shes giving so much in just one scene",
        "Saga Candy crush???",
        "This is my favorite songyesterday I said I want this song stuck in my head",
        "If you want to sing : The lyrics: \nI could have my Gucci on \nI could wear my Louis Vuitton \nBut even with nothin' on ",
        "Songs i be jammin to when the bro's not around",
        "Omg! Meghan's abs are inspiring me. ",
        "i missed her SO GALD TO SEE HER BACK AT THE TOP ",
        "Dammit this will live rent free in my head for ages",
        "why post again without the cut scenes to other celebs?",
        "**hits replay, again",
        "You go girl  \nLove the song!  ️",
        "Love it! Very simple but sweet ",
        "Love this song omg yay ",
        "Is it just me who realized the candy crush background?",
        "i like all your songs",
        "This songs been ALL over TikTok",
        "I love it️",
        "why does this sound like its from 2014",
        "Chris doesn't like this \"one more time but better\" version too so it's uploaded here instead of his account",
        "This song and “Clover Cage - This Is What The World Needs” are the two songs keeping me sane through these tough times. I just want to send love to everyone and I want everyone to know things will get better. We are in this together..I love you ",
        "Questions are those chocolate cake pops real Meghan Trainor and can I have them!",
        "iconic ️ barbie Gal️",
        "you slayed again and again queen",
        "She is so beautiful ",
        "I can't get enough of this song. ",
        "I  the   s",
        "RELEASE THE REMIXES",
        "Essa Msica T Incrvel",
        "BEST SONG EVER!!",
        "a musica tem 2:17 min ta de sacanagem né? Bem vindos a era das musicas que cabem em um shorts do yt 🥹",
        "she's a living legend",
        "She's one hell of a song writer",
        "You so beautiful meghan",
        "Primer da 1,245,580M vistas",
        "Love it  ",
        "Nothing like commercialism making you look!",
        "eek",
        "She can't understand her career is over...",
        "IT'S CANDY CRUSH THEME",
        "This song is stuck in my head I can't stop singing it.",
        "Omg they really did it again ,just as Chris demanded , ICONIC!!!",
        "🇪🇪",
        "He really did make her do the song with a different video :0",
        "Nice song Meghan. But why you broke this MV by putting a lot of bencong  there?",
        "This is freaking horrid.",
        "I love her runs! She has a beautiful voice!",
        "Awesome song and video, Meghan!, you look absolutely amazing!",
        "Wait why was this published again",
        "YEP, YOU MADE US LOOK, AGAIN!!! AND, I LOVE IT! Thanks For Sharing.",
        "0:01 Heyy",
        "And always love you song",
        "What's really insulting is calling Mick \"lazy\" when he was working with such an insane schedule that he ended up being forced to sleep under his desk, working 24/7 at some point, unable to spend time with family. I've seen scummy managers do this exact bs maneuver all the time to employees that they don't like; give them a completely unrealistic schedule, expect them to work insane overtime, only to berate them when they inevitably fail so that they can call them \"lazy\" and have an excuse to fire them. My heart sank when I read Mick's statement and saw this kind of abuse happening to him. When reading Marty's post vs Mick's it's clear to me who the real \"ball ache\" is. Marty's post reads exactly like a corporate rat who knows he holds all the power and can control the narrative with the help of his massive legal team.",
        "ur voice is amazing",
        "Call me up!",
        "At 1:12 you lipped \"cuz\" instead of \"but\", didn't you? LOL I have done that same thing. This vid is so well done, tho. For real, the editor was seamless, especially on a few of the transitions. Chef's kiss. I can't stop watching this video, Meghan! Bravo to all involved. So many little things happening here that most folks will never pick up on, so kudos for that eye to detail. It makes it so much cooler when those of us who do pick up on them catch them as the video is going. I love this.",
        "Oh my lord so many candy crush saga",
        "As good or better as at the first time. ;):) Only Meghan looks somehow younger?",
        "too adorable to forget",
        "Sharpay Evans vibess",
        "I love meghan trainor’s music videos",
        "Megan definitely made me look",
        "I hear \"Goofy ahh\"",
        "all about that bass was such a good you have to make it twice ",
        "my fav thing about this is Her hair.. like is no one gonna talk about how she has her hair up but without an elastic and its just with her hair??(⊙ｏ⊙)",
        "This song is apparently about sex.",
        "I love her voice!",
        "Megan confidence and the confidence with her songs is just so beautiful and she finally getting the attention she deserves",
        "People dont get these easter eggs.lemme explai. Remember in the og vid in the last part Ally (or someone )says to redo it again. do you get it now?",
        "This song has literally grown on me and plagued my brain. I  it now  this song made me run it up in Target",
        "I adore ",
        "i miss the beats nostalgic huhu",
        "Boring",
        "Tik Tok I mean",
        "This song is an earworm.\n\nMeghan Trainor keep up the great music ",
        "Literally no one is looking at you. Keep trying to get peoples attention, tho.",
        "This song",
        "This deserves more views",
        "Adiicta a estoo!!!",
        "Despite the economic crisis, this is Still a good time to invest in Gold and Crypto.",
        "this jam is something I would play while I do makeup bc it instantly boost my confidence like...",
        "On in radio",
        "So enjoying to watch ",
        "Great voice, great music.",
        "She looks and sounds absolutely fantastic",
        "I MADE YOU LOOK!!!",
        "Heard this song elverywhere without knowing whos the singer..now i do..great song",
        "It is a good mudic",
        "This is so iconic!",
        "This deserves to be waaay longer!  Too good to just be a TikTok trend.",
        "سيد",
        "Starting stanning Meghan Trainor in this era  is so bop ",
        "They really did it better this time for that obnoxious guy",
        "Omg I love all your songs",
        "I love this song she’s so cute ",
        "feel like song in 80 - 90 s'",
        "️️",
        "Been dancing to these song the whole time most esp when Im alone and cleaning the floor and the whole house. ",
        "I love Meghan so much! Her voice is so pretty and her voice could never get old!",
        "there is NOTHING wrong for running it back for those that missed it!",
        "This song is my fav",
        "Incredible ",
        "i really like this song",
        "How's the weather like on the top?",
        "Meghan Trainor.. She's an icon, popstar, Legend",
        "I like this song because it’s upbeat, a lot of songs recently were very low beat and were overall depressing",
        "I dance to this!",
        "They're currently 4.5 hours into the stream and have reached 88% of the goal amount.  Good on Charlie for caring and doing this for Lance and his family.  Looks like they'll make the goal easily.",
        "this song is too short ._   .",
        "Cant get this song out of my head its so catchy and fun to dance to",
        "SUCH A HIT I HOPE IT BECOMES AT LEAST 100 million views and reach 500 million Spotify streams",
        "Mehgan trainer killed and bodied this song and ate it up and left no crumbs back",
        "Love it!",
        "Beautiful song",
        "As músicas dela ficaram no passdo, ninguém escuta mais ela.\nO tempo dela já passou.",
        "this song deserves more hype on youtube, aswell as spotify or any other streaming platforms",
        "Im only rewatching this due to the bald dude in the background LMAO",
        "What a mesmerizing song!!!!! Wonderful",
        "Ini Pertanda Bahwa Bn Channel Resmi Debut Pakai Lagu Ini ",
        "A lot of artists are making retro music. Big up Bruno for setting a trend ",
        "Amei muitoooo ",
        "Yay 3day ago I think she is way more gorgeous I mean she was gorgeous super gorgeous but that cuteness and the hair's the steps ",
        "Where’s Meghan Trainor? It’s been awhile",
        "Jesus Christ is the Way, the Truth and the Life!!! No one comes to the Father except through Him!!!️",
        "Wow... !!! My best friend, Great video. Love your channel. Keep up the excellent work!!! Wonderful upload! Keep it up! +thumb up3!",
        "SHE SLAYEDD",
        "I love all the songs Megan releases.\nThis one especially.\nIt just lives rent free in my head!",
        "ako lang ba o kahawig nya si bea alonso sa hairstyle nya  ",
        "I can hear cupcakke voice",
        "Pretty sure it’s 2, dunno why everyone’s saying 3.",
        "love this sing SOOOO MUCH",
        "Damn, I an old lady, really old and loved every minute of your vid!!  So damned clever and cuter than all get out!  Thanks!",
        "Wow amazing",
        "The background gives off christmas vibes for literally 0 reason. Still love this song!!♡♡",
        "I can't stop singing this song to myself my favorite from Meghan",
        "I swear she's like a living barbie I love her so much ",
        "Xức xắc chị tuiii",
        "I love you r songs ",
        "This song is really amazing . It's stuck in my head. Wonderful ️",
        "you know jojo",
        "Ive had this on repeat all day...puts me in a good mood! ",
        "I LOVE YOU SO MUCH MEG I LOVE YOUR MUSIC I LOVE EVERYTHING ABOUT YOU KEEP DOING THE GOOD WORK!!",
        "Her psychic was right ",
        "Nice song :) ",
        "Porque siento que me enseña la cara le ha cambiado mucho creo que no es la misma pero si es la misma está sensacional",
        "but it’s Versace, not Versacee ",
        "slay",
        "I  like  this  song ",
        "A masterpiece ",
        "Oh how I love her! All her songs give me the perfect good mood",
        "All about that Bass vibes ️",
        "Que voz perfeita ",
        "Megan's still getting better how?\nNo clue but, gotta love her! <3",
        "Love the songgggg",
        "Imagine her performing that title in the safe space town of Chillingbourne.",
        "Oh girl! I was sad and you made me smile! this song is pure good vibes ",
        "Maika'i nui loa,  e kou mele fire.",
        "I love the trend!!! Amazing song. Thank u You Tube I did missed it",
        "Her songs give 2012-2018 vibes which brings back so much nostalgia",
        "Such a great song and video. My channel has very good relaxing music. Hope everyone support",
        "Slay girlll",
        "I'm litterly obsessed with this song! Yesterday I went to Gucci and Louis vuitton (no I'm not rich) I wanted to go because it looked interesting and I'm like \"I COULD HAVE MY GUCCI ON, I COULD WEAR MY LOUIS VUITTON\" I love this song Meghan! EVEN when I go to school this sounds on my headI FEEL like ALL about that Bass, title and made you look are one of my top favourite songskeep making amazing songs",
        "It reminds me of her old songs! I love it ",
        "Am i the only one who think meghan is the un-plastic surgery of kyle jenner? She look like kyle jenner when she was young especially with less make up and not this kind of fashion style",
        "I really love her music, always fresh, uplifting and fun to sing to :)",
        "LOOVE IT!!",
        "HELP I think am really addicted to this song ",
        "Is this the live version but more of a music video?!?!?! AMAZING!",
        "Candy crush baroness",
        "Again?   I LOVE IT ",
        "Why did she do it again???",
        "big question here, why the song is only 2 minutes",
        "her songs never get old",
        "she look like dolores from westworld",
        "I prefer this video to the first release. And DAMN YOU, MEGHAN, THIS IS BRAIN CANCEROUSLY INFECTIOUS. I love it, paid for the download, well done, Ma'am, your talent is undeniable.",
        "Foarte bine  its my favorite song",
        "Love her music ️",
        "Tbh I didn’t know that she was still around. I thought she was just talking about how much she likes using the toilet with her husband lol",
        "I love the candy crush candy you use on the dance field.",
        "Eu amei essa música",
        "THIS VIDEOOOOOO LOVE ITTTTT",
        "It is actually my birthday today, and i will celebrate with this song ",
        "\"And I saw the dead, small and great, standing before GOD, and books were opened. And another book was opened, which is the Book of Life. And the dead were judged according to their works, by the things which were written in the books.\nThe sea gave up the dead who were in it, and Death and Hades delivered up the dead who were in them. And they were judged, each one according to his works. ",
        "Porque sigue insistiendo con esa forma de interpretación",
        "This is such a good song it’s been stuck in my head since it came out ",
        "this is so amazing, but why too end fast? ",
        "Love it ",
        "I don't understand ahaha, why put the same video again.. Easy money I think",
        "So perfect, I love everything in this vídeo!!! ️️️",
        "these gay dancers are ruining it",
        "Her vibe though",
        "I love you so much your lyrics are so clever!",
        "What a Great Voice. Love hearing her whenever she sings.️️️️️",
        "Her songs are so good. Like every time",
        "I discovered this song yesterday and this has made my day lol",
        "Not different from All about that bass ",
        "damn girl slayyyyyyyyyyyyyyyy",
        "In love with it",
        "She rock the World again!",
        "I love it a \"dance\" version. ",
        "LIK",
        "Imagine MEGHAN TRAINOR, writing and producing a pop record for NickiMinaj ",
        "0:48 let shakira teach you that movement ",
        "Oiii",
        "I lovel your song",
        "0:12 yea she got me looking alright..",
        "love thus song. stuck in my head forever",
        "been playing this song everyday and dont I make  it look easy favvv!!! love you meghan",
        "love",
        "You're so good",
        "How original",
        "Catchy song, but this style of awful.",
        "yall think we can dua lipa her?",
        "This reminds me of George Harrison’s album Cloud Nine",
        "She's get prettier ",
        "This song is awesome. Change my mind.",
        "Love the candy crush in the background",
        "I love you Megan trainer ",
        "Love ️   ️   ️   ️  ",
        "Queen of Zumba song 🇵🇭🫶",
        "Omg I’m a big fan of Megan trainer",
        "It seems like she had lost about 10kg of her weight comparing to her previous body!",
        "Wow i love it..ang ganda ng music na ito",
        "The fact that both versions of the music video is trending just tells you how iconic Megan is!",
        "Is this a candy crush advertisement bc i like it",
        "She licked her finger and made a face like it was a pee pee. I cant believe she did that.",
        "a musica tem 2:17 min ta de sacanagem n? Bem vindos a era das musicas que cabem em um shorts do yt",
        "Love so much meghannn...im your fan from malysia..u look so gogeous",
        "Broke Version:\n\nNO I CANT WEAR GUCCI ON",
        "I wish this song was longer  I’d love an extended version or remix with someone like Lizzo",
        "meghan metendo logo um l do lula no meio do clipe, amo",
        "I GOT ADDICTED TO THIS SONG SO MUCH",
        "I can’t believe the Spy Kid got a woman like her  I mean I love them but Megan is a queen ",
        "that is one helluva low budget film set for an addicting music.",
        "She came on top again and we all LOOKIN, love to see it <3",
        "Help i can't cupcakke remix ",
        "MY QUEEN MEGHAN TRAINOR SLAYING AS ALWAYS",
        "What's the difference or point for another similar video?",
        "been listening to this all day. instant classic",
        "I LOVE how in the first video chris asked for another performance, and Meghan delivered! LITERALLY ",
        "INDONESIA HADIR 🇮🇩\n\nSANGAT SUKA BANGET NONTON VIDEONYA",
        "AMAZING",
        "Cool",
        "you go girl your so cute",
        "She is finally back!! This feels like 2010 again ",
        "yassss! Let's do this again! The song keeps playing on my mind! I love it!!!!",
        "POV the vid is in 2x",
        "I think they are doing the same as in kpop (performance videos)",
        "Heyyyy omg this is my first time responding to anything of yours... but I did see the last video, did you really have to this twice???? if you did I still love the videos",
        "Again again again.. forever!!!  We love u..️",
        "I am absolutely so glad that her new song went viral and she has made a comeback! She is such a great singer ",
        "Can't believe it's Candy Crush themed am I gaslighted everyone",
        "Looking like a christmas ad for John Lewis. The budget was low lol",
        "the song is amazing but i can only think of candy crush game while watching the video",
        "Waouh",
        "THIS IS SUCH A BOP ️️. SHE ALWAYS MAKES BANGERS .",
        "Someone is getting through something hard right now because you've got their back. Nice work.",
        "I listened to this song like a thousand times on the couch and when i got off my neck felt like i was gonna break ",
        "️ love it",
        "Attractive music I like listening this music very much..",
        "This song is a bop fr!\nand the fact that she’s a Mum and she can sing, dance and look after her child at the same time!",
        "I love this dance video versio more than the original/official video. Love this song, thanks Meghan ️",
        "OH MY GOD! I can understand every word of this song! No need to look at lyrics!  When hard works pay off.",
        "Love her and her music since young",
        "The makeup and hair is everything",
        "É inegável como esse estilo musical combina com a Meghan <3",
        "Thank you Meghan! Whenever I listening to your songs, they always give me my confident back! ",
        "fun fact: at the end of the first made you look, someone said “you’re gonna do this again for my account so make this one better” so she’s doing it again.",
        "Like the song lost me with video with the men dressed up.....",
        "superb!",
        "this is a sign for me to finallyorder white boots!!!!",
        "Meghan never change, always have good taste in music",
        "\"I could have my gucci on\"",
        "Seriously my favorite pop artist.\nI always love the songs you have because of how the beat is♡♡♡"
    ],
    "comments_disabled": false
}