{"video_id": "6-AT0vDXdsk", "comments": ["I wasn’t expecting todays video to hit me right in the feels. Justin putting life in perspective, never know when it’s your time or when next season won’t come.", "Sorry for the loss of your Dad.Im sure deep down he was extremely proud of you. Just like we all are.Thanks Chief that was a heart felt moment.", " so sorry Jackie. There is absolutely nothing to say. He will live on through her memories and through Caddy Jack. Much love and respect to you both.", "Courage to you, Jackie, may your dad rest in peace.", "My condolences to all who loved him in your time of need. I'm glad the fire he gave for racing is still burning bright and I'm sure he will watch her continue to do great things.....️.", "Love and respect to you guys. Unfortunately everyone goes through this at some point in they’re lives. Every person greaves differently. My condolences to Jackie and Justin. Good to see you guys back at it. Caddy jack sounds amazing.", " WE LOVE AND RESPECT YOU GUYS. TAKE YOUR TIME AND GRIEVE AS MUCH AS YOU NEED... WE WILL BE HERE FOR YOU. WHAT AN AWESOME TRIBUTE TO YOUR DAD. KEEP DOING WHAT YOUR DOING IN HIS MEMORY... AND CONTINUE TO MAKE HIM PROUD, IM SURE HE IS AN ALWAYS BE WATCHING OVER YOU AND SMILING DOWN. ", "So sorry for your loss Jackie, sending prayers your way. Also Caddy Jack sounding and looking fine af. ", "Our thoughts and prayers are with you both. Take the time and do what you do. Hit the streets and make him proud", "Thoughts and prayers for Jackie and everyone in her dads life", "This hits home for me, I lost both my parents 7 days apart four years ago, and it's still hard.. Much respect Justin and Jackie, your thoughts are with us.", "My condolences to Jackie, Justin, and all of the family and friends. I'm truly sorry for your loss.\nI'm glad she's doing something to make her smile again and he's riding with you on that first test drive, every pass, and every drive from now on.\nR.I.H John Braasch your amazing legacy and passion will live on forever in all of our hearts and memories. You will be missed by all.", " LOOKS LIKE JACKIE MAY NEED A BOOSTER SEAT TO SEE OVER THE SCOOP ", "Sorry for the loss and prayers to you all!  Caddy Jack sounds good struck fear in my innards to line up with that!", "So sorry to hear about your dad Jackie, loosing a father is hard.  Just know every time you’re in your car he is right there with you!  Hugs to you and Justin.  Prayers for the whole family.  Caddy Jack is awesome be very proud!", "I'm sure your dad always watched you as much as he could and he was so proud of his daughter . Now he will be watching over you always smiling down prouder than ever and keeping you safe .", "Very sorry for your loss Jackie! I can't even begin to imagine how you feel!\nPrayers for you guys!", "Glad to see the return of Justin, Jackie and Juno!", "Jakie, just know that whenever you are racing, your dad is right there with you cheering you on. This community Loves you!", "Heart wrenching and beautiful at the same time. The car sounds KILLER! Rest easy to Jackie’s father. ", "It's absolutely heart wrenching to hear that a loved one passed. I felt the same when my father passed. I hope everything gets better soon. On a lighter note, You guys killed it with the caddy. I'm in love with that car. I know it will run as good  as it looks. Stay safe..", "We all love you guys! Prayers go out to to you and your family Jackie! Sure have missed y’all, but totally understand what you’re going through. I lost my best friend/ Pop’s in a motorcycle wreck on his Harley. May the Lord be with you in this time of loss. ", "I'm very sorry for your loss Jackie! My condolences to you and your family and a thank you to Big Chief for being there for you ️", "Sorry about your guy’s loss, hope everything gets better for you guys.", "Great to see you in the car again and my condolences for your Dad", "I am so sorry for your loss Miss. Jackie and would like to extend my deepest condolences to you and your family!\n\nGlad your keeping your head up, doing OK and still making you Pops very very proud ", "Jackie, I am so sorry for your loss. I am so glad you got all you did from your dad. He put all his best qualities in you and you came out to be an amazing woman. God bless you and your family. You all are in my prayers. May this time be a time of healing and reflection of past happiness and realization of just how proud you had made him by following your own dreams and being the incredible woman you are.", "All of our love and prayers to Jackie and her family.   Take a break hold her tight and  just love on her.", "Much respect to you guys. Nice fitting tribute to Jackies dad.", "Caddy jack sounds amazing. Sorry to hear about your loss guys, glad you were able to take some time and clear your thoughts. The tru supporters will be right here waiting. ", "Sorry for your loss and very glad to see that the car ready to go for her. Sending positive energy guys", "Sorry for your loss Jackie. Take all the time you need. We’ll always be here for you and Justin . I lost my dad back in 2007 from cancer. I was in the Army and they only let me come home to say goodbye one last time. #ACopFromCali", "love and prayers to jacki and all her family! RIP JOHN! ", "Prayers are with Jackie!! She’s such a amazing woman…", "I'm so sorry for your lose Jackie. I lost my father as well, he passed Feb. 24th 2021. And I really understand what you're going through because I too was introduced into cars, racing & love what I do for a living because of my dad. I know it's difficult, but even though it's kinda cliche when I would get sad or upset I would think back to a good time, him teaching me to drive or letting me take his RX-7 for my first spin or us goofing around in the shop. It really helped me, hopefully it can help you. Keep up the good work, we're right with ya ", "I’m so sorry for Jackie’s loss and your loss chief. We all love you guys and take all the time you need well always be here", "Damn guys. So sorry for your loss. Sending prayers and condolences  \nThis video had me so emotional. Up and down, I lost my dad on my birthday 2 years ago. I fooled myself thinking I was getting better since I lost em. But this video had me balling. They say time heals, but not everyone heals the same. I hope and pray you guys and your family can get some healing and peace. You 2 are amazing, and can tell Jackie's father was as well. Much love, respect and support to you guys and your family.. Thank you for sharing this video, and congratulations on getting Caddy Jack driving and ready for some action. It's a one of kind car, and looks insanely badass!  Can't wait to see yall ripping!! Well..... bye.", "Condolences for your loss Jackie. It’s never a easy thing to go through. Your dad will always be with you and looking down watching you.", "My deepest condolences for both of you , may your dad watch over you and watch you carry-on  the torch of racing ...\nI'm sure  he was so proud you ...\nAgain so very sorry for your loss .", "My condolences to Jackie, chief and Jackie's family.  I lost my dad when I was 12 and the only thing that kept me going was knowing my dad would want me to keep smiling.", "Absolutely sorry for your loss.   It is an unreplacable person that brought you up right with love, passion and respect for a sport SO MANY of us love.  God speed, RIP", "Our prayers and condolences go out to you chief and especially to Jackie & her whole family. Nothing but love and big respects for the both of you.", "Ahh Jackie... You're making your dad proud!  Everything you do makes him proud, and I hope you remember that and hopefully it keeps you going and drives you to do more of it.  He had a passion for racing and YOU and chief are the largest influences in this sport! Real since day 1. Respect and condolences.", "Sorry for y’all’s loss, especially you Jackie…. Losing my dad sucked and was so hard, I know what you’re going through.\n\nHang in there;)", "sorry for your loss. thank you for everything you do for us fans, We will still be here waiting when the time is right for you to comeback.", "Praying for Jackie, you and her family! I can honestly say I know exactly how she is feeling as I lost my father a year ago and every time I fire up my Road Glide it makes that connection even stronger and helps the healing process, tell Jackie to hold her head high and smile cause her dad is with her everyday!", "We love you guys. Our thoughts and our prayers go out to Jackie. I know how hard it can be just never let yourself forget that fathers legacy lives on through you. Every time you put a car on the trailer and them packing. Look up at that bright shining star  that beacon of light and say that one’s for you dad. We thank you for taking the time make this video. Much love", "I'm very sorry for your loss, I know what your family is going through and it really hurts deep inside. Know this Jackie and Justin, he is looking down at you two and is very very proud of what you two have created. Now go show him what this BEAST can do and let it EAT!", "The car looks insanely good and sounds nuts. Take all the time you guys need. Sorry about your loss and it never gets easier.", "Much love and respect to you both and the family in this no doubt difficult time.", "My thoughts and prayers go out to you Jackie, Justin and your entire family. I'm so sorry for your loss  Rest in Peace  John  Braasch!   Caddy Jack is bad ass its good to see you 2  again!", "Condolences Ms Jackie and Chief. Caddy Jack looks like a sweet ride, job well done you 2", "Jackie im so sorry for your dad's passing, but the best thing you can do is keep telling stories and sharing memories of him. Allow everyone to love him as the wonderful man he really was.", "There's really no words to say that can make you feel any better about the loss of your father Jackie.  But I wanted to let you guys know that you have a great deal of support out here in California. My dream some day would be to meet you guys in person.  God bless and peace be with you  ️", "Jackie looked right at home in the drivers seat which is where she belongs and right beside you chief, you two are going to go very far in your lives", "My condolences to the both of you. Jackie may your father rest in peace!", "Sorry to hear about your loss! My deepest condolences to you and your family. I lost my pops 20 years ago and I still miss him everyday! This is something you never get over you just learn to live without!", "much love to Jackie and her family in this tough time", "Jackie if it means anything to you, I really want your dad to know how much I thank him for bringing you into the car world because Chief is my favorite racer and I have never seen his drive so strong and that's because of you ️ you brought us Chief in a personal level because we all know he can't use a damn camera without giving us a freaking seizure.  Your beauty and brains gives us all gigantic smiles and your passion and knowledge of racing gives idiots like me a drive to work on my own stuff.  I am so freaking sorry to hear about your loss and after you take whatever time you need,  please come back and get out there kicking ass in that gorgeous caddy.", "Condolences to Jackie and her family for their loss.", "Sorry for your loss!  Prayers going out to you guys!", "I am so sorry for your loss,  I hope to see backout there racing as I enjoy watching you both. I wish more people would realize that you are just a human like the rest of us trying the best you can the get through life.", "I'm sorry for your loss Jackie! We are here to support you guys whether you have to take some time off or not. I pray that your heart will heal and that you can find that ray of sunshine in racing or whatever else makes you happy. Justin my man make sure you stay by her side and comfort her whenever she is having a moment.", "This one's for you, John. Stay strong, Jackie!", "Jackie I had the pleasure of working with your father at the Cadillac dealership. He was a mentor and exceptional person. I remember the first time I saw a street outlaws episode and told him about the show. Who knew years later where you’d be. He’s smiling down on you every day because that’s the guy he was. R.I.P John", "Damn chief when you were talking about the man I started to tear up my heart goes out to you to Jackie and to the rest of the family may the man continue racing in heaven.", "Blessings to you and your family Jackie. You have my deepest condolences on the loss of your father. ️", "Happiest to see y’all back so sorry for your loss guys", "None of us knew your Dad. But the fact that he raised you to love this awesome, frustrating, expensive, badass hobby the same way he did. Speaks volumes to his character.", "So sorry for your loss Jacky \nI’m sure he’s looking down on you from heaven with a smile on his face just as proud of you as he can be.", "You are in our hearts Jackie and family. It’s a very hard thing to go through but, honor him in what you do. Love you guys hope it gets better and easier for you. Thanks for the update.", "Sincerest condolences for your loss Jackie. From a diehard fan of you and Chief all the way in South Africa...", "Sorry for your loss Jacky I hope you find comfort in the fact you know your father will be riding beside during every future pass you make!!! May he rest in peace and God bless all of you", "My condolences to Jackie and her family including chief. Just lost my mom know how it feels stay strong .", "Very sorry to hear about Jackie's dad. That is a loss very hard to handle. Best wishes for you both and all of her family.", "I am so sorry for the loss of your Dad,  and I am so glad you have Big Chief to help you thru this hard time.  Lots of prayers for you, Chief and your family.", "Thanks for updating your subscribers and the fans. Some of us had no idea for the reason behind the absence and I am very sorry for your loss. It was a somber video but so glad you shared it. We look forward to seeing Caddy Jack and Jackie making hits on the streets. Also looking forward to seeing what Chief has in store for his cars and if he will be participating in any upcoming races?", "Good to see you two back but I am very sympathetic to your loss. On to happier thoughts…Caddy Jack is awesome! I can’t wait to see it racing!", "So sorry for the family's loss thoughts and prayers for you guys", "Going through that takes a strength you didn't know you had. Much love to you and your family ", "Sorry about your  dad Jackie I hope you guys are OK!! great  words chief again sorry for your loss!", "Thoughts and prayers to you and your family ️ Caddy Jack is a bad boi. Can't wait to see that rowdy mamma jamma and both of you in the streets where you belong!", "Jackie and Justin. We are sorry for your loss. Time heals all, it is said, as nothing anyone of us can say will take your hurt away. But it will get easier with time. Love you both. Rest in peace John.", "Jackie I'm so very sorry for the loss of your Dad my thoughts are with you and your family . I loved seeing you in your car , but the tribute to your father touched a special place in my heart for my own that I miss dearly . Just know that your daddy is smiling down on you when you took Caddy Jack for a tour around town , keeping you in my thoughts Jackie  now go show everyone what you're daddy taught you about racing .... ", "Jackie and Justin, so very sorry to hear the passing of your dad, very heartbreaking for you Jackie. My wife and I are praying for you guys, please know that there are many people out there that care.", "He may not have seen the text in physical form but he saw it. And is damn proud. Loosing one or both of ur parents is one of the hardest things. (Coming from someone who has lost both).  It never truly gets easier. U just learn to handle it. RIP to him and prayers to y’all.", "Jackie I’m so very sorry to hear of your dads passing. I lost my dad in 2011. He too was a car guy. Glad to see you guys posting again, sometimes it’s best to keep busy. God bless and RIP John Brash  ️", "You guys are hands down my favorite racers. I know there's nothing anyone can say to ease your pain. Just as your Dad inspired you to be a badass behind the wheel, you guys as a couple have encouraged my wife to turn wrenches with me late at night too. We enjoy watching your channel more that the other street outlaw shows. You're definitely keeping your dad's legacy alive by doing what you're doing.", "RIP Mr John, Sending prayers to Jackie and her family during this sad time. Caddy Jack sounds so good.", "My deepest sympathy and condolences to Jackie's family and to you.", "RIP John, Going to miss him. He was a great guy. Best wishes to you Jackie and your family.", "Sorry for your loss, I wish you, Jackie and the family al the strenght needed to handle the paint and sorrow that comes with it. God bless y'all and greetings from Holland ", "You guys have built a bad ass street car!! Jackie ,sorry to hear about your dad, I'm sure it's been rough on everyone. I'm sure he is smiling down on you and enjoying seeing you in that car!!!! Glad you guys are back on. We have all sure missed you guys", "Jackie, I am truly sorry about your dad. I hope you get to feeling better with your car running again. You have sooo much support from your fans, it's amazing. Take care, we love you and God bless.", "My favorite YouTubers and racers. Justin, your words are true, and come from the heart. I feel your anguish. Jackie, carry the good thoughts forward in your life, wherever you go. I lost my mom several years ago quite unexpectedly, and though time takes you further away from that moment of separation, you will carry those wounds forever. People say it gets easier with time. It does not. You just learn how to press forward, and carry the spirit of your loved ones with you. That's all we can do. As I remind myself daily, No one gets out of here alive; it's all part of the great circle of life. I'm a brain cancer survivor and legally blind so I for one can tell you, you never know what trials and tribulations the next day may hold, so teach yourself to be thankful for what you have had in the past; family, friends and love, and accept what comes tomorrow with open eyes and an open heart. You will be okay. Trust in that. Honor the memories of your dad and what he stood for and lead a righteous life. That's all we can do. .much love and respect to the both of you, and your family.", "I lost my grandpa three weeks ago and my wife lost her mom two weeks ago. Our hearts go out to you both. Keep up the grind.", "Hell yeah Jackie! It sounds awesome! Congrats guys, totally badass!\nSo sorry for your loss, I will keep you and your family in my thoughts and prayers .", "I'm sorry to hear your loss jackie rest easy john!!! Prayers for u and ur family girlie", "Dear Jackie. So sorry to hear of your dad’s passing. I’m sure he was a very competitive father, which is where you get it from. He will be riding with you on every pass you make. And I’m sure he was very proud of you. Rest In Peace sir, you deserve that much", "Very sorry for y’all’s loss Love thoughts and prayers for you both "]}