{
    "video_id": "6-AT0vDXdsk",
    "comments": [
        "Sorry for your loss, no matter what I say on here it’s not enough! Prayers for you and yours ",
        "Sorry for your loss. My condolences to all of Johns Family and Friends.",
        "Dammmm sounds great bet that’s fine to drive",
        "Street outlaws season 6",
        "Sorry Jackie for your loss.",
        "Happy Thanksgiving chief and Jackie",
        "RIP John, Going to miss him. He was a great guy. Best wishes to you Jackie and your family.",
        "Condolences Jackie to you and yours  Gone but never forgotten & always in your heart ️",
        "Heart goes out to Jackie Chief and all the Braasch family may he R.I.P from the admin of All About Street Outlaws and DragNation ",
        "I'm so sorry for your loss I could only imagine what I must be like, I can't remember my father he decided not to be part of our lives since I was young I'm now 41 he still wants nothing to do with me, keep your heads up Jackie and Justin",
        "You guys are hands down my favorite racers. I know there's nothing anyone can say to ease your pain. Just as your Dad inspired you to be a badass behind the wheel, you guys as a couple have encouraged my wife to turn wrenches with me late at night too. We enjoy watching your channel more that the other street outlaw shows. You're definitely keeping your dad's legacy alive by doing what you're doing.",
        "The fire up I think I heard it from way over here in Oregon hahaha Caddy Jack looks amazing",
        "Caddy Jack is looking (and sounding) awesome, looking forward to future content. \n\nOn a side note, my parents lived in Wheatland, a few miles sw of y’all’s shop, about 25 years ago. I haven’t been in that area in years, it’s crazy how it all still looks the same! ",
        "Caddy Jack sounds fucking killer!! What kinda cam is that? almost sounds like your running a HOG ASS CAM but I can't 100% say!",
        "Holder wide sir sounds so mean ",
        "Stay strong Jackie, one day a time",
        "Dude that looks so badass I F___ing love it",
        "So sorry for your loss, Jackie.",
        "I’m so sorry for you all’s loss ! Prayers !",
        "So sorry  Jakie for your loss",
        "My condolences Jackie and prayers and blessings to you and the Family.",
        "Momma said there would be days like this. She just didn’t say there would be so many.",
        "I was just thinking today as I was watching a 6 point buck through my scope today on top a mountain here in Maine on how short our time is here on earth and I let him go plus I am hunting big deer not 6 pointers lol Jackie on a different note you and your family have my condolences I am very sorry for your loss and I am saying a prayer for you and your family and father Tonight",
        "Holy sht Justin fell off the earth and climbed a Ladder back up...about damn time fkkkkn hell hahaha missed ya guys brutha",
        "so sorry to hear of jackies dad passing will surely be praying for her",
        "God bless sweetheart sorry to hear about your daddy may he rest in peace.",
        "Sorry for your loss. I would like to say it gets easier with time. For me I lost my Dad two years ago and the pain has not gotten any easier. I just learned to cope and deal. Their is not a day go by that I am not thinking about my dad. We were into cars and drag racing. Took me to my first drag race before I could walk. I just miss my best friend.",
        "I’m so sorry for Jackie’s loss and your loss chief. We all love you guys and take all the time you need well always be here",
        "Best license plate",
        "Dam I'm really really sorry to hear that big Chief my heart goes out to you and your family I love you're show and your garage keep up the good work",
        "I’m sorry Jackie….\nMy heart hurts for you. Just make sure u make him proud. I can’t wait til u get lined out and ready for competition. I think a lot of people are going to be shocked. After what u did with JJ’s car with never driving it before I think shocked a lot of people. Including myself. Go get em gal and make sure they remember Caddy Jack!  ",
        " for you and her and your family we are guaranteed no tomorrow's.",
        "Sounds stock maybe a little mild chop",
        "Sorry for the lose. It's really sux been thru it myself.  Just push forward n keep the memories",
        " sorry to hear of the loss of Jackie’s father.  My condolences.",
        "Hey guys very sorry to hear seems like every time you get a blessing in life as in the caddy up and running something bad goes with that just hate it was that bad keep your head up Jackie and you too Justin  we all understand and most have dealt with the same issue and as Chief said its nice to see you happy about the car miss Jackie",
        "I’m sorry for your loss I to know the feeling of losing a dad I know the pain it leaves it gets better with time but it never goes away you and the family are in my thoughts and prayers ",
        "My condolences to her,  Prayers for her heart and piece of mind!",
        "This hits home for me, I lost both my parents 7 days apart four years ago, and it's still hard.. Much respect Justin and Jackie, your thoughts are with us.",
        "",
        "I'm dying to know man why u didn't do up a Small Block LS?! Caddy Jack sounding awesome bruh! Shes gonna be killing it!🇺🇸🇺🇸🇺🇸",
        "No much anyone can say to aliviate your pain right now.   Hope you have many good memories to look back on and bring a smile to your face in the tough days ahead. Sure he'd be proud.  My dad was the stuff of horror movies.  Won't miss him when he finally goes in all honesty. Horrible sadistic excuse for a man.",
        "Dang RIP!",
        "Sorry for ya lost from the bronx",
        "Sorry for your loss but plz know you got love and support from over the pond ️️Plz keep your chin Jackie just try your best to make him proud while he is watching over you xxx️️️",
        "sorry for the loss",
        "Oh wow.., so sorry for your loss Miss Jackie..    \n\nGlad to see y’all back with a new video though..  can’t wait to see Caddy Jack in action!!",
        "Prayers and Condolences to you all. Man, ain't no way I could drive that and not be tempted to twist it, at least once. Caddy Jack looks and sounds awesome. Looking forward to seeing it perform. Miss you guys.",
        "I am so sorry for your loss,  I hope to see backout there racing as I enjoy watching you both. I wish more people would realize that you are just a human like the rest of us trying the best you can the get through life.",
        "He may not have seen the text in physical form but he saw it. And is damn proud. Loosing one or both of ur parents is one of the hardest things. (Coming from someone who has lost both).  It never truly gets easier. U just learn to handle it. RIP to him and prayers to y’all.",
        "God Bless Jackie keep up the good fight !! Car sounds great !!",
        "Cars sweet",
        "So sorry for your family's loss. Know that he is watching over you from above and smiling greatly at what you are accomplishing.",
        "Aloha, \nThanks guys.   My condolences to you both. \nMahalo and enjoy your life.",
        "Nice work an respect to you Justin and Jackie, the Caddy Jack  sounds mean, now get out there and win some! Cheer Doug.",
        "My favorite YouTubers and racers. Justin, your words are true, and come from the heart. I feel your anguish. Jackie, carry the good thoughts forward in your life, wherever you go. I lost my mom several years ago quite unexpectedly, and though time takes you further away from that moment of separation, you will carry those wounds forever. People say it gets easier with time. It does not. You just learn how to press forward, and carry the spirit of your loved ones with you. That's all we can do. As I remind myself daily, No one gets out of here alive; it's all part of the great circle of life. I'm a brain cancer survivor and legally blind so I for one can tell you, you never know what trials and tribulations the next day may hold, so teach yourself to be thankful for what you have had in the past; family, friends and love, and accept what comes tomorrow with open eyes and an open heart. You will be okay. Trust in that. Honor the memories of your dad and what he stood for and lead a righteous life. That's all we can do. .much love and respect to the both of you, and your family.",
        "My condolences to Jackie, chief and Jackie's family.  I lost my dad when I was 12 and the only thing that kept me going was knowing my dad would want me to keep smiling.",
        "RIP",
        "what a awesome Cadillac,it looks mean and powerful, I love it, thank*u*4 sharing *",
        "She needs to make sure she keeps her head on straight and stay in a good headspace like you said 1 day at a time",
        "Jackie, that car is awesome. I wish my old truck sounded that good!   I'm sorry to hear about your dad. Mine is currently in the hospital on full life support.",
        "Man my heart skipped a beat when I seen you guys finally posted something. Been missing the hell out of you guys. Didn't know if you maybe had a falling out with YouTube or what.sorry for your loss Jackie. But so glad to Finally see you go down the road.",
        "Sorry for your loss Jackie our hearts and prayers are with you and your family and friends",
        "Are you guys gonna head to mega cash days?",
        "keep your head up jackie",
        "Wow well said chief. Love you guys. Caddy is looking great. Sorry for your loss Jackie but keep pushing forward us all you can do. ",
        "I'm so sorry for Ur loss,I'm a Scottish hardy guy n I had a tear in my eye,I don't cry or show emotion but my heart went out to Jackie,no words can help,they say it gets easier with time,no that hurt n miss is always there,my way of coping was I am adopted n thinking of my parents I think how lucky I was that I got to know them how lucky they loved me fully,I know it's fkn hard,unbelievably hard but smile big cheesy smile n think how glad u were to be his daughter n how lucky u were to have known him,somehow thinking this way has helped me cope, lean on the big chap whenever u need to n keep smiling,",
        "Hell yeah Jackie! It sounds awesome! Congrats guys, totally badass!\nSo sorry for your loss, I will keep you and your family in my thoughts and prayers .",
        "My condolences to you and your loved ones... we all have one thing in common,  we all have a date that we can't avoid... positive vibes sent ur way from Puerto Rico 🇵🇷",
        "Sorry to hear about her dad it's rough just do what you need to do to work through it. Got to say the car looks and sounds amazing",
        "Dammit justin u should have a disclaimer on this. I'm sad asf now.  I'm going to call my mom",
        "Sorry for y'alls loss!",
        "Jackie I had the pleasure of working with your father at the Cadillac dealership. He was a mentor and exceptional person. I remember the first time I saw a street outlaws episode and told him about the show. Who knew years later where you’d be. He’s smiling down on you every day because that’s the guy he was. R.I.P John",
        "My thoughts and prayers go out to you Jackie, Justin and your entire family. I'm so sorry for your loss  Rest in Peace  John  Braasch!   Caddy Jack is bad ass its good to see you 2  again!",
        "Was at my sons the other day fooling around in the shop and saw some tools I hadn't seen in a while. I asked him if he knew where they came from and he said yeah they were grandaddys. I knew this because I gave him one of Daddys old REM LINE tool boxes and they were in it. Well this got the memories and storys going we laughed and cried . Moral of this story is think of them often and know they always loved you good times or bad. Oh yeah Caddy Jack is bad, she's nationwide",
        "That made me very sad, guys. Shootin' massive positivity from THE GREAT PACIFIC NORTHWEST.",
        "Love you guys  hope time will heal your️‍ lost my dad year and a half ago and miss him everydayAloha from Hawaii ",
        "MUCH LOVE AND RESPECT, very well said. Prayers and condolences go out to you all and your families!!! ",
        " Thoughts and prayers to you and your family.",
        "WELLDONE WELLSAID GODSPEED & GODBLESS",
        "Sorry for your & Jackie's and family's loss . . .",
        "Car lookin Sexy AF!!",
        "Our thoughts and prayers are with you both. Take the time and do what you do. Hit the streets and make him proud",
        "Smallblock sounds great…. We have you in our prayers Jackie",
        "My condolences to the both of you. Jackie may your father rest in peace!",
        "My condolences to Jackie , family & friends. ",
        "It's nice to see a bulky Fire type starter for once that ain't just Incineroar. We've seen tons of offensive Fire types and while I do love them, it's nice to see some variety too and it'll most definitely do good with the defenses if given a chance, especially with Slack Off.",
        "Prayers for you and your family",
        "Chief, that was a great moment of remembrance. I lost my Dad 10 years and there’s not a day that goes by that I don’t think about my Dad and I working on his car or usually mine. The things he gave me can’t be bought. My work ethic and my dedication to my family came straight from him. ",
        "Man that caddy sounds good",
        "Sorry for the loss and prayers to you all!  Caddy Jack sounds good struck fear in my innards to line up with that!",
        "I know caddy Jack is a full blown street car now but that badass small block would sound amazing in the stock exhaust! I will be praying for y’all losing someone you love is extremely hard y’all take your time coming back to YouTube this isn’t what’s important Jackie being okay is what’s important",
        "Well, I'll be....we were going to send out a search party for you 2!",
        "@4:48 is that Farmtruck and AZN in that hearse again? ️",
        "Love the vids, keep it up!",
        "Jackie, I am so sorry for your loss. I am so glad you got all you did from your dad. He put all his best qualities in you and you came out to be an amazing woman. God bless you and your family. You all are in my prayers. May this time be a time of healing and reflection of past happiness and realization of just how proud you had made him by following your own dreams and being the incredible woman you are.",
        "Jeepers Chief been a while bud, what’s happening with the 405 list?",
        "So sorry for you guys.  Stay strong.",
        "My deepest sympathy and condolences to Jackie's family and to you.",
        "So very sorry for Jackie's loss of her father....  that is so incredibly sad.",
        "STOCK",
        "sorry for your loss.",
        "My condolences to both of you and yalls family",
        "So sorry to hear!  Stay strong and lean on each other in this time of sorrow.",
        "Justin please give Jackie  time and space but at the same time be right there for her it is a hurt that takes time to heal she needs you now more than ever before",
        "Gee  ??  Dear Jackie XX X OO O Dear Justin OOOO Lots of Love is all I have. I do know they have left until we catch up to them again . Lost my Mum and I know I will see her again Honestly no fallacy",
        "So sorry for both of your loss! You were saying you didn’t know where your dad got the saying Mama said there will be days well there is a song from 1961 from the group the The Shirelles called Mama Said so possibly that’s where he got his saying from ",
        "Hi Jackie, I am very saddened to hear about your dad. That’s extremely hard to get through but you will get through! My thoughts an prayers go to you an your family an Big Chief, Ive always enjoyed watching you an chiefs channel. I am Also glad to see your drivin Caddy Jack again. ",
        "So sorry for your loss Jackie.\nRIP John Braasch ",
        "Doesn't get any easier you just learn how to work with it and know that they're there with you every step of the way",
        "My condolences to Jackie and her family and made her dreams come true for her father I love the show",
        "So sorry for your loss Jackie I feel your pain i lost my dad this past February and have had a rough time ever since. I have recently built one of his engines he had and it’s in my 85 c10. It’s in his memory and I have lots of unfinished play toys he left behind so it will all be done in memory of my pops my hero my ROCK! Keep your head up girl put one foot in front of another and let’s let time heal us",
        "We are so sorry for your family. Oh my gosh that is tragic. He loves you and is very proud of you both.",
        "Much respect to you guys. Nice fitting tribute to Jackies dad.",
        "So sorry to hear that justin..Tell jackie the rage says god bless.",
        "I want to leave a comment,but have no idea what to say?  Rip John!",
        "That looks badass ",
        "Man sorry for you're guys loss  Jack is looking badass I'm sure your dad would want you to race on",
        "Hey Guys Take all the time you need! Jackie we all send our love to you and your family.",
        "Fricken Sweet",
        "Midwest all the way baby!!!",
        "Prayers and condolences to you Jackie first and foremost! A huge loss like that can be very difficult and consuming. Hang in there Jackie and slowly things will start to get a little better day by day. Until then always remember the good times and the fun times. GOD BLESS YOU GUYS AND YOUR WHOLE FAMILY, FRIENDS, AND LOVED ONES!",
        "Dont know if i simply been missing the video posts but was thinking the other day while watching NPK what u were up to. Im sure people have asked and u told 1000 times but is street outlaws the list is that still gonna be a thing? I really hope so but u would have to be there and thats more what im wondering. Regardless thanks for the video car sounds good coming through surround at 230 am amd the wife asleep in the bedroom thinking a tornados coming through the house",
        "start off by saying. so sry you,chief,family and friends can no longer see your\n Idol(daddy) anymore but he's not gone nor will he be forgotten. \n\nhe will be by your side in everything you do. and you can continue to make him proud  by not giving up. and give everything you do a 110%.",
        "Damn",
        "The plate️️",
        "Wow not expecting that. My condolences Jackie and your family from Australia",
        "our condolences ,on your dad's passing.",
        "Oh caddy Jack sounds awesome and looks awesome",
        "Sorry for the loss of your father Jackie. I lost both of my parents and it is the hardest thing to go through,  let Justin help. He loves you.",
        "So excited to log in and see this. And most importantly, sorry for your loss.",
        "My condolences Jackie. I know how hard it is.",
        "Best wishes Jackie, my heart goes out to you and your family. Those fond memories will always pop up of him and brighten your day, drive on and keep making your dad proud as you have.",
        "My heart goes out to you jackie I know exactly what you are going through. My dab was also taken away from me unexpectedly and even though it's been 18yrs there's still moments that it still hurts like it was yesterday but I promise it does get better with time",
        "Geeeesshhh bring back real cars of the 50's to early 70's these are plastic junk.",
        "I love the stock license plate",
        "Jackie there isn't any possible way to say the rights words that can heal your pain inside just remember to say the two words to your father in spirit and that's\" THANK YOU!\"  Now he will always be with and to help you keeping it full throttle!  My prayers are with you ",
        "Very sorry for your loss. It's devastating losing a parent.",
        "Very sorry to hear of this. Sorry for your loss.",
        "Thoughts and prayers to you guys and the family  Ive lost a mother and my only child I k ow how she feels It’s great to see her back in the car and her dad will be watching over her. Love you guys from Alabama!!!",
        "That is one BAD- ASS car best of luck with it... From a neighbor in Arkansas",
        "Jackie there are a lot of people that you have never even met out here that cares about you.   My condolences.",
        "Sorry for your loss...",
        "sorry for your loss Jackie prayers and condolences to your family .. I'm going to burnout for tribute and show respect for your dad and family",
        "RIP John, you done one hell of a job raising your daughter mate.",
        "Little Jacky in the huge caddy, looks cute ️ \nJacky, my heart goes out to you. My sincere condolences....\nBest regards from germany",
        "Praying for Jackie and your family. Didn't know where she got her love for racing. Very sad, I'm glad you shared her story.",
        "Sorry your your loss Jackie",
        "Sorry for your loss Jackie. Bad ass ride!",
        "Condolences for your loss Jackie. It’s never a easy thing to go through. Your dad will always be with you and looking down watching you.",
        "So sorry for your loss ",
        "Love it man!!!!",
        "I'm sorry to hear your loss jackie rest easy john!!! Prayers for u and ur family girlie",
        "Thoughts prayer and condolences go out to u Jackie Justin and all family I've buried both my parents it's hard and all u can do is the best u can do while going threw it",
        "I'm so sorry for your loss, Jackie \nAnd congratulations on Caddy jack's maiden voyage, lots of emotions in this video..\nJackie and family, Justin... My deepest condolences!",
        "Sooo sorry for your loss Jackie, jus know that when ur car makes u smile, its makin your dad smile down on u as well. Rip sir. The way tht car sounds, oh believe me hes def smiling!!",
        "Just got 2 Lil black cats named them chief and Jackie lol",
        "Our condolences from our family to yours.. I'm sorry the loss guys ️️",
        "Sorry for your loss. Keep up what you and your dad loved to do. Do it in his memory because that's what he wants you to do. I lost my dad in 1994 and I miss him everyday but I know that he's always here with me.",
        "Send you both and Jackie's family love and thoughts",
        "Car sounds awesome!  What starter is on that beast?",
        "Absolutely stunning \nYou two are bad ass",
        "vc é o melhor cara e corridas proibidas não é igual sem você,",
        "Dude that is a sweet ride",
        "Are deepest condolences Jakie. God I was just thinking that is the coolest car I have seen in a long time. Then hit with the news. God bless you all in this struggling time.",
        "My condolences so sorry to hear of your loss congratulations on getting caddy Jack done",
        "Our deepest condolences to Jackie and all her family. All we can do is move forward and keep doing what we do. That’s what our loved ones would have wanted. Race On Chief & Jackie. 🇺🇸",
        "Looks like that seat could come up a little bit",
        "Lost my Dad 5 years ago.  Hardest thing I  have ever faced. Praying for Jackie and her family.",
        "You guys our in my thoughts and prayers,  jackie I'm so sorry for your loss. You take all the time you need, everyone will always be here waiting for you guys caddy jack to the front ",
        "So sorry for your loss! Take care of that lady big chief! Car turned out amazing too!",
        "Sorry for your loss Jackie  Yesterday was 1 year of my Dad's passing and it still hurts   .. Thoughts and prayers for you and your family..",
        "️",
        "Her and The Rest of The Family are On My Heart and In My Prayers!!!!",
        "Sorry for your loss",
        "I am so sorry for your loss Miss. Jackie and would like to extend my deepest condolences to you and your family!\n\nGlad your keeping your head up, doing OK and still making you Pops very very proud ",
        "Dearest jax .our   r w u  on this trying time. Thanks   chief for de cool way u fi d it",
        "I tell you what man. No one ever tells you as you get older you start to lose your people in your life that mean the most to you. It's a real gutt punch that never seems to go away.  I was 33 when I received my first gut punch. All I can tell  you is you'll have to fake being normal for awhile.  But eventually you will start actually feeling normal. And your tears will be while your smiling or laughing at memories of your father.",
        "I'm sorry for your loss , loosing your dad is tough . i miss my dad every day",
        "Jackie and Justin, so very sorry to hear the passing of your dad, very heartbreaking for you Jackie. My wife and I are praying for you guys, please know that there are many people out there that care.",
        "Dam that look good,, my condolences to you dad Jakie it's fucked up but we all go through it , time will heal all wounds,, RIP JOHN",
        "Dam ",
        "My condolences to you Jackie. R.I.P. John",
        "My brother mom always said there would be days like this\n.\n..",
        "Well damn it,,  so sorry to hear about Jackie's dad.    My mom passed Oct 27 so I can relate to the pain..  wish I had something to say that would help ease the pain...  but.",
        "I'm sorry to hear about Jackie's dad! Love watching your videos and hope to see more in the future but I understand about Jackie and hope her love for him doesn't stop her from doing Amazing things! God bless y'all ",
        "My prayers to Jakie and her family. Glad to see caddy Jack up and running always run that car and think of your father",
        "To Jackie and Justin my heart goes out to you guys. I know the feeling. I glad she gets Joy from the racing because there's nothing like the rush from good engine or any of us to chase The blues away. Best wishes",
        "I’m so sorry for your loss!! Sending all the best! Caddy Jack looks amazing! Great work!",
        "My condolences to you all. Losing our parents is so difficult \nCaddy Jack sounds bad ass can't wait to see Jackie hurt some feelings with it.",
        "Dam! I'm very sorry for your family's lost guys! You two deserve the world!!! And now you both have a guardian angel riding shotgun !!! God bless you both! Stay strong ",
        "No words….. I’m sorry. :…(",
        "I lost my grandpa three weeks ago and my wife lost her mom two weeks ago. Our hearts go out to you both. Keep up the grind.",
        "I'm so sorry for your loss it sucks I know I lost my dad last year",
        "The Caddy ain’t bad either!",
        "I’m so sorry for Jackie tell her to stay strong I lost my mother and I had to remember that she wanted me to thing’s that make us happy and live life.",
        "Too exotic to be much fun. 700 hp = big fun. 1200 hp = no fun.",
        "Nice car! \nIt's sounds great but still silent from a far.\nNot to be picky or anything, on the test drive around the streets, I think that she's forgetting the turn signal! ",
        "Jackie sorry for your loss and heartache hope your memories of your father lasts for a lifetime your car is awesome",
        "Holy guacamole!!! The first clips of starting the caddy resembles the inside of a space shuttle.  Maybe the caddy jack will reach the moon since supposedly last landing.",
        "Heart goes out to both of you. You will always think about him, you will always miss him, as with family. Having lost 3/5ths of mine in a 5 year span.. I've been there and it's tough to say the least. Always keep pushing on, chase your dreams whatever they may be, and know in your hearts that you're never alone. Even if loved one's have passed, they are always with you in everything you do, and know they would want you to be happy doing what you love. I'm sorry for your loss and prayers to your family. Take time for yourself, take time for life, and know the community is always here to support and love you both.  Much <3 to you and yours!",
        "Sorry for your loss. Sending prayers for you, your family and friends.",
        "Thoughts and prayers  for you'll in your time of sorrow. I can only say I'm sorry you have to bare the pain of losing your Dad, Jackie. I hope you can find happiness in the sounds of Caddy Jack and it only brings your happiest most cherished memories of spending time with him. Take your time healing, your following will be waiting for as long as it takes. You guys are the best! God bless you and your family.",
        "Sorry to hear that Jackie.  I absolutely love racing with my dad, he's in his 70s, I'm blessed, and I dread the day he no longer can do it.",
        "Condolences to you both and all family and friends. Let his smile and wise words guide you in your hard times of life. He doesn't die if you remember him brightly. Pass him on to the next generation and let them not forget him either. Prayers are with you all. Let the rumble of nasty motors and quick wins bring smiles to you both.",
        " big love to you both ",
        "Nice ride. Take good care of her and yourself",
        "My family sends all our love and prayers ",
        "Brought tears to my eyes reminded me of the night i held my dads hand as he passed at home like he wanted so i feel for you guys my dad did not want to die in a hospital so when he was dieing of cancer i put my life on hold to give him his wish. I am so glad i have that memory so just grab a good memory jackie and hold it close. Right now it may not seem like it but he is in a better place. he is with my dad. Big hugs to you both and now i am sorry but needs be done. Slap now you 2 get back to what makes you you and race your dad would not want it any other way.",
        "R.I.L CONDOLENCES",
        "I’m so sorry for your loss, Jackie just remember your father is always looking down on you",
        "Sorry to hear about Jackies dad passing........Prayers coming for her and her family along with you and your family",
        "So just a video of a stock cts v riding around lol",
        "It has 4 wheels and it's very fast",
        "My condolences to you guys and your family. Great video justin keep your heads up he will be watching from above",
        "The car is looking and sounding amazing!! I'm so sorry to hear about your father,  I lost mine back in 05, but I'm sure he's looking down with a smile on his face every time you fire that beautiful caddy up!! Thanks to you both for the great content ",
        "WOW, Jackie so very sorry for your loss I know you folks don’t know me but I mean this very deeply, I’ve been there and through time it will get just a bit easier but it’s never gone you have a piece of your heart missing and you won’t get it back but your memories of your Dad will keep it at bay so as Dan of you and justice again my deepest condolences to you and your family God Speed 🇺🇸",
        "Man it sucks then this happens. I see so many guys work and work and work for money instead of retire and spend time with the family. Don't wait to long bc tomorrow may never come.",
        "Caddy Jack sounds GREAT!!",
        "My condolences guy's! So sorry for your loss! Jackie, I'm sure your dad was looking down smiling watching you driving around in the Caddy.",
        "You guys have built a bad ass street car!! Jackie ,sorry to hear about your dad, I'm sure it's been rough on everyone. I'm sure he is smiling down on you and enjoying seeing you in that car!!!! Glad you guys are back on. We have all sure missed you guys",
        "Did you debate on them big bullhorn with the hard 90degree bend in em with the ones you out on ?I like them offensive bullhorns lol",
        "Rip to Jackie’s dad",
        "Caddy jack sounds nasty and is so sick",
        "Nice very nice!!! Sounds beast for a little ol 383 ",
        "Our deepest condolences. There’s drag strips in Heaven ",
        "There'd be days like this, my mamma said...",
        "I still remember the picture of Jackie in the dragster with her Dad standing next to Jackie. Beautiful picture",
        "So so sorry for y’all’s lose. Losing a dad is not easy. I lost mine in 2004.  As you said Big Cheif…dads are special.",
        "Moma said that they'll be day's like this & don't forget?",
        "Condolences Jackie to you and your family. Death sux. The amount of time everyone grieves is different depending on their relationship. But I told everybody when I go not to mourn for me but to celebrate my life. I'm sure he was proud and excited to go racing with you. Keep your head up and celebrate by showing him all the hard work u put into caddy jack. Much respect, love, and prayers.  ",
        "Is there anyway you can increase the download volume? Even turned up all the way it's still low on my phone or headphones thank you!",
        "It's hard losing a loved one but everytime she fires her hotrod up he will be with her. I can't wait to see it making passes",
        "So sorry for your loss Jackie it's never easy losing a parent no matter what age you are never know when the good Lord's going to call us home tomorrow's never promised to any of us, but the caddy Jack for real is looking very sharp love the looks of it. Keep your head up",
        "It took me minutes to arrive here. To my favorite YouTube shorts channel.",
        "Shout out to dads.  Very nice tribute.",
        "Prayers ",
        "Thoughts, and prayers",
        "My condolences to you and your family Jackie",
        "Very sorry for your loss. The car sounds awesome. Why not finish his car when you get through the loss?",
        "It means some days there are no words, there is nothing anyone can say to make anyone feel better.",
        "Come back to race on TV even if you run solo we all miss you big homie!!!",
        "Damn that thing sounds mean,nice job guys,",
        "Sorry to hear her pops passed. But, that caddy sounds sweet! Awesome job as always u 2! Those who  together stay together ️!",
        "Very sorry for your loss . That is so very sad my prayers are with you and Jackie love you guy's my heart goes out to you",
        "Caddy jack is sick af",
        "️️ Jackie, I wish I had the words to heal the wound of your loss ,but just know that many of us are holding the space of love and support for you during this time.. ️",
        "sorry for your loss",
        "Sorry for your loss Prayers for all!",
        "Jackie I'll never know what you are feeling or to lose a parent..\nOne thing that I would like to say..\n\"GOD ONLY TAKES THE BEST FIRST \"...It's all I can think of to say to you and just like you caddy Jack I hope that you even smile for a second...very sorry hearing about your loss...deepest sympathy to you from mine here in Ireland....",
        "So sorry for the family's loss thoughts and prayers for you guys",
        "YOU NEED TO GO BACK & RACE WITH THE 405 CREW AGAIN BIG CHIEF!!!!",
        "Going through that takes a strength you didn't know you had. Much love to you and your family ",
        "Condolences to you guys and to her family Chief ",
        "Jackie, I'm so sorry to hear about your dad! Stay strong, think what he'd want! My condolences go out to you, and your family is in my prayers!",
        "My condolences to all who loved him in your time of need. I'm glad the fire he gave for racing is still burning bright and I'm sure he will watch her continue to do great things.....️.",
        "Prayers for Jackie ",
        "#roogasforjohn",
        "Sorry you 2 about Jackie's dad that suks keep ur heads up high you definitely worked 4 it",
        "So sorry for your loss. No words can ease your pain. . Take care.",
        "Condolences and Prayers to you Miss Jackie . Our Hearts , Thoughts ,and Prayers go out to you and your family. \nWe love you and Chief and God Bless You Both .",
        "Both of you keep your heads up, Chief/Jackie! Caddy Jack sounds NASTY!",
        "Prayers for Jackie and family, just remember He is with you always, ",
        "Well fuck, sorry for your loss Jackie. May your father R.I.P.",
        "Wow ️ my condolences to Jackie and her family",
        "love and prayers to jacki and all her family! RIP JOHN! ",
        "I've never heard a small block sound as good as this one dose .\nIt sounds like a big block .\nThe engine has to be making close to a thousend horsepower.",
        "I'm sorry to hear about the Lost In The Family sometimes it's very dedicating and tearing of the heart when you love for someone you care so much about I can hear it in your voice that's you are also hurt I still wish you guys the best of luck and the best of life",
        "So sorry to hear my family will be praying for yall I can't imagine what yall are going through  love yall  God bless",
        "sorry for Jackie's loss....",
        "Jacky and chief I just want you to know that when our loved ones pass we don't really loose them we gain them as angels that are with us every day forever and ever",
        "Praying  for your family",
        "Condolences! Hope peace comes soon! Good to see her in the car making progress.",
        "Condolences to Jackie and her family for their loss.",
        "The car is Wicked beyond belief and I would bet anything her Father would feel the same way!",
        "Loving the new grocery getter...\nNow go kick some teeth in with it girl!\nMad respect for you pushing forward.\nYour dad will ride with you everyday...",
        "your content never seems to disappoint me,keep it up! =O:)",
        "Sorry for y'all's loss. ",
        "Can she please talk just a little bit louder",
        "So sorry about ur dad Jackie",
        "I am so sad for your loss Jackie!!!! Your Dad's legacy lives on in you!!!!!",
        "Jackie, I'm truly sorry for your loss! I know how you feel, I just lost one of my twin boys on Nov 2nd. His name was Trevor Lee Hickman. He was 26 & loved watching racing with me. He especially loved watching y'alls channel. He passed from an unexpected sudden illness. I'll keep you & your family in my prayers!!\n   Justin, you did an awesome job with the tribute for Jackie's dad.",
        "Hamilton is setting the small tire standard at 28×10-5 NON-W.  that this will be the “biggest tire allowed” at the 2022 “Mega Cash Days.” $100,000 to the last man standing.",
        "I’m so sorry!",
        "Dudes, my shop is next door and it was shaking the walls, I thought it was the train till I stepped outside. Had my balls tingling when it finally dawned on me. Super rad to see it goin. My thoughts go out to you, Jackie, and the family. The loss of a loved one is never an easy thing.",
        "I lost my Dad to cancer this year, so this was an emotional video for me. I feel your pain. It doesn't seem to get any easier. I wish you both comfort and happiness in this time of loss. I can't wait to see you back on the streets proving the haters wrong!",
        "Hope all is good praying for her and family",
        "I'm so sorry Jackie and Justin. Nobody is promised tomorrow,ya'll are in my thoughts",
        "Car looks and sounds awesome. License plate is a great touch. Very sorry for your loss",
        "It figures half way through the video someone started cutting onions and the rest of the video was blurry!\nJackie I’m sorry for the loss of your father but just know he’s with you still as long as you keep his memory alive! Talk about him every chance you get I promise you it will help. \nOn a lighter note….. caddijack is back!!!!!! And chief is crew AF ! ",
        "Omg I am so very sorry to hear that! Your families are in my prayers!!",
        "Sorry about your  dad Jackie I hope you guys are OK!! great  words chief again sorry for your loss!",
        "My condolences to you two,  By what Justin said in this video about your father Jackie, there is one thing for sure  your father heard your motor start up, and will be by your side in all your runs and everything else you do that is hard or easy. Keep doing what you do and enjoy it as you have been doing. Later",
        "I'm so so sorry for yalls loss I know Jackie talked about him alot he must have meant the world to her praying for yall and yalls family",
        "My deepest Condolence Jackie just remember he is always with you.",
        "Very sorry to hear about Jackie’s dad",
        "They say time heals all wounds, but you never get that part of your heart  back.Godspeed you all.",
        "My condolences to Jackie, Justin, and all of the family and friends. I'm truly sorry for your loss.\nI'm glad she's doing something to make her smile again and he's riding with you on that first test drive, every pass, and every drive from now on.\nR.I.H John Braasch your amazing legacy and passion will live on forever in all of our hearts and memories. You will be missed by all.",
        "Condolences and Prayers for the entire family!",
        "That car is bad ass",
        "RIP Mr John, Sending prayers to Jackie and her family during this sad time. Caddy Jack sounds so good.",
        "So rad. I miss my CTSV and it wasn't 1% as cool as Caddyjack",
        "We love you guys. Our thoughts and our prayers go out to Jackie. I know how hard it can be just never let yourself forget that fathers legacy lives on through you. Every time you put a car on the trailer and them packing. Look up at that bright shining star  that beacon of light and say that one’s for you dad. We thank you for taking the time make this video. Much love",
        "Absolutely sorry for your loss.   It is an unreplacable person that brought you up right with love, passion and respect for a sport SO MANY of us love.  God speed, RIP",
        "Praying for Jackie, you and her family! I can honestly say I know exactly how she is feeling as I lost my father a year ago and every time I fire up my Road Glide it makes that connection even stronger and helps the healing process, tell Jackie to hold her head high and smile cause her dad is with her everyday!",
        "Omg Jackie I’m so sorry I know how it is wen you loose some one you love very much . He will keep you safe and watch down on you from heaven",
        "Holy chit tugging at my heart strings  so sorry for your loss to both of you. Much love from idaho stay strong. And caddy jack is on point looks,sounds,and driver lol",
        "Jackie all I can say, I'm so sorry for your loss. We love you!",
        "Just remember he is still with you and will be every time you get in your car a dad is a hard person to lose",
        "To CHIEF & JACKIE DON'T FORGET THEIRS SOMEONE  UP ABOVE. THANKS FOR UPDATE THUMBS-UP AND GOD BLESS ALL",
        "My condolences chief/Jackie. I just lost my grandfather a few months back and my wife just lost her step dad last week so I feel u the pain hurts so badly and that void u can never fill ",
        "Just watched. I have no words. Prayers for you  both.",
        "Condolences ",
        "I'm sure your dad always watched you as much as he could and he was so proud of his daughter . Now he will be watching over you always smiling down prouder than ever and keeping you safe .",
        "Jackie,  heartfelt condolences from West Virginia....thoughts and prayers are with you and the family.      And the car looks and sounds amazing, and I can't wait to see you racing",
        "My deepest condolences Jackie he will always be with you",
        "Jackie looks nervous \nCaddy Shack Looks Great,  Awesome, Sounds Great ",
        "Sorry for your loss Jackie. Love y’all both and keep doing it your way!! To hell with the rest.",
        "The car is beautiful!",
        "Sick sounding and im subbed,Billy from SRC said check out this sick caddy,hes doing same as his pops Old Man Bill,racers spreading the love,they dont have to but it benefits us viewers etc,love your work and added to subs.Street racings comming back hard.",
        "So very sorry to hear of your loss guys.",
        "That car is bad ass ppl don't understand the work it takes to get it to that point all the electronics in a caddy for the door n windows to keep them working like OEM is amazing sry for ur lose Jackie",
        "Sorry for your loss and very glad to see that the car ready to go for her. Sending positive energy guys",
        "Jackie so sorry for your loss, much respect to you Big Chief for the way you put it out there y’all two have a very special relationship glad for y’all. And Caddy Jack is beautiful y’all put lots of work into it and it shows race on!",
        "All this time people been thinking u be doing big boy shit...well news this is the big boy shit right here...great man...and always a number one fan...wv",
        "My condolences",
        "Get Jackie a freakin book to sit on!  3:36",
        "Aww Jackie and Chief I’m so sorry for your loss! Never in a million years did I see that coming! Wow! God Speed to Jackie Chief and the family! My hearts broken for you Jackie! I’m sorry for your loss! PEACE",
        "Good man way to be there for her she will always remember that. Life is so precious everyday is a special day",
        "I'm sorry for your loss Jackie! We are here to support you guys whether you have to take some time off or not. I pray that your heart will heal and that you can find that ray of sunshine in racing or whatever else makes you happy. Justin my man make sure you stay by her side and comfort her whenever she is having a moment.",
        " LOOKS LIKE JACKIE MAY NEED A BOOSTER SEAT TO SEE OVER THE SCOOP ",
        "Condolences to You and Jackie..",
        "I’m so sorry to hear that. \nYou and Jackie and your families will be in all my prayers",
        "Bbboout daaam time ️ ssoonn",
        "Damn Jackie and Justin I'm so sorry you guy's... I love you guy's from the bottom of my heart and I always will!",
        "F'n beautiful kids !!!",
        "That's sad I'm sorry to hear this.",
        "OG QUESTION FOR YOU.  Can you please tell me what you consider Street car or Truck . I have a 91 Dodge Dakota I feel like if I hear it from you and build it I can say I actually got the official word from OG",
        "God bless you my friends. So sorry to hear of your loss.",
        "Mama said there'll be days like this is a song Justin... check it out.   Peace and Love to your family and hugs for Jackie, so sorry for her loss. It's tough to handle. I know.",
        "I'm sorry to hear that her Father has passed away. My condolences to Jackie and her family. I have lost my Mother and they say that, with time it gets easier. But I have to say that it's not easier, because I have a hole in heart that has never healed. But I know that I have to keep moving forward, because I know that my Mother wants me to keep  moving forward in life. So I just wanted to say, we know that our parents never want us to stop, but to move forward and live the life we want. You will always have your Dad with you and in your heart. Make him happy and proud and live your best life, until you meet him in your new life, in Heaven with our Father,  God. God Bless you and your family and Chief. Thank you for sharing this moment with us. Love your channel, and I can't wait to see more Cadi Jack videos.",
        "Prayers to yall I no what yall going threw",
        "Very sorry for your loss. Prayers to all.",
        "Nice Build, you guys Take Care ",
        "So sorry for your loss jackie, I lost my dad a year ago and we had been racing cars our whole lifes as a family, i know the pain your going though. ",
        "Condolences to Jackie, you, and your families.  Our thoughts and prayers are with you.  Glad to see Jackie enjoying driving Caddy Jack.  I love that Caddy Jack has power windows!!  Who knew!?!?!?!?",
        "Rest in heaven in peace knowing everyone  will always remember you and all the love and knowledge you instilled in your daughter.  My respects to you and prayers for the family , I love y'all and God bless you and your family Thank you for sharing the story Big Chief & Jackie",
        "Lol welp. Left Justin swanstroms video asap when this click showed up!!",
        "God bless guys",
        "Bro it’s a reminder ( every day above ground is a good day ) no matter how bad it is",
        "Miss Jackie, know your father was blessed to have LOVE that only a wonderful family like yours can give.",
        "You guys didnt have to share this with us. So thank you for being transparent..and im sure this is part of the healing process..after the video when it switches to Jackie in Caddy Jack rolling down the window..i felt it in my heart..As a father im sure he would want you to enjoy life to the fullest and enjoy every moment racing and living life .",
        "Sorry to hear about your dad, praying for you and your family.",
        "I wasn’t expecting all this before watching the video. \nGreat people",
        "Are condolences God bless you all",
        "Love to Jackie and family. And I agree  Daddy is in the Caddy with you Jackie.  That's a great thing. You're giving your Dad his dream.  Love ya girl. And Chief, you're a good man. And a great partner for that young Lady.",
        "I'm sorry for your loss Jackie!! My thoughts and prayers are with you  ️.",
        "My condolences to Jackie \nHope the future for you both just gets better",
        "So sorry. God bless. On the funnier side, get jackie a booster seat please lol",
        "Yes this video hit me in the feels also, my thoughts and prayers go out to Jackie and her family and to you chief.",
        "Jackie im so sorry for your dad's passing, but the best thing you can do is keep telling stories and sharing memories of him. Allow everyone to love him as the wonderful man he really was.",
        "Beautiful sunset on a sad day our condolences to you and big chife ",
        "Love the video and so sorry for your loss Jackie.  Much love and many prayers brother.",
        "The car looks amazing. You have my prayers Jackie.",
        "Jackie and Justin. We are sorry for your loss. Time heals all, it is said, as nothing anyone of us can say will take your hurt away. But it will get easier with time. Love you both. Rest in peace John.",
        "Didn't realize it's been 2yrs already.",
        "Rip to your daddy first. There’s nothing like losing papa bear. Also y’all should put some more cage in caddy Jack. Love it but I’d put a few more bars around the drivers seat. Love y’all",
        "Very sorry to hear about Jackie's dad like you video and missing them over the months so understand now stay safe and more speed from Halifax England 🇬🇧",
        "Very sorry to hear about Jackie's dad. That is a loss very hard to handle. Best wishes for you both and all of her family.",
        "Man so sorry for yalls lost God bless we are praying  for yalls family",
        "When Reaper see’s your running the same wheels he’s running on his new vette he’s gonna burn the whole car down ",
        "Horsepower cures the soul. Especially knowing who will be riding co-pilot.",
        "Sorry for you loss Jankie ... RIP SIR !",
        "Jackie looked right at home in the drivers seat which is where she belongs and right beside you chief, you two are going to go very far in your lives",
        "Very sorry for your loss Jackie.  Now you know you have a guardian angel on your shoulder everytime you fire up caddy jack.",
        "Jackie I’m so sorry for the family loss prayers going up for you and your family I understand what ur going thought I lost my dad in 2012 and it doesn’t get any easier sweetie I for you and I’m really excited about you getting caddy Jack back to together you can see the happiness on your face right along with the sad try to be there for momma the most you can be ",
        "Sorry to hear about her father passing. It’s never easy and doesn’t get any easier. We just grow stronger.",
        "Jackie if it means anything to you, I really want your dad to know how much I thank him for bringing you into the car world because Chief is my favorite racer and I have never seen his drive so strong and that's because of you ️ you brought us Chief in a personal level because we all know he can't use a damn camera without giving us a freaking seizure.  Your beauty and brains gives us all gigantic smiles and your passion and knowledge of racing gives idiots like me a drive to work on my own stuff.  I am so freaking sorry to hear about your loss and after you take whatever time you need,  please come back and get out there kicking ass in that gorgeous caddy.",
        "I’m so sorry Jackie. My condolences. ",
        "Prayers and love's and strength in Jackie's healing process  ️",
        "Sure didn't expect this. All of my thoughts, and prayers to Jackie, and her entire family! RIP John   PEACE ️",
        "Sorry for your loss.   That has to be a tremendous blow.   = \\    CJ sounds terrific.    beast mode engaged.",
        "That is one bad ass looking car. The small tire guys better watch out.",
        "As a v2 sedan owner, you took the ugliest version of the V(the coupe), and made it even uglier. The girl isn't that pretty, either.",
        "So sorry for your loss",
        "Sorry for your lose homie",
        "The world was a better place when you'd get made fun of at a Tractor Pull in Kentucky for having exhaust like that. It sounds like it's drowning and it looks like a mobile toll gate. When people walk by bull horns I often wonder if they don't just toss change in naturally. On a positive note- It's hard having a black racecar and keeping the paint nice, the car is exceptionally purty. The fab and wiring seems very purty too.  While originally not a fan of this body style, I love seeing anything other than the 4 cars currently popular as a tire smalls and I think you should get the hit against any racer who mis-placed the doghouse back at the barn. That car is way too classy for street racing around these parts. I'd hit up a good bike blessing at the nearest Legions this spring.",
        "So sorry for the loss prayers and thought going out for y’all",
        "Bitter sweet. Caddy Jack is lookin mean, sounds so obnoxious. Love it. Condolences to Jackie, Chief, and the Family. I'm sure he was an amazing Man, he will surly be missed.",
        "Sorry for your loss Jackie.  I'm sure your Dad was proud of you.",
        "Much love and respect to you both and the family in this no doubt difficult time.",
        "So sad too hear that RIP",
        "Sorry for your loss of your dad Jackie We all love you all Stay safe  Keep your head up high Keep up with your work yo",
        "That , is ons badass sick ride !",
        "I think she's a gourgus young lady",
        "I'm sorry to hear about your father jackie. Praying for you and your family ",
        "Sorry for your loss.",
        "I am so sorry to hear about the passing of Jackie‘s father  prayers for all the loved ones Family and friends. It is so heartbreaking that this happened at this time in life. I know he will be in heaven looking down and he will have the best view of what’s happening in Jackie’s Life and the family and he Will always be her protector and angel . ",
        "sorry for yalls loss......are yall going to mega cash days?",
        "God Bless You All, Sorry for Your Loss!",
        "So sorry girl I lost my mom Tuesday before last just been over a week now you guys when your ready please try tho keep doing what you all do your content and a lot of other YouTubers gets me threw each day love y’all",
        "Wow. Im watching the video happy for you guys and obviously had no idea what Jackie is going through...My heart goes out to you and your family!May you find peace and happiness throughout your guys days together. Go and gap some people like im sure your dad would want!Thank you for sharing this and it really does put life in perspective with sharing this sad news.Thank you Chief and Jackie!God Bless",
        "So sorry for your loss Jacky \nI’m sure he’s looking down on you from heaven with a smile on his face just as proud of you as he can be.",
        "Condolences to you and your family, it's never easy losing family let alone immediate and close family, you'll pull through with time you just need to stay strong!!! Side note it's great to see that Caddy Jack has come up as one bad hotrod.",
        "Hey look it’s a video! 0:29 ",
        "My condolences to all you guys and especially Jackie.",
        "sorry for your loss. thank you for everything you do for us fans, We will still be here waiting when the time is right for you to comeback.",
        "Courage to you, Jackie, may your dad rest in peace.",
        "Sorry for your loss Miss Jackie take time be well.",
        "Respect",
        "If either of u need to chat I'm here I lost my father 17 years ago its very hard",
        "Sorry for you all lose.. hopefully you can race his car ( as the driver) with her in some upcoming events",
        "Prayers for you all ",
        "Awesome!",
        "So sorry for your loss you and your family will be in my prayers",
        "@ Jackie Braasch. My  friggin notifications were off bc I changed phones! That’s not what’s important though. Jackie, my sincere condolences  for the loss of your father. I’m sure your Dad is extremely proud of you .",
        "Sorry for your loss. RIP.",
        "Sorry to hear about your Dad Jackie. Honestly",
        "Man as i sit here in my car on my lunch break my eyes filled up with tears. Im very sorry to here  and the sadness you must feel. Justin the days fly by faster and faster at our age so try and make the best of it buddy.",
        "Sorry to hear about your loss Guys.",
        "my thoughts are with all of you during this time , I'm sure Mr Braasch will be looking with a big ass grin on his face watching jackie drive caddy jack on the streets, and that smile will only get bigger when you put the whoopin to who ever gets next to it! keep up the good work team!",
        "Ssundee will never fail to entertain us. . .even if he wanted too",
        "I'm sorry for your loss,you guys are awesome people good luck. ️",
        "Condolences for Jackie and her family you as well chief.",
        "Sorry to hear guys ",
        "The big/little engine sounds awesome. Hopefully we can get some nitrous tuning tips from chief in a later video.",
        "Really missed hearing from u 2 but now understand why Sorry to hear about your dad Jackie but remember he's next to u in Caddy Jack take care both of u and be strong remember take everyday strong and enjoy",
        "Sheesh it sounds good",
        "So sorry for your loss!",
        "They say keep your head out of the clouds but it is kind of hard when the cabin is full of tire smoke ️ 405",
        "Damn man I’m sorry for your guy’s loss let’s watch Jackie steal cash days",
        " WE LOVE AND RESPECT YOU GUYS. TAKE YOUR TIME AND GRIEVE AS MUCH AS YOU NEED... WE WILL BE HERE FOR YOU. WHAT AN AWESOME TRIBUTE TO YOUR DAD. KEEP DOING WHAT YOUR DOING IN HIS MEMORY... AND CONTINUE TO MAKE HIM PROUD, IM SURE HE IS AN ALWAYS BE WATCHING OVER YOU AND SMILING DOWN. ",
        "Jackie I'm so very sorry for the loss of your Dad my thoughts are with you and your family . I loved seeing you in your car , but the tribute to your father touched a special place in my heart for my own that I miss dearly . Just know that your daddy is smiling down on you when you took Caddy Jack for a tour around town , keeping you in my thoughts Jackie  now go show everyone what you're daddy taught you about racing .... ",
        "None of us knew your Dad. But the fact that he raised you to love this awesome, frustrating, expensive, badass hobby the same way he did. Speaks volumes to his character.",
        "Positive thoughts and prayers for you guys in this difficult time.",
        "Sorry for your loss!  Prayers going out to you guys!",
        "Tht thing is SWEETTTTTTT! yes sir ! the 100%",
        "The caddy is super bad ass!",
        "Hello from Michigan Jackie I'm so sorry for your lost sending many prayers for you and your family and your caddy sounds fantastic .",
        "I needed this.  Love y’all",
        "Really sorry you had to go through that Jackie  much love and respect to you guys.   Can’t wait for what is to come.    Time to show everyone what that NOS can do!!!    I’m sure he is looking down and smiling when you were driving Caddy Jack around.",
        "Dear Jackie, I to recently lost somebody that I was really close to so I know how you feeling. And I was not expecting the end of this video so personal and it’s been my experience with other Youtubers that I watch when they take a break they don’t tell us and Justin‘s right we never know when it’s our time and we never know if we will get a new season",
        "Sad to hear her dad had passed, stay strong Jackie Dads to their daughter is a special relationship sad news",
        "GOD BLESS .",
        "My condolences to the both of you. Keep your chin up, tomorrow is a new day. “Race in peace” John B.",
        "I still think caddy Jack needs a musi959. I think that would be badass",
        "My condolences to you guys. My grandfather was the reason I enjoyed anything to due with cars and when he passed on, so did my joy for cars for awhile. It took years for me to find enjoyment out of cars without thinking of him. Prayers to Jackie for getting through these tough times. Godspeed John ",
        "Sorry for ya'll loss God bless ya'll ",
        "Rip my condolences",
        "That small block sounds insane!!!",
        "So sorry for your loss Jackie.  Praying for your family",
        "Sorry to hear about Jackie‘s dad our prayers are with your family",
        "Hell yeah ,thing has aMean stance and Sounds Gnarly now!",
        "Condolences and Godspeed",
        "RIP my condolences to Jackie and the family.",
        "This one got me my long time girlfriend dad passed also a couple weeks ago and we are worki g our way through it. Hopefully we can all do it together. Love yall and yall  videos. Mama also said there will be better days.",
        "Hell yeah ",
        "Thank you for today’s video, not for the sound of Jack which is crazy by the way but for making us feel like family! Thank you Justin for showing us your heart today, from one man to another ! Jackie, I know what that hole feels like, thank you for sharing a piece of him with us! you know his reply would have been, I’m so proud of you kiddo now go have some fun! Always remember, he had a big part in giving you that SMILE, wear it with pride!! By the way sis, Caddy Jack, ROCKX… Bless you both!!!",
        "Hey Chief did your dad ever listen to Van Morrison? He sings a song “days like this”",
        "Hate to hear it for ya’s.  Life’s too short, spend it doing what ya love and what makes ya happy",
        "Wow, that was boring and more than a total let down.",
        "You guys need to take a picture of caddy jack in the test spot at the shop where you have taken pictures of it as a LS and do a before and after",
        "Sounds great",
        "I’m so sorry for your loss!!! I know the 1st time you go down the track he will be with you! And how proud he is of you..I’m dreading the day I have to go through that god speed John",
        "I’m sorry for you Jackie’s loss",
        "When can I come see you in person",
        "Speaking as someone who has gone thru this twice, my wife's father died in  his sleep at 56 over 14 years ago. She still cries some days. I have his 66 Mustang coupe in the garage and sometimes it helps to take her out for some donuts like the old days. Then my mother had a stroke at 60 in 2019, here today, gone tomorrow. But it gets better, never 100%, but better.",
        "Hey guys!! Really missed you all and the videos. Where you been? Hope all is well.",
        "thoughts and prayers jackie .  lost my dad 2014 dec 20.   god belss you jackie   . mark byers",
        "IT'S GREAT TO SEE CADDY JACK ON THE ROAD IT LOOKS GREAT\nTHE SOUND FROM THE SMALL BLOCK SOUNDS AWESOME\nCAN'T WAIT TO SEE THAT CAR RACE\nAND I'M SO SORRY FOR YOUR LOSS.",
        "Sorry for your loss both of you may John Rest In Peace but Jackie just remember you have the best guardian angel and co-pilot you could have ever wanted",
        "Please be honest, Is Audi helping foot any of the bill",
        "Damn... sorry Jackie.",
        "Well said Justin ... well said buddy. Lost my dad,  my hero 5 years ago next month. You can never take life for granted",
        " stock license plate!!  Love that shit",
        "My sincere condolences to Jackie and her family. It is often said time heals all hurts and wounds. I have found that not too be true in the loss of a loved one. It will however grow a scab over it so it is not such a raw wound. Jackie you and your family will be in my thoughts and prayers.",
        "RIP  so sorry……..",
        "I'm sorry for ur loss Jackie. I lost my mom is April, so I Kno how it hurts and how much it sucks. I love u and chiefs videos. I've been a huge fan for yrs. Caddy jack sounds ignorant",
        " waiting on y'all to come back praying for you",
        "Sorry about your dad , I lost mine 3 months ago. Looks like the drivers seat needs to be taller so she can see more of whats in front of her",
        "Sorry to here this thinking of Jackie and her family at this tough time, and chief also, keep your heads up and caddy sound unreal when GoPro was on side of car, mean ride, sorry for your loss,  🇮🇪",
        "I'm sorry to hear about the passing of Jackie's father",
        "im so sorry jackie,, your pops is in your heart and he is watching over you, im no bible thumper but hes there watching over yous. love yo",
        "That thing looks and sounds sick amazing work you two and I’m praying for you guys .",
        "Sorry for your loss , caddy jack sounds wicked",
        "Love those 2 door Caddies...",
        "We all have missed you guys and know we understand why I personally am so sorry for your loss this video has brought tears to my eyes knowing that the both of you are sadden from his passing and by all means take your time we all will be here for you two. Caddy jack looks and sounds amazing you two have done a awesome job and looking forward to seeing Jackie making others ashamed for even showing up for a race. God bless you both and as always be safe thought and prayers goes out to you two and family.",
        "️️️",
        "Sorry for your loss Jacky I hope you find comfort in the fact you know your father will be riding beside during every future pass you make!!! May he rest in peace and God bless all of you",
        "P.S,at 60 im still gonna say hot chicks in hot cars ,has my attention.",
        "I love this car. We are proud of you Jackie, your father is proud of you.",
        "Very sorry for your loss Jackie! I can't even begin to imagine how you feel!\nPrayers for you guys!",
        "Jackie\nNothing will replace your father. Coming from someone who lost there father when they were 7 years old. \nDo not stop being you. Do not stop enjoying life.   We never have to forget the most important ones in our lives. But we must honor them by succeeding because we took what we learned from them and made it better. ",
        "I wish I could say I can’t relate to this because it hurt so bad. I lost my dad a few years ago and never thought I would wrench again. It just hurt to think about it.\n\nLast year I bought a project I couldn’t turn down, started a channel, and filmed me doing it all. Every day I felt more and more like he was with me. ",
        "Sorry for your loss jackie",
        "So sorry for your loss.",
        "Glad to see y'all back! Sorry for your loss! That caddy sounds amazing ️",
        "Jackie my prayers are with you and your family  much love.....CJ from Cleveland Ohio",
        "GOD SPEED...\nSo Sorry for Your Loss...",
        "My Grandpa would tell me the same thing,momma all ways said they be days like this.,I was told the say thing when I was younger."
    ],
    "comments_disabled": false
}