{
    "video_id": "65tc_KzZQ98",
    "comments": [
        "We still say mannequin in French!",
        "the music after “and they had to be white” ",
        "She is dead. But it was an acident. She fell",
        "Why did I say, \"And white\" the same time you brought it up? LOL",
        "I agree with the TikTok. The supermodel is dead.",
        "I was obsessed with model Fei Fei Sun for a while. Girl is stunning and a supermodel in my book. I don’t remember ever seeing a Chinese model represented with that kind of caliber. She was the 1st solo Chinese model to grace the cover of Vogue Italia. But I think she’s now semi-retired, and also gave birth in recent years. She’s still very young and can make a comeback. The Asian powerhouse models in the earlier days include Devon Aoki, Kimora Lee Simmons & Yasmeen Ghauri. You are for sure an it-girl Mina!!! No cap!!!",
        "... US president Henry Ford????",
        "i respect the og 90s supermodels (and also a few working today)so much for their work and discipline, i just find it sad that today a lot of the “highest paid models” are just nepotism babies who don’t necessarily have the talent and work ethic of other models who woupd deserve the fame more",
        "Billie Eilish is the last example of an it girl I can think if, around 2017 to 2019.",
        "TiVo had to be explained?! I am officially old.",
        "the supermodel era looked so fun!",
        "why do you not have a standing mic?",
        "I am size 14 and I wouldn’t consider myself plus size.",
        "Mina your eyebrow zoom in literally made me cry a little. I don’t know why but that hit me.",
        "Honestly I do consider being a plus size model sometimes but seeing I have to keep the same size when I fluctuate in weight A LOT keeps me away from it. Plus (pun intended), it’s not a very sought out job and the clothes promoted through fatter bodies is always ugly sadly .",
        "I like the vibe of these videos - no-nonsense deconstruction of topics. Modeling seems like a job were there will  almost inherently be this whiplash of the high of attention/ praise / status for models and the lows of criticism / objectification /often poor health and financial instability.  It's like the whiplash of being in an abusive relationship.",
        "US president Henry Ford? You mean Ford Motor Co president Henry Ford.",
        "I think there is a certain obsession with nostalgia in our culture today. Things change and that's ok. In the future, people will look at kendall, gigi, bella, hailey and will miss having lived in the era of it girls on instagram, of influencer models. I know that I like to accompany them. It's ok to like the 90's models but it doesn't make sense to think of reproducing what they were in a world as different as the one we have today. Anyway, this is just my opinion, I love your videos Mina!",
        "\"Listen to me (don't listen to me)\nTalk to me (don't talk to me)...\nFa fa fa fa fa fa fa fa\nFa fa fa fa",
        "Great subject as always ! \nTip: Maillot is pronounced \"mah-yo\"",
        "I found a maillot :) here: https://en.wikipedia.org/wiki/Maillot\nwikipedia has a picture of maillot",
        "Great video\nBut modeling industry for a model is still almost the same as it was in the 30s unfortunately  ended modeling career after 6 years and have 0 regrets.",
        "Coy is the IT girl. If you know, you know",
        "tiny jewish girl is such an it girl",
        "Going off of the first couple of minutes, I think it's also important to realize that not everyone can afford the lifestyle it takes to be an \"it\" girl. If you're in your 20s, trying to finish school or working a full time job, you might not have the time and resources to post consistently. Therefore you might not be getting the brand deals that allow you to keep going and stay \"trendy\" enough. Victoria Paris made a really good Tik tok about how she can afford the cool furniture in her apt (which helps her stand out) because she literally doesn't have to buy her own clothes -- they get sent to her for free. To be an \"it\" girl you basically have to be doing a media related job that let's influencing and being in the pubic eye your TOP priority. The only it girl I can think of that isn't a model, actress, singer, or full time influencer is Devon Lee Carlson (co founder of wildflower phone cases).",
        "As always, very well researched and presented.  I am so glad you create videos that are entertaining and informative instead of showing endless days of making lemon water/green juice/avocado toast and doing your workout routine.",
        "i had no idea that the terrorist attacks happened on the same day of NYFW. i just looked up an article that talked all about it and everyone’s testimonies from that day. it sounds horrible. it’d be interesting if you could make a full video on that topic and how the events that happened that day changed the course of the fashion industry. i know you briefly touched on it in this video but i’d love to hear you talk about some of the stories and just how deep this really went. great video as always!",
        "2:03 AGREE FRRR",
        "7:14 did you say \"US President Henry Ford\"? He was never president of the US. He  founded/ran Ford Motors.  Gerald Ford was president in the 1970's, no relation to Henry Ford.",
        "For you the most beautiful and special girl ",
        "IT girls and supermodels are 2 different entities. An IT girl can be a non model like an actress. I recall years ago Sienna Miller as a good example of an IT girl that people looked to to emulate style wise and she was that girl for years. ",
        "My good sis is back and ia better than ever.",
        "No, just in the eyes",
        "watching your video is like listening that friend who is always interesting to talk",
        "Because of unstable income, many beginner models I knew who were trying to make a name in the industry sometimes took side jobs in escort.",
        "Long story short… yes.",
        "Hey, I’m in this video !",
        "I love history class ",
        "The Glamour labor is so prevalent in Pageantland too… sure there are scholarships for the select few that win but very often the amount is wayyyyyy less than the gown you bought, the gym membership, etc",
        "Off-topic: any idea what’s the transitions song (21:50) ?",
        "everyone forgets about gia carangi :(",
        "Hi, I love your videos!!! Is there any chance you could do a brief video on how you do video essays/equipment?",
        "For reference, my daughter - who is small for her age - has a 23 inch waist, the norm for a nine-year-old. And while many grown women are naturally this size, they’re in the minority. My 11 year old self was not that small but I saw women who were. And that was the ideal.",
        "Lane Bryant's continual use of models that run on the lower end of plus size can be frustrating.  It's nice to know that the size 14 model looks good in that outfit but what about a 20? 24? They go all the way up to 32, I believe and yet show no diversity whatsoever.",
        "What about gia carangi?",
        "13:03 that looks fun :/ hate poc we’re never able to have the same luxuries",
        "I know this is off topic but can we just talk about mina's channel growth . I didn't even realized she reached 1mil subscribers. I remember being one of her first viewers, absolutely captivated by her editing, research, and her fashion looks. Love you sm <3",
        "Hello,I hope you have a beautiful day,you are super cute and special,I loved the video it was very interesting",
        "I don’t think an industry that relies on looks and physical attributes ever will be inclusive and it doesn’t have to be… and that’s ok! People can choose other paths in life just like employers can deny unqualified candidates in any industry.",
        "Why was there a clip of Måneskin at around 28:58? Damiano is a beautiful man who could easily become a model, but they're a rock band. I'm confused.",
        "Anytime there's money to be made, it becomes difficult to keep something exclusive. So as much as people miss the \"Supermodels\", everyone wants in on this which opens the field to more people (which duh, inclusivity requires that) but it feels a bit odd to hear that people want \"super\" this and \"it\" that knowing very well it doesn't come with a wide range of representation(?) Maybe sometimes people want to be excluded? Idk just seems odd. Ten or even five years from now maybe influencers who peaked in 2020 will be seen as the \"standard\" and those who \"had it all\". Nostalgia seems to distort the reality of the past. Anyway I learned so much in this video, very well researched Nina",
        "Love your videos! By the way Henry Ford was president of Ford Motor Company not the US",
        "Thank you for bringing up the power of Nepotism and the unfair advantages of accessing the best surgeons and best PR possible to attain a high paying modeling job. There is a reason why Naomi Campbell refuses to call Bella Hadid and Kendall Jenner “supermodels”, while also supporting up and coming excellent runway models with the look and presence of Sora Choi and Adut Akech",
        "I kept on waiting for a mention of insert country's next top model that were popular in the mid 2000's. did i miss it?",
        "Brilliant essay as always. Bravo!",
        "fun fact in french models are still called « mannequin » !",
        "It’s weird talking about models in French because they’re called ‘Mannequins’. Although they have ‘top-model’ in their lexicon, if I’m not mistaken.",
        "i love you",
        "SHES BACK! ",
        "Why does everyone blame others for the problems they caused to themselves?",
        "Nepotism honestly is a big problem in many industries today",
        "Not where I expected to see Måneskin, but glad to see them",
        "I wish the title had \"the Good Side, the Bad Side, and the Ugly\" ",
        "Love your videos. It's a very interesting topic! Towards the beginning (~ 7 minutes in), you say US President Henry Ford. Henry Ford was never US president to my knowledge, but Gerald R Ford was (no relation).  It was still a really great video!",
        "If lost media videos are anything to go by. The original recording is in someones garage.",
        "*inner romance writer's brain churning out many possible stories about the history of mannequins*",
        "Mia goth is married to or dating shia Labeouf and I feel like that deducts it girl cool girl points ",
        "as someone who's a teenage girl that's really into high fashion and dreams of being a model, it's so heartbreaking that as much work and effort i may put in, and do put in even now, the chances of me succeeding in the industry are so tiny and even then are dictated by whether a perverted middle aged american man finds me attractive or if an elitist old fashion personality does",
        "omggg new mina lee post made my dayy thank you!!",
        "I just finished work at 8:00 pm in Germany. It's dark. Sat down to finally chill and lo and behold a MINA VIDEO! Evening saved",
        "i wished you talked about male modeling just a little more",
        "How is it possible that Gia Carangi isn't mentioned once in this video?",
        "90s supermodels are famous because they're great models. The Instagirls are models because they're already famous.",
        "Yessss she’s back with another iconic video",
        "I hope that influencer top model girl gets replaced by the it girl. Say like Julia fox, she's 32 not particularly tall and she's different. Buuut she's killing it and in demand because she has the edge and special it girl quality. I think this has Fenty shows are representing this concept.",
        "Also a video about the history of plus size fashion would be really cool",
        "French people still call models \"mannequins\" lol we had a Louis Vuitton after party show at my work and the French event coordinator kept calling the models \"mannequins\"",
        "totally agree with your \"it girl\" stance. they still very much exist, it's just more difficult to pick them out among the growing number of celebrities and influencers that are popular now",
        "As a kid I wanted to be a model so bad…I really thought it was possible…until i realized i wasn’t getting any taller than 5’1 ",
        "Every black model who has to fix their own makeup and hair bc of an incompetent beauty team should be getting paid styling fees as well as their modeling fees.",
        "The blurring of Tatjana Patitz's face ",
        "Mina I love you but what is this editing ",
        "I feel like we had another supermodel bloom at the height of the Victoria's Secret days. \n\nI'm really curious to know your insights as someone signed with IMG, being a shorter model and how that affects the way you're perceived. Great video as always.",
        "11:46 i actually thought that was so slay lmao",
        "Henry Ford wasn't a US president ",
        "I just cannot understand why hair and makeup educators would feel comfortable graduating students who cannot colour match or work with more than one hair type? In traditional arts education - that would not be considered a pass. Like it’s colour theory- it shouldn’t be from memory for a small segment of possible shades, it should be good understanding of colour theory and the ability to apply that to model tone matching/balancing is what makes one skilled enough to be considered pro.",
        "I really like your editing in this video, it's been evolving really well over the course of your recent videos!!!",
        "I will make it as a supermodel ~some girl from Ohio",
        "Mina Le is my \"it\" girl, fight me. (don't fight me, I'm delicate, just support me)",
        "loved this video! i once wrote a seminar paper on a similar topic and this source i then used came to mind, regarding the \"look\" and the \"it\"\nit's from 2007, so obviously a bit dated but i still found it extremely interesting :)\nRoach, Joseph. It. Michigan: Michigan University Press, 2007.",
        "It might not be of interest to you but can you talk about “MANHANDLING” it’s such a gross topic that applies to both genders with many layers I would love a intelligent opinion on it. :) I just discovered the term although I am not new to the use of it. :(",
        "Man that crazy how much money was worth back then",
        "I found it so weird you mention Fiji Islands as only starting to have widespread television in 1995; still in the 19th century, the Islands King (known of nursery ballads as King of the Cannibal Islands) was totally eager to gift the reign to the British Crown so he could just lazy bum for life while his people would start having British modernities and amenities.  Yes I know there was no tv in the 19th century and no, I don't know when or even if the Islands ever got independence from the Empire, but it's hard to believe an ex-colony would take so long to have plain old tv - after all, ethnicals and expatriates use to effort a lot to bring developments from the homelands for their own benefit. I don't think you or the anthropologist is lying but maybe, just maybe, there's a fake news element there?",
        "In Bulgaria, we still call models mannequins. Only recently have we started using the word \"model\", for globalization reasons",
        "My dream is to date a model",
        "As a brazilian, I was surprised by hearing Giselle Band-chen instead of \"B-een-chen\", I've never thought that her surname was read like this by foreigners hahaha",
        "the modelling industry is so multi faceted and no one is better to discuss it than Mina!",
        "I’m dying to know what the Maneskin clip was from",
        "i'm 2.5 minutes in and i got a drinking game idea already: take a shot every time mina say 'etc' in this video",
        "I always look forward to watching your videos Mina, you research these topics so well! I’m not sure if you’re open to video suggestions, but I would love to see your take on how fashion has evolved in Iran ️",
        "With \"everybody\" becoming the new it girl we might see a resurgence in alternative styles or a drastic new style",
        "My favorite model is Coco Rocha ",
        "fun fact : in french model and mannequin is the same word",
        "Today is a Brazilian holiday. Thank God this video was uploaded, I was so bored and now I'm happy",
        "Not sure if it was relevant but did anyone see the tiktoks that models don’t get paid for runways?",
        "I 100% developed my ed because of the impact of the topmodel shows. The whole concept of your life being amazing when you're thin enough was just wild in the late 2000s/early 2010s",
        "Uhhh gurl I think you forgot YASMEEN GHAURI!!!!",
        "Love your videos, Mina love that you discuss many subjects which I love",
        "I think a it girl still exist it’s just now we have multiple it girls for diffrent aesthetics and now it’s not just white girls that are it girls now we involve woman of color",
        "Babes Henry Ford was not an American President...he was President of the Ford Motor Company.",
        "7:12 US president Henry Ford?",
        "Heo! Mina! It may not be your cup of tea.. But could you do clothing analysis of House Of The Dragon!? Lots of symbokism and would love your take on it!",
        "I used to model part-time to make some extra cash for college. The industry brought about self-image issues I didn't even know existed. I hated not looking white, was ashamed of my arms, etc. I eventually stopped modeling and my self-esteem has slowly improved since. Such a cruel world we live in. I feel for all the impressionable young girls out there.",
        "Fun fact, here in the Netherlands, we call thicker/different tights maillots. The difference is that it is made with a tricot fabric and so most of the time are made of cotton, where as tights are, of course, polyester. Usually, maillots are black",
        "Don’t we have bella hadid? She the it girl for me",
        "Hello Mina. I am a fashion model working since a few years in the industry in fashion (first in France then Canada). I do mostly editorial, and a bit of catalogue for the money. In French we use the word \"mannequin\" for fashion model. I have never really thought of it too much.  I personally like it better than \"model\" cause in my mind \"model\" can be anyone in front of the camera, it doesn't necessarily imply the person is a professional, knows how to pose and walk... But that's probably just me! Also fun fact there we have to do our own hair and makeup a lot in Canada... The industry has no budget anymore to pay anyone... I'm not black, I'm redhead, and I have a similar issue! MUA never have my shade, I always end up orange. So I totally imagine the struggle of my counterpart of colour... I totally agree on how the commercial girls are often the \"money girls\" in the agency! I have often been refused from gigs because \"You don't look commercial enough.\" which is their way to say you're not conventionally pretty. But modelling helped me embrace my own unique look, my oddness and celebrate all these \"flaws\" that make me unique. :) So I have no hatred towards the industry!",
        "I spent my entire work day on my feet steaming clothes for a photoshoot the brand I work for is having tomorrow and after an hour and a half of traffic hell I was thrilled to see  a new Mina video waiting for me. As someone who has been involved in the garment industry since I was a little kid (my mom is a clothing designer so I spent a lot of my childhood running around trade shows and helping out at photoshoots) it's always been so strange to see this glamorized image of what people think models do, vs the reality of it. It's insanely competitive, can be very toxic depending on the environment, and of course there's a ton of racism present as well. That's not to say there aren't any good parts because a lot of models do genuinely enjoy their work, but I really liked how Mina summed it up in this video. It's getting really difficult to make enough to support yourself even if you're just getting into low level catalog type stuff vs high fashion. It's not what it once was, and with the rise of influencers and so many nepotism babies around, it's only going to get worse. ",
        "Supermodel > IG Model \nNuff said ",
        "where did you buy the microphone???? xD",
        "I am sorry but I would not consider Julia Fox an it girl  she’s just a joke, the way she was trying to be Kim by dating Kanye, dressing like her and speaking like her. She’s just a gold digger and attention seeker in my opinion and I know that a lot of people feel the same way about her",
        "I'm a part-time model from extremely humble background and, to be quite honest, I am happy that nepotism is more prevalent than ever.\n\nPeople in the media industries are mistreated to such an alarming degree that having that safety net of money and connections does a world of good for the well-being of these individuals.",
        "while this isn't a comedy channel, the vid went to an ad as Mina was coughing and would have been hilarious if that was just then end of the video",
        "just fyi the term \"mannequin\" comes from french - and a model in french is still \"mannequin\". so living mannequin might sound weird now, but probably it was not at all in early 1900ies ^^",
        "I always wanted to be a model but I’m 5’3” so it was never on the cards for me. Also what happened to Agnes Deyn? She disappeared.. she was my inspo growing up I still love the beat by Burberry fragrance she did the campaign",
        "mannequin wouldn’t have been dehumanizing because it used to refer specifically to the person modeling the clothes, not to a what we now call mannequins",
        "agree with everything u say mina",
        "I haven’t seen anyone else say this but Henry Ford was not president, Woodrow Wilson was",
        "You literally minced the black girls words and said the exact same thing …lol",
        "Maillot translates to something along the lines of undershirt or leotard. Like a maillot de bain is a swimming costume.",
        "This is a great video on modeling! ",
        "I loved the first half of this video. I wish you'd gone into more detail about the exploitation that rocketed in the 2000s, where models got increasingly younger and thinner, and the disgusting influence of fashion magazines ruining careers because a model gained a bit of weight, like Gemma Ward. Please do a part two!",
        "who doesn’t want to be a supermodel tho",
        "Just what I need ",
        "Seeing Mina in a sweatshirt felt more real than I expected it would ",
        "Is anyone gonna tell her Henry Ford was never a US president?",
        "Omg that’s my video!  Thank you for the shoutout! I completely agree. There are too many pockets and micro pockets for there to be ONE sole it girl!",
        "I would love a podcast  I can listen to you the whole day🫧",
        "There aren't any \"IT\" girls/supermodels, starting from the millenial generation and the newest, everyone has become clones of each other regardless of ethnicity in the looks, speech and thought department .  Gen X  ( 1965- 1980) was the last of the great beauties, they all had their own individual unique look and style, spoke in their own voices and so much more..nowadays, young men and women sound like Kardashians and have even molded their own looks to have some kind of semblance to them, it's sad and unfortunate.",
        "another aspect of the allure of the og supermodels (which can apply to any celebrity at that time) was mystery,, everyone was curious about how these well revered women were living everyday, from photoshoots to runways to their off-duty time. now with social media its very easy to tap into someone's life so anyone can kinda live vicariously thru ig, youtube, and now tiktok. Even on some agencies websites they'll ask about your social media so def being an influencer to some degree in extremely important. ",
        "0.51, buh if everyone is doing the same thing that means they're wanna be's. she just proved that none of those girls are ACC iT girls because in her opinion they're all he same. we're just between IT girls, not in a world extinct of them. there's ACC a perfect gap for a new IT girl. it's bella hadid for modelling and I guess we'll wait for a new new rising star too. perhaps a new actrss or summ ion know.",
        "Love your husky voice and accent",
        "My grandmother did modelling for a small boutique she originally worked in as a cleaner- but that was like back in the early 1940s and in England but it’s interesting to consider standardised sizing because she was petite, but I guess had the silhouette of the day. \n But I don’t know if I’d say modelling has gone downhill it’s just… I think that most of the nepotism babies have no business being as far up as they are- and that’s not a particularly controversial hot take. I think a lot of people would agree to this with the exception of like really angry insipid stan twitter who support every inane thing wealthy beautiful people do- but that branch of twitter is just a prettier Reddit at best and 4chan at worse so moving on.",
        "Everybody in the entertainment industry is in fact related. I mean the Kendall Jenner and Khadid sisters are actually in the same family tree.",
        "Henry Ford wasn't a US president tho??",
        "You make even the presentation of the sponsor exciting to watch, so imagine that!! Brilliant Mina!!",
        "Maybe this isn’t the correct place to ask but does one ask for peoples’ permission to use their public content from tiktok? e.g Mina uses tiktok clips as references and memes in her videos. If the content is public, would you still need to ask that creator for their permission to feature their tiktoks or posts on your youtube videos?",
        "off topic rant: In my country next top model and other model shows are like a family show, everybody is watching and talking about it. The judges are insanely rude to the girls, extremely agist and every season in the first round of auditions they flat out MOCK any girl that doesn't fit outdated American 90s beauty standards even though the show has only Balkan and Mediterranean audiences. Plus if they do pick a girl with like three stretch marks, 2 zits or a visible surgery scar they act like they are true altruists giving chances to the less fortunate.  I'm pushing 30 but this can't be healthy for young girls to see.",
        "just as i was getting into content about the supermodel era this comes out. amazing as always",
        "This might sound like an odd question but how do you know all this stuff? I haven’t been a subscriber of yours for super long so excuse me if you have mentioned it previously. I just can’t seem to wrap my head around the amount of knowledge you have surrounding these topics of fashion, it’s history, it’s culture. Like did you study this at university? Do you look up most of the stuff you’re saying and just delivering it in a fabulous way? Or is this just your passion so the urge to know itself just kept you going?",
        "I’d love to see you touch on the male industry!",
        "I saw Kendall Jenner on the thumbnail and thought oooo she's gonna go in on the nepotism babies!",
        "Most are ugly now. Not suited to the products services",
        "This video serendipitously came out a couple hours after a modeling agency asked to interview me. I’m excited but now warned lol",
        "these kinds of jobs are very objectifying.",
        "I have to clear up any confusion about the usually correct Mina's statement: Ford did not \"introduce\" the 8 hour workday. The labor movement fought for years, even paying with their lives, to fight for the 8 hour workday. Ford was just the first industrialist to implement it.",
        "Hey Mina, I respect how much time energy and thought you put into styling yourself and makeup. But I want to mention how gently surprising it was to see you in a dressed down to earth casual way. \nYou’re insanely beautiful either way, but more so when not put together because that beauty is unexpected and subtly vibrant too. cheers!",
        "Where ur eyebrows went",
        "#48 on trending?! Get it Mia! ",
        "Henry Ford is the 9-5 culprit?? ",
        "not cindy crawford working out in jorts",
        "This video is so detailed and informative, and fascinating to me as someone who grew up with early ANTM. But I also need Mina to know that Henry Ford wasn't a US president.",
        "You always were the most beautiful dresses",
        "Im going through ed recovery and im honestly scared when the 90’s thin model is IN again",
        "I feel like the reason people respect older models is because a lot of them back then actually had unique walks and seemed to look so gorgeous in a natural and effortless way whereas supermodels now are mostly nepotism babies (think kendall jenner) who live off being mediocre models and don't really have that much of a passion for fashion although there are still some models who are actually distinctive to make things interesting (think bella hadid)",
        "Pictorial, not pictoral",
        "Back when I was in college Lane Bryant was doing this huge model search. They wanted to hire a bunch of models that would be contracted for a year, with the possibility of renewing. I looked into the contract details to see if I was interested because I was in the size range they were looking for and had the proportions that they would usually use for their ads. One of the biggest things I noticed was that you were obligated to remain the same weight and dimensions during that period. Like even losing five pounds or becoming slightly more muscular from exercising could get you in trouble for breach of contract. It sounded so stressful that I dropped that idea real quick.",
        "I don't see the problem with eurocentric beauty standard since it is majority (thus more people can relate lol), when black or some other race is represented it is deemed as \"fetishization\", seems like people are never satisfied",
        "I think people aren't as interested anymore in WHO is modeling the clothes, but rather in the clothes themselves. people are more fashion conscious",
        "Just a sidenote, could we stop spreading the popular myth that Henry Ford introduced the 8h work week. He didn’t. Unions did so and fought hard for it in 1884. Ford adapted and made it more accepted decades later - but we have to thank unions for it, not Ford.",
        "I wear wigs most days so glamor labor for hair is foreign to me. I just brush and wash my hair, basic maintenance.",
        "About the really beginning : in french we say \"mannequin\" for a \"model\" so maybe it is not deshumanizing but just taken from french as so many things fashion related are.. idk just wondering.",
        "What hurts larger models? The excessive weight their bodies have to carry. \nYou want me to feel sorry for a black model not having a personal makeup and hair stylist? I won't. \nIf your goal is to be a model and not the buyer of the clothes then you are the problem.\nGet a degree and work to achieve wealth.",
        "Loved the analysis! If folks like this they should watch the new Vogue series about Black models in the industry!",
        "This video has brought to my mind yet another vlog topic I don’t have time to try and tackle but the weird intersection of amateur online Modeling, sex work(no shade) and Cosplay that lowkey made the cosplay community so much more toxic and competitive than before you could ever dream of making money doing it. Really was not something the community needed but the format and all the expectations were straight up pulled from the modeling industry. The way it feels pressure to be a certain type of unrealistic anime girl body type if you’re gonna bother posting Cosplay pics online. ",
        "In French models are still called mannequins (same word also for the object). And it's not seen as dehumanizing at all, it's just the same word applied to two different things if that makes sense.",
        "Hmm. If you are saying It Girls still exist, we just may not know who they are… do those girls then encompass the true embodiment of an “It girl” ? I would argue It Girls are known. They’re seen and at the forefront of change, especially and specially, of pop culture. However, I’m not sure on my opinion on if any exist rn. These are just my thought on the definition of an It Girl",
        "\"US President Henry Ford\" ??? You mean president of Ford Motors",
        "Must this blessing shield you from the wrath of the Holy Ones & Zeros.",
        "Bella Hadid is for sure the IT girl",
        "Giselle heard our cries and she came back with the quickness ",
        "enya umanzor is this generation's it girl",
        "Very poorly researched video as if you just read off a Wikipedia",
        "I do have the ick factor!",
        "Watching this as a full time model is very interesting, I work with both high end fashion brands and do ecomm/commercial work. You give a good perspective into how an outsider sees the industry and I really enjoyed learning about the history. However, there are some things mentioned that are a bit exaggerated (in reporting or whatnot) or aren’t really true to the job. Models can go into one of those two categories of commercial or high fashion/editorial, but this is not the ideal for an agency to do– the ideal for most models is to do a combination of both kinds of work. The modeling industry has become overpopulated and I guess that does drive down incomes, but there are so many agencies now that cater to more amateur models that don’t make much money/those agencies exist solely to exploit models financially, so it brings those stats down on income. Most models I know are making a pretty good income, those that aren’t are being worked by their agency in pretty exploitative ways (driven into debt, pigeonholed into low paying work, agents just aren’t pushing enough to get their models work) ",
        "When you said “so what makes a successful model?” My instant response was “NEPOTISM”",
        "I only watch your videos cause i like watching You talk it's marvelous",
        "The problem is that everyone is trying to be a model now a days.",
        "YOU ARE THE IT GIRL OF OUR TIME!!!! SMART STYLISH ORIGINAL FUNNY ETC ETC",
        "Amazing video as per usual ",
        "The zooming in of your eyebrows. To me, that’s cinema.",
        "I've been learning more about fashion from you than I did in fashion school",
        "do u guys know more cool channels like this one! i love mina le and modern gurlz",
        "Adriana Lima and Megan Fox were my it girls in 2000s-early 2010s. Now it's Dua Lipa and Billie Eilish.\nBut the Kardashian are definitely it girls, because the number of people copying them is enormous, whether you like it or not, same with Paris Hilton in 2000s.",
        "I thought it was Kate Middleton at 11:04",
        "..and when everyone is super, no one will be.",
        "As a cis-man, I don't think I'm your intended audience, but I'm here because I love your in-depth analysis of modern culture.",
        "why do you not have brows?",
        "Not mina forgetting shalom harlow :( she was my fav",
        "This is so fucked up. I don’t even wear plus size clothing yet I would fall more into the category of a plus size model. I’m typical model on the top, plus on the bottom lol Modeling should be an art, and mental and physical health shouldn’t be affected by that. I don’t get why they can’t understand beauty and realism can exist. The average size of a woman is 14 in the US.",
        "The George Michael Freedom video from back in the 90s, with all the big supermodels in it, was everythingggg-ah at the time.",
        "I agree with the woman’s statement. The IT girl is dying. Every decade there was an IT girl. From Clara Bow, Marilyn Monroe to Audrey Hepburn. There was something very special about them when captured on film that separated them from anyone else. Today there are many talented and beautiful women in our culture. Some feel very relatable. In a world filled filters and body/face modification available and normalized it’s hard for anyone to be a true standouts. In past years the title It was for the few handful. Today you ask 10 different people who todays IT girl is and you’ll get a variety of answers pertaining to their demographic.",
        "I've always wanted to be a model since my mom was a fashion designer and used to model her creations with her friends (they weren't shows huge we literally live in the countryside lol)+ she also wanted me to become one, so it became what I usually daydream of or fantasize about. Watching this felt like Mina was speaking about something very fond for me, even though I don't really have any experience in the industry.",
        "Is this a reupload or am I tripping???",
        "yeah, i don't get it, if you're gonna water down a concept to where hundreds or thousands of people have something that was originally attributed to an extreme few, sure, it still exists, but it's not the same thing people were talking about in the past. and in the past, this was a very, very racist concept. i don't understand why people are keeping this idea around when it should be dead and buried.",
        "in my country, modeling is still not considered to be a respectable career. i have been offered to model for some brands and photographers but it kinda sucks that i cant because of my family. but ig its for the better because it seems like it can take a toll on you eventually.",
        "Bella Hadid is talented now! Go watch her first funways, no way NO WAY a non nepotism starter would even get a chance to  take a step on runway  w that walk and non existent aura.",
        "What good karma did I do to deserve >30-min video from Mina. More, please! ",
        "THIS VIDEO IS A MASTERPIECE ️",
        "TLDW\nGOOD FILM, 8/10",
        "I loved the zoom in on your eyebrows \nGreat video! I didn't know a lot of the history so that was really cool and I like the little pink tie around your waist.",
        "I was always a tall skinny kid the amount of times I got told I should be a model when I’m the most mediocre looking person I’ve ever met in my entire life lmao",
        "thanks for great video Mina xx  i just think the industry is growing more and more \"politically correct\" on the outside, but unfortunately more and more toxic on the inside... brands are just afraid of being canceled by the media and the consumers, while forgetting their workers, both models and industry-workers, because they know their workers are depending on keeping their jobs.",
        "julia fox, zendaya, bella hadid, lily rose depp and mia goth were literally the ones in my mind as you said that",
        "3:56 A bit of historical context for “mannequin”: King Louis XIV, arguably one of the most fashionable men & monarchs in Western history, was the driving force behind making fashion one of the primary, if not the premier industries of France because he realized that fashion can be a form of propaganda. Kinda wild to think of fashion that way for us nowadays but it makes sense. Louis XIV knew that courtiers across Europe looked to other courts on the continent yo help dictate what their own kingdom’s/empire’s court dress should be so they could be seen as their own independent governing power. So to compete with Spain & ESPECIALLY England given their long contentious history, Louis effectively tied a good chunk of the national economy to raw material cultivation, textile fabrication, garment making (hello, beginnings of today’s haute couture!!), etc., so they could readily export all these products he would make be seen as valuable and drive up demand for by establishing a very highly aesthetic, super detailed (if not stringent) court dress to set France apart so when courtiers of other nations came to French court, they would have to get French clothing and then they’d take those clothes back home with them. So with the fashion industry developing as quickly as it did in France, they needed to have people wear the clothes for fittings when the courtiers were out of country and to have illustrations, which were paper/art propaganda pushing the sartorial propaganda, made that could be kept in historical records and sent off to the rest of Europe. And those people were called “les mannequins,” from which also comes the name we know as the inanimate objects we see in stores today, as well as the French word for “model(s)!” So shout out to politics & King Louis XIV wanting to be a gilded peacock",
        "SZA is my supermodel",
        "That was a great walk-through. Also, it's okay, you don't always have to end on an optimistic note, some things just need to be dismantled and this super-model business is definitely one of them. Modelling in general needs a huge transformation because in it's current form, it's not healthy for anyone involved and no one is being honest about it. The word \"model\" means \"to make a representation of\" and in science, a model organism is the most representative organism for a particular phenomenon you're investigating. Modeling is supposed to be a representation of, and yet, I don't see representation at all in the modelling industry, aside from the occasional token. When we as a people in all our forms and sizes can be adequately represented by this industry, then I might be willing to clue in. It's a shame, because I adore fashion and it's creativity, but with all the things they manage to pull off in fashion, you're telling me they don't know how to create beautiful things for the average American size? Or for anyone over 50? The list goes on. That's not logistics, that's a choice. The silver lining here is you Mina! You bring us creative, fun and informative content, somehow both positive and sassy commentary, and you're serving loooooks! Congratulations for passing 1 million subscribers!! You could say you're our IT girl!",
        "in french we still use the word mannequin!:)",
        "learning the history of modeling and why the standards are the way they are is interesting because i grew up watching ANTM and that show literally teaches and perpetuates the standards of the industry",
        "Mannequin is model in French as well... so it was taken from there",
        "16:39 Let’s not forget Nancy Drew that had some connection to the fashion industry.",
        "I enjoy so much your videos, it helps me to know many things about many different topics by a fun and light video.",
        "I just started the video and I wanted to had that in french \"mannequin\" is still use to talk about a model (but it doesn't really have a negative connotation).",
        "The intro of this (someone who may be an influence in my circle is someone you might not even know of) is really expanded on in this video about the US monoculture and how (and why) it no longer exists. https://youtu.be/XIe_yGQ8Gek",
        "There's a misconception about plus sized models, and it is that any woman can be a plus sized model and the only thing you have to be is fat. It is one of the most ignorant takes I've heard in a while.\nThere's a lot of hate and vitriol against women who are plus sized models, and the argument that is often made by men who are against women doing plus sized modelling is that the world is hypocritical and that \"you don't see men being plus sized models, the only reason women are plus sized models is because women need to be catered to. Where are the plus sized male models?\" but then some men pop up doing plus sized modelling and talking about it online and these same haters then lose their shit.",
        "Uhm \"US president Henry Ford\"? 7:12",
        "Love you Mina ",
        "Thank you so much for your pronunciation of Versace, yes it's che not chee, they are Italians from Europe not jersey italians",
        "i think the biggest shock out of all of this for me is that i was surprised by the padding smaller models to make them look fatter, rather than hire fat models. i didn't know i had the capacity to still be disappointed by fashion companies this way, wow",
        "I just wanna said your are more boho than you would said, looks amazing on you.",
        "to be honest you are my idea of an it girl I can admire and like. I really do like and respect you and you are so lovely as well!",
        "love you Mina one thing more: there is not enough mid-sized models! I see only skinny or fat :/",
        "my friends and I were talking about what we like to watch on YouTube and I said video essays then had to explain what it was.\nMy best friend chimed in with “oh yeah— you like to watch that girl with the tiny eyebrows”\nShe’s definitely seen me watch you a handful of times XD",
        "It's heartbreaking to hear what most models go through, but ESPECIALLY plus-sized models. Brands need to stop wielding them as their token \"we're inclusive and diverse cards\". As a fashion brand, you make clothes for EVERYONE. It makes commercial sense for you to cater to a wide variety of shapes, sizes (and colours). So if you're clothes on the rack reflect that, so should your models. The term \"plus-sized model\" shouldn't even exist because at the end of the day, they're all \"mannequins\" representing a tiny demographic that's hoping to buy something that makes them look cute. People wear the clothes! Clothes don't wear the people so stop forcing people to change their bodies to fit these garments, and maybe make garments that fit these bodies. Isn't that what fashion is all about?",
        "Mannequin is just a french word for models not literally a plastic mannequin",
        "6:47 the ANTM sound effect lmaoo",
        "Naomi is still that chick ",
        "I'm portuguese and here in portugal and spain we also used to say mannequin instead of model",
        "4:15 Funny in France we just call them directly mannequins but we don't necessarily link them consciously to the object version even though the word is the same.",
        "I mostly disagree because I am kpop fan \nAnd kpop has a lot of it girls",
        "Maybe just an interesting tidbit about 'maillots', in the Dutch language the word maillot ( from the french word, stilll used in French though more broadly)  to refer to tights. So covering the body from hip to toe.",
        "Yasmeen ghuri was an amazing model of the 90's but many say she quit at the height of her career. Tyra Banks even said she had the walk of life. Totally one of my favourite 90's model",
        "you are really good at explaining these topics and you make it much easier to process for my tiny brain",
        "sincerely, a unique face is so much more beautiful than others",
        "I might sound strange but who wants to see Max Miller and Mina Le Collab? Food History meets Fashion History.",
        "all i heard was \"US President Henry Ford\"",
        "Does anyone perhaps have the link for that editorial clip she showed in the video?\nVery informative as always!! :D",
        "Man where the F yr eyebrows hahahaha",
        "oh my god from now on i would never call myself curvey again, I'm \"elegantly rolled.\"",
        "I love how you always go into the history! That was very interesting to listen to how the modeling industry began - and even in the 1800's a model needed to be tall & thin. Since I was 13, people told me I should model so I took a stab at it in my late 20's after losing some weight (Which was inspired by Fashion TV and ANTM). I was hungry to learn posing, the walk, and make new connections, but the agency I signed up for made us do a 6 month class. We did start to get work and I realized that I wasn't well-suited for fashion as most models get started in their teens. It's actually a compliment, because as you mentioned, runway models are meant to look more edgy, almost alien whereas commercial models are more like the hot girls. ",
        "I think social media have a big impact to model industry. It is a big deal for the designers and companies to have a model/influencer/singer/actor etc who has millions of subscribers.\nI don’t know but maybe someday this bubble 🫧 will burst ️ When we no longer connect our lives with social medias.",
        "People have always done the best for themselves and we shouldn’t be mad about that if girls wanna do Pilates it’s an Exercise like just do it it’s not that serious the it girl I guess could be defined as the “it girl”the girl that everyone wants to be so aside from physical attributes like working out or behavior we could really narrow it down to Looks And at the end of the day you don’t have to have everyone to love you or to be famous to be in it girl being an a girl in your community could should be just as important than being some online celebrity that shouldn’t matter to you living in your luster is iconic When people tell stories about you are they gonna remember you struggling and living a lie is that even important to you ?",
        "Too many people nowadays are making a conscious decision to stylize themselves in a way that says \"I'm the best\" which is a huge turnoff and inauthentic. Just because you say you are the something, doesn't mean you are. And if you have to say it, I'm going to believe it less. I blame Nicki though for a lot of this, she took the usual rap bragging and drove it into the ground.",
        "I literally don't know anyone that is IT or in or popular in mainstream. I'm so removed from that style that I don't know anything about it, my family don't, my kids definitely don't, so it becomes \"mainstream top 40\" that the rest of the world doesn't even care about. Sticking to alt and smaller scenes",
        "I was asked to model for a well known boutique in New York some years ago. For context, I’m a Black Latina woman who ranges from sizes 12-14 but I am 5’8” with a more proportional hourglass figure that is deemed as more “palatable” to these sorts of photographers and fashion people. When I got to the shoot, they wanted me to model a range of different items that did not fit well or were outright a size xs and asked me to take off my bra which made everything look unflattering imo. To make matters worse, they paid me in free clothes from their store instead of in real money (which isn’t rare in the fashion world but it’s sad). When I returned to the store to redeem my free items for the shoot I did, they didn’t even carry any clothing items in my size. ",
        "models were being used in industries longg before the fashion industry came along.\nwomen have been objectified and used to raise the appeal of products like cars and real estate and even investment opportunities, from the beginning of time, women have been used as accessories in selling products.",
        "I consume the abnormal amount of american media, life style bloggers, commentary YouTubers etc. And i always so fascinated that Americans don't provide the accepted in the whole world measurements when they say something that refers to metric system that almost only they use. like wtf is inches? pounds?",
        "nice red hot chili peppers shirt cameo",
        "After watching this video it made me think of a relative who’s into the editorial side of modelling,but she happens to be “pretty” than “odd looking” still she’s very tall,I always look towards models like Bella Hadid and Imaan Hammam who are known for being pretty and are regarded as well known in the fashion industry for their looks.Anyway she was told growing up that luxury brands will want someone prettier since it’ll help them look more divine and high above(looking like royalty),she doesn’t wanna go to commercial because she believes it’ll make her stay within the country we live in instead she wants to go to editorial cuz it’s the highest paying and where she’ll likely meet international celebrities.",
        "When you say US President Henry Ford did you mean US President Woodrow Wilson or Ford President Henry Ford?",
        " 𝓅𝓇o𝓂o𝓈𝓂",
        "Ick ",
        "HOLD THE PHONE! SIZE 10 IS CONSIDERED PLUS SIZE ALREADY WTFFFFFFFFF?!?!",
        "Henry Ford? US president?",
        "Why is there no it Boy",
        "Hey Mina! Henry Ford was a US industrialist and founder of Ford Motor Company. Gerald Ford was a president of the US in the 1970s. But Henry Ford was never president. Just figured that was worthy of clearing up.",
        "u know its gonna be a good day when mina le posts",
        "Doee anybody know what type of mic Mina uses?",
        "f̷̩̜͚̤͇͔̿̋̓̐͜͝͝e̷̞͍̲̜̔̃́͝e̷̠̭͎̽̂̾̕d̷̛͈͊͌̌̊̔̏̊͂̔̚̚â̵̬̰͍̾̉ĺ̸̞͌̐͐̉̑̐̓͒̎̊̈͘͝g̸͌͋õ̴̡̯̥͔͓̙̪͓̫͓̞̞̣̜͓̅̀̑̉̒̋̇̄̐̋͝r̸̔̆̍į̶̨͓̗͚͚̳͉͕͚̝̪̳͍̲͌̈̊͗͛̎͌̌͒̏̒͋͘͝t̶̨̘͕̂̽̀̉͐̈́̎͌̌̿́̆̿h̴̡̥̺̤̳̘̳̜͈̝̤̱̾̐̽m̷͉͊̾̊̽̅́͋͋̍̂̋́̚̕͘",
        "babe wake up mina le posted",
        "Very interesting information ! I wanted to be a model when I went off to college and discovered the Victoria Secret angels on tumblr  now I’m pursuing that dream in the online space with Instagram, YouTube, and exclusive content. It’s definitely cool to learn the history behind this career I’ve been inspired by for so long.",
        "This video is like my philosophy if that translates",
        "Something not mentioned was how models must often be tall when, for example, the average height of women in the U.S. is 5'4'.\nWhy do models have to be tall?",
        "Please get a new editor they clearly don’t know what do to with your content ",
        "I FOUND THE GARMENT YOU MENTIONED. Maillot in french usually refers to bathing suits, so it's very hard to find what you're looking for with that word. Auguste de Villiers de L'Isle-Adam, a french author of the time seemed to have called it \"maillot\" and \"fourreau\" (a sheath or a type of tight dress). Both words are pretty useless on search engines.",
        "the way that you speak and script your videos makes it so easy to remember all this amazing information.i learn more from you than i do from my teachers.you are so incredible,my favourite youtuber forever and always.thank you a million mina <3",
        "Does anybody else notice the måneskin cameo",
        "20:18 oh yeah, TiVo did that but eventually advertising found ways to force us to watch the dang commercials.",
        "Henry Ford wasn’t a U.S. president, right?",
        "gia marie garangiiii",
        "i also think the idolization of supermodels has come to an end because, at least rn, we are celebrating so many different bodies. like you said, even the plus size models are expected to have certain proportions so even them are probably only really admired by people who look like them. we have so much body diversity on social media now that we all can choose our personal ideals and there no longer is no one singular shape we all wish to be which results in no more “it girls”",
        "Makes me think of the recent interview with lily rose depp where she dramatically downplayed the impact of nepotism on her career. Like being 5’2 and walking for Chanel at 16 is something anyone can achieve ",
        "One of the most toxic and wasteful industries in existence today.",
        "Please grace us with a Smokey eye and no eyebrows. The intro clip in the beginning is ",
        "Just a curious fact: maillot is what we call a classic one piece swuimsuit in portuguese (maiô), i think they probably originated from the same concept? Lol, love the video",
        "Mina: \"I don't know why the '64 show isn't on youtube!\"\nAlso Mina: \"They paraded with a shotgun and threw pheasant blood on the journalists.\"",
        "i learned that models in the 1930s earned more in a week than i do in a month.",
        "Wow, Elsa Klensch! I haven’t thought about her in years… I used to tune into her Style show religiously as a young girl! I see she died only 8 months ago… RIP to her.",
        "My opinion, I know it's harsh, but I hate models and the whole industry that made it.  They just destroy the self-esteem of beautiful and talented girls, and they are doing it to this day, despite all the humanization that is happening now.  I just hate them all.",
        "Another incredible video, thank you!! ",
        "I think that as traditional media (TV, magazines,newspapers, radio) are disappearing, we’ll see more fashionmodels come from the social media/influencer corner. Self-made fashion models if you will. And I actually think that is fine because then it is «us» that determines which «look» we want to see and not these agencies or fashion houses  Perhaps this will lead to more diversity eventually. I for example choose who I follow on IG and other social media and a lot of fashion content creators that I like and follow do not conform or follow the conventional white-eurocentric-skinny look ",
        "BY BY..",
        "I think you gained a lot of traction for your history research aspect in your videos and I loved seeing it so prominently in this new vid now :)))",
        "Mina is back. I'm freaking out. I'm obsessed with your videos",
        "I do like how apps like tiktok and Instagram has the potential to democratise modelling? Like people can build up their brand and gain a following without the need for an agency. As I think agencies have been gatekeeping pretty arbitrarily (as an outsider looking in).",
        "Low entry barriers is similar to what the young lady that was posted earlier in the video said.",
        "Great video! I always learn so much from your videos",
        "I had a shoot yesterday and it's kind of sad that I was happy the hair and makeup people could work with my skin colour and hair type.",
        "Fun Fact: Lucille Ball and Joan Crawford worked as Chorus Girls.",
        "Lol when I realized that half the modeling industry is just human traffickers with LLCs",
        "Remember, before the supermodels came in, runway models were separate from print models. Gianni knew this and knew that booking all the superstars at the time would make him huge returns. Cindy was the biggest commercial model as she wasn’t on the runway as much as her counterparts. It was because of Linda evangelista demanding more pay that other models soon felt the same way.",
        "I <3 when mina posts.",
        "nice one",
        "I think it would’ve been interesting to talk about violet chachki, miss fame, and the drag race to fashion industry pipeline",
        "I did some very low-level/local modeling as a pre-teen, which included classes from my local agency. I was given \"advice\" like \"don't make too many facial expressions, they'll be wrinkles some day\" and \"don't do activities that could result in getting a bruise bc then you won't get hired.\" As a child, it's very hard to hear (essentially) \"don't have fun or be a kid!\" The industry is also super predatory for children - telling them they're \"in\" but then requiring parents to pay thousands for comp cards, suggesting you go on \"casting cruises\" put on by large bookers, etc. They know you're not going to be a professional model, but you're a source of revenue as much as you generate it.",
        "Watching this while getting over a cold and trying to zone out, but then you said Henry ford!s name, and I just spent the last week preparing for a test on 20s and my teacher would not shut up about him and the ford model t, and you said his name and so many random facts just flashed through my brain. For example, did you know that the ford model t had 10 000 parts, took roughly 93 minutes to make, and half of the Canadian population owned one by the end of the 20s?",
        "Wait is it just me or you lowkey sound like the tiktok filter",
        "Thank you for bringing up the power of Nepotism and the unfair advantages of accessing the best surgeons and best PR possible to attain a high paying modeling job. There is a reason why Naomi Campbell refuses to call Bella Hadid and Kendall Jenner “supermodels”",
        "There is that “plus size” model Ashley something, she held a Ted talk. I was SHOCKED when she said she is plus sized. What the heck. IDK how she looks now but back then she was definitelly skinnier than a normal person",
        "Lies!!! No oneis well clothed by standardized made garments!",
        "Research queeeen!! I would love to see a future video about the impacts of reality TV (and maybe parasocial relationships). Specifically, shows that revolve around dating and romance like Love is Blind and the Bachelor(ette).",
        "Hey Mina, just wanted to make a couple of corrections. While Worth is credited with creating the first fashion show, it was actually the designer Lucille Duff-Gordon who began original \"fashion parades\" inside her home. Worth was just the first one to publicize the idea, so he ended up getting the credit for it. Also, Henry Ford was never president. You're thinking of Gerald Ford. :)",
        "lmao seeing you have to describe what TiVo/a DVR is makes me feel so old",
        "wait wasnt mina a model?",
        "Mina, I fell in love with how you look in your black t-shirt and without makeup, you’re fascinating (don’t get me wrong, I like your makeup and style but this casual outfit also suits you so well)",
        "I love the fact that you're editing in a rhcp t-shirt keep up the amazing work, i really enjoy your videos",
        "the super model is now replaced for an unknown instagramer/tik toker that jumps into fame because she has a \"good body\"",
        "I’ve been a “mid-sized” model for three years now and it’s not easy for anyone in any body in this industry. Having your worth and pay be determined by whether or not clothes fit you and how good you look in photos is extremely damaging. Even when I was modeling for mid sized pieces they were also always way too big or way too small and every shoot I’d have someone tell me I either should lose or gain weight it’s so exhausting.",
        "Mina, I appreciate you for putting so much effort into your videos. Their quality always shows! Great video.",
        "You can’t make millions if you’re not a nepo baby these days.",
        "This was an excellent video. And very informative. \n\nWhat stood out to me was “Everybody is looking for the Kate Moss and Natalia Vodianiva” - But no one is looking for the black girl or the minority girl.",
        "BRING BACK FASHION BRING BACK REAL MODELS \nbring back 2000-2015",
        "i thought you were a model from your instagram bio",
        "Do a video about the latest nepo baby pretending it's ONLY hardwork and denying privilege : Lily rose depp. Top Model Vittoria Ceretti called out the unawareness and deniability  around privilege that so many of the nepo babies have and now an insane amount of models are backing her up and telling their stories!!! Diet Prada made a post about this and even industry big names like Naomi Campbell were agreeing with the sentiments of frustration Vittoria expressed. Love your videos btw!",
        "huh, ford wasnt a u.s. president, was he?",
        "Henry ford wasn’t a president  also pronounced: “longshomp”",
        "I'm not done with the video yet but Vogue has a great docu series here on YT about Black models for anyone who's interested!",
        "i was discussing this with a friend the other day and thought about how much i wanted you to make a video on it.... dreams do come true",
        "US president Henry Ford??",
        "Actually in french the word for \"model\" is still \"mannequin\" :)",
        "Fashion being democratized means it’s harder to declare someone queen.",
        "Did she just call Henry Ford president????",
        "Ashley Mears is actually a former model herself, so it's interesting that she went into researching the modeling field. I've read some of her research about this particular 'look' in the editorial fashion modeling field, where she explains why models look a certain way. It all boils down to industry conventions, based on the ideal look of aristocratic sexual unavailability - which is a mold only extremely thin and white, young women fit into. And nobody in the field has an incentive to change this, so things just stay the way they are.",
        "mina le is one of the most educated youtubers right now. i love her so much",
        "\"US president Henry Ford\"  Normally your videos are so well researched, it's disappointing to see such an easy google be wrong here.",
        "The most common definition of a supermodel is someone whose fame is on par with a celebrity, and who's widely known by people outside the fashion industry. By that definition, the 90s supermodels are unparalleled because they achieved that level of fame without social media, or reality shows, or the internet to boost their popularity. There are many current models who I think can be called 'modern day supers' such as Gigi and Bella, Kendall, Ashley Graham, Cara Delevigne, Winnie Harlow, but their roads to success is easier than those of the original supers. The only one I can think of, whose rise was somewhat similar to the traditional supermodels is Karlie Kloss.",
        "This gen-z anemoia for the 90s and 00s needs to stop. It was a horrible time to be a young woman and EDs were ingrained in mainstream culture. Stop romanticising such a toxic time that we should just forget about and never go back to.",
        "If we're considering supermodels for the current generation I would like to mention Adult Akech\nShe is grace and glamour on the runway",
        "I am a frequent consumer of your content and I usually enjoy most of your videos but the intro title clip seems very middle school science presentation. I did enjoy the rest of the video I loved the way you covered all the aspects of the modeling industry",
        "Beabadoobee is my it girl",
        "So now your talking, most of them cowardly except stuff they should never  do but they reported years latter's that's coward.",
        "Im glad you brought up Bella Hadid and the fact that she is plastic from the knees up.",
        "\"because french and american women looked soo different\" they did actually! French people are far more ethnically distinct (especially back then) while americans were often notably remarked as looking like a \"hodge podge\" of genetics AND aesthetics due to the waves of immigration. Race as a construct has altered our perceptibility of ethnic markers that otherwise were very innately noticed in white european populations, just as it still is now in places across africa, the middle east, south asia, and east asia. An ethiopian can distinguish themselves immediately from a kenyan. I've always noticed how older east asians are far better at distinguishing each other than newer generations too.",
        "Mina, can you recomend the best litruature for the history of fashion learning?",
        "34:21 this made me think of that blonde model who went on tv and compared having blonde hair to racism in the industry ️",
        "I'm not quite sure, is your dress dark green? It abs beautiful\nAlso, quality content as always ",
        "I started modeling when I was 16, but this is not a good job for me. Its very competitive and it was all about the looks. I had braces back then and I couldn't they them off for a few more years. It was hard to get a job, every casting agent would ask me if I am taking them off soon because they don't look nice... I was underweight, which was good for them, but not healthy for me. And because I was beginner nobody wanted to pay, I actually worked for free for a while",
        "George Michael’s videos for Freedom ‘90 (1990) and Too Funky (1992) playing on heavy rotation on MTV also did tons to identify the supermodels to young people and make them look as iconic as music stars.",
        "part of the reason that runway models were not particularly “pretty” and didn’t have the on trend physique, was because most of the designers were queer men that didn’t care lmao. models were merely hired to be living clothing hangers. they obviously didn’t want them to be flat out ugly because they needed their clothes to look good, but it’s also partially where the whole “you have to be skinny to be a model” idea came from. in the 1950s, the ideal body type was very curvy and not necessarily in the slim thick way we know today. skinnier women were literally taking weight GAINING supplements to fit the standard. however, the models did not take part. there is obviously a lot of male gaze attached to the modeling industry but it didn’t start out that way.",
        "Maybe, i can be the next it girl  ",
        "2 of the most iconic Period Piece Fashion Show moments were in ‘Downton Abbey’ and ‘Miss Fisher’s Murder Mysteries’.",
        "Nepotism has ruined the \"IT\" factor in the modeling industry",
        "Did she just refer to Henry Ford as the Pres tho? what",
        "This is fascinating and really well made, incredible journalistic work ",
        "Modelling sounds like hell",
        "I love you girl",
        "I think being a model was (and still is) highly romanticized. If you go on tumblr or Instagram, you will find thousands and thousands of moodboards.\n\nEdit: while I'm not saying it's a bad thing, people should understand the fact that only the rich models can live that lifestyle",
        "LETS GOOOOO",
        "the issue is not that modeling is exclusionary (obviously it is), its that it exists at all",
        "Maillots At 5:09 is actually a French word! It means “swimsuit, or undergarment” and it’s pronounced \nMy-yoh ️",
        "Mina can I just say I love your editing when you stutter or added that SpongeBob clip you’re effortlessly funny",
        "Not me noticing halfway through the video that Mina's size makes that chair look fucking giant ",
        "Dude, I was a model in the 90s. That was the weirdest portion of my life. Some of the highlights were acting as a body double for more famous models in ads, and rubbing lotion on my 17 year old thighs for a cellulite cream commercial. Life is.",
        "Don't coment here even though I watched every vids but the bit with David Lynch Cracked me up. Thanks!!!",
        "Supermodels getting extinct…..Yes please….",
        "Maillots means t-shirt  in french",
        "Just having this idea for a video that Mina would surely do a wonderful job with: the history, meaning, impact of a person/model/celebrity being \"the face\" of a brand. After the Cindy Crawford bit in this video mentioning her turn with Pepsi,I got thinking of how Pepsi is kind of a basic brand to use that mode of advertising and wondering actually if they were one of the first like that seeing how sooo many have celebrity endorsements left and right now. I just wonder how that started and what it means for advertising and for the people who are \"the faces\".",
        "u my supermodel Mina <3",
        "This was very informative and entertaining! You’re great ",
        "Funny fact: in Greeks, 'mallio' means swimwear",
        "We will always want hotties to be exhibitionists for us.",
        "Loved",
        "Why no body talks about petite modeling and retailers too",
        "The lifestyle is a big thing. Makes me flash backs to FYRE Festival Fiasco & their ad campaign ️",
        "23:34 this part was just hilarious, really. Well, all of Corys jokes are just hilarious. Its fun to see him play Bendy again. -_-",
        "we need to bring back house of style on streaming platforms or on youtube but its so hard with the lack of footage/vhs people can't find",
        "It's so weird to think as a child of the 80s. I remember adults asking me what I wanted to be and I would say point blank \"a model\".  That's crazy to me now.  Lol since I'm 5'1 with huge boobs.  Ha ha.",
        "Uhh, Henry Ford was never a US president",
        "At 11:04 the girl looks like a little bit as Princess Catherine in Britain",
        "неожиданно было увидеть старый логотип канала культура, прикольно",
        "I don’t understand how your finger waves are always so perfect. You were certainly born in the wrong era. Well… maybe not socially, just aesthetically, lol.",
        "kurtis conner video AND Mina Le video in the same day, i’m overwhelmed",
        "still waiting for mina’s vogue cover tbh",
        "I was hoping (given the introduction) that the video would talk more about factors that serve as USP in the current modeling environment or the evolution of the \"it-girl\" factors over time. The video seems to have digressed from that. So, I unfortunately have to agree with the person claiming that today most perceived \"it-girls\" lack the \"it-factor\" other than nepotism.",
        "\"you were calling them mannequins, not model\"... feeling attacked in French as the literal translation of \"model\" is \"mannequin\" (pronounced with french accent)",
        "TAYLOR RUSSEL. SHE IS LITERALLY DEVOURING EVERY RED CARPET!!! Like im so sorry Tim but STEP YA COOKIES UP!!!",
        "I'm  people ",
        "absolutely captivated by her editing, research, and her fashion looks. Love you sm <3",
        "26:25 omg she is criticizing the make up artists, but she can't even walk",
        "People used to be called computers too ",
        "Please add measurements in cm too, it’s annoying to google every time you say inch",
        "Idk why they don't hire black makeup artist and hair stylist.  Pat McGrath a black woman is the most famous makeup artist",
        "Did I mishear you or did you say Henry Ford was a US president?",
        "Great video, as always. And I LOVE the dress!",
        "I absolutely love fashion, but we don't need \"It Girls\".",
        "The reality of plus size being size 10-14 is a slap in the face of the plus size customer.",
        "Had to stop this video to say... Look at that dress! You look stunning.",
        "MINA IM HERE",
        "All I know about modeling is Tyra Banks fooled us for years and that Nicole will never be on Naomi Campbell’s level. \n\n(I love watching compilations of Naomi Campbell throwing shade)",
        "Whoa - initial response to the first few minutes of your video wherein you disclose this creator who shares that they believe the era of the it girl is dead: no it is noootttt. I think that “it girls” are more localized, and spread out, and in the multiples!  No longer do we have one or a few “it girls”, but we have manyyyy influential “it girls”, shaping fashion, culture and style. Theyre not necessarily celebrities in the traditional sense, or even super resonant verified influencers, but girlies with their finger on the pulse, influencing us to do dark green lip liner and blue lipstick with graphic holographic liner like…  no waysss EDIT: yeah you said it better lol",
        "wasn't expecting to see måneskin in this video haha",
        "Another reason supermodels are nonexistent (except maybe Bella and the older icons like Naomi etc) is because nowadays EVERYONE is a model of some kind and it’s not exclusive. When everyone is a model of some kind or presents as one like IG models, no one is.",
        "Poor Tatjana…blurred out and unmentioned! For some reason she just didn’t go the distance in the supermodel era, despite being on that famous cover.",
        "If people want an interesting movie about the dark reality of the modelling industry, check out the Bollywood movie 'Fashion' starring Priyanka Chopra. It follows the journey and trials and tribulations of a model from when she is an ingenue to being a veteran.",
        "Kate Moss is the last \"Supermodel\", IMO!",
        "7:14 Henry ford wasn't a president he created ford (hopefully i dont seem like ass)",
        "I'm pretty sure some of the models in the \"edgy\" section were actually the band Måneskin! yup, at 29 minutes, that's them :) they totally fit the edgy model look \nedit: I forgot to say- great video!! I love your content!!!",
        "It is so interesting because whenever I watch the 1939 Joan Crawford, Norma Shearer, and Joan Fontaine movie, \"The Women,\" I kinda get a glimpse of what modeling was like back then long before the 60s and even way before the supermodel era. The industry is definitely very complex",
        "loved the video! it seems that theres it girls for every aesthetic",
        "I'm definitely a woman with the \"ick\" factor",
        "tbh Mina is the it girl",
        "OH MY GOD so sorry I'm just a couple minutes in but haha, maillot is actually used in the netherlands for thick, warm tights for winter. I know that doesn't really help with your question but it's funny haha. in dutch there's a ton of french words anyway!",
        "The whole vudro is great as always, but that david lynch reference ",
        "It's funny how anything else but Small is called plus size. In Starbucks, small is not the default size.",
        "Mina, can u teach us how do you do the research for the videos? You seem so informed and I suck at doing research. \nLove your videos",
        "7:15 US president?",
        "Mina is a dream, aside from the great content, she’s so relaxing to watch and listen to",
        "This was so well done \nSo many aspects of the industry nicely interwoven \nThe intersections of economics of control supply \nThe luxery that houses don't need to deal with human bodies ",
        "Yes ily mina le!!",
        "absolutely love!!",
        "sizing is crazy- that the industry calls certain people, like 10s & 12s, plus size is insane when we all know that they're smaller than the US avg. and that actual plus size people consistently pay more for the same kinds of garments. It makes me so mad; in my job, i see so many women who hate their bodies and are comparing themselves to size 2s, and I wish they had never learned to hate their bodies.",
        "kinda early for once in my life",
        "Henry Ford is the industrialist\nGerald Ford was the president of the US",
        "Mina, Henry ford was not a US President! Just the ford factory guy. Woodrow Wilson was pres at the time. Gerald ford was the guy in the 70s who succeeded Nixon after watergate.\n(Edit to say I had to look it up too, I could see how it could be confusing!)",
        "With all the “it girl” drama, I would argue that the it girl has never existed, MANY it girls have existed throughout history and in different periods.",
        "I would love a video about the fashion history of the leopard print coat/it’s relevance in culture and films!!",
        "It’s tough! I definitely feel like the industry is run by famous/rich ppl but then again with social media and multiple other factors there are a lot more and varied jobs. You can model and not make your sole income from it. I’d say most models are like me & have to do other things but I model bc I love it & also respect my own personal boundaries - although I’ve been in sketchy situations:/ and that’s a big issue with this industry which commodifies mostly female bodies…",
        "AAAHHHHH Ashley Mears was my sociology professor!!! she was one of the best professors I ever had and ignited my love for sociology. I love that you mentioned her!!",
        "This def didn’t pop up in my subs box babe!",
        "7:21 thanks a lot, henry ford >:/",
        "I think the term \"living mannequin\" was appropriate at first, because the job was originally just that. To \"model\" involves SO much more work from the worker; the way models pose their faces and bodies to intentionally showcase (sell) the garment seems to have evolved with the craft, itself... and feminism ",
        "As a disabled person with no real skillset other than that I look the way I look the industry have been a savior for me but also a burden.",
        "Have you seen phantom thread? Would love to know if you have I feel like you’d love it but also maybe not??? ️",
        "I wish you had talked about americas next top model and how it caused a crash of ideals and literally did not showcase how an actual model is trained/supported by their contracts. Also, the fact that the people who win really aren’t notice at all afterwards.",
        "US President henry ford????",
        "Mina I love the way you break this down with so much insight and confidence. It’s people like you who will bring in the new era of defining fashion and the industry ",
        "Mannequin dehumanising, lol, you shoulda seen my reaction when I learned in France they still use that word for a model, lol",
        "There’s more white models in the industry, because white people are the higher population. \nSo naturally, that’s going to be the case. \nIf you go to a modeling agency in Mexico, obviously Mexican models are the majority. Same with blacks in Africa. ",
        "been craving a mina vid!! Ty!",
        "This was extremely interesting!!",
        "In French, the word mannequin is still used widely !",
        "My fav era of models is the late 70s/early 80s, with Gia Carangi (), Janice Dickinson, Patti Hansen, Carol Alt, Beverly Johnson etc.",
        "I think of supermodels as such an 80s thing,  I never got it then, I don't think we need to have it now! another reason for the downfall of the supermodel gang was Naomi Campbell saying she wouldn't get out of bed for less than $10k, so people began seeing the models as bratty and entitled. There were more stories in papers about models abusing their assistants, etc. I think pretty soon we are just going to have AI created models, after all, with photoshop, the models don't even look like themselves by the time they arrive in print.",
        "Henry Ford was not a U.S president. 7:20 he was an  industrialist",
        "And here I am wondering if I can afford a box hair dye, because I'm starting to see some grey hair. Maybe I can make it look cool tho.",
        "If you love this video @moderngurlz talks about this topic! Love you both <3",
        "Mina are you considering putting out a non-fiction book about fashion history? The burn about the Welsh model with her fur stool had me dying of laughter. Also I'd love it if you release a q&a video soon",
        "I always wonder about how wild the specific model/fashion competition reality show there were in the 00's-10's like ANTM and all the international versions, Make me a supermodel, America's Most Smartest model, She's got the look, the agency, the shot, project runway.",
        "What's interesting is that we still use the word mannequin in French to describe models",
        "mina le + a little w3ed + painting my nails🫡",
        "When I buy clothes online, I look at the pictures to see if the way the models are posed is hiding something. Part of modeling culture seems to be taking something that may be made at the last moment or in a slapdash manner, and then making it look better than it is, which I can only guess adds a lot of pressure to the models themselves",
        "Oh my freakin gosh. You go SOOOOO DEEP. I got so excited clicking this video because I knew there was so much I did not know at all",
        "My grandmother was a fur model for a department store in the Midwest (I assume in the 30s or early 40s prior to her marriage but I’m not sure). She also did window dressing for them, so that certainly suggests the pay for modeling alone was not great. I do have a newspaper ad for the store, featuring her. I wish I’d been able to ask her more about it.",
        "Hi Mina, thank you for sharing the whole background of modeling history with such clarity. I have been modeling for five years now (I am 25), for freelancing gigs. I am not very tall (165 cm) and I mostly work for independent projects and exhibitions. I truly believe that social media is getting modeling much easier to reach, therefore it's a saturated path: as you said, high fashion brands prefer to work with celebrities, while the rest of the gigs are superficial and short term. Unfortunately, if a girl is seriously interested in getting a modeling career in the runaway shows, there are a few well-known agencies which work for prestigious clients (such as Elite models). The rest of the agencies might work or not, depending on its popularity, location, the agents, etc... although they may offer just a few gigs once in a while. ",
        "Its kinda funny cus in french we still use mannequin for model",
        "Actually, in France we still say \"mannequin\" to refer to model",
        "thanks, mina. it was amazing as always! i am interested in high fashion, supermodels, and especially a 90s it girl supermodels lately. even tho i knew a lot this stuff, it was very interesting to watch it too. <3",
        "Love the research.\nI feel like people have so many subsections on styles, cultures, and body types. \nI also feel like we have so many people living under a rock and are only in one section and may not know who's actually out there doing the model work.",
        "No, the supermodel is not dead. She is Dua LIPA.",
        "4:00 got me thinking that in france, we still call models \"mannequins\" !",
        "I've always wished I could model. I'll admit, I love being the center of attention sometimes, who doesn't. The thought of people working on my hair and makeup at the same time sounds like so much fun. My mom would always tell me \"I'm all dressed up with nowhere to go\". Buuuut with my 5\" 3' frame, xxx lbs, tattoos, \"wide\" hips, and eastern European nose, I'd be put in this weird edgy group you're talking about. I also know that, as someone who is in recovery for ed's, it would destroy me. I will remain dressing to the 9's to get coffee as I always do for now.",
        "Corys Impressions are honestly some of the best Ive heard",
        "This is soooo crazy. Today I was thinking about how there aren’t as many “it girl” actresses as there used to be. I guess great minds think alike!",
        "I think it's interesting that here in Brazil it's still very common (especially with older women) to say \"mannequin\" when they mean \"model\".",
        "it really sucks that modelling is so entrenched in unattainable beauty standards because i think it has the potential to be something extremely empowering and fun. like, imagine a world where anyone could model without being forced to change. imagine a world where anyone's body and features could be celebrated in such a way on a wider scale. imagine how fulfilling and freeing it could be if anyone was able to model and express themselves in that way, to make their bodies into art as a profession. but no, instead modelling as a profession is used to put limits on people. it makes me sad that the modelling industry - and by extension the fashion industry - is the way that it is.",
        "i also don’t agree with that tiktok wtheck",
        "“there are no more it girls”\nbella hadid: ️",
        "The model industry is definitely not for the faint of heart. People tell me all the time I should model but there’s a lot of risks and instability that’s revolves around it. Also what I’ve noticed also since Im from NYC It’s really important to have develop an image of yourself on social media you basically have to become an influencer/celeb just to continue having a consistent model career unless (you have a trustworthy agent in your corner ofc) I believe that’s what the tiktok in the beginning was referring to as well.",
        "You are amazing girl! I just watch your videos no matter the subject lol. ",
        "The problem number sizes is that 10-14 are kids sizes in Europe, or small sizes in American Sewing patterns. When I modeled I straight up would not apply if a designer didn't use measurements. Asian designer always provided measurements in cm, although their sizes run much smaller, even compared to the average person in their respective countries. ",
        "I think we need a part two because there's so much else problematic to talk about with modeling! Exploitation of young girls, drug use, low pay and ageism to name a few. I don't know if it's better now but I remember reading about some really wild stuff in the early 2000s-2010s.",
        "I've been sending around my modelling portfolio yesterday, wish me luck!",
        "Mina Le & Mila Tequila are our generation's most important historians.",
        "My mom was a \"departement store model\" and this is actually how she met my dad. My dad was hired to take pictures of the fashion show and he had a suspicious amount of pictures of my mom. Their bosses then hooked them up and they got together",
        "love ya, I love this videos",
        "I agree with you thinking that the it girl isn’t dead. I just think it’s changed and isn’t as distinct as it was maybe 20 years ago",
        "Love your editing style",
        "The word mannequin is linguistically not very dehumanizing as it's coming from the Dutch ''manneken'' which is  literally ''little man''. This is of course different from the historic context, but I thought it's a cool etymologic detail.",
        "Gigi Hadid has a whole generation shaving off their eyebrow tails to achieve her plastic surgery look… she created the “eyebrow lift, snatched” look … SHES THE IT GIRL OF THE LAST 5 years! And yes the new IT girl needs plastic surgery to be IT…",
        "3:53 we still call models \"manken\" (which is the turkish word for mannequin) in turkish",
        "imo bella hadid is a supermodel",
        "genuinely get so excited to see a new vid essay",
        "Hi",
        "But why was Tatiana blurred tho?",
        "i had no idea who the Hadids and Kardashians are until 2018 im 25",
        "Can't believe Maneskin ended up in this video 29:00 lol",
        "Lastly, this marker of supermodel is only for women. Men do not get this level of fame, success, or income. The industry is inherently sexist in that way. One of the few industries where women dominate. But you ppl aren’t ready to talk about that. Honestly, I don’t think it’s a problem or that men care, but it’s a thing.",
        "That accidental retainer diet is so real.",
        "\"it's giving unscripted\"",
        "I have seen inland empire ten times and no one believes me when I say that but it’s a pure accident it’s just a good movie",
        "Mina! This is off topic but I found an amazing 1950s berry velvet Ceil Chapman dress I think you would looooooove and it would look amazing on you! You’ll be the ultimate it girl ",
        "So, show of thumbs. How many of you spent the whole video pondering the movie Zoolander?",
        "3:55 the french word for model is still \"mannequin\" even today lmao",
        "29:00 omg måneskinnnnn <333 i love them so much",
        "I'm sure this was just a slip of the tongue as we all know how meticulously you research your videos, but around 7:15 you wrongly identify Henry Ford as a \"US President\"! He was President of Ford Motor Company, but never (as far as I am aware) ran for public office.",
        "Plus size models always only have one look too. Flat tummy, thin face , super hour glass, and very tall. Torrid has a lot of issues for this and how they treat their models. They also fall into the issues of plus size clothing being made to cover people up ans not stuff off.",
        "I’ve said it before but modeling died because the only people who can afford to go into the career nowadays are untalented nepo babies and spoiled rich kids. I see TONS of super talented, gorgeous people who would make amazing models but unless they are plucked from obscurity Cinderella style, there is no way the majority of people can afford to be a part of the industry. (I honestly think the same about acting and most entertainment/news/govt industries etc but I don’t think they are as bad —yet— as modeling has become)",
        "Excellent video as always!",
        "Kind of disappointed you didn’t include Gia Carangi, the first “super model”",
        "I never had body image issues until I started modelling at 16, everyone in the industry was so toxic about weight and what to do to lose more weight. I had to stop after 2 years for my mental health",
        "Just wanted to say, that dress is super cute. Love it!"
    ],
    "comments_disabled": false
}