{"video_id": "65tc_KzZQ98", "comments": ["Mina: \"I don't know why the '64 show isn't on youtube!\"\nAlso Mina: \"They paraded with a shotgun and threw pheasant blood on the journalists.\"", "I was asked to model for a well known boutique in New York some years ago. For context, I’m a Black Latina woman who ranges from sizes 12-14 but I am 5’8” with a more proportional hourglass figure that is deemed as more “palatable” to these sorts of photographers and fashion people. When I got to the shoot, they wanted me to model a range of different items that did not fit well or were outright a size xs and asked me to take off my bra which made everything look unflattering imo. To make matters worse, they paid me in free clothes from their store instead of in real money (which isn’t rare in the fashion world but it’s sad). When I returned to the store to redeem my free items for the shoot I did, they didn’t even carry any clothing items in my size. ", "As a cis-man, I don't think I'm your intended audience, but I'm here because I love your in-depth analysis of modern culture.", "I 100% developed my ed because of the impact of the topmodel shows. The whole concept of your life being amazing when you're thin enough was just wild in the late 2000s/early 2010s", "The term “Supermodel” is used too loosely in my opinion. Only after Bella Hadid’s Coperni spray dress did I consider her a supermodel. There has to be a “Wow” moment while the model is modelling for me to consider them super", "Hey Mina! Henry Ford was a US industrialist and founder of Ford Motor Company. Gerald Ford was a president of the US in the 1970s. But Henry Ford was never president. Just figured that was worthy of clearing up.", "I think being a model was (and still is) highly romanticized. If you go on tumblr or Instagram, you will find thousands and thousands of moodboards.\n\nEdit: while I'm not saying it's a bad thing, people should understand the fact that only the rich models can live that lifestyle", "the modelling industry is so multi faceted and no one is better to discuss it than Mina!", "Tbh I was feeling physically ill when you were quoting what people say is the \"it factor\". It's capitalism and the patriarchy coming together to form such a toxic environment. I love fashion and fashion history, but the modeling industry is definitely one of the worst parts about it.", "I used to model part-time to make some extra cash for college. The industry brought about self-image issues I didn't even know existed. I hated not looking white, was ashamed of my arms, etc. I eventually stopped modeling and my self-esteem has slowly improved since. Such a cruel world we live in. I feel for all the impressionable young girls out there.", "i respect the og 90s supermodels (and also a few working today)so much for their work and discipline, i just find it sad that today a lot of the “highest paid models” are just nepotism babies who don’t necessarily have the talent and work ethic of other models who woupd deserve the fame more", "I was obsessed with model Fei Fei Sun for a while. Girl is stunning and a supermodel in my book. I don’t remember ever seeing a Chinese model represented with that kind of caliber. She was the 1st solo Chinese model to grace the cover of Vogue Italia. But I think she’s now semi-retired, and also gave birth in recent years. She’s still very young and can make a comeback. The Asian powerhouse models in the earlier days include Devon Aoki, Kimora Lee Simmons & Yasmeen Ghauri. You are for sure an it-girl Mina!!! No cap!!!", "I feel like the reason people respect older models is because a lot of them back then actually had unique walks and seemed to look so gorgeous in a natural and effortless way whereas supermodels now are mostly nepotism babies (think kendall jenner) who live off being mediocre models and don't really have that much of a passion for fashion although there are still some models who are actually distinctive to make things interesting (think bella hadid)", "mina le is one of the most educated youtubers right now. i love her so much", "off topic rant: In my country next top model and other model shows are like a family show, everybody is watching and talking about it. The judges are insanely rude to the girls, extremely agist and every season in the first round of auditions they flat out MOCK any girl that doesn't fit outdated American 90s beauty standards even though the show has only Balkan and Mediterranean audiences. Plus if they do pick a girl with like three stretch marks, 2 zits or a visible surgery scar they act like they are true altruists giving chances to the less fortunate.  I'm pushing 30 but this can't be healthy for young girls to see.", "The model industry is definitely not for the faint of heart. People tell me all the time I should model but there’s a lot of risks and instability that’s revolves around it. Also what I’ve noticed also since Im from NYC It’s really important to have develop an image of yourself on social media you basically have to become an influencer/celeb just to continue having a consistent model career unless (you have a trustworthy agent in your corner ofc) I believe that’s what the tiktok in the beginning was referring to as well.", "My mom was a \"departement store model\" and this is actually how she met my dad. My dad was hired to take pictures of the fashion show and he had a suspicious amount of pictures of my mom. Their bosses then hooked them up and they got together", "As a photographer, I see the most promising side of the industry being influencer marketing. People deride influencers, but the truth is, influencers come in all shapes and sizes, and most of the influencers I've worked with are more or less normally-shaped people who really know their angles. They show off what clothes look like on a variety of bodies, and there's no talent agent breathing down their necks when they gain or lose a few pounds. I don't see editorial/ runway modelling going anywhere positive any time soon, but at least we have an alternative for people who love fashion and love creating fashion content, but don't want to dedicate their whole lives to gyms and dieting.", "I know this is off topic but can we just talk about mina's channel growth . I didn't even realized she reached 1mil subscribers. I remember being one of her first viewers, absolutely captivated by her editing, research, and her fashion looks. Love you sm <3", "I think there is a certain obsession with nostalgia in our culture today. Things change and that's ok. In the future, people will look at kendall, gigi, bella, hailey and will miss having lived in the era of it girls on instagram, of influencer models. I know that I like to accompany them. It's ok to like the 90's models but it doesn't make sense to think of reproducing what they were in a world as different as the one we have today. Anyway, this is just my opinion, I love your videos Mina!", "Mina Le & Mila Tequila are our generation's most important historians.", "as someone who's a teenage girl that's really into high fashion and dreams of being a model, it's so heartbreaking that as much work and effort i may put in, and do put in even now, the chances of me succeeding in the industry are so tiny and even then are dictated by whether a perverted middle aged american man finds me attractive or if an elitist old fashion personality does", "I never had body image issues until I started modelling at 16, everyone in the industry was so toxic about weight and what to do to lose more weight. I had to stop after 2 years for my mental health", "I just want to take a minute to appreciate that you actually type out the closed captioning for the entire video so that it's accurate. So few creators take the time to do that but it makes a huge difference to those who need it", "The most common definition of a supermodel is someone whose fame is on par with a celebrity, and who's widely known by people outside the fashion industry. By that definition, the 90s supermodels are unparalleled because they achieved that level of fame without social media, or reality shows, or the internet to boost their popularity. There are many current models who I think can be called 'modern day supers' such as Gigi and Bella, Kendall, Ashley Graham, Cara Delevigne, Winnie Harlow, but their roads to success is easier than those of the original supers. The only one I can think of, whose rise was somewhat similar to the traditional supermodels is Karlie Kloss.", "I've always wanted to be a model since my mom was a fashion designer and used to model her creations with her friends (they weren't shows huge we literally live in the countryside lol)+ she also wanted me to become one, so it became what I usually daydream of or fantasize about. Watching this felt like Mina was speaking about something very fond for me, even though I don't really have any experience in the industry.", "I feel like we had another supermodel bloom at the height of the Victoria's Secret days. \n\nI'm really curious to know your insights as someone signed with IMG, being a shorter model and how that affects the way you're perceived. Great video as always.", "This video serendipitously came out a couple hours after a modeling agency asked to interview me. I’m excited but now warned lol", "In French models are still called mannequins (same word also for the object). And it's not seen as dehumanizing at all, it's just the same word applied to two different things if that makes sense.", "3:56 A bit of historical context for “mannequin”: King Louis XIV, arguably one of the most fashionable men & monarchs in Western history, was the driving force behind making fashion one of the primary, if not the premier industries of France because he realized that fashion can be a form of propaganda. Kinda wild to think of fashion that way for us nowadays but it makes sense. Louis XIV knew that courtiers across Europe looked to other courts on the continent yo help dictate what their own kingdom’s/empire’s court dress should be so they could be seen as their own independent governing power. So to compete with Spain & ESPECIALLY England given their long contentious history, Louis effectively tied a good chunk of the national economy to raw material cultivation, textile fabrication, garment making (hello, beginnings of today’s haute couture!!), etc., so they could readily export all these products he would make be seen as valuable and drive up demand for by establishing a very highly aesthetic, super detailed (if not stringent) court dress to set France apart so when courtiers of other nations came to French court, they would have to get French clothing and then they’d take those clothes back home with them. So with the fashion industry developing as quickly as it did in France, they needed to have people wear the clothes for fittings when the courtiers were out of country and to have illustrations, which were paper/art propaganda pushing the sartorial propaganda, made that could be kept in historical records and sent off to the rest of Europe. And those people were called “les mannequins,” from which also comes the name we know as the inanimate objects we see in stores today, as well as the French word for “model(s)!” So shout out to politics & King Louis XIV wanting to be a gilded peacock", "i had no idea that the terrorist attacks happened on the same day of NYFW. i just looked up an article that talked all about it and everyone’s testimonies from that day. it sounds horrible. it’d be interesting if you could make a full video on that topic and how the events that happened that day changed the course of the fashion industry. i know you briefly touched on it in this video but i’d love to hear you talk about some of the stories and just how deep this really went. great video as always!", "My grandmother was a fur model for a department store in the Midwest (I assume in the 30s or early 40s prior to her marriage but I’m not sure). She also did window dressing for them, so that certainly suggests the pay for modeling alone was not great. I do have a newspaper ad for the store, featuring her. I wish I’d been able to ask her more about it.", "I would like to thank Heidi Klum because I remember watching ‘Project Runway’ with my mom. She was and is such a lovely host.", "Watching this as a full time model is very interesting, I work with both high end fashion brands and do ecomm/commercial work. You give a good perspective into how an outsider sees the industry and I really enjoyed learning about the history. However, there are some things mentioned that are a bit exaggerated (in reporting or whatnot) or aren’t really true to the job. Models can go into one of those two categories of commercial or high fashion/editorial, but this is not the ideal for an agency to do– the ideal for most models is to do a combination of both kinds of work. The modeling industry has become overpopulated and I guess that does drive down incomes, but there are so many agencies now that cater to more amateur models that don’t make much money/those agencies exist solely to exploit models financially, so it brings those stats down on income. Most models I know are making a pretty good income, those that aren’t are being worked by their agency in pretty exploitative ways (driven into debt, pigeonholed into low paying work, agents just aren’t pushing enough to get their models work) ", "Mina Le is my \"it\" girl, fight me. (don't fight me, I'm delicate, just support me)", "totally agree with your \"it girl\" stance. they still very much exist, it's just more difficult to pick them out among the growing number of celebrities and influencers that are popular now", "This video has brought to my mind yet another vlog topic I don’t have time to try and tackle but the weird intersection of amateur online Modeling, sex work(no shade) and Cosplay that lowkey made the cosplay community so much more toxic and competitive than before you could ever dream of making money doing it. Really was not something the community needed but the format and all the expectations were straight up pulled from the modeling industry. The way it feels pressure to be a certain type of unrealistic anime girl body type if you’re gonna bother posting Cosplay pics online. ", "This video is so informative, thank you ! I don't know if you know Gia Carangi, who is often considered as \"the first supermodel\", before the 90's era. She should have reach the same level of fame than Cindy Crawford (who came after her and was nicknamed \"Baby Gia\") but she died of AIDS in 1986. Her story is fascinating on every level. Your video remained me that she is often erased/forgotten in model history, even through her looks continue to inspire models to this day, like Kendall or Kaia Gerber. Btw, you have to know that your content reach every part of the world, I'm french and you're indeniably, my fave youtube creator ! You're truly brillant, keep going shining star ", "Ashley Mears is actually a former model herself, so it's interesting that she went into researching the modeling field. I've read some of her research about this particular 'look' in the editorial fashion modeling field, where she explains why models look a certain way. It all boils down to industry conventions, based on the ideal look of aristocratic sexual unavailability - which is a mold only extremely thin and white, young women fit into. And nobody in the field has an incentive to change this, so things just stay the way they are.", "I’ve been a “mid-sized” model for three years now and it’s not easy for anyone in any body in this industry. Having your worth and pay be determined by whether or not clothes fit you and how good you look in photos is extremely damaging. Even when I was modeling for mid sized pieces they were also always way too big or way too small and every shoot I’d have someone tell me I either should lose or gain weight it’s so exhausting.", "Can I just add how plus size models are rarely styled properly as well. The straight size model will be posed with a French tuck and a blouse a size larger to make it baggy but the plus size will be given their actual size and no tucks so they look different (I think worse) than the intended style. Plus sized clothing is often shapeless and then even with it isn’t, they don’t size up for the model to make the blouse look like it should.", "If we're considering supermodels for the current generation I would like to mention Adult Akech\nShe is grace and glamour on the runway", "Mina, I appreciate you for putting so much effort into your videos. Their quality always shows! Great video.", "What good karma did I do to deserve >30-min video from Mina. More, please! ", "i also think the idolization of supermodels has come to an end because, at least rn, we are celebrating so many different bodies. like you said, even the plus size models are expected to have certain proportions so even them are probably only really admired by people who look like them. we have so much body diversity on social media now that we all can choose our personal ideals and there no longer is no one singular shape we all wish to be which results in no more “it girls”", "The reality of plus size being size 10-14 is a slap in the face of the plus size customer.", "All I know about modeling is Tyra Banks fooled us for years and that Nicole will never be on Naomi Campbell’s level. \n\n(I love watching compilations of Naomi Campbell throwing shade)", "absolutely captivated by her editing, research, and her fashion looks. Love you sm <3", "I did some very low-level/local modeling as a pre-teen, which included classes from my local agency. I was given \"advice\" like \"don't make too many facial expressions, they'll be wrinkles some day\" and \"don't do activities that could result in getting a bruise bc then you won't get hired.\" As a child, it's very hard to hear (essentially) \"don't have fun or be a kid!\" The industry is also super predatory for children - telling them they're \"in\" but then requiring parents to pay thousands for comp cards, suggesting you go on \"casting cruises\" put on by large bookers, etc. They know you're not going to be a professional model, but you're a source of revenue as much as you generate it.", "I very briefly and naively was like hey maybe I should try being a model. then I looked into it and heard the horror stories and standards that I could never achieve (I'm short and like idk what they would want me to do about that) and was like yikes. maybe I'll just do a fun photo shoot with a friend instead.", "I loved the first half of this video. I wish you'd gone into more detail about the exploitation that rocketed in the 2000s, where models got increasingly younger and thinner, and the disgusting influence of fashion magazines ruining careers because a model gained a bit of weight, like Gemma Ward. Please do a part two!", "I always found it interesting the perceived higher value of editorial modeling vs commercial modeling. I signed to a model agency last year and was SHOCKED at how much more money there is in commercial modeling vs editorial modeling. I was asked if I wanted to take part in an editorial for Vogue Germany and it would have been completely unpaid for 2 days worth of shooting. I hear from friends that walking runway shows pay almost nothing or they pay you in clothes.", "I don’t understand how your finger waves are always so perfect. You were certainly born in the wrong era. Well… maybe not socially, just aesthetically, lol.", "I spent my entire work day on my feet steaming clothes for a photoshoot the brand I work for is having tomorrow and after an hour and a half of traffic hell I was thrilled to see  a new Mina video waiting for me. As someone who has been involved in the garment industry since I was a little kid (my mom is a clothing designer so I spent a lot of my childhood running around trade shows and helping out at photoshoots) it's always been so strange to see this glamorized image of what people think models do, vs the reality of it. It's insanely competitive, can be very toxic depending on the environment, and of course there's a ton of racism present as well. That's not to say there aren't any good parts because a lot of models do genuinely enjoy their work, but I really liked how Mina summed it up in this video. It's getting really difficult to make enough to support yourself even if you're just getting into low level catalog type stuff vs high fashion. It's not what it once was, and with the rise of influencers and so many nepotism babies around, it's only going to get worse. ", "just as i was getting into content about the supermodel era this comes out. amazing as always", "Great video! As someone who’s trying to break into the entertainment industry I find it extremely over whelming how superficial most people are. It’s extremely hard to break in but I guess it just requires hard work, dedication and perseverance", "I’ve said it before but modeling died because the only people who can afford to go into the career nowadays are untalented nepo babies and spoiled rich kids. I see TONS of super talented, gorgeous people who would make amazing models but unless they are plucked from obscurity Cinderella style, there is no way the majority of people can afford to be a part of the industry. (I honestly think the same about acting and most entertainment/news/govt industries etc but I don’t think they are as bad —yet— as modeling has become)", "You make even the presentation of the sponsor exciting to watch, so imagine that!! Brilliant Mina!!", "Mina is a dream, aside from the great content, she’s so relaxing to watch and listen to", "This is fascinating and really well made, incredible journalistic work ", "the way that you speak and script your videos makes it so easy to remember all this amazing information.i learn more from you than i do from my teachers.you are so incredible,my favourite youtuber forever and always.thank you a million mina <3", "It is so interesting because whenever I watch the 1939 Joan Crawford, Norma Shearer, and Joan Fontaine movie, \"The Women,\" I kinda get a glimpse of what modeling was like back then long before the 60s and even way before the supermodel era. The industry is definitely very complex", "Sitting down to edit a ton of photos and Mina has dropped a new video? My day is made", "George Michael’s videos for Freedom ‘90 (1990) and Too Funky (1992) playing on heavy rotation on MTV also did tons to identify the supermodels to young people and make them look as iconic as music stars.", "Giselle heard our cries and she came back with the quickness ", "learning the history of modeling and why the standards are the way they are is interesting because i grew up watching ANTM and that show literally teaches and perpetuates the standards of the industry", "I always wonder about how wild the specific model/fashion competition reality show there were in the 00's-10's like ANTM and all the international versions, Make me a supermodel, America's Most Smartest model, She's got the look, the agency, the shot, project runway.", "I feel like something in modeling that really needs to change is the height requirements. 5ft9 is much taller than the average woman.  Also, the same weight/proportions looks very different on different heights, so having only super tall models just makes the thin proportions look even more extreme, creating impossible standards for shorter women to conform too. If the clothing is good, then it should look good regardless so the body type of the model. Quality brands should have models of all sizes and heights.", "I'd say the pressure to be a certain size is the worst this is why a lot of models develop eating disorders back in the day models could get away with being a size 6 even a 8 now the standard is a size 2 or smaller", "Mina, I fell in love with how you look in your black t-shirt and without makeup, you’re fascinating (don’t get me wrong, I like your makeup and style but this casual outfit also suits you so well)", "Seeing Mina in a sweatshirt felt more real than I expected it would ", "Just having this idea for a video that Mina would surely do a wonderful job with: the history, meaning, impact of a person/model/celebrity being \"the face\" of a brand. After the Cindy Crawford bit in this video mentioning her turn with Pepsi,I got thinking of how Pepsi is kind of a basic brand to use that mode of advertising and wondering actually if they were one of the first like that seeing how sooo many have celebrity endorsements left and right now. I just wonder how that started and what it means for advertising and for the people who are \"the faces\".", "Mina are you considering putting out a non-fiction book about fashion history? The burn about the Welsh model with her fur stool had me dying of laughter. Also I'd love it if you release a q&a video soon", "I'm surprised you didn't talk about \"America's Next Top Model\". It's interesting how popular that show was, but nowadays Tyra Banks gets cancelled repeatedly when people talk about how harmful the show was to the models. The crossover episode they did with 'Rupaul's Drag Race' made me feel like they needed to use the show to help them stay afloat since RDR was and still is a hit. Andre Leon Talley and others were on the show too and it was interesting having that, and then also having celebrities like Nikki Minaj. (Miss J is still the best ", "I really like your editing in this video, it's been evolving really well over the course of your recent videos!!!", "Hey Mina, I respect how much time energy and thought you put into styling yourself and makeup. But I want to mention how gently surprising it was to see you in a dressed down to earth casual way. \nYou’re insanely beautiful either way, but more so when not put together because that beauty is unexpected and subtly vibrant too. cheers!", "Hello Mina. I am a fashion model working since a few years in the industry in fashion (first in France then Canada). I do mostly editorial, and a bit of catalogue for the money. In French we use the word \"mannequin\" for fashion model. I have never really thought of it too much.  I personally like it better than \"model\" cause in my mind \"model\" can be anyone in front of the camera, it doesn't necessarily imply the person is a professional, knows how to pose and walk... But that's probably just me! Also fun fact there we have to do our own hair and makeup a lot in Canada... The industry has no budget anymore to pay anyone... I'm not black, I'm redhead, and I have a similar issue! MUA never have my shade, I always end up orange. So I totally imagine the struggle of my counterpart of colour... I totally agree on how the commercial girls are often the \"money girls\" in the agency! I have often been refused from gigs because \"You don't look commercial enough.\" which is their way to say you're not conventionally pretty. But modelling helped me embrace my own unique look, my oddness and celebrate all these \"flaws\" that make me unique. :) So I have no hatred towards the industry!", "my friends and I were talking about what we like to watch on YouTube and I said video essays then had to explain what it was.\nMy best friend chimed in with “oh yeah— you like to watch that girl with the tiny eyebrows”\nShe’s definitely seen me watch you a handful of times XD", "thanks, mina. it was amazing as always! i am interested in high fashion, supermodels, and especially a 90s it girl supermodels lately. even tho i knew a lot this stuff, it was very interesting to watch it too. <3", "Honestly I do consider being a plus size model sometimes but seeing I have to keep the same size when I fluctuate in weight A LOT keeps me away from it. Plus (pun intended), it’s not a very sought out job and the clothes promoted through fatter bodies is always ugly sadly .", "I think you gained a lot of traction for your history research aspect in your videos and I loved seeing it so prominently in this new vid now :)))", "I like the vibe of these videos - no-nonsense deconstruction of topics. Modeling seems like a job were there will  almost inherently be this whiplash of the high of attention/ praise / status for models and the lows of criticism / objectification /often poor health and financial instability.  It's like the whiplash of being in an abusive relationship.", "34:21 this made me think of that blonde model who went on tv and compared having blonde hair to racism in the industry ️", "Loved the analysis! If folks like this they should watch the new Vogue series about Black models in the industry!", "This is soooo crazy. Today I was thinking about how there aren’t as many “it girl” actresses as there used to be. I guess great minds think alike!", "I think it would’ve been interesting to talk about violet chachki, miss fame, and the drag race to fashion industry pipeline", "It’s tough! I definitely feel like the industry is run by famous/rich ppl but then again with social media and multiple other factors there are a lot more and varied jobs. You can model and not make your sole income from it. I’d say most models are like me & have to do other things but I model bc I love it & also respect my own personal boundaries - although I’ve been in sketchy situations:/ and that’s a big issue with this industry which commodifies mostly female bodies…", "Remember, before the supermodels came in, runway models were separate from print models. Gianni knew this and knew that booking all the superstars at the time would make him huge returns. Cindy was the biggest commercial model as she wasn’t on the runway as much as her counterparts. It was because of Linda evangelista demanding more pay that other models soon felt the same way.", "This was very informative and entertaining! You’re great ", "2 of the most iconic Period Piece Fashion Show moments were in ‘Downton Abbey’ and ‘Miss Fisher’s Murder Mysteries’.", "After watching this video it made me think of a relative who’s into the editorial side of modelling,but she happens to be “pretty” than “odd looking” still she’s very tall,I always look towards models like Bella Hadid and Imaan Hammam who are known for being pretty and are regarded as well known in the fashion industry for their looks.Anyway she was told growing up that luxury brands will want someone prettier since it’ll help them look more divine and high above(looking like royalty),she doesn’t wanna go to commercial because she believes it’ll make her stay within the country we live in instead she wants to go to editorial cuz it’s the highest paying and where she’ll likely meet international celebrities.", "I think social media have a big impact to model industry. It is a big deal for the designers and companies to have a model/influencer/singer/actor etc who has millions of subscribers.\nI don’t know but maybe someday this bubble 🫧 will burst ️ When we no longer connect our lives with social medias.", "As a brazilian, I was surprised by hearing Giselle Band-chen instead of \"B-een-chen\", I've never thought that her surname was read like this by foreigners hahaha", "This might sound like an odd question but how do you know all this stuff? I haven’t been a subscriber of yours for super long so excuse me if you have mentioned it previously. I just can’t seem to wrap my head around the amount of knowledge you have surrounding these topics of fashion, it’s history, it’s culture. Like did you study this at university? Do you look up most of the stuff you’re saying and just delivering it in a fabulous way? Or is this just your passion so the urge to know itself just kept you going?", "Wow, Elsa Klensch! I haven’t thought about her in years… I used to tune into her Style show religiously as a young girl! I see she died only 8 months ago… RIP to her.", "The Glamour labor is so prevalent in Pageantland too… sure there are scholarships for the select few that win but very often the amount is wayyyyyy less than the gown you bought, the gym membership, etc", "The problem number sizes is that 10-14 are kids sizes in Europe, or small sizes in American Sewing patterns. When I modeled I straight up would not apply if a designer didn't use measurements. Asian designer always provided measurements in cm, although their sizes run much smaller, even compared to the average person in their respective countries. ", "I think of supermodels as such an 80s thing,  I never got it then, I don't think we need to have it now! another reason for the downfall of the supermodel gang was Naomi Campbell saying she wouldn't get out of bed for less than $10k, so people began seeing the models as bratty and entitled. There were more stories in papers about models abusing their assistants, etc. I think pretty soon we are just going to have AI created models, after all, with photoshop, the models don't even look like themselves by the time they arrive in print.", "AAAHHHHH Ashley Mears was my sociology professor!!! she was one of the best professors I ever had and ignited my love for sociology. I love that you mentioned her!!", "in my country, modeling is still not considered to be a respectable career. i have been offered to model for some brands and photographers but it kinda sucks that i cant because of my family. but ig its for the better because it seems like it can take a toll on you eventually."]}