{"video_id": "6D_2xU0oZ1w", "comments": ["Shoutout to jojo for filming so Colleen and Erik could just enjoy time with their kids on their special day and for creating a video full of memories for Colleen and the kids to look back on ", "I love how Colleen is just so grateful for every single present that is given to her family. Its just adorable seeing her open every single present and squealing when she sees them.", "You and Parker immediately locking eyes and saying “a box!” Is hilarious to me ", "I love that most people got each twin separate presents! As a twin myself I remember how frustrating it was to have to share every present with my twin sister.  but they forget we are two different people.", "Maisy’s face while everyone sang happy birthday melted my heart ", "I teared up watching them sing happy birthday to the twins. To think of where this little family was a year ago and where they are now. It makes me so happy to see the twins so happy and healthy. ", "I love that when Maisey was getting unsure she looked over to Erik and he smiled at her reassuring her and then she smiled again!", "Colleen: “How do they know me so well???”\n\nAlso Colleen: posts vlogs of what she buys for her babies all the time ", "This was such an aesthetically pleasing birthday party. Colleen says she just throws this stuff together but holy moly. So much went into the decor/games/ stuffing ducks. Etc. looks so fun  can’t believe they’re one already", "This group is the best on YouTube I swear man, the laughs and the energy can't be found like this anywhere else these guys set the standard", "Did anyone else form a little hope that Maisy and Daisy would become super close, when colleen told us Maisy name?so, happy for you Guy's and the fact that it's been a year and they have many  more to come. Can't wait to see how they grow this year as they start walking and talking more, and how their strong bond with flynn continues to grow.", "I need to hire Colleen as an event planner. Her parties are always so beautiful! I wish I had that talent.", "I’m so HAPPY to see Trisha and Moses and Malibu  yay!!! I really love that they came to celebrate. Im looking forward to seeing all the kids playing together when she’s older !  Happy Birthday  ", "The twins have grown so much! I love their personalities and how you can really see it in what they do and how they interact with things. You are such an incredible mom, and I am so impressed of how hard you work to make your kids happy.  I am really looking forward to all the fun content coming soon! Love you Colleen :)", "After Flynns 1st birthday he developed so quickly it seemed like it was like developing skills by the minute and we saw it all happen. Maisy and Wesley have already started the mile a minute and it's going to be awesome when they are all running around together. ", "A year ago I was crying on my couch watching your vlogs for comfort cause my husband had to be away for work for a long time and now I'm crying on my couch watching this video because the babies and all of you have come so far and my husband is with me and life is wonderful! Thank you so much for sharing a peice of your life with me!", "Everything about this is so precious and also iconic\n\nColleen parties always look amazing but also, Jojo doing the favorite moments?? Trisha bringing Malibu?? Amazing!", "I cannot believe it's been a year already! Colleen is so strong and I can't believe how beautiful this journey has been. We're so proud of you Colleen!!!", "I teared up watching this just thinking about how far the twins, Colleen, Erik, and Flynn have come. Happy Birthday, Maisy & Wesley! I’m so proud of you all. I love you guys! Also I’m so happy to see Trisha in your vlog and to see the babies meet!!! ", "Hearing everyone sing happy birthday brought me right back to your NICU days with them. How amazing that you all made it though that time and now you are celebrating their first birthday!! SO AMAZING!!", "It’s so sweet everyone brought them each their own gifts to open and you getting adjusted to that concept in real time is actually really heartwarming ", "Colleen: “How do they know me so well???”\nAlso Colleen: posts vlogs of what she buys for her babies all the time ", "One of the things I've seen twin parents do on birthdays, which is so cool, is sing happy birthday twice. So they each have their individual time to be the spotlight.", "Time really does fly. I haven’t watched your videos in a while and I thought I’d come back to visit. I thought, “I wonder if Colleen had her twins?” And I come to see that it’s already their first birthday. This is insane, you’ve created a beautiful childhood for me.", "Can we take a moment to appreciate how much time and work he puts into these videos for us ", "I can’t believe the twins are 1 🥹 Thank you Colleen for taking us on this journey. I know your NICU journey was incredibly hard and depressing. As a NICU baby myself, it was such a full circle moment to see Maisy and Wes thrive and develop. I love y’all ️ Happy birthday Maisy and Wes!!", "Colleen “idk how many ppl will come?..” \nthen proceeded to show and huge loving family  we all knew everyone would come for them and you! Don’t doubt yourself ", "Omg seeing Trisha and Colleen with their babies is so cute and so pure. I bet they both talk about how they both can’t believe that they’re moms now ️", "Colleen: \"we don't need presents we have enough things!\"\nEveryone: brings a present\n so sweet of everyone though, these kids don't know how lucky they are!", "JoJo is such an amazing auntie to all of Colleen’s kids, and Jessica’s kids. I love watching them together 🥹🫶", "Happy 1st Birthday to Maisy and Wesley! They are sooo cute!! Much love and light always! ️", "Happy Birthday Maisy and Wesley! You both have made it so far and are so strong! I've been here since day 1 and I am absolutely fallen in love with you both. Maisy's dances are adorable and her smiles are contagious. Wesley's laughs are humorous and his goofy attitude is just full of pure love. You both are the definition of picture perfect twins. I loved you before you were born, I love you now, and I will love you forever and ever! Colleen, you're an amazing mom. Kind hearted, hard working, and just above and beyond. You are an icon and my idol. I adore you and everything you do and love you so much! But cheers to 1 year, and here's many more to come!! ", "wow. it just hit me that the twins are A YEAR OLD!! i can’t believe it. it feels like just yesterday they were tiny babies in the nicu, and now they’re happy, talking, and crawling around. colleen, i’m so proud of you. you’ve been the best mom ever for the twins, staying by their side in the nicu and fighting to get them out. i’m so proud of how far you’ve come, and i know this is just the beginning of a long journey. cheers to one year!! ", "Jo Jo coming in clutch with the Vlog memories!  Happy Birthday Maisy and Wes! And great job Colleen and Erik on the party!", "This looks so overwhelming, the twins looked so overwhelmed, can't imagine doing this huge sensory overload for my 1 year old", "I love that during the making of a duck you can 100% see their different personalities! <3 Happy Birthday Wesley & Maisy!!", "Seeing a little bit of what you went through with the NICU and the twins progress and growth brought so much joy to my heart.", "Colleen opening presents with her son & nephews is so adorable  The way they all love each other is so wholesome 🥹", "A year already? That's unbelievable! \nHappy birthday to those adorable babies and a huge props to Colleen for being so strong. Amazing birthday btw, so so cute. :D", "Awww they’re so big already! Also it’s so awesome seeing Trisha as a Mommy ", "Maisy’s smile when they were singing happy birthday lol. She was loving the attention! So cute. Happy birthday Maisy and Wes!!", "Every time that I see an exciting moment in your life I get so excited and the babies are just so cute!", "Happy Birthday, Maisy and Wesley!  What a great party!", "These babies are the light of the world!! They’re getting so big and you can tell they’re great people with amazing personalities already. ", "I literally cannot believe they are already one. How has it been a year. They have grown so much, and are the sweetest babies ever. Love you so much Colleen", "How adorable was the looks on their faces when everyone starting singing Happy Birthday. Maisy smiled right away but then looked at Wesley's slightly scared face you can tell she wasn't sure if she should be worried or smiling. Such an adorable moment to capture!", "so excited for theirs first birthday! So emotional, i have watch all the videos since they were born, the difficulties and all, so im so happy is been 1 year. Congratulations Colleen, you have been an amazing mom <3 \nSaludos desde Chile", "Love seeing everyone together! Nice seeing Trisha there with her little Malibu. I find these videos remind you that people have normal lives aside from filming youtube videos! Love all these people ", "Regardless of any noise around it i think it’s really cool that Colleen & Trisha remain friends.. now they’re both moms! We love to see it.", "This is such a cute & fun party theme. Perfect for their age and family to enjoy", "Aww the twins are so cute! I can't believe they are already a year old", "Happy Birthday Maisy and Wesley! Hard to believe it's been a year. Luke saying hello to the camera was the cutest thing ever! ", "Such a sweet birthday for the twins  wishing them such a wonderful day!", "This had been a hard year for Colleen. I can’t believe the twins are already one year old! I’ve been here since Flynn was born and seeing them come such a long way has been amazing", "Colleen, you did such a great job with the babies Birthday party! They are darlings and Flynn is just the sweetest!    \nAlso, It is so awesome to see you and Trisha are still friends. \nSending you all much love and hugs from Ontario Canada  🇨🇦 ", "Happy Birthday to the twins They have come a long way such warriors just like their mommy  So happy for you and your family Colleen ", "Happy birthday to the twins I can’t believe how much they’ve grown in a year and it was fun watching you open the presents I loved how excited you got for each one", "Just wanted to say I am so blessed for you & Erik and your podcast. I lost my grandpa unexpectedly last night to a heart attack and I could not sleep. I turned on the podcast and closed my eyes and was finally able to sleep for 2-3 hours before nannying today. Love you both so much.", "This is the cutest birthday party ever! You did an INCREDIBLE job, Colleen and Erik! Happy birthday, babies  You are SO loved and adored by your wonderful family <3", "I cant believe they are one already.  Im in tears. They have come a long way. Love you guys! Happy Birthday Maisy and Wesley!!!", "Colleen, if you ever see this, I loved seeing you and Trent interact! Would we be able to see more of Trent? I don’t know how comfortable he is in front of the camera but I love seeing you sign!", "They are honestly the parents/family I've always wanted. Living vicariously through the kiddos.", "I can’t believe they’re already 1!!! I love how you read the card before opening the gift - so sweet. & thanks Jojo for the little filming session ", "I can remember waiting for the birth video to come out and when I saw it had been posted I got so fricken excited you have no idea  happy birthday Maisy and Wealsy!  And I know your birthday is the 21st and so is mine!!! So happy early birthday to you Colleen!", "I remember when they were born. I was soooo excited to watch them grow up and I can not believe that they are 1 years old!! They have came a long way!! I’m soooo proud of Wesley and Maisy for being strong babies!! Love you Colleen!", "I'm 100% saving the \"you've got this Dallas\" clip for whenever I need a Colleen pick me up  I was NOT expecting to hear that!", "This journey with your twins has been amazing! Been here for every vlog, smiles and tears. I know this 1st Birthday is a culmination of what this year has represented, and is such a huge deal to your Momma (and Dadda) heart. Also, loved the present opening, because I would have been the friend sitting with you on your living room floor, listening to all the stories and oooing and awing over every outfit and toy! And I still got to do that. Thank you so much, for allowing us all to do that with you. Sending so much love to you and your fam. Love you little Maisy and Wesley. And can’t wait to see the next and the next. ", "So happy to see Trish, her hubbs, and Malibu!!! ", "A raw uncut video of present opening?! I love that ! Lol I love presents/ babies and everything so I thought it was so fun. Good to see everyone had fun.", "I loved seeing Trisha and her family there. That was such a sweet moment 🥹 seeing the babies meet was adorable", "I like watching people open gifts… not in person  I’m sure it’s easier without everyone around as well and you get to look at everything without rushing.", "Happy 1st to the twins. Hope the party was fantastic!", "I like how she clearly hired a party planner even though last week she was tagging on moms who hire party planners rather than make cardboard decorations themselves. Little Artist Party and Picnic Collective did such a good job though.", "I still can’t believe that Maisy and Wesley are already over a year old! Time goes by so quickly. What a wonderful way to showcase things that Wesley and Maisy love for their first Birthday party!  And kudos to Jojo for filming so Colleen could enjoy spending time with her kids on their birthday!  And I loved watching you open gifts for Wesley and Maisy. It was so sweet that some people brought Flynn a gift as well.", "Jo Jo coming in clutch with the Vlog memories! ️ Happy Birthday Maisy and Wes! And great job Colleen and Erik on the party!", "Happiest of birthdays (bated) little twins! Love just sitting around and “hanging out” with you Colleen! You are amazing! ", "Happy birthday baby Wesley and Maisy! ", "Trish being there is everything! An unexpected friendship!", "I loved the opening gifts portion made me feel like I was part of the family ️", "Loved the party and presents. Happy Birthday for them. 🇧🇷🇧🇷", "I love how you can really see the differences in the twins that Colleen always talks about when she’s stuffing the ducks for them. Maisy is like “respectfully no, but thank u” and Wesley is just ALL IN with his hands. ", "What a fun party!!  I’m glad you had such a good time with family and friends!", "CANNOT believe they are 1 years old! So proud as Colleen and Erik as parents you've grown so much!", "My top love language is gift giving so watching you unwrap all these gifts for the twins genuinely felt like Christmas morning I lovedddddd it", "Takahashi leaves behind an amazing legacy. He created so many of the powerful cards we had as kids, but showed how powerful his dedication to helping others was, even though it cost him his life. RIP Takahashi; you could've sat on the sidelines and lived life easily, but you chose to risk your own to help 3 others live theirs. Cheers mate =3:)", "I can’t believe the twins are one!! I’ve loved being there throughout your whole journey and getting to watch your beautiful family grow! You’re a beautiful human inside and out  \n\nThank you for being vunerable with your thoughts and feelings, it’s helped me realise it’s okay to speak or cry when you’re not okay ", "I know this is a video about the twins but after all these years I still can’t get over how adorable Flynn is  what a beautiful family ️️️", "I LOVE watching present opening :D Happy Birthday Maisy and Wesley!!", "Happy Birthday to your 2 precious twins!!! Love you all!", "OK, watched until the end....what an incredible hall for you adorable baby's. ️️️. Happy first Birthday ", "i love how at the start she says it might just be her mom and korys mom and then we get that shot of at least 30 people in her living room after they sing happy birthday ", "Colleen opening presents with her son & nephews is so adorable The way they all love each other is so wholesome 🥹", "What a fun, amazing party! I am in tears and smiling ear to ear! So many friends and family, so much fun!\nHappy birthday to Maisy and Wesley!", "so glad everyone had a great time at the party! i loved seeing all the gifts :)", "Loved this! Truly felt like i attended the after party lol \nThanks for sharing", "Happy Birthday to Maisey and Wesley they are so sweet and precious.", "it’s so good to see trisha! she seems like she’s genuinely trying to improve as a person and it’s so nice to see that she has good friends", "I haven't seen your channel in a while and your children are stunning.  They are too cute and SO big!!  Praise the Lord they made it through all they did!", "Happy Birthday Maisie and Wesley!!\nSuch a beautiful Birthday party and wonderful gifts too.Flynn is next,I knownits hard when it's right next to Christmas ,my son's Birthday was December 22nd..But LOVED this video,all the through Colleen..So much Love and Blessings to y'all", "Happy Birthday to the babies again! Lol The party turned out so cute ️ it was awesome to see Tricia there and really sweet of Jojo to video for you. As soon as I saw the musical 4-in-1 toy, I immediately thought it had to be from Jojo! I love watching people open presents, it always gives me new ideas for gifts to give in the future. So, I watched till the end."]}