{
    "video_id": "6D_2xU0oZ1w",
    "comments": [
        "This isn’t just a celebration of them being a year old. It’s also a commemoration of the amazing and difficult thing that Colleen (and family) did last year when the babies entered the world. Happy anniversary to you Colleen not only for surviving the hardest season of your life, but instantly becoming an Amazing mom to 3 overnight and modeling authentic motherhood for us ever since. ",
        "You keep saying, they will love this for everything",
        "You're in LA... its not cold silly  I'm a wisco lady, I know cold. Happy birthday to the babies!!! They're so adorable!",
        "Really so very cool. Happy Birthday!  ",
        "This looked so special 🫶",
        "Seeing Trisha, Moses, and Malibu there made me SO HAPPY!!!! Love that you continue to support her and that she has you as a friend!!! Y’all are amazing mommas🥹🥹 such a cute birthday party! Thanks for sharing️",
        "Bailey looks so much like Gwen, when she was younger.",
        "I loved watching the gifts being opened!",
        "They're already 1 wow it's gone so quick it feels like yesterday I was watching the pregnancy announcement and the birth and also the babies are so adorable ",
        "I used to think the babies just look like erick.but seeing them near Chris and Jessica's kids I totally see the Ballenger especially in maisey.",
        "I literally loved every second of watching you unwrap presents haha",
        "Flynn is such a silly little dude. I couldn’t stop laughing whenever he got the tape stuck on his foot and was trying to get it off. He’s got such a funny personality. He reminds me of Miranda sometimes. I’ve loved watching him grow up. I can’t wait for Maisy & Wesley to get to that age but I cannot believe that they are a year old now.",
        "Did Ariana Grande meet the Twins or not yet ?",
        "Yay Trisha, Moses and Malibu showed up! Got so excited to see them there. This was an AMAZING 1st bday for the twins. I’m in love ",
        "Happy birthday lady bug and little worm!!!! You babies are so loved by everyone!!!!🥹 love you Jocelyn",
        "I love how all your family and friends show up to support you and your family.  The party looked amazing. The twins looked adorable as did Flynn.   ",
        "So cute!! Love the theme too, that was actually my baby shower theme 2 years ago for my baby boy!  happy birthday to the cutest twins!! ",
        "Love watching gift opening!!!",
        "I have been here for a while I used to watch a lot of the main channel vids and then near the start of the pandemic I watched the vlogs like everyday, seeing your family grow and the milestones your kids have gone through is amazing. sadly my school has been very crazy so I am behind on the vlogs but I am excited to start watching them again over break.",
        "Wow the twins look like a copy paste of Finn.",
        "There were SO many kids there OMG!! You guys are amazing for throwing such a great party with so many kids. That was so cool to see! ",
        "Colleen don’t forget to put a dab of hotglue on the air hole on the tub toys. You don’t want them getting yucky moldy. And Jojo was awesome for filming for you so you could enjoy the babies, the party and guest on the special day. She’s a great friend. And sweet for giving you the opportunity to enjoy the day.",
        "Omg, so fun to see Trisha there!",
        "flinn: can we open this one next colleen: the big one? flinn: ya! colleen: you got it dude me: my first thought full house michel",
        "I love how you use miles as a measurement of time, thanks for making me laugh today!",
        "Is that the babysitter standing next to Kory?",
        "Loved this long video",
        "Aww soo sweet, I found myself just smiling this whole video lol I have 3 kids my youngest just turned 9.",
        "       God demonstrated His love to us by sending His Son Jesus Christ, who died and rose from the dead to Give us eternal life. He also promised to heal your body. If you confess with your mouth the Lord Jesus and believe in your heart that God has raised Him from the dead He'll give you eternal life",
        "HAPPY BDAY BABIES!!!!",
        "Maisy with her cupcake was like gag this ain't chocolate!! Lol",
        "They're so cute",
        "Colleen “idk how many ppl will come?..” \nthen proceeded to show and huge loving family  we all knew everyone would come for them and you! Don’t doubt yourself ",
        "Happy Birthday Maisie and Wesley!!\nSuch a beautiful Birthday party and wonderful gifts too.Flynn is next,I knownits hard when it's right next to Christmas ,my son's Birthday was December 22nd..But LOVED this video,all the through Colleen..So much Love and Blessings to y'all",
        "Crazy how fast that year went, such precious kiddos, and I very much enjoyed watching you open their presents, always curious to see what kids get as presents, also shout out to JO JO for filming",
        "Dang it’s already been so long!",
        "Happy birthday maisy and wesley",
        "Aww they grow so fast   I just had a baby yesterday & she's already 3 months lol. They are adorable & such a unique party theme!",
        "Happy 1st Birthday Maisy and Wesley!!!",
        "Trisha is the best gifter the water duck pond is brilliant",
        "Colleen: \"Trish, Moses, and Malibu are spoiling my babies!\"\nMe: \"Honey, we knew that when Trish gave Flynn Gucci at 2 weeks old.\"",
        "Holy cow he had quite the party that was a lot of people.",
        "Love your videos so much",
        "The fruit abacus is so cute, the fruitacus is so cuteacus!!",
        "Happy Birthday to the twins They have come a long way such warriors just like their mommy  So happy for you and your family Colleen ",
        "i CANNOT with the thumbnail omg",
        "The decorations are sooooo cute!!!!! You did great! (Also, they have no idea how lucky they are lol if my daughters had a birthday party with Miranda sings and jojo Siwa they would lose their minds)",
        "OMG THE PUPPY JOJO BROUGHT LOOKS EXACTLY LIKE MY PUPPY WHEN HE WAS A BABY!!!!",
        "happy birthday to my favourite little babies, im so honoured to have been able to watch u grow every day over the past year, cant wait for all the years ahead. lots of love to u guys <3",
        "The party turned out amazing!! Love all the decor and the thought put into it ️️",
        "Who are the other kids in the video at 7:08??",
        "Happy 1st birthday to Maisy and Wesley! The party looked super fun! :)",
        "I can’t get over how cute Luke is ",
        "I didn't even notice your sleeves till you pointed them out.  lol   Happy Birthday to your babies.",
        "i wanna know if that uncarded present was from jojo ahahhh",
        "Does anyone feel like the walker is from JoJo",
        "I been watching since you found out you were pregnant with the twins.",
        "You’re the sweetest most generous human oh my goodness. You’re so easy to love, Colleen!",
        "A year already? That's unbelievable! \nHappy birthday to those adorable babies and a huge props to Colleen for being so strong. Amazing birthday btw, so so cute. :D",
        "Wow, last party at the house. Such a great party.",
        "Very irresponsible of parents bringing newborns to this event with RSV epidemic.  Guess they are naive enough to believe their infant is untouchable.   Sad",
        "YAY I loved seeing Trisha there! ",
        "Colleen opening presents with her son & nephews is so adorable The way they all love each other is so wholesome 🥹",
        "I think Maisy and Bailey look so much a like.",
        "Couldn't help about the psychic said that massy would be reserved and observed and wes would be like let me in there and go wild. I'm convinced she's right after seeing them with the stuffing for the duck  ",
        "I can’t believe they’re already 1!!! I love how you read the card before opening the gift - so sweet. & thanks Jojo for the little filming session ",
        "Happy birthday cuties can't believe you're one already ",
        "Trisha… that’s was everything…and so on top of the gift game!!! \nJoJo is the sweetest as well!! I admire her business savvy! \n\n Love the YouTube family!!!",
        "Happy 1st Birthday to Maisy & Wesley!",
        "We make the box joke to for Christmas and Birthdays",
        "One of the things I've seen twin parents do on birthdays, which is so cool, is sing happy birthday twice. So they each have their individual time to be the spotlight.",
        "I love the twins and Flynn happy birthday  never stop being you",
        "TRISHA?",
        "I loved when Maisy smiled the whole Happy Birthday song! Aw <3",
        "MALIBU BARBIE!!! ",
        "Beautiful party wasted on babies who won't remember it lmfao you didn't have to go all out but you do you. I fell like this was more for the adults, strangely.",
        "Happy Birthday to your cutie patooties!",
        "Happy birthday Wesley and Maisy",
        "Wonderful party Colleen! You really went above and beyond! This is great inspiration for any future kids I decide to have. Also, loved the end where you were opening gifts and didn't know who that gift was for! Hope you found out who it was.",
        "Happy 1yrs  birthday babies I love the opening of the babies gifts ",
        "I cant believe they are one already.  Im in tears. They have come a long way. Love you guys! Happy Birthday Maisy and Wesley!!!",
        "Can't believe the twins are already 1! ",
        "I love that most people got each twin separate presents! As a twin myself I remember how frustrating it was to have to share every present with my twin sister.  but they forget we are two different people.",
        "Amazing party!!! I cannot believe the babies are 1 now. Wish you and your family the best. I was however surprised to see Trisha there. I try to not be influenced by what the media says, but Trisha seems unwell or has something that she needs help with. Your family is so honest, caring, supportive, inspiring, and encouraging to everyone! That is why I love watching all of your channels.",
        "Oh my goodness, I had to replay the flashback to Flynn's cake cutting because I was SURE that it was Wes!!!",
        "Well here is my 2 cents.  Wesley looks like daddy and Macy has mannerisms mama",
        "wow. it just hit me that the twins are A YEAR OLD!! i can’t believe it. it feels like just yesterday they were tiny babies in the nicu, and now they’re happy, talking, and crawling around. colleen, i’m so proud of you. you’ve been the best mom ever for the twins, staying by their side in the nicu and fighting to get them out. i’m so proud of how far you’ve come, and i know this is just the beginning of a long journey. cheers to one year!!",
        "No its  ot it feels like yesterday they were just born ahhhhhhhhh",
        "Eriks friends getting play doh for the one year olds ",
        "Happy Birthday",
        "It’s so sweet everyone brought them each their own gifts to open and you getting adjusted to that concept in real time is actually really heartwarming ",
        "OMG this was the cutest!!! And Jojo filling for Colleen and Erik for them and their babies to have this to treasure forever <3 I don't know you personally but  I'm head over hills for your babies, becoming a mom is my ultimate life dream so I kinda live through you in the meantime. Your loved ones giving them individual presents is the most amazing thing ever, so thoughtful. Again, happy first beat Maisy and Wesley!!!",
        "I took one look and knew it was form jojo",
        "Joey didn’t come",
        "I’m so happy the babies and flynny met Malibu!!!!!!",
        "Love JoJo's energy while filming hope ye had a great day",
        "Happy birthday cuties",
        "More money by Staring children in these videos.  Probably makes 5 million a year on these videos. Awesome wife awesome money.",
        "Colleen i just want to say how proud i am of you for making it through this year happy birthday sweet peas ️️️",
        "Lol I love how raw this video is I think everyone who got these gifts should watch this video it’s so sweet🥹🥹",
        "My daughter’s first birthday was a duckie birthday as well!",
        "Jojo siwa is so kind",
        "okay who were all those kids?",
        "Wow Gwen and Bailey look so similar!",
        "Colleen’s journey from the twins’ pregnancy to their 1st birthday just solidifies that women are truly incredible",
        "I feel like they were born like a month ago ️",
        "Outstanding B day and great gifts and you out did this meaning you knocked it out of the park! Watching you open the gifts was pretty awesome!️️️️️️",
        "Happy   birthday to the most   beautiful twins in the world   !",
        "Yay the birthday party I was waiting for this video how exciting I love the theme of the birthday party so cute and the twins how adorable and I love that Jojo xomgpop and your family came to the party and I love watching people opening presents it’s so  fun",
        "Happy FIRST BIRTHDAY, CUTEY SWEETIES; Wesley and Maisy! XOXO",
        "TRISHA PAYTAS AND MALIBU WAS AT THEIR PARTY OMG LITTLE ICONS!!!",
        "Jojo such a good idea asking everyone’s favorite memory with the twins ",
        "Saw some of the party on your sister's channel and couldn't wait til you posted to see more!",
        "You and Parker immediately locking eyes and saying “a box!” Is hilarious to me ",
        "Happy Birthday Wesley and Maisy!",
        "Omg Trish in the back ",
        "Who is Corey?",
        "Happy birthday Wesley and mazy ",
        "flynn is cracking me upppp! why was he so surprised by that duck lol 13:11",
        "  Because of  love. God sent His Son Jesus Christ to die in our place. Three days later. Rose him  from the dead.   Now. By Jesus Christ alone. God has granted us the free gift of eternal life. He will save and heal you.  If you confess with your mouth the Lord Jesus and believe in your heart that God has raised Him from the dead He'll give you eternal life",
        "no",
        "Started following you when the twins were born. You are an amazing young woman (mother, wife, friend, daughter...etc) and I am sure there are many who benefit from your straightforward news about your experiences and emotional ups and downs. (We didn't talk about those things when I was your age.)\nAnyway, hard to believe it's been a year! Happy birthday Wesley and Maisey.",
        "Trisha always kills it with gifts",
        "This video made me emotional like I know you’re family like my own. I know how hard pregnancy and the twins being in the nicu was through your videos and how open you are with your mental health, but seeing your smiles while singing them happy birthday just made me think how it’s those moments that make all the struggles worth it right? That’s what life is all about. The struggles to get to the big and good moments. Idk I’m rambling. Happy birthday to the twins and happy having baby day to you. Love you guys 🫶",
        "I love the baby present haul! I’m a mom, but also from a big family with lots of littles. Taking notes! Happy birthday, babies!! ",
        "happy birthday babies!!! i can’t believe it’s been a year already. they’re so big and happy and i’m so proud of you colleen!",
        "Colleen this was the sweetest and cutest video!! Happy Birthday to the beautiful babies!! Your 3 littles all make me smile. Your party was so adorable- you are the best party planner!!  Those ducks to stuff- how freakin cute were they! Loved the opening of the presents!! Perfect video to look back on for always. Can't wait to the upcoming events..and sooo looking forward to your Christmas videos!! Love you and all your lovely family ( and Kory!). Thank you for sharing your life with us!! ",
        "I wasnt expecting Trish in that, thats for sure",
        "Maybe ",
        "One thing I learned growing up with many sets of twins in my family is (eventually) the humans appreciated being sang happy birthday for each individual human. They are two people who have to share so much (even if they love it) having seperate birthday songs was always something they were happy to have.\nJust a thought ",
        "Tell Maisie and Wesley I wish they have a happy birthday and I Love seeing them on YouTube they are the cutest",
        "The little signing she does to Trent as an ASL student rn in college was so cute and cool to see ",
        "Maisy's smile melts me every time",
        "Wesley is just ALL IN with his hands.",
        "Oh my god I saw Trisha and got so excited  I love her too",
        "#10 on trending",
        "“it’s not just a card” 🥹\n\nThank You. I love that you get it. ",
        "Happy Birthday to the twins you both are so sweet and adorable . love your videos",
        "i alr failed",
        "Seeing Trisha there with her baby and Colleen’s babies ",
        "You are so blessed!",
        "Jo Jo coming in clutch with the Vlog memories! ️ Happy Birthday Maisy and Wes! And great job Colleen and Erik on the party!",
        "I teared up watching this just thinking about how far the twins, Colleen, Erik, and Flynn have come. Happy Birthday, Maisy & Wesley! I’m so proud of you all. I love you guys! Also I’m so happy to see Trisha in your vlog and to see the babies meet!!! ",
        "Seening Colleens kids grow up is so magical. I can't explain how happy I get when I see her kids happy.",
        "Trisha with probably thee perfect gift(s) for this party theme ️️️️️",
        "I love videos like this it’s so fun to see everything gives me ideas for toys and stuff",
        "I watched this one live as it was happening. It was so intense. I thought i watched a mans last hour of life when they shot into the truck. I was sure he was dead and had already moved on to the next life by the time they pulled him out like 20 mins later.",
        "I can't believe there already a year old!! Doesn't seem real, seems like you just brought them home yesterday!!!! Omg all the birthday decorations was Amazing!!!!! Happy Birthday Wesley & Maisy",
        "stopp when everyone was singing happy birthday and the twins looked concerned, maisy looking at her twin brother for reassurance like “uhh do you know what’s going on?” melted my heart they’re too cute ",
        "You are so amazing! You could be an event planner!",
        "My goddess that Luke 'hi!' at the end was too cute",
        "It's kind of funny hearing Colleen say she's not sure if anybody will show up. You are Colleen. Of course people are showing up. It's a birthday party that you are throwing. People will show up haha",
        "I loved watching the present openings. It made me feel like I was at a birthday party with my family ️",
        "Honestly if my sister in law vloged her day with my niece and nephew I'd watch them all the time",
        "so happy Maisy got her birthday party, when is wesley's?",
        "The duck card with the pop up ducky inside looks to be handmade :)",
        "i’m glad trisha has some mum friends",
        "Happy, Happy Birthday Wesley and Maisy!   After seeing how you remove the tags from the kids clothes, please turn them inside out and double check for the second half of the plastic that they insert under the arm.  Many time when I thought I had all of it after washing my kids would complain they were being stuck.  Low and behold there it was that nasty plastic from the tag poking them!",
        "Happy First Birthday to Maisy & Wesley!! What a beautiful birthday party",
        "Oh that year went fast...",
        "I can’t believe the twins are one!! I’ve loved being there throughout your whole journey and getting to watch your beautiful family grow! You’re a beautiful human inside and out  \n\nThank you for being vunerable with your thoughts and feelings, it’s helped me realise it’s okay to speak or cry when you’re not okay ",
        "Yay!! Can’t believe that they are 1 year old happy birthday!!!",
        "The way my jaw DROPPED when I saw Trisha",
        "a thousand miles long ",
        "25:10 Flynn: 'Mommy I just went pee!!' Colleen: 'Good for you!!' 'look at this card!'",
        "Does anyone know what camera Colleen is using to film? The quality is beautiful.",
        "I have to add Happy Birthday Wesley and Maisy !!! I’ve watched for years and could not imagine not adding birthday wishes for the cutest babies on the planet! Cannot wait to watch you both continue to grow ! You have the best family so kind so generous and talented !",
        "trish’s giftstoo cute",
        "What a cool party Colleen! I'm getting some ideas =^^=",
        "I dont think there is a cute video anywhere on the internet right now than this one. So many cute moments. Loved the theme of the party. Jo jo going around asking everyone about their first memories of the babies was so sweet and seeing them looking cute while everyone sings happy birthday to them was just so sweet. Flynn looks so proud to be big brother to the twins.  Now back to the video. Xxx",
        "\"big announcements coming soon about some insane things\" WHAT",
        "Happy birthday wessley  and maze they got loads of cool gifts and love that Flynn got gifts to I love ur videos  ",
        "Absolute mum goals! I can’t wait until I have my own kids so I can throw crazy parties like this ",
        " Happy 1st. Birthday, Wes  & Maisy!",
        "Happy belated birthday I know the party was a success.",
        "Hearing Colleen sneeze without Kory's music editing just feels weird LOL That's how you know you're from the vlog channel.",
        "HAPPY BIRTHDAY TWINS️️️️️️️️️️️️️",
        "Awe:) Such Adorable Birthday PartyHappy Birthday Wesley and Maisy So Cute That Coco's Mom Bought Flynn a Present too",
        "i love how at the start she says it might just be her mom and korys mom and then we get that shot of at least 30 people in her living room after they sing happy birthday ",
        "I love the baby meet bit with Trisha and Malibu that was so cute ",
        "",
        "This is why good cam operators are paid very well, it's a challenge catching live events in focus as they move. A true professional right there. :-D",
        "I usually don't like unboxing videos but whenever Colleen opens presents or her amazon packages I am glued to the screen ",
        "Colleen maisy pooped in the bath\nMe no way \nSide note I said that out loud I can’t believe they’re already a year old",
        "happy birthday maisey + wesley!\n\nps~ it was so adorable when lukey tried to steal the show a couple of times! he is the cutest lil ham! 🫶",
        "When I have my b-day every one gets a gift and I get upset bc it’s my day so don’t become like that lol love you",
        "I bet when Colleen tries out the dinner plate. Wesley is probably going to Peel it off and then throw it across the room.",
        "Happy Belated Birthday Maisey Jo and Wesley Koi! ️️ We all Love and Adore You! Many, Many Blessings for so a long healthy long and beautiful life! ️",
        "Trisha and Malibu's cameo wasn't expected  so sweet",
        "I love seeing trish, moses, and Malibu out with other people I feel like so many people abandoned trish and it’s wonderful seeing her have another mom friend, especially someone as kind as Colleen️️",
        "happy birth day",
        "Wesley: nice guys finish last should have known that",
        "I wanted to see you hold Malibu, like when Trisha held Flynn for the first time. That wouldve been so cute",
        "Water tables are the best",
        "I agree the walkers gotta be from auntie jojo",
        "So happy Wesley and Maisy had a lot of their friends and family there for them! And Colleen, as always, thank you so much for everything you do, and a huge shout out to Kory and Erik for their help, and an extra thank you to Jojo for all her help filming! ",
        "It warmed my heart to see Trisha there. 🥹",
        "trisha ??? at colleen’s house ??!!! what???",
        "Love Love Love",
        "Can you do an update on the babies can you show us their faces next time cuz I wanted to see the babies cuz I don't know where their faces look like I love you so much I will look back on you whenever I have a chance I love your videos they're so fun and interesting because they're so funny",
        "Happy birthday to the twins",
        "omg i was not expecting trisha to be there haha but she's so iconic",
        "Colleen opening presents with her son & nephews is so adorable  The way they all love each other is so wholesome 🥹",
        "What a fun party!!  I’m glad you had such a good time with family and friends!",
        "Happy birthday to the twins I can’t believe how much they’ve grown in a year and it was fun watching you open the presents I loved how excited you got for each one",
        "i have that shirt that jojo is wearing! twinning.",
        "Omg seeing Trisha and Colleen with their babies is so cute and so pure. I bet they both talk about how they both can’t believe that they’re moms now ️",
        "Happy Birthday Wesley and Maisy Jo!!",
        "My son's 1st birthday is on Nov. 23. I'm having a hard time with the fact that he is almost 1. But it's also so exciting. I really think our babies would have a blast together. \nDo you ever think about the future and who your kiddos will be once they are older? I think about it a lot.",
        "can i be invited next year?",
        "OMG TRISH WAS THERE???",
        "Happy Birthday. Their are getting so big. This party was just cute and perfect for these little kiddos",
        "Omg the twins are growing so fast ",
        "Happy birthday beautiful little Maisey and Happy birthday sweet little Wes! He is such a cute chunk lol precious! Maisey is all personality I love it such a cutie pie.",
        "A moment of silence for this beautiful decor! Everything is soooo cute!!!",
        "Still too young for play doh",
        "Not Colleen having XOMG pop at her babies bday party ",
        "COLLEEN!! oh my gosh i’m losing it! i was also born november 6th and my first birthday party was rubber duck themed aswell! this is so insane for me as i’ve grown up with you and now seeing your children have so much in common with me ! much love to you ",
        "They are one and i am too old...! HAPPY BIRTHDAY!",
        "I can’t believe they are both 1! I remember watching their birth like it was yesterday on YouTube. Time really flies by.",
        "THATS A LOT OF MONEY...YOUR KIDS ARE NOT THAT CUTE  ....",
        "Happy 1st birthday to Wesley and Maisey! I love seeing how much they've grown. They are adorable! And Flynn just blows me away. I get such a kick out of him! (I sound like a hundred years old!) P.S. I love watching the opening of presents too! Lol ",
        "My first guess was that one being from jojo because of the bag just gave me jojo vibes lol",
        "omg moses trisha and malibu 🥹🥹🥹",
        "Every time that I see an exciting moment in your life I get so excited and the babies are just so cute!",
        "CANNOT believe they are 1 years old! So proud as Colleen and Erik as parents you've grown so much!",
        "I was just typing how cool it is for them that they can always tell how Jojo Siwa was at their birthday.....and then i saw Trisha  i got tears. Im just so happy for you and Erik after this hard year. I knew you would pull through. Never give up, just learn how to rest  i love you all so much",
        "It's really cold  I'm from ND so it's funny to hear that. Happy birthday to the twins!",
        "OMG around 9:30 i think I had the same exact dress when i was that little. It’s looks so familiar and it was one of my favorite dresses to wear. It’s so stinkin cute ",
        "i love unboxing of presents thank you",
        "I love that when Maisey was getting unsure she looked over to Erik and he smiled at her reassuring her and then she smiled again!",
        "I know it's probably just me not paying attention but where has Tim been? I've seen Gwen in a bunch of videos but haven't seen Tim in a while.",
        "tell them I said Happy birthday <3",
        "i loved every second of this! happy birthday to maisey & wes!!",
        "HAPPY 1st BIRTHDAY to your little cuties!!! I have loved watching them go through their first year of life and am so excited to see all the years ahead! They are both so adorable and have such an amazing mama raising them(as well as Eric, Flynn and the rest of the family)! \nI’m so glad you included the present opening in your video cause it’s so much fun to watch!",
        "Omg the twins are born  wow I’ve been away for a while ",
        "Where did you get the stuff ducks from that were on the table with the shirts? My baby is obsessed with ducks and I think she would love to get one for Christmas",
        "I am so confused by the sizes of kids clothes! so many things i was predicting for flynn that was for wes, and the other way around.",
        "STOP it my cousin‘s birthday is December 10. I knew that Flynn’s birthday was in December. I just didn’t know what day it was.",
        "Family: singing happy birthday \nTwins: ",
        "Can we take a moment to appreciate how much time and work he puts into these videos for us ",
        "I refuse to believe it’s been a year already",
        "seeing Trisha there made me happy",
        "I didn’t even notice the sleeves until you mentioned it",
        "I also love seeing Trisha there and I am so happy Trisha gets to be a mother.",
        "OK, watched until the end....what an incredible hall for you adorable baby's. ️️️. Happy first Birthday ",
        "Happy Birthday Maisey and Wesley one day you will read this when your older, I just want you to know I have enjoyed watching you enter this world I know it was hard but you made it I have enjoyed watching your journey thank you for letting me be apart of your lifes I will always watch you on the amazing videos you are apart of,  I cant wait until your next Birthday I will always be a part of your lifes just know you have brought so much joy to my days and you toi Flynn I love you all I hope you read this one day, Colleen you are an amazing mommy and God has Blessed you beyond measure i know it's not always easy but sometimes you make it look easy and i know it's not thank you for sharing your life with all of us we love you all so much God Bless You all",
        "my son when he was little had the garbage truck(older version, he is 22) and one night while my Mom was visiting the sounds kept going off all night, she didn't know what the heck it was LOL",
        "They r garbage parents. For one thing she made maisy a party themed for her only and only sang happy birthday to maisy. And Flynn opened their gifts that is horrible. They are the worst. Can’t stand them.",
        "This entire video was so wholesome, I was smiling ear to ear. But seeing Trish, Moses, and Mailbu there sent me to the feels department. What a beautiful environment.\n\nEdit: I just got to the part where they showed Trish/Moses gift and I swear, Trish knows how to give gifts. It was right on point where it shows she was thinking of the kids and not trying to be extravagant but still over the top and perfect.",
        "We have that cat toy! Just be careful babies don’t put their mouths on the bottom “legs”…my daughter got her tongue cut on it when she was 1! She’s still very accident prone at 4, but I digress.",
        "I can believe it’s been a yr",
        "Happy Life ",
        "Happy Birthday Maisy and Weslie! Colleen and Eric you guys are doing an amazing job with the twins and Flynn. I can't believe they are one.",
        "maisy looks SO much like you colleen!!!!! :''''''') and like your niece!",
        "I remember sitting on the floor in my college dorm watching her announce Flynn. I remember sitting on the floor in my apartment in grad school watching her announce the twins. Time just flies!! Love them so much ️",
        "Being around you is like a happy little vacation.",
        "I have no clue why this video made me tear up but it did. I swear I've watched every vlog of these cute little babies and I feel like the are my niece and nephew. (I'm an aunt to 9 kids so that's what I'm use to). I'm always so excited to see what they are up to and I can't believe they are already one",
        "i cant believe the twins are already 1  seeing you and trish together made me so happy omg. to see my two favourite people on the internet together again made me so emotional likeeeeee",
        "Wow a year",
        "HAPPY BDAY TO THE TWINS!!!",
        "seeing colleen sneeze without the intense editing felt weird HAHAH",
        "Imagine the twins being obsessed with summer related stuff then having a birthday party at November nearly winter ",
        "It’s my niece’s first Christmas this year. You gave me a ton of great gift ideas for her!",
        "Happy Birthday Maisy and Wesley! Also great job on the party Colleen!",
        "This was so cute! They’re so lucky to have you two as their parents  my sons first birthday was rubber ducky themed. I’ve never seen anyone else do it. You did amazing!!",
        "DO ANOTHER MUKBANG WITH TRISHA ABOUT HER BIRTHING EXPERIENCE",
        "Trisha's love language is definitely gift-giving ",
        "The party looked like so much fun. Great job ! I still can’t believe they are one",
        "I appreciate so much how you annunciate and look at Trent when speaking to him. I have limited hearing as well! When people take the extra time to talk TO me and not AT me it means the world!",
        "Your such a good mama",
        "Who tf opens their kids' presents not only WITHOUT THEM but also WITH THEIR SIBLING. If they were overwhelmed, maybe you shouldn't have invited 100 people when you claim to be safe with sicknesses and covid, and then they wouldn't have been so overstimulated and exhausted and would've been able to enjoy THEIR presents.",
        "I can’t believe there one now it’s amazing mazy looked so happy when they were singing happy birthday and the other didn’t know what to think",
        "I loved watching you and your family and I loved watching the second part with you unboxing. You are what we are here for.",
        "Stop teasing and tell us what the things are  Also happy 1st birthday babies x",
        "How adorable was the looks on their faces when everyone starting singing Happy Birthday. Maisy smiled right away but then looked at Wesley's slightly scared face you can tell she wasn't sure if she should be worried or smiling. Such an adorable moment to capture!",
        "When i tell u i was shocked when i saw Trisha I didn’t know u knew each other",
        "trisha <3<3<3!!!!",
        "Oh my god  you opened your kids presents WITHOUT them in the room  don’t even bother with the lame excuses girl that’s DISGUSTING! It’s their first birthday, stop trying to steal the limelight as per",
        "This group is the best on YouTube I swear man, the laughs and the energy can't be found like this anywhere else these guys set the standard",
        "Soooo Flynn gets presents for his bday that he shouldn’t even be opening til his bday… yet he gets to open his because “it’s yours!!” ",
        "Bring on the Christmas glitter!",
        "You are just the sweetest and purest, loving family I have ever seen, I've been here since December 2018 so I've watched Flynn and the twins grow up and I can't believe they're already 4 (soon) and 1  you've helped me so much with your vlogs and everything. I love you all, Colleen, Erik, Kory, Flynn, Wesley and Maisy ️ happy birthday twinsies ️",
        "JoJo is such an amazing auntie to all of Colleen’s kids, and Jessica’s kids. I love watching them together 🥹🫶",
        "Can we get a link to those plates your mom got for the babies",
        "JoJo is a real one for filming 🥹",
        "I’m so glad to see Trish there!!! Mummas reunited ",
        "i love knowing that every family in america makes the \"it's a box!\" joke every time they open gifts without fail",
        "How has it been a year already????",
        "Very nice video",
        "I loved the longer unedited video",
        "Yes I love watching present opening",
        "The irony of Colleen saying it is really cold while everyone is there wearing short sleeves, no jumpers and the back door is wide open.",
        "Happy Birthday Wesley & Maisey🫶",
        "That was most excellent! I loved watching you open gifts!!",
        "Happy Birthday to the twins",
        "Awww they’re so big already! Also it’s so awesome seeing Trisha as a Mommy ",
        "I almost cried when I saw Trish! I'm so happy you're still friends!!",
        "Happy birthday sweet babies!",
        "Hello my friend Colleen; Happy 1ST Birthday to your twins, big families are awesome.  Have a fantastic Thanksgiving holiday along with Christmas coming soon; my friend!!  Hugs",
        "Why am I crying?  HAPPY BIRTHDAYYYYY",
        "Watching people opening presents is literally my favorite thing from baby showers to birthdays ive loved it since I was little. My love language is obviously gift giving",
        "you showing the flashback of flynns first bday really made me realize how much he and wes look alike",
        "I loved watching this. Happy birthday twins and happy birthday to colleen and myself we share birthdays",
        "Was anyone else so excited to see Trisha there?",
        "trisha pastas being at this birthday is insane to me",
        "I LOVED watching the gift opening. Thanks for sharing these memories with us Colleen and a very happy birthday to the cuties Wes and Mais <3",
        "Watching you go nuts over that duck card makes me realize you have no idea what a cricut is. And that’s a good thing, because you’d become so obsessed lmao it’s a crafters dream! Those personalized onesies are also easy to make with one as well. You should check them out because you would honestly love it",
        "I don’t blame Wesley, the blue frosting always tastes nasty to me.",
        "Can not believe it's been a year!!! I remember watching your videos think how hard for you not knowing I was going to be delivering my son at 24 weeks still in NICU almost 6 months hoping to be home with him soon. Watching your videos gives me hope he'll be as healthy as your little ducklings xxx",
        "Happy Birthday Maisy & Wesley !! ",
        "Awwwww trishhhhh",
        "Honestly, I actually loved watching you open all those presents because now I have a few ideas to get my six month old for Christmas! ",
        "colleen i just wanted to say how much i love you, and i can’t even believe the twins are 1!!!! the time you put into everything just shows how much you love and care so much about your family, i want to be just like you when i become a momma!! keep being you, we love you!!!",
        "Its been amazing watching your family grow and seeing how the babies personalities come out. Happy birthday Wesley and Maisy!",
        "when everyone was singing happy birthday I got so emotional, Im so glad to be apart of this wonderful community! Happy birthday babies!",
        "Colleen I can’t believe your babies are already one I watched your entire journey with the Nicu and I love that you spread your emotions with your viewers I love that you’re crying in the videos because you’re not afraid to share your emotions and I love you",
        "OMG HAPPY BIRTHDAYYYY ALSO I LOVE RUBBER DUCKS!!!",
        "It's been 12 months Already time has flew by. I was watching ever since the Twins where Born Happy First Birthday Wesley & Maisy!!! Much much luv sent to u all!!",
        "Happy 1st to the twins. Hope the party was fantastic!",
        "I just bought the exact same Christmas reindeer onesie for my niece shout-out Burt’s Bees pjs lol",
        "Did anyone else form a little hope that Maisy and Daisy would become super close, when colleen told us Maisy name?so, happy for you Guy's and the fact that it's been a year and they have many  more to come. Can't wait to see how they grow this year as they start walking and talking more, and how their strong bond with flynn continues to grow.",
        "I was totally into the video until I saw Trisha. The whole vibe is off to me now. And there is still 30 min left of the video…",
        "Omg so much fun!  It was so good to see Trisha there",
        "happy birthday to the cutest twins!! Love you Colleen and best wishes to your beautiful family",
        "I love how thoughtful Trisha’s gifts are",
        "Omg so sweet! Happy happy birthday babies",
        "And a  very happy 1st birthday  to massy and westly (Ik I probably messed up the names I promise I love their names",
        "Love you!!!",
        "NO WAY ARE THEY ONE ALREADY  HAPPY BIRTHDAY BABIES ",
        "I haven't seen your channel in a while and your children are stunning.  They are too cute and SO big!!  Praise the Lord they made it through all they did!",
        "The pastel rainbow giant bag screams jojo siwa too me",
        "You know how to throw a party! Also, I just realized that you share a birthday with my grandma.",
        "I went to disneyland for my bday not too long ago!! so funnn",
        "Who were all those kids? Lol obviously not the ballingers. The other kids",
        "So I know you love keeping sentimental things.  If you keep their birthday cards, punch a hole in an appropriate spot and but it on a metal ring. It helps keeps them organized and all together too! ",
        "oh my god i thought parker was jacob at first he got so big:(",
        "I can’t believe they are one! Happy birthday to your sweet babies!! ",
        "A box!!! ",
        "5:07 I love the pointing so that everyone sings their names right lol",
        "Seeing Trisha and Colleen with their babies together made me so happy",
        "I can’t believe they’re 1!!",
        "Colleen what a fabulous fun party for the twins, lots of family all having a great time and aunty jo jo what could be better!",
        "These babies are the light of the world!! They’re getting so big and you can tell they’re great people with amazing personalities already. ",
        "SEEING TRISHA THERE LITERALLY WARMS MY HEART SO MUCH LIKE <3333 AWWWW she looks so happy with her little mali",
        "3:02 ",
        "Happy birthday little ones   u have no idea how much I love opening presents  in special toys for children ️",
        "Imma need someone to explain why Trisha Paytas is there that’s so strange. Not hating but not what I explained",
        "trisha paytas lmaoooo",
        "Is it odd to anyone else that Colleen is still such good friends with Trisha?",
        "مرحبا لا يستحق ام تعبدي مخلوق ضعيف يموت لم يخلقكي فقط خالقك يستحق ان تعبديه وحده لا شريك له من فضلكي تعرفي علئ الاسلام الحياة قصيرة تنتخي في اي وقت ونعود لربنا ليحاسبنا اني ناصح لكي امين وشكرا",
        "Wow a year God bless them ",
        "First ...What an adorable party!!! and your shirts!!! Oh my goodness!!  I can't believe it's been a year since you started this journey. It started out so scary and so hard for you, but look where you are now!  Happy Birthday Maisie and Wesley!!",
        "Happy birthday ",
        "So cute my  explode",
        "Nice to see Trisha there with baby Malibu.",
        "I love that name Malibu",
        "malibu paytas making an appearance at that party is nothing short of iconic",
        "WHAT TIME FLEW BY SO QUICKLY, THEYRE ALREADY ONE ?!???!!!! HAPPY BIRTHDAY WES AND MAISEY",
        "So excited for this. Had Violet on pre order since June. As a surprise, I also recently ordered Scarlet for myself so I can play with my daughter like we do with Shining Pearl and Brilliant diamond. She has no clue we don't have to share Violet. :)",
        "The whole time Colleen is looking for a card for that musical walker, there's a card on the floor under the chair behind her ",
        "I’m not a twin mom nor a twin myself, but one thing I’ve heard other twins/ multiples do is to sing happy birthday for each person instead of saying both names in one song. Just a thought to give a little individuality during a joint party! Love you and the vlogs! Happy Birthday Maisy! Happy Birthday Wesley!",
        "I have so many questions: is that Trisha?\nWhat is she wearing??\nWhy is she holding her baby like that???",
        "the presents from trisha were so sweet!",
        "wow time flies lol",
        "A MIRAN-DUCK - OMG",
        "They are honestly the parents/family I've always wanted. Living vicariously through the kiddos.",
        "Do a video decorating for Christmas next!! LOL HAPPY BIRTHDAY TO WESLEY AND MAISYYYY!!!!",
        "how are they already one werent they born last weektime flies",
        "is the walker from the ballinger fam",
        "Happy first birthday babies",
        "This was so much fun!!! What a beautiful family ️",
        "There 1 already time flies so quickly ",
        "Oh man I’ve been trying to teach myself learn sign language forever because you should and I love that this happened in this video I love everything about this video but I love that sign language happened I can’t remember the name of the movie I’m gonna search it right now where I’m very famous cast spoke sign language throughout the entire movie and it was amazing I learned so muc. We need to learn it. The Family Stone. Not only a perfect holiday movie but just a perfect movie plus you learn sign language",
        "7:38 is just so ",
        "Can we talk about how Maisy (sp?) looks just like Bailey…",
        "What a surprise this party is all about what Maisy likes there was nothing here that Wesley likes. Also why not let the twins open the gifts you ruined that moment for them ",
        "i swear Flynn was born yesterday and now there is an almost 4 year old and two 1 year olds wth",
        "Happy birthday twins",
        "So cute  ",
        "The Miranda duck tho",
        "Jojo is such a sweet human being I love her. I look up to colleen so much and Jojo is my generation so it just makes me smile.",
        "a little “twin tip” i got for singing happy birthday is cutting out the “dear” part and saying maisys name instead! just makes it flow a bit easier but yall can do whatever!",
        "Hey Colleen and Erik in the twins name song instead of saying \"Some day they'll need people names\" u could say \" and now they have people names to call if they run too far away, Maisy Joanne and Wesley Koy, My gorgeous girl and my sweet little boy\". you could play around w/ the words. love from AUSTRALIA.",
        "I loved the present opening!! (Not only because I need gift ideas for my friend's baby but that definitely helps!) I'm so glad you have such thoughtful friends ",
        "How did I just know the big present was going to be from Trisha, so wholesome though ",
        "Cory, the guy who made a lot of people smile with his way of playing games. :*",
        "Why does Flynn get presents when it’s not his birthday lool",
        "Happy Birthday to Maisy and Wesley!",
        "great video colleen",
        "Awe seeing Trisha and Malibu with Colleen is like so cute. From mukbangs and Trisha asking about birth to having one of her own ️",
        "Omg Malibu was there  cutee",
        "Not Trisha though ",
        "Rainbow gift bag too!! That’s Jojo’s calling card ",
        "They're already a year old, it still feels yesterday when you were straightening your hair in a diaper before being taken for delivery",
        "that was a great party.",
        "ALREADY ?!?",
        "I like your style.",
        "I think the walker gift is from Jojo I’m assuming based off the gift bag LOL",
        "omg please when i die let me come back as one of these twins don't care which!",
        "Small attribution; seeing Trisha holding Mailbu while she meets the other babies for the first time is SO wholesome. \n\n2 super awesome mamas & the most amazing kiddos ever! (Flynn included, of course)",
        "I loved the opening gifts portion made me feel like I was part of the family ️",
        "I cried when Jojo walked around asking what everyone's favorite memories of the twins were 🥹",
        "MedMen stock Moving up! Mike Tyson coming to Las Vegas MedMen in November.  Most Recognized name in the Marijuana Industry. Buy MMNFF stock!",
        "Such a fun party! Happy birthday babies! ",
        "I love that colleen has the same brithday as me it's the coolest thing ever I get gifts an she gets them to lol",
        "I still think Maisy looks like Jojo. If Jojo took her out in public, everyone would totally believe they were mom/daughter.",
        "Did I watch this whole video and enjoy every sec of it. Yes I did indeed",
        "Dose anyone else think it’s so weird that her brother Chris and his family didn’t get the twins anything for there birthday?  #CHEAP there birthday turned out so adorable! She is really is such a good mom/ aunt/ friend!",
        "What's the cat toy at 17:31 called? I need that for a Christmas gift!",
        "Wait why am I crying ",
        "OMG I wondered why I didnt see this in my feed and I've been UNSUBSCRIBED! I hear about this happening all the time to other people but its never happened to me.  Definitely subscribed again now. \n\nIn other news, what a gorgeous little birthday party. I love the duck shirts and all the people there to celebrate the Maisy & Wesley's 1st birthday. Very sweet ",
        "It’s a perfect time to add hot glue or something on the bath toy holes! ",
        "Happy Birthday! I can’t believe it’s already been a year! I remember when they were born! ",
        "I am watching your blog where you are opening up the twins presents and watching the show bones and Erik is on the episode on bones the show that I'm watching at the same time I'm watching your blog I think Erik is a good actor",
        "Miranda Duck!!!  Flynn’s tshirt was so cute and everyone’s happy memories with the twins!  Malibu was born on Sissy’s birthday, she’s such a doll!!! What a beautiful party!!! ️",
        "love the rubber ducky themed party happy birthday to the twins!!",
        "Colleen looks so beautiful ",
        "The twins get gifts and she keeps saying Flynn will love this!!",
        "Why are you letting Flynn open his present a month early?",
        "Not Trisha Paytas casually popping in out of nowhere",
        "WOW a year already!! Happy Birthday sweet babies & Flynn your such an awesome big brother.",
        "mind blown the babies are 1!! happy belated birthday maisy and wesley!!",
        "I suspected it was jojo because of the rainbow bag lol",
        "Happy birthday to your sweet babies I really enjoyed opening gifts for your babies.",
        "All the sweat and tears, getting to this day was a long journey. You and Erik did it, count your rainbows, not your thunderstorms.",
        "The banner with pictures from each month has me SHOOK",
        "Omggg they look nothing like you lmao all Eric",
        "happy birthday to the twins ive been consistently watching you everyday since you got pregnant with them its so crazy to think their two!!!",
        "Happy first Birthday babies I know Mom made is very special, can't wait for you to react to your first birthday video when you guys are older, Love you fam and hope you guys stay safe ",
        "TRISH WAS AT THEIR FIRST BIRTHDAY I WOULD BRAG ABOIT THAT FOR THE REST OF MY LIFE",
        "im really obsessed with 25 minutes of just opening presents that was so fun",
        "I thoroughly enjoyed watching you open the gifts.. I think I'm obsessed with watching gift opening videos now ",
        "Colleen: How does everyone know me and the babies so well?!\n\nAlso Colleen: shares a decent portion of her life on the internet",
        "Trisha",
        "Not winter. Not Christmas. Not really cold. Get a grip on yourself.",
        "I thought it was from JoJo right away because of the rainbow bag.",
        "I fell back in love with Trisha when she had Malibu!!  Happy Birthday to Massey and Wesley!!!!  Looks like an amazing party!!  I love the duck theme too!! You are such an amazing mommy Colleen and Eric an amazing daddy.  Let's give a shout-out to JoJo for filming!!!  She is the sweetest!!",
        "Happy birthday Maisy and Wesley ",
        "Nah Jojo slayed camera duty",
        "I love how they go all out for the babies parties, and everyone is just so thoughtful. You all are so loved.",
        "Such a sweet birthday for the twins  wishing them such a wonderful day!",
        "Happy Birthday Maisy and Wesley! You both have made it so far and are so strong! I've been here since day 1 and I am absolutely fallen in love with you both. Maisy's dances are adorable and her smiles are contagious. Wesley's laughs are humorous and his goofy attitude is just full of pure love. You both are the definition of picture perfect twins. I loved you before you were born, I love you now, and I will love you forever and ever! Colleen, you're an amazing mom. Kind hearted, hard working, and just above and beyond. You are an icon and my idol. I adore you and everything you do and love you so much! But cheers to 1 year, and here's many more to come!! ",
        "god this made me cry. its so heartwarming seeing just how many people came after you said you didn't know who would show up. your family is BEAUTIFUL and i hope that one day i have as wonderful a family too.",
        "“It’s not ‘just’ a card it’s incredible” You’re pretty amazing Colleen ",
        "Colleen said that Flynn‘s birthday is December 10 but I think she means November 10 not to be mean love u",
        "Yeah, I am going to watch a 33 minutes video of Colleen opening packetches",
        "Happy birthday mazey and wesley",
        "Not Trisha at Colleen Balingers kids birthday I had no idea they where friends. They have completely different lifestyles!!",
        "Tell  Jojo I  always watch her  video",
        "The it’s a box is what everyone in my family says!",
        "Happy Birthday Wesley and Maisy, been here since you where pregnant with them. It is so weird now that they are one, I CAnT believe it .  From the nicu to now. So nice to see that they have grown so big. Happy Birthday once again.",
        "OMG TRISHA IS THERE",
        "Hearing everyone sing happy birthday brought me right back to your NICU days with them. How amazing that you all made it though that time and now you are celebrating their first birthday!! SO AMAZING!!",
        "The party looks Amazing and Happy 1st Birthday to the twins :)",
        "What little boy doesn't like trash trucks though Colleen...\nWhy wouldn't you disinfect the toys that were in the bath also. Bleach water is a thing and has been used for decades to disinfect toys. We really need to do better when it comes to just throwing things away and buying new.",
        "Aw happy 1st birthday ",
        "Love the gift haul",
        "I love Flynn's facial expressions hahahhaha",
        "trisha.. love it!",
        "fun!!",
        "Fans are going to start bringing rubber ducks to shows",
        "The box thing my family does at Christmas funny that you do it to",
        "Thanks for the video I cannot believe the twins are 1",
        "Flynn’s face at 13:12  “wut? a deuck?”",
        "You and Eric are such amazing parents, I hope you guys give yourself credit for that. It’s hard out here & you do it with so much love. ",
        "Everything is SO CUTE!!",
        "it’s so good to see trisha! she seems like she’s genuinely trying to improve as a person and it’s so nice to see that she has good friends",
        "A Box!! My Favorite ",
        "I wonder if that amazing music table is from Jojo? I'm 57 and I want one, lol. So cool!",
        "I miss miranda",
        "Colleen would fit right in with Filipinos. We start decorating for Christmas on September. ",
        "Colleen you’re GLOWING!",
        "Happy birthday Wesley and Mazie Jo",
        "Hey Colleen! Are you fluent in ASL since Trent is hard of hearing? You are an amazing mom!",
        "when you pointed to which baby you say first in the happy birthday song it reminded me of how my family always says “seth and elorah and elorah and seth and seth and elorah” like super fast and it makes me laugh every year.",
        "Circle Sandwiches!!!!!! THAT is what i call a party! Happy Birthday Kiddos!",
        "That stuffed duck activity alone cost $600 … good lord I can’t imagine how much she paid for this whole thing",
        "I LOVE JO JO!!",
        "This is such a cute & fun party theme. Perfect for their age and family to enjoy",
        "I watched every second of this video and you opening everything",
        "No one loots old stuff that one guy joined the chat him: its my time to shine",
        "I have to congrats not just those beautiful babies for their birthdays but also Colleen and Erick  you guys are such an amazing parents and I admire you Colleen for the love that you have for your kids, Flynn is such an amazing big brother and your babies are so cute  every tear, good moment, laugh, all is totally worth it ",
        "Omg I’m so happy you invited Trisha!!",
        "Colleen throws the best birthday parties ever I swear she's the best mom in the world.",
        "Ok Bailey looks so much like Gwen omg",
        "Colleen: “How do they know me so well???”\nAlso Colleen: posts vlogs of what she buys for her babies all the time ",
        "When r u getting yr haircut done",
        "omg im so happy to see trish there with u guys <3",
        "I forgot Colleen and Trisha were friends lol",
        "I can just imagine now Maisie walks into your room and says “mom I got my period!”",
        "OMFG I thought that puppy was a stuffed animal!!!! SO CUUUUTEEE!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "Your babies are so cute love the gifts really injoyed it have a great week colleen Wesley and Maisy",
        "This was a great birthday p",
        "I can’t believe they are a year old. They are growing so fast. Also I love how the end was unedited and just laid back. =)",
        "Happy Birthday!two Beautiful  Sweet Baby’s ",
        "HOW ARE THEY 1 ALREADY WHATTT?? I REMEMBER THEM JUST BEING BORN",
        "A big rainbow bag with a musical walker?!?  My vote is it's from JoJo! ",
        "Talk about a first birthday blowout bash ! So incredible after seeing your struggles with them in the NICU to now. So wonderful to see them happy and healthy ️",
        "Love to see Trish and Coleen hanging with the babies."
    ],
    "comments_disabled": false
}