{"video_id": "6p4SeR3pliM", "comments": ["Young Ronaldo assisting old Ronaldo what a beautiful sight", "The fact that the only reason they could stop Ronaldinho was because of their knowledge of the future shows what a magician he was with the ball. Truly a magnificent footballer.", "estes comerciais da @NIKE poderiam virar uma série, não canso de assistir a todos.", "Cómo en los viejos tiempos, gracias Nike por traerme a los cracks del 2006", "Es notable ver a Edgar Davids contemplando los nuevos botines Nike siendo que el era vieja escuela en cuanto a diseños de botines 10 de 10 el comercial nike ", "NIKE + COPA DO MUNDO + COMERCIAL = PERFEIÇÃO", "The old Nike commercials are back\nHope for more like these", "esse é o melhor anúncio da nike traz de volta memórias antigas 1998 e 2002 R9 El Fenomeno, 2005-06 Dinho o mágico, Edgar Davis o pitbull e CR7 a melhor máquina de pontuação.... nostálgico...Boa sorte Brasil 🇧🇷traga o copo", "Hj em dia o Ronaldinho é manjado kkkk\n\nMas é incrível a genialidade dele para criar dribles, até em batida de falta ele revolucionou.", "Me atrevo a decir que es el mejor comercial de toda la historia mundial, no hay comparacion alguna. Gracias Nike por hacernos mantener la llama encendida en el Futbol ", "Shuya Goenji no comercial, a Nike superou todas as minhas expectativas", "Me arrepiei quando o Goenji apareceu isso tá dms nike", "Só por terem lembrado de Super Onze já é o melhor comercial ", "Si van hacer cada 4 años un comercial así, con gusto esperaré el siguiente, tan sagradamente como al mundial de fútbol  espectacular ", "Saudades de propagandas da Nike tão boas assim. O Cgi está muito bom!", "Quando Goenji aparecer, faz a homenagem ficar mais perfeito que já é", "me enamore de este comercial  recordar las leyendas del Fútbol ", "Perfeito, tragam um Oscar para este comercial!", "Nike absolutely smashes every one of these commercials!  10/10", "Primeira viz que vi achei sacanagem com o Ronaldinho Gaúcho, o cara é o bruxo, rei do dibre, mas ai que tá a sacada, foram referências para todos da atualidade, Ronaldo, Ronaldinho, então todos já viram tantos vídeos deles fazendo a mágica, que já conheciam todos os seus truques! Sensacional", "Esse comercial consegue ser 1000 vezes melhor que o filme do dr. estranho do multiverso", "El mejor comercial del mundo mundial...... Increíble como Nike toca todas las fibras de los fanáticos del fútbol... Y sobre todo el mensaje final con quiénes somos padres de niños futbolistas y el futuro.... Un comercial que te pone la piel de gallina.... La Nike de verdad que metió un golazo.... ", "Que participação legal do Gouenji Shuuya muito obrigado Nike ;) 🇧🇷.", "Un comercial de fútbol como en los viejos tiempos ", "OMG! This was next level. Nostalgia, it was needed ahead of the World Cup.. ", "Mi infancia está aquí junto a mi como si fuera un segundo espectador, lleno de ilusiones y cargado de energía para volver a jugar como antes!", "Creo que es el mejor comercial de Nike trajo devuelta alos cracks de antes vs los de ahora demasiado bueno", "Que perfeição..Ronaldo e Ronaldinho 🇧🇷🥹", "Tenía decadas sin ver un comercial de futbol así de bueno. Excelente", "Este video es HYPE puro y duro, haciendo honor a los videos clásicos de Nike Football, simplemente Espectacular!!!", "O MELHOR MULTIVERSO JÁ CRIADO! CR7 & Gouenji imparáveis", "Nice to see the flame striker Gouenji is getting the recognition he deserves ", "Que comercial foda, slc muito bom, tinham que fazer uma série disso aí", "não sou fã de futebol, mas tiro o chapéu pra esse comercial... muito bom", "Love this. R9 brought back great memories. What a player ", "Felicitaciones a NIKE y a estos excelentes jugadores !!!! Simplemente el Futbol Soccer es el DEPORTE MAS HERMOSO DEL MUNDO.", "Reminds me so much of the old Nike ads  so much memories and nostalgia seeing Davids R10 and R9 ", "What a legendary commercial, will most definitely be remembered like the good old commercials", "2006 Ronaldihno is the all time  he may not have the best record or got the most awards, but the creativity he brought to every game will never be matched again", "Perfeição! Incrível! Mágico! Sensacional!", "Gracias Nike por traer la magia de sus comerciales leyendas.", "Nunca fui muito fan de futebol mas achei incrível esse comercial e ainda  buscaram o Ronaldo da copa de 98 e o de 2002 com esse corte de cabelo ", "To see Ronaldinho once again in his prime is everything everyone could ever wanted in football", "Ronaldinho é tão foda que é o único que tem comercial atual tanto com CR7 quanto com Messi. Respeita o bruxo!!!", "Se fosse uma série, não perdia nem um episódio !", "Nike é Nike! Fantástico!🇧🇷", "Me dieron ganas de volver a ver Súper 11  el comercial 10/10 ", "Que obra prima, meus senhores! ", "Me arrisco a dizer que é um dos melhores comerciais da Nike, lembrou mto os comerciais antigos.", "Muito fodaaaaaaa até arrepiou, me lembrou do antigo comercial 🇧🇷", "Amazing! The fact that I had to look for what's trending in Guatemala to see this!!!\nGood to see Edgar Davids getting the recognition he deserves for his contribution to the lovely game!\n#JustDoIt!", "Nike nunca pare de fazer esses comercias ️", "This is honestly a really well-made video. It felt like I already watched a whole movie", "Simplesmente Shuuya Gouenji, o melhor de todos! Que comercial ESPETACULAR!", "EFFING GOOSEBUMPS! NIKE advert always delivered. ", "Aquele Goeji ali aparecendo foi a melhor parte do comercial sem dúvida", "Un video como el de los viejos tiempos, con muchas estrellas y contando una historia.", "Caraca que comercial maneiro !!!! Me lembrou muito os de antigamente", "Um dos melhores comerciais que já vi! \n️️️\nTá loko", "Young Ronny's assist to old Ronny was perfect. Also INAZUMA 11's striker Axel's part was unexpected, but very cool.", "Em resumo, Ronaldinho só não sola geral porque todo mundo era fã dele e assistiu os vídeos dele no YouTube", "Mágico ver todos los Ronaldo juntos", "Que maravilha de comercial... Vocês são demais!", "Hace mucho tiempo que NIKE no sacaba un video tan ÉPICOOOOOO", "muito bom!!! rumo ao hexa Brasil", "0:07 Cristiano Ronaldo Jr. (2022)\n\n0:09 Shane Kluivert (2022)\n\n1:02 Kylian Mbappé (2022)\n\n1:04 Ronaldinho (2006)", "o melhor comercial de Copa do mundo da Nike... parabéns", "Lo mejor fue el doble siuuu, y los 2 Ronaldo de 98 y 2002 para que al final apareció el Ronaldo actual. Enserio estoy emocionado 🇧🇷🇧🇷🇧🇷", "putz vei q saudade! Parabens nike mais 1 vez", "Cara! Os comerciais da Nike sempre são os melhores quando se trata de futebol.\nEsse é muito foda.", "Meu deus, nn, depois desse Goenji aí eu virei fã da nike, slk os mlk erra nunca.", "that young Cristiano pass to current Cristiano was amazing to watch ️", "Mano eu já tava arrepiado, aí vai e aparece o Goenji do nada kskskssk, mano esse é comercial tá incrível", "Hay varios guiños retro, cómo por ejemplo la jugada de Edgar Davies cuando mete gol, es la misma que cuando está en la jaula y mete gol. Y otro guiño es cuando Portugal juega contra Brasil antes del partido, cuando juegan en los pasillos del estadio, si ven más, avisen.", "Simplemente emocionante...\nSimplemente Fútbol ", "Só do Goenji tar aí\nEsse comércial é o mais f*d@ que eu já vi na minha vida ", "ISHOWHACKED, this stream changed my life. My entire view of everything that exist in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience. :-/", "Ronaldinho gênio, ídolo, único, bruxo. Representa a magia que é o futebol brasileiro", "Phenomenal Ronaldo!!! You were my childhood hero. I love football because I was start to watching football with you. Best striker ever! We love you legend 🇧🇷9️⃣", "NOSTALGIA, GRACIAS NIKE POR DARNOS EL JOGA BONITO.", "Melhor comercial de todos os tempos. Superou o de 2010 ( que pra mim era o melhor anteriormente)", "simplesmente sensacional! Super Onze é muuita nostalgia!", "Se me puso la piel de gallina cuando vi a gouenji, que increíble comercial, aunque podrían haber estudiado un poco más, la animación que muestran detrás es de la mano demoníaca, igual sigue estando increíble", "Pensei que nada ia superar o Ronaldinho no comercial, ai surge o Gouenji, muito fodaaa", "Reminds me so much of the old Nike ads so much memories and nostalgia seeing Davids R10 and R9", "I'm not even passionate about football and I'm completely obsessed with this. such a genius video and concept!!", "To be honest when u see all Nike best players together u can’t resist", "The moment that they become 8bit brokes me everytime! Well done Nike", "Este si es una propaganda que si valdría la pena verla varias veces\nAunque en la TV no lo pasan xd", "Justo en la infancia  \n\nThanks Nike ️", "It's really nice to see the whole community happy and not so disappointed", "Temos mais um brasileiro no elenco:  O Professor Machado, cientista de cabelos longos e grisalhos é o ator Lui Strassburger, conhecido por apresentar Telecurso 2000, Laços de Família, Avenida Brasil, entre outras. Reconheci ele no mesmo instante e mandei um WhatsApp. Tive o prazer de conversar com ele, após tê-lo reconhecido em um posto de combustíveis. Excelente pessoa, sorridente e cordial. Muito legal ver pessoas que fizeram parte de nossa infância em comerciais internacionais. Aliás, um excelente comercial.", "Such a amazing , nostalgic video, great job Nike ", "Não esperava o pelo goenji simplesmente um dos melhores comerciais q já vi", "Just like the old good days. What an awesome job Nike!", "A nike sempre esteve a frente nos comerciais 🇧🇷", "Me transportaron a mi infancia ", "Uma palavra.\nARREPIOS!", "This was impressive the VFX work was beautiful great job Nike", "I watched this with a huge smile. I love the World Cup and have been waiting, as you have, for 4 years!! (4.5 to be exact). Gotta say, no question, Ronaldinho. :)"]}