{
    "video_id": "6p4SeR3pliM",
    "comments": [
        "Mc Inazuma ga diajak, karena kiper ",
        "ayo at 4:03 did anyone see the car (octane) from rocket league ??",
        "Do nada o Goenji ",
        "- Ronnie?\n\n- Who are you? xD",
        "WEIRD SCIENCE!!!!!!!!!!  i don’t even watch soccer lol",
        "Inazuma Eleven????",
        "Tsubasa >>> Goenji",
        "bbbrrrraaaasssiiilllllll",
        "Cool!",
        "豪炎寺はやっぱここで見劣りしないくらいかっこいい",
        "the bar is very very high no comment",
        "i likely",
        "Cual sera el afán de Nike de crear un súper  equipo, que tengan las cualidades de los mejores, el final de este comercial me recuerda al comercial de nike \"the last game\" donde crean a un súper equipo con las habilidades de los jugadores...",
        "Not Axel Blaze being in a Nike commercial \nHe really came a long way",
        "Até o Gouenji, nosso goleador de fogo. Foi sacada de mestre. Que comercial meus amigos!",
        "Wait a minute. Gouenji shuuya from inazuma eleven? Crazy maan hahaha",
        "I just bought a Nike strike team and it's incredible",
        "Melhor comercial, é disso q o povo gosta...",
        "COMO QUE NO CUENTAN DIBUJOS ANIMADOS DEOH MIOH SE TRAJERON A GOENJI XD",
        "A Nike nunca decepciona nos comerciais. Sensacional!",
        "Simplesmente Goenji metendo tempestade de fogo do entretenimento que maravilhoso",
        "It would be so cool if Marzia told you a  recipe a step-by-step in Italian and you had to follow it",
        "Ronaldo de 98 e 2002, Ronaldinho de 2006, Cristiano Ronaldo jovem e Gouenji.\n\nSimplesmente 'Footballverse', o novo comercial da Nike para a Copa do Mundo.",
        "Que paso con messi?",
        "Só de fazer o Rinaldo fenômeno aparecer 50 kilos mais leve , merecem o Oscar , fizeram o impossível",
        "Desde \"joga bonito\" no me entretenía tanto",
        "In the next decade we are gonna look back on this as great just like we did with the switch and winner stays on",
        "2:20 is literally Nunez's stepovers",
        "Aquele Goeji ali aparecendo foi a melhor parte do comercial sem dúvida",
        "No messi, no like",
        "Dope! The excitement I felt watching this. Unreal. Well done.",
        "Só eu sentir falta do adulto Ney",
        "Simplesmente maravilhoso... ",
        "Absurdamente fodástico. Tá aí o porque a Nike cobra um absurdo em seus tênis. É para gastar em comerciais como esses. Ficará na história como um dos melhores comerciais já criados.",
        "ナイキ＆イナズマイレブンコラボ\nスパイクほしいな",
        "Axel Blaze de Inazuma eleven!!\nSe me pone la piel de gallina!!!",
        "Inazuma Eleven Cameo!! Love to see it",
        "Ronaldinho:How do you know?!?!\nVan Dijk:Youtube!",
        "simplesmente lendário",
        "Ronaldinhoooooo",
        "Estos comerciales nunca deben dejar de existir ",
        "Криштиану лучший ",
        "#Nike verse , un científico toma mate? ahora el es Argentino que toque un botón y traiga al más grande de todos los tiempos a D10S Maradona y al Rey Pelé",
        "R9 ️",
        "vedere dinho e il fenomeno bullizzati da mbappe e delle ragazze anche no...",
        "Me encanta como metieron a Axel blaze",
        "Faltou a Marta...",
        "Nunca que o Mbappé seria melhor que o Bruxo",
        "A nike faz os melhores comerciais",
        "....desde mi país 🇲🇽para el mundo...\nLink si estas de emocionado como yo x el Mundial y el exelente video de Nike..grandes..de grandes...🇧🇷..🇫🇷...🇧🇪..🇨🇦...🇬🇧...🇺🇾..🇺🇸..🇻🇪vamos todos...",
        "Inazuma just ed",
        "Me hizo lagrimear, que se viene es la pregunta!!! Botas clásicas? Total 90? Air zoom? Mercurial? Ronaldinho gold? 🫣",
        "Por fin un anuncio de nike como los de antes",
        "Que obra prima, meus senhores! ",
        "Os caras meteram o Gouenji ️\n\nGENIAAAAAL!!",
        "im love nike!!!",
        "3:03 豪炎寺修也　世界への挑戦",
        "El siuuu de los ronaldos y ahora con el jr mejor",
        "BAKUNETSU STOOOOORRM, simplesmente goenji",
        "A nike nunca errar",
        "Que comercial INCRÍVEL, mddds ",
        "Acho que é um dos piores comerciais que já assisti, isso é um reflexo do mundo atual onde não há mais preocupação genuína com a qualidade da obra. Parece um comercial feito no universo do filme IDIOCRACIA - Terra de idiotas.",
        "Neymar marta messy???",
        "レッドカード出されてクールに去ってく豪炎寺シュールすぎて好き",
        "Hace falta un homenaje en vida para O Rei, Nike lo puede hacer posible",
        "God",
        "",
        "豪炎寺修也！？",
        "DUDE I LOVE THE ROCKET LEAGUE EASTER EGG AT 4:05 SO GREAT!!!!",
        "3:15, No fictional character. Goeunji: Anyway no human would have stop my Fireball Storm.",
        "Wow! Esto es una joya! ",
        "Young Cristiano assisting Present Cristiano and both doing siiiuuuuu",
        "Nike with another GOAT ad",
        "How can you not have King Eric to appear????",
        "03:05 His name is Shuya Gouenji. He is a character in an anime about Japanese hyper-dimensional soccer, and everyone in their late teens to early twenties knows him.",
        "Are you trying to tell me that Ronaldo from 1998 was inspired by Ronaldo's 2002 hairstyle to do the haircut?  that means is an infinite loop?....... ",
        "nike 1\nadidas 0\nNO MATHER WHAT YOU SEE THIS........",
        "Me divertí mucho ",
        "Classic Nike is back",
        "Volviste a la grandeza Nike :)",
        "O CGI dos Ronaldos é bem ruins",
        "Colocar o Goenji na propaganda foi genial! ",
        "4:02 Octane car from Rocket League :D",
        "ROCKET LEAGUE! 4:03",
        "Bro gotta appreciate how they put axel blaze. Inazuma eleven finally getting the appreciation that it deserves ",
        "Is it just me or there was and octane from rocket league at 4:03",
        "this man is gonna single-handedly revive the OG trollface memes 8)",
        "jajajaja una mujer? manpe ganandole a ronaldiño? jajajaja no pasa nada",
        "Ronaldinho will always be the GOAT!",
        "Ronaldinho  was way  to nerfed by youtube",
        "3:03 3:03 3:03\n3:03 3:03 3:03\n豪炎寺出てくるの日本人で現大学生の世代からしたら激アツすぎる！！",
        "Caramba creo que estoy llorando de la emoción exelente!!",
        "豪炎寺は熱すぎる",
        "Tuvieron que nerfear a Dinho por el bien de la trama pero en efecto es cine ",
        "A Nike deveria fazer filmes ou até séries com esses comerciais! Todos são muito bons, juroooooo!",
        "Tomorrow is World Cup 2022. Only thinking about it gives me flashback of previous World Cups. Good days. Good memories.",
        "Que pesados con mbappe",
        "liking the video because of Goenji",
        "Nice to see the real Ronaldo R9 and the one true goat Ronaldinho Gaucho next to current players like Cristiano-overrated-Ronaldo",
        "Brutallllll ame esa parte de CR7 joven asistiendo a CR7 actual",
        "Amei! Mas senti falta da rainha Marta.",
        "bro there is axel blaze from inzuma eleven and i just finished to rewatch it",
        "Esto es cine",
        "The uncle...  throw back to the postman?\n\nIf you know you know....",
        "Strong message at the end",
        "Except from the comparison between Ronaldinho and mbappe everything else was great",
        "Scusatemi,ma quando dice che Mbapeè straccerebbe Ronaldinho nemmeno in un metaverso dove Ronaldinho al posto di un Piede ha un Gomito.",
        "NIKÈ",
        "Nadie va decir por qué no está Messi . Que irrespetuoso son .",
        "The young versions of all of these people is so impressive and awesome. 3 different Brazilian Ronaldos, 2 different CR7s, the double SUUIII, this is brilliant",
        "Nike yine efsane bir çalışma yapmış.Geçmiş ile şimdiki futbolu birlikte güzel sunmuşlar. Futbol bence Ronaldinho öncesi ve sonrası olacak şekilde ikiye ayrılıyor.Ronaldinho futbola sihir büyü herşeyi kattı.Bugün freestyle dediğimiz herşey ondan sonra ortaya çıktı.Birçok kişiye ilham kaynağı oldu.Biraz disiplinli bir oyuncu olup Barcelonada kalsaydı bugün tüm zamanların en iyisi olabilirdi.Bana göre futbol tarihinin gelmiş geçmiş en yetenekli oyuncusudur.Bundan sonrada onun kadar yeteneklisinin geleceğini sanmıyorum.Umarım nike böyle güzel çalışmalara devam eder.Bizi geçmişe götürüp nostalji yaptığı için teşekkür ederim. Joga Bonito benzeri bir seri yapılırsa güzel olur.Ayrıca R9, CR7, Edgar Davids gibi efsaneleri görmek güzel oldu.Hepsi çok iyiydi.",
        "폭열 스톰은 킹정이지 ㅋㅋㅋㅋㅋ",
        "Mi infancia est aqu junto a mi como si fuera un segundo espectador, lleno de ilusiones y cargado de energa para volver a jugar como antes!",
        "Who cares? The best is Ronaldo Nazario (El Fenómeno) anyway",
        "Ronaldo from Ohio ",
        "唯一の日本選手を豪炎寺するの最高",
        "They should brought back maradona",
        "Mbappe vs Ronaldinho? HA!",
        "MAN I MISSED THIS KIND OF NIKE ADVERTISEMENTS SO MUCH",
        "Who’s the anime character that was in the commercial?",
        "you can see rocket league car in 4:05",
        "Lo que me emociona esque quizá en el futuro hagan la segunda parte del comercial con los jugadores del futuro que aparecen al final.",
        "Espectacular ",
        "No Zalatan take the L Nike",
        "NO WAY YALL PUT INUZUMA 11",
        "Goenji from Inazuka-Eleven",
        "Faltou a Marta",
        "Insano esse multiverso do futebol com Gouenji,  e até o Octane do Rockt league apareceu no minuto 4:04",
        "2:54 süüüü",
        "Se fosse uma série, não perdia nem um episódio !",
        "I like this",
        "Adidas 2006 : Beckenbauer?\nNike 2022 : Ronnie?",
        "En la vida Mbappé le haría un caño a Dinho... Pero que buen video, retrocedi en el tiempo",
        "the strongest player is Goenji. better than Ronaldo",
        "Gouenji",
        "Goenji, Mbappé e os Ronaldo",
        "GOATnaldo with a cold stare in the end ",
        "it would be very funny if Ronaldinho 2006's first reaction to Mbappe is \n\n\"Dida? what are you doing in French jersey?\"",
        "At the moment that Shuuya com on fire, Nike win this time! ",
        "incrivellll",
        "Falto ver jugar CR Jr con su Padre ",
        "youtube",
        "公式が冬眠してるせいで長らくイナイレを摂取できていなかった全世界のファンに粋なサプライズ！NIKEにスゲーッマジで感謝！",
        "Só aparição do Gouenji , valeu a pena",
        "mükemmel video",
        "Ronaldinho mejor de la historia...",
        "Çà m'a fait sourire de voir Axel Blaze utiliser la tempête de feu face à Mbapé xD",
        "Cadê o Pelé",
        "Just axel blaze alone made it a 10/10 ad",
        "Imagine Messi was Nike ambassador to, he will be in this video",
        "Amazing,its like a movie",
        "Hubieran puesto al hijo de Ronaldinho",
        "speed has to react to this ",
        "豪炎寺いるのサイコー笑笑",
        "I think the commercial undervalued Ronaldinho Gaúcho's ability",
        "3:03 2nd Ronaldo assisting 1st Ronaldo. Is that the reason why they are on 1st and 2nd standings. 1998 RONALDO is on 12. Haha.",
        "숭배합니다 goat",
        "Missing Zidane?",
        "BAKUNETSU... STORM!",
        "Los del final que son??? 5 Messi? Xd",
        "They even put inazuma eleven that’s amazing  good advert Nike",
        "Que sentirá Messi al ver ésto? JAJAJAJAJAJA",
        "Adidas commercial is better",
        "Voltarei aqui daqui 12 anos pra dizer o quão foda isso é.",
        "that last Cristiano Ronaldo pose with the cup would be legendary if it is the World Cup... let's hope it's his year ️",
        "So... From what I understood without Youtube footage... 2006 Ronaldinho is unstoppable... \n\nDid I get it wrong? ",
        "El cameo de Axel Blaze ha sido brutal ",
        "Crazy how the new US Kit is so ugly they used the old one for Alex Morgan",
        "Bring back Pele and Maradona please ",
        "un capo axel se hizo el que no habia pateado y la tormenta de fuego llega al final del partido",
        "Bro i would like to see more from Inazuma Eleven",
        "This commercial is pure gold",
        "If Haaland was still with Nike that would have been the perfect ending to have him come out as the terminator haha",
        "Adorei, finalmente uma marca lembrou de super onze!",
        "Não ter argentinos foi a cereja do bolo",
        "0:07 Cristiano Ronaldo Jr. (2022)\n\n0:09 Shane Kluivert (2022)\n\n1:02 Kylian Mbappé (2022)\n\n1:04 Ronaldinho (2006)",
        "OMG Gouenjiiii !!!!!",
        "Esse ficou bom, mais ainda aquele de 2014 continua sendo o melhor!",
        "Legendary commercial",
        "Super 11.",
        "AYOOOOOOOOOOOO THESE KINDS OF COMMERCIALS!!!!!!!!!!! LETS GO!!!!!!!!!!!!!!!!! I FEEL SO OLD",
        "Muito fodaaaaaaa até arrepiou, me lembrou do antigo comercial 🇧🇷",
        "1:40 자막으로는 호날두가 아니라 호나우두가 맞겠네요",
        "Goenji Inazuma Eleven ",
        "Todo iba bien hasta q metieron mujeres q tienen. Q ver con las leyendas del fútbol?",
        "dunno who are the female footballers. are they real players or just actors?",
        "Gran serie la de Inazuma Eleven, que detalle por parte de Nike ",
        "This was sooo cool!",
        "that cristiano pose in the end ",
        "Goeeenjiiii",
        "they did Axel dirty with that red card but i love that he was included",
        "Creo que todos son muy buenos pero ronaldiñho en su mejor momenton era una locura les pintaba la cara a todos",
        "Me dieron ganas de volver a ver Súper 11  el comercial 10/10 ",
        "That was insane",
        "Me arrepiei quando o Goenji apareceu isso tá dms nike",
        "Aulassss",
        "4 minutes and 27 seconds smiling to a screen!! I just remember my whole childhood! ",
        "Goenji would solo all of them thats why they red carded him",
        "Alpharad: Alright Nuzlocke might be starting to go well\nBianca: I AM THE STORM THAT IS APPRROOOOACHING B-)",
        "Excelente!!!!!!!",
        "Shuya Goenji!!! ",
        "Por que el nerfeo a ronaldinho  me dueles nike ",
        "Do nada o Goenji, super onze ",
        "só vim pelo Goenji",
        "This video brought me so much joy.",
        "Eu contei uns 15 'Ronaldos'",
        "tremenda producción, viene Adidas, pone al GOAT y sus nuevos botines, y le revienta el mercado. jajajaj MESSI",
        "Caraca que comercial maneiro !!!! Me lembrou muito os de antigamente",
        "It all went well until kerr and that american showed up",
        "EFFING GOOSEBUMPS! NIKE advert always delivered. ",
        "Sensacional, me lembrou as propagandas antigas da Nike.",
        "Muito bom esse comercial,mas faltou o Pelé",
        "MANO QUE FODA",
        "وين هالاند وميسي وفينيسيوس وبنزيما ونيمار وليفاندوسكي",
        "Inazuma  11 who saw that coming",
        "Slk",
        "Another reason why I love the world cup: commercials. Hope Adidas create a cool one too. Jose+10 (2006 WC) was my favourite back in the day!",
        "Mano apareceu goenji superou todas as expectativas",
        "only goats have seen rocket league octane ",
        "\" Impossible is Nothing \"\n\"AllinOrNothing\"\n\"JustDoit\"",
        "3:04 豪炎寺！！！",
        "Just like the old good days. What an awesome job Nike!",
        "Im crying... This mix past present and future!!! Amazing multiverse is ON!!!",
        "펨붕이 어서오고",
        "Colocar a Goenji fue una pasada, que buen comercial ️",
        "They got my man Axel Blaze from Inazuma Eleven ",
        "Edgar Davids ",
        "Axel Blaze!!  ",
        "Del futuro viene un jugador Mexicano 🇲🇽\nSe los aseguro\nGuarden este comentario para el futuro",
        "Awesome! Should have closed with 17 year old Pele scoring that goal he missed around the goalkeeper.",
        "زين",
        "How could someone really think mbappe would destroy dinho?",
        "o melhor de todos não tá nesse vídeo: ZINEDINE ZIDANE",
        "Ronaldinho is the goat along with Ronaldo the original",
        "2:01\nRonaldo 1998: Rindo do cabelo do R9 2002\n\nEu: Mas eles são mesma pessoa em corpo alma e mente",
        "We need more of this",
        "Team goenji!!! Lo mejor!! ️‍",
        "Axel would've destroyed them",
        "Octane the rocket league:D",
        "El único anuncio que me quede viendo hasta el final",
        "Ah yes.. after that risk everything.. this.. is what i remember about football ad..",
        "Who tf aré the those girls? And Maradona? Messi? Peter schmeichel, zizu ? Ibra.. long etc",
        "Brilliant! This ad gave me even more ads deas! Cool",
        "Super onze yeahhhhhhh",
        "INAZUMA 11!!!!!!!!!!!!!!!!",
        "Although the Deepfakes are not that great, this really gives my childhood memories. The Nike commercials used to be so great. Could watch them all day long.",
        "One of the best Nike commercials ever, congrats.",
        "Piola la nostalgia, pero no pude evitar sentir algo de cringe",
        "4:03 OCTANE!",
        "fire ",
        "esse é o melhor anúncio da nike traz de volta memórias antigas 1998 e 2002 R9 El Fenomeno, 2005-06 Dinho o mágico, Edgar Davis o pitbull e CR7 a melhor máquina de pontuação.... nostálgico...Boa sorte Brasil 🇧🇷traga o copo",
        "Es notable ver a Edgar Davids contemplando los nuevos botines Nike siendo que el era vieja escuela en cuanto a diseños de botines 10 de 10 el comercial nike ",
        "SIMPLEMENTE ESPECTACULAR, GRACIAS NIKE POR TRAER ESOS HERMOSOS RECUERDOS, MUY GRATOS...",
        "Se as pessoas soubessem o que aconteceu na Copa do Mundo, ficariam enojadas",
        "4:03 IS THAT OCTANE IN RL?",
        "SÓ ATACANTE HISTÓRICO!!!! Ronaldinho, CR7 é Goenji",
        "i love nike  pero no me gusto que m bape le haga caño a ronaldihno eso nunca pasaria nunca",
        "esto con messi no pasaba",
        "가나가 공 잡고 위험 지역에 있는데 압박도 안 해서 크로스각 만들어주고 2골 헤딩으로 먹히고 조규성이 겨우 따라잡았는데 수비가 자동문인지 걍 골 넣으라고 비켜주고",
        "Crazy how they went forward in time and Cristiano still looks the same .",
        "G O E N J I",
        "Mbappe and Cristiano nutmegging Ronaldinho and R9 is laughable",
        "10 years from now I'll be calling this classic",
        "Man the disrespect to Ronaldinho come on... they didn't actually have to do that...",
        "E se... futebol fosse mais tecnológico",
        "RONALDO. GOAT.",
        "LOVE IT!!",
        "O goenji apareceu no comercial da Nike, ficou muito bom ️",
        "Awesome",
        "Past & present legends competing, you say... ",
        "Anime - Inazuma Eleven - Gouenji Shuuya",
        "inazuma eleven",
        "No way they added Axel form Inazuma ",
        "4:02 the Octane lol",
        "Axel Blaze?",
        "shuya???",
        "Why are woman in the spot, they was talking about legends not about how to clean something",
        "naaaa goenji estaba re piola",
        "4:04 there's a rocket league car on the camera",
        "豪炎寺！！！イナズマイレブンから採用してくれてありがとう！NIKE最高！",
        "4:03 - Rocket League reference",
        "The inazuma eleven reference tho",
        "02:54\n\n03:52",
        "2:58 Referencia ao Luva de Pedreiro?",
        "Omg inazuma eleven goenji?? Nice I love it.",
        "O that a inazuma eleven player Axel blaze ",
        "one of the most wonderful videos I've ever seen in my life",
        "(YouTube：HANG XIE)his product arrived within 10 days, very good quality。",
        "지렸다 나이키",
        "Me atrevo a decir que es el mejor comercial de toda la historia mundial, no hay comparacion alguna. Gracias Nike por hacernos mantener la llama encendida en el Futbol ",
        "3:03\n豪炎寺きたー",
        "Doble shuuuu ",
        "Gouenjiiii ",
        "Mucho mejor que el de Adidad ",
        "good but not as winner stays",
        "INAZUMA ELEVEN !!!!!!!!",
        "This commercial loses its credibility the moment the scientist tries to compare Mbappé to Ronaldinho there is no debate.",
        "The name of the song is Weird Science by Oingo Boingo",
        "SHUUYA GOUENJI ",
        "Gordito: Jose? Jugamos?\nJose: Si",
        "O melhor jogador è o goenji nem tentem me fazer mudar de ideia que não vai funcionar",
        "No one's talking about Axel Blaze\nLiterally the peak of the trailer",
        "we need more of these now!",
        "Todos foram Enormes, Ronaldinho o melhor 10 de sempre, todos os outros ainda não houve um que conseguisse estar tanto tempo a um nível de topo como o REI CR7 digam o que disserem... Orgulho de Portugal!",
        "4:03 that octane from Rocket League ",
        "Beautiful. The best comercial ever.",
        "Simplemente EPICO ️",
        "IM STILL WAITING FOR ZLATAN :D",
        "Who’s the famous uncle ?",
        "Creo que es el mejor comercial de Nike trajo devuelta alos cracks de antes vs los de ahora demasiado bueno",
        "Que comercial incrível ️",
        "bien joué\n\n...",
        "The old Nike commercials are back\nHope for more like these",
        "até que enfm algm gasta dinheiro pra fazer um comercial que arrepia! parabens a nike, esses lances marcam epoca, ficam pra historia!",
        "3:06\nHis name is Shuya Goumenji. \nHe is the ace striker of the Raimon Eleven.",
        "Só a cena do Goenji já valeu pra min kkkk\nSuper onze  é top de mais",
        "Everything has to be woke nowadays?",
        "BLOODY BRILLIANT",
        "code lisa mdr ",
        "adamlar yapıyor aw",
        "Um show de referências, Ronaldo Jr aparecendo no começo, referência ao comercial torneio secreto onde o time do Davids aparece e a final é entre o time do Henry(Mbappe é o novo Henry) e o time do R9, Roberto Carlos e Figo(CR7 foi o novo Figo e ainda melhor), referência ao comercial de 2005 Brasil vs Portugal onde Figo e Ronaldo disputam uma bola ... Três versões do Ronaldo, lembrando a época final do Ultimate Team, quando temos 3 versões diferentes de uma carta lendária... E por aí vai, um show de nostalgia e fã service, chupa essa manga homem-aranha sem volta para casa",
        "Ronaldinho>>>> Mpabbe",
        "4:23 Speed on the left???",
        "Messi Maradona y pele falto",
        "Ronaldinho gênio, ídolo, único, bruxo. Representa a magia que é o futebol brasileiro",
        "Vintage Nike back at it again, this is going to be such a good memory in some years! I already feel melancholic",
        "Lastima que no lo tienen a Messi ",
        "Cristianinho is already in a Nike commercial with his father. Nice",
        "axeeeelll blaaazzeee",
        "Toda copa do mundo uma propaganda absurdamente absurda. Não tem jeito, a Nike amassa!! Parabéns pessoal!!",
        "Alucinante sin palabras",
        "Y que pinta una mujer en un juego de hombres?",
        "Este chute no final deveria muito ser do Roberto Carlos, aí sim fecharia com chave de ouro...",
        "この世で1番かっこいいCMです。NIKE愛してます",
        "Where's Neyney?",
        "that cameo of axel blaze......ah thank you nike for bringing my most favourite sports anime",
        "Young Ronaldo assisting old Ronaldo what a beautiful sight",
        "I'm pretty shocked that Gouenji Shuuya/ Axel Blaze is in this commercial; Seriously, There are many popular soccer anime that they can choose from, yet Nike chooses an Inazuma Eleven character to feature! I'm so happy they did a great strategy to bring recognization to Inazuma Eleven itself!!",
        "豪炎寺！！",
        "Axel Blaze caught me so off guard, my childhood right there",
        "Nike Never Dissapoints ️",
        "Alguien mas vio el auto de rocket league estacionado en la camara de seguridad del final del video?",
        "La maldición de Nike volvió",
        "Extraordinario, ver a Ronaldo (el fenómeno) nuevamente , frente a frente con jugadores de la actualidad fantasía echa realidad ",
        "E Pelé?",
        "Me arrisco a dizer que é um dos melhores comerciais da Nike, lembrou mto os comerciais antigos.",
        "BAKUNETSU STORMMM!!",
        "A Japanese national player Gouenji Shuya",
        "I freaked out when I saw Goenji to bad he got a red card",
        "dub",
        "Not as good as the one 20 years ago, but still pretty cool.",
        ":D",
        "That Gouenji/Axel cameo worth more than anything!",
        "Caraca a Nike mandou muito bem nesse comercial.",
        "Im a messi fan but, young cristiano assisting cr7 is gold.",
        "O Nike sempre se supera, genial!",
        "Volví al 2005 cuando Nike y Pepsi tenían los mejores comerciales de la historia ️️",
        "Like the woman would be able to compete with the men ",
        "Amaaaazing",
        "fenomeno",
        "The video is fine, only the best player in the world was missing, Leo Messi, if he was there, that video would be incredible.",
        "Soy argentino pero reconozco que el mejor siempre será Ronnie y quizás hoy en dia Cristiano Ronaldo pero Ronaldinho numero 1 viste",
        "El mejor comercial de la historia! ",
        "Really love the go forward in time part…good job Nike",
        "Melhor comercial de todos os tempos. Superou o de 2010 ( que pra mim era o melhor anteriormente)",
        "Quem é imbape na fila do pão pra se comparar aos Ronaldos, todos eles são foda",
        "Goenjiii!!!",
        "Mbappe tirandole un caño a Ronaldinho? Le faltan rulos para ser como Sorin",
        "Inazuma eleven cameo was unexpected Totally Fire tho literally",
        "Mdr le crossover",
        "I thought we were going to see haaland",
        "music please",
        "Soooo we ain’t gonna talk about the anime soccer character? Like bruh that part was so freakin awesome. Noice! 8)",
        "Muuuuuito foda !!!! ",
        "Fictional character should have been Oliver Atom.",
        "Hay 3 cristianos Ronaldo el primero aparece en el min 0:08",
        "Caaaaaaaraalho que comercial FODA!",
        "...shameless...",
        "Saudades de propagandas da Nike tão boas assim. O Cgi está muito bom!",
        "Goenji de inazuma eleven Good  te la rifaste Nike",
        "豪炎寺！？",
        "Messi? It’s because he is affiliated with adidas?",
        "الاعلان ده ظالم رونالدينيو",
        "Que maravilha de comercial... Vocês são demais!",
        "No one can beat R9 in speed dribbling ",
        "Je comprend pas trop pourquoi ils ont mit des joueuses sachant que c’est la coupe du monde homme..",
        "Nothing will ever top \"Winner Stays On\"",
        "speed ? i can see you ?",
        "Minuto 3:44 Alex Morgan saca el dedo del medio... XD",
        "2:49  #Mbappe ",
        "I thought this was a teaser for an nft project lol",
        "No espere que estaría axel blaze sinceramente ese simple detalle hace que sea mejor",
        "This mixture of women's football is SOOOOO FORCED...",
        "AXEL ",
        "3:08 poor Goenji mortals will never understand the supernatural interstellar soccer ",
        "Trazer nossos Ronaldos Fenômeno foi simplesmente ÉPICO!!! ",
        "Pelé e Maradona?",
        "Me transportaron a mi infancia ",
        "Great commercial except for not making Tsubasa the anime cameo",
        "Is the female English player Alex Greenwood? It looks like her. No it's Beth Mead lol",
        "I guess gouenji shuuya is lost",
        "Muito FODA, JÁ É COPA! Tô muito ansioso! Obrigado por esse comercial, Nike!",
        "To whoever put Gouenji in: This is GENIUS!!!!!!",
        "Goenji me quebrou",
        "I could watch all day and not get bored! Interesting concept, love everyone ",
        "3:04 what??? what???",
        "Just awesome!!!!",
        "As much as I loved seeing Ronaldo and Ronaldinho, I couldn’t get over the terrible deep fakes",
        "Watch this whole add for inazuma Axel blaze",
        "Esta bueno pero es mejor el de Adidas",
        "Soy el único que piensa que infravaloraron a Ronaldiño? es un genio y es mil veces mejor que Mbappé. Deberían haber puesto alguna jugada nueva de ronaldiño y que diga: \"Proximamente en Youtube\" (Guiñando el ojo con sarcasmo) para darle el lugar que merece.",
        "I just realised where is pulisic and davies19",
        "Que pena esse comercial não ser eternizado em 4k ou maior, com qualidade máxima! \nIt's a shame this commercial wont' be eternized in 4k or higher, with maximum quality! \n\nRonaldo fenômeno, para sempre o meu maior ídolo desse esporte.",
        "But where is messiiiiiii????",
        "10/10 ",
        "The car decals in rocket league is insane it worth to spend all my credits",
        "putz vei q saudade! Parabens nike mais 1 vez",
        "2nd part???",
        "COLOCARAM NINGUÉM MENOS QUE O GOUENJI, INCRÍVEL\n\nPS: Comparar Mbappé com Ronaldinho é SACANAGEM",
        "Faz uma série aí Nike ",
        "All legends but only one GOAT. CR7 ️",
        "Can we talk about the octane that is parked in 4:04 ?",
        "Poderia ter colocado o Tsubasa hahaha",
        "O melhor comercial da história pqp",
        "Brutal",
        "Felicitaciones a NIKE y a estos excelentes jugadores !!!! Simplemente el Futbol Soccer es el DEPORTE MAS HERMOSO DEL MUNDO.",
        "NO WAY THEY FEATURED GOUENJIII SHUUUUYAAA FROM INAZUMA ELEVENNNNNNNNN!!!! FIREEE TORNADOOOOOOOOOOOOOOOOO 3:05",
        "円堂じゃなくて豪炎寺なの、そしてトルネードじゃなくてストームなのイナズマイレブンをよくわかってないと出来ない選択だろ…",
        "If Football had a YouTube Rewind.",
        "Referencia ao Rocket League <3 4:02",
        "No Fictional characters cuz Inazuma Eleven characters solo the footballverse. Gounji was gonna do that flaming shot that they got at the end but they kicked him off before it could happen.",
        "No why no pele",
        "One thing about Nike, they gon give you an ad.",
        "the women in this commercial ruin it",
        "This was impressive the VFX work was beautiful great job Nike",
        "Inazuma Eleven ",
        "Had to rewind it a few times while watching it for the 1st time, soo good !!!  Thanks to #NikeFootball & #Youtube",
        "não sou fã de futebol, mas tiro o chapéu pra esse comercial... muito bom",
        "NIKE + COPA DO MUNDO + COMERCIAL = PERFEIÇÃO",
        "Tem até o octane do Rocketleague",
        "豪炎寺がココに出てくるのが凄いし、エモすぎる！日本のマンガが世界的有名ブランドのPRに使われているのが凄い",
        "Ronaldo e Ronaldinho juntos, isso são os deuses jogando",
        "O Ronaldinho dava um pau em todos só que nerfarão ele",
        "Just do it ️",
        "dinho crossbar vid producing legends since '08 ",
        "Que epico!!",
        "Nike did it again!  I'll put this one behind joga bonito and the brasil airport.",
        "Eu tava com muitas saudades dessas propagandas",
        "Pena o Tsubasa ser patrocinado pela Adidas",
        "Gouenji robándole el balón a Ronaldinho. ¡Épico!",
        "Greatest Football Player Of All Time 🇵🇹 CR7",
        "Nike Football ads are back to greatness; but still fall short to the legendary ‘My Time is Now’’Winner Stays’ & ’Cage’",
        "The rocket league car",
        "Pq todo mundo usa uniforme da sua seleção, mas só Ronaldinho usa do Barcelona?",
        "nothing will be better than \"winner stays on\" but this one was extremely close, very cool to get some Brazilian legends (or at least lookalikes lol)",
        "To bad Maradona was sponsored by Puma that discussion would be over before it started ",
        "I think it is ROBERTO CARLOS",
        "豪炎寺出てるのアツい！！",
        "Que participação legal do Gouenji Shuuya muito obrigado Nike ;) 🇧🇷.",
        "Axel blaze in a Nike commercial\nWhat a time to be alive ",
        "3:53 How can there be 3 goats?",
        "no one talking about Axel Blaze being there?",
        "Iradooooooooooooo..I like Pepsi too, I'm really mad, but this one is much better..huhuahuahua",
        "Roni:How do you konw?\nMbappe and Van djik:YOUTUBE",
        "Witness the Witcher, Ronaldinho of Dibria.",
        "Come on Adidas LM7",
        "Mi infancia está aquí junto a mi como si fuera un segundo espectador, lleno de ilusiones y cargado de energía para volver a jugar como antes!",
        "Ronaldinho Gaucho sempre será o melhor jogador da história de uma temporada.",
        "炎のストライカー豪炎寺修也だ！！",
        "Did anyone notice Cristiano Jr in the very first shot?? Brilliant ",
        "Mano, esse comercial só não ficou mais top que aquele da copa de 14",
        "INZUMA 11 AAAA",
        "This is honestly a really well-made video. It felt like I already watched a whole movie",
        "Em um comercial com R10, 2 versões do R9, CR7\nQuem mais me emocionou foi o Goenji",
        "Extraordinary ",
        "Sensacional!! Ronaldinho destrói, faltou Pelé e Maradona..",
        "was shocked to see Axel Blaze from Inazuma 11 in Nike's commercial ",
        "what a piece!",
        "Gouenji shuuya is the best!\nI started playing football because of him!",
        "aint no way they included the anime charecter. sorry i dont remember his name i havent seen that show since i was a kid",
        "Obrigado por trazerem Ronaldo a este lindo comercial de volta Nike🇧🇷",
        "Tentaram dar uma esculachada nos ronaldos brasileiros,nao meteram um gol e toda hora perdiam a bola",
        "Can you pls make part two? I really want to see son versus father.",
        "Vídeo espertacular da Nike com Ronaldo de 98 e 2002, Cristiano Ronaldo jovem e 2022, Mbappe,De Bruyne,Alex Morgan,O Shuya Goenji do Inazuma Eleven,Van Dijk,Phil Foden,Ronaldinho Gaúcho,Leah Williamson,Edgar Davids e Sam Kerr vídeo top",
        "hasta la actuación de Phil Foden fue tan brillante como todo el vídeo jajaj",
        "Tarjeta roja para Goenji ",
        "Pensei que nada ia superar o Ronaldinho no comercial, ai surge o Gouenji, muito fodaaa",
        "Rocket League easter egg @4:03",
        "Rocket league Min 4:03",
        "Where is Eric The King ? 🫤",
        "Goenji️‍️‍️‍",
        "Uma palavra.\nARREPIOS!",
        "oh gouenji <3",
        "待って、豪炎寺は神すぎるって",
        "AND Maradona from 86' AND Messi",
        "The perfect footballer would:\n\n-Ronaldinho's technique",
        "Shuya Gouenji >>>>>> todos os outros",
        "Fantástico",
        "Quero continuação",
        "El chaval del inicio del video es el hijo de CR7"
    ],
    "comments_disabled": false
}