{
    "video_id": "7GmR5mfD2wE",
    "comments": [
        "Calch? You mean cork spelt caulk lol",
        "I watched it live and was glad it got off the ground but just couldn’t get all that excited about it. This could have been done 30-40 years ago, old equipment, old design, old thinking, nothing reusable and all a bit sad compared to what the private sector has done in the last 10 years. I know it’s not totally NASA’s fault as they have politics to deal with but they are stuck with this design for what 5-10 years now, when SpaceX can do the same job a lot cheaper.",
        "should be banned is bad for enviroment",
        "Cool pictures. If only \"World's Brightest Rocket\" were a useful achievement.\n\nYour self-reaction to your own \"packing nuts\" joke made me chuckle.",
        "Finally going to the moon for real this time.",
        "To the Mun!",
        "Glad to see SLS finally was able to launch.",
        "Casual dunk on the N1.\n\nWhat it gets for dunking itself.",
        "Wait what they didn’t send people? We’ll kind of good because it’s so old  but I thought this would be bigger",
        "The keen eyed of you will have noticed the weights (mass) on the passenger seat equates to a passenger, thus the mass will be correct, and the SC will be stable.",
        "I don’t feel excited at all with this, if anything it tells me NASA shouldn’t be building rockets now.  ",
        "A rocket so bright it nearly melts the moon.",
        "I was at the press site, it was genuinely blinding. And loud. And awesome.",
        "Otro cohete por que no crear una nave verdadera Bella grande hermosa se puede claro que se puede",
        "\"more AFFORDABLE as SLS\" ",
        "Wait for the flat earthers to deny it all.... they are so special.",
        "I wish there was better coverage from NASA. It'd be nice to have two streams, one for toddlers and the other for us rocket geeks. I'd be more happy with telemetry and launch/mission control audio than listening to commentary.",
        "I've been looking forward to watching your video on our launch for most of my career!  Thanks Scott!",
        "with all the news over the last several years, I just assumed this was gonna be blowed up after launch",
        "06:47 am for me still watched it and I agree it was really bright",
        "We finally see the space shuttle fly to the moon and even orbit the sun. And people said it can't be done :-)",
        "such a great launch. looking forward to the rest of the mission now :) thanks for the vid Scott",
        "Listening to the velocities on the launch commentary, I have to say that I believe that SLS achieves higher velocities quicker than any other launch system that I'm aware of (hello, 8 million lbs. of thrust!).  Would love to know what kinds of G forces that the occupants will experience.",
        "Amazing images.\nTerrible puns.\nCongratulations to NASA.\nGreat update Scott!",
        "HOLY COW NASA STILL FLYS A B-57!!!! Wow!",
        "Fantastic shots!  I was more than curious about all that off gassing, and Scott acquired a cabin shot also!  Very cool ",
        "engines faal into the sea.... so they are useless then?????",
        "They should put more cameras on the rocket. Well gopro is cheap right compared to NASA budget",
        "Was it just me or was the takeoff acceleration from the sls extremely fast compared to other rockets? ",
        "It is difficult to launch a rocket, but not always so hard. This rocket got off half caulked.",
        "I think this video basically sold a million Nikon P1000s didn’t think they would be that good at night ! Thanks for the coverage ",
        "NASA could have put cameras on the actual rocket so we can see it live instead of having to watch some crappy computer animation after the launch. Felt like a broadcast from 50 years ago.",
        "Those solar panels are so cool.",
        "SpaceX Starship development began in 2012, when Elon Musk, CEO of American aerospace company SpaceX, first publicly described a high-level plan to build a reusable rocket system  Going on 11 years. Elon is quoted promising 100's of humans on Mars by 2016.",
        "your telling me they launched the SLS, after all this time and money, WITH GOPRO 4's?! WTF?",
        "Liked, subscribed and comment for the algorithm. Thank you for all the great content you present.",
        "It looked like one of the RS-25 white shrouds caught fire during ascent (visible as it cleared the tower). Looked dangerously scary.",
        "Now that was a deep date up space!",
        "SpaceX has this type of data and video down to a science, unfortunately NASA does not.",
        "Wonder if there will be any mention of this on twitter ",
        "Was thankful that do to timezone differences that I was able to wake up later than I wanted to tune in where they were paused before the Flight Directors Poll at T-10:00, caught the last 30 secs on through 9 minutes into flight on screen recorder to forever have it on my phone and thankfully our crappy internet didn't die during launch so it's all just one straight video, can't wait for Artimes 1 to splash down and for the rest to take flight in the future",
        "Can't wait for angry astronaut to make a video about this launch",
        "I’ll be satisfied with this program when and only when the gateway station is in place. Until there’s a maintenance-requiring multibillion dollar piece of equipment that they can’t just stop flying to, the risk of the program getting Apollo’d will remain, even when we’ve put human boots down in the regolith. We need that hard guarantee that the program can’t be cut. (And honestly, with ISS nearing the end of its lifespan, they should really start designing additional modules for gateway to enable it to take over the roles of ISS in international off-earth research. Then we can start sending crews to the moon’s area routinely).",
        "Pretty much any sentence with the phrase \"caulk rocket\" in it is going to be funny.",
        "8:38 All of this is possible because of that lady taking out the trash.",
        "I thought that the flames were crazy long, those SRBs are so violent",
        "Most Kerbal space mission ever: Huge!!! Boosters!!! Way over budget!!! Took AGES to get something actually off the ground and into space!!! Just started with the old save file of the last mission because the parts (SRBs, engines, orange tank) are loaded to save time, but it actually took longer!!! Tacked on a bonus probe just because we have an actual working rocket!!! Left it out in a hurricane because we're behind schedule or whatever, and maybe the wind was a bit higher than what was ok, or not, but it's totally fine, just send it!!!!  RTV may fall off in flight, no worries, autostrut it!!! Red team totally walking right up to a loaded up rocket leaking hydrogen to make a few tweaks!!!",
        "how do they plan artemis' return such that it doesn't collide with any of the objects circling the earth ?   I've seen the Norad images that show the crazy number of objects in earths orbit, so it seems like it would be a difficult task.",
        "8:42 I love this image. 'Oh, you think playing a flight-sim with an ultra-wide monitor is cool? We're flying a spaceship, checkout our rigs.'",
        "I think those guys should get some hazard pay for going out there to fix the leak.  ",
        "The plume from the SRBs seemed to me to be larger than what we saw with the shuttle, even for a night launch. Does anyone know if it was because of differences in photography equipment, or if they actually were longer because of other factors like the 5th segment or proximity of the core stage's engines affecting the plumes?",
        "Do they have controlled re-entry this time?",
        "I was lucky to be close to see it go off. It was a surreal experience and my first rocket launch. Extremely loud, almost like hundreds of bombs going off at the same time. Well worth it, was one of the most beautiful things ive ever seen.",
        "poor on board video compared to Space X",
        "Some amazing photographs",
        "Wow... the NASA crawling logo on the boosters. I didn't expect to see that after more than 20 years!",
        "Thank you very much for sharing my video. Being able to see the launch in person was truly an amazing experience. Just amazing.",
        "My son is 2. I'm excited to see him be of age to see another person step on the moon!\nForget the fact I'll live to see it too.",
        "It's very poor that those SRB's are just allowed to be dumped in the sea and forgotten about....not very eco friendly is it! as a minimum they should be recovered and disposed of properly.",
        "Thank you, Scott for getting me into KSP way back in the early 2010’s!\n\nThrough that game - I have learned so much about rockets and playing with many realism mods, I’ve grown to understand why flight plans for rockets are the way they are. I also understand things like why solar panels have to be folded back in for burns and other such small details through a combination of KSP and also being a car mechanic (understanding stress on components and various other things). It’s so liberating to be able to follow along with something like Artemis and understand what’s going on every step of the way.  I don’t think I could’ve had that without your KSP tutorial videos back in the day. Thank you again!",
        "You were kind. The official coverage absolutely sucked. You failed to mention that we had a countdown, T-minus 10, 9, 8.. etc., got to zero and..... they cut to pre-recorded footage.  No ignition, no indication of why, no word of what was happening, just pre-recorded clips about the mission.  This lack of information went on for quite some time, like 45 minutes! It was something like t+45m before this thing took off?  I'm not sure if they reset the clock after the initial countdown, I had given up on them by then.  It might feel like a win that this thing actually took off after all these years, but was it a win?  Do you really feel like this beast is ready to take humans to the moon?  The shoddy coverage and delays leave me feeling like this program is a waste of money. I certainly wouldn't trust this enough to put a human on board.",
        "It was a magnificent achievement to get this jobs program, oops rocket, finally launched.   It just seems to be completely not the cutting edge machine in 2022.  If this had occurred 10 or 15 years ago we would all be complementing NASA on the cutting edge technology.  However now, when a double booster landing by SpaceX even becomes routine, this rocket just seems old.  Throwing away all that hardware, some of it specifically designed to be reusable, just seems like a terrible waste.  Even the inside of the Orion seems like a older model car.",
        "we have people living on the streets and under bridges and veterans that need assistance. But ya know yeah we’re gonna fly a manikin around the moon. It’s so jacked",
        "I'm kind of aggrieved by the fact that NASA wasted over 50 years of my life before going back to the moon.  We could have been on Mars by now!  Okay, Boomer, get over it.",
        "I don't want to be a party pooper.. but after 11 years and billions waisted..  IT'S ABOUT TIME ..",
        "Salvage space mission.",
        "8:52 I'm nostalgic for the Apollo era control center. Desks with computer monitors could be anything. Would have been nice to have 1960's Apollo styling for the desks and the room. That's just me I guess.",
        "I'd rather have them delay be cautious and take the time they need rather than launch and have a failure that wastes a bunch of my tax money.  I have no problem spending the money, but not taking prudent steps of caution would seem like a waste.  I'm really good it went off successfully, regardless of the schedule.",
        "So you can talk the talk but you can't caulk the caulk?\n\nBadumtish.",
        "Why don't they recover & re use the boosters?",
        "It would have been brighter if it exploded,, so there is that.",
        "What an incredible launch.  So happy I made the 18 hour drive to see it lift off in person.",
        "I started to watch the strem about close to T-15 minutes.",
        "it's good to see the doubters in SLS proven wrong. go Artemis, and go NASA!",
        "What an amazing thing to watch. Orion is finally on it's way to the Moon. If all goes well and it gets back to Earth we will finally be sending humans back. Fingers crossed that it does all it's supposed to....but there is still loads of things that could go wrong.",
        "What a tragic waste of those historic engines and rocket segments. Don’t know why the boosters weren’t recovered in the same way as the shuttle.",
        "caulk rocket? this is SLS not New Shepard",
        "And a big thanks to SpaceX for their rapid development cycles, inspiring the SLS team to get their rocket off the pad at last.",
        "So 53 years on from Apollo, and this is the best NASA can do? A bunch of recycled parts, and a one time use craft. My nephew asked what Artemis was all about, so we looked it up and NASA’s mission statement begins with “NASA’s Artemis mission will land the first woman and person of color on the moon”, because of all the things that returning to the moon could mean for humanity, an astronaut’s skin tone and reproductive plumbing are apparently what we need to focus on, and not humanity’s re-engagement with crewed exploration of another celestial body, or the program being the first step in establishing the first human outpost beyond low earth orbit, or perhaps that Artemis is the first step in expanding our civilizations sphere of influence out past our home world, no no no what’s most important is the sex and melanin content of the astronauts. NASA making this the first line in their mission description does nothing but cheapen the entire thing. because listing the landing of a woman or a person of color as a top priority is as pointless as it is meaningless. let the program and the astronauts speak for themselves through their deeds and accomplishments, and not have their immutable physical characteristics be their qualification and accomplishment.",
        "Brightest launch in history?  I'd say Apollo 17's night launch with the Saturn 5 rocket was just as bright.",
        "its also that aluminum perchlorate is a particularly bright burning reaction",
        "You crack me up dude",
        "N/\\S/\\ choice to give the go, predominantly was due to visibility of flare projector (including reputation) path. But the lack of professionalism displayed on constant updating at scrub & sea discarded tins.",
        "Scott, you showed some really beautiful shots of the launch.  Thanks and thanks to the folks who took them!",
        "The Russians may have had brighter launches, but only because they BLEW UP",
        "I was wrong I thought it was going to burn and die, im so glad I was wrong  go sls",
        "The new SRBs are disposable , no casing segments , no O rings to worry about leaking.",
        "Aww man, all those hours spent watching all the scrubbed launch attempts, and they had to actually launch it this time around when I was halfway through my night sleep here in Europe!!\nThe only consolation in all this is that it was a night launch, which doesn't usually provide stunning onboard footage, and with Scott saying the live coverage wasn't that great either, I feel better losing the live coverage.",
        "Launch coverage sucked compared to Space X's coverage or theirs.",
        "Still can’t believe that this Big Orange Joke finally launched after more than a dozen years …",
        "Coverage was crap. What a disappointment. How can we just watch a bad rendering for so long?",
        "You had me at Caulk Rocket.",
        "Still not a big fan of SLS as a rocket program, but damn that launch was stunning! We were going, and now we went!",
        "Where is Shaun the sheep?",
        "Big balls on the Red Team. Imagine a slipped torque wrench making a spark ",
        "Launch coverage was disappointing tbh. Guess they ran out of money for on vehicle cameras lol",
        "so its a bastardisation of shuttle, constalation and orion missions",
        "That caulk rocket was inserted into the upper atmosphere after it went off and it shot its load into space",
        "somebody needs to give the red team a GoPro, they deserve all the publicity for their bravery",
        "It's too bad NASA did such a poor job of at least telling us where it was as far as down range, altitude, speed, etc -- even for TLI they just kept repeating the speed, but didn't really show a map or anything.",
        "It's 1973 all over again, glad we've caught up with the sixties technology at last. Didn't take long.",
        "Some of those launch pictures people took are truly stunning. Thanks for the video Scott!",
        "Is the second half of this video at a lower framerate? Perhaps it's the YouTube app buggy again but my usually work around didn't help it.",
        "Booster shots!",
        "SLS is a smallsat launcher\nChange my mind.",
        "Scott I agree. NASA PR sucks. Its horrible.  They are still operating on the model of \" we don't need cameras for science\".  No, you don't need cameras for all science.  But how on Earth ( pun intended)  do you intend to attract interest in this digital age, if you don't have a 'Wow\" past the launch?  Lets be honest,  no one but us space nerds goes \"Wow\" past the launch. You can play a VR sim that wows you more than NASA footage.   I'm the child of a dad who worked on the Lunar Module, I know how to get excited about space.   They make it tough for the layperson and that's a shame.",
        "It was an awesome launch, I live in north Florida and we could see it 150 miles away. We almost went to bed but I’m glad we all stayed up.",
        "can’t wait for Starship, that’s going to be something I’m sure!",
        "holy f this was awesome.",
        "biggest waste of money in history",
        "@3:50 I think you mean Hydrogen build up not Helium",
        "7:34 \"translunar injection moon, which will take it to the moon\" - So much moon in this launch . Jokes and chuckles aside, I enjoy your short but highly informative resumés of space events!",
        "Waiting for Months i ignored any  live Artemis videos\nThen watching some SpaceX  seen Artemis launched a while ago  wtf yep  this aussie was  asleep  \nFinally got to see it lite up the calf skys  good luck  Nasa we all want to see progression to the moon .",
        "I watched last night from the Saturn V center and HOLY POTATOES was it bonkers!!! I’ve never seen anything like it! ",
        "\"...late last night for me...\"\n\n*laughs in east coaster",
        "The fact that the boosters are still segmented is embarrassing.",
        "I honestly didn't think SLS would ever launch",
        "@4:40  @Scott Manley Try this;  \"The RTV was caulk blocking the launch\"",
        "Guess there aren't many smokers in the RED team",
        "We really are spoilt by SpaceX launch coverage.",
        "Awesome content as always. Thank you.",
        "Kudos to my fellow MPS coworkers for a  flawless performance. It took a tremendous amount effort from our small team to make this happen. You should be very proud.",
        "The whole affair felt like something from the 90s compared to an SpaceX launch. Happy to see it go but, really feel like our tax dollars weren't well spent.",
        "lovely stuff.",
        "How’s the flying going Scott. I wish you the best",
        "Those pictures people took are all absolutely jaw dropping",
        "Speaking of the 5-seg SRBs- I wonder how powerful were they compared to the prototype AJ-260 solid rocket motor test fired in the 60s?",
        "The sound it made when it was lofting itself skyward was incredible, like the air itself was being torn asunder.  Amazing launch.",
        "the white elephant finally flew",
        "THEY PUT A MAMMOTH ENGINE ON A BIG KERBODYNE ORANGE TANK",
        "Over due, over budget, recycled retro technology and NON-Reusable. \n\nArtemis is a government pork barrel project of the WORST kind.",
        "I am a fan of the \"if it ain't broke don't fix it\" mentality, but It's just beyond me that they are still using parts from the 90's that are just lying around, instead of getting manufacturing going to be able to repeat this often.",
        "Good doing NASA but I wish all of government money would have went to Elon Musk and his Starship. We would have been to the Moon by now and planning for a trip to Mars soon!",
        "So dissapointed with nasas filming. This was a highly anticipated launches and NASA doesn't film like spacex. I mean, take the audience into account.",
        "I think he had it right \" Caulk rocket\"",
        "I heard speeds being called out - the greatest was ~16,000 mph.",
        "I've got a slightly technical question about the SLS vs JWST orbital paths that I couldn't find the answer to, can anyone here help me?\nThe JWST on Ariane 5 never made a proper orbit of earth. There was no specific apogee raising burn, instead it directly transfered to Lagrange orbit (I guess that technically counts as raising the apogee to infinity, but you know what I mean). Artemis, however, raised it's apogee, did a half orbit, and then did its TLI burn at that raised apogee, and then started on it's ellipse around Earth and to the Moon. I'm guessing that in both cases it's about making maximum use of the Oberth effect, but I can't work out why those two different situations used completely different methods to do that? Something to do with the launch latitude or launch profile of the two rockets maybe?",
        "Whew, fly save Rusty! I mean... you know. I felt like seeing my grandfather riding his moped at the age of 93 for the last time, while witnessing this spectacle with a little prior knowledge.",
        "What are the twitter references to Shaun the sheep?  Asking for a friend",
        "There were on-board cameras.  They just were not live broadcast to the public.  NASA will likely release them soon.",
        "Mega cool. :)",
        "Massive props to Red Rhetoric!!! Jaw dropping resolution, clarity and sensitivity!! Why isn't NASA using such a setup??",
        "8:45 they launched so late that the night crew is changing the waste baskets.  That woman needs a raise.",
        "Les Johnson, the lead scientist on NEA Scout (and the previous solar sail test flight) is a friend of mine. So jazzed to see this going forward!",
        "Fact: NASA's broadcasting is no match for SpaceX's.",
        "There's a 1/110 scale SLS Lego set on their Ideas site that looks really cool. Really hope they decide to make it.",
        "that was bright!",
        "Off shore Support: what can I do for you tonight?  NASA admin: eh our router has ceased to function. off shore support: have you unplugged it and left it down for 2-3 minutes and plugged it back in?",
        "At https://youtu.be/7GmR5mfD2wE?t=474, what are all the particulates? Is this from thrusters, or dust being kicked up or what?",
        "Great video Scott, nice to see SLS launch successfully.",
        "I was there along the banks of the Indian River. It was my first rocket launch viewing close up. It happened very fast once everything was cleared. In fact I almost missed it. I was in my truck getting updates when I saw the countdown at 1 minute!",
        "Don't you mean the Insane Clown Propulsion Stage?",
        "She screamed off that pad!",
        "Stayed up until 2:45am to watch it. Worth every bit of the heavy eyelids today. That's what coffee is for!\nAlso, hulllooooo!",
        "It's a shame that some people wanted this to fail. Fantastic photos.",
        "SCOTT??? Why did they put such crappy cameras on such a giant leap for mankind?",
        "Space X just can't compare witht he sheer majesty of a Nasa launch.\nThis is hope for my generation, for whom it feels all we had Global Warming & Tick Tock (nothing great)",
        "Caulk rocket??\nWhen I was at Space Data in the 90s,  they had \"Rocket Tape\" and their literature boasted \"the most thoroughly flight-tested range safety system\" in the business.  Translation: they blew up a lot of sounding rockets! ",
        "Siglis reaction to SSundee being of the cause of his torment that entire round made my day priceless",
        "Fucking FINALLY! HOORAH SLS!",
        "\"Childish puns\"  Nah, those were totally dad puns.",
        "Blue Origin designed their rocket with caulk in mind lol",
        "Wow that carbon dioxide is going to ruin the green earth. Lol",
        "But where's the government banging on about carbon footprints and cash flow ?\nNice expensive fire works.",
        "As someone who loves space but wasn't alive when Apollo went up, this was a special moment for me. I've been waiting patiently for the day humanity goes back to the moon and we pick back up where we left off in 1972. What a moment. To see Orion + SLS fly together after following the program's progress for over a decade, it's a great feeling. ",
        "This launch brought back memories of the Apollo Soyuz mission from 1975 when I was almost 7 years old just because the size of the rocket.",
        "Any ideas yet what the launch did to the tower, that they have a ban on filming it?\nI do remember the NASA folks and their 'holy cow' moment after the first shuttle launch when they saw how much area away from the launch pad got burned by the boosters. The angle of the shuttle engines was great enough to walk the shuttle out over the ground, to cause those burns.  Dialed back the angles after that.  Compare first and later launch video.  Later videos, shuttle goes mostly vertical.  First flight, you can see very plainly as it walks to the right. ",
        "Maybe boosters in KSP 2  will look similar?",
        "Man I really wanted to go to Florida to see this.",
        "watched it live last night, absolutely crazy",
        "Great video Scott. Question, can you explain what appear to be blisters and or dents on the lower right area of the 2nd stage at time stamp 6min 53secs please?",
        "This flight profile is similar to how I liked to build my Kerbal rockets.  A sort of “stage and a half to orbit” design where a huge central core supported by drop away cheap boosters would take itself into or almost all the way from pad into orbit and the craft as a second full stage would just pop off with full tanks and go about its spaceflight.  Often this let me recover the vast majority of the main booster cheaply with aerobraking and parachutes.  Eventually with a little RCS and drone core action I got good enough at it to reliably land them back at KSC or just offshore.",
        "Regarding 5:57 \"force onset\" ... there is a technical term for this, \"jerk\", measured in m/s^3.",
        "Amazing....Thanks Scott.....        \nShoe🇺🇸",
        "Now we'll start to see a plethora of deniers, flerfers, conspiracists and all the other clowns and turkeys coming out of the closet.",
        "We were there for this liftoff it was different! Most of the sound went away from us and we saw the yellow steam from the boosters at first we thought the whole ship was on fire because we couldn’t see the top of the rocket in the dark but the news lady was announcing the speed and height so I knew it was doing fine. Really exciting to see live! Now We can’t wait for Starship, that’s going to be something I’m sure!",
        "One of my earliest, clearest memory was the Apollo 17 night launch, which I watched from the Banana River. It was so bright roosters crowed and fish jumped around in the river thinking it was morning, and it was so bright people could see it as far away as North Carolina. I'd hoped to get over to see this one in person, but couldn't, so I had to settle from watching it over near Tampa, and, unfortunately, I couldn't see a damn thing. I had wondered how bright it was compared to A-17, figuring, \"Must not've been as bright,\" so it's interesting to see that I'm wrong.",
        "Everyday Astronaut has better footage.",
        "pfff.. we all know that the Nikon P1000 can only be used to proof the flat earth",
        "Nea scout!!!!!",
        "\"Comet with two different tails effect\". Great video and analysis. Thanks for that!",
        "Slow and steady wins the race. Fly, Artemis, fly!",
        "Returns on December 9th? Cool, one day before my birthday. Was disappointed I couldn't watch the launch on live stream. (Had to work the next morning and needed to sleep.)",
        "When they came out of the hold, I could feel my heartbeat accelerating watching the minutes count down.  There is nothing quite like the first launch of a new system.",
        "We are approaching the Apollo 8 moment. \"Back to the future!\"",
        "Yooo NASA made KSP a real thing, this is epic :O",
        "Behold! The most expensive, most delayed, big and orange Caulk Rocket!",
        "I think that YouTube viewers should be granted occasional extra credits so that they can give a special \"double thumbs up\" to amazing posts like this!",
        "I was looking forward to a nice short video on the launch, and Scott Manley has done better than I had hoped, very informative. Now back to watching cat videos …",
        "I could literally see it’s launch through the clouds",
        "Is it bad that I kinda wanted it to blow up?",
        "This day is going to be remembered as one of those “where were you when” type of moments. What an exciting time for spaceflight.",
        "Probably lower risk job than pulling down packing on live 1500 PSI superheated steam lines, which we did fairly often.",
        "SLS was an amazing launch pretty impressive. Would it be possible with SLS to instead of using SBRs to use Falcon Nine Booster like for instance the Falcon heavy? Wouldnt it also lower the cost and up the reusability of the system?",
        "\"coverage wasn't great\" is an understatement. How you gonna capture the public imagination? No one watching spaceX?",
        "I was lucky enough to be at the Cape to watch the last Saturn V, Skylab, launch in 1973.  Somehow, my oldest brother, in the Air Force at the time, was able to wrangle up VIP passes (as best as I remember).  I still have a number of slides I shot of the launch, and also remember very well the sound, vibration, and the pressure.  We were hoping to see the 1st Skylab crew launch the following day on a Saturn IB, but that was delayed until repairs to Skylab could be developed.  Unfortunately, we went home before they launched.  I missed all of the Shuttle launches, but would very much like to get back to Florida one day to see one of the SLS or SpaceX rockets go up.",
        "I was 5 when Apollo 11 landed on the moon , now 50+ years later my kids are finally going to see a person walk on the Moon again!",
        "When do the boosters land?  Oh wait...",
        "I'm glad they didn't have to scrub the caulk rocket.",
        "It takes me back to Apollo, albeit uncrewed, with the boosters an added spectacle.",
        "So NASA is building those main engines again or they spend old stocks and they would need to certificate new ones for a next 10years?",
        "They almost got chaulk blocked",
        "Shuttle is grounded but we still get to watch her engines willfully thrown away.  This is not the space program we were lied to about in the 70s.",
        "my heart rate when they started counting from 10 minutes was CRAZY",
        "Thanks Scott. As always an excellent summary.",
        "I am pretty sure N-1 launches were brighter than SLS :)\n\nEDIT: God damn it, this man thought of everything",
        "NASA coverage was underwhelming and biased. Spacex puts on a better show.",
        "Is it just me or did the SLS get off the pad faster than the Saturn V?  I remember watching the moon launches as a kid and it seemed like it took longer for the Saturn V to clear the tower.",
        "Why are they calling it a rocket motor instead of engine or just a rocket?",
        "Thank you for attempting to make a Caulk Rocket joke. Very appreciated hahaha",
        "Wait.. this is done by the same people that tell me to stop eating meat & d4ive electric, to \"save the planet\", right?",
        "Looks like they didn’t make a bad kaulk-ulation, in the end?",
        "LOL, I liked your pun that really tickled my pickle! :)",
        "Scott omg I had butterflies, I got nervous and excited and cried a little at T-10 seconds.  At T-5 I got so loud my neighbors stomped on my ceiling and I yelled IT'S SO BEAUTIFUL.   Was such an amazing launch I am still elated.  I would love love love to get my hands on some of the telemetry.",
        "Beautiful! At 3:10 there's the beautiful still image so as the rocket engines just about clear the top of the tower. Magnificent photo.\nSo... here's a point that no one ever mentions. Not even Scott Manley. \nHydrogen combustion does not produce any visible flame. None at all. Hydrogen oxygen combustion produces lots of UV and a bunch of infrared. But not a tiniest amount of visible light. You can see this, ot not see it, in the many night launches of the space shuttle. The boosters produce prodigious amounts of flame against the black sky. But nothing visible comes from the rocket engines. ",
        "I'm between Orlando and Sanford, Florida, about 40 miles west of the coast.  It really looked like the sun was about to come up over the horizon.",
        "So, they failed to caulk block the rocket?\n\nSorry..  That was my best shot at the caulk joke..",
        "Light comes from Aluminum dust",
        "The “Aluminum Goose” … ONE FLIGHT….all gone but a little capsule!!! Our disposable society at work!! Launch in the middle of the night so all of us can watch our taxes go UP in Flames!! Way to go NASA!!",
        "Bought the launch tickets for my 9 year old's birthday back in September but were disappointed when the previous launches were scrubbed.  This time we decided to watch the tanking procedures to make sure there were no leaks before driving 3 hours across state, watched the launch, and drove 3 hours back.  Can't believe it finally flew!  My son has been obsessed with SLS since he was 4 so this was a special night for us.  Looking forward to Starship now!",
        "I couldn’t believe how fast that behemoth shot out of there. I’m sure someone knows the TWR but it looked faster than Saturn V",
        "NASA disabled comments. I love NASA and all they have done. This mission is already proving no human has landed on the moon.",
        "How is this the Brightest launch in history when It didn't even make the full seeable sky back to blue like other night launches?? \nMight be the biggest rocket but def not the brightest at all.",
        "Somewhere during the run-up to this, I missed that the core stage engines don’t start on lift off, which you can see in some of the sharper photos. So when do they start?",
        "I wish we had a view of the RS-25s igniting like we did with the Shuttles. I wanted to see those four mach diamonds form!",
        "I’m a tell you the monster rocket is yet to launch and it’s called super heavy and it’s in Texas. Maybe now NASA’s got this overpriced pie launched they’ll get out of the way of Elon musk of SpaceX",
        "The people taking the raw video, they must have a PhD in camera. Why won't my cell phone take video like that?",
        "It would be an interesting video to compare how fast this SLS cleared the tower compared to a Saturn V or even the shuttle.",
        "I'm just going to say it. The NASA launch coverage sucked.",
        "I was there. It looked an H-bomb went off. I thought they Kerbal'ed it. Pure amazing.",
        "\"You caulk that a rocket?\"\n\"Don't caulk to me about delays\"",
        "1 time usage, though.... business... as always",
        "All four engines contained parts that flew on STS-1 https://youtu.be/kvaz66nMEls?t=28396",
        "️‍️‍",
        "Hey Scott! I noticed yesterday when I was looking at footage of the SLS liftoff, when the SRBs ignited it produced quite a noticeable shockwave, which looked awesome firstly, but was that something that happened with shuttle as well? Let’s just hope none of the infrastructure was damaged ",
        "i set my alarm and dragged myself out of bed for this",
        "I’m honestly kind of disappointed that the Shuttle, which is a decade older than SLS, had more cameras than it. Missed opportunity. I mean Falcon 9 has live feed they could’ve done that on the boosters.",
        "\"Packing Nuts\", epic comment............",
        "I'd forgotten this is going to the moon.....",
        "Oh my gosh! The shot of the pressure waves refracting the moonlight creating those artifacts around the edge of the moon is just \nI-N-C-R-E-D-I-B-L-E-! \nPicture of the year goes to that gentleman. Bravo!",
        "The rocket went off half-caulked.",
        "At 3.10 the core rockets appear dark.",
        "Cool!!",
        "I saw the first launch of the space shuttle. I was there with my father who worked for Nasa. I was only 5 years old.",
        "Still gets me that they don't recover what they could recover, at least the solid rocket boosters.",
        "Don't kid yourself...they are \"Redshirts\"",
        "4:26 I've heard the term RTV since I was a kid in the '70s but only today learned what it means.  Thanks!",
        "I heard that they did send in a team of red shirts beforehand, but the only audio they got back was \"Captain, over here! I've found something! AIEEEE!\"",
        "\"Lock S-Panels into acceleration position.\"",
        "lol you can now add comedian to your C.V.",
        "The NASA coverage, or lack of proper coverage, was a disappointment. I kept waiting for telemetry and on-board video. But no...\n\nNASA should fire their PR team! Such an amazing launch and milestone that went without proper coverage.",
        "Got to watch it livestream. Worth the loss of sleep. Holy crap does that rocket get off the pad. Barely any lag from lit engines to movement upwards . We are the Artemis generation    ",
        "best ipad pro attachment yet",
        "Watching this live took me back to my childhood, watching the launch of STS-1 with my little brother, the excitement of seeing something really big, scary, and new blast off for the first time. When the hydrogen sparklers and water deluge began my blood was pumping, what a rush.",
        "Hi Scott!",
        "Hold on, at 2:37 surely these shockwaves aren't really affecting the moon? It must be some kind of light distortion, no? Genuine question.",
        "Scott...that Dad joke about \"Packing Nuts\" was actually really funny.",
        "It's a shame they didn't try and recover the boosters and the main stage. They would make amazing museum pieces. I know why they didn't but still.",
        "Did Scott say something about Orion visiting an asteroid? I thought all those plans had been cancelled when Bridenstine came in and redirected everything to the moon.",
        "Aside from the smell of stoners, the view from the park in Port St John was spectacular!",
        "I'm surprised they are not going  to reuse the solid rocket motors is there a reason why they are not reusing it.",
        "What is that fog/mist dumped at 0:11 from the left of the screen?",
        "I set my alarm to catch the launch after staying for as long as I could.  It was amazing to watch it on NSF.  \nSomething that was noticeable was the insistence on imperial measurements all the time.  Considering metric units would have been used when designing, building, launching, and flying SLS even now, it seemed a wasted opportunity not to include them in the commentary and updates.  It's as if NASA doesn't realise there is an entire world outside of America's borders.",
        "A surprise for certain but a welcomed one for sure",
        "I went to bed thinking I'd watch the replay in the morning, but I strangely woke up at 1:43 to find that it was literally about to launch. What are the chances?!?!",
        "Caulk rocket… that one got me!",
        "Beauty! Thanks, Scott!",
        "This vs Apollo would be interesting. Speed to moon diff, and is this really heavy? -as we know they had even a car with them in last Apollos.",
        "\"this rocket launch is the brightest rocket launch ever carried out, uh well, except for maybe the  N-1 that exploded\"  That's the quote!",
        "The Saturn 5 launched at night and blew this away for brightness and awe. Thse were the good days.",
        "I remember I started watching a little before the red team was called in. I saw it till just before the initial launch window's beginning. Then I, unfortunately, had an exam. I thought I'd missed the launch since the launch was initially supposed to take place smack in the middle of the exam... But when I turned on the stream once again after the exam, the rocket was sitting on the pad. Just because of the hydrogen leak, the launch was delayed by half an hour... I just couldn't believe my luck especially since they resumed the final countdown just around 2 minutes after I started watching again...",
        "thing I have ever seen. I couldn't even look at it due to how bright it was. For those people wondering whether they should go, the answer is a definite yes",
        "This launch got emotional all hard work we understand dedication for space exploring to the Moon and beyond...",
        "I’m so glad I got to see this in person. I’ll never forget it.",
        "This is why gas prices are skyrocketing. Fix this planet, stop trying to get off of it. ",
        "I started off being \"team space\" and wanting them this succeed, but ultimately I decided it would have been better if they failed.  This rocket is so bad we'd be better off if it had blown up and forced the USA to reconsider what tf we're doing. Starship and Dreamchaser are more worthy of our investment, IMHO.  This thing is the absolute worst.",
        "I watched the stream, it was epic",
        "It's amazing that they finally got it off the ground. If they would have canned this project 10 years ago and gave the money to space x, we'd be well established on the moon by now!",
        "If those are standard gopro 4s on the rocket, live streaming video, does that mean artemis has its own WiFi hotspot? I wonder what they called it",
        "7:34 Translunar injection mün",
        "Hmm...it's a bit ugly; not a looker like Saturn V",
        "I was watching the launch video and after the LOX vent closes, it switched to a camera shot of the main engines an there was some gas rhythmically pooting out of valves between the main engine nozzles.  What is going on there?  Why is it pooting?  I assume it was some kind of pressure relief valve but I'm curious to know more and I figured you were the guy to ask.",
        "\" The average cumulus cloud wighs around 1 million lbs \"\nkev dog : let me introduce myself",
        "That thing has an iPad and a couple of GoPros?",
        "And I thought wireless reception on my iPad in trains was awful.....",
        "I shudder to think what other small parts, on and off the rocket, are in the critical path for a launch. Guess it was a managed Ethernet switch which failed and they had to import the previously saved config file into the replacement?",
        "I would want to go dive after those boosters",
        "Shame all these motors got destroyed.",
        "Typical Star Trek move, sending in the redshirts into unknown danger. ",
        "I was a teenager during Apollo, and the Saturn V was such a beautiful, professionally designed and built rocket, unlike SLS, with its bondo like exterior. Who in their right mind would cover a brand new rocket with RTV. During my Air Force career, we used quite a bit of RTV, but never as an exterior coating. The NASA coverage was severely lacking. Let us hear the call-outs from Mission Control and Launch Control like we had with Walter Cronkite and Apollo. I was not impressed with the camera operators. Bring back the excitement of Apollo.",
        "There were a few shaky pictures of the launch looking down on the pad taken from the vehicle. I saw a high altitude vapour trail above the launch as well heading East, and assumed it was there to take pictures, but only saw footage of stage separation. I assume they were keen to stay away from the supersonic eddy shockwaves…",
        "I wish them well with this mission. But as I understand it, the per launch cost will be $4.2 billion! That is not  sustainable. So I hope this goes well for them but we need a better (cheaper) solution.",
        "The booster separation photo from John Kraus was pretty darn amazing!",
        "Sad to see they had to dump those main engines into the sea….. NASA what a waste.",
        "I think they had one engine failure during ascent.",
        "When the SLS first took off, considering how fast it cleared the tower, I thought I’m my head “Holy $*it, this is actually flying!!!”",
        "The flames were incredible.",
        "I saw the rocket all the way from my homeland in the Fiji Islands as it disappeared into the atmosphere ",
        "\"Well, except maybe the N1 that exploded\"\nwhich one.",
        "SpaceX raises the bar on integrated telemetry.\nNASA shrugs and stays lackluster.",
        "from what I understand before iss nasa wanted to build space station freedom a usa only science lab then came the idea of why not rocket the whole thing to mars; space launch system was suppose to be a build it in space spaceship station able to reach mars and beyond",
        "Heck Yea! I'm curious about the organ similes they sent along. Hope they come back okay so they'll send people again. So cool.",
        "the mlp came from my city",
        "So excited to see it finally take off!",
        "NASA really shanked the coverage of the launch.  It’s almost like not a single person from NASA has never watched a SpaceX launch.  Their broadcast coverage was simply horrible.  Hey Scott, do you think you could do better?",
        "Why are boosters not recovered? Seems so wasteful",
        "I just finished watching VOD of the launch. JE-SUS! No matter how long it will fly, this is one kickass rocket!",
        "My grandfather, bless his soul, used to tell us stories when we were young about when they started building the SLS.",
        "One incredible demonstration of the brightness was in Everyday Astronauts live video (9 hours long).  They showed some replays, and the one that starts at 8:24:16 in the video doesn't pan up with the rocket.  It shows a dark parking lot at night where they were filming from, and the rocket in the distance (3 miles away). The rocket takes off and all of a sudden everything is lit up and you can see people and landscape, washed out quite a bit until the flames leave the frame at the top. Then for a bit it just looks like  a strange daytime shot where the light slowly fades.  I wish they hadn't cut away, because I would have liked to see the slow fade back to the night.",
        "thanks",
        "I can't believe I'm going to say this but, it was worth the wait!",
        "You could faintly make out the distinct spherical sonic boom shock wave as it broke the sound barrier when it went through the cloud layer.",
        "SLS has ",
        "Why wasn't the SRB's recovered?",
        "Joke about H-1 really goat",
        "Oh, god, don't start with the CLICKBAIT titles",
        "Cheers Scott. Awesome Vid ",
        "what an amazing way of combating global warming! truly phenomenal.",
        "love how its going horizontal.",
        "Meh.  SpaceX does it better with less fanfare and for a hell of a lot less money.",
        "The videos of the launch from the countdown clock area were incredible, ive heard the term \"second sunrise\" but that defines it.",
        "SLS - Still Leaking Scott....",
        "Hi Scott, could you explain how on the live tracking of orion that it's speed is decreasing. When it launched it was in the 1000s of miles per hour. Latest tracking showing just a few hundred??\nIf there's anyone who can explain it to us lay folk then it's you!\nCheers",
        "Great shot @ 2:38 !",
        "I never thought I would see the day.  ",
        "Finally, SLS (Supposed to Launch System) rockets into space!",
        "I can't believe I slept through it. Oh brother! Anyway, beautiful images!",
        "At 6 minutes and 55 seconds into the video I'm thinking: \"That looks soooo Kerbal!\"\n\nYes, I know, it's actually the camera on the end of the solar panel that is oscillating as the engine fires but it's something that should be familiar to anyone who has played KSP.",
        "It won’t be the brightest for very long. Once Starship launches that will overtake SLS as the most powerful and brightest launch ever.",
        "I'd wager this was the first maiden flight of a new rocket to be launched at night.\nIf anything had gone wrong, the NASA engineers would've said, \"Gee, why did our rocket explode? Let's go to the footage... Oh, wait...\"",
        "As a person named Orion, I can say I'm glad NASA finally put me up in space. Now I'm in the sky twice and only once here on earth (any other Orion's are welcome to chime in lol)",
        "at 9:26 , an apple product finally get ot the space.",
        "As cool as night launches are, it probably would've produced better footage of launched during the day. We have to wait at least another year and a half now. Hopefully Starship launches by then.",
        "After the amount of money they spent on it they couldnt afford decent onboard cameras or decent telemetry I guess we have been spoilt with SpaceX coverage",
        "Is the reason why this SLS rocket lacked the onboard cameras and real-time launch telemetry data we've become accustomed to with SpaceX is that it was built so long ago?  If so, perhaps the later rockets will include the cameras and sensors.  I wonder if NASA will finally convert to using metric units?  At least they no longer use nautical miles.",
        "Absolutely outstanding seeing that big rocket go up! Great job by all involved!",
        "That ipad will be sent to the scrapper like all the millions of perfectly working Apple products people have lost the password for.",
        "It's a real shame that they did this at night. I'll never understand that.",
        "Scott, just ask a New Zealander to say caulk rocket, job done.",
        "Scott, Apollo 17 was also a night launch with 5 F-1 LOx/Kerosene engines and their brilliant plumes, so which was actually brighter? Good video as usual - Ken",
        "The Everyday Astronaut team made a stunning stream... 4K and internally up to 12K mad the close up video so steady...",
        "Amazing clips from Reds Rhetoric using the Nikon P1000.  Surprised it was even better than NASA's plane footage?!",
        "I set my alarm at like 7am but it was still T-15 minutes. I kinda feel asleep with the stream running on my phone still running. But the ignition woke me up again, so I watched the whole launch at a 30second delay",
        "Finally!!  Now they can allow SpaceX Starship to fly.",
        "Pretty amazing that they got it off the ground.",
        "i was convinced SLS would never fly. thankfully i was wrong.",
        "This was all amazing stuff",
        "Yep twice in a lifetime o was 6 or 7 the first time we went to the moon , so I'm in  and yeah I'm 60 now I still get CHOAKED up with pride everytime I watch a launch....",
        "What a colossal waste of a rocket.  Why aren't the solid rocket boosters recovered?  After SpaceX, anything that isn't reusable is just money down the drain (or into the ocean).",
        "Im very proud.  I have parts on this rocket.  And was biting my nails every time they scrubbed.",
        "True, it was bright, but Apollo-17 was just as bright. The SRBs are reused STS boosters, they only added 2 more segments to each booster. Correction: The leak was not on the rocket, it was actually on the lower section of the mobile launcher",
        "I almost felt nostalgic, well I did, just a little.",
        "Atreus going: Nista! Into dead silence while shooting a dead enemy is one of the funniest clips I have ever saved into my camera roll",
        "Now that’sa rocket, whatever Spacex is launching is a completely different animal",
        "Note as Artemis progresses the cameras do not resolve the star field. Why? It must be beautiful. At least one camera not dedicated for this? Why?",
        "Is the capsule coming back?",
        "Woooo!",
        "My father is on the team that built the leak detection system, and he personally replaced the turbo pump on the mass spectrometer the night before the launch. Tanking proved to be a challenge as well. LH2 was leaking at greater than 4% and the red team came in to save the day! I'm so proud of my dad and his team for their knowledge and passion. I cried watching liftoff from across the river. I know many don't understand the significance of this mission, but so many amazing advancements in space travel and exploration will come of this.",
        "Ho hum",
        "Hi scott (or anyone who knows the answer), I have a question as someone who is not really an expert in the rocket business.\nWhy is nasa both building their own moon rocket while simultaneously funding the one from SpaceX? What does nasa expect their rocket to do and what do they expect from Starship? It wouldn’t make much sense to have two rockets for the same job no?",
        "I was surprised to see it finally fly last night. Glad it went off without a hitch, so far.",
        "RS-25 mach diamonds always make me happy.",
        "Ba dum tis",
        "Cool to see this vintage stuff in action! May be once we will finally be able to see F-1 engines working. Also this pretend to be the most expensive retro project ever built :)",
        "As an amateur Curb Miner, I can only commend the scale of this scavenger-hunt, space dumpster-diving-powered endeavor! ",
        "damn seeing Earth is nutzzz ",
        "Go $4 bilion Go. ️️",
        "As seen from 150 miles away to the south, on a clear night sky, that was one cool very visible rocket! Worth staying up so late to see it.",
        "I'm so pissed I missed this launch that I'm just now unbutthurt enough to watch this",
        "Excited about the launch, but with how much they spent vs. space X, with all the problems, it is undoubtably embarrassing for NASA. How did they spend that much money while re-using old parts, and putting Go Pro 4's and a damn ipad in the cockpit?",
        "At 4:09, the hydrogen valve issue reminds me of Apollo 11’s launch and the similar hydrogen valve issue there as shown in the excellent “Apollo 11” (2019).",
        "Great looking launch, bit thin for info I watched the feed on",
        "Biggest Launch of the Century\nPublic: \"Do you have onboard cameras?!?!\"\nNASA: \"I mean we had a couple GoPros we attached to it.\"\nPublic: \"What...\"",
        "I witnessed the launches of the last three Apollo moon shots from the vicinity of the cape, 15 from Cocoa Beach, 16 & 17 from Titusville.  All were unforgettable experiences.  But, especially Apollo XVII, the only Saturn V launched at night.  SLS may have been brighter due to the SRBs (not a fan of SRBs), but the Saturn V also lit up the night sky like sunrise.",
        "I don't know why but after seeing this video only one thought comes to my mind:",
        "How powerful this SLS rocket compared to Saturn V?",
        "its depressing how slow nasa is though. Manned flyby in 2024 and putting a man on the moon on 2025. By then Elon would have already someone on mars or close to it. While For All Mankind was progressing fast with all that budget.",
        "Rock-et Out, with your Caulk Out!",
        "Can someone explain why it’s taking so long to get to the moon compared to Apollo?",
        "Great launch, but from a broadcast perspective, we've been spoiled by the quality of Spacex launches. Onscreen, Spacex has fast and clear telemetry data in nice clean modern metric units. The SLS broadcast looked a bit 80's in comparison, with the only telemetry being called out verbally every 15 seconds or so, a figure of x miles downrange was all on offer.",
        "and all this cost HOW MUCH for a one-shot deal?  How 1960's of them.  What a joke.  They launched a dinosaur.  NOT impressed.",
        "NASA's launch video was definitely less informative than SpaceX's. No speed or altitude displays, &c.",
        "3:55 \"Not red shirts, a red team\" what's the difference? :P",
        "Rocket Launch. Broca's area, or the Broca area is a region in the frontal lobe of the dominant hemisphere, usually the left, of the brain with functions linked to speech production.",
        "WE LOVE NASA!!! WE LOVE ORION AND SLS! NOW SPAM THE COMMENTS WITH THIS BC WHY NOT",
        "Standing next to a giant rocket full of propellant sounds like a very Red Shirt thing to do, just accept it Red Teams are Red Shirts.",
        "The intensity of the brightness watching live just can't be replicated on any video I have ever watched. The intensity of the light from those SRB's to me is comparable to what you see in an electric Arc welder.",
        "So what happens when they run out of second hand bits to build spacecraft out of?",
        "more affordable LMAO!!!! Honestly I hope this antique never flies again. It's such a waste of money. Just have starship do the whole thing.",
        "Cool, it went off according to plan. Now how long do you suppose it'll be until they have another one ready to launch?",
        "KSP 2 cant come out soon enough!",
        "I got the honor to go to the employee viewing sight to watch it and it was awesome",
        "That \"Caulk Rocket\" line really raised my perigee, ifyouknowwhatimean.",
        "Does anyone know why there's a huge discrepancy between the proposed velocity after TLI burn (40,000KMH) and the velocity currently reported by NASA as about 4000MPH? 4000 doesn't sound right to me, based on the Apollo missions.",
        "“…the brightest launch ever carried out, uh well except for the N1 that exploded.” ",
        "Cool",
        "no operational onboard cameras or telemetry data. in other words spacex is still the best launch provider on the planet from a purely observational point of view. Shouldn't be surprised that this antique POS doesn't have cameras.",
        "Launch was awesome but NASA needs to take a YouTube master class from Scott Manley!",
        "8:35 What I wouldn't give to be that cleaner...",
        "I was in north Florida Jacksonville and it was amazing I could not believe my eyes",
        "I've been waiting for this since the last shuttle launch and was not disappointed.",
        "It’s sound and light was surreal and humbling. So glad I could witness it ",
        "I had the privilege to be at the Saturn 5 Apollo center for the launch! Thank you Bill! It was amazing to feel and hear that rocket from 3.5 miles away!",
        "I love how Nasa still uses an English Electric Canberra as the high altitude filming platform. I wonder how many space launches it has seen?",
        "We've got a moon rocket again! ...after nearly half a century.",
        "space  is happy",
        "Increase pollution, achieve nothing.",
        "I remember getting on Twitch in the morning to see what's up, then see this weird Channel (Szyzyg) that did something with rockets and had Scott as a profile picture. I had time and I was intrigued, so I checked it out. I stayed for the whole launch because Scott's personality is just addicting :) It was really cool to watch",
        "In an interview on NasaSpaceFlight they said that there are some parts on this SLS launch from STS-1....yes the FIRST launch of the Space Shuttle!",
        "It was so surreal, watching a KSC lawn ornament take off! Joking aside, I'm insanely impressed that the first SLS launch went as well as it did, scrubs aside. I'm starting to believe that NASA is going to be able to take us back to the Moon.",
        "\"Torque is cheap!\"",
        "NASA sure know how to dump shit in our oceans....lol",
        "@2:41 Behold, the *KRAGLE*!!!",
        "Nice recap Scott!",
        "I was surprised to see how fast this thing cleared the tower compared to the Saturn V, or is this just my imagination?",
        "You're even better than a unicorn because you're real.",
        "I watched it from the river by my house. Lit up the night sky. We almost thought it had exploded until we saw the fire trail behind it. It was incredible. Glad i stayed up till 2am to watch it",
        "I guess that a RADAR which is critical to launching should have had redundant, diverse hardware paths so a failed switch, cable, transceiver, etc. wouldn't hold up a count down! That's a pretty standard practice for critical (or even just sort-of-important) systems. But there I go thinking again.",
        "It's too bad they beat starship, because now they at least get to hold the record for a short time.",
        "The company I worked for supplied critical temperature sensors on this rocket.  It has been a long road to this launch since the company was awarded the contract in 2013.",
        "Was hoping it would fail to launch.\n\nDon't get me wrong, I'm one of the biggest supporters of NASA, but it's time they got out of this part of space exploration.",
        "Good thing the Red Team didn’t talk about Double Decker Cheeseburgers.",
        "I'm glad it didn't go boom. The video coverage by NASA was awful. Don't get me started about that pathetic tracking camera performance. You can tell NASA hasn't launched a rocket in many decades, nor have they been paying attention to other launch providers and their level of video production.",
        "I like how you called the comments out on this, also YES! If they listened to you about the bamboo, they might about the minecarts",
        "All that crazy footage and not a single live camera from the core stage.",
        "Thank you, Scott for getting me into KSP way back in the early 2010’s!\n\n\n\nThrough that game - I have learned so much about rockets and playing with many realism mods, I’ve grown to understand why flight plans for rockets are the way they are. I also understand things like why solar panels have to be folded back in for burns and other such small details through a combination of KSP and also being a car mechanic (understanding stress on components and various other things). It’s so liberating to be able to follow along with something like Artemis and understand what’s going on every step of the way.  I don’t think I could’ve had that without your KSP tutorial videos back in the day. Thank you again!",
        "Watched it from my front yard.  My only regret in life was not being born early enough to see a Saturn V launch.  Now I feel better about it.",
        "Andy Weir rides again.\nYippeeee!",
        "Oh the pun-ishment! ",
        "5:21   <<<   Funny to watch Artemis flying away from its target.",
        "I don´t know if you caught that moment when the commentator confirmed  (on an accidental open mic) that bolts on the valve were \"visually loose\"  ",
        "I was surprised by just how fast it took off.  I'm not sure why but I was expecting a much slower rise from the ground.  Watching it live it felt like something had hit the entire rocket upwards.",
        "I am happy to FINALLY see Artemis I on its way and I hope everything goes smoothly and that they work out a lot of the kinks with the SLS for Artemis II.",
        "4:10 they did this on the Apollo 11 also right Scott? (if I recall correctly)",
        "I was born, lived a long life, and then died of old age, then reincarnated as the current me. This is how long I've been waiting for this moment.",
        "Honestly had the chills once I saw us clearing a minute left in countdown and couldn't believe my eyes when I saw the main engines fire and stay on. Really thought this would just be another scrub.  What an awesome thing to have been around for, catch me flipping moon tickets on StockX in a few years",
        "How did their booster landing go?  They didn't stream it.",
        "Not going to lie. I got a little emotional watching this live.",
        "Thank you sir as always so glad you got too see the launch ",
        "The launch of Apollo 17--almost exactly 50 years ago--was also a night launch.  The Saturn V with it's RP-1 and LOX first stage was pretty bright, too!  https://www.youtube.com/watch?v=nCQ1uVad5EI",
        "I was in florida for launch and it did become daytime.",
        "I remember first coming to this channel for Kerbal Space Program tutorials and hope that when Kerbal Space Program 2 comes out I can depend on great tutorials again. But I also love what this has become as well. Love this channel!",
        "While I am happy to have a new craft, this just feels like a sequel/repeat.  This doesn't feel new or advanced - maybe even a step backwards.  That part saddens me.I would have rather seen a pair or trio of reusable Falcons carry components and a true native and maybe reusable spacecraft be built for lunar journeys be assembled.",
        "Scott. This is the best coverage I have seen of the launch.  Thank you loads :)",
        "Why did bits land in Poland?",
        "i saw this in person from about 9 miles away from launch, it was gorgeous and really just lit up the sky like the sun. it was beautiful to see, its the first one ive seen that close in all my time living in florida, for some reason.",
        "I know, it's 2022. Let's build an old rocket for 4 billion dollars and then toss the 17 story boosters into the ocean and not reuse a single piece of it",
        "\"This is the brightest rocket launch in history except for the N1 that exploded.\"\n\nNothing has so perfectly summed up the modern spaceflight experience. Phenomenal human achievement punctuated by the other one that violently disassembled itself.",
        "Why don't I ever get notified from this channel??\n\nI check every time, subscribed, and \"all\".  I've been waiting for this video and notifications never came.",
        "WB-57 videos? So image really was \"Photographed from a Canberra\"?",
        "This video made me absolutely giddy with excitement! And of course I busted out laughing several times, especially the part about the red shirts! Just love this channel, keep up the good work man!",
        "Dear Mr. Manley,\nYou are not fooling anyone.  Just look at this SLS \"booster\" with those \"solid fuel boosters\"... Nothing was launched yesterday....  You witnessed the upcoming trailer for Kerbal Space Program.  To those of you in Florida (and Houston's Marshal Spaceflight Center):  Who are you going to believe?  Me or your lying eyes (and ears). ",
        "5:20 Speaking of cool people on, I really enjoyed the moon board segments with Dan Huot, he had some awesome explanations, and those models/visualizations were really nice.",
        "interesting that when scepticism about the current narrative is at all time high they \"go back\".  and people believe it.",
        "8:47 Let's hear it for the lady changing the trash bags. Another unsung but necessary employee in any office or operations setting.",
        "“Brightest rocket launch ever carried out, except for the M1 that exploded”",
        "It is a fine achievement to make something like a rocket work once it launches. How many have we seen that just don't.\n\nHowever, it's just that it's no step forward. I looked at that capsule and compared it to dragon and I know they are doing different jobs, but think mmmm.",
        "You could see all the way over in Tampa, very cool.",
        "Hi Scott I loved the inclusion of the amateur photographers’ videos and photos. One thing you mentioned however sparked my curiosity - If Orion has been developed since 2005 when was its first test flight? If it was any where near 2011 why didn’t they use Orion as an interim spacecraft while Space X and Boeing were developing there’s? It would have been a better alternative than having to rely on the Russians. Thanks - I love your videos. You are the most credible of all of the space commentators! ",
        "December 9th for the return to earth re-entry.  It will arrive back after the December 6th Senate Run-off ballot to decide the Georgia senate race. To live in interesting times?",
        "\"except the N1 that exploded\" ",
        "I doubt that this was the brightest launch, because I remember seeing a night time launch of the shuttle, and it lit up the skies all the way to Charleston, SC. It was around 2002, and my son, who was 4 at the time, didn't understand what was making the bright light, but loved watching it.",
        "Turned on NASA TV last night around 11 PST to see when the launch was going to happen. Surprised that it already had (me thinking it was going to be during the day). Fortunately you could scroll back the NASA live feed to watch everything.",
        "next launch they should put the Senate Launch System name to the test and actually put the entire senate on top of it.",
        "Amazing, NASA put together the worlds fastest used parts rat rod! I stayed up last night through the delay, I'm glad I did to see the launch live. Spectacular!",
        "Been waiting for this to happen for 50 years.",
        "I know touch screen ship controls look really cool and all, but I worry about what would happen in an Apollo 13 type of situation, where condensation formed on interior surfaces due to the cold.  I have had to use a tablet outside in the rain before, and it does not take long for water on the screen to cause the tablet to have problems.  It confuses the water for being touched and it acts like it is being touched everywhere, causing it to either not respond to deliberate touches or go nuts and do lots of random stuff.  I'm sure many smarter people than I have taken this into consideration.  Maybe there is a roll of paper towel stashed under the engineer's seat.  :)",
        "No matter what happens, how old I get, what happens in my life, who comes in and out of it, these videos will always be here for me, and for all of us. Techno was a light that shone brighter than any other out there, and he was a real beacon of hope for many of us. I'm just very glad that he's resting now, and doesn't have to suffer anymore. Props to you, Techno, and as the saying goes, \"Technoblade nevah dies!\" =(",
        "Outstanding. What a colossal waste of money. None of it re-usable, just a one-and-done device. Clearly a high profile way to keep some pockets full.",
        "One helluva broomstick!! ",
        "I was a bit irritated that they used a close up camera for ignition during the live feed. I'm looking forward to other angles farther out so we can see the big picture. As an Apollo kid who remembers the Mighty Sat 5, I half expected the SLS to mirror it's agonizing slow lift off. My jaw literally dropped off when that thing left the pad virtually instantly. It was so fast, I now have a little concern for Astronauts who will fly in it. The G-force must be insane.",
        "Pfft nice try Scott \"shockwaves making the tears\" we all know it's vibration making the hologram wiggle",
        "I wonder if we'll get a \"live\" video from the Orion during any of this mission.  Imagine having a video feed of the entire ride as it's happening.  Course corrections, lunar insertion, see the moon get larger, eventual return to earth, etc.",
        "During this critical part of the mission (at 8:39), are they really emptying out the trash containers at each workstation?   I'd think that access would be somewhat more locked down..",
        "I wonder why the on-board camera aspects were all stretched.. like watching a standard definition picture on a HD TV... were they using 1990's tech there too? ",
        "Scott, an eternity feels like an understatement. As I continue in my life in engineering and thermodynamics it has always felt that we would never return to the Moon; the Apollo missions so, so far in the past. JWST and now SLS Artemis mission, it feels like we have finally, and intensely, continued in our destiny towards the stars.",
        "Yes, that WAS terrible.  You do good ones sometimes, Scott, but this was not one of those times.",
        "Awesome launch loved that ignition",
        "Yep. Launching all those left-over space shuttle parts into orbit sure looked and sounded impressive. Good for them.",
        "It's disappointing that as much time as they had and money to prepare they didn't have a freaking IMAX production level coverage of this launch",
        "If you count this as starting with Project Constellation, then this is 18 years in the making.",
        "NASA are decidedly underwhelming with their camera coverage compared to space x.",
        "I was on the A1A causeway about 15 miles away to view this.  It was an incredible sight to see!",
        "As awesome as the launch was NASA totally missed the boat again. They have a broadcast network that could have been used to show the moon growing closer and the earth fading in the distance. Instead, we get some telemetry and simple graphics, and a few shots of the solar panels and the side of the space craft. With public support waning they could have sparked public interest. They should have hired a cinematographer to help them highlight this great achievement. There could have been cameras on the front, back and inside the spacecraft so the public could watch in awe as all this unfolded. The US spends almost twice as much per year as all other space faring counties put together! The public should get to see what their hard-earned tax dollars are funding. It's as if they are purposely hiding something. I don't like conspiracy theories, but it does beg to question why they would not televise any of the trip outbound to the moon. They say there will be live coverage Monday morning starting at ",
        "My wife and I watched the rocket launch from our front door about 60 miles from the pad. All the clouds between us and the launch were illuminated as if in a sunset, and that was even before the rocket lifted above our neighbor's house. The flame itself was radiant and so incredibly bright, I've never seen one like it.",
        "I honestly thought Artemis 1 was never going to launch. Boy was I wrong. Now we have to wait for December 9th when the Orion spacecraft returns from the Moon. After that, we'll need to wait until 2024, which is when Artemis 2 launches the first crew to do a lunar flyby. Finally, after that we'll need to wait again for 2025 which will be the year Artemis 3 launches. Artemis 3 is supposed to be the mission that will send crew to the Moons surface, and be the first one to do that since Apollo 17.",
        "At last it has finally launched. Now I can't wait for Elon to smile at them and say hold my beer.",
        "Torqued to the German spec of Guten Tite!",
        "it was 100% worth staying up for the launch of SLS. seeing it launch was. genuinely amazing",
        "Yeah, I keep watching the video. I woke myself up to watch it then woke up and go did that actually happen?? Then I watched it again, anyone else get a bit emotional watching that?? Unexpectedly I might add? Not a bad thing but man, wasn't sure if I would ever see something like that in my lifetime, I'm just like holy s*** they actually f**** did it!! It must have triggered something subconsciously from when I was a kid, when I was little the only thing flying was the Space Shuttle and yeah, I was also so happy for NASA everyone involved, and just absolutely Blown Away the Everyday Astronaut team's footage!!  I mean wow and wow and wow! I know there's lots of other good footage out there but I was so happy for him and some of the other guys out there that were all involved with making incredible high resolution tracking shots and such, and pulling it off!",
        "What is that bin with bed sheets in the middle of the control room? Did they have a sleep over?",
        "James Webb and SLS less than a year apart! What a great time for exploration",
        "I think its strange that a 10 billion dollar rocket has stone age camera’s on board",
        "4:46 don’t worry, blue origin has already developed a caulk rocket",
        "Why are the boosters not recovered?",
        "given artemis lit up the whole sky at launch I wonder if there was another artemis launch now would it be visible from where  orion is now between earth and moon?",
        "Well  lets get caulking",
        "Red Crew is twerking packing nuts, but Blue team has the flag!",
        "This is the most excited we’ve heard Scott in years.",
        "we're going to the moooooooon"
    ],
    "comments_disabled": false
}