{"video_id": "7GmR5mfD2wE", "comments": ["Loading up an upper stage with cube-sats so you can squeeze more science out of a single launch is absolutely Kerbal and I am here for it.", "My father is on the team that built the leak detection system, and he personally replaced the turbo pump on the mass spectrometer the night before the launch. Tanking proved to be a challenge as well. LH2 was leaking at greater than 4% and the red team came in to save the day! I'm so proud of my dad and his team for their knowledge and passion. I cried watching liftoff from across the river. I know many don't understand the significance of this mission, but so many amazing advancements in space travel and exploration will come of this.", "Bought the launch tickets for my 9 year old's birthday back in September but were disappointed when the previous launches were scrubbed.  This time we decided to watch the tanking procedures to make sure there were no leaks before driving 3 hours across state, watched the launch, and drove 3 hours back.  Can't believe it finally flew!  My son has been obsessed with SLS since he was 4 so this was a special night for us.  Looking forward to Starship now!", "My wife and I watched the rocket launch from our front door about 60 miles from the pad. All the clouds between us and the launch were illuminated as if in a sunset, and that was even before the rocket lifted above our neighbor's house. The flame itself was radiant and so incredibly bright, I've never seen one like it.", "We were there for this liftoff it was different! Most of the sound went away from us and we saw the yellow steam from the boosters at first we thought the whole ship was on fire because we couldn’t see the top of the rocket in the dark but the news lady was announcing the speed and height so I knew it was doing fine. Really exciting to see live! Now We can’t wait for Starship, that’s going to be something I’m sure!", "I was lucky enough to be at the Cape to watch the last Saturn V, Skylab, launch in 1973.  Somehow, my oldest brother, in the Air Force at the time, was able to wrangle up VIP passes (as best as I remember).  I still have a number of slides I shot of the launch, and also remember very well the sound, vibration, and the pressure.  We were hoping to see the 1st Skylab crew launch the following day on a Saturn IB, but that was delayed until repairs to Skylab could be developed.  Unfortunately, we went home before they launched.  I missed all of the Shuttle launches, but would very much like to get back to Florida one day to see one of the SLS or SpaceX rockets go up.", "I don't think anything will ever top the JWST launch in terms of \"holy crap it's moving off the pad, this is happening, this is real!\" but this was right up there. Incredible sight. For all the flaws of SLS and Orion they at least have something worthwhile to show for it.", "Almost exactly 50 years I've waited for this! No way would I have guessed back then, as a 19 year-old, that that I'd be 69 before a human-rated space craft again headed for the moon...", "Was incredibly lucky to see a space shuttle launch in 1993, after it was scrubbed the first night. What an experience, one I'll never forget.", "Oh my gosh! The shot of the pressure waves refracting the moonlight creating those artifacts around the edge of the moon is just \nI-N-C-R-E-D-I-B-L-E-! \nPicture of the year goes to that gentleman. Bravo!", "So glad to have caught this live. So much drama too haha... I was expecting a countdown 10..9..8.. etc. but that didn't happen. We had the numbers on screen, but with all the issues leading up to this launch, it was really just a ten second dramatic pause, and then out of nowhere WHAM! the main boosters lit and off it went. So awesome. So excited about the future of aerospace!", "it was 100% worth staying up for the launch of SLS. seeing it launch was. genuinely amazing", "That Red Team seriously needs a big payrise. I almost thought it was gonna be postponed to the next launch window(though not necessarily a naysayer myself), and I believe many thought the same. The Red Team single-handedly(more like quardruple-handedly) saved the truly historical night. I was asleep(in London) when it actually launched, but upon seeing the footage I was like:\"Wow, it happened just like that!\"", "Watching this live took me back to my childhood, watching the launch of STS-1 with my little brother, the excitement of seeing something really big, scary, and new blast off for the first time. When the hydrogen sparklers and water deluge began my blood was pumping, what a rush.", "I witnessed the launches of the last three Apollo moon shots from the vicinity of the cape, 15 from Cocoa Beach, 16 & 17 from Titusville.  All were unforgettable experiences.  But, especially Apollo XVII, the only Saturn V launched at night.  SLS may have been brighter due to the SRBs (not a fan of SRBs), but the Saturn V also lit up the night sky like sunrise.", "Thank you, Scott for getting me into KSP way back in the early 2010’s!\n\nThrough that game - I have learned so much about rockets and playing with many realism mods, I’ve grown to understand why flight plans for rockets are the way they are. I also understand things like why solar panels have to be folded back in for burns and other such small details through a combination of KSP and also being a car mechanic (understanding stress on components and various other things). It’s so liberating to be able to follow along with something like Artemis and understand what’s going on every step of the way.  I don’t think I could’ve had that without your KSP tutorial videos back in the day. Thank you again!", "I live about a little over an hour north of KSC- The view from my back patio was amazing... it really did turn night into day even this far north and probably further. God Speed Artemis!", "That launch was absolutely amazing, watching it lift off was spectacular. Glad I set my alarm for it.", "Have to say, I really was expecting SLS to be delayed again. \nI felt better when I saw it actually did launch and got to orbit.", "Kudos to my fellow MPS coworkers for a  flawless performance. It took a tremendous amount effort from our small team to make this happen. You should be very proud.", "Just came from rewatching it. So unbelievably incredible. Can't believe they did it. Go NASA, go SLS, go Orion, go Artemis! What an amazing rocket!", "I watched from banana creek and it was incredible. It legitimately turned day for over 15 seconds and the sound came blasting in seconds later. Has to be the most incredible thing I have ever seen. I couldn't even look at it due to how bright it was. For those people wondering whether they should go, the answer is a definite yes", "The company I worked for supplied critical temperature sensors on this rocket.  It has been a long road to this launch since the company was awarded the contract in 2013.", "I was lucky enough to be up when it launched. It was a very emotional experience for me. On one hand, we're going back to the Moon, baby! On the other, there's the fact that several dependable pieces of previously reusable tech were taking their last stab at the sky. Those primarily being the SRBs and the Space Shuttle main engines used on the core. In a way, it was kind of like the previous era was handing off the torch to the next and literally going out in a blaze of glory. So, yeah, many strong feelings were had while watching that candle being lit. And the sound... Even through the tiny speakers, you could hear how different and powerful this massive launch vehicle was. I wish I was there. Sadly, I'm now disabled (among other medical issues), so I'm afraid I won't be making any trips down to see any future launches of this amazing system. ", "What an incredible launch.  So happy I made the 18 hour drive to see it lift off in person.", "That Red Team is definitely pretty badass. Thanks to those guys we got a launch last night.", "When the SLS first took off, considering how fast it cleared the tower, I thought I’m my head “Holy $*it, this is actually flying!!!”", "Thanks for putting this together so quickly, Scott. Being on the west coast it wasn't too horribly late to stay up and watch the coverage. When that thing lifted off, I literally moved away from the computer because it was such a monstrous amount of energy coming through my 27\" iMac.\n          But boy does NASA need a bigger budget for their live TV broadcasts. It was laughably bad. They'd cut away to some guy who was going to tell us about some neat science-y thing and the connection would drop halfway through his introduction. There was random echo, long stretches of just a splash screen, the director at the Cape couldn't find a working microphone... I get that they probably don't want to waste taxpayer money on such trivialities, but if they're going to even try to put on a professional broadcast then either do it right (especially given the standard SpaceX has set), or just don't even try.", "I watched this launch from the opposite coast, in Cape Coral Florida. It was..unimaginably bright. I’ve seen so many rocket launches. None have lit up the sky orange like that. None were that big. It was easily 5x bigger than what we usually see. It had to be 2x-3x brighter than even the Parker solar probe, both I could watch go all the way to the horizon. It was incredible.", "This flight profile is similar to how I liked to build my Kerbal rockets.  A sort of “stage and a half to orbit” design where a huge central core supported by drop away cheap boosters would take itself into or almost all the way from pad into orbit and the craft as a second full stage would just pop off with full tanks and go about its spaceflight.  Often this let me recover the vast majority of the main booster cheaply with aerobraking and parachutes.  Eventually with a little RCS and drone core action I got good enough at it to reliably land them back at KSC or just offshore.", "This feels incredible. It's almost like something from KSP or something, where you prepare to go to the mun. Although this time, we're coming with a bit more knowledge", "Got to watch it livestream. Worth the loss of sleep. Holy crap does that rocket get off the pad. Barely any lag from lit engines to movement upwards . We are the Artemis generation    ", "It's nice to see the SLS rocket flying but it's a shame that the engines are lost. Overall it's a wonderful piece of engineering.", "I am happy to FINALLY see Artemis I on its way and I hope everything goes smoothly and that they work out a lot of the kinks with the SLS for Artemis II.", "Some of those launch pictures people took are truly stunning. Thanks for the video Scott!", "When they came out of the hold, I could feel my heartbeat accelerating watching the minutes count down.  There is nothing quite like the first launch of a new system.", "i saw this in person from about 9 miles away from launch, it was gorgeous and really just lit up the sky like the sun. it was beautiful to see, its the first one ive seen that close in all my time living in florida, for some reason.", "No kidding how bright it is. I’m on the west coast of Florida and the rocket launched on the east coast. For context that’s 128 miles almost exactly from where I am diagonally. I could see it clear as day. Extremely bright. It made all the entire sky glow before I could even spot the rocket. I could even see it’s tail and it going down range from me as it left the atmosphere. Unforgettable experience and can’t even imagine what it was like for those spectating at the space center. ", "Scott, you showed some really beautiful shots of the launch.  Thanks and thanks to the folks who took them!", "Watched it from 60 miles away and can confirm: It was surprisingly bright. Had all fingers crossed and thumbs pressed.", "After all those years... they finally did it. Good luck Artemis mission!", "No matter what happens, how old I get, what happens in my life, who comes in and out of it, these videos will always be here for me, and for all of us. Techno was a light that shone brighter than any other out there, and he was a real beacon of hope for many of us. I'm just very glad that he's resting now, and doesn't have to suffer anymore. Props to you, Techno, and as the saying goes, \"Technoblade nevah dies!\" =(", "such a great launch. looking forward to the rest of the mission now :) thanks for the vid Scott", "It's a shame that some people wanted this to fail. Fantastic photos.", "Absolutely outstanding seeing that big rocket go up! Great job by all involved!", "I wonder if we'll get a \"live\" video from the Orion during any of this mission.  Imagine having a video feed of the entire ride as it's happening.  Course corrections, lunar insertion, see the moon get larger, eventual return to earth, etc.", "I was surprised by just how fast it took off.  I'm not sure why but I was expecting a much slower rise from the ground.  Watching it live it felt like something had hit the entire rocket upwards.", "Listening to the velocities on the launch commentary, I have to say that I believe that SLS achieves higher velocities quicker than any other launch system that I'm aware of (hello, 8 million lbs. of thrust!).  Would love to know what kinds of G forces that the occupants will experience.", "I only just caught this live as I woke up (UK based) about 5mins earlier. What struck me was the speed with which the vehicle cleared the tower - given its size I was expecting a Saturn V like ponderous move heavenwards.", "Astounding footage!\nI just hope that, if it flies again, they'll launch in daylight (as they typically do for maiden flights), because I'm somewhat more fascinated by seeing a vehicle in flight than just its exhaust plume.\n(Was kinda hoping to see a vapor cone at Max Q.)", "Honestly had the chills once I saw us clearing a minute left in countdown and couldn't believe my eyes when I saw the main engines fire and stay on. Really thought this would just be another scrub.  What an awesome thing to have been around for, catch me flipping moon tickets on StockX in a few years", "I had the privilege to be at the Saturn 5 Apollo center for the launch! Thank you Bill! It was amazing to feel and hear that rocket from 3.5 miles away!", "I just finished watching VOD of the launch. JE-SUS! No matter how long it will fly, this is one kickass rocket!", "This was the first time that I watched the launch.  It was truly amazing, beautiful, powerful and fun to watch!!  Thank you for the video!!", "After 14ish years of working on it, was great to see it finally launch.", "I stayed up and watched it last night. The people that engineer these things are the best any of us can hope to be. You go people!", "I was working (as a driver) last night so had to miss it. But, I've just watched it on Nasa's youtube channel, and I got to go immediately here to watch your take on it, Scott. Instant gratification!\nGo SLS! Go NASA! I'll be doing a road trip with my friends from California to Florida for the first crewed (Artemis 2?) launch!", "Scott, i watched it from 1 hrs south of Miami !! And yes it was Stunningly bright !! The engine trails from the SRB,s covered like 1/6th of the night sky... from like 400 to 450 miles away !! Stunning !! Thanks Scott for all you do !!", "James Webb and SLS less than a year apart! What a great time for exploration", "I was on the A1A causeway about 15 miles away to view this.  It was an incredible sight to see!", "I remember first coming to this channel for Kerbal Space Program tutorials and hope that when Kerbal Space Program 2 comes out I can depend on great tutorials again. But I also love what this has become as well. Love this channel!", "I was so excited when the last few minutes of the countdown arrived and that rocket lit up and just JUMPED off the pad! Seems like it has been forever and I'm so proud that NASA once again has a manned spacecraft going back to the Moon! Capstone finally made it to its intended orbit... and soon Artemis will join it. I can't wait to see the footage and image from the lunar orbit!", "Great video Scott, nice to see SLS launch successfully.", "I live out in Tampa and was disappointed it was so overcast where I was, but I knew I might be able to see a bit of light from the launch. \nIt was far more than a little bit of light. The horizon was lit up like I was only 10 miles from the launch pad instead of 128.", "Aww man, all those hours spent watching all the scrubbed launch attempts, and they had to actually launch it this time around when I was halfway through my night sleep here in Europe!!\nThe only consolation in all this is that it was a night launch, which doesn't usually provide stunning onboard footage, and with Scott saying the live coverage wasn't that great either, I feel better losing the live coverage.", "I watched the live NASA web coverage until T minus 1:30 then stepped outside. Living 19 Kilometers (12 miles) directly West of LP 39B, it was a spectacular sight to behold from my front lawn. It turned the Florida night into day. At our angle it looked like Artemis had a direct shot at the moon. I know many NASA & KSC employees - well done team!", "I can’t imagine. The shuttle launches at night were incredible. Loud and turned night into day. Can’t wait to see an Artemis launch at some point.", "As cool as night launches are, it probably would've produced better footage of launched during the day. We have to wait at least another year and a half now. Hopefully Starship launches by then.", "I was surprised to see it finally fly last night. Glad it went off without a hitch, so far.", "The sound it made when it was lofting itself skyward was incredible, like the air itself was being torn asunder.  Amazing launch.", "Scott, Apollo 17 was also a night launch with 5 F-1 LOx/Kerosene engines and their brilliant plumes, so which was actually brighter? Good video as usual - Ken", "Amazing clips from Reds Rhetoric using the Nikon P1000.  Surprised it was even better than NASA's plane footage?!", "As always awesome coverage  Scott!", "One incredible demonstration of the brightness was in Everyday Astronauts live video (9 hours long).  They showed some replays, and the one that starts at 8:24:16 in the video doesn't pan up with the rocket.  It shows a dark parking lot at night where they were filming from, and the rocket in the distance (3 miles away). The rocket takes off and all of a sudden everything is lit up and you can see people and landscape, washed out quite a bit until the flames leave the frame at the top. Then for a bit it just looks like  a strange daytime shot where the light slowly fades.  I wish they hadn't cut away, because I would have liked to see the slow fade back to the night.", "I went to bed thinking I'd watch the replay in the morning, but I strangely woke up at 1:43 to find that it was literally about to launch. What are the chances?!?!", "Excellent video Scott. Learnt some more details even after watching many videos from the launch since last week. Thx ", "Fantastic shots!  I was more than curious about all that off gassing, and Scott acquired a cabin shot also!  Very cool ", "\"After what can only be described as an absolute eternity.\" Perfect way to explain it  good video Scott!", "I've been waiting for this since the last shuttle launch and was not disappointed.", "I saw every single Saturn V that launched, dozens of Space Shuttles (many at night) and innumerable Atlas, Falcon, Delta, etc. launches in person and from relatively close. That's part of growing up here on the Space Coast. Anyway, I can confirm that Artemis-1 was the brightest launch I have seen in person.  So much so that I used my old Shuttle night-launch settings for my camera and the resultant photos were blown out -- using the same ISO, aperture and focal lengths as in years past.", "I've been looking forward to watching your video on our launch for most of my career!  Thanks Scott!", "Thank you very much for sharing my video. Being able to see the launch in person was truly an amazing experience. Just amazing.", "The videos of the launch from the countdown clock area were incredible, ive heard the term \"second sunrise\" but that defines it.", "I was lucky to be close to see it go off. It was a surreal experience and my first rocket launch. Extremely loud, almost like hundreds of bombs going off at the same time. Well worth it, was one of the most beautiful things ive ever seen.", "I'm in Australia, so I missed this live, but I have to say that was more impressive than I expected. What, a, frigging, rocket. People have talked so much shit about SLS, but this was just awesome", "If you count this as starting with Project Constellation, then this is 18 years in the making.", "Hey Scott! I noticed yesterday when I was looking at footage of the SLS liftoff, when the SRBs ignited it produced quite a noticeable shockwave, which looked awesome firstly, but was that something that happened with shuttle as well? Let’s just hope none of the infrastructure was damaged ", "*Question/Request: Hi Scott Manley! Long time listener, first time commenter. So my boyfriend helped to work on Artemis 1 and we were very lucky and watched from the East Causeway at Kennedy in person. It was an amazing sight to say the least! We also went with a friend who worked with multiple companies over the years on the shuttle program. He commented that it felt like forever for SLS to make it up in the air in comparison to the shuttles he watched launch. This got me thinking....", "Watched from the roof of my house in Merritt Island, and can verify it looked like the brightest one I have seen.  It cast very clear shadows in an orangish light and all the shadows moved downward as the rocket went up.  Booster separation looked beautiful and the main engines have a much whiter light than the boosters while being nowhere near as bright.  This was an awesome show, but nothing beats the sonic booms when SpaceX boosters come back here to land.", "The booster separation photo from John Kraus was pretty darn amazing!", "As seen from 150 miles away to the south, on a clear night sky, that was one cool very visible rocket! Worth staying up so late to see it.", "Scott. This is the best coverage I have seen of the launch.  Thank you loads :)", "An interesting note in regards to the use of old technology is the Orion’s European Service Module's main propulsion AJ-10 engine.  The AJ-10 engine was first developed and flown on Vanguard and Able stages of Atlas-Able and Thor-Able rockets. It was first flown 17 March 1958. It was used in the Titan III GTO Transtage.  The AJ10-137 variant was used in the Apollo service module's service propulsion system from first flight in 1966. An AJ-10 was used by the Delta-F upper stage of the Delta 1000 Straight Eight series rocket, starting in 1972. The AJ10-190 engine was used on the Space Shuttle Orbital Maneuvering System (OMS) for orbital insertion, on-orbit maneuvers, and de-orbiting, first flown in 1981. The AJ10-118K engine was used on the Delta II rocket's upper stage. Of course a reused OMS shuttle engine is Orion’s European Service Module's main propulsion.  The Orion being an Apollo on steroids characterization apparently doesn't refer to its main propulsion.", "I like the idea of the starters not being dramatically strong! Makes you more apt to use a diverse team", "Excellent video and analysis!!  Yes, coverage could have been much better, as in SpaceX coverages of Crewed Dragon and Falcon Heavy.  Your post launch video helped get us there.", "It would be an interesting video to compare how fast this SLS cleared the tower compared to a Saturn V or even the shuttle.", "Gorgeous launch  My favourite thing was seeing it roll after liftoff   just like the Shuttle. Beautiful… ", "Can't believe it finally happened. Wish I could have seen it live.", "Her first flight, and it's a lunar one! How amazing.", "Wow, I usually keep up with this stuff, but after the first couple’s launches were scrubbed, I guess I just lost track of time, so this was a big surprise! \nSo happy to see this baby flying!"]}