{
    "video_id": "7GNcn4DxA_I",
    "comments": [
        "Give the guy an Oscar for Elvis! Nobody deserves it more.",
        "This guy is what Hollywood cool should look like.",
        "Vou na missa volto ja",
        "I will riot if he does not win. Like bruh he has the best performance of the yearrrrrr",
        " - FIND YOUR LOVE IN YOU CITY! r",
        "He has the coolest name. Austin Butler.\n\nIt's right next to James Bond and Bruce Wayne",
        "If he can do Fayd Justice he’s got me",
        "although both him and brendan fraser deserve the oscar sadly he wont win..",
        "Really hope he wins at Awards season. He put his all in Elvis!!",
        "He's really gorgeous isn't he. Excited is the least descriptive word I can use for part 2 of DUNE! It's going to be SPECFRIGGINTACULAR.",
        "dude has a great voice frfr",
        "He’s starting to lose that accent",
        "Interesting interview…a completely self absorbed person would have taken this in a completely different direction.",
        "Can’t wait for him to do Sting’s part. Crazy man just crazy. Can’t wait.",
        "I had no clue he was filming Dune II.",
        "I love the interviewer’s energy",
        "he deserves that Oscar!! ️",
        "Horrible",
        "Ohhhh he's gonna be Feyd Rautha? Good choice!",
        "4ja voltei estou tomando café daí vo espera um pouco  dai vou me deta o resto da manha e a tarde a adentro",
        " so proud of him",
        "Gorgeous man",
        "Liked him since I saw him in the Carrie Dairies",
        "He is Brad Pitts younger brother.",
        "Should I watch Elvis just because of this man?",
        "It's great to hear that Dune - 2 is actually gonna be made, I got the 3D Blu-Ray of Dune and thought it was awesome. I'm a really big \"Dune\" fan, when I was a kid I read ever novel of Dune that was ever published, enjoyed them as much as Steven King novels if not more and that's hard to do! Looking forward to seeing the new Dune when it comes out and hope it's in 3D also, the only real way to see these films! I got a feeling that with the new Avatar being released in 3D this December your gonna see a resurgence of 3D films and HD 3D TVs again hopefully! Then maybe I won't have to order all my 3D movies from overseas! \"Black Widow\" was only released in China in 3D and it was expensive to get a copy but it was worth it!",
        "He NEEDS to win the Oscar for ELVIS!!!! <3",
        "Is he doing an old jar jar binks impression",
        "Paul Newman is back",
        "This interviewer is so out of touch lmao. He tells brie larsen  people love her as capt marvel. \nLol who. Like 2% of them comic fans who actually hate comics. Haha",
        "I just adore this man.  He deserves an Oscar.",
        "This is what Jasper Cullen tried to be and failed. Thoroughly.",
        "Dude could steal any mans girlfriend lol",
        "Such a lovely guy, adorable, modest and considerate!... Not to mention very handsome...",
        "Dude, this guy NEEDS TO HIT THE GYM!\n\nOr at least eat a sandwich.",
        "He needs to get off that Elvis movie!!! His voice is killing me, not in a good way",
        "He didn’t complement TC \nTC complemented him \nAll about him …….. I don’t get the inner light coming from him. Too bad",
        "this man better get the f-ckin oscar...will be and should be our next gen actor",
        "Cool guy. Not talking politics like a lot of celebrties. he just talks about his jobs, wfans and how much he loves his works",
        "His voice... is so dreamy...",
        "God, what a man ",
        "Wonder if he’s gonna do the fake Elvis voice in dune",
        "austin butler seems like a great chad! But the reporter is kinda annoying",
        "Never enough! He really does deserve that Oscar, cannot wait for the Dune sequel, or that bikers movie he’s doing with Tom Hardy … I mean … beautiful human right there and it’s just the beginning ",
        "Brad Pitt Se7en vibes",
        "Gosh how long is he gonna talk in this fake deep accent.",
        "He'd make a great Gambit if the MCU ever adapts them",
        "He reminds me of Johnny Depp",
        "Why is he glowing that like wtf",
        "still doin the Elvis voice huh",
        "Damn I thought that was Vanessa Hudgens 0:59",
        "Kinda looks like Corey Haims clone.",
        "Упаси мир от ядерного взрыва и позволь увидеть вторую часть Дюны в кино.",
        "This man doesn't drop character until the DVD commentary",
        "He is what I always imagined Jennifer Aniston and Brad Pitt’s son would look like if they had one.",
        "If you close your eyes it almost sounds like you’re listening to Brad Pitt",
        "this beautiful beautiful man..",
        "I am so hyped for Part 2!\nThe first one was amazing ",
        "He's such a fine man",
        "So damn handsome and talented! Give this man the Oscar!",
        "If his face wasn’t hot enough he had to add a beard ",
        "Hope we get to see that roundtable at some point.",
        "about time we had a new movie star ....   Now start making good movies again",
        "I hope it's not a bore like the 1st",
        "This guy vs Tim Chalamet will be incredible. Both talking and fighting.",
        "Dude looks like Kevin Bacon from Footloose era. Lmao",
        "He cant grow facial hair",
        "Nominee? He should win the damn thing",
        "He has come a long way from iCarly",
        "His Rand Al Thor was the chef's kiss of soap opera cheesiness. Truly unbelievable stuff ",
        "I swear to God, if this man doesn't win an Oscar. IK it is rigged",
        "0:29 Miles Teller and his wife pass by in the background lol. Austin looked in that direction twice before this, prepared to greet them had they looked. \n\nMiles was in a big movie that made a lot of money but Austin has all the spotlights on him, being interviewed, attending roundtables and being asked about Oscar buzz, even though he got less pay for Elvis. That’s why sometimes it’s okay to get paid less for a bigger opportunity that will put you on the map. Although, in this case it was just destiny and beyond their own choosing. Man, it must have stung Miles a bit to lose the Elvis part and now see Austin here.",
        "He looks so good ️",
        "A win would be great. He doesn’t get a better opportunity than this for sure but he is still very young and everyone (including myself) is saying that Fraser will win this year but what would the Oscar’s be without a little controversy? Hell Fraser might boycott the whole damn thing! jk I hope!",
        "Calling Dune a \"cinematic masterpiece\" is insane.",
        " Oscar ",
        "Interviewer kinda sounds like Yoda lol",
        "It's going to be interesting to see him bald and pale like the rest of the Harkonnens.",
        "The new Brad Pitt",
        "I think he's beautiful",
        "If he was my driver we’d always be driving I’m just sayin’ Elvis wasn’t played better by anybody else ",
        "A mix of Paul Newman and Brad Pit",
        "Omg",
        "HE HAS A BEARD NOW?",
        "I’ve watched the Denis Dune over and over. I cannot get enough of the whole epic artistry of it. Cannot wait for 2! \nThis guy in the Dune 1984 Sting role fits perfectly. He has the “look at me, I’m gorgeous”  expression to a needle point. I’m already dying just remembering Stings facial expressions in that Though I’m sure this updated direction of the role will be more serious. ",
        "His voice is so hot ahhh!",
        "Brad  pitt   charm.",
        "I HAVE AN OLD LADY CRUSH ON AUSTIN ",
        "He still hasn't let go of that Elvis voice? Bro is from California with a Southern twang.",
        "Not sure who his character will be, but I can see him as Fade in Dune",
        "The Oscars is coming yes is coming 2023adorable and perfect man ",
        "Reporteris such dushe",
        "I’m so happy for him! He’s in his renaissance era. He deserves to be a big star!!!",
        "I really tried to watch the disaster Elvis but after 30 minutes I had enough. This is another example of Hollywood congratulating itself for crap.",
        "Hes truly so elegant",
        "he's gorgeous",
        "So",
        "does anyone know the interviewer's name?",
        "He has that 90s Hollywood glamour, I just love him",
        "Didn’t this guy make out with Timothees ex while they were together? Gonna be awkward but I’m sure Timothee and Austin will be adult about it.",
        "perfect casting for fyed ratha",
        "How’s this….? His mama knows him…",
        "Dune 2? Is he playing Feyd Rautha?",
        "Austin Butler is Ryan Gosling's upgrade. Damn this man has style.",
        "Austin deserves an Oscar!!!",
        "Lord this man is so fine like Fine Fine",
        "Austin really deserves the oscar, can not wait for his upcoming projects",
        "I really hope we get to see the imperial planet Kaitain in Dune part 2!\nThe corrino adopted homeworld has always  fascinated me, maybe because its not explored that much in the original novels.\nBut what we do know about it makes it sound amazing, obviously its the seat of government but its described as a utopia with vast cities with dream like buildings, statues and waterfalls and tree lined boulevards that are so majestic and staggeringly amazing \"a person could stare for hours\"."
    ]
}