{"video_id": "8XTjflYbm7k", "comments": ["When Kevin said “cry me a river Mark“, that was  the seed that bloomed into Mark‘s deal with this young  entrepreneur ", "Mark wasn't about to let 50% of his business get taken away by Kevin. Nice move from him.", "So much respect for Mark Cuban. This was one of the biggest billionaire moves against Kevin on the show. Mark is a man of great integrity", "Big ups to Mark for helping this guy out from under Kevin's thumb.", "Kevin makes this show what it is man", "That was hilarious. I love how Mark always says I'm out but yet still in. He listens carefully from the other sharks and makes his Mark at the end.  I'd love to meet with Mark someday.", "This episode was amazing. Kudos to Mark for seeing the potential in him. The guy knows his stuff.", "I love Lorie’s laugh at the end ", "Major respect to Mark who REALLY got this man out of huge trouble and i am sure he will do what it takes to make it to the Moon", "I dunno why, I feel like Mark really cares about people and the stuff he invests in. He offered the only because Kevin wasn't budging from the outrageous 50% offer.", "When Mark Made that face after Kevin said Cry me a River Mark you already know whats happening ", "That was Mark's ego making a deal. Kevin rubbed him the wrong way and Mark said \"watch this!\"", "I died when Lori laughed ", "Good job on Mark for letting Kevin first try and strong arm the guy with what he figured would be the only offer he’d get then swoop in at the last minute with a better offer on contingency, very smart.", "I think him saying how bummed he was when mark went out probably endeared him a little. Plus mark has a hero complex when it comes to saving entrepreneurs from Kevin’s sharky deals. I wonder just how much mark has lost on all of his pity deals. ", "I freaking love Mark . Such a nice guy", "much respect to you mark for giving this young man a chance in life", "\"CRY ME A RIVER MARK!\" LOL i just love Kevin.", "You sing \"cry me a river\" to a man richer than you and he will make you cry in the end. Perfect comeback by Mark.", "What a guy. Well done Mr. Cuban!", "I am so happy that mark took the deal by saving him from Kevin ...", "Mark is just a star of pitching and negotiating.", "Mark knows that the young man is smart. He agreed almost with every decision/ counter he was making. While the product needs to grow He has a good business partner.", "He took so long in telling Kevin, \"No\" he was going to say \"Yes\" and Mark saved him.", "Classic Mark coming back in and stealing a deal from Kevin lol", "I did NOT see that coming! Woohoo! Happy for both of them!", "Mark is such a beast!  ", "Mark finally jumped in just time to grab the deal. It seems not fair for Kevin but rescued the pitcher. Mark is not only a shark but also a shark game director ", "When he walked out of the studio opened the exit door, Barbara stood there with a glass of white wine just to tell him, she's out.", "Kevin gets SOOOOOOOOOOOOOOOOOOO serious when a pitch involves wine. ", "Sad that all these products die off so fast after such passion they show.", "You know what would’ve been amazing is if at the end after he shook marks hand he said to Kevin “you’re dead to me”", "What a boss move from Mark", "Love Mark for what he did there.", "Mark is a class act and he clearly saw that Alexander is worth investing in. Congrats to both!", "Mark whooped Kevin  Lori loved it", "Mark just legit saved this guy some equity. He was at the verge of loosing his business. ", "i'd rather work with Mark any day but Kevin is actually pretty chill when there aren't any tv cameras.  his YT channel is really good.", "Mark's a legend !!!!", "Wish we could see the discussion after the deal was made", "1:12 Kevin watching the demonstration with hawk eyes, like how Lori looked at Scrub Daddy. Haha.", "Cuban’s such a nice guy", "MARK CUBAN, I like when you did something like that, you gave hope to them, and now you save them from a bad deal... ", "The deal never closed. People who preordered never got product or money back. Scammed his only customers and went dark. Good for Mark on not closing the deal.", "Damnn.... I love Mark Cuban! He's so awesome!!!", "Kevin wanted his soul and mark saved him ", "I know being on a TV show, the talent has do some promo work, but getting the Sharks to do a \"subscription beg\" is quite impressive.", "I'm so happy Mark did that!", "I love this show.. All sharks are superb..", "Only deal non negotiable\nYou gotta be kidding me I felt that ", "The way they all toasted together @ 6:24. That was RICH! Lol", "Cuban is so visionary plus he raises competence on the part of the enterprnrs", "Love how Mark swooped in and saved him from a bad deal", "Disappointed that they didn't show us the conversation Mark and Kevin had after the deal.", "Damn. I feel like Kevin was actually planning on taking over his company after he get diluted from new investors. Then maybe added it, combine it with his other wine business?", "I've seen Mark do this 2-3 times when he thinks somebody decent is getting hosed.  Honestly, even if the deal never went through it saved this young man from having to make such a huge decision on the spot.  He can get 100K for 50% anywhere, that wasn't special.", "That was a blast lets go mark i love ot exactly what had to happen exactly haha\nI feel like u should give it everything u got and want to do so they can actually evaluate it feels like if they see future and see you doing it and beeing behind it they go in especially mark and sometimes even lori", "Kevin had too much wine. Perfect product for him. He blew it.", "mark is soo smart ", "MArk is such a nice guy", "I love how Lori goes out in style- that’s how you do it Barbara!", "Honestly even at Kevins deal he'd be a millionaire.", "Mark cane straight from heaven on this deal lol", "Mark again on thisZ it’s really amazing you make a good deal . Mark try to save you cuz if he can’t then you will be doomed .", "And there came Mark like a knight in shining armor", "I love when he’s was like”I was in college drinking whine”", "Cuban don’t want this guy to be looted by Kevin. Entrepreneur with golden heart", "Lori asking if he’s still with the girl  the important questions", "Mark Cuban the savior of the day", "Mark came in outa left field with that lol", "I love shark tank it’s just a bunch of billionaires playing with money. Lory laughing at Kevin at the end like it was a game play she liked", "Mark caught a buzz good move mark I bet it's gona pay off ", "There’s been instant wine chillers at bottlos for at least a decade.", "\"How do you know so much about alcohol?\"\n\n\"I went to Arizona State.\" ", "The way the lift up the wine altogether after Lori said that hahhahhah", "YES !!!!\nKevin is soo Greedy! I’m glad Mr.Cuban jumped in this deal and bumped Kevin out of the way!!!!", "Lori was the one who loved it the most", "Mark gets 20% more just by waiting Kevin to be greedy.", "Mark, you are amazing, I love you man.", "Perfect, genius, expert strategy: get the sharks drunk on some gooood wine", "Good on Mark, but after looking into this company I don't know if the deal ever even closed. They are out of business now.", "Mark....... The Man", "That is more like a GREAT WHALE move.\" Don't hurt nobody Mark\"", "And this is why Mark Cuban is my favorite NBA team owner ", "Kevin is my fav shark but this is a Mark’s tank.", "Mark is such a badass, everyone that comes on this show looks up to him and tries to do business just like him. I'm 32 and have never voted for president, I think every single person who has ran since I turned 18 has been a complete clown but I'd consider voting for Cuban if he ever ran.", "Good going Mark!!", "I don’t know why they call Kevin “mr.wonderful” he stays trying to rip people off ", "Mark knows he’ll make his money back at the least. It’s a clever product it’ll profit with the Billionaire!", "When you big ball & show your richer than everyone, but have a heart at the same time lol - Mark", "Man I love mark man. \nAwesome!", "Annddd that is why Mark Cuban is the man ", "Oh man, it's like the algorithm knows exactly what I want!!!  This is a problem that I run to EVERY WEEKEND, the wines at the grocery story that are chilled are always the cheap ones/ not my favorite brands, so I always have to go home and wait for my wine to chill. This is in every way shape or form a life saver, I will 100% buy one!!!!!!", "kevin is just the best", "Mark came for the rescue", "You pour it back into the bottle and it's just going to get warm again. Then you have to cycle it back through a cooler again. Needs work", "Wow. Mark Cuban. Amazing ", "I wanna see the list of clubs that Mr Wonderful is in . From Peanut Butter to wine!", "Kevin: cry me a river\nMark: hold my wine\nMark the ", "Damn mr wonderful was feeling thirsty . Didn’t he could be that thirsty man."]}