{
    "video_id": "8XTjflYbm7k",
    "comments": [
        "",
        "Mr. Wonderful got screwed! LMAO",
        "Thank god for mark",
        "What did Robert say at 6:15 right before the toast? Sounds like rich people terms in French.",
        "Just here for the FTX comments.",
        "They are having a lot of fun toasting. LOL",
        "Need update.",
        "much respect to you mark for giving this young man a chance in life",
        "I allready watched this episode, and Ups I did it again..",
        "Mark whooped Kevin  Lori loved it",
        "Mark Cuban the real deal.",
        "Mark is a menace",
        "inspiring",
        "Mark is a freaking beast!!!!",
        "Mark, why you gotta be so god damn cool like that. Thats how i wanna act when i grow up (im 28)",
        " mark said F U Kevin  ",
        "I guess this guy has never heard of ice.",
        "Update on this business:\n\nThe deal never closed. They never got out of their prototype stage. No orders have been delivered. Basically, it's a dead business.",
        "Kevin gets SOOOOOOOOOOOOOOOOOOO serious when a pitch involves wine. ",
        "He's pouring that wine so wrong ",
        "Got on Shark Tank too soon.",
        "The deal never went through and nobody ever got the product shipped.",
        "Damn mr wonderful was feeling thirsty . Didn’t he could be that thirsty man.",
        "Mr wonderful turned into Mr greedyful in this one",
        "Mr Wonderfck trying some cartelstyle extortion",
        "Mark said  Kev lol",
        "Mark came for the rescue",
        "Lmao at 2:06  too funny",
        "Wow! Mr Mark Cuban is amazing! Holey Moley!",
        "Sadly Mark did not go ahead with the deal. And ProntoBev never hit the market. The crowdfunding people are still waiting on their product...",
        "Mark destroy keving",
        "turtles are cool",
        "I wanna see the list of clubs that Mr Wonderful is in . From Peanut Butter to wine!",
        "The sharks threw him to the sharks  AND MARK a shark saved him from the shark  ",
        "Update:\n\n“The website states they met Mark’s contingency and are still open to more investments, but it looks like it hasn’t been updated in several years. No one that invested in the Indigogo campaign has received their product, and many are calling this company a scam.",
        "Mark is an absolute brilliant negotiator and true Shark!!!  He is a Great White amongst Nurse sharks.",
        "This damn thing is a dud , check out indigogo comments",
        "Mark knows he’ll make his money back at the least. It’s a clever product it’ll profit with the Billionaire!",
        "Loool kevin should've not said that mark was like get tf outta here",
        "The bad news",
        "You sing \"cry me a river\" to a man richer than you and he will make you cry in the end. Perfect comeback by Mark.",
        "4 years later and the product has not even been sent to the original people that bought it on indiegogo. Mark never closed on the deal. This product was way too early to be on shark tank. People claim they’ve been scammed and there’s no updates on if or when this product will ever be released.",
        "Imagine 100k 10% 10 Royalty until 500k recoup. 2.50 perputity",
        "Mark incredible",
        "Beautiful product, Nonsense Offers by foolish investors.",
        "I love when he’s was like”I was in college drinking whine”",
        "Marks deal fell through….product currently unavailable….warm wine for everyone   ️",
        "Kevin: cry me a river\nMark: hold my wine\nMark the ",
        "Mark is such a beast!  ",
        "Sad that all these products die off so fast after such passion they show.",
        "That was a crazy PLOT TWIST",
        "That is more like a GREAT WHALE move.\" Don't hurt nobody Mark\"",
        "@ 3:19 you gadda love Mr Wonderful ",
        "Hmmmm. I thought out was out. Matter of honour of not contract law. Disappointed. But love the product and the guy. I would buy a few of these.",
        "Jesus Christ this guy was about to say yes to 50% equity when exactly mark entered and boom...",
        "If mark cuban just puls this boss move and then tills me to subscribe in gonna do it",
        "I freaking love Mark . Such a nice guy",
        "I just subscribed today just for Mark. Want to kick Kevin a***for asking 50% for 100K",
        "Omg...love mark",
        "“Are you still with the girl”?” Lori ",
        "It's a good idea but I think they came too early.... spoilers below",
        "Another failed product",
        "Mr. Wonderful, I love you, but you played yourself this time!!!",
        "Mark looks different for some reason ",
        "All that to get scammed",
        "Mark Cuban the savior of the day",
        "Mark finally jumped in just time to grab the deal. It seems not fair for Kevin but rescued the pitcher. Mark is not only a shark but also a shark game director ",
        "Sometimes stalling the sharks works in the end",
        "Kevin could have easily make loads of money from this investment",
        "50 percent is cray cray.",
        "Robert wouldve been the best shark for this. respect to mark for saving Alex on equity.",
        "That was a blast lets go mark i love ot exactly what had to happen exactly haha\nI feel like u should give it everything u got and want to do so they can actually evaluate it feels like if they see future and see you doing it and beeing behind it they go in especially mark and sometimes even lori",
        "Lori was drunk lol",
        "Too bad the company is dead...",
        "This is why we love Mark! He knew 50% was just wrong so he stepped up and did what was right.",
        "Love how Mark blasted MR CHATEAU BLUE BLUE, out the water! ",
        "Is it me or did everybody sound like they were buzzed after a drink  and their laughter you can tell there all Millionaires just the way they laughed  Lori at last u can tell she was buzzing ",
        "Looks like it ended up being a flop. Funders from indiegogo still haven’t received their purchases and there are other companies selling similar products on Amazon",
        "Dude never made the product. He just gave up lol",
        "Hahahaha mark is love ️🫶🇵🇰",
        "Literally a product that can't fail. What rich person wouldn't this.",
        "How's my life going?\n0:14",
        "I think until I have access to a lab to find what is safe and what isn't, nothing is for sale; and y'all can take full responsibility for anything you do.",
        "Company went out to business",
        "Mark wasn't about to let 50% of his business get taken away by Kevin. Nice move from him.",
        "mark is soo smart ",
        "That “Yea” was everything ",
        "The deal never closed. People who preordered never got product or money back. Scammed his only customers and went dark. Good for Mark on not closing the deal.",
        "Ohh mann …mark saw he was desperate and at the moment to give up 50% in the desperation to kick start.such a compassion",
        "Ftx mark and Kevin ",
        "Kevin makes this show what it is man",
        "I love you so much Mark for that, Kevin is so Greedy now Jokes on you Kevin ha",
        "MArk is such a nice guy",
        "of course he's going to get the other 100k, he \"has mark cuban on board\"",
        "That chuckle from Mark Cuban , huge sign to run from Kevin's deal. Who is crying who a river now Kevin!!??? lol",
        "They have something like that at Binney’s to chill champagne.",
        "Lori ️",
        "I know being on a TV show, the talent has do some promo work, but getting the Sharks to do a \"subscription beg\" is quite impressive.",
        "mark is the best",
        "I really don’t understand what’s the need for this",
        "Mark took the deal knowing very well there's a decent chance he won't get a lot from it. But he wasn't gonna let greedy Kevin take 50% of a young entrepreneur's business. Respect right there.",
        "Good heart mark!!!",
        "Mark's a legend !!!!",
        "Kevin and Marc the best ever Sharks",
        "Thank you mark love you for that",
        "That was Mark's ego making a deal. Kevin rubbed him the wrong way and Mark said \"watch this!\"",
        "I love how Lori goes out in style- that’s how you do it Barbara!",
        "Mark fell sorry him",
        "deal never closed",
        "I love Mark for doing this! Shows where His heart is at!",
        "Dont trigger Mark  that amount is little .. He can donate 100K to a charity in one click haha",
        "What a stupid investment",
        "Thanks Mark. Kevin was been greedy",
        "Oh man, it's like the algorithm knows exactly what I want!!!  This is a problem that I run to EVERY WEEKEND, the wines at the grocery story that are chilled are always the cheap ones/ not my favorite brands, so I always have to go home and wait for my wine to chill. This is in every way shape or form a life saver, I will 100% buy one!!!!!!",
        "Mark just legit saved this guy some equity. He was at the verge of loosing his business. ",
        "That was FUNNY!!! ^_^",
        "Kevin looks like one of the THUMBS from that movie spy kids",
        "Des Chevaliers du Tastevin ",
        "Sharks got drunk",
        "Major respect to Mark who REALLY got this man out of huge trouble and i am sure he will do what it takes to make it to the Moon",
        "And Mark didn’t end up closing the deal so the guy walked away with nothing. ",
        "LOVE when Mark flexes his wealth with a pure heart. Dood is a legend",
        "Kevin: cry me a river \nMark: I hope it drowns you ",
        "Deal never closed, guy never got the products put to the GOGO backers.",
        "This was seriously satisfying.",
        "Kevin had too much wine. Perfect product for him. He blew it.",
        "I would of did the deal with Mr. Wonderful for 50% since it could be incorporated with his other products and make him do 100% of the work. Could of made a lot of money with that remaining 50% with only 10% work. Now this product is dead to all of us!",
        "I'd buy this",
        "Looks like Kevin was right.",
        "The deal never closed and the product is still not for sale :( this premiered 2017",
        "Mark....... The Man",
        "Kevin spoke facts and saw that he was still at the starting point of the company. No sales. The product wasn't even finished yet. Idk Kevin was his best bet to be honest.",
        "Barbara: I only like room temperature wine, and for that reason I’m out.",
        "Kevin always low-ball people",
        "Cuban is so visionary plus he raises competence on the part of the enterprnrs",
        "Mister \"Wonderful\"... HAH!!!!",
        "Owner of Dallas Mavericks, a great enterpreneur, a great business man, overall, an amazing human. Would love to meet Mark Cuban some day",
        "Gotta love Lori's Laugh at the end! ",
        "Mark Cuban is my favourite billionaire",
        "Don't play with Mr Cuban",
        "100K for Mark is like 1 cent",
        "Kevin trying to make up for his FTX losses",
        "25:07 ONE SHOT - not one shot was hit XD. We're all guilty of doing this though lol :O",
        "Kevin is my fav shark but this is a Mark’s tank.",
        "i love the sharks! ",
        "rule no.1 - dont mess with a billionare",
        "Mark knows that the young man is smart. He agreed almost with every decision/ counter he was making. While the product needs to grow He has a good business partner.",
        "So much respect for Mark Cuban. This was one of the biggest billionaire moves against Kevin on the show. Mark is a man of great integrity",
        "That GPU ruined the build.",
        "Mark gets 20% more just by waiting Kevin to be greedy.",
        "Mark Cuban is awesome dude",
        "Any crypto experts around here? Looking for some hot tips",
        "Only deal non negotiable\nYou gotta be kidding me I felt that ",
        "Come on kevin u just divided his valuation on 10",
        "I did NOT see that coming! Woohoo! Happy for both of them!",
        "Marks the man",
        "Mark the man",
        "Cuban just shut down Kevin on the Deal just to make Kevin look Bad.",
        "Mark is such a badass, everyone that comes on this show looks up to him and tries to do business just like him. I'm 32 and have never voted for president, I think every single person who has ran since I turned 18 has been a complete clown but I'd consider voting for Cuban if he ever ran.",
        "Kevin would have offered more, but he instead put it all into crypto. Whoops ",
        "Keving gets owned over and over by Mark....and yes we all love it!",
        "Honestly even at Kevins deal he'd be a millionaire.",
        "damn this one is good",
        "lori was tipsy haha love her",
        "The deal never closed and never made it pass prototype",
        "These sharks are worn out nothing seems to interest them anymore, shoutout Mr Wonderful for having hope. This invention could transform to somthing else",
        "The business failed eventually.",
        "Big mistake going with Mark. Should've walked out & used this for exposure.",
        "Good job on Mark for letting Kevin first try and strong arm the guy with what he figured would be the only offer he’d get then swoop in at the last minute with a better offer on contingency, very smart.",
        "To quote Kevin himself “I’ve never seen such greed.”",
        "God, I love Mark lol. The men for Goat on Shark Tank.",
        "Lori @9:55 hahaha. She was like mocking Kevin. lol",
        "Kevin was about to squash him",
        "Mark wouldn't have done this deal if Kevin hadn't given him a reason not to. This guy better work his butt off for Mark.",
        "Mark Cuban . Lol",
        "Kevin you need to wake up..",
        "Sorry but if he had the sales and everything why would he be there.",
        "kevin is just the best",
        "I don’t know why they call Kevin “mr.wonderful” he stays trying to rip people off ",
        "I can’t imagine a single wine Connoisseur getting this! It completely takes away from the “experience” which is an important part the Wine industry! and that also means u need to bring it with you everytime… and  what if there’s no fridge where u are ? I haven’t finished hearing the pitch yet so I don’t know the details yet of how his thing stays cold cuz he did pull it out of a fridge … So that means that if u need a fridge to put the container in… then his product is completely redundant cuz you can just put the Bottle Inside it !!",
        "I like Mark but he takes action based on emotions",
        "Darkness, light",
        "Member of whatttt?",
        "I love this show.. All sharks are superb..",
        "Cuban don’t want this guy to be looted by Kevin. Entrepreneur with golden heart",
        "When Mark gets tired of Kevin. Lol",
        "I can tell you for 100% sure that mark did this out of kindness and not business. But good for him",
        "What a boss move from Mark",
        "Mark came in clutch",
        "Wow! what a move from mark",
        "Should of gone with Kevin...",
        "When he walked out of the studio opened the exit door, Barbara stood there with a glass of white wine just to tell him, she's out.",
        "6:19 & 7:40 what happens here? This went over my head. Can anyone explain what was said?",
        "Everyone’s happy that mark cut the deal but turns out mark never sealed the deal.",
        "Smooth move... Good luck get the price down it's a winner!",
        "Tears De Chauvelier Blah Bleu",
        "Mr . Wonderful just got kicked in the you know what . Well deserved ! ! !",
        "we all  know he should take kevin's offer .  kevin has more money than all sharks combined ... by now that company has to be out of business",
        "My favorite show",
        "$109 better price",
        "Common Mark W",
        "Dirty move by Mark, but everyone loving it except Mr. Wonderful ",
        "Still waiting to receive order from last year ",
        "Mark a real one man!!! Damn",
        "Barbarians! Who T F pours their wine like that?",
        "Classic Mark coming back in and stealing a deal from Kevin lol",
        "Kevins scams are actually hilarious",
        "Mark is the real deal, O'leary seems too greedy",
        "Lolol don’t upset  he who makeths the most money, Kevin!  .",
        "Why do they toast upon saying Chaveliers du Tastevin?",
        "I like mark when he is being real all the time. Specially with a good and reasonable offer",
        "I love Lorie’s laugh at the end ",
        "Bad product, how could you ever clean it perfectly. From bottle to glass is the way to go, people will go to length just to clean their glass.",
        "That guy was enamored with Cuban so he would have taken any deal from him. But I bet that deal doesn't close. Mark only did that deal to show up Kevin.",
        "They are all capitalists but Mark Cuban is a capitalist without too much of an ego.",
        "Mark's Da Man...",
        "Annddd that is why Mark Cuban is the man ",
        "Smooth take.",
        "Investing in crypto now should be in every wise individuals list, in some months time you'll be ecstatic with the decision you made today.",
        "9:50 is the mic drop moment",
        "Mr. Wonderful’ and his big mouth. Wonderful outcome - for Mark Cuban!",
        "ASU wohoo! Alumni",
        "He saved him",
        "Cuban fing funny, LoL he screwed Kevin. That is a GOOD product, u won't need a wine fridge which takes up alot room in condos. I could see this making alot of money, anybody have update",
        "I am so happy that mark took the deal by saving him from Kevin ...",
        "i'd rather work with Mark any day but Kevin is actually pretty chill when there aren't any tv cameras.  his YT channel is really good.",
        "Wanna see Andrew Tate with them",
        "These are all still in productions and haven’t fulfilled orders since it was started in 2017",
        "This is exactly what i expect, well established business czars should do when considering investments, take the risk initiative like Mark did in the end. Why always invest in easy pizzy businesses that come into the shark tank, (or dragons den) because they have very low risk factors. You are not a business czar if that is all you do.",
        "Megalodon Mark lol",
        "The reaction on Kevin’s face",
        "Mark is a class act and he clearly saw that Alexander is worth investing in. Congrats to both!",
        "Lori was the one who loved it the most",
        "He should have done it at 33.3% or 40% if he coulda gotten it. I just checked, and 4 years after the show they haven't even started manufacturing it yet. I woulda done 50% only if I could get enough money to develop it and get a good amount of inventory, and to create a website. Without all that you don't even have a business yet and half the company would be gone.",
        "50%? No way!",
        "What do you call a wine expert \nA drunk",
        "Kevin wanted his soul and mark saved him ",
        "You are blessing to America Mark Cuban",
        "mark just know , and for sure he will do fight , that young dude was determind",
        "Robert barely makes a deal lol",
        "After i heard “im out” i’d say f your good news",
        "Damnn.... I love Mark Cuban! He's so awesome!!!",
        "Mr. Wine guy was like f**k u mark.  Kevin saved this young man company. That’s why I love watching this show. This show exist becaz of mark. He’s such a good person. He knows when to help and when not to.",
        "He took so long in telling Kevin, \"No\" he was going to say \"Yes\" and Mark saved him.",
        "Shark",
        "Mark seen Mr. Wonderful trying to finesse thst young man .. hats off ",
        "Lori just made my day, love these guys",
        "Wow Mark gained so much respect right here and I already think he's a great guy.",
        "Scam product... Never launched in the market,even this deal never got thru",
        "Damon whining about the valuation when the guy is only asking for 100k is dumb. 100k is a cheap ask on this show. I understand they'd definitely want more than 5%, but Damon acted like he was asking for 500k.",
        "Why would anyone go waist their time with these ",
        "Wish we could see the discussion after the deal was made",
        "Mark loves the entrepreneurship soul and doesn't allow it to be killed on the show! Respect 🫡",
        "Looks like Alexander never watched the chevalier of testivan’s episode",
        "The worst thing he could of said was that he’s from San Francisco",
        "It's so satisfying to see Mark fck up Kevin's plan. Kevin and Mark really have a weird chemistry which makes the show more interesting ",
        "Mark cuban is a G",
        "He cried him a river and swam up for the deal!!!",
        "Wow. Mark Cuban. Amazing ",
        "Damn. I feel like Kevin was actually planning on taking over his company after he get diluted from new investors. Then maybe added it, combine it with his other wine business?",
        "And that's why Mark is the best",
        "Mark took a home run",
        "Mr Wonderful really is the most greedy of the sharks.",
        "You pour it back into the bottle and it's just going to get warm again. Then you have to cycle it back through a cooler again. Needs work",
        "lori was instigating with that laugh      ",
        "It is a test. No risk to MC.",
        "Does anyone know how this product is doing?",
        "The Pronto guy didn't bring samples",
        "Damn that’s savage !",
        "Deal never ended up going through. People who preordered haven’t gotten the product or haven’t gotten a refund yet",
        "Disappointed that they didn't show us the conversation Mark and Kevin had after the deal.",
        "Stop being greedy Mr wonderful",
        "I love mark haha",
        "Respect for Mark just went up",
        "This is Mark being Mark He is so good at it!",
        "Mark was plain petty ",
        "Head shot by cuban",
        "Mark is such a nice guy here",
        "I wish we could see the whole pitches somewhere on the website - it needs to be cut for TV, but can't you upload the whole pitches? They all go out instantly and we dont know what they've talked about prior",
        "I died when Lori laughed ",
        "lol kevins greed left him looking a fool",
        "perks of being a billionaire",
        "The more I watch the show the more I have respect for Kevin, he's harsh but honest. In the end I think Kevin's deal would have been better, Mark's offer did nothing for this guy. I just can't imagine Kevin taking 50% of this company and not making anything happen. People just seems to get caught up in the emotionalism, the company didn't pan out and maybe it's because of Mark's contingent deal. Kevin had every right to ask 50% of the company that was barely in the prototype stage.",
        "good deal ! but dont forget that sharks help each others !",
        "Mr. Wonderfell",
        "dude hit the jackpot. he will get the 100k with mark on board in 2.5 seconds lol. wow! nice dude congrats man! good stuff and idea !",
        "Ooooh Man, I love Mark Cuban… I usually watch Shark Tank BRAZIL and we have a guy like Mark, his name is Joao Appolinario, he’s the best ",
        "And there came Mark like a knight in shining armor",
        "After some research, their product was never completed and was never shipped, even after 4 years of initial funding. This was aired in 2018.",
        "I think him saying how bummed he was when mark went out probably endeared him a little. Plus mark has a hero complex when it comes to saving entrepreneurs from Kevin’s sharky deals. I wonder just how much mark has lost on all of his pity deals. ",
        "11th comment",
        "Lori asking if he’s still with the girl  the important questions",
        "The way they all toasted together @ 6:24. That was RICH! Lol",
        "Kevin’s the grinch who steals from entrepreneurs ",
        "You can hate Mark all you want, but dude's always a real ones for struggling entrepreneur. Basically I'm saying he had too much money to spend lmao.",
        "This is also the day when Mark started forming negative impressions about inventors.",
        "really love mark",
        "That hug at the end, gave me chills. For Mark might be nothing, but for him, at that moment, his life changed.",
        "Go Mark!",
        "When Mark Made that face after Kevin said Cry me a River Mark you already know whats happening ",
        "if you close your eyes.. this dude sounds like Mark Zucks...",
        "I love mark for doing this",
        "Nobody asked him how you clean that thing",
        "So alcoholics CAN make a difference",
        "Wow dts all I can say.",
        "If I was the Pronto owner i would license the product technology to other existing manufactuer and get a royalty over it. Because trying to manufacturer this product and then marketing to retail has very high competition and its extremely costly.",
        "Mr. Greedy",
        "Or Mark knows the guy deeper or he just hides the other device.",
        "No body\nKevin: Part of random communities",
        "Love Mark for what he did there.",
        "Sad thing is, the deal is dead. Alexander and Mark never closed the deal. No products have been delivered to early supporters and all social media for the products is dark.",
        "first",
        "Mark is a nice guy",
        "I love Mark.Would like to work with him",
        "Mark ️\n\nI like him because he's practical and actually tries to help amateur entrepreneurs.",
        "The deal with mark did not close",
        "Mark a man of heart.",
        "Mark again on thisZ it’s really amazing you make a good deal . Mark try to save you cuz if he can’t then you will be doomed .",
        "I dunno why, I feel like Mark really cares about people and the stuff he invests in. He offered the only because Kevin wasn't budging from the outrageous 50% offer.",
        "\"CRY ME A RIVER MARK!\" LOL i just love Kevin.",
        "Mark cuban saves the day for Mr. Chil",
        "Smart move on both their part… Find a good one and keep ‘em hungry !",
        "Guess Kevin gotta get in on the second round.",
        "BANCRUPT in a blink of an eye :D",
        "great invention",
        "This was more entertaining, gripping, thrilling, and instructional than I thought. I'm learning about high stakes business just from watching Shark Tank.",
        "I've seen Mark do this 2-3 times when he thinks somebody decent is getting hosed.  Honestly, even if the deal never went through it saved this young man from having to make such a huge decision on the spot.  He can get 100K for 50% anywhere, that wasn't special.",
        "I'm so happy Mark did that!",
        "Talk about a swoop-in",
        "Under Kevin nose  bravo Mark...",
        "Mark and Kevin\nThe heart of this show.",
        "classic Mark move hahahah",
        "Kevin got too greedy and cocky and lost out. Mark is the absolute best Shark. ",
        "This episode was amazing. Kudos to Mark for seeing the potential in him. The guy knows his stuff.",
        "I love Mark and Lori",
        "Lori offered good news & bad news, but her good news wasn't anything he didn't already know or else he wouldn't be on Shark Tank. Her \"good news\" was pretty moot, lol.",
        "I ordered a pronto bev and 6 years later I still havent gotten it ",
        "The deal never closed and the guy still hasn't gotten the product past the prototype stage to market.  He actually probably should have gone with Kevin although the outcome would probably be the same.",
        "Kevin is always too greedy",
        "What a dumb product. I don't see this going anywhere especially with the competitor being so much more cheaper.",
        "Mark, thts a real shark he just snatched the food out of kevins plate....",
        "Am I the only one that felt uncomfortable that mark Robert and daymond weren't sitting the right seats?",
        " that was surprising",
        "Lori liked that wine, baby",
        "Yessss Mark came through for the guy he just needs a way in and he'll go to the top. And not lose his whole company",
        "Mark Cuban the saviour",
        "This is perfect crap product for TV selling. Exciting to buy, then use never again.",
        "Rich guys drinking wine and laughing",
        "My man Cuban to the rescue!!!!!",
        "Lol",
        "Hold the wine glass by the stem, to keep the temp consistent",
        "Mr Wonderful makes the rules and he said\" \"there are no rules on Shark Tank\" and that's how you can go out and come back in",
        "It’s been 5 years since Indiegogo - has the product been released ?",
        "When Kevin said “cry me a river Mark“, that was  the seed that bloomed into Mark‘s deal with this young  entrepreneur ",
        "They enjoy messing with Kevin lil too much ",
        "Robert is sitting at the wrong end . Loool",
        "Mark pulled out of the deal and never closed it ... He was just making sure Kevin didn't get 50% ",
        "That 100k to Cubanis 20 dollars to the average working person ",
        "When you big ball & show your richer than everyone, but have a heart at the same time lol - Mark",
        "John michael dadd will be commenting a number because that's all his tiny potato brain can come up with",
        "Kevin was right about this. The guy should just have asked for more money for the next round. Also, Kevin was the right partner for this. His greed got ahead of him. I would think 30% was the way to go",
        "greedy Kevin...he had chance to get great product very cheap",
        "Getting the sharks drunk to get a deal… I love it ",
        "I love seeing Mr. Miserable go down like that.",
        "Why is evaluation so important",
        "Man I love mark man. \nAwesome!",
        "What a guy. Well done Mr. Cuban!",
        "Man Cuban is the goat",
        "Mark was really nice to do this",
        "I think did more to help out the guy than anything else.",
        "dammmmnnn Mark is badasss",
        "  Because of  love. God sent His Son Jesus Christ to die in our place. Three days later. Rose him  from the dead.   Now. By Jesus Christ alone. God has granted us the free gift of eternal life. He will save and heal you.  If you confess with your mouth the Lord Jesus and believe in your heart that God has raised Him from the dead He'll give you eternal life",
        "And this is why Mark Cuban is my favorite NBA team owner ",
        "Perfect, genius, expert strategy: get the sharks drunk on some gooood wine",
        "Mark, you are amazing, I love you man.",
        "Kevin's offer was actually fair, this guy's business really wasn't worth more than the 54,000 in sales!",
        "I love shark tank it’s just a bunch of billionaires playing with money. Lory laughing at Kevin at the end like it was a game play she liked",
        "\"How do you know so much about alcohol?\"\n\n\"I went to Arizona State.\" ",
        " the true name Adam put to Eve gen 2:23-25 Muman MoooMan Woman Cow Mu Man  Cow Mooo Man Cow Womans Wonders Worlds Images Park Biblett Shark Tank",
        "How do you wash it inside?",
        "I'm glad Mark stepped in lol I hope things go well",
        "Hahahahahah the sharks are such nerds....love itttt",
        "MARK CUBAN, I like when you did something like that, you gave hope to them, and now you save them from a bad deal... ",
        " mark",
        "Lori enjoyed that",
        "$100,000 for Mr Cuban is peanuts. But looks like the deal never closed and the product never got launched !",
        "Lory lol mi out hahahaa",
        "Kevin was not happy about that lmaoo",
        "This guy scammed everyone lol.",
        "Mark came in outa left field with that lol",
        "Bad news first: I'm out ",
        "I love mark!",
        "Mr. Cuban... I don't need to subscribe to this channel because you have a bigger mission in life.  I've followed you since you bought the Mav's and there is only one thing left for you to do:  Save your Country !!! We ALL know that you'd make a great POTUS. This Country needs someone like you and you already know this.  I know that I'm not the first person to suggest this path.  Do it for ALL of our Children. You're a competitor through and through and you have a skill set that can devour any challenge you/your Country will face.  I'd be your first Volunteer. Namaste.",
        "Mr Wonderful really wasn’t looking so wonderful today…",
        "1:12 Kevin watching the demonstration with hawk eyes, like how Lori looked at Scrub Daddy. Haha.",
        "Mark is just a star of pitching and negotiating.",
        "Hey try this product collaboration with Friz company's  they take and use you're product compulsory",
        "Mark did this just to diss kevin",
        "I am totally not used to mark sitting 2nd seat",
        "Sure it waz a girl",
        "I just love Mark he is al about mentorship",
        "I love when Mark, makes his mark !!! My name also is Mark.",
        "YES !!!!\nKevin is soo Greedy! I’m glad Mr.Cuban jumped in this deal and bumped Kevin out of the way!!!!",
        "He should have turned to Kevin right after and said \"Kevin I'll give you 25% for $100k\" lol and fulfilled that deal with Mark immediately",
        "Well that just hapenned.",
        "I just watched a video titled \"Mr. Wonderful Hates Greed\".  I wish these guys would be consistent.",
        "Robert is sitting on the wrong side.",
        "Mark didn’t want to see him give up 50% of his company to Mr Wonderful lol",
        "The entrepreneur-guy made a bad decision...he should've walked out...mark gave him money but Kevin had passion and is more experienced",
        "I know where he’s getting the other 100k. \n\nThe Copa de Vino guy.",
        "Mark Cuban was a hero in this episode lol",
        "When it comes to the wine industry, I'd listen to Kevin. But his 50% ask was wayy too greedy!",
        "Cuban's a legend",
        "Who else is eating and watching shark tank on youtube?",
        "Good on Mark, but after looking into this company I don't know if the deal ever even closed. They are out of business now.",
        "The deal didn't go through in the end.",
        "Big shark eats little shark.",
        "Godamn it! Why can't we have behind the scenes videos ",
        "Kevin is a good guy. Better than Mark who pretends to be a normal guy",
        "Very first world product",
        "Got His @$$ cry me a river Mr.Wonderful..",
        "And now he is out of business. Sometimes it is better to have 50% or less of a watermelon then 80-100% of a grape.",
        "i see only Mark Curban",
        "The deal never closed and the product never got past the prototype phase.",
        "lol mark just saved that guy",
        "Big ups to Mark for helping this guy out from under Kevin's thumb.",
        "That was hilarious. I love how Mark always says I'm out but yet still in. He listens carefully from the other sharks and makes his Mark at the end.  I'd love to meet with Mark someday.",
        "You know what would’ve been amazing is if at the end after he shook marks hand he said to Kevin “you’re dead to me”",
        "The way the lift up the wine altogether after Lori said that hahhahhah",
        "Good going Mark!!",
        "Deal never went through and the company is closed",
        "Its a great product. Kevin could have been the right partner but Kevin became a greedy shark asking for 50% ",
        "Mark got angry at Kevin for being so greedy.",
        "There’s been instant wine chillers at bottlos for at least a decade.",
        "mr wonderful just lost something good honestly i see this selling and i would have done what cuban did",
        "Mark caught a buzz good move mark I bet it's gona pay off ",
        "I'm Barbara and I'm out",
        "Mark Cuban still has a heart. Cant say the same for mr terrible",
        "theyre testing chilled wine by holding it by the glass instead of the stem... come on sharks",
        "Mark cane straight from heaven on this deal lol",
        "Something about Mark not sitting in that last seat.",
        "Mark is the best.",
        "Love how Mark swooped in and saved him from a bad deal",
        "Cubin is a G",
        "Kevin is very alpha",
        "For being a greedy man he lost I'm glad Mark went back in",
        "Cuban’s such a nice guy",
        "This guy should have looked Mr wonderful in the eye and said, you're dead to me.  You are SO dead to me, And cry me a river!\nThat little bit of wine went right to Kevin's head.",
        "Marks the real deal."
    ],
    "comments_disabled": false
}