{"video_id": "8zyx-iyc5Mk", "comments": ["Everyone standing around like \"Wait, our bosses are supernatural beings and NOT just eccentric business owners?!???\"", "I had no idea Cesare was trying to capture Steve, I genuinely though his whole plan was to inconvenience him with incresingly heavy gifts", "The way that Cesare points DOWN when he says “upper management” is just an incredible little detail.", "Idk where this sudden character trait came from where Tim has an unhealthy obsession with “high quality containers” but I love it", "“I don’t normally need help catching you freakazoids, but you’re one tricky bitch Steve” will forever be seared into my memory", "THIS PUTS \"FRIENDS IN LOW PLACES\" IN A WHOLE NEW CONTEXT\nI love this series so much it's just incredible", "\"I'm the albatross across your clavicle!\" The energy behind each and every one of Cesare's lines is incomprehensibly wonderful.", "After watching the series again I realize that Billie saying \"I hope nobody dies.\" At the beginning of the season was foreshadowing. ", "I just realized when he said \"I don't normally need help catching you freakazoids\" Cesare is referring to clowns, meaning that there really is some beef between spooky goth creatures and clowns going on", "I love how cesare is animated to perfectly match Chris's weird ass delivery of every line", "Hoping we'll be getting this version of DOWN (the song that plays while Cesare sends Steve to the Shadow Realm) to listen to. I swear it's different from the OG version, and it goes so damn hard.", "I always knew Conrad was a swol tank but didn’t realize how strong he truly was until I noticed he was only one left standing by the end. The damn trucks even got knocked over", "i love how cesare's evil plan is literally to just weigh steve down with really heavy objects and then squish him with a hammer", "That Salem witch trial reference about Giles Corey is top tier. Good shit.\nEdit: After reading the comments, apparently Chris Fleming IMPROVISED that line. What a legend.", "I've re-watched from \"That's the point\" to Steve being a hole in the ground probably 100 times already. This might be one of the best pieces of media on the internet right now. The only problem is that we don't have enough of it.", "I adore Cesare's little victory dance before he absolutely smites Steve", "The fact that these are super short yet have such an impact like damn this guy knows how to write a story", "I love the fact that worthikids hid nothing about Steve and Cesare being \"different\" I was kinda hoping that the backpack and lunchbox was empty and the weight was just Steve being a literal clown though", "WAIT A FUCKIN SECOND\nDoes the line \"I don't normally need help catching you freakazoids\" mean that Cesare is a CLOWN HUNTER?!! HE CATCHES CLOWNS, THAT'S HIS JOB", "I am excited to see how Worthikids continues to expand the clowns vs evil lore", "2:26 I... am left speechless at how FLIPPIN EPIC this sequence is, kinda like the Big Top and Zomburger employees", "Throughout this season, I never expected Cesare to become the albatross across Steve's clavicle, but here we are.", "As someone who works in animation, Bigtop Burger is incredibly refreshing. This show never tries to be anything that it's not, and with that, just so happens to be one of the best shows out there. It's not a super-polished series from a huge moneymaking streaming service, and it's perfectly good on it's own without needing that gloss and shimmer. It's a 3D animated show that feels like it's in traditional 2D, and it uses it's style to a huge advantage and isn't afraid to bend and twist things a bit. Bigtop Burger gives me hope for indie animation.", "i love this little show so much, i wish companies would hire more people like you to write and create their adult oriented animated shows.\nunironically all of the voice acting is stellar, everyone seems to be really putting their heart into it, the jokes are funny and also have some creativity and uniqueness. there’s also the art style which i adore, awesome job all of you", "honestly the biggest plot twist the episode was that ceasare wasn't actually invested in the burger business or his crew, they were just a means to an end", "Having payed close attention to the lyrics of Down and Friends In Low Places, gotta say I wasn’t surprised, but was still very excited to see this ancient rivalry come to fruition!\n\nEDIT: Also, I can’t wait for Down (Reprise) to drop on worthikidsmusic!", "I'm lost for words.\nThe thought of the rabbit hole going deeper than we initially expected from this Food Truck themed series is beyond me... AND I LOVE IT", "Tim's obsession with the backpack and lunch box are hilarious.\n\nThe word \"stellar\" was animated perfectly.", "even though it's a little youtube mini-series, the talent and charm this show has is astounding. Worthi you are legendary and I pray that nothing muddles your creative direction here. You take your time and work your magic!", "Damn. The balls on this creator. I wasn't expecting him to seemingly kill off 9ne character and then entirely disappear another. Especially both leads. I'm truly intrigued now.", "can we just pause for a moment to appreciate that Cesare spent like 1.8K just to make steve stand still so he could hit him with a mallet lmfao", "Even though i was already expecting there to be some supernatural and magic stuff happening in this series, for some reason I still got shocked when it actually happened (in a good way).\n\nIt just feels so much like a chill slice of life thing (with some small hints of lore) then suddenly BAM an episode with a lot of magic and lore as the main thing ", "if these arent full songs already they absolutely need to be, and I can't stop watching this god damn", "This made me go back and watch a bunch of worthi's old vids and its really awesome to see how much he's grown as an animator over the last several years.", "The fact that at 1:57 the kettle bells get revealed in time with the music. AND THE LAST KETTLE BELL REVEALED ON A SYNCOPATED BEAT IS SO GOOD WJSNDKEJWJ\n\nThe fact that worthikids makes his own music is so fucking good, because he knows how to time his shots, movements, AND character expressions with it. What’s even better is he knows his own music extremely well. DAMN props to you!!!", "I just moved to Texas and you BETTER BELIEVE I’m gonna be shouting “BEHOLD! The Big Stetson!” every chance that I get ", "I like how Conrad asks why they don't get any gifts but they're paid like thousands of dollars an hour\nAlso Cesare saying \"Upper management\" but he points downward\nExtra Bonus: Everyone is now unemployed", "The music and the humor really makes this series along with the unique animation this whole channel is just my cup of tea.", "I've been obsessed with \"Friends in Low Places\" since seeing this episode. Thank you so much for making your music available on Apple Music. Hashtag blessed.", "I can't stop rewatching this video. The animation, the plot twist (Which feels so obvious now in hindsight) and the MUSIC! I'm smelling a reprise of \"Down\" coming soon and I'm gonna be listening to that so much if it gets released!", "such a cliff hangar. So glad to see this series alive and well, patience has been a virtue! Very excited to see the girls fight once more!!!!!!", "All that set up for the big reveal. Now we can finally get into the Clowns vs Undead story bits", "Cesare really stood out like a horseshoe crab in a freshwater environment this episode", "In less than 30 minutes, I fell in love with all the characters in this series. Truly outstanding talent.", "Oh man, I love these. Can this series get picked up by a studio?", "I just adore the way Penny says \"Woah, what a hat!\" Also I NEED a full version of the song that plays when Cesare is capturing Steve cause it is absolute fire.", "Love how Billie and Doc aren't super wide eyed at the end like everyone else. just sitting there like \"huh wow that just happened\"", "next episode, the two groups team up to rescue steve from hell", "I can't stop putting this on repeat. It's so dang awesome! Such a twist got me hooked into subscribing instantly. I can't wait to see what happens next!", "There are two things I love. 1) That I found Bigtop Burger again and there's no episodes. 2) Chris Fleming's energy with his work. Just getting that boom and echo is so perfect for Cesare. Loving every second of this stuff.", "Waited MONTHS for almost 4 min of this and as always it was completely worth it ️", "I have been absolutely obsessed with this episode since it came out, good lord this is some of the most out of nowhere shenanigans I've ever seen.", "Gotta give Cesare credit, he sure did vanish with no traces.", "I love how this episode implies Cesare is some kind of undead clown hunter, backed by the power of hell itself.", "\"A little gift from upper management\" \"I don't normally need any help catching you freakazoids\" ...Is Cesare... a clown hunter? \nMaybe under some larger Halloween-monster secret society, continuing a rivalry that was clearly established in Wire", "Man, I CANNOT WAIT for Worthi to release the full version of the song that plays at 2:33. That’s another instant banger right there.", "Tim's world is crumbling around him rn. That lunch box is the only thing that has made him feel passion since he decided not to fight that elk, and it wasn't even a real lunchbox", "I’m so glad you are making these, nobody could do it like you man. ️", "The art style!!! It gets better with each episode! Thank you for your hard work!  Worthikids is worth the wait lol", "It’s like 6 regular people getting caught in some wild competition between 2 demigods. I freakin LOVE it", "Just discovered this series last night and Immediately fell in love. Straight to the Patreon to show my support. Cannot wait for more of this.", "I could SO watch 4 seasons of this, the facial expressions are amazing and Cesare's demeanor is so funny!", "cesare is such an awesome character. i love his line delivery", "The line \"Behold!.. The BIG Stetson!\" resonates with me so much", "How good of a voice actor Chris Fleming is, just wow", "As someone who works for a food truck I can confidently say this series represents the life well", "Holy SHIT, I was not expecting things to go this hard this fast and end on a cliffhanger like THAT", "I love that the bigtop burger crew's hats all flew off, but frances' hat stayed on, implying she really is a true theater kid and made it so her hat would stay in place no matter what", "I hope that one day I can make art that makes someone feel the way Wothikids' work makes me feel cause, my word, it's immaculate", "This series gives me such strong Flcl vibes due to it both being down to earth and filled with wacky hijinks. I love it.", "This series is a masterpiece.", "We can all agree that the moment we saw this pop out, we dropped everything to watch, and we are not disappointed lol.", "I have been waiting for this series to become full fantasy. And it is as beautiful as I could ever imagine…", "You're one of the most talented animators on the platform god damn that was stylish", "The animation in this is amazing. The way you animated the crews reaction to Steve getting hit with the hammer is so smooth and satisfying. You are my absolute favorite animator on youtube!", "The moument when the music stops and then comes back with vocals in full swing goes so hard", "I must have more of this show, my god. I need an entire thirty min episode of this.", "I like how cesare is some sort of entity hunter playing as a food truck vendor to catch his next victim but also in the last episode he was genuinely invested in the burger science panel", "dude youre killing it with these, this specific brand of humor is just chef kiss ", "Clever immobilization tactic, since Steve can run as fast as a food truck on a highway. Cesare is quite the military tactical genius.", "I like how based on this shows world clowns are superior beings. I'm absolutely loving the progression of this show please make more no matter how long it takes. I can't wait to show my kids one of these days", "Chris Fleming could narrate the back of a cereal box and I'd be entertained by his abilite to emote a character. The drawing matching the voice for Cesare is amazing.", "Imagine if this was the final episode ever and we will never get context for a magic clown needing to be banished", "Worthi comes and goes from this mortal plane like an angel’s kiss. He drops quality content, then he’s already gone again.", "I never thought “wire” and “Big top burgers” were in same universe what a episode", "For real, I love this series, your artstyle is just glorious.", "The reveal of the zombie hammer was quite easily the COLDEST thing I have seen in the medium of animation bar none", "That DOWN reprise goes hard. Can't wait for it to go on the music channel", "In the end he faced off with the faceless (everybody else wears makeup, i.e. not their real face), and then literally vanished without traces.\nWhat an absolute lad.", "The fact that Cesare's voice slightly echoes whenever he yells elevates the hilarity. It's like he's transcending time and space just to throw bad puns at a clown.", "This is live, everything y’all do is amazing so for sure always keeping an eye out please never stop", "Can we take a moment to appreciate how Cesare can hold those weights easily?", "I honestly can't wait another several months (I will if I have to) for the next episode. A cliff hanger like this is making me scream", "Every time these episodes come out they get better and better I love it", "Man, I don't know if I can deal with the reality that the next episode might only be out in more than half a year.", "\"Those are six hundred dollars each steve\" Ok I wish more enemies explained how expensive their endeavors were, because it's fucking hilarious", "Oh I really hope they make more episodes to finish season 2 of Bigtop Burger, this episode threw me through a loop. I so did not expect that to happen at all.", "I really enjoy the voice acting in this show, especially Cesare's", "I cant get over how much I love caesar\nSeriously such a fantastic character \nThis show is utterly amazing ", "This was freaking good! Loved the variety of expressions, seemed very lively!"]}