{
    "video_id": "8zyx-iyc5Mk",
    "comments": [
        "\"i don't usually need help catching you freakazoids\" am i tripping or does this imply that cesare is a clown bounty hunter of some kind",
        "steve and cesare remind me of mr krabs and plankton",
        "WIRE lore?!",
        "real flcl vibes in this one",
        "I cah't believe it, they killed him! THEY KILLED OUR STEEEVE! OH GOD NOOO!!!",
        "This was immaculate. An experience. My mood has improved DRASTICALLY. This was animated so beautifully.",
        "Dude, Cesare is literally Jerma",
        "How good of a voice actor Chris Fleming is, just wow",
        "In an a year filled with some of the best anime ever made, this is somehow still top-tier.",
        "NEVER REST AND NEVER SLEEP\nA THOUSAND YEARS MY WATCH TO KEEP\nTRICKSTER GODS RISE FROM THE DEEP\nTRICKSTER GODS RISS FROM THE DEEP",
        "And just like that Worthikids never made another video",
        "YEEEEESS!!!",
        "After seeing this video, I named my hat with no name in Tf2 the big Stetson",
        "I NEED THE FUCKING SONG PLEASE",
        "Well now everyone knows without a doubt that cesare is a real zombie",
        "HOOOOOOOOLLLLLLYYYYYYY SHIIITTT!!",
        "I needa know what the fuck is going on",
        "the wire is makin' a lot more sense now.",
        "Wait, is Steve supposed to be related to the clowns from the Wire video?",
        "Oooh. The lore deepens!",
        "This just keeps getting better and better!",
        "I love the fact that worthikids hid nothing about Steve and Cesare being \"different\" I was kinda hoping that the backpack and lunchbox was empty and the weight was just Steve being a literal clown though",
        "\"I'm the albatross across your clavicle\" is my new villain catchphrase i will scream when people question why i am so annoying and persistant.",
        "Cesare was such a profoundly overwhelming force of a character that I went out of my way to find and understand the wonderful Chris Fleming. I appreciate this show so much, it is so refreshingly good. Thank you all for your hard work and for such an organic story.",
        "When Steve said \"I cant move\" after all of Cesare's monologuing I said \"Yeah.. That's the point\" in perfect sync.... LOL",
        "This series is a masterpiece.",
        "WORTH THE WAIT!! I was having difficulties waking up, not wanting to do chores, but THIS! THIS GAVE ME THE ENERGY!!!",
        "Did we just lose our jobs?",
        "Turns out \"Down\" had loads of foreshadowing about Steve, what is the next opening theme alluding to? In old Venezia, did Cesare make his trade selling marionettes in his ramshackled place? On that hallowed night when Cesare lost his life, is all he remembers the gleam of the knife? He just did vanish with no traces smh",
        "I found this today at 3:00 in the morning and I have enjoyed it in its entirety. The soundtrack was pretty great too. Thanks for making it.",
        "i miss them both already",
        "whoa, what a hat!",
        "i would espect steve but cesare?",
        "THE BIG STETSON",
        "this show is like a burger you have to wait an hour to get at a restaurant, but it’ll taste delicious once you have the burger.",
        "The hammer that Cesare uses to squish Steve looks a lot like the pole thing that the clowns used in Wire. Just a bit of background lore",
        "I absolutely love the part where Steve says he can't move, because it seems so redundant and obvious UNTIL you realize that he's not just trying to move, he's trying to SHAPESHIFT.",
        "These shows are so awesome! I love the music so much! The comedy in this slaps! Please keep making more!",
        "Heavy FLCL vibes",
        "This series slowly became an anime didn’t even notice.",
        "Dude I was just thinking whatever happened to the clown burger kart dude. Then BANG 3 days I have been blessed",
        "ohhhhhhhhhhhhhhhhhhhhhhhhhh this was  so cooooooooooooooooooooooooooool",
        "A war between the two ruling powers of the universe, clowns and monsters. Will the carnage and tragedy never end? Is this the last we see of Steven the clown? How will the Big Top Burger crew get the truck back on four wheels? The suspense is making me squeak with anxiety and fear and awe. I applaud you for the phenomenal show you have put on, and look ever forward to your future.",
        "M A G I C K E T T L E B E L L S",
        "It’s obvious in hindsight but I like how Penny unwittingly foreshadowed when she talked about how Steve was practically sinking into the earth.",
        "So NO ONE is gonna talk about the JoJo like pose at \"that's a lot of weight\" ??????",
        "He MURDLED HIM DUDE",
        "Woooooo!! What an ending!! I mean Steve is stuck in that Overheated microwave land and Cezare Got the coolest jubies this episode snippet had to offer fantabulous imagery sirs!!",
        "Love love love these!",
        "man this shit was insane",
        "And just like that 6 people had lost their jobs",
        "WHAT?????!!!!!!!",
        "honestly the biggest plot twist the episode was that ceasare wasn't actually invested in the burger business or his crew, they were just a means to an end",
        "Does anyone one know the song at 2:30 ?",
        "everytime i'm always more confused",
        "The slight sneer of disgust when Caesar says \"yeah, that's the point.\" Is such amazing detail.",
        "Amazing",
        "The facial expression and character movement in this are absolutely fucking gorgeous! I love this! ;P",
        "2:32 NEVER REST AND NEVER SLEEP \nA THOUSAND YEARS MY WATCH TO KEEP\nTRICKSTER GODS RISE FROM THE DEEP \nTRICKSTER GODS RISE FROM THE DEEP",
        "Cesare's dialogue, attitude, and existence have transcended comedy and have become iconic",
        "I have no idea what the fuck is happening, but that was amazing",
        "Steve said Merry Christmas in the first episode and now he’s being defeated while Cesare says Feliz Navidad.",
        "For the wondering the line \" I'm the albatross around your clavicle\" is a play on the term \" albatross around you neck\". A phrase meaning an associate/ previous  action that hinders one's abiltys succeed",
        "Where can I read the manga?",
        "pleas let the next season be in the \"Wire\" video style",
        "I love the magic effect when Cesare snaps his hands, reminds me of when they'd have 2d animated special effects in older live action movies.",
        "I didn't expect Cesare to suddenly be a badass but im not complaining\n\nAlso, the fact that Cesare can hold all of the items he gave steve with ease implies that either the kettlebells are only heavy for certain people since they're, y'know, magic, or Cesare has super strength.",
        "Definitely has a FLCL vibe to it.",
        "Damn....he got destroyed",
        "My favourite part of the Big Stetson is the fact Cesare doesn’t sound menacing in the slightest. With both other gifts pretty much everything he said was threatening in a sense, but not with the Big Stetson, he was just as innocently excited at such a nice hat as everyone else.",
        "the music that starts at 2:32, anyone know if that's released song of theirs yet?",
        "I thought that lunchbox was suspiciously cool",
        "Everything you create is golden. I knew Caesar was magical! I really do love all of your stuff.",
        "WHAT MUSIC ???",
        "Wait a minute is this connected to the wire? Is there a clown and underworld war?",
        "Well that took a turn",
        "aaaaAAAAAAAH it's unhealthy how much I love these, I would pause my wedding for a new upload fr",
        "I really appreciate the super underwhelming SHWRP when Cesaré just. Leaves via cartoon hole",
        "thought i recognized the name giles corey so i googled it and when i realized who it was started immediately laughing my ass off. god the jokes in this show are so clever",
        "I have no idea what's going on and yet...... I must watch.",
        "So Cesare is a descendant of the vampires from \"Wire\" and is getting revenge on the Clowns, aka Steve, after years of planning. At least that's my view.",
        "Ah yes a new edition to a great series",
        "rewatched the entire series like a week ago i could not be more prepared for this",
        "I love this series so much!",
        "When ya in a discord call at 3:30 am",
        "Steve was involved in the airship raid on the vampire castle, I'm convinced of it",
        "ngl I feel like once the gift is given, it should be up to the giftee as to what to do with it whether that be regifting it or returning it so steve would've absolutely been in the right if he had done that\n(however tim would not have been able to lift the lunchbox to our knowledge as he seems to be a standard human)",
        "WHAT???!",
        "i was randomly suggested this by Al Gorythm and honestly, while I have absolutely no fucking idea whats going on I love it",
        "(could this be an anagram?)\nDown\nPanel\nBackpack",
        "Holy Shit how much of Wire its being used here: the war between clowns and vampires/undeads, the use of expandiple weapons, now i wanna se a full on breach.",
        "This show continues to propose questions without answers and I'm honestly here for it, I love the lore of this series",
        "What is the name of the song while Cesare is smushing Steve?",
        "I want to hear a full version of Down with the redone vocals",
        "The quality looks even sharper than before. Amazing ",
        "I LOVE DIS KEEP UP DA GOOOD WOR",
        "this artstyle is amazing damn",
        "I knew the video Wire had something to do with this universe as well. 20/10 perfect story telling!",
        "Cesare's Upper Management line with him pointing down is such a great moment, it really shows off his personality along with how casual he is even when finally getting Steve after what sounds like quite a bit of time.",
        "THE LOREEEEEE!!!!!!",
        "There is something familiar in Olivia Craighead's voice... dunno why lol",
        "More weight.",
        "Oh the magic kettlebell deleted Steve's beanie cap from existence",
        "When the new seasons of FLCL are no good, I go to big top burger",
        "chris fleming could not have been a more perfect match for cesare",
        "We GOTTA get STEVE back!",
        "can i gibe it 3 likes?",
        "HOLY SHIT HE ANNIHILATED STEVE",
        "awesome as always",
        "Plot INTENSIFIES",
        "The seven months was worth it",
        "THATS STRAIGHT FIRE",
        "I love this series so much, its worth the wait",
        "Omg…Billie even says in the first episode of this season as they’re heading to expo, “I hope nobody dies.” Damn that foreshadowing XDD",
        "hell yeah",
        "I absolutely love this so much!",
        "So glad that we've had two whole episodes now about things being very heavy.  We love you Worthi. <3",
        "Steve: Perplexes, confuses and generally runs circles around his employees but never seems to explicitly reveal himself to be a magic superclown for presumably years \nCesare: Reveals the undeniable existence of magic, blows the mind of every mundane person in the area, causes massive property damage and straight up dips in the span of twenty seconds",
        "Awesome! ",
        "I CAN'T BELIEVE STEVE IS DEAD",
        "WHAT!",
        "He just killed em and that was that holy shit.",
        "Vampires win!?!?!?!?!!!!",
        "Woah this is some of your best work yet Worthi! Great job love all you do <3",
        "I know WIRE has something to do with this, I knew the first time I saw bigtop burger (i still listen to the song it's great)",
        "Im now so interested to see how much Cesare truly does/doesnt care for his employees, I love the Zomburger dynamics so much",
        "I love how Cesare turns into a pole on a hinge when he presents the hat. BEHOLD, THE BIG STETSON!",
        "Wait... Hold on... Dealing with you freakazoids? Upper managment? Magical hammer? ... OMFG WIRE IS CANNON IN THIS UNIVERSE?! THE FAN THEORIES WERE REAL?!",
        "Hey your music in this episode is SO good. Like it's always good but the song when Cesare brings out the hammer rules!!!",
        "Is the concept that Steve is a heavingly angel disguised as a clown and caeser is a demon from the underworld.",
        "There's LORE???????????",
        "Everybody remembers the first time they find out their boss is some sort of supernatural entity tasked with wiping out a species of clowns",
        "I live for these videos",
        "THE SNAP AND REVEAL. STEVE STRUGGLING. CAESARES DEAD PAN \"Yeah. Thats the point\" AND TRACKING SHOT OF HIS WEAPON (and a tracking shot than wraps around the setting in a semi circle too!!!!)!!! Its perfect!!! I want this tattooed on my brain!!!!!",
        "I need a full version of the song that plays when Cesare hammers Steve. I need it so damn bad.",
        "Fav line and a thing I wish more villains would say\n\"Yeah, that's the point\"",
        "I’m getting MAJOR FLCL vibes from this episode, I just love each and every one of these when they come out, and the music as always is just a knockout.",
        "I honestly can't wait another several months (I will if I have to) for the next episode. A cliff hanger like this is making me scream",
        "I can't believe this whole series was just a long con by Cesare.",
        "0:25 That might be the sickest burns in Animation history",
        "Apparently in the Worthikids cinematic universe, the undead have mastered the extending spiral pole tech from the Wire, used by the freaking SWAT clowns",
        "In the end he faced off with the faceless (everybody else wears makeup, i.e. not their real face), and then literally vanished without traces.\nWhat an absolute lad.",
        "\"I still have ONE MORE GIFT....TO GIVE YOU!!!\"  love the pause",
        "At this point, it may as well all be connected to Wire and Witch Tinder. I have no idea where any of this leads.",
        "HECK YEAAAHHH finally, my dose of clowns, Weirdness and Absolute GOD TIER songs",
        "I adore Cesare's little victory dance before he absolutely smites Steve",
        "Can smb explain the \"albatross across your clavicle\" part",
        "Nobody is talking about the 7 month break before a 3 minute clip this animation is way too good to keep us in wait like this I understand masterpieces take time but fuck man I would make a go fund me page for a tv show of this",
        "Oh man, Chris Flemming is absolutely killing it as Cesare",
        "Cesare noting the cost of the kettlebells while at the same time paying thousands of dollars per hour to his employees",
        "Nice song",
        "Worth the 6 month wait",
        "WAIT A FUCKIN SECOND\nDoes the line \"I don't normally need help catching you freakazoids\" mean that Cesare is a CLOWN HUNTER?!! HE CATCHES CLOWNS, THAT'S HIS JOB",
        "I had no idea Cesare was trying to capture Steve, I genuinely though his whole plan was to inconvenience him with incresingly heavy gifts",
        "what if steve is a escaped convict wanted to live among the humans \nand opened up burger joint\nand cesare was sent by boss\nto capture steve",
        "See you guys next year",
        "“Behold… THE BIG STETSON!”",
        "Now this is a shonen",
        "The music in this episode is the best so far",
        "Eye on the wire but I won't trip it!!!!",
        "This is animated beatifully\nThe voice acting is stellar\nThe writing is exquisite\nDefinitely worth the wait",
        "I'm so glad I got this in my recommended. I wish I did sooner.",
        "Holy shit, does this tie into \"Wire\" at all!?!",
        "the plot thickens",
        "Literally always worth the wait. Good job Ian1",
        "i love that frances looks up when cesare mentions \"upper management\", then down when they realize cesare is actually pointing down",
        "What are the lyrics that are sung while Cerare slams steve to who knows where?",
        "Oh I really hope they make more episodes to finish season 2 of Bigtop Burger, this episode threw me through a loop. I so did not expect that to happen at all.",
        "You gotta admit all of us were both in awe and shock during this episode",
        "steve! Steve!! STEVE!!!",
        "It's so FUCKin cool to see Cesare show his abilities and tactic. This episodeal masterpiece will go far.",
        "Can we talk about how Cesare was easily carrying those heavy items?",
        "The animation in this is amazing. The way you animated the crews reaction to Steve getting hit with the hammer is so smooth and satisfying. You are my absolute favorite animator on youtube!",
        "I've watched this episode like a solid 6 or 7 times and then rewatched the series again and again god dam you good! \nHonestly dude mad respect, that Switch in this episode is superb. Perfect timing and the way you build up to things just magic.",
        "if these arent full songs already they absolutely need to be, and I can't stop watching this god damn",
        "Yessss, I love this series, always happy when another episode comes out",
        "Continuing to collect the lore of the Clown/vampire war",
        "The dialogue, voice actors, and performances are all just so good and over the top lol. I love this series so much",
        "That song when Steve gets absolutely CLOWNED by Cesare goes too damn hard! Can't wait for Worthikids to drop the full version!",
        "I hope this continues I want Steve back",
        "Wait is this part of the wire video?",
        "DUDE being able to watch a masterpiece that is this episode after half of a HELLISH week I've been having is like finding $50 after I've been violently thrown into a dumpster",
        "Man no wonder cesare is the new face of the channel. Everything he does and says is pure gold. What an awsome villan",
        "YAY PART 2!!! THAN YOUUU",
        "Realizing this is connected to Wire (More than likely) for the first time O.O",
        "Cant wait for the lore and story theory videos while we wait for the next episode. Whole undead vs clowns is so amazing",
        "That remix of Down starting at 2:30 goes so fucking HARD",
        "THE BIG STETSON!",
        "I wonder if the hole Cesare makes after hitting Steve is connected to the hole Conrad saw at the start of the season.",
        "This show is hilarious, and also perfectly showcases how much anxiety I feel when I get an unwanted gift.",
        "THIS YOUTUBER IS A LEGEND!!",
        "So, uh, why didn't he just drop the \"lunchbox\"?",
        "Bruh this show be awesome 10 outta twn keep it comin!!!!",
        "Wait a minute! The extendo pole thing that cesare uses is in the \"Wire\" short that Worthikids made but the one using it is a CLOWN. I think they caught the other ninja clown gang and are using their tech!",
        "This would make a killer adult swim tv show. In all honesty there should be need more outlandish series like this",
        "Damn, good music",
        "Bloody perfect episode! Love this",
        "I mean, this explains why Steve always seems so unnerved whenever Cesare shows up. But who is upper management and are we certain this has nothing to do with Wire??",
        "I could SO watch 4 seasons of this, the facial expressions are amazing and Cesare's demeanor is so funny!",
        "Please for the love of god make posters of your creations and MERCH LOTS OF MERCHANDISE",
        "I really wish I could see a full length TV series of this, it's golden",
        "Would it be a bad idea if a send this to my bf saying \"us ️\"???",
        "even though it's a little youtube mini-series, the talent and charm this show has is astounding. Worthi you are legendary and I pray that nothing muddles your creative direction here. You take your time and work your magic!",
        "This was an incredible episode! Love that style when Cesare crushed steve along with that music!! a great feel to it!",
        "God Chris Fleming is such a good voice actor. I love his improvisations and how well he plays Cesar.",
        "What Conrad said about where they got their money makes a lot more sense now.",
        "So wait does mean Wire is also apart of this universe?",
        "I feel like worthikids could make a Netflix series out of this and I absolutely love it",
        "bro this is not bad. i dont watch anime",
        "going back and rewatching \"wire\" after looking at how this ended really leaves you with some questions about the timeline of this whole thing",
        "STEVE NOOO",
        "Okay, the animation is gorgeous and smooth in occasionally unnerving ways, but I am still impressed at how well it compliments and enhances the dialogue.\n“Tim… look at him.”\n“Felix Navidad, my good friend.”",
        "ahhh\nso it all ties back to the Wire in the end. Lol",
        "where can i find the full version of the song in the intro? it sound so good T-T\nNVM I FRIGGEN FOUND IT ITS ON THE ALT CHANNEL HECK YEAH BABY >:D",
        "Bigtop never fails to make me bored",
        "\"clowns aren't real\"\n\nAlso, NO STEVE!!",
        "Worthikids blessing us with more Bigtop Burger. Thank you good man!",
        "This is my favorite series",
        "getting some STRONG FLCL vibes from this series\n\nand i am 1000000000% for it",
        "ligma",
        "This is the first episode I saw come up on my feed randomly and I was so intrigued that I’ve watched every episode … 3 times. And this one is SO FRICKEN COOL! I get energized just watching it again! \nEverything was “on point”! ",
        "as always its masterpiece of comedy and storytelling\namazing art",
        "As someone who works in animation, Bigtop Burger is incredibly refreshing. This show never tries to be anything that it's not, and with that, just so happens to be one of the best shows out there. It's not a super-polished series from a huge moneymaking streaming service, and it's perfectly good on it's own without needing that gloss and shimmer. It's a 3D animated show that feels like it's in traditional 2D, and it uses it's style to a huge advantage and isn't afraid to bend and twist things a bit. Bigtop Burger gives me hope for indie animation.",
        "MORE",
        "Love the way the crowd's clothing fluttered intensely after the shockwave from the hammer, and gradually stopped moving. Great action detail. Love your work!",
        "DOWN",
        "Caesar was absolutely wild this episode I don’t even know how to put into words how over the top he went",
        "I have now rewatched all episodes 3 times since this one came out now and still get a kick out of it",
        "Omg I'm invested this is hype",
        "Fuck, man, everything about this is sick as hell and the music absolutely makes it. Can we just appreciate the fact that the version of 'Down' we get in this has a fucking KEY CHANGE? Such a killer episode.",
        "Cant say its been a pleasureee lmao <3",
        "1:09 oh my god he's peaking the mic",
        "Top five anime battles",
        "I mean it was a nice hat",
        "What is the fucking song called that plays during the hammer sequence?",
        "This episode is absolutrly mind-blowing. I love how the series' going! Excellent job. Awesome artstyle",
        "This series saved me from the throes of deepest despair. Thank you. Love clowns now",
        ".....wtf just happened here??????",
        "Throughout this season, I never expected Cesare to become the albatross across Steve's clavicle, but here we are.",
        "HELL YEAAAAAAAAAAAAAA",
        "Was not ready for that,at all",
        "I think you outdid yourself this season and especially this episode!",
        "See y'all in another year",
        "ive quoted every line from every episode cant wait to add more to my vocab thank you mr worthikids\nedit: HEY SO WHAT THE FUCK",
        "i need the outro song",
        "peak\nm",
        "WHAT! What a twist! How long has the plot been going on? Feels like this is over a pretty short amount of time. The Bigtop clowns didn't know their boss that well. And all the LORE!\nThere was some awesome motion and some freakish expressions this episode too. Oh man oh man, I just wanna see more! Dang, you're good :D",
        "what makes that little clown so special...who is he...i am so intrigued",
        "1:19 “Behold! The Big Stetson! ” Honestly my favorite part for no reason other than Cesare.",
        "This just further proves that the 'Wire' video has canon connections to Big Top, people who weren't 100% sure about it can be fucking certain now.",
        "Where can I listen to that song from the hammer scene???",
        "Anyone else think the child saved in the wire video is Steve and it all plays off the other world",
        "The scariest part about this is that now they're all unemployed. In this economy no less ",
        "bro steve got fucking obliterated",
        "This needs to be commissioned knri a Netflix series",
        "That hammer sequence would explain why it took so long for this to come out.\nAbsolutely marvelous!",
        "YESS, YOURE BACK!!",
        "There is a small chance that the “trickster gods” rising from the deep ARE the clowns, and the only ones who can put them back where they belong are the undead. But even if that were the case, Steve does not seem evil.",
        "Yeah!!!!\nVampire vs Clown!!!!\nHow long I nave been waiting!\nI fkin love you guys!!!",
        "Oh i just realized, the theme of the clowns is up, this episode is named down.",
        "I was just thinking about this show..... What a coincidence\n\nI miss my friend, they introduced me to it",
        "This is phenomenal for my theory that Wire is cannon in this show and there's just always been a separate world where the clowns and the halloween creatures are at war. Pissing my pants watching this, I hope Steve is okay!!! ",
        "Remember the first episode of this season when Billie said \"I hope nobody dies\"?",
        "...BUT THE FOOD TRUCK GATHERING! HOW WILL STEVE WOW THEM WITH HIS BURGERS NOW!?",
        "Can someone tell me what songs where used for this episode? They are very good ",
        "Oh hey! It's back",
        "Going by the mention of 600 buck each, (and the how unlikely he'd mention the cost) in some American slang a buck is a hundred. So sixty thousand pounds each, 180,000lbs. For reference to my fellow Europeans, eight metric tons.\nMeaning Steve was ordinarily walking about only quite inconvenienced by around five tons.",
        "Does this mean the gold that Cesare uses to pay his crew is fake as well?",
        "Cesare had Goth Magic! Oh no! What will the Bigtop Burger Buddies do now?!",
        "I am absolutely loving this series! The grunge aesthetic reminds me of something that would’ve played on MTV in the 90s or Y2K along side Beavis and Butthead or clone high.",
        "I CANNOT stop watching this",
        "WhaaaaAaaaaaaat",
        "1:25 “feliz navidad” HAHAHA I love it \nI really like this series :_)",
        "One of, if not the best youtube animations. Love the characters, the artwork, the music, the voice acting, and the humor. Always eagerly waiting for the next episode.",
        "I pray you guys make millions",
        "Now I must wait for the full song for the hammer smashing scene.",
        "the best!",
        "where i can liste to the whole song?",
        "Its amazing how 4 mins of this can engage me more than an entire season of most shows",
        "I… think Steve’s in that cylinder",
        "I love Cesare just casually referencing the death of Giles Corey in the Salem witch trials",
        "OH NO HE’S HOOOT",
        "My conspiracy brain is thinking the reason Cesare captured Steve is because Steve's involvement in the rescue operation in Wire",
        "“Haha! I’m the albatross around your clavicle”   \n“I’m gonna stand out like a horseshoe crab in a fresh water environment “\n“You wanna take sucker shots at my banana cage”\n“Hiking up my Jeans looking for loose lint”",
        "BEHOLD. THE BIG STETSON! >:]",
        "It’s like 6 regular people getting caught in some wild competition between 2 demigods. I freakin LOVE it",
        "still just was a ep or album of full song that seem to be make by ya'll not just from this show",
        "Imagine getting credited for a voice, but the character you voice only appears and doesn't say anything.",
        "The surrealism that isnt dying to be explained is one of the things that keeps me watching this show. This is the big reveal, and it was perfectly executed. The influences on the reveal were perfectly executed. I saw a lot of naruto, not just visuals but pacing too, and it was a fantastic descision. Theres a lot to dissect here, the only thing i hate is the wait that i know is coming haha.",
        "Holy shit a Giles Corey reference? That’s deep",
        "Just realised that Action Sequence Cesare has big JTHM vibes, and I love it",
        "Chris Fleming remains the absolutely prefect casting for Cesare, Worthi's animation and Fleming's delivery are a match made in heaven.",
        "The strangest part of all of this is that the lyrics of the songs make it sound like Cesare is the good guy? Like, Steve is some kind escaped Trickster God and Cesare is supposed to keep them in check",
        "sooooo is wire connected to this? the song featured characters that would be similar to the 2 foes here",
        "love the song that plays when he crushes steve! what's it called/where can I listen to it?",
        "I KNOW IM LATE BUT OMG ITS HERRREEEEEEE",
        "The L was wrong!",
        "This made me go back and watch a bunch of worthi's old vids and its really awesome to see how much he's grown as an animator over the last several years.",
        "That's not a parking spot, that's a hole!",
        "NOOOOOOOOOOOOOOOOOOO!!! STEVEEEEEEEEEEEEEEEEEEEEEE!",
        "this video goes places so hard.",
        "Much fucking better then chainsaw man",
        "\"Why don't we ever get any gifts?\"\nWow, says the guy with 4-figure hourly pay.",
        "2:45 Oh hey, that's my expression for this episode as well",
        "pays his food truck employees thousands of dollars. brags about 1800 worth of magic weights.",
        "I love thisss so much",
        "Damn, what a cliffhanger, excited to see more :)",
        "Cesare looked shockingly cool all of a sudden, and my jaw literally dropped! Worthikids only makes the finest of art, and I love every second of it!",
        "This series has a certain charm and quirkiness that can't quite be put into words. Can't wait for the next episode!",
        "Oh fuck yes",
        "I need more of this stories lore ight now!!!",
        "EXSCUSE ME HOW DARE YOU CLIFFHANG US LIKE THIS????",
        "Holy shit",
        "I loved the part where Steve said it’s steveing time and steved all over the place",
        "This version of Down (the song) sounds a little different and I neeeeeeeed it",
        "The moument when the music stops and then comes back with vocals in full swing goes so hard",
        "I just want this song to drop more than anything.",
        "You know, Cesare looks a lot like Cesare from \"the cabinet of Dr. Caligari\"",
        "Can we please talk about how this could connect to wire and the clowns vs monsters battle in which Steve does show up in the background!? Does that mean we might see those characters rescue Steve in a future video!? I need the monster clown lore!",
        "This was really cool",
        "I’m so glad that this is back, even if it’s not gonna be a while before it’s back.",
        "I won't be leaving a comment because I have no words POV:",
        "That ain't the end, is it?",
        "I’m so unhappy I was born at the wrong time as all the episodes aren’t out",
        "I kinda feel like this is now a canon continuation of wire",
        "\"THE WIRE\" IS IN THE SAME UNIVERSE AS BIGTOP CONFIRMEDDDDDDDDDD",
        "2:30 I love this scene",
        "2:28 whaaaaaaaaaaat. What did i just watch. This is dopeee",
        "We gonna see Steve fight some vampires???",
        "HOLY CRAP THEY'RE BACK!! \n\"FAITH IN HUMANITY RESTORED\"",
        ":0",
        "2:21 he doesn't \"normally\" need help catching \"freakazoids\". it's likely his purpose for being resurected is to eliminate \"real\" clowns, and we see the clowns in Wire with an extendo pole to hold a portal open, so Cesare's extendo hammer is pretty normal",
        "When Cesare says “Feliz Navidad, my good friend” it’s a reference to the first episode when Steve says merry Christmas to the guy he gives a burger too",
        "I cherish Cesare's clap with zero sound proofing",
        "Did he just make a Giles Corey reference ",
        "Cesare is giving me evil Jeff Goldblum vibes, I love it",
        "This episode was intense.. Hope Steve's okay",
        "If you expect me to think he'll go out like that, you're joking.",
        "IS THAT THE GRIMM REAPER?!?!?",
        "NEW EPISODE!!!!!! I'm so happy! This show single handedly helped me get over my fear of clowns!",
        "Where can I find this wonderful music?",
        "The plot thickens",
        "Cesare: Conrad, if you take those contacts out, you'll blow my cover!\nAlso Cesare: Magic lighting fingers, giant hammer, and teleporting through a portal to the underworld",
        "Don't know if it's intentional, But Cesare does the \"L\" on his forehead wrong.  It's backwards.",
        "Okay, so this episode confirms that Cesare doesn't just have a personal vendetta against Steve, but actually hunts down clowns for some supernatural entity. Based on the fact that people in the modern day only relate clowns to the performers and see \"real\" clowns as just a myth, it would seem he's been fairly successful at this",
        "this made my day",
        "Is he gonna post this version of the song \"Down\". Not that the old one was bad but this one really slaps! I know he probably recorded the whole thing over again because when he did it two years ago it had the same lyrics but I don't even think he used the lyrics in an episode till now so clearly he's not apposed to recording the whole thing just to use a snippit!",
        "I need to know what the song at the end was when Cesare swung the hammer",
        "This is hands down one of the best animated series I've seen. I LOVE everything about it! The humour, the animation, the voice acting, the characters, the WORLDBUILDING! Thank you for this Worthikids!",
        "In less than 30 minutes, I fell in love with all the characters in this series. Truly outstanding talent.",
        "The gutair is so good",
        "in the 7 months (jesus christ that went fast) between this and the last one i saw the weight of unbearable talent, which led me to watching the cabinet of dr caligari, which i just realized cesare's name might be a reference to",
        "Everybody’s (rightly) talking about the animation, but can we take a minute acknowledge the beauty of THE BIG STETSON!",
        "That was so much rock and roll action",
        "Before this, I assumed Cesare had literally hidden weights inside the backpack & lunchbox. Boy am I glad to have been wrong. Absolute genius villain plot.",
        "I have NO IDEA! about what I just watched…but I love it",
        "I love the version of down used here because the original sounds ominous but this one is like triumphant like a victory song for something sinister",
        "Man what is this shit wild af, yet somehow so elegant.... I don't know how I got here....",
        "Omg wth",
        "1:26 Conrad's naivety is so funny and endearing  lol",
        "WHAT IS THIS INCREDIBLE SONG??",
        "So the clowns vs undead universe is expanding...",
        "Can’t wait for season 3",
        ":O",
        "The best part of the entire episode (for me) is the line that comes in and out on the right side added to Cesare's lip when he says \"yeah, that's the point.\" The line itself and the screenplay is so much more deadpan than anything else in the series and is the best delivered line all season, and the way it's animated comes off as a small snarl.",
        "Wish I could have the songs from this episode",
        "Everytime Cesare claps I fucking lose it",
        "WTF WAS THIS",
        "That was definately a lot of weight",
        "2:14 Giles Corey was charged with witchcraft during the Salem Witch Trials, and to extract a confession he was pressed under a slab and crushed with progressively heavier rocks. Unlike other subjects, who either confessed to whatever the charges were or claimed innocence to their death, Corey refused to plead altogether, just responding to the interrogator \"more weight\". Unsurprisingly, he eventually died.",
        "Tim's world is crumbling around him rn. That lunch box is the only thing that has made him feel passion since he decided not to fight that elk, and it wasn't even a real lunchbox",
        "\"Yeah, thats the point\"\n\nunironically fucking raw, jesus christ this is an animated YT video there is seldom reason to rival diamond with how hard it is",
        "So much plot has just happened I love it",
        "Best looking animation of the present day, music is absolutely masterful, voices are incredible... please never stop.",
        "um what",
        "man i love bigtop burger",
        "Wait is Cesare a clown hunter",
        "I love how his crew loves the gifts and are just feeding into it",
        "Damn these take so long to come out but are so short. Get some chinese kids to work on these already.",
        "I've rewatched the capture sequence at least a dozen and a half times, it's absolutely amazing how much detail there is. The extension of the handle, the slight growth of the hammer's head until it quickly 'pops' into full size, the two-frame slamming of the hammer, the scene color switch, the rippling wind of the high-quality characters' hair (and hat), the perfectly lit scene/characters by the lightning, the slow-motion propulsion of the trucks, I mean it's all insanely beautiful. For someone who doesn't work in animation, the entire show, and especially this episode, has amazing graphical effects and meaning behind each element. Absolutely amazing work and I cannot wait for the next episodes!",
        "is Steve a member of the Clow Squad from the \"Wired\" Short?",
        "everyone's fave part: 2:30",
        "Feliz Navidad! :D",
        "What was the song wtf",
        "What the song that played when ceaser uses the mallet? I've been looking the worthikids music archive and can't find it",
        "The fact this rivalry has presumably lasted an extremely long time, but the scheme that does in steve is the fucking magic weights.",
        "The Clown vs. Undead war from Wire was canon all along.",
        "I wasn't expecting such a stellar action sequence--the twists--the TURNS this series takes! I adore Big Top and its eccentric characters. Thanks, Worthi ^-^",
        "The music this episode is going rambunctiously hard",
        "What a fantastic conclusion to an amazing story can't wait for more",
        "Knowing the rivalry between the clowns and undead, in a previous legendary video- I hope their ready down there for all that is Steve",
        "I have been absolutely obsessed with this episode since it came out, good lord this is some of the most out of nowhere shenanigans I've ever seen.",
        "Holy crap, the FTX sponsor",
        "the artstyle change during action sequence got me",
        "I just realized when he said \"I don't normally need help catching you freakazoids\" Cesare is referring to clowns, meaning that there really is some beef between spooky goth creatures and clowns going on",
        "I love the connection to “Wire” with the extension rod being used by both the father clown to keep the portal open and by Caesar who attached a hammer to one end to squash Steve",
        "Oh God I'm seeing so many f**** JoJo reference poses in this",
        "oh shit, oh yeah\n\nOH YES",
        "This means that our understanding of undead being at odds with clowns from wire is in fact cannon.",
        "this video kicks ass",
        "what. what. WAHT. THE UNDEAD/CLOWN RIVALRY/WAR IS- OH MY GOD",
        "W8 was bigtop burget a prequel to WIRE?",
        "EVERY EPISODE IS BETTER THAN THE LAST AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAH!!!!!!!!!!!!!",
        "\"This is Giles Corey style steve\" what an underapreciated joke lmao",
        "Can't wait for the soundtrack release\n\nThe lyrics go so fucking hard so far",
        "STEVE D:",
        "So.. when is this song dropping? Er, the remade version this sounds so much better!!",
        "That was crazy! I don't know how else to describe it. I thought this was gonna be some slice of life thing but the story runs deep. I rewatched this episode so many times now",
        "For those who want lyrics for 2:33\n\nNEVER REST AND NEVER SLEEP,\nA THOUSAND YEARS MY WATCH TO KEEP,",
        "I love how cesare is animated to perfectly match Chris's weird ass delivery of every line",
        "Goes missing for like 7 months\nComes back\nKills Steve \nRefuses to elaborate any further",
        "Wonder what the song is that plays when he unleashes the hammer. It rocks.",
        "does it matter if they are 600 hundred bucks each if Cesare has a magic money hole? (like an actual magic money hole in the dirt)",
        "2:30 for hose who want to rewatch that badassery",
        "The way Cesare is just like \"Later\" and just nopes out of their plane of existence after pulling such an amazing series of shots with that mallet... This show is so good the only problem is that there isn't a full length series.",
        "Whoa. That WAS a nice hat",
        "Does anyone else think that this ties into the lore of Wire, which was also animated by worthikids?",
        "I know these are short but they are always so amazing!",
        "That went so raw, time to rewatch it 100 times!",
        "Wasn't expecting things to get so serious. I hope Steve is okay.",
        "i swear you always end these at the worst spots and then leave us in the dark for months on end",
        "Please tell me this isn't the end for Steve.",
        "So he’s a Zombie that works for the Vampires right?",
        "I am sincerely hoping that we are all keeping in mind the WIRE music video",
        "I am still waiting for part 2",
        "I’m so glad you are making these, nobody could do it like you man. ️",
        "BUT WHY ARE THEY BEING HUNTED????",
        "The animation here is absolutely phenomenal, it gets better with every episode. I just love everything about this show.",
        "More",
        "This series deserves all the love in the world, it’s so great. \n\nAll hail bigtop burger",
        "We can all agree that he never disappoints us with his content ⁦⁦",
        "can't stop rewatching the entire show, totally looking forward to the next episode!",
        "Honestly how could you top this?",
        "Friends from Low Places and Down are legitimately solid songs. I've been listening to them for the past few months and it's just wonderful when they pop up",
        "I can't wait for the song at 1:55 to be on Spotify. Pleeeeease put that thing on Spotify",
        "IT CANNOT END LIKE THIS",
        "Damn Cesare is one strong boi! He carried and lifted that stetson like it was weightless!",
        "Love this, love you",
        "Tim’s continued obsession with the lunchbox never ceases to amuse me",
        "Hi Ian, nice to meet ya",
        "I like that Cesare implies that he got the magic kettlebells from some otherworldly being, but also payed for it in American currency",
        "can we just pause for a moment to appreciate that Cesare spent like 1.8K just to make steve stand still so he could hit him with a mallet lmfao",
        "NOOO STEVE",
        "Wtf did i stumble on",
        "I was honestly not expecting Caeare to be some kind hunter. Also him and Steve are like from hell ",
        "How is no one mentioning how easily Cesare carries those magic kettle bell tho ",
        "THAT DELIVERY OF \"Yeah, that's the point\" DID IT FOR ME!!!",
        "2:50 I can’t believe he spent $1,800 to kill that guy.",
        "STEEEEEEEEEVE!!!!!",
        "Love this. The moment when he just disappeared into a hole in the ground was great",
        "I like to think Cesare its just make all this slowly because he wants to spend time with his crew before he goes away",
        "Great stuff",
        "WOW! :D",
        "This episode blew me away man",
        "Does anyone know the song at 1:56 till Cesare leaves",
        "I love how it's been 2 seasons and we have yet to see a single burger be cooked",
        "How can you create such a hype and cliffhanger... WITH LESS THAN 4 MINUTES ?!!?!\nI want to see what happen next !! TT-TT",
        "As someone who works for a food truck I can confidently say this series represents the life well",
        "Worthi comes and goes from this mortal plane like an angel’s kiss. He drops quality content, then he’s already gone again.",
        "Your work with this franchise has brought me more joy than you could ever know I thank you from the bottom of my heart pit.",
        "Hey now, hold on there buckaroo. That metal piece during the hammer scene was pretty clean. You got a full song coming soon?",
        "did we just witness zombie on clown violence?",
        "I know that we wish worth kids would post more content in their channels. But animation takes so long to make, even if it’s a 30 second video. But hey it’s worth the wait when we get quality shit like this ",
        "Does this mean the end of the series?? Im so nervous",
        "This looks like an extended Japanese RENOWN clothing commercial. The styles cute. The plot and narration is very American-adult-stuck-in-adolescence vibes; like Rick and Morty.",
        "Didn't realize this before, but the hammer scene is just a cover of \"Down\" that Worthi made over 2 years ago. Nice lil touch",
        "The suspense is killing me! Is there going to be a final showdown between Steve and Cesare?",
        "Twas very excited for the release of another bigtop burger episode, another amazing bit added to the franchise, I hope the song gets it's own release too, it got me soo hyped up",
        "The music and the humor really makes this series along with the unique animation this whole channel is just my cup of tea.",
        "“Feliz Navidad, my good friend” combined with Cesare grimly carrying the hat was perfect\n\nEdit: holy crap the hammer scene",
        "This was one of the best battles of HunterxHunter I ever seen. At first, I didn't think Cesare was an interesting nen user, but this episode really show how well he can use his nen. I can't wait to see how Steve will use his nen ability to get out of this",
        "Cesare is so powerful and devious that his mic cannot handle his sheer pressure from just existing",
        "ARGG IM SO INVESTED I CANT WAIT FOR THE NEXT EP",
        "Is no one going to talk about how the Food Truck Expo is called FTX . . .",
        "Some DEEP LORE",
        "Beese churger",
        "WOAHH!! i though ceasar was a rogue undead just like steeves probably a rogue clown\n\ndidnt think the other diamention clown vs undead war was still aplicable for them beyond a rivalry  THIS TWIST IS SO GOOD",
        "is this 3d or 2d wtf?? animation is so fantastic",
        "Oh snap the hole that we saw at the start of the season\n\nIt might be major info",
        "So is Steve dead or…",
        "is-..is steve related to the clown pirates guys from the other music vid? and cesare with those other guys who took the lil clown girl?",
        "Will we get “UP” next?",
        "I’m a little worried about Steve. ",
        "Steve’s gonna end up hecka muscular after carrying all of these gifts ",
        "NEVER REST AND NEVER SLEEP\nA THOUSAND YEARS MY WATCH TO KEEP\nTRICKSTER GODS RISE FROM THE DEEP\nTRICKSTER GODS RISE FROM THE DEEP",
        "I wonder just how heavy those weights really are because it obviously took A LOT of weight to actually stop steve in his tracks",
        "I'm really ashamed I like this series... I'm too fucking old bro.",
        "Worthikid only makes animated video to make music",
        "im pretty sure half of this show is improv derived from chris fleming spouting bullshit into the microphone",
        "No wonder why it took almost 7 months.. the animation of each clip is outstanding! You never fail to disappoint!",
        "I have a feeling that Cesare is not a human (Clearly from his magic stuff) and that Steve is a clown and that they have some rivalry together\nCesare is trying to wipe out clowns while clowns are just trying to live",
        "Dear god... I don't think 600 bucks is referring to the monetary value of the magic kettlebells. I think it's referring to the weight. The only foe up until now that gave Steve pause was that buck in the woods. Somehow, Upper Management has found a way to contain the strength of 600 bucks and put it into a magic kettlebell. Thanks for reading my TED talk.",
        "mmm yees more story, more lore, i feast",
        "I don't believe this ending. I can't believe him. You can't end the story like that. Please continue. It's too cool. I love Steve. Steve!!! P.S.=mi-a placut foarte tare tot ce ai facut, sper ca vei continua cu Steve.",
        "Does anyone else notice when cesare says upper management he points down ",
        "well that was anime as hell",
        "It has not been 7 months! No way! It feels way longer!",
        "This is 3D???",
        "HE JUST BOOPED INTO THE GROUND",
        "wut just happened"
    ],
    "comments_disabled": false
}