{
    "video_id": "9m22bsevQLs",
    "comments": [
        "Brent’s best video ever ",
        "2:33 thats alot",
        "Hi I'm Jealena and I live in the Netherlands but I want to see you so bad and tell Lexi she's flexible bye ",
        "Ben and Pierson go for the challenge",
        "Brent ",
        "Can we all appreciate how Brent is so nice to his friends leaving them in his own video and having fun",
        "I love when Liv said (My little sweet pea) it was so funny",
        "I love Drew. He’s a whole vibe ",
        "You've gotta love brent videos at 1am in the morning!",
        "black & pink = blackpink in your area",
        "Brent is ok if I get an iPhone lol",
        "4:31, Ben's a genius, he thought outside the box.",
        "HOWWW does starbucks taste i am dying to knoww",
        "I find it funny how the guys were using the color cart that Pierson had for this video and Pierson had the cart the color of Brent’s shirt",
        "Love your videos",
        "1000 Likes",
        "Bro when you partied in the early morning that was so funny and I’m a subscriber",
        "Just seeing one color for 3 days would already drive me insane ",
        "Done done done done done done done done",
        "Pierson is my fav I’m so happy she won.",
        "Don't waste food atleast ",
        "One of the best things about this dude is that he never takes credit for himself when he uploads something. He always respects us, the audience, and he is always full of energy in his videos. Keep up the hard work!!supagreatman!",
        "Brent I like how Pearson had to eat a snail",
        "I just realized that the squid ink pasta is actually a jojo reference\n                   (Anime that looks gay)",
        "I LOVE all the videos especially the video with the hotel and somewhere else instead of America. All of you guys al like a family who lives in a world full with fun and and love, I love y’all and your videos. Keep being amazing!!!️DOOOOOOOONEEEEE",
        "I like Lexie",
        "Give your life to christ",
        "Done!!! \nI love your channel and I think your one of best YouTubers in the world ",
        "I just want to says thanks for the long-standing community of nerdfighteria because I’ve probably heard this story at least three times, but it’s always wonderful. It’s very much like hearing the stories your friends and family tell again and again",
        "Nice ",
        "Does anybody knows that Brent copy Zhong thumbnail? If you do know type it in my comment",
        "We’re these two colors for BLACKPINK? Are you a secret fan, Brent (actually based on your thumbnail)? ",
        "I want to throw pies at them",
        "Lets just have a moment of respect for technoblade, who faced two people in creative mode and still got out alive",
        "The chefs reaction to there comments about his food: ",
        "i like the vid",
        "It was actually a good time",
        "hello,",
        "I like his sister",
        "i like     your     mach",
        "Im feoom Kosovo but i know english",
        "Hey Brent your prob the best youtuber out there I like your content:)",
        "wow, thx Brent and amp for makin vids so interesting",
        "The blink part of my heart is happy <3 but honestly brent ur videos are just amazing! i cant help watching at least 10 of ur vids a day!",
        "No",
        "Brent you copied zhong",
        "I like it when everytime Pierson eats something gross, she drinks mountain dew a lot",
        "Brent how much years are you old",
        "Where is sister????....",
        "Done I love all your videos all the videos or make are so cool I'm your biggest fan biggest biggest fan",
        "Brent I think you should get back with eve",
        "Ben is really the best and if you really pay attention, almost all of his videos are successful",
        "Pierson is the biggest mood in this video ",
        "Omg brent rivera cant i get a shout out pls",
        "Babe you're my favorite YouTuber and I was about time until you send me a plane ticket so for my mom my brother and cuz you're my favorite teacher so please send a picture all three of us 3 and by the way my name is Lexi",
        "PIERSON IS THE BEST WITH BRENT, BRENT AND PIERSON SITTING IN A TREE KISSING ALL THE TIME",
        "That would be a fun video",
        "Black in pasta and chicken hearts are both one of my favorite dishes",
        "aaaaaaaaaaaaaaaaa",
        "brent's videos are always good",
        "I love you brent️️️",
        "Done done done done done done done",
        "Poor Ben and Pierson looked so done ",
        "You should do this again but bigger like more than three people and whenever somebody gets out  everybody else is allowed to take one thing and eat it from that person that got eliminated",
        "If you don’t know what I’m going to do if he doesn’t confess to Pierson that he likes her! Like for REAL AND START DATING (if not already)",
        "Why did Persion get a green cart it does matched her",
        "to djmariobros sry but i wasnt planning to like anyway",
        "Done done done done done done done done done done done done done done done done GOOD JOB PIERSON!!! CONGRATS ",
        "Great vid Brent! I loved it. Keep up the good work ",
        "Done. Done done.done.done.done.done",
        "Y’all we need to make Brierson official",
        "Your videos are the best you make me smile and laugh I love your videos this was so funny congratulations pierson! <3",
        "Hope youll gonna visit Philippines soon. ",
        "Can you comment on my comments sometime soon I would like to see if you could. ",
        "Shoutout please",
        "Did you get a hair cut?????",
        "My favorite part is when she says is that my dog",
        "done<3",
        "O vídeo não é para https://youtube.com/shorts/KANk5q_dsa8?feature=share vamos tirar um momento para apreciar quanto esforço ele coloca em conteúdo para nós. \n\nFalar com o youtube é como viajar no tempo, é sonhar acordado, é uma lição de vida.... um poço de resiliència e um sorriso genuino que nos \"abraça\" sem nos conhecer.",
        "But there is 168 hours I  a week?",
        "Is ThAt My DoG",
        "PLEASE STOP SAYING \"OMG\" BECAUSE IT IS A SIN TO GOD ALMIGHTY!!!\n\n\nPLEASE STOP DOING THAT BECAUSE IT IS WRONG TO GOD ALMIGHTY!!!!!!",
        "lets get this video 400k likes so brent can eat spicy food and pierson and ben can get revenge lol ",
        "Good job pierson ",
        "What happened to Caleb? \nIf you miss Caleb",
        "Hey Brent, I’m you biggest fan and I wish I were in the hole video with you and Lexi",
        "13:13 never gets old",
        "Why did you made Ben and Lexi broke up",
        "Excellent",
        "Hey fake money giveaway",
        "I love this song you made",
        "Your sister fell on the skateboard and she was bleeding I asked her if she was ok",
        "Love the videos you make Brent,keep it up",
        "I support Jeremy!",
        "Ai lav yu",
        "I've always wanted to go to Disneyland",
        "Brent I feel like you should've pied Jeremy and not Ben at 12:51 because Ben came second and Jeremy came last... I hope peirson got real money because when the caleb was part of amp world and he won these challenges he said he got fake money.. but I dont belive that. Keep bringing us great content",
        "Bro chicken heart is so fricking good Ben missed out",
        "Why is everyone else wearing black clothes?",
        "Done!!!!!",
        "OMG, I love this video. Nice content bro",
        "For the appetizer, didn't Ben just have black pudding like the stuff we have 4 breakfast in the UK?",
        "Brent always knows how to put a smile on out faces! \"Done\"",
        "You should have mixed all they have lol",
        "I juste woke up and I am so happy to see that you are back! I am starting to watch so I can’t say much but thank u everyone for the nice comments! It’s a real pleasure to come back here with positive people",
        "Ben truly is a genius 100IQ play",
        "But can you make a vid that you are looking at your first vid bc I want to see your reaction pls",
        "You and your friends are the best YouTube like Brent never falls to entertain us",
        "Your amazing keep up the good work brent",
        "Can you make a new video",
        "Good job ",
        "Can we appreciate how Brent never fails to entertain us",
        "Brent I’m confused who is your crush is it Eva or Pierson",
        "Can I participate for a video please! I MAA HUGEE FANNNNN",
        "my question is why didn't Pierson get the green shopping cart lmaooo",
        "When I saw that burger I immediately got so hungry ",
        "Man, they really earned that moment of Freya making up or coming to an understanding with Kratos. That middle ground of \"I can not forgive you, but I also can't kill you.\" feels",
        "If Ben has black teeth everyone will probably think he got cavities ",
        "I have subscribed and well I live in New Zealand",
        "who else is obsessed with Brent’s content ",
        "SUBED",
        "Gosh brent is the best. His videos are so funny and entertaining. Love u bro",
        "Pierson always wins",
        "I feel like pierson hates brent for this",
        "I love this video ",
        "done!!! I love watching these sm",
        "Thats not one color",
        "subscribed :)",
        "The disrespect. These dishes are real dishes from around the world that that chef worked hard on making and preparing. What social media does to people is disgusting",
        "Can I have a shout out pls I’m battling cancer right now",
        "Nice to see Brent is a Kpop fan.",
        "You guys are funny",
        "Can we appreciate Brent for being a Legend",
        "Brent Rivera copying zhong",
        "I think pierson is suffering",
        "Brent makes our days better ",
        "I love snails so much.",
        "Brent I have been watching ur videos when I was five, where is Nicholette did she move or like anything just please have her in another video she inspired me thankyou!",
        "Brent I think you should get back with eva",
        "I just hate when you guys waste food.",
        "I swear Pierson never wins challenges ",
        "Let's appreciate the Dedication & Hard Work Brent put's into All of his Vlogs. This challenge was so FUN & Entertaining One of his Best yet.\n Kudos to his friends for participating in this crazy but Exciting Super Cool vlog. BTW the colors of the Kitchen Rooms chosen so dope.",
        "great job pierson",
        "The Pasta looks yummy.\nThey don't know how to appreciate food",
        "4:23 Ben outsmarting everyone idk but when he says its great I belive him teriyaki sauce is good after all",
        "This video was so funny to watch! cg Pierson! All of your videos just make my day 10x better <3",
        "done done done done\nlove you",
        "bro your videos are so intense!! i love you brent! ",
        "Hey Brent, I love the content u make, ur such a cool YouTuber and ur the best",
        "Can we just sit here and talk about how they all make Amazing videos and make it really interesting,intertaining and funny and I love how they risk themselves for us and accept every single challenge they get asked.",
        "Them: takes 5 minutes to pick food for a week\nMe: takes 5 minutes walking down one food isle ",
        "pierson always win your challenges",
        "Pierson is like ",
        "Person card is full in journeys and Ben's are there's barely anything in there",
        "okay im sorry but im no longer going to be apart of this following or whatever you want to call it and insure most of you know why but if not ill explain, I refuse to be involved with people who don't tell their own friend that her bf of almost two years was cheating on her throughout the whole time they were dating sofi didn't deserve that from the people she thought she trusted its truly sad, the only ones in your friend group to not be cowardly and actually told her is the twins who I completely respect in this situation. this whole situation makes me sick because growing up I watched you guys a lot, the only people I have any respect for is Sofie and the twins that is it I truly hope you learn from this experience because you all really don't deserve Sofie.",
        "Omg this is amazing work  ",
        "omg it was so funny",
        "gulp",
        "I feel like Andrew would be eating red food because he loves Hot Sauce   ",
        "I almost threw up because of watching pierson eat that snail",
        "Brent you are the so so. So so so cool",
        "I feel like Brent is becoming more the new Mr Beast",
        "Hey Brent this was amazing! Good luck with the spicy red room!",
        "Done done done done done done done done done done done done done done done done done done done done done done done",
        "0:10 Pierson:ThE TeXtUrE iS sO BaD",
        "I have to say  : this video was a blast\nI enjoyed a lot!",
        "I  you",
        "Your videos are the awesome",
        "Can we all appreciate that Brent never fails to entertain us,he is a very good YouTuber , much love️",
        "i just love how when they were at the grocry store pierson had an orange  cart",
        "Hey Brent you just hit 5m bro so when are you going to do the red challenge",
        "Poor  people   Brent  do lexi  I dare u bruh",
        "I love how in the grocery store everyone else had a green cart except for Pierson, who's color was literally green jajaja love you Brent and done done done done!!!!",
        "I love you videos!",
        "lets just apreciate how brent entertains us",
        "One thing i would have bought multiple of would-be food coloring :D",
        "Brent never fails to entertain us",
        "BLACKPINK In Your Areaaaaaa!!!",
        "Ben's expression when the chef said \"They are 70  year old and when they die their heart turns black and you are eating........\"",
        "Brent or Ben I choose stokes twins",
        "Jeremy just sneaking in some Twinkies but gets caught while doing it but Ben with drinking the smoothie",
        "done can i please get an shoutout im from Africa namibia please can I also get a give away",
        "i literly love all of your videos and my one wish was to meet you irl",
        "Nooooo",
        "When Brent did the party they could have taken the shelves out of the bottom of the fridge and  hide in there",
        "i love your videos brent i watch your videos all the time and i wish i could be in one of your videos",
        "Bro copied zhong",
        "BLACKPINK",
        "Ben looks really good in black",
        "Do you have not made a geometry dash video",
        "I love your videos Brent and the amount of effort you put into each and everyone",
        "This was an awesome challenge!",
        "hey Brent i am early and done \nand my favorite color is pink",
        "You copied Zhongs YouTube Thumbnail",
        "If it was me, I probably would have chosen the pink room. Great job, Pierson. You did great.",
        "Bro copied The Chinese tiktokers background",
        "conner",
        "Hii pls tell me what u this of my channel and i really like our videos but still think lexi's videos are soooo much better still love your videos a lot thx for make so much good videos",
        "If you like Brent’s YouTube channel you are allowed to like this comment",
        "But what if ur in Florida and u subscribe",
        "very funny video",
        "Pierson never has made me laugh more",
        "I don't understand why they never thought of food colouring cause then they could just put it on anything they want to eat.",
        "Brent were is nice let your cosuin",
        "brentiloveyou",
        "I liked this episode nice video Brent!",
        "This is the best",
        "donneeeeeeee",
        "Pierson could get out bc the floor is green",
        "I feel Ben had it the worst colour \nJeremy had the best colour",
        "I love the hard work and creativity you put into these videos!! Done also!!!!!!!!",
        "This feels like an amp squad video",
        "I would be down for the red room and spicy food ngl. Brent should do it.",
        "For me right now you have not posted this weeks video ",
        "Blackpink!",
        "Thank every time you start a video you get in your car and. He's there?",
        "i love how pierson is green and has a orange trolley and jeremy and ben who aren't green have the green trolly",
        "9 days ago!!!!!",
        "the amount of food u guys wasted by throwing it at each other is just horrible.",
        "Someone tell Ben oreos are black too",
        "Brent if you read this please  respond  I've been abused  plz help",
        "Bruh why do you edit your mouth like that in the thumbnail? Is that gills? Snake mouth? Trippin me out",
        "I live in United States of America 60 Pitch St. come get me your biggest fan for five years",
        "I love your vids and I Just want everyone to take a second to thank him for his video because he’s literally sacrificing his safety for our entertainment!",
        "I feel like you copied someone",
        "This kinda random but is kinda funny that Pierson had the color green and yet she was the only one without a green shopping cart",
        "pierson never loses",
        "I am raging for seeing jeremy wasting donuts this should be a crime",
        "A good video idea is to go to the Flint Stone House. Its in Califorina, costs 4m dollars to see, you can spend the night there, and its really pretty",
        "here late but done ",
        "if i where black i would have sushi",
        "Dune",
        "The way pirson said \"IS THAT MY DOG?!!\" in shock is just funny",
        "Color challenge with matching rooms. Cool thanks for content",
        "“IS THAT MY DOG? -P” THAT MADE ME LAUGH WAY TOO LONG",
        "I LOVE YOUR CONTENT. Keep it up",
        "You guys happiness is so contagious I love your channel and you guys have inspired me to be a youtuber! Love you guys!",
        "Done you guys are awesome",
        "Can you go to the most richest city in the world?",
        "I’m Done and I was on the Redbox",
        "Done done done done",
        "Hi Brent",
        "Nobody: \n\nBen: shake my Griffin hand ",
        "I love your vids ",
        "DoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDoneDone",
        "The fact that Pierson is green but got a orange trolley",
        "Done done done done done done done done done done done",
        "done.why do i never get to be subscriber of the week.",
        "hi brent! i've been watching u for 3 years, can i get a shoutout?",
        "One person tried the lobster I am really sure it was text three",
        "done\n#onecolour",
        "This video was amazing",
        "Dom is Sofie’s boyfriend",
        "like the video",
        "other then done what else can i say",
        "If i was jeremy then i would tell brent to give jeremy strawberry icecream thats pink",
        "Waiting for ur next video ️",
        "Bruh they did't but ice cream like pink ice cream and green ice cream and chocolate ice cream",
        "Love your videos ",
        "Who else is still shipping Beirson",
        "oh and done done done done done done done done done done x 1200",
        "donee!",
        "Dude i love you so much that ive been a fan of you for 6 years straight",
        "Bringing back the same energy as Verdansk had, the community is proud. Well done.",
        "Brent and Drew: Goes to Disneyland\nPierson: Bring me back a pretzel!!!\nMe: Have you ever seen a green pretzel, because I have never",
        "“Unless I’m throwing food at you” bahahha mood ",
        "I love tour video!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "It cost 1,200 for all five people in my family for groceries",
        "brent's every video Persion is the winner awww  that's cute.",
        "bro really wants some content u gotta copy?",
        "Doneeee Love Your Videos",
        "What about peirson",
        "How come no one’s talking about how Pierson got green and she was the only one with a shopping cart that wasn’t green",
        "Done I love Amp world and you",
        "I love your videos so much",
        "“You got caviar?! It’s probably 100 bucks!” \n“No no! It’s 300”",
        "POV: the girl that Jeremy brought was. liv",
        "I love how  Pierson got the color green and Ben and Jeremy had green carts and she didn’t ",
        "channel took $145 plus $ 200 with no price",
        "Dollars",
        "When Pierson sad I’m not in a good mood before that Ben ate GREEN lettuce and after jeramy left so Pierson won",
        "This video was so creative and active.It kept me intertained,I watch ya'll all the time and lexi is AMAZING! AND BRENT!",
        "Ben and Jeremy have my favorite colors",
        "'done'",
        "What is the meaning",
        "Bro copy cat bruh",
        "Pierson never has made me laugh more ",
        "sonic shouting 'ive played knack' everytime he has to button mash has became one of my favourite in-jokes",
        "All I can say is that Brent has amazing content and can make a persons day with his awesome content thank you so much we love you tysm",
        "Queen Elizabeth I have a",
        "Done I love u and your videos",
        "27:00 One of my all time favorite smii7y screams",
        "I a big fan and I want to be in a video and I am Elizabeth pls",
        "Can you make a video of going thru your worst fears?",
        "Iv been watching brent since i was 10 and now im 11and i still watch his videos  ",
        "Remember when 10 years ago u made the cooking lava cake video cringe Broo us hair",
        "Hi Brent!I’m a huge fan and just wanted to say when I was going through really rough times which I still am u made me feel happier when I felt down!<333",
        "Hi Brent!\n I have been watching you videos since you started youtube, it feels like you uploaded your first video yesterday! \nIm a huge fan, and hopefully will meet you one day!!  Stay healthy, and safe. ",
        "I hate uuuuu",
        "It’s true what they say: Youth is wasted on the young. ",
        "I would eat Ben's main course meal",
        "Them: I don't think anybody would eat those chicken hearts\nMe and my family: I don't mean anything to you? (I eat it prepared in a way it doesn't taste as bad)",
        "NOO NOT THE TWINKIES!",
        "Yo Brent",
        "Il",
        "Done (I liked the video to be In a video hopefully I get picked) 3:25",
        "Is it just me or does Pierson always wins Brent's Challenge videos",
        "Ben congratulations was lit for peirson ",
        "I knew you,Pierson  would win, she’s a strong woman that fights over Ben and Jeremy. ",
        "I actually always wanted to try blood sausage.",
        "You’re so cool",
        "can I be in a video? ",
        "Blackpink",
        "Thank you, Techno, for making my childhood so much better.\n\nRest in Peace, Potato King.",
        "What was your favorite ride at Disney land? Mine was Space mountain. I also went to California adventure I went on the incredicoser!",
        "When you will do with Lexi 24 hr saying yes remember that video get 500k",
        "DONE AND DONE!",
        "are we not gonna talk abt how he shouted out one subscriber and the comment was about andrew and lexi. i think brent approves of landrew ",
        "I am subscribed for a year and still nothing",
        "Legend has it Pierson is still disgusted",
        "I love this ️ This is my favourite video ️️️️️",
        "Such good content ",
        "PLEASE SHOUT ME OUT ITS MY BIRTHDAY!!!!!!!",
        "love it i could watch them all day.",
        "Why u copied Zong",
        "Pearson Chi",
        "Aww you worked so hard ben and you failed haha",
        "I love Ben and Brent Together ️",
        "whatever tf is actually this",
        "Drew talking to Ben in the bloopers: Get sushi, just eat the seaweed!",
        "Pierson sorry I spelt you name wrong but still",
        "Done done",
        "Team black",
        "You know how you love peirson Berson",
        "Let's get brent to 23 million subscribers ",
        "ISHOWKISS, this stream changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience :'(",
        "i subscribed",
        "Then casually shopping at Amazon fresh",
        "I am a little girl but I am just on my grandads iPad my  name is Darcie cook I love your Youtube videos",
        "Why do they torture themselves so bad when they know you don't even give them the money or if so, it is always fake! I MEAN COME ON BRENT! WE KNOW IT NOW!",
        "I really enjoy your videos and I understand how much time it take for you,I really want a shout out .",
        "pierson when she said THE TEXTURE IS SO BAD",
        "Shouldn’t they throw the pies at Jeremy",
        "Does anyone know the track played at 9:39?",
        "'Done' ,this video you can surely call GOOD CONTENT!",
        "watch Brent's first videos I started laughing",
        "Love it!!",
        "Zhong:oh no he stole my content :(",
        "You do realize that a lot of Australias love your Vida like me so you can't hate on Vegemite",
        "It so good that Ben is back ",
        "Let’s just appreciate Brent for working hard just to make these videos for us, keep it up",
        "Good video brent",
        "Brent I thought 24hrs would be hard, but you attempted the impossible 100hrs you are so crazy !! Oh your friends did it but love the mini kitchens ",
        "Drew is awesome he’s so funny he should be in more videos",
        "Piercing is right I love Caesar salad",
        "Brent could the amp world make a school and each person could be a different teacher for a YouTube vlog and you could be the principal",
        "Black pink in ur area",
        "Done I want love your video",
        "Brent  my daughter Mariah and I  always watch your videos  You have a Great Imagination which makes all Your videos so Good  We also Love Your Amazing Squad  You guys all have Great chemistry We appreciate all of Your hard work  Keep the Awesome videos coming  We Love Laughing throughout all of Your videos My daughter Mariah and I  are Happy and very Grateful Fans.",
        "Pierson,ben and jeremy just wanna escape but im pretty sure all of Brents fans Will do every thing to be in that Challenge lol",
        "Donr",
        "I love your videos they brighten up my day",
        "done! haha doesnt everyone love how brent tortures his friends ",
        "Done and can I get a shout out",
        "ben could have got oreos",
        "I have been subscribed for over a year now I love all your videos and I hope I can be in one of your I Videos one day I love how you always kind and I know that Lexi is always mean to you and me I hope you choose me to be one of the subscriber to be in one of your videos next time",
        "Doneeeeeee",
        "Done!",
        "done done done done done done done done done done done done!!!!!!",
        "Im so early Ariana has tears left to cry",
        "Love it",
        "NEW VIDEO KEEP CONTENT UP BRENT",
        "BRENT I AM UNSUBSCRIBING IF YOU ARE GOING TO DO THIS TO PIERSON (I give you permission to do it to the boys :D)",
        "Hey Brent! I am a huge fan can u please have a shoutout? I have watched you for many years and to this day I still love your content",
        "ben could eat steak or meat cause it is blackish",
        "Imagine surprising Jay with his biggest fear!",
        "Now that is incredible challenge",
        "How are u still friends with dom since he cheated on Sofia?",
        "Good",
        "It looks like Pearson‘s having the best time",
        "Hey Brent do you remember wen you did the vid saying yes to most spoiled  kids in America for 24H  you made a bet with the kids and the bet was that if you got 400k likes you wold say yes to them for 24H and you got over 400k likes and at the start of the same vid you told Lexi that if she cold say yes to them for 24H you wold say yes te her for 24H",
        "For them I will eat one color for a week too\nPlease spam colors and the most from a color I eat",
        "I love how Pierson got an orange cart and everyone else got a green one but green is Pierson colour ",
        "Doneeeee love you Brent!",
        "Ive subscribed done done done done",
        "U know tour mom yoh copy someone",
        "I am dying to see Brent suffer just like they do because he only let his friends do all these things haha...  anyway love your videos Brent",
        "Wait THERE is black and pink? BLACKPINK I'M WITH JEREMY AND BEN!!!!!!!",
        "",
        "This is low-key the best I've ever seen! \n\nDONE!",
        "You copySomeone",
        "What about jamire",
        "Brent your just amazing i wish i was you",
        "Hey",
        "“ that’s what costs three people for me”($1000) I have a family of 7 with a dog and when we get food at a grocery store it is usually 100$ or less, depends what we get",
        "I am liking that drew is having same vibe as how mason used to.",
        "That was crazy !good job all of  you i you guys",
        "12:52 how come Ben gets Pies but not Jeremy",
        "and I guess Peirson I think she is awesome and she always wins in your videos!",
        "Hello",
        "Why does Pearson always win challenges but Jeremy always lose challenges Jeremy's my favorite one",
        "Done! This video was amazing! You Are so creative. Thank you for making videos every week and making me have a smile on my face.",
        "Lets all appreciate the effort and hard work Brent puts into his videos for our entertainment",
        "Brent never falis to make us smile and entertain us",
        "BlackPink fans",
        "Прекрасныйбокс,какфехтое.Постоянно в движении,всёвидит и опережает dik.Si/naturalpussy соперника.Как на тренировке через усилие и к победному нокауту. Хладнокровно по змеиному и резко,как тигр,это всё мастерство отточенное годами и изнурительными тренировками.Хотелось бы посмотреть его бой с Усиком,но видимо не в этой жизни,другая весовая категория.Безусловно Дима был на две головы выше Баррейры и это факт --- нокаут лишь Салют в честь и Славу Бивола Дмитрия.Слава и заслуженный пояс Чемпиона снова у Бивола.Ура!Ура!Ура!",
        "I’m a big big big fan f you and Ben and Pearson and Lexi and Lexi Rivera and livin Jeremy and Andrew",
        "nice",
        "HE COPIED ZHONG LOL",
        "When Ben just put soy sause at the burger and fries it makes me...",
        "Why did you not tell Sophie that dom cheat on her",
        "Not brent being so rich he can shop at the amazon grocary store.",
        "love your videos",
        "Every time they ate I looked at Piersons NOT cut watermelon",
        "its the fact that ive been watching this guy for over half my life, this dude has given me something to look forward too ever since i was young.. thank you so much ssundee",
        "Are you a Christian if you're a Christian then God bless you and your family and friends so MUCH.",
        "I loy",
        "lets get to 400,000 likes!!",
        "me wondering how they go to the toilet",
        "Edd",
        "My rank of smoothies:\n1. Green\n2. Pink\n3. Black",
        "i love seaweed",
        "Nice",
        "Thanks for your awesome content",
        "love this video ",
        "Done' I'm really enjoying all of ur videos Brent, that's why I'm loving it, and I've been subscribed for 2 years by now",
        "Vine is back Brent",
        "I loved it",
        "done\ndone\ndone\ndone",
        "There’s no way they did this for 100 hours",
        "In the smoothie challenge Pierson real said “jala-pain-os”",
        "You guys are awesome",
        "Your a legend",
        "I wanna be a part of y'all that's my dream ️ \"done\" ",
        "When I first clicked on this video and the title and I saw all the people I thought that. Person is gonna win because I know she is she is a talented queen God ️",
        "Hey Brent, I am obsessed with ur videos and u seem like a really nice person keep doing u and making videos",
        "Everyone who believes that Jesus is the Christ has become a child of God. And everyone who loves the Father loves his children, too. We know we love God’s children if we love God and obey his commandments. Loving God means keeping his commandments, and his commandments are not burdensome. For every child of God defeats this evil world, and we achieve this victory through our faith. And who can win this battle against the world? Only those who believe that Jesus is the Son of God.",
        "Hi",
        "OK well I’m in heard County",
        "Wow",
        "Happy 22 mil Brent, You never fail to entertain us",
        "bro i miss caleb",
        "Hey Brent I have a challenge for you,\nMake videos 2-3 times a week.",
        "LOLLLLLLLL y'all are so cool make sure you make some more vids :)",
        "great videos!",
        "Hey you should stay overnight in a waterpark and I subscribe and turn on Notifications and I like your videos",
        "You just copied zhong",
        "I would love to be in a video of one day ",
        "Oh my gosh help Pearson just stuck up the middle finger and had such of disappointment. Look on your face. Priceless.",
        "Pierson gets it to easy than Ben",
        "Wow this was so fun!",
        "Like every thing they picked out",
        "i love brent",
        "Done! This was a great video! I love how much work he puts into his videos!",
        "I hate brent!",
        "I love your vids so much Brent can you please invite me I've been watching your channel for almost more than 7 years pls I really love your content but the only thing is, is that I love in South Africa\n\nBut love your vids xx ",
        "It’s raining tacos from out of the sky tacos don’t need to ask why just open your mouth and close your eyes it’s raining tacos",
        "I was watching this while eating which was not a very good idea. This was a banger video. Keep up the great work",
        "Me being from Portugal: nah snails r quite popular there soo \n\n(CAN I PLZ GET A SHOUT OUT!? if not AT LEAST  invite me to WACK Ben to  sleep)",
        "Poor Ben Azelart I felt so bad for you, Please put Brent in the red box challenge for Brent is all spicy and sour red ( not sweet)",
        "Bro actually copied Zhong",
        "I’ve lost my appetite 6:44",
        "Great video. Way to go Pierson. I subscribed.",
        "Done ( I ship landrew  )",
        "Done and by the way Brent you can have a lot of red slushy‘s and red Gatorade and more",
        "Stay positive and keep smiling ",
        "All you do is say this all videos",
        "done done done done done done done done done",
        "Done done done can I have a shout out ",
        "Am from mongolia yessssss",
        "Something he could do better is making the titles about what the video is going to be about including small details. For example, the challenge is for them to eat their color for as long as they can not 100 hours",
        "doneeeeee",
        "Brent:Baby foods disgusting \n\nAll the babies watching:",
        "Hi Bindu kaplil is my mother phone  I am the person who text you",
        "You guys should go to Disney land with people and only do colored food but only eat color foods and brent you get to eat whatever you want but the others only there colored food",
        "You copy your videos",
        "Ok I’m done",
        "Bruhuhuh.. wats wrong with seaweed??",
        "Like if person is a picky eater sometimes ",
        "love this vid so much",
        "Go to Disney on December 27",
        "Donee️️️️️️",
        "Love your videos Brent",
        "As soon as I read the title I started singing Blackpink songs",
        "I subscribed and awesome vid",
        "peison is fears",
        "I love ur videos so much I've been watching them for 3 years ",
        "To those who are curios, there is something called black water and it is made with electrolytes",
        "Was it Ben and Jeremy have a trolley and not Pearson",
        "Brent loves perison",
        "Hahahahahahaahaa ben",
        "I wold never do this",
        "Who else agrees that their whole group is now making videos which are nothing short of cringe ?",
        "Make a video that you make your friend Ben life bad",
        "am I the only one that surprised about the Amazon being a supermarket",
        "This was the funniest video ever",
        "You did made my day I have been going through a lot ️\nDone!!!",
        "I’ve been your subscriber for five years",
        "I can’t believe they had a food fight but I’m not surprised ",
        "Where is the next video. It has been 10 DAYS"
    ],
    "comments_disabled": false
}