{"video_id": "9m22bsevQLs", "comments": ["who's here early!? like the video, then comment 'done' so I know who to dm <3", "Legend says Ben is still scrubbing out all the black in his teeth", "Pierson always wins", "I love when pierson says “I’m not having fun anymore”  mood", "ISHOWKISS, this stream changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience :'(", "Notice the way Pierson just easily wins in every Brent's Challenge Video", "Can we take a moment to appreciate how much time and work he puts into these videos for us  completely!", "I like it when everytime Pierson eats something gross, she drinks mountain dew a lot", "Charlie is determined to never fail to entertain us every day =O:)", "I just want to says thanks for the long-standing community of nerdfighteria because I’ve probably heard this story at least three times, but it’s always wonderful. It’s very much like hearing the stories your friends and family tell again and again", "13:22 It's moments like these where we really know that even behind all the shenanigans and potato farming and sabotage, Technoblade was truly a good person at heart. It's really inspiring to see someone with such a platform and so many followers still remain a kind person, and with us all looking up to him, still setting a good example. May his kind soul rest in peace, and in our hearts, Technoblade never dies.", "I LOVE how much effort Brent puts into his videos for the views and subscribers! Keep up the good work Brent!", "Pierson is the biggest mood in this video ", "Let’s just appreciate Brent for working hard just to make these videos for us, keep it up", "I love how Pierson and Ben’s mouths were both all green and black ", "Can we all appreciate how Brent is so nice to his friends leaving them in his own video and having fun", "I love how she gets inspired by movies, anime, and all types of popular tv shows to just keep us entertained. We love you Jess", "Bringing back the same energy as Verdansk had, the community is proud. Well done.", "Man, they really earned that moment of Freya making up or coming to an understanding with Kratos. That middle ground of \"I can not forgive you, but I also can't kill you.\" feels like the right direction to take that.", "The way Pierson chose a orange cart to use instead of green even though greens her color ", "I love Drew. He’s a whole vibe ", "I honestly think that Brent is one of the best youtubers there is\n\nhis videos are so entertaining and so fun to watch and he has the best content and he never fails to make me smile", "Ben is really the best and if you really pay attention, almost all of his videos are successful", "To come back to this after what happened to him and all his journeys hits so different. This series will go on as one of the best series of all time and will go down in his legacy", "I juste woke up and I am so happy to see that you are back! I am starting to watch so I can’t say much but thank u everyone for the nice comments! It’s a real pleasure to come back here with positive people", "i love how pierson does all of the challenges ", "Brent and Drew: Goes to Disneyland\nPierson: Bring me back a pretzel!!!\nMe: Have you ever seen a green pretzel, because I have never", "Can we appreciate how Brent never fails to entertain us", "Pierson never has made me laugh more ", "One of the best things about this dude is that he never takes credit for himself when he uploads something. He always respects us, the audience, and he is always full of energy in his videos. Keep up the hard work!!supagreatman!", "I honestly think that Brent is one of the best youtubers there is\nhis videos are so entertaining and so fun to watch and he has the best content and he never fails to make me smile", "“IS THAT MY DOG? -P” THAT MADE ME LAUGH WAY TOO LONG", "Brents videos are always so enjoyable I love all of you so much keep it up !!!", "This video was so funny to watch! cg Pierson! All of your videos just make my day 10x better <3", "The fact that they even had rooms of their own colors. The dedication wow!!", "4:31, Ben's a genius, he thought outside the box.", "I love this story. It's a great anecdote to summarize and exemplify the importance of both artist and the person perceiving the art. Both intent and reception matter. I love that Sarah let her artistic intention be known, that John respected that, and that both have been open to experimenting with variations since then.", "pierson not giving brent a high five was so savage....", "I love how Pierson refused to give Brent a high five after she ate the snail ", "I'm here early and can we just think of how hard Brent works on his videos and keeps us entertaining!", "Brent never fails to make me smile", "I like how in the start ben and Jeremy got a green grocery cart but Pierson the one with the color green got a different color lol", "Brent efforts to make his video so addicted to watch and their squad friendship.. love it ️", "I love your videos Brent and the amount of effort you put into each and everyone", "Love Brent's video's. He has so much energy also 'done'", "I love this! And the Way Brent laughs at Pierson", "I am liking that drew is having same vibe as how mason used to.", "I love how Pierson got an orange cart and everyone else got a green one but green is Pierson colour ", "Pierson is such a good sport, she ate all the different food. ", "I like when Pierson always wins challenges lol", "It so good that Ben is back ", "How andrew comes random with pierson's dog ", "0:49 I love that the two boys have green carts and Pearson’s who’s colour is green has an orange cart the same as brent’s shirt ", "Ben is smart for putting the soy sauce on everything since it’s his color ", "I love how brent never participates in his challenges ", "I loved this video!!! These are the kind of videos I enjoy !!! Very entertaining!!", "Hey Brent this was amazing! Good luck with the spicy red room!", "Vlog trending # 5. Lets get it to # 1 I've watched this so many times it so good. Exceptional job Brent keep it up.", "I’m so proud of you the dedication determination & motivation you  have to constantly post is everything and entertain your audience at the same time  especially when you are juggling multiple different platforms !!! You make it look so easy and effortless", "I love how with Pearson Brent is like I like the mix of healthy and unhealthy but with Jeremy he’s like that’s disgusting", "I would be down for the red room and spicy food ngl. Brent should do it.", "Why do those Green and black chef dishes actually look God to me like I would eat them", "I love your vids and I Just want everyone to take a second to thank him for his video because he’s literally sacrificing his safety for our entertainment!", "I as well as others appreciate how amazing his content is! Thank you Brent for making me so happy and done even tho you didn't say  say done", "Mountain Dew is amazing I’m glad Pierson got to get that ", "I felt like Ben was the most unlucky! I love your videos!", "“You got caviar?! It’s probably 100 bucks!” \n“No no! It’s 300”", "The fact that the green lady is the only one who didn’t get a green shopping cart ", "Can we just sit here and talk about how they all make Amazing videos and make it really interesting,intertaining and funny and I love how they risk themselves for us and accept every single challenge they get asked.", "Ben: Eats Only Foods That Are Black!\nJeremy: Eats Only Foods That Are Pink!\nPierson: Eats Only Foods That Are Green!", "Let's appreciate the Dedication & Hard Work Brent put's into All of his Vlogs. This challenge was so FUN & Entertaining One of his Best yet.\n Kudos to his friends for participating in this crazy but Exciting Super Cool vlog. BTW the colors of the Kitchen Rooms chosen so dope.", "I love how he’s saying it’s easy to meet them and all you have to do is subscribe but here I am in a whole different country far away ", "Great vid Brent! I loved it. Keep up the good work ", "Hi Brent!I’m a huge fan and just wanted to say when I was going through really rough times which I still am u made me feel happier when I felt down!<333", "I love how Pierson in the literal only girl that competes in these things ️", "I love that every body had so much energy", "Alternate title : \"any game we play just gets even funnier\"", "If it was me, I probably would have chosen the pink room. Great job, Pierson. You did great.", "Jeremy just sneaking in some Twinkies but gets caught while doing it but Ben with drinking the smoothie", "Can I just say thank you Brent. you put so much effort into every video. When I'm having a bad day, I watch your videos and they make me smile. You work so much for just one video. and you never fail to make me giggle. <3 ps I ship Landrew. LOL", "Pierson reaction to the snails is hilarious ", "Ben is literally the best and if you really notice it, mostly every video he is in is a hit", "Now that is incredible challenge", "Brent never falis to make us smile and entertain us", "You guys are awesome, Very interesting video. Thanks a lot for sharing with us.", "I love how when they go shopping they all have green carts and when Pierson is green she has a orange cart", "Can we all appreciate that Brent never fails to entertain us,he is a very good YouTuber , much love️", "The way pirson said \"IS THAT MY DOG?!!\" in shock is just funny", "Ben's expression when the chef said \"They are 70  year old and when they die their heart turns black and you are eating........\"", "To he honest Pierson didn’t have to add the pickle juice ", "Brent makes our days better ", "I love the hard work and creativity you put into these videos!! Done also!!!!!!!!", "Brent Never Fails To Entertain Us ", "sonic shouting 'ive played knack' everytime he has to button mash has became one of my favourite in-jokes", "Thank you for making me smile done", "Done! This was a great video! I love how much work he puts into his videos!", "Lets all appreciate the effort and hard work Brent puts into his videos for our entertainment", "Hi Brent!\n I have been watching you videos since you started youtube, it feels like you uploaded your first video yesterday! \nIm a huge fan, and hopefully will meet you one day!!  Stay healthy, and safe. ", "Piers you are great! Ben and Jezza are great entertainment as well! Briersonforever!", "Gosh brent is the best. His videos are so funny and entertaining. Love u bro"]}