{
    "video_id": "9XfiE3iseuY",
    "comments": [
        "Y aunque",
        " sigamos apoyando ️‍",
        "Suerte mucho éxito !! ",
        "Hot espanish",
        "️‍️‍",
        "Aquí estoy desde bien tempranito apoyando ",
        "Muy buena rola me encanto, ya hasta la descargue, no me aburre la escucho a cada ratito, saluditos desde el estado de mexico",
        "Éxito hermano No olviden dejar su like y comentario",
        "Que buena rola carnal , todo mi apoyo desde zapopan gdl",
        "El artista no es nada sin el don, pero el don no es nada sin el trabajo.»",
        "Buena canción Roberto, que bueno que te animaste a sacar otra canción!!! \nApoyemos para que se motive HOTSPANISH!!!!!",
        "Saludos desde Badiraguato Sinaloa  apoyo total y Bendiciones ️",
        "Mucho éxito dios te bendiga siempre  ",
        "Aquí sigo apoyando como nunca ",
        "Mucho éxito vamos por mas y mas vistas ",
        "Vamos por el millón con esta ya son 10 veces que la reproduzco vamos",
        "Sigo sumando ",
        "Muchísimoooo éxito!!! No olviden dejar si Like  y comentar!!! ",
        "Dios te bendiga, sigue ayudando a las personas. Dios te lo recompensará ",
        "Qué buenas canciones sacas mi bro, síguela rompiendo \nActivo desde 🇲🇽 ",
        "Aquí desde los inicios, puro real brocoli",
        "Vamos a llevarla a tendencia #1 desde Guate 🇬🇹🇬🇹",
        "Mucho éxito!! No olviden dejar su comentario y su Like! Ánimo! ",
        "Excelente canción bfo",
        "Dios te",
        "Al 100",
        "Mucho exito.\nNo olviden seguir apoyando, dejar su like y compartir ",
        "Buena canción brother",
        "Excelente trabajo éxito en tu música ",
        "Esta chida bro",
        "Muy buena calidad ",
        "vamos por mas y mas vistas ️‍sigamos apoyándo",
        "Sooo bro espero y el gran apoyo que estás teniendo te motive a sacar más joyitas como está 🇲🇽️",
        "Muchos éxitos, no olvides de dar like y compartir ",
        "Buena",
        "Me encanta esta rola ️‍",
        "Se ocupaba una rolita de estas pa andar en la disco ",
        "Haber que día nos topamos y acepto cualquiera de tus retos",
        "Soy de los que su palabra vale yo no fallo ",
        "Mucho exito no olvides dejar tu like y compartir️",
        "Que padre canción  no he dejado de escucharla ni un solo día ️‍️‍",
        "Si queremos más canciones igual de chingonas hay que hacer que llegue a 2 millones antes de 24 hrs",
        "A demás que apolle",
        "Esta Chida la Casion",
        "Mucho éxito veo todos tus videos en facebook",
        "Le",
        "Llegue aqui por el tik tok, muy buena ",
        "A",
        "Sigan apoyando como lo hago yo y pronto llegaremos a los 2Millones y hasta más ️‍",
        "Estamos en tendencia 🇲🇽 #5 podemos llegar al #1 .\nVamos a reproducirlo mucho más ",
        "A mi me encanta esta rola la neta ️‍️‍️‍",
        "Te he escuchado desde el Ft con @MCDAVO",
        "Vamos para tendencias le guste a quien le guste  🫡 apoyemos a Los nuestros mejor dicho apoyemos al brócoli  mayor",
        "Sigan reproduciendo ",
        "Cp",
        "Encillo",
        "Sigan escuchando esta canción que esta muy padre",
        "Exitos y bendiciones brot se las mereces. Un saludo de un venezolano en Rio de Janeiro 🇧🇷🇻🇪🇲🇽",
        "Muchos éxitos, no olvide dejar su like y comentario",
        "Mucho éxito no olvides dejar tu like y comentar ",
        "Buena letra en la canción ️",
        "Mucho exito",
        "Saaaw, esta bien vergaaaas, las mejores vibras",
        "Sigan reproduciendo y dejando su bello like ️",
        "Ni patrocinadores",
        "vamos vamos que si se puede llegar más lejos ",
        "Ay que seguir apoyando que no decaiga el ánimo amigos estoy tiene que llegar más lejos 🥹️‍",
        "Tu sólo",
        "Sigamos reproduciendo esta canción amigos!! Dejen su like y su comentario ",
        "No me gusta este género pero te la rifas...",
        "Sigue sacando muchísimas canciones más  porque a mi me gusta demasiado como cantas  eres el mejor 🥹",
        "Buena rolita sigue así",
        "Que padre que la estás rompiendo Roberto ",
        "Saludos desde Bolivia , chida la música ",
        "EXITOOOOOO",
        "Ánimo",
        "No ay otra cosa que haga bien este chico Hotspanish te la Rifas Te lo mereces sigue así!",
        "Increíble ",
        "Por volverte a ver, por volverte a tener, por decansar y volverlo hacer otra vez aunque rompamos la ley...🇲🇽",
        "Muchas felicidades  ya falta poco ",
        "Vine de parte de el mencho a dejar like",
        "Que guapa chica se parece a la de rápido y furioso la de chinos que era jacker",
        "Hey bros hay que darle los 2millones a Roberto de visitas pf ",
        "Está canción llega alos 2000 link porque llega llega si estás de la mano de Dios llega la canción",
        "Que lo necesitan",
        "Sigan reproduciendo ️",
        "Excelente canción! No olviden dejar su like y compartir 🇲🇽APOYANDO TALENTO MEXICANO !!!",
        "Bien",
        "Vamos para que sea tendencia # 1, hay mucho talento.",
        "Mucho éxito no olviden dejar su like y su comentario ",
        "Vamos vamos si se puede llegar más lejos sigamos apoyando esta canción sin parar ",
        "Como tu",
        "GENIAL SALUDOS ,DESDE PERÚ",
        "Aquí los que sabemos que esta canción la va a romper con todo, puro talento mexicano 🇲🇽",
        "Que bonita",
        "Mucho éxito , no olviden dejar su like y compartir",
        "Está perrona la canción",
        "️Seguimos escuchándola, apoyándola super canción. ",
        "Llevamos está joya a tendencias raza!!!! 🇲🇽🇲🇽🇲🇽",
        "Saludo bro mucha bendiciónes soy super fan de tu videos mucha felicidades por la canción mu vacana me gustó mucha éxito",
        "Que no la voy a",
        "se extrañaban las canciones de Hotspa, siempre siendo el mejor saludos desde el estado de México ",
        "Ala",
        "Ldls",
        "Mucho éxito!! No olviden dejar su like,comentar,compartir,reproducir esta rola y sobretodo suscribirse al canal activar la campanita todas las notificaciones ",
        "Sigue así, con ese corazón tan noble  Felicidades ",
        "Mucho éxito ",
        "Aquí solo los verdaderos fans que que ya esperábamos la canción ",
        "Síganos apoyando está buenísimo el tema bien vacano",
        "Vamos a poner #1 en tendencia ",
        "No solo llamo para verte, también lo hago para calmar la ansiedad🫶",
        "Que onda bro",
        "Buena Canción Roberto, Apoyemos Para Que Llegue A Tendencias.\nSu Sonrisa De La Chica Se Va A Otro Nivel.",
        "Super que bacano la música de Ecuador saludos",
        "quiero mi regalo mi diez mil peso",
        "Muchas felicidades hechale ganas",
        "Andamos",
        "Top ️️️️️",
        "¿Cuántos más vienen en chinga de tiktok? Jaja ️‍\nOjalá vuelvan a llamar a la chica, muy padre su actitud. ",
        "Un",
        "Que siguieras subiendo",
        "Oleew o leo",
        "Quien más viene de TikTok ",
        "Que buena canción ",
        "Saludos",
        "Desde tus inicios",
        "Ce",
        "Muy bien parcero  buena letra",
        "Éxito! No olviden dejar su like y también su comentarios ",
        "Muchos éxitos, no olvides de dar like y compartír ",
        "Porfa",
        "EL MEJOR REGRESO A LA MÚSICA  DALEEEEE HOTSPANISH QUE DE QUÉ LLEGAN A MILLONES LLEGAN SOLO NO SE RINDA PORQUE ERES PARTE DE MI INSPIRACIÓN EN LA MÚSICA",
        "Mucho éxito  No olviden dejar su like y comentar ️",
        "Me encanto wl video Yo quiero ganardesde Honduras",
        "Sigan apoyando y dejando su like️",
        "Voy",
        "Qué",
        "Hotspanish merece estar en las grandes ligas por todo lo que ha echo ️felicidades buena canción ",
        "Muy buena la canción roberto sige asi con muchos exitos",
        "Exitoooo y mis mejores deseos",
        "Me gusta  todo siempre quise ver este video musical desde q la muchacha acepto ponerse el vikini",
        "Mucho éxito  no olviden dar like y compartir ",
        "Animo pa vamos para arriba🫶",
        "Vamos por la tendencia si se puede!!!",
        "Me encanto tu canción  ",
        "Los mejores deseos desde colombia",
        "Me encanta",
        "eres tendencia ",
        "Saber que",
        "Dios y bendiga Roberto!",
        "Está en tendencia 5 apoyemos la canción para que llegue al número 1 en tendencia ,está bien chingóna la canción",
        "Amooooooo️️️️",
        "Me encanta ️ está canción un súper talento mexicano",
        "Muy buena rola y a darle con ",
        "Estoy obsesionado no puedo ni mirar para otro lado ️‍️‍",
        "Cual Es El Istagram De La Chica?",
        "Casi a los 2m venga",
        "Venga HotSpanish que venganas tracks! Crack!",
        "Mucho éxito ☆",
        "Me gusta mucho esta canción esta súper linda ",
        "Rolon",
        "Te seguiremos apoyando con tu demás contenido que espero sea pronto ️",
        "Para ti",
        "Dime baby que tú esperas para volvernos a ver ️‍️‍",
        "Vaamoos al MILLÓN se lo merece Roberto  compartan el video musical",
        "Hay que apoyar amigos",
        "Sigan apoyando la canción, esta a nada de llegar a los 2 millones este rolon 🇲🇽",
        "Mucho éxito no olviden dejar su like y compartir ",
        "Talento de sobra ",
        "2 semanas ya y no puedo dejar de echarlaaa",
        "Seguro",
        "Sigan apoyando al mejor ",
        "E",
        "Siempre miro tus videos bro tienes muy buenas ideas y esta rolita esta buenísima siempre rompiendola",
        "Hermosa canción sigalen hechando le ganas ánimo ️",
        "Mucha suerte hot spanish ",
        "Saludos bro Perú",
        "Mucho éxito\nNo olviden seguir apoyando y dejar su live y compartir ️️",
        "QUIEN MAS AMA SU CONTENIDO? ",
        "Me encanta esta canción esta súper linda ",
        "Saludos bro muy buena letra   te seguiremos apoyando para que Dios te siga bendiciendo y sigas ayudando a personas que lo necesitan vamos a seguir rompiendo récords \nSaludos desde Mazatenango Suchitepequez Guatemala 🇬🇹🇬🇹🇬🇹🇬🇹",
        "Un saludo a hotspanis 🇲🇽 espero y algún día ser como tu,te sigo desde las primeras canciones cn Ben el gringo..bandiciones!!\nY apoyen al jefe brócoli 🇲🇽",
        "La mejor canción #1 . Eres lo maximo Roberto",
        "Canción disponible en Spotify https://open.spotify.com/album/3UnvlnZO2KJZFkYwyDE950?si=Oyg-wQumSUuRCkGvw-PXWw",
        "Vamos vamos más vistas ",
        "La oportunidad",
        "Sigue creando buen contenido como este y el resto de tus videos ",
        "Todo el éxito para ti 🫰🫰🫰",
        "Mucho éxito carnal saludos ",
        "Éxito Roberto!",
        "Chida la canción y pues en berdad muy buenos todos los vídeos y todos los retos que ases están chingones bro",
        "Hermosa canción a mi me ha encantado ",
        "Hay que compartir, por la mejor música que hace, por la persona que es, y por lo humilde que es y que no le cabe en el pecho. ",
        "Me encanta esta canción ️‍",
        "Tenemos que llegar a tendencias, para que hotspanish siga sacando música",
        "Me puse a pensar en tu cuerpo otra vez ️‍",
        "Mucho éxito ️\nNo olviden dejar su comentario y su like ",
        "Mucho éxito  no olvides dejar tu like y compartir ",
        "Hola ",
        "Neta Que Eres Una Gran Persona Te Admiro Un Chingo, Neta Que Eres Mi Ejemplo Mi Admiración De Que Podemos Salir De Cualquier Cosa ️",
        "El mejor",
        "Chula rola️",
        "Sigamos apoyando  esta canción se lo merece porque es muy buena 🥹y Roberto es un gran ser humano se merece todo el apoyo 🥹",
        "Que buena rola brooooo, deberías de sacar mas canciones cómo está, llegadoras jajajaj ️",
        "Muy bueno bro.saudos de Peru tu fans numero 1.",
        "Estoy",
        "Mucho éxito saludos ",
        "Musical",
        "Mucho exito no olviden dejar su like y comentar ",
        "Excelente canción\nDenle like para que sea tendencia...",
        "Vamos por los 2M ",
        "J",
        "Mucho éxito no olviden compartir y dejar su like.",
        "¡Amigos, sigan reproduciéndo la canción y dejen su like para demostrar nuestro apoyo!",
        "Sigan apoyando como yo y pronto llegaremos no a 2 millones si no que a 50 millones de reproducciónes ",
        "Esta perrisima la rolita ",
        "Casi los 2 millones  y antes ni al millón ",
        "Tu música es arte puro somos mas los buenos creando y aportando dejando un legado a nuestra generación hotspanish ",
        "Los viste",
        "Me ha encantado de verdad ️‍",
        "Ya casi 2 millones ",
        "Apoyemos al que llegue 1m de vista rápido y siga sacando más música",
        "Sigan apoyando  ya casi llegamos a los 2Millones ️️",
        "Buen rolón",
        "Me gusta muchísimo esta rola ️‍",
        "Super nais 🇲🇽",
        "Muchos exitos saludos desde Honduras",
        "Saludo Bro bendiciones",
        "Tu",
        "Qué chingon que te sigas superando, tus videos tanto de retos como de música tienen una excelente calidad, eres original mi bro, un abrazo desde la CDMX!",
        "Ya casi a los dos millones rolón y sooooooo️",
        "Sigan reproduciendo! Es mexicano! 🇲🇽 Apoyemos ",
        "Holi está muy padre la rolita muchas felicidades por los logros logrados y lo generoso que eres  que padre que aún haya personas como tú que hacen el bien a los que más lo nesecitan bendiciones",
        "Acá bajando desde tiktok a YouTube ",
        "Numero #5 en tendencia que chido anoche quedó en #22 y miren  vamos a ponerlo en #1 vamos brócolis ",
        "Mucho exito no olviden dejar su like y compartir!! ",
        "Es una canción muy rimica , lo más importante del vídeo es que elegiste una chica atrevida hacerlo, y no fue una modelo como los artistas que se  aferran por las modelos o artistas!",
        "Mucho éxito no olvides dejar tu like y compartir ️",
        "Muy buena canción la verdad  me encanto , un artista no nace  se hace bendiciones",
        "Que padre canción,  escogiste el mejor paisaje \"la playa\" siiempre es un buen lugar  para hacer cualquier cosa,  te quedo super chida...  Apoyemos con un ligero para llegar a tendencias",
        "Aquí sigo apoyando sin parar porque esta canción merece mucho más 🥹",
        "ESTA CHIDA LA ROLA CARNALITO SIGAMOS APOYANDOLO HAY QUE SEGUIR REPRODUCIENDO DEJEN SU LIKE COMENTEN  ",
        "Mucho éxito!!!\nNo olviden dejar su like ",
        "Me encanto tu canción se nota el talento🫶",
        "Esta con madres ",
        "Te rifas machin ",
        "Otro",
        "Aquí estoy con todas las ganas de seguir apoyándo esta canción porque merece subir y llegar mucho más lejos 🥹",
        "Le quite el arco a cupido  y me fleche ",
        "Esta increíble tu canción",
        "Muy chingona bro",
        "Pues ya tenía",
        "Necesito esos 10",
        "Hot! Eres la ley maestro! ",
        "TIENES QUE ENTENDERRRRRR!!!!!!",
        "F",
        "Sigan apoyando ",
        "Te apoyo",
        "Éxito chico !!! ",
        "Ido creciendo",
        "Mucho éxito, no olviden dejar su buen like y compartir esta gran canción!! ",
        "mucho éxito  vamos vamos por amas sigamos apoyando ",
        "Excelente video con toda la actitud mucho éxito y bendiciones...",
        "Para mi familia",
        "Me encanta ",
        "Mera",
        "Me gusto el video y la chica que acepto hacer el video",
        " Hermosa",
        "Me encanto ️",
        "Eres grande ",
        "Rocha confío",
        "Con éxito la muchacha muy guapa",
        "Muy buen música bro",
        "Ojalá sigas teniendo mucho pero muchísimo más éxito para que sigas ayudando a muchas personas Bro....saludos ",
        "Dímelo HotSpanish ",
        "Rompiéndola siempre",
        "Excelente canción, tienes un gran talento",
        "Es hora de apoyar el talento mexicano ",
        "Apoyandote",
        "Comentarios",
        "Ay que seguir apoyando mi gente que estoy llegue pronto a los 2Millones ",
        "Aquí sigo apoyando sin parar ",
        "Aquí sigo apoyando ️ para llegar pronto los 2 Millones de reproducciónes ",
        "Pues aquí apollando el vídeo ya lo he visto varias veces desde que subió el vídeo con el reto para participar en el vídeo jajaja saludos desde Córdoba Veracruz México",
        "Mucho éxito  no olviden dejar su like y compartir️",
        "Llegarás mucho más lejos porque eres un gran ser humano ",
        "Desde q salió la canción no paro de escucharla muy buena canción mi broo",
        "Ay que apoyar el vídeo Bros, se lo merece!",
        "V",
        "Ahí que seguir apoyando a #hotspanishmusic ️se lo merece por ser tan humilde y con un  enorme ️",
        "A compartir y lléguemos a las 2 millones de vistas",
        "Mucho éxito!!!! No olviden dejar su like y compartir ",
        "X",
        "Te apoyo desde Badiraguato Sinaloa chulada de canción ",
        "Mucho éxito  la estás rompiendo  hay que engrandecer mucho más esta canción ",
        "Saludos desde Colombia bro🇨🇴",
        "Muchos exito den su like",
        "No importa q no haya modelos o no sea una grabación top profesional tu sigue trayéndonos musiquita y nosotros felices",
        "Hagamos aun más famosa, a la persona correcta  #HotSpanish",
        "Son las que",
        "Vamos vamos por esos 2 Millones de reproducciónes Si se puede sigan apoyando compartan dejen su like y comenten porfavor ️‍️",
        "Te admiroooo ️‍",
        "Aquí sigo apoyando toda la buena vibra ",
        "Buen video bro tela rifastes saludos desde las hermosas playas de cancun",
        "A la orden",
        "Vamos hay que llegar al millon de vistas si se puede",
        "La sigues\nRompiendo bro sigue asi\nEscucho todas tus canciones\nDesde tus inicios",
        "Aquí los verdaderos fans de Hotspanish ",
        "Excelente canción  felicidades!",
        "Mucho exito no olviden dejar su Like y Comentario ",
        "Excelente canción , No olviden dejar su like y comenten , Mucho Éxito ",
        "Vamos chicos, ya mero llegamos a los 2 millones, a seguir apoyando ",
        "Aquí sigo apoyando con toda la buena actitud ",
        "Mucho éxito! No olviden dejar su like y comentar ",
        "Llegaras muy lejos soy tu fans \nApoyemos con un like ",
        "Excelente canción la verdad me ha encantado sigue así y llegaras muy lejos felicidades #hotspanish",
        "Sigo apoyando aquí con toda la buena actitud mucho éxito Roberto y que vengan muchísimos más ",
        "Sigan reproduciendo y dejen su bonito like, chida canción ️",
        "Muy buena canción  merece tener el lugar de tendencia en la que esta ",
        "Con todo mi bro",
        "Sigan dando like y reproduciendo para que llegue al millon mucha suerte ",
        "Javier",
        "Sigamos reproduciendo la canción amigos ",
        "Exelente",
        "Buena la musica carnal🇪🇨",
        "Gente yo se que no es la manera pero me gustaría que vallan y apoyen una canción que se llama el hechizo de los mas pesados",
        "Vamos a romperla, hasta ser el #1   compartan",
        "Tiempo",
        "A nada de llegar a los 2 millones",
        "Pero estaría",
        "Ojalá mas personas lleguen a tu contenido 🫶",
        "Aquí apoyando para pronto llegar alos 50 millones de Views no se les olvide dejar su like y comentario",
        "Muchos éxitos  no sé olviden de darle like y dejar su comentario ",
        "Que siga teniendo más vistas esta rolita🫶",
        "Que",
        "Hola bro soy nuevo seguidor me gusta muchos tus videos y la verdad que esta esta rolita se acaba de convertir en unas de mis favoritas  mucho éxito ",
        "Aquí sigo escuchando esta hermosa canción apoyando al mil sin parar",
        "Buenísima bro!️",
        "Me encanta tu contenido ️",
        "Yo apoyo compartiendo,comentando y con visualizaciónes completas ya apoye con mi like y subscribiéndome al canal activando todas las notificaciones en la campanita ",
        "Que bonita canción a mi me ha encantado ",
        "Felicidades por tus logros hermano, vamos a llevarla a numero 1 en tendencias ",
        "Vamos a llevar esta tendencia a el #1",
        "Sigan apoyando como lo hago yo",
        "Me encanta esta canción !!Dime cómo estás que yo se que bien Rica ️‍️‍️‍",
        "Cjj",
        "️",
        "Bastante",
        "Me encantó ",
        "Vamos por ese millón  ",
        "De tu aroma me embriague ️‍",
        "Solamente los verdaderos fans comentaran  está rola ",
        "Apoyemos a hotspanish para llegar a tendencia ️",
        "Que buena rola bro sigue así",
        "FELICIDADES",
        "Rvabsn",
        "MUCHO EXITO ..no olviden dejar su like y comentario  exelente cancion",
        "Sigo y sigo apoyando sin parar  amo esta canción y sobretodo admiro mucho a Roberto ",
        "Quien más vino al tik tok",
        "Buena canción, Roberto 🫰 \nMucho éxito en todo lo que hagas ️",
        "Apoyemos,para  que llegue a 1M de visitas muy rápido ️",
        "También",
        "No he dejado de reproducir esta rola ni un solo día ",
        " Dios te Bendiga siempre y te permita crecer muchísimo más ️",
        "Animo seguimos en tendencia!!!! Puro team brócoli   seguimos apoyando",
        "️‍",
        "Ole",
        "A quien le dedicarías esa música  envíaselo\nNo olviden darle like a la música para que llegue a más millones de personas de vistasSII!!",
        "Aquí los que estamos desde los inicios , ahuevo nueva rolita pa ir escuchando en el carro ",
        "Que no sacabas",
        "Me gustan mucho tus videos y todo lo q hases por los demas",
        "Eres el mejor y te admirooooo un montón 🥹",
        "Mucho éxito!!",
        "No paro de escuchar esta rolita",
        "10/10",
        "sigamos apoyando sin parar ",
        "Sigan dejando su Like y reproduciendo ",
        "Sigamos apoyando a quien de verdad se lo merece  mucho éxito",
        "Hotapanish vamos por ese #1 en tendencia ",
        "Te amo Hi-rez ",
        "No paro de escucharla súper buena canción como siempre haciendo música buena ️",
        "Muy",
        "TIENES QUE ENTENDER JAVIERRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR!!!!!!!!!",
        "Aquí sigo al pie del cañón apoyándote ",
        "la canción esta bien chula, y nosotros debemos hacer que llegue más lejos, porque Roberto se lo merece. Felicidades por este tema que se que la vamos a romper",
        "Sigamos apoyando que si se puede volver a #1 en tendencias 🥹",
        "Chingon",
        "Sigan reproduciendo amigos!!! Apoyen con todo al Hotspanish! 🫶",
        "Dios te siga Bendiciendo siempre ",
        "Tienes que entender",
        "Que buena canción la verdad mi hotspanish la rompiste bro tremenda jollita lanzaste no paro de escucharla felicidades y ojalá y todas las metas que te propongas las sigas logrando saludos ️",
        "Vamos vamos si se puede llegar mucho más lejos ",
        "Muchas felicidades cantas muy hermoso",
        " Siempre prendiendo el área ",
        "Mucho éxito, no olvides dejar tu like y compartir ",
        "MUCHO EXITO Y BENDICIONES A TODOS \nNO OLVIDEN DEJAR SU COMENTARIO Y SU \nLIKE VAMOS A LLEGAR MAS ARRIBA APOYO TOTAL PARA HOTSPANISH ",
        "Soooooooo",
        "Mucho exito broooo, dtb  hoy y siempre  que sigan los exitos",
        "Cada vez falta menos para llegar a los 2Millones  sigo sumando ",
        "No he dejado de escuchar esta canción desde el primer dia ",
        "jajaja el tik tok fue falso es obvio que la chica ya la conocía esa chica salio hace 4 meses en un video de santa grifa no mms roberto en que momento te hiciste el mas falso",
        "Mucho exito amigo! No olvides dejar tu like y compartir",
        "Champion",
        "A coronar como el",
        "Mucho éxito, no olviden dejar su Like y comentar toda la buena vibra ️️",
        "Chingona la rola tssss ",
        " ya casi llega a los 2 m , sigan reproduciendo y compartiendo",
        "Esto tiene que ser reconocido en las tendencias ️️️️️",
        "A penas vi la invitación para darle like mira",
        "Muy buena canción, no olviden dejar su like, y compartir.",
        "Mucho éxito no olviden dejar su like  y su comentario \ncompartan compartan compartan",
        "Eres una buena persona y eso es de admirar ️",
        "Mucho éxito, no olvides dejar tu like y compartir ️️",
        "Escógeme a mi 🫶🫶 no dejo de reproducir ",
        "Escuchándola y haciendo limpieza en la habitación  si llegamos a los 2 melones  antes. De diciembre ",
        "Listo mi 509 peso ",
        "Eiiwi",
        "Sigan apoyando como lo hago yo y pronto llegaremos a los 2Millones ️‍️‍",
        "No olviden dejar su lindo like para 2M",
        "Hipnotizado en un delirio de tu aroma me embriague ️‍",
        "Persona que eres",
        "Éxito  ",
        "Tengo fe",
        "Vamos vamos sigamos apoyando que nada perdemos por hacerlo esta canción merece mucho más apoyo es un exitazo ",
        "Ya estamos a nada de llegar a los 2Millones ",
        "He dejado mis tareas y mi trabajo por seguir apoyando esta rola que se lo merece ",
        "Vamos al #1 en tendencias.️",
        "A ver si muy fans compartan y dejen su like para llegar a 2millones rápido ️",
        "Felicidades cantas muy bonito eres un gran ser humano sigue así Dios bendecirá por las acciones que haces con las personas que necesitan. Saludos desde Ecuador",
        "Muy buena cancion",
        "vamos sigan dandole mucho apoyó, para q siga dando más apoyo nuestro hermano, sigan reproduciendo y comentando hermanos",
        "Me gusta mucho esta canción  que ",
        "Estoy obsesionada pero con esta canción ",
        "Muy chingon",
        "Mucho éxito  ya estamos a nada de llegar a los 2Millones de reproducciónes ",
        "Vamos reproduciendo",
        "Estás en el éxito",
        "Éxito bro",
        "Y eso lo has",
        "Muy chingon que estés creciendo en todo lo qué haces️",
        "Bendiciones hermano",
        "Muy vien",
        "VAMOS A DARLE UN MILLÓN DE VIEWS EN UNA NOCHE PARA QUE SE MOTIVE .....",
        "Vengo de tik tok",
        "Muy buena Rola, rolonnnnnn!!!\na escucharla muchas veces!!",
        "La chica se lleva todo el crédito...es hermosa ",
        "Esooo",
        "Aqui los verdaderos fans reportandose 🇲🇽🇲🇽",
        "Bamos por los 2 millones de vistas, ",
        "Mucho éxito me encanta esta canción ",
        "Sigamos reproduciendo está canción para que llegue más lejos de lo que ha está llegando. Mucho éxito ️",
        "Simplemente hay que apoyar a hot spanish es un Youtuber disciplinado ️ Eres increíble!!! Bro",
        "Te apoyo desde Badiraguato Sinaloa  me encanta tu música ",
        "Like",
        "Vamos a seguir apoyando personas como el de lo merecen por hacer tantas buenas acciones hacia las personas que en verdad lo necesitan  MAS COMO TU!",
        "Que buena canción es ta padre muy pegadiza ",
        "Desde Honduras ",
        "Hemosa la chica, que buena oportunidad. Eres grande ",
        "Ame  esta canción ",
        "Trap",
        "Vamos por ese MILLÓN ",
        "Aquí andamos",
        "Rifaste",
        "Muchas buenas vibras y mucho éxito en tu canción, me encanto. Dejen Like y Compartan.!! ",
        "Quisiera ganar los $10,000 ️️️️️",
        "Vamos #1 para tendencia ",
        "Mucho éxito   me alegra que vamos sumando más y más vistas ",
        "Muy chidaaa sigan reproduciendo esta en tendencia la están rompiendo  ",
        "Mucho éxito no olviden dejar su like y su comentario ️",
        "Esperamos otra canción pronto ",
        "Qatar",
        " Mucho éxito  sigamos apoyando ya falta muy poco para llegar a los 2Millones ánimo si se puede ",
        "Nice Song, Nice Video.. Nice music ️ Éxitos ",
        "Que sigas teniendo éxito y el apoyo de más personas 🫰",
        "Por acá",
        "Tomate tu tiempo baby yo no llevo prisa ️‍",
        "Me hace sentir cosas bonitas️‍",
        "Mucho éxito  Dios te Bendiga ",
        "Tenemos que llegar si o si al millón ya es tiempo !!!>⁠.⁠<",
        "Ya estamos a nada de llegar a los 2Millones de reproducciónes  sigamos apoyando ",
        "Vamos vamos si se puede llegar a los 2Millones y mucho más con la ayuda de Dios y todos nosotros los verdaderos fans ",
        "Un abrazo desde Morelia a todo el team sigue así aquí siempre yo apoyando blogs y música",
        "Hola ya estoy viendo tu música esta padre",
        "Un saludo desde Bogotá Colombia está bueno ese tema",
        "Bendiga",
        "Y tu familia",
        "Buen tema te mandaste desde chile un abrazo chingón mucho éxito en todo ",
        "Vamos que llegamos al #1 excelente canción apoyando Desde Paraguay 🇵🇾",
        "Esta canción esta súper chida ",
        "Vengaaaaaa",
        "vamos a tendencia otra vez  si se puede",
        "Vamos vamos si se puede llegar más lejos sigamos apoyando ️‍",
        "Rompiendola",
        "Mucho éxito, no olviden dejar su like y compartir ",
        "Ojalá llegues a más gente 🫶",
        "Apoyando desde el 2017, todavía recuerdo cuando grababas con el team brócoli  saludos bro!!!! ",
        "Sigan reproduciendo mucho éxito",
        "Mucho exito!! No olviden dejar su like y compartir ",
        "Muchas felicidades Roberto y gracias a todos lo que siguen apoyando a este gran ser humano una gran persona ",
        "Muy buena canción"
    ],
    "comments_disabled": false
}