{"video_id": "9XfiE3iseuY", "comments": ["Amigos muchas gracias estamos #1 tendencias Mexico y #5 Tendencias en la música gracias a ustedes ️", "Mucho éxito  No olviden dejar su like y comentar ️", "ESTA CHIDA LA ROLA CARNALITO SIGAMOS APOYANDOLO HAY QUE SEGUIR REPRODUCIENDO DEJEN SU LIKE COMENTEN  ", "Mucho éxito️no olviden dejar su like y comentar️️️", "Mucho éxito, no olviden dejar su Like y su comentario ️", "Mucho éxito ️ No olviden dejar su like y su comentario. ️", "Mucho éxito!! No olviden dejar su comentario y su Like! Ánimo! ", "Mucho exito️ no olviden dejar su like y su comentario ", "Tómate tu tiempo baby, yo no llevo prisa! \nÉxito en esta rolitaaa, no olviden comentar y suscribirse! Y dejen su likeee", "Mucho éxito.. no olviden dejar su like, comentario y compartir con tus amigos ", "Mucho éxito, no olviden dejar su like y comentario ️", "Amigos con un like de ustedes y un comentario podemos hacer que la canción llegue a tendencias ", "Mucho éxito!! \nNo olviden dejar su like y compartir ", "MUCHO EXITO Y BENDICIONES A TODOS \nNO OLVIDEN DEJAR SU COMENTARIO Y SU \nLIKE VAMOS A LLEGAR MAS ARRIBA APOYO TOTAL PARA HOTSPANISH ", "Mucho éxito con esta rolita, no olviden comentar, dar like y suscribirse!!!", "Mucho éxito, no olviden dejar su comentario y su like, sigamos apoyando ️", "Mucho éxito, no olviden dejar su like y comentario\nSuscríbete para ver todas las canciones y las nuevas no te arrepentirás ", "Mucho éxito ️ No olviden dejar su like y su comentario! ", "No olviden dejar su like y su comentario, para seguir apoyandooooo. Mucho éxito!! ️", "Mucho éxito y bendiciones!!! ️... No olviden dejar su like y comentario.. ", "Mucho éxito  no olviden dejar su Like y su comentario  \nMe encanto esta canción! \nLa puse de tono de llamada ", "Muy buena canción!\nMucho éxito, no olviden dejar su like, su comentario y compartir! ", "Mucho éxito️  no olviden seguir apoyando, dejar su like, y suscribanse ️", "Mucho exito, no olviden dejar su like y comentario", "Éxito, no olviden dejar su comentario, su like y compartir para seguir apoyando ", "Mucho éxito  no olviden dejar su like y comentar ️", "Mucho exito no olviden su like y su comentarii y compartir ", "Suerte para todos ️ no olviden dejar su like, suscríbirse y compartir. Que bonita canción ", "Mucho éxito no olviden dejar su like  y comentar bendiciones ", "Mucho éxito no olviden dejar su like y su comentario sigamos apoyando ", "Mucho éxito no olviden dejar su like y comentario sigamos apoyando️️️", "Mucho éxito no olviden dejar su like y comentario ", "Mucho éxito ️no olviden dejar su like y comentario ", "TEMAZO!\nAMIGOS NO SE OLVIDEN DE DEJAR SU LIKE Y COMENTARIO BONITO ", "Aquí los verdaderos fans de Hotspanish ", "Mucho éxito no olviden dejar su like y comentarios ", "Mucho éxito ️️️ no olviden dejar su Like y compartir ", "Mucho like  no olviden dejar su exito y seguir apoyando ", "Mucho éxito y no olviden dejar su comentario ️ bendiciones el #1 en México.", "No olviden dejar su like y comentar, y a reproducir se ha dicho!!", "La chica se lleva todo el crédito...es hermosa ", "Mucho éxito  no  olvides dejar tu comentario  like, sigue apoyando️️", "Mucho éxito no olvides dejar tu like y Compartir sigamos apoyando ️\nRolita chida ", "Muy buena canción, no olvides dejar tu like y compartirloooo️", "Mucho éxito, no se les olvide dejar su comentario y like sigan apoyando ", "Mucho éxito  no olviden dejar su comentario  y su like ", "Aquí solo los verdaderos fans que que ya esperábamos la canción ", "Buena rolita...Mucho éxito!  Dejen su like y comenten ", "Mucho exitooo,dejen su like y su comentario️️", "Chicos no olviden su lindo like y compartir esta hermosa canción ", "Mucho éxito no olviden dejar su like y comentar", "Éxito!!! No olviden dejar su like y comentario ", "¿Cuántos más vienen en chinga de tiktok? Jaja ️‍\nOjalá vuelvan a llamar a la chica, muy padre su actitud. ", "Mucho éxito no olvides dejar tu likes y comentario, bendiciones ", "Mucho éxito, no olviden dejar su like y su comentario", "Mucho Éxito No Olvides Dejar Su Like Y Comentar Dios Les Bendiga Mucho Existo", "Mucho éxito, no olviden dejar su like y su comentario ", "Muchos éxitos más  no te olvides comentar y dar like ", "Vamos a romperla, hasta ser el #1   compartan", "Mucho éxito amigo bendiciones   no olviden dejar su like y compartir", "Vamos por los 2 millones si se puede  sigamos apoyando .......", "Mucho éxito! No olviden dejar su like y comentario 🫡", "Mucho éxito, no olviden dejar su like y comentario! SUSCRÍBETE!", "Éxito en todos tus proyectos amigo Dios te bendiga \nComenten, denle like y compartan", "Apoyemos,para  que llegue a 1M de visitas muy rápido ️", "Arre! Buen tema, apoyemos a @HotSpanish Music no olviden dejar toda su buena vibra suscribiendose, dejando su like y su lindo comentario para seguir apoyando a esta gran persona. <3", "Mucho éxito no olviden dejar su like y compartir ", "Mucho exito no olvides dejar tu like y tu comentario  y comparte saludos.", "Mucho exito!!! no olviden dejar su like y comentario", "Mucho éxito no olviden dejar su like y comentario ", "Bendiciones para tu cancion hotSpanish mucho éxito no olviden dejar su like  y su comentario  ", "Excelente tema , no olviden dejar su like y comentario ", "No olviden dejar su like y su comentario. Mucho éxito!! ", "Mucho éxito amigo.\nNo olviden darle líke y dejar su comentario.", "Mucho éxito  no olviden dejar de dar su like y dejen un comentario y compartan el video de hotpanish esta muy buena la música ", "Que padre canción,  escogiste el mejor paisaje \"la playa\" siiempre es un buen lugar  para hacer cualquier cosa,  te quedo super chida...  Apoyemos con un ligero para llegar a tendencias", "Muy padre cansion .. mucho exito ... \nNo olviden dejar su lik,compartir y dejar su comentario ", "Desde Colombia, muchos éxitos ,que buen tema, no olviden dejar su comentario, suscribirse y dejar su like.", "Mucho éxito, no olviden dejar su like y comentario", "Muy bonita música ️ mucho éxito, Felicidades y bendiciones  no olviden dejar su like y su comentario", "Mucho exito y que vengas muchos videos mas felicidades no olviden comentar y dejar su like y seguir apoyando", "No importa q no haya modelos o no sea una grabación top profesional tu sigue trayéndonos musiquita y nosotros felices", "Mucho éxito no olviden dejar su like comentar y compartir ️‍️‍", "Mucho éxito  y no olvides dejar tu like y comentario", "Mucho éxito, no olviden dejar su like y comentar, suscribanse!", "Mucho éxito no olviden dejar su like y su comentario ️️ suscríbete ", "Éxito, no olviden dejar su like y sigamos apoyando ", "Ahuevo ahí que darle apoyo a nuestro orgullo mexicano ️aquí los verdaderos fans", "Mucho éxito borrego  no olviden dejar su comentario y su like  y compartirlo", "Mucho éxito no olviden dejar su comentario y dejar su like y seguir apoyando", "Muchas Felicidades!! Mucho éxito no olvides dejar tu like y comentario. ", "Linda canción no olvides dejar su like y comentar ", "Que bonita canción  bendiciones  No olvides dar tu like y tu compartir", "Mucho éxito ️ no olviden dejar su like", "Una canción inigualable\nDesde su letra, su voz ,su concepto que le da un toque epico por un atardecer espectacular para los amantes des los atardeceres, y para las personas que desean ser amadas y buscadas de la forma en que describe está hermosa canción ,solo debes escucharla sobre todo en un atardecer lindo y dejarte llevar por su letra que te relaja", "Mucho éxito, y dejen su like, apoyemos para que llegue a más vistas ", "Mucho éxito, no olviden dejar su like y su comentario. Amor tu contenido, y hay q seguir apoyando a este vato chingón siempre ️", "Mucho exito amigo no olviden dejar su like y su comentario apoyemos!", "VAMOS A DARLE UN MILLÓN DE VIEWS EN UNA NOCHE PARA QUE SE MOTIVE .....", "Me gusta ver tus vídeos, tus retos . Mucho éxito \nPd: No olviden comentar y dar su like ️ Apoyen!"]}