{
    "video_id": "9XscvqG3CCU",
    "comments": [
        "Wait a sec... Wakanda is on earth??? That's fucking hilarious!!! I thought wakanda was on another planet! WTF???",
        "You know, as I said Vikram is a great Indian movie that I bet you’ll love",
        "Honestly after seeing the situation in Ukraine, I think wakanda would do just fine against Russia haha ",
        "Thanks CD.. Well that puts the 9 inch nail in the primordial coffin .. as if I'm going to see this colossal schlock any time soon! p.s. I just made a contribution to your Kickstarter campaign last minute.. so this vid was time well spent ",
        "I miss Boseman",
        "Seeing a two hundred pound guy being able to fly because he has hummingbird wings on his feet pretty much tells me everything I need to know about this movie.",
        "Its amazing totally amazing, the lack of awareness with these woke fools. Like self-awareness or any awareness at all. Flabbergasting",
        "Thanks for the heads up. Another movie bomb avoided.",
        "actually the mosquito drone does come in a couple times, like when it lands on the FBI car.  I do agree that Ross is the worst CIA agent ever.  I saw nothing wrong with the scenes with the mercenaries- it would be like another country sending mercenaries into a U.S. nuclear missile silo.  Shuri's decision to spare Namor didn't make a huge amount of sense, but I knew they couldn't kill the character.  I do think Riri was done a lot better than America.  I disagree with the assessment of Shuri- Letitia really stepped up to the plate.",
        "Girl power! Black power!! Black girl power!!! Every guy in the audience: Meh....",
        "Wow i used to trust ur opinions but i can see now that race issues come first b4 ur movie reviewing skills. U are dumping on this well written,character driven, epic of a movie that also stands as a tribute to an american actor who died in real life. Dont let politics corrupt ur channel",
        "Let’s not forget the after credit scene, was literally the last 30 seconds of the movie. ",
        "Namor impaling her with her spear was barely a flesh wound Drinker! It must be a Disney idea that strong black women are immortal\nas they did the exact same thing in Kenobi.",
        "A young black person killing police officers? Imagine my shock.",
        "To be fair, the tactic of drying Namor out so he loses his powers is done in the comics.",
        "As is becoming the norm, I look forward to the Drinker's reviews more than the actual movie.",
        "Black panther was way overrated and the only reason it was successful was due to it being black.",
        "If it makes money, there will be another",
        "They destroy Black Panther, as they did with Love & Thunder. But yes, you mention something very important: this movie show me how tired i'm from Marvel and the MCU. I finish here, for now.",
        "Challenge accepted.",
        "If Killmonger won, fought and killed Namor...   Would he then be known as Fish-Monger !!?",
        "TOMATOMETER 96% AUDIENCE SCORE 79%",
        "I disagree this was much better than the first one",
        "They could so easily make Wakanda be the villain on the world stage it is so funny.",
        "Hopefully we can appreciate the effort and time he spend with his kids in his videos, thanks for making my childhood plus hundreds of others. Your bendy and the ink machine videos were especially entertaining in my opinion.",
        "I'll say one positive thing here. I like the Mayan motif behind the villains. Every Atlantis or Atlantis knock off is modeled around Greece, so it's a nice change of pace to see fish people with literally any other cultural inspiration.",
        "This is by far the best MCU movie\nI disagree with this video",
        "It wasn't that bad. I turned my brain off expected nothing, but the characters felt way better compared to the last jedi for example. The story itself is meeh. Not one I will remember in a few years.",
        "I'm pretty sick of superhero movies. It's time to move on, like we did from zombie crap.",
        "Funniest comment I’ve heard so far about Wakanda Forever comes from an old friend from back in my New York City days, “Black people versus Hispanics? Sounds like my old neighborhood, except none of us could swim.”",
        "what need for strong woman???they everywere....thats just couse i am black rassism",
        "The fact you said namor was a boring forgettable character/villain makes your whole opinion on the movie irrelevant lol  hes the best new character they introduced and obvious to why he wasnt killed off",
        "who cares if he died. He is a random actor i only knew from black panther wooed de doo",
        "At this point how are we still having the CGI conversation? Disney of all studios should know how to make CGI work and look good , that alone lets us know this movie is just about getting \"phase 4\" going and swapping to mostly all female Avengers , storyline and everything else is an afterthought",
        "Ocean Man - \"I am Mr.  Nimbus. I control the Police!\"",
        "thanks drinker for saving me the time and money",
        "95% verified audiance score on RT, A on Cinemascore, 93% positive with 85% definite recommendation on PostTrack poll. Nearly 550m worldwide after 2nd weekend. Unanimous praise for Namor and Tenoch Huerta. But who cares what critics or audiance feels. But Drinker sys it's bad, so it's bad. If he says it's equivalent to WW84, then that must be the truth! What's ok then? Black Adam is totally \"OK\"! A film, that is struggling to cross 400m lifetime and is almost 150-200m behind the break even number. But that's an okay film but Wakanda Forever is baaaaad ",
        "Lol \"He attacks Wakanda by making everything a bit wet\" Hilarious. Very good points for sure. Appreciate your hard work TCD (lots of editing in your videos).",
        "\"It's okay when we do it.\"\n\n\"The situation is nuanced and complex when we make mistakes.\"\n\n\"There's historical reasoning that pardons our bad actions.\"",
        "Who names their kid riri? It's like her parents wanted to get bullied at school.",
        "I knew it: the \"Are we the baddies?\" line (3:54) simply HAD to be in this review, it's just so fitting! Long live Mitchell and Webb ;)",
        "While I don’t necessarily agree with everything in this review, there are a number of valid critiques here.\n\nI respect Marvel for at least handling Chadwick’s passing tastefully, but man there were hurdles that needed to be climbed.",
        "The only thing i didn’t like was Riri Williams. Other than that i thought the movie was pretty decent",
        "Hi Drinker, this comment has absolutely nothing to do with Wakanda Forever or your review.  And I'm sorry about that.  But could you do a review of 'Shawn of the Dead'?",
        "Haven't seen the movie (and it sounds mediocre so I probably won't) but I think Ocean Guy looks pretty cool.",
        "Riri is the most ghettofied Wakandan name and you can't take anyone named that seriously",
        "I am very confused on how exactly this movie is so bad to people? Like i thought it was great, i dont see any major issues whatsoever",
        "Apart from the very clear issues with the movie, such as the pacing, the expressions and emotional impact of characters, and a rushed feeling of shuri coming to closure; it was a good movie. It told an interesting story that yes, was drawn out a little too much and could’ve had a bit more action sequences, but still had me invested for a majority of the film. Every time Namor or Talokan was on screen it was perfect. Honestly, this video could’ve been 5 min. The issues you present come across as very ignorant as if you haven’t watched any of the past Mcu movies or even this one. You literally went on for 5 minutes abt how Wakanda prolly isn’t the most powerful country in the world. What?? Please tell me what tf a dude with a gun is going to a mf who’s wearing BULLET PROOF armor. Like…? Idk it was a fun video but it seems like you’re nitpicking for scraps.",
        "I mean if you had no part in the making of it this is just all ur little Opinion",
        "5:00 Actually, the most powerful nation in the world is very clearly Norway. This is because New Asgard is located in Norway, and Thor could solo literally all of Wakanda by himself.",
        "I'm rewatching all his videos now that he has passed and that ending just really hits different. \"I'm free.\" The Great Potato War is what I believe is the ultimate display of Techno's true capacity in scary intelligence and shocking talent. His remarkable characteristics have made him so unique and embroidered in most everything minecraft by now. Mad respect. RIP",
        "5:53 somebody share the link/name of the song, all I get is Spongebob clips when I google it",
        "I've seen every marvel movies including captain marvel , in the theaters. Thank god i skipped this one after a marvel fan friend told to skip it",
        "Shuri used the mosquito drone again when they’re making the getaway from iron hearts garage/lab?",
        "No.",
        "wakandas army would not stand a chance against the u.s marines",
        "\"It's OK when we do it.\"\nIt the code of the left.",
        "Loved that scene in the movie where Shuri goes \"It's Wakandin' Time!\" before standing up against Guy-ladriel!!!",
        "T'challa actually becomes the god of death, in the comic stories. They could have incorporated that in some way, and used it as a reason to return warmonger. Imo.",
        "Needed a booster, fricken hilarious.",
        "Angela Bassett started working out 2 play Tina Turner n Whats Love Got To Do With It & she stuck with it",
        "Riri Williams was originally Starks prodigy like Spider-Man. However, since MCU Stark died in infinite war it kinda ruins her story. She caught his eye when she was able to somewhat reverse engineer his suit. She was also much younger then her movie counterpart and was fifth-teen attending MIT to be an astronaut.",
        "You know, I used to think that Shuri becoming Black Panther would be cool to see simply because she’s so not suited for the role so she’d need a huge character arch. The trouble is, the writers aren’t good enough to pull it off.",
        "Can you do a review of woman king",
        "Thanks again for watching movies so I don’t have to!",
        "I also can't get over the fact that they ruined Namor as a character, his backstory was completely changed to fit \"The message\", his ankle wings are a product of its time, he is one of the very first characters Marvel did along with Cap and the original Human Torch, but my God, he is so pathetic here while in the comics he is more of an unpredictable and scary wild card switching sides to his convenience.",
        "I recommend watching Black Adam instead",
        "Tchalla dies then There should have been a war for the black panther mantel then some cool dude in the movie he's Tchalla and killmonger in one guy he takes one of the black suits to save the royal family from a sneak attack nearly killing about a lot of ppl  then he asked to return the suit but refuses. He still does good shit. Then final fight against namor and wakanda cheering for the black panther who is not royalty but who is like the spirit of the panther. Not a king  but a protector. Sheeri and mom queen can have the throne but the new black panther is more black and even more cool headed. And he ain't no uncle Tom Michael jai white tbh. Just a broke talented brother tryin to do the right thing.",
        "Why we need another girl superhero? what that will proof, world don't have strong man any more or don't need them . If I will save by the woman I will be in shame to rest of my life if she kicks my ass that's will be good reason to end my life. Why they putting that girl's in that role girl's don't need them and boy's don't need them there .",
        "The pacing makes an Arctic glacier look like an f1 car......lmao!",
        "Wokebrokanda forever",
        "Just make Winston Duke (M'baku) the new Panther Man. He's extremely likable. He could grow from the guy who lost the fight to the original Panther Person, because he was too angry or didn't have the right mind set. He could be the new Panther Guy after some personal growth.",
        "The only movie critic I trust !",
        "Namor is one of Marvel's first characters and they did him little to no justice.",
        "I would’ve liked it if it was more like the comics when shuri took the throne. Namor and shuri/tchalla had a back and forth till they both lost a lot. Then the beef was kind of squashed after secret wars.",
        "Wakandan Jarvis ",
        "8:10 Wasn't the mosquito drone seen again during the attack on Riri's warehouse? It was a tracking shot of the mosquito, it sticks to the armored truck to hack it or something. Forgot what happened exactly after that",
        "even though this movie is dead average, but it still way say better than black adam.",
        "I deadass felt like I was watching a bollywood movie",
        "Thank you for the recap. I sat through this cinema mess and couldn’t follow the plot for anything. This movie has the weakest antagonist ever and I couldn’t figure out which person was the real protagonist. CGI salad and then pacing suffers death by dialogue. Too much needless talking scenes. Do yourself a favor and wait for streaming so you can at least hit FF.",
        "The movie was not bad vangela Bassett deserves a Oscar for her preformance...seems like you are getting paid to bash the movie bro calm down the movie is based off a comic book",
        "Ya it was even worse than what I feared. It kills me how these critics say it's a masterpiece.\n\nIf taking a crap on film is a masterpiece then I guess it is.",
        "Wish the Avengers were there to see T'Challa in his final moments.",
        "It would have been way more impactful to have Namor kill T’Challa in the opening scene to establish how much of a threat Namor is, kind of like a Thanos in Infinity War type-thing. Maybe some Star Wars-esque crawl in the opening credits to explain their rivalry and how they got into this situation. All they had to do was CGI the Black Panther suit and establish that T’Challa is in it, have a big overblown CGI fight, and have Namor pull T’Challa down to the deep ocean floor. Fade to black for a moment then Namor respectfully returns his body to establish him as a man of honor to add some intrigue to the character. Then a respectful funeral scene. Have the leaders of the Wakandan tribes duke it out for the Black Panther mantle, maybe add some political discourse and exposition on Namor, and bam get on with the story with a new Black Panther. In the first act the protagonist is shown as dangerous yet principled, Chadwick Boseman’s character gets an honorable send off, and we have a new Black Panther.",
        "I see a lot of nitpicking",
        "Worst introduction of an amazing character(Namor) and making up characters like Suri and RiRi just to pander to the woke and female crowd is just ridiculous.",
        "The thing that got me about the whole riri Williams thing is the Wakanda's assumed she was a old white women and were thinking about turning her in to Neymar but when they found out she was a black women it changed to protect her at all cost even if it leads to war..... Come on",
        "The movie was trash  bro I was disappointed ️",
        "Commentator \nis jealous",
        "It's funny how the Winter Soldier was cryogenically frozen while Shuri figured out how to deprogram him and T'challa died, wasting away to his death. Gotta love those Marvel plot holes.",
        "Bassett is not that good as an actress.",
        "I didnt like black pamper because shitty diapers stink!",
        "Wakanda Forever has a 95% on rotten tomatoes.\nI think the only explanation is the starting and ending scenes were enough to cause people to forget the middle apparently. \nThoughts?",
        "It just looks like an excuse for woman love and a further excuse to redo Namor as some kind of Nancy boy. The only slightly strong male was Ross and he was made to look crap.",
        "Namor casually giving Shuri a water suit of someone he probably killed painfully and removed their body from was pretty morbidly funny",
        "Disney respects African culture with wakanda forevever but makes a laughing stock of Norse culture in love and thunder. You can see where their agenda lies",
        "“I guess if you get really Ill you must have to take more of it to reinforce it or something” …nice",
        "You are a uniquely brilliant critic!",
        "It says something about the state of the MCU when I look forward to the drinker's review of the movie more than I look forward to the movie itself",
        "Wasn't perfect, super hero movies never are but I feel that this time, a lot of things flew over Drinkers head. Could do with a sober rewatch Drinker.",
        "As someone who's worked in the filmmaking industry for too many years, in VFX/Post, it's always amazing to me that anything cohesive from Marvel even makes it to final edit.  All of these big budget high profile FX heavy movies are written by one committee, designed by a 2nd committee, produced by a 3rd committee, directed by a 4th committee, edited by a 5th committee, then distributed/marketed by yet another committee.  Each of whom have their own separate agendas and ideas, and barely communicate with each other.  Not to mention the multiple teams of lawyers, 200 layers of approval on every little thing, then some clueless studio head randomly coming in at the last minute to play \"Director\" and demand changes!",
        "Only thing good about the movie was the post credit scene",
        "I love that my watch List is based on your reviews!  You have my style of humor and I'm glad you have a platform here to entertain us ",
        "Movie was suppose to have Doctor Doom in it. What happened? Too scared to change and be better. Disney made Black Panther a super scam to hurt the guy who could not save himself, and now the sequel without him is destroying him more in spirit. Hollywood has been in the wrong the whole time and we get this trash when Japan and China have better more fun movies.",
        "Wrong. Wakanda forever has the best story telling of all time.",
        "One of the biggest gripe I had with the movie is why the heck wasn't Bucky present for Tchalla's funeral? Bucky owes him his life",
        "What Chadwick Bozeman’s family said was heal up d rather people recast him",
        "This entire video seems like you’re just bashing something that is successful just cause you don’t like superhero movies and marvel in general. The movie wasn’t perfect obviously but it is not the garbage you make it out to be, this video REEKS of you not knowing anything about marvel and their characters",
        "The real wakanda was inside us all along",
        "If you want a solid Black Panther story and a more thoughtfully fleshed out Wakanda, just watch the 2008 animation.",
        "gotta disagree",
        "oceanman, take me by the hand, lead me to the land that you understand",
        "Listen mate, I wanted to defend the movie. But your completely accurate . I found myself laughing with you, Black Panther made me proud to be black. This is shii'",
        "I'd like to see a CoD review from you... nothing is real enough. ",
        "From the way you describe this movie, it sounds like a movie from THE ASYLUM film studio :)",
        "\"It's OK when we do it\" is just a manifestation of the underlying theme of all superhero stories: Might is Right.",
        "After seeing Riri Williams pop up in this movie, I think we all know they're litterally making an all female Avengers cast. They have She-Hulk, whomever that chick was from the Hawkeye tv show, and now Riri. And Twitter got their knickers in a twist when fed up people called out the M-She-U for what they're doing.",
        "YAYYYY!!   WOKE-ANDA FOREVER!!... SUCH A... cough cough.. er... 'Well written, scripted, well acted, well made and well received movie'... Ahem...     🇬🇧",
        "I have a feeling that your summary is more entertaining than the actual movie.",
        "At one point, because of how powerful Angela Basset was in this film, I genuinely thought she was going to be black panther.. but no. It was LONG but I liked it more than the first one",
        "I knew it was going to be bad, for so many reasons it couldn't be anything else. Maybe if it gets remade in the future, it'll be a good movie.",
        "the best part - Angela Bassett as the Black Cougar ",
        "MCU still in that \"Let's make all of our Main characters Female\" state of mind too then it seems?",
        "Marvel: \"Hey guys, hold your hand out. I got a gift for you!\"\n\nEveryone: Holds hands out ",
        "Alternative title: Drinker explains how the US will spread \"democracy\" to the ocean",
        "I saw this last night.  It might be the worst movie I have ever seen.",
        "Dude, the \"most powerful nation\" stuff made no sense.  And also, what about the fish people falling asleep on land and waking up not being able to breathe on land?  Shouldn't that knot have just tied itself right away?  Or wouldn't at least have of them thought to do something other than run into the water?  Super easy to fix that issue by having them fall-out on a low-tide beach and wake up underwater after the tide comes in",
        "I think there were plenty of ups and downs. In my opinion I really loved the movie, but that is just me. Sad that Chadwick Boseman died",
        "I’ll support any movie with a black cast but when the movie sucks as bad as this one did, I can’t do it.",
        "you cant be good at fighting if you are a nerd\nsimple as",
        "People talk about it being ok or mediocre, but you should've seen the live stream review, Drinker explained the exact plot simplified and it sounded like a 10 year old wrote it  ",
        "My big issue with the modern crop of woke characters is that the writers seem compelled to always present them as competent and flawless paragons of virtue instantly loved and accepted by thier peers and legacy characters. Queen Romunda should've been absolutely grief stricken even to the point of descending into madness at the loss of her son. Instead of instantly accepting Shuri as the Black Panther, M'Baku should've challenged her and lost, so Shuri earns his respect instead instantly giving it on sight of a 90lb who he already knows wasn't raised as a warrior. Same thing with the SW sequels. Having to survive on a desolate planet by herself, Rey should've been more of a scrappy and untrustworthy thief that eventually becomes a good person. The presentation is the issue.",
        "Namor's people actually started out green skinned in the comics & later on blue skinned when he was rediscovered by the Fantastic Four. These stories pre-date James Cameron's Avatar by 3 decades.",
        "I didn't think the first one was a masterpiece.\nBut it wasn't bad. Black Panther as a character was fine, I think it could have been better, but he wasn't bad, and was acted very well indeed.\nThe antagonist was interesting to me, because he wasn't really wrong with quite a few of his points. He was a villain, because he went to far with his ideas for sure, but there were some true points for sure. That made him interesting to me.",
        "Since there are so many teenage prodigies now, wouldn't that make them the new norm, and everyone else is now stupid?",
        "There should have just been a power struggle in Wakanda now that T’challa had died. You know, all the tribes want to fight for the throne and causes infighting - like civil war but worse.",
        "Im gonna have to disagree. Grief was present throughout the whole movie & it was handled super well. to say Namor is the worst villain &  doesn’t have any motive is such a white take. You clearly missed the whole idea behind Namor being a man scorned because he witnessed Spanish colonization & how vile it was. It’s pretty simple: he was motivated to protect his people from being exploited by white people yet again, & he would do anything possible to make sure it doesn’t happen. This is his grief. Instead of nitpicking random things like how shuri got Ross’ attention, maybe take a second to see the nuance of colonization from a pretty emotional & different perspective than we’ve seen in the MCU. & if you truly can’t see his motivation STILL, it’s possible this movie just wasn’t for a white like you. & btw, saying Namor looks ridiculous when it’s pretty obvious Talokan/Namor were heavily influenced by historically accurate depictions of traditional mesoamerican art & culture feels a little racist",
        "I think it's fine that Wakanda doesn't want any business with the rest of the world's problems. It's not your problem",
        "Man I never expected this movie to be good, but it turned out to be worse than I expected. Absolutely pathetic like the rest of the MCU now",
        "Wakanda: we have authority wherever we go\nAlso Wakanda: basically forced Sokovia Accords down Avengers' throats",
        "I wish i had not given up drinking",
        "Critical Drinker with a rare miss  Respectfully disagree with a lot in this video..Feel like a lot went over your head",
        "The Ocean Man naming bit made me laugh out loud!!!",
        "Most racist movie ever ",
        "Wait. Shuri got stabbed in the gut and lived? \n\nWhat is with up Disney and having characters stabbed in the gut and live? ",
        "I really think you should start by stating whats good about a movie, not because i care but because you really start to spiral into seeing veerything in a bad light. You say f.e. that \"Namor isnt intimidating\" , he threatens Wakanda during the \"Info dump\" and then proceeds to follow it up by literally invading them, killing tons of Civillians and their queen just to demonstrate his advantage. I agree with a lot of things you say about this movie but you really choose to ignore so many great aspects about it its frustrating imo. (Examples: The scene where M'Baku shows up for the trial is an insanely detailed character choice for shuri and surprised me in every way / The time this movie takes for world building is a big improvement, Namor and his city are well explained and their existence makes perfect sense within the universe as well as the reason they are only coming up now)          ",
        "\"The Drinker has jurisdiction wherever the Drinker finds himself to be\"\n\nMan's drinkin straight facts",
        "How anyone is invested in this character/movie and the MCU as a whole, I just can't wrap my head around it",
        "They should have recast T’Challa. Hopefully it appropriately flops.",
        "Hey, drinker why haven't you talked about batman? I would love your in depth take on it.",
        "I thought I was the only one that thought it was shit ",
        "I would love to hear a debate between Drinker and Birdman about this movie.",
        "I used to watch The Critical Drinker so I could avoid bad movies. Now I watch it just for fun because there's no such thing like a good movie anymore.",
        "I bet yall dont like this villain or killmonger get these pale skins outta here",
        "You wouldn't understand because you can't culturally connect to the movie",
        "The original black panther didn't have a vibranium suit it was actually a cancelled comic because it was seen as stereotypical Because he smoked a special herb and couldn't feel pain and the tribe did not have advanced technology",
        "Wankada aka America",
        "Imagine that vibranium was in England and not in Wakanda...That plot would be impossible for that would be fascist, racist and shit",
        "Your thoughts on 1899 Netflix series?",
        "I am not sure what we expected this is 2022  marvel",
        "You know... the ankle wings were a part of the original character of Namor - along with his vulnerability to being dehydrated. He was far stronger, when he was in the water, and slowly lost strength, when he fought on land. I think that water also affected his mental stability. There was an episode of Spider Man & his Amazing Friends, where Peter fought him & kept him away from water, until his strength ran out.",
        "I hate how everyone were praising this a lot and said this is the most emotional thing ever and this has the best writing\nThanks drinker you are literally one of the few who'll share the truth",
        "Yall just like to complain, it must  be miserable always having to go out of your way to nitpick every little thing. Good acting on all parts, excellent story, amd beautiful visuals. Next time actually watch and enjoy.",
        "“It’s okay when we do it???” No it’s NOT okay; THATS THE WHOLE POINT THE MOVIE IS MAKING; AGAIN!!! Come ooooonnnnnnnnn man; you ain’t even tryin!!",
        "Let’s be honest though, Black Panther is dramatically overrated in part due to affirmative action likes. Chadwick was charismatic. he and the momentum of the mcu carried the movie which was a cgi cluster with the same message pandering this one is being criticized for",
        "Well you’ve inspired a new video idea, at least you put something positive into the world.",
        "\"It's okay when we do it.\"\n\"The situation is nuanced and complex when we make mistakes.\"\n\"There's historical reasoning that pardons our bad actions.\"",
        "I liked it. Wasnt perfect but i feel like alot of your complaints are forced or maybe just a build up of how poor phase 4 has been.",
        "This was my first Marvel movie after No Way Home and my God have they fallen from grace. Maybe it's because they had to work around losing Chadwick (R.I.P.) but then they should've delayed it further because the script makes little to no sense. The worst part is I found this movie incredibly boring, something no other Marvel movie has managed to achieve as at the very least I found them to have entertaining action scenes. I haven't watched Dr Strange MOM or Thor4 yet but if this movie is any indication then Marvel really has run out of ideas at this point. I found no \"Marvel Magic\" at all in this movie, so much of the plot makes 0 sense, people do things for no good reason.",
        "There is no way that Chadwick would want the character he loved to just die off screen. So weird they think that. I bet money that anyone would say the same who plays a character they enjoy.",
        "Isn’t this movie based on a fantasy? Go watch a documentary if you want something cohesive and factual.",
        "The only interesting thing about this movie is Namor",
        "While I did enjoy the movie and I do see through the point of view of Critical Drinker. Trust me he brought up a lot of points that I myself was like, \n\n“Holy cow! I was thinking that too! I am a critic after all! Yay! EEP!” XD ",
        "Bro hates every movie he sees lol",
        "Angela Bassett has always been top tier in so, so many ways.",
        "Thank you, Drinker. You never fail in pointing out what should be obvious to everyone.",
        "I hate how everyone is dealing with extremes, was this better than the first one no. There were some plot holes and confusing choices in battle but the movie was okay. I would give it a 7/10 but i never felt any forced feminism BS, it was a bad choice to bring ironheart on while keeping here “born genius” story. The comic failed and they should’ve made adjustments to compensate but there were a lot of cool moments in the movie. And there were legal issues with Namor so they had to change his ethnicity to mayan and I don’t understand the big issue with that. They change the origin stories for plenty of marvel characters and nobody cared. Idk, i get the movie wasn’t the greatest, or as good as the first Black Panther. But the outrage its getting and people dealing with extremes like,”Am i racist if I dislike it?” As a black man no, you are entitled to your own opinions, and if anyone calls you racist they’re stupid or they’re trolling. But this movie is probably the best we’ve had since Shang Chi and Spider Man, which isn’t the best they could provide. But at least its the step in the right direction",
        "Even my mother…who puts in diligent work to support the message…was baffled by Shuri being the next Black Panther. If the movie was an extended setup for her to NOT be the panther (to yield to Nakia, Okoye, or even M’Baku) it would’ve been more interesting and fitting for her character. Oh well, at least we have an adorable new kid to suit up in a decade or so (or more likely, in the inevitable Young Avengers).",
        "I didn't love it, but I didn't hate it. It's just ok.. Waaay too long, but I disagree it's anywhere near as bad as WW84.",
        "You know the Drinker is a man of culture when even he admires how in shape Angela Bassett is for her age.",
        "Honestly, if there weren't so many shitty movies being made nowadays, we wouldn't have as much great content from you, Drinker, keep it up!",
        "Wait... how did you even see it, given your...ahem... paler complexion? I thought \"people like us\" weren't allowed?",
        "gotta love the unabashed hate featured on the youtube homepage ",
        "I thought Zemo was worse than Yellow Jacket",
        "At this point I don’t know really what is or not a mess…. Many of these Marvel reviews has got to do with fake high expectations than the actual movie .",
        "The best super hero movie as at now is Black Adam. Anything from MCU is trash",
        "I've gone through it carefully and the villains full name is \"Hakane Farking Tak Naemoor Avis Ferkeen Shyteya Bawbag\"",
        "I liked it when shuri said \"its shurin' time\" and shured all over everything. I was crying so much I literally shat your pants",
        "Am I tripping that yall saying shuri couldn't help tchalla  .   You know she could've save him right?   He's dead in real life",
        "Finally saw the movie and watched your review. Love your stuff, but you seem to have forgotten a couple things. You claim the movie was preachy but give no distinct examples. Also, you failed to mention that early in the film Marvel broke one of the rules and let a male character beat the crap out of a female character because it made sense. Finally, Namor was intimidating, you just missed it by taking a dump. He burned an entire village as a child just to bury his mother and run off the conquistadors. Other than that stuff, great review and largely accurate.",
        "They should have recast! The only thing good in this movie was Killmonger.  What a waste.        P.S They do it with white Superheroes like Superman.",
        "Is Freeman the Colson equivalent of the MCU?",
        "They should have either recast Black Panther or resurrect Killmongee, give him a redemption arc and make him the new Black Panther.",
        "Based on how good and memorable the opening and ending scenes were, it seems manipulative. The first thing you associate with the movie is the opening scene, forget everything in the middle, and then leave the movie remembering the final scene.",
        "Why is this movie then making decent money.",
        "of course it's a MESS!!! They actually made a \"Black Panther\" movie with NO BLACK PNTHER ... stupidest idea ever, bloody rotten ass movie, avoid at all costs.",
        "I couldn't help but feel like they could've maybe cgi her some arm muscles. Her arms are thinner than mine in the final scene.",
        "Its really sad how we when from \"Holy crap __ is out in theaters tomorrow!\" to \"oh great another marvel movie. Whatever.\" in just a few years time.\n\nWe used to be excited to see our favorite comic book hero's come to life on the big screen but now we watch in horror or indifference to what they do to them now.",
        "So, you’re saying this is typical Disney drivel.",
        "I was pissed off on how much they spit on hispanic/latino culture. I felt offended with that Namor BS, but As soon as the queen died it was over for me. After that i was like \"screw this i want to stop watching  the movie.",
        "It's amazing to me that you can get so much for a video on a movie that hasn't even been released to own yet, and along with that how much you manage to absorb in such a little amount of time. Seriously that's pretty impressive.",
        "It's incredibly sad the outcome of this franchise",
        "Can we take a moment to appreciate how much time and work he puts into these videos for us B)",
        "Thanks for reminding me that the writing was just as lazy and worse then the first one.   It was kind of bizarre that they thought they could put the secret back in the bottle",
        "The war against russia joke was a bit too soon…",
        "Just to point out something.. apparently Marvel has decided to take scene ideas from The SpongeBob movie… wtf",
        "Its African American ulture combined with the same effort as Rainbow/Pronoun people. It has become exhausting.",
        "Black Adam \"okay\", but Wakanda Forever is a \"mess\"? Even by comic book logic that doesn't make sense...",
        "It seems like they wrote a script, put all the stuff they wanted into it and right as they were turning it in they were like, \"Oh shit! We forgot to put a villain in!\" And quickly crammed him into the story.",
        "I am nigerian American, and the first Black Panther was underwhelming tbh. Bozeman was a great actor, but the villain was horrendous. The steaks were not high enough. When it came to black Panther 2, I saw the trailer and yeah it looked cool, but I know better than to watch a movie based on its trailer being cool. If it’s pushed by the main media, then it’s more often going to be underwhelming",
        "Everyone is entitled to their own opinions. To bad your opinion is really effing wrong.",
        "Only one weapon can harm Namor:  A hairdryer. ",
        "The part that got me was how boring it was. I couldn't care for the emotional moments as it took so long to get to them with so many useless scenes",
        "Imagine it wasn’t for y’all.",
        "Bro my racist mom liked this movie.  I have no idea what all of you are on.   If you think all MCU movies are bad, fair enough, but this was top tier MCU.",
        "LMAOOO I CRY LAUGHING BECAUSE I WAS JUST SO DISAPPOINTED WITH THIS PLOT LORD! Why was it even 2:40 minutes long wtf?!?! ",
        "I just watched the first two episodes of Tulsa King, it's not bad. You might want to check it out.",
        "Well there is one thing I must say fish man asked help from the wakandans to find the scientist. He didn't know who I believe",
        "The main problem with the film is the antagonist, Namor. We know he's a major Marvel character, even a hero although a gray one. We know he's not going to die. He shows Shuri his nice city filled with happy civilians and children. We know it's (probably) not going to be damaged by Wakanda. So the majority of the film just feels like padding until Namor and Wakanda come to some agreement. Basically, he's just being an asshole until he's bested. The last half of the film didn't really need to happen. ",
        "CD, did you consume enough alcohol to make this film even slightly enjoyable? I remember trying to watch Up In Smoke sober and I felt like I needed someone to hit me with a billy club to end the pain of the boredom. Oh well what are you going to do? I’m going now.",
        "\"Nah, fuck that im calling you ocean man from now on.\"  This is why I watch the drinker.",
        "My nigga can really roast tho fuccin love the drinker yo",
        "finally its just a movie..and mcu timeline ended for me a long ago with endgame...everything after that is just another movie for me...",
        "\"it's ok when we do it\". Sums that 'demographic' up perfectly.",
        "If Michael B Jordan’s character redeemed himself and became the new Black Panther, I would’ve given this a big chance!",
        "I watched the movie, it was good. Branding it a “mess” is definitely reaching. I wasn’t sure if the movie was going to be interesting or not but it was pleasant to watch. You can tell that the filmmakers and cast put in effort. It’s nice to see something different.",
        "They did my boy Namor so very wrong. Apart from the kitch footwings he has almost nothing to do with his original story counterpart.\n\nIf they wanted a random villain, they should have made one. Not haphazardly manhandle one of the big guys of the comic books into this mutated knockoff.",
        "The difference between Drinker and most other YouTubers is that he's unapologetically blunt, regarding his criticisms regarding the MCU and other Hollywood IPs.\n\nI don't always agree with him, but I respect his fierce determination to tell viewers what he really thinks. No holds barred... ",
        "i think you're just a bit pessimistic at this point towards marvel. i dont totally blame you, but i think you're wrong on this one. i liked this movie a good deal. my only issue with it was ironheart. if yuo removed her from this movie, and left everything else, i think you've got a top tier marvel movie here. even still, i rly liked it",
        "Shout out to those of us who haven't seen any of these movies and have no idea about what's going on and don't feel like we've missed out ",
        "“Lay the smack down on some toxic white males” this man is hilarious ",
        "Naymor was good honestly",
        "Nice to see the Drinker and PJW both using each others signature catch phrases ",
        "Wait! So this wasn't a modern art masterpiece in the making? Who knew!",
        "Did the Drinker just make me a little weepy? I think he did. \nAngela Bassett is by far a champion in any production. A cast like they had in Strange Days, and it still somehow looked like she carried it.",
        "One of the issues that I have with the MCU is the following:\nIf everyone can become a hulk (smart hulk) with a blood transfusion from Bruce Banner, everyone can pilot an iron man suit, everyone can become black Panter with some herbs etc. etc., why not just creating few tens of thousands of super-hulk soldiers with an iron man suit and the agility of black Panter? Just in case another intergalactic threat comes along.",
        "I thought the movie was great but I agree with a lot of these points. Was I the only one that teared up at the very beginning scene of the silent marvel logo made of images of chad with no sound ? That was one of the best logo designs ever made in my opinion.",
        "this movie was great and the villain was great as well!!! stop the hate",
        "Namor might be one of the most pointless villains in the MCU (that’s saying something!), but Riri is unquestionably the most aggressively unlikable protagonist yet.  And that’s only six months after the introduction of America Chavezzzzzzzzz…hunh wha?  Am I suddenly narcoleptic??",
        "I disagree the Villian was actually really good",
        "Looking forward to your Film when it drops. Cheers drinker",
        "Black Panther 2 Cons:\n1)doesn't have African music like amapiano \n2)Substitute a role initially done by a man then put Shuri *that's a no no (kill monger would have solved this)",
        "300 million in box office, cry Wakanda for ever is marvels best phase 4 film by far ",
        "They need to tell the audience how to feel about a character hence the completely out of character \"I like her.\" Worst of all, I fucking knew they would say that because its been one of the most egreious parts of Marvel writing, across most films.",
        "I saw the movie and besides the funeral, I’d give the movie a 6/10.",
        "It has its pros, but I won’t deny its cons either.",
        "Watched this with my gf last night and it was so bad.",
        "\"The Drinker has jurisdiction wherever the Drinker finds himself to be\" just has to become another classic line you use every few videos or so",
        "“It’s ok when we do it” is also a growing phenomenon among African Americans in 2022, so technically this movie is accurate.",
        "Longest 3 hours of my life",
        "I disagree. The movie definitely had a few flaws but it was still good. Better than most of phase 4.",
        "This is such a nit-picky review people need to realize no movie is going to be perfect .",
        "Wow I think I forgot about Namor even more than before this.",
        "The US Representative at the UN was the voice actor and mo-cap for Odin in God Of War Ragnarok. That's the only easter egg I joyfully shouted at",
        "Drinker i wonder what other \nMutants: ",
        "I went to check if you maybe reviewed this movie called Fireproof? There was another called Facing the Giants, too. They are Christian films. I don't know if that is up your alley or not, but I know in their day many found them to be quite moving for different reasons. Just putting it out there.",
        "“Somehow I don’t think they would last very long in a war with America, or china, or Russia.”  You know, even though Russia is doing poorly in the war for Ukraine, I still believe that Wakanda would lose.",
        "The only good thing I can say about this dreck is that Angela Bassett is still awesome as always.",
        "Just left the theater. LOVED this film. Really terrible take on Namor. I hate that I always find myself coming across these videos.",
        "Why was there conflict about vibranium anyway? Didn't T'challa approve sharing of vibranium to other countries in BP1 post credits?",
        "Sometimes I forget how funny The Drinker can be",
        "It’s like the people who made this are so scared to be attacked by the very small (but loud) group of people who are offended by anything… they will sacrifice literally everything to appear like an “ally”…",
        "They could have shown that namor killed black panther(Tchalla ). It would have been interesting.if it was only about a conflict with the wakanda and atlantis.",
        "I feel the problem with Riri wasn't the fact that she was important, it's the fact that the movie didn't try and make her important. It introduced her and we had the police chase sequence and then the movie just moved away from her completely and she was never focused on. She felt like she was barely in the movie and it's because they put so little time and effort into making her important that her initial importance felt so shallow as the story moved forward.",
        "Good to see dad bodies being represented here! If your going to cast Namor make him an actual threat and have an intimidating\nlook, instead they made him a joke ... much like the rest of current phase bore or the MSHEU.",
        " Your commentary snapped me off my square",
        "honestly this movie wasn't that bad to me, but maybe that's because i missed most of so called \"phase four\" and it didn't appear as formulaic in my eyes",
        "From his explanation of the plot, this movie could have been a great thriller. The motivating issue is Wakanda's monoploy on an extremely valuable resource and their return to isolation could have been a great setup for something like Civil War or even Winter Soldier.",
        "Well despite the spears Wakanda might be able out against Russia the way it is doing.",
        "“She makes a rake looks morbidly obese” they should hire you to write the jokes lmao",
        "Marvel has become Samuel L Jackson of movie making. Just keep pushing half-hearted and soulless movies out there. So people don’t forget about you. People will always watch that garbage off name recognition alone. ️",
        "To be fair, wakanda could beat Russia. Let's be real, Ukraine is still a thing as of this writing, which is like the ultimate plot twist.",
        "Like i cant believe they made Namor the antagonist of a Black Panther movie, like it could had been interesting to see these 2 things clash in a creative and interesting way IF they had written better Namor but reality had other plans instead.",
        "Wouldn't it be great if the last MCU movie has Tony Stark waking up and saying:\" Wow I just had a terrible dream...\"",
        "The first Black Panther was an atrocious movie on an objective level. The action scenes were laughably terrible and just think for a moment about this supposed epitome of an equal society. You have the poor suckers who need to live in huts outside the force-field in order to maintain the illusion that Wakanda is a primitive society. Are they on rotation with people inside? Is there a lottery system for who has to go live in squalor? Then inside the force-field, things aren't much better. You have a feudal system with the elites having access to amazing technology and a hereditary line of succession that entrenches your birth position contrasted with the poor schmucks eating street food. The movie fails at all levels.",
        "I really thought they weren’t gonna stoop as low to shit on Chadwick’s death. Poor guy deserved better.",
        "They should have left it as Atlantis, and made that Wakandan general Black Panther at least.  It might sound harsh but it'd probably be easier to have just introduced a new actor to be Black Panther...actors have been replaced out before.  Give someone else a chance.",
        "my conclusion about this movies is\n\n\"we want to do the same thing we complain about\" line of thinking",
        "\"It's okay when we do it.\" \"The situation is nuanced and complex when we make mistakes.\" \"There's historical reasoning that pardons our bad actions.\" - wakanda",
        "As a Latina, I was super excited to see Mayan/Aztec imagery in a superhero film. I still want to see this movie due to the homage. I wish Hollywood would understand how interesting and fascinating Mayan folklore is, and would create better stories built on them. Apocalypto while not historically correct was an incredible and gripping film that’s criminally underrated.",
        "I loved Chadwic, I hurt when he died. I mean really, I normally blow off celebrity deaths, but Chadwick's and Grant Imahara are the two that got me in 21. \nBut this movie felt nothing but a 'trying to get him back, but we can't' film the whole way through. \nWhich is way sad because I really went in wanting to like this movie. ",
        "Man it was brutal getting through this dog shit   ",
        "Black panther was terrible, this movie even worse",
        "Thanks CD, you saved me the, time money and trouble of watching this crap before confirming what I already figured.",
        "My absolute favorite plot device is the \"nah it'll be fine\" trope.",
        "They should have just called it \"Woke-anda Forever\".",
        "Glad I boycotted, saved at least 11 bucks [local prices].",
        "So is Ocean Man based on Sponge Bob if his weakness is 'drying out?' ",
        "This movie was horrible and everything you say is correct. The only movie I hated more or as much in the entire Marvel universe was Miss Marvel God that was garbage also. Oh and I agree that RI Ri character or whatever her name is was pointless and unnecessary. Horrible writing. It's pretty bad when I could sit around with a few friends and write a better script in literally a weekend",
        "Sadly there are no people in this movie who look like me, therefore I feel underrepresented and can in no way relate to what is shown on screen. \nAccording to progressive ideology I should not watch this movie, so guess what, I won't.",
        "By preachy do you mean female actors? They were in the last movie. Women have been in movies for a while. Trying to figure out the problem",
        "I agree with everything you said about Chad incredible actor incredible person there are far too few people like him in the world.",
        "Honestly this is the one time I don’t agree with your review tbh. It’s the first marvel movie since endgame that I have semi enjoyed, don’t get me wrong that’s a very low bar to pass but nonetheless I didn’t find myself falling asleep while watching it which is quite the achievement for modern marvel movies lol. It only got 1 of 3 woke flags from me so overall 7/10 could be better but eh its Marvel you can’t expect much.",
        "just as much of a mess as the continent of Africa.",
        "I know his dead and were all sad but I wouldn't have minded if they had changed the actor...\n\nI mean they would have if it were spiderman",
        "Nah, they'd be able to withstand Russia's attack.\n\nAlso the premise literally shows that writers have no idea how technical jobs should be and in most cases are. Documentation is a crutch for everything tech related. You want and need documented steps for even the most trivial tasks. Because if your chief engineer dies, you need to carry on, not go bankrupt.",
        ".....people are acting like Namor and atlantis is new in the marvel universe....Prince Namor was marvels answer to DC's Aquaman....",
        "Ocean man's advanced civilization was people harvesting seaweed , living in old Mexican ruins in caves underwater,while playing underwater handball? stupid AF!!! They didn't even have clothes barely, just sheets ,jewelry, and Spears, even neutered  namor barely whispered imperious Rex under his breath in another language, a woke swj Namor and wakanda..... forever.... This was a bad chick flick",
        "Shiriri had me howling",
        "Glad I watched the movie before I watched this video. Best movie of this MCU phase. Only a few on the nose \"woke\" moments. This was a good use of matinee money.",
        "After wasting Oscar Issac and ruining Moon Knight, the MCU is dead to me. I kept up hope after Phase 3 but I just couldn't anymore.",
        "Nobody can ever say that you’re just some guy on YouTube bitching about movies when you have your books and now are working on your own movie that is open to equal criticism. Even when you make a point I don’t agree with I know that it comes from a genuine place. Thanks for the great content man",
        "Kinda baffled how a new Black Panther was able to beat a warrior who was around since the 1500s ( I wanted the Talokanli to win). Besides that, the movie was a good tribute to Chadwick and i like the idea of him having a son",
        "The usual concise and articulate rundown from the drinker. You can count on him to be soberingly truthful and amusing. He's become my favorite movie critic.",
        "I’m just glad they didn’t overdo this film with jokes. Literally all I was worried about.",
        "Spoiler alert, COMPLETE SATIRE",
        "Did I miss the part where Shuri was this expert in hand to hand combat? I don't recall her doing anything that made me think, damn she's the next Panther! So she drinks the formula and all the sudden she's an expert at hand to hand combat? I found this part to be a bit unreal. Kinda reminds me of Ripley getting like 10 minutes of gun education and all the sudden, she turns into Rambo in Aliens.",
        "I couldn't go see it because I'm white",
        "Remember when being a super genius was a rare trait? those were the good ol days",
        "The MCU has been shit since the very first Iron Man movie. What do you expect?",
        "But my enemies call me Ramon...",
        "i loved the part where namor said “it’s namorin’ time” and just namored all over everybody",
        "RIP Chadwick. You will forever be Wakanda to me.",
        "I turned my brain off and honestly had a great time! It was better than Love and Thunder, that’s for sure.",
        "So basicly the continued attempt to replace high payed skilled actors and compitent nonactivist writers in order to save a buck, didn't work again.",
        "It was better than I expected, but I honestly expected a garbage fire. Definitely has its issues, but I think the supporting actors (Okoye, M'baku, CIA Bilbo Baggins, etc) really carried the day. Shuri had potential, and you see it shine through in a few scenes, but she's not QUITE where she needs to be to lead a film. The less said about Ironheart the better.",
        "I actually quite liked the movie",
        "I know this is controversial take in this comment section, but I loved Black Panther 2. Of course, it was flawed, as all Phase 4 stuff has. Yea it was pretty weird how Shuri fought in normal condition even after getting stabbed through the spine. And sure, Riri could have been more fleshed out, but I still think that this was still a good tribute to Boseman. It wasn’t like they just slapped it in the beginning to reel viewers in and then just rushed out a sloppily made film, albeit with a little unfocused perspective like how the Drinker proclaims. Even if you think that, I would give this movie a pass since they were dealing with the death of the actor of the main character, so it’s good for what they had in their disposal. Even EVEN so, everything I mentioned were either little contrivances or plot holes, at least how I saw it. It didn’t take away from the main theme of loss and how different people deal with it. If you think otherwise, that is a-ok. But, this, in barely any way, did it tarnish the name of Chadwick Boseman and the Black Panther.",
        "In South Africa, We go to the cinema, watch a movie, and go back home and not debate about the Politics and Bs involved in it, You guys just get worked up over a movie is just crazy to me. lmfao",
        "I was in a mood today so i watched 10 critical drinker videos in a row. Now i'm feelin better",
        "If you guys want to see content similiar to this search for a guy called Nakari. His points are not to far from the Drinker but theres normally always something different there, and its enjoyable to watch.",
        "The magical bullshit herb  hahaha omg had me laughing",
        "5:07 You've got some fair points, but...are we going to forget that those spears can shoot lasers and basically their entire armored division of freaking spaceships is MADE of vibranium? The one metal that Tony Stark had to work his a** off just to crack?",
        "",
        "So what you’re saying is that the whole deal with Namor could have been avoided if they just honored their agreements to share vibranium…perfect.",
        "I haven't even watched one of your vids. I subbed cause your channel name made me laugh real hard",
        "i also wanted Angela Bassett to be black panther. no one would have seen that coming",
        "I GOTTA admit that seeing Suri defeat Namor as she was a rookie BP with NO ACTUAL combat experience like her brother who fought Killmonger!both Captain America and Bucky lol and in Infinity War plus Endgame. VS Namor who can  hold his own against the HULK, was like seeing a FIRST YEAR female martial arti student defeat BRUCE LEE in a one on one fight. Made no fucking sense! NEXT RiRi Williams/ Iron Heart will defeat Rodey/ War Machine in a battle. Just because it has to be that way. BS!!",
        "Hey man. You not giving away PS5s are you?",
        "angela basset expelling the general was legitimately the most honest, character driven scene I have ever seen from a marvel movie",
        "How did you ever resist calling 'Ocean Man' 'Mister Nimbus'?",
        "Never had any intention of seeing the film, but I could have sworn the title was \"Wakanda?  Whatever.\". Oops.",
        "What is that ocean man music part from? Its not the Ween song, this one sounds different",
        "I think Disney Entertainment is in serious financial trouble. \n\n\nDisney plans hiring freeze, layoffs and cost cuts, according to a memo from CEO Bob Chapek",
        "Marvel died with Stan Lee.",
        "Unfiltered truth. \nThis is why i tune in regularly. \nThank you sir",
        "shes a genius yet shes 19 and still in college ,,,id expect a genius to be like sheldon and get advanced to college",
        "FINALLY SOMEONE SAYS IT! Riri killed all those cops on the bridge and I thought I was the only one who noticed that and was bothered by it.",
        "The Drinker never disapoints!",
        "If the king is dead, according to the first film, there must be a competition to establish the new king.\nOr can anyone challenge the queen in combat and win the title of ruler of Wakanda?\nI'm really confused right now.",
        "i watched it with the expectation that it'd be some annoying girl power/ politically woke preach, but personally i think it's not as unbearable as falcon and captain marvel (albeit those are quite low standards...)",
        "are we not gonna discuss how namor fought shuri before taking a quick dip in the ocean? i felt like i couldn't take his defeat serious because of the terrible logic of his decision.",
        "1) France was trying to get vibranium through force and not through trade. Of course thats something to get mad about.\n2) I guess you dont like the dudes name or something but thats a bland criticism \n3) Mosquito drone is seen again maybe 10 minutes later in the car chase scene.",
        "I agree with some, but not all analysis from the Drinker here. But if there’s two things that everyone can agree with- all of our jaws dropped when we saw how fit Angela Basset was and commanding her presence is, and that even her or the other two leading women in the film would have been better Black Panthers.",
        "Okoye:  \"I like her!\"\nThor:  \"I like this one.\"\nWithout these queues, I wouldn't be able to figure out that we are supposed to like these characters.",
        "I saw this movie, when my friends asked why I thought of it all I could say was \"remember when Thanos threw a Moon on Iron Man, that was cool\"",
        "Marvel is churning out product at a dizzying rate, most of it of questionable quality. Their public are comic book readers so hey, let’s not make it too complicated just throw a battle scene every five minutes,keeps the explosions and crashes coming and they won’t notice the plot holes. Anything that is completely taken over by bean counters and committees becomes a boring formula.",
        "Saw this yesterday with a mate. At the end we realised that we had both been hoping the other would get up and walk out during the movie because we were both so incredibly bored.",
        "I liked it but it was kinda stupid ngl. The entirety of MCU phase 4 had 2 good movies (No Way Home and Wakanda forever)",
        "You forgot to mention a key part at the end: Fishman smugly tells his mopey lackey that Wakanda will someday come begging them for help. A sentiment echoed at the very beginning when lady panther and Namor first meet to discuss terms of a truce or partnership. Meaning he came to the same conclusion they'd talked briefly about before wasting everyone's time for nearly 3 hours. \"Hey remember at the beginning when I proposed we form an alliance so nobody would fuck with us and you said NO? Neither does anyone else watching or even writing this movie, apparently.\" ",
        "5:16 don't know about that)",
        "The drinker’s reviews are the only thing that puts a smile on face this week",
        "Critical Drinker is a mess. This is one of the stronger movies in phase four, but he CWWWWWWWWWWWWWWWWWWYS just like his right wing base.",
        "I love this movie personally just my opinion",
        "mfw i strawman plotlines to the bare minimum, ignore character dialogue, pretend things that happen don’t happen, literally make things up and go into the movie expecting not to like it and then post my review video to youtube. this video and comment section is just a smoke signal for those who want somewhere to spew racism into the internet and it’s insane how far he has to reach to dismantle a pretty simple movie that was one of the better ones released in the last two years of marvel.",
        "Excited to revisit this video and comment section after a few weeks, when it hits $1B in box office, even without China and Russia markets",
        "The first Black Panther was good when it wasn't being an MCU movie.  It was almost one of those bonkers, Ugandan action movies at some points.  But whenever someone (Feige?) forced it into the mold, it started to suck.",
        "Well Drinker, Namor (\"Ocean-Man\"), Prince of Atlantis was a Marvel/Timely comics character since the Golden Age of Comic Books ('30's-'40's) And was Marvel's Anti-Hero since the Silver Age ('60's, &'70's-?) He predates Aqua-Man by a couple of years. So for the movie Namor was changed from amphibious white-dude to amphibious Mayan/Mesoamerican character; as well as the Atlanteans. And apparently this super-anti-hero has introduced in the sadest/worst way possible.",
        "The best part of the movie for me was the dora milaje theme!!!",
        "I know that a lot of people have been talking about the movie itself, but could somebody please tell me how or where to find that absolute banger of an Ocean man cover at 5:53?",
        "We're at a point where we should see the new marvel films just as an hint to rewatch the old and better versions of it...",
        "Streamed a decent print of it. Way too long. Way too slow. I got a kick out of the fact that MIT student, RiRi, is the smartest person alive but can't structure a basic English sentence.",
        "i did find some scenes clumsily cut together and they really tried to bend the movie into the plot, but maybe the point is to make a film so good people don't notice you're trying to make a film.",
        "Chadwick died wth is this vidoe",
        "They ruined Namor as a character. He's a complex anti-hero in the comics, and he had a great redemption arc. There was a power struggle between  him and Atuma, the actual leader of the Blue Fish People, and a genuine threat who held his own against Thor and Hulk at the same time.",
        "I mean, personally, I also think Wakanda would get owned in a war, but that’s mostly because for example in the MCU America has the likes of Captain Marvel, hulk, Thor etc even Spider-Man could give them trouble",
        "definitely a movie where you have to turn off your brain to enjoy it and from that viewpoint the movie is actually kinda good. if the movie was just simplified and shortened down focusing more on just a territorial battle between wakanda and the ocean people then it would've probably been better.",
        "Not gonna lie when hear ocean man's name I thought he said kotal khan",
        "At this point, I don’t even watch Marvel movies anymore, I just watch Drinker rip them apart.",
        "Love Angela. The fact she's in her 60's is impressive.",
        "I have come to the conclusion that marvel is making movies for under 14s, there is no phase 4 is for real marvel fans.",
        "They agreed to share science and medical knowledge, no vibranium.\nAlso, it was a french female that brought up vibranium security concerns, right before the french mercs were brought in.",
        "There are other actors who would've suited better as Namor as I remembered that edited photo of Luke Evans as Namor back then. But it's post-Endgame marvel so I'm not surprised.",
        "So, this movie has an 84% from critics and a 94% from audiences. Yet \"it's a mess\", because that's what appeals to your \"anti-woke\" audience and gets you clicks and attention. It's too bad you've gone so hard into this. You could produce some good content, if you didn't choose to eschew all reason and appeal to the low-hanging fruit.",
        "I feel like marvel after infinity war doesn't keep up with what they spoil for the next movie. Like Thor working with the guardians only to make it a joke, help people by giving theme vibrant no, morbious trailer not having any of the Spiderman references in it.",
        "Wakanda is in cave for so long, that they Don't know WTF is Atomic Bombs.. or Hydrogen Bombs...",
        "I'm here to hear you say, the message",
        "This Colonizer sounds disgruntled and sad!!!!  Don't be a Pilgrim 2023!!!",
        "paused  at 2:37 : Russel Westbrook????",
        "Idk when Eternals was taken place when T’Challa was dying, but even Sersi could’ve made another herb and boom, T’Challa is saved, or Ajak straight up healing him. Just a thought.️️",
        "U made a lot of valid points but Sha'ri was very relatable if u never lost a loved one then lost the closest one to u. Then u're mother. From beginning to end she's mourning and going thru the stages of grief. Namor is a dictating underwater god... He wouldn't have much personality besides being in charge his whole life. It could've been better but it was the good for not having Chadwick",
        "I thought it was really strange that Wakanda failed to honor T’Challa’s promise to the world to share Vibranium. ",
        "Should've recast. My vote is for Ryan Gosling - great actor who would've really tapped into the spirit of the character.",
        "Seriously, EVERYTHING that Drinker has said about this movie is CORRECT!!!",
        "Mate, you need to sell a t-shirt that says, \"The drinker has jurisdiction wherever the drinker finds himself to be.\"",
        "They seem to absolutely refuse to give this current crop of heroes moments of personal vulnerability. To me, they feel distant and unrelatable.",
        "TV dinners were invented because they had to find a way to convince people to eat all the leftover war rations that were lying around. The current Marvel phase feels like that.",
        "I had no interest in seeing Woke-anda Forever, and your review just confirmed all the reasons I don’t want to see it.",
        "Namor was great. The structure and build up of characters were great too. And that's pretty much all there is to this film. They should have just called it. Wakanda Forever.",
        "But that was Kilmonger's criticism of wakanda too. That they were essentially selfish.",
        "Did anyone else think it would’ve been cool if Marvel had kinda gone back to the basics and put Shuri on a kind of spirit quest? Maybe resurrect Killmonger from the ancestral plane as a spirit guide character, guiding her out of her grief and awkward humor and turning her into a wiser more serious Queen? This could be done while the political conflict unfolds as an alliance of African nations, embittered by Wakanda’s broken promises and emboldened by the sense that with the King’s death that Wakanda may be weak enough to invade / strong arm? In the end Shuri returns just in time to help her mother and to become the leader Wakanda needs in that hour.",
        "what is that version of ocean man?",
        "Don’t care, still a good movie :)",
        "Can you review Grimcutty (2022)? I'd be interested to hear The Drinker's take on it. Just watched it and was desperately hoping you had a video on it.",
        "Ehhh... the movie wasn't that good.  So the box office reflects that.  Also, many fans aren't buying subbing a woman in as the Black Panther.  Just ask yourself... would Marvel substitute in a man, into the \"Storm\" character role?  I think not.",
        "I was absolutely disgusted by this movie and all its aspects, and chief among them was the vile moral decisions that are played off like no big deal.  Queen Ramonda takes a massive shit all over everything her son did during his rule and gets mad when anybody questions her decisions, which appear to be made purely based on emotion rather than what's actually best for her country.  Shuri is a selfish, narcissistic psychopath who publicly spits directly in the face of all of both Wakanda's and her family's most sacred traditions whenever she can.  She usurps the mantle of the Black Panther, Wakanda's noble ancestral protector, without having ever done anything to demonstrate a worthiness or qualification for the position, and as previously stated, disgraces the rituals involved in taking up the role.  Then, once she was finished naming herself Black Panther, she dons the armor of Killmonger, another usurper with no respect for the traditions of his homeland, and proceeds to bully her advisors into pledging their warriors to her crusade for revenge, unilaterally deciding to take her country to war for her own personal reasons, a decision which saw dozens killed needlessly and for which she received no consequences or reprimand.",
        "Totally disagree, The sold out theater where I was all clapped & applauded after the film, and I'm usually a hard critic wasnt even expecting to like the film because of Chadwicks passing, you seem like you're in your feelings beyond the movie ",
        "Looks like an absolutely ridiculous movie. Hard pass.",
        "Lately these new marvel movies and shows have alot of feminism in them and i think its just proof they cant do it any better lol",
        "Marvel have shat the bed with the MCU now. It maybe should have ended with Endgame, rather than trudging on relentlessly with a constant drop in quality...kinda like Star Wars, Star Trek, Jurassic Park. I see a pattern...",
        "“My enemies call me — Namor.”\n\n“NAW fuck that! I’m calling you Ocean Man from now on, mate.”",
        "Disney lied about black panther being the first black superhero on the big screen.  Wasn't even the first black marvel superhero in a big movie franchise, either (Blade).\nBut now they are done lying (just kidding, no they aren't), but decided they actually hate black men, so they have already replaced that one.",
        "It's also weird how Wakanda was perfectly capable of fending off an extremely advanced space-faring civilization in Endgame, and then Namor is able to walk in and out of the city completely undetected TWICE.",
        "You know a movie is bad when you can't even finish listening to The Drinker tear it to pieces.  It's like \"Stop, stop! She's already dead!!!\"",
        "Oh come on, your telling me that Wakanda Forever was bad too? Like when I first saw I thought it was somewhat enjoyable I mean sure it wasn’t as good as the first movie, but at least it was a lot better then crap like She-Hulk and Thor love and thunder.",
        "So an Army of black African warriors are going to fight an army of ocean dwelling warriors...in the ocean?...an army of black Africans...in the ocean?...yeeeeaaah not hard to imagine how that would probably go lol",
        "The funniest part for me was during the last battle with Shuri, Namor actually said, \"I need some water\"  ",
        "Thanks for saving me some money.",
        "Killing off T'Challa was an unfortunate necessity, given the real world circumstances, but giving him a disease and killing him off screen is just unforgivable... Well acted as the scene was; T'Challa, and Chadwick for that matter, was a fighter... He should have gone down battling some ominous foe, some overpowered super boss that, despite the King giving it the fight of it's life, takes down the hero of Wakanda... Then Shuri could have worked to recreate the magical bullshit flower and learn to hone her skills and get revenge for her nation, for her people, for her family... Instead, we got this",
        "Breath dude...",
        "Don’t forget this is all started because of a stupid school project",
        "I liked it",
        "1. You just describe the plot of black panther. \n2. Stop pretending that black panther wasn’t also a piece of garbage.",
        "Y'all are looking too deep into it, things don't have to be overly complicated to be enjoyable",
        "The Ocean Man interlude is one of the best things Drinker has ever done.",
        "\"Wakanda Forever\" directed by Michael Cimino",
        "....Sneakahs.  My eyes can't roll any harder in the back of my head.",
        "I could also point out that Namor looks absolutely NOTHING like how he was portrayed in the comics, except for the pointy ears and winged feet...\nMan, I freakin' LOVE your reviews! Just the right mix of the hard stuff with the right chaser to really make it go down smooth! Keep up the good work! ... Go away now.  ",
        "thanks, I will not see this film.",
        "Nice of you to leave out what this Movie was realy about \nI reather watch a Movie like thise wher to Fokus is on Charachers insted of the next fucking Skybeam",
        "Another marvel disaster.  Having Suri shoehorned as the interim panther was a fail. What was even the point of having Riri? Namor was a waste of a villain. I’d still forgive it if the movie wasn’t so long, draggy and pointless.",
        "16:40 - I agree with your comments on Angela Bassett. She's amazing.",
        "The worst part about refusing to watch Disney creations is missing out on drinker context.",
        "Despite what the drinker says, is a good movie. Is it a masterpiece? No, but no MCU movie is. The themes are grief, loss and protecting what you love. Just watch the movie yourself. Is it the sequel we hoped for if Chadwick Boseman was still alive? No, probably not. But it's a good story while they decide who the next black Panther will be.",
        "Recast Black Panther : John David Washington or David Oyetokunbo Oyelowo or Sope Dirisu from gangs of London. Black Panther 2 was underwhelming. I thought Ocean Man was cool. However i wont be re-watching it. I tried to watch Thor 4 again, when the goats started screaming to turned it OFF !",
        "Namor turned a blind eye when half his population disappeared ",
        "I remember them trying to advertise this by the cast saying The new black Panther isn’t who you think. Then it was who we thought",
        "that’s funny, didn’t drinker tear black panther apart as pure trash when it came out? going woke aye",
        "so, that skinny bi-sexual king of the ocean from rick&morty is in BlackPather2?",
        "I love that the MCU is now a multiverse, because in my universe, the MCU ended with a snap.",
        "I thought it was funny as hell how quickly they ascended to the surface while rescuing Shuri- I guess plot armor can even make people immune to decompression, who knew?",
        "\"It's ok when we do it\" - MCU writers",
        "to be fair the whole 'drying him out' thing wasnt the worst plan weve seen so far in MCU. i mean its not a 'oh we need this one magic/techno device to kill him for good' trope thing. but its also not as bad as your whole plan hinging on the bad guy taking a nap when u tell him to then taking his super weapon away....like, in context its not awful but i get it",
        "I disagree, hater.",
        "A cuku can? He didn’t sound very sure how to say it \nWtf is Nàmor",
        "The writers should have entered a few screenplay writing contests first so the movie would never be made to waste people's time at the theatre. F*ck.",
        "Gay black woman in this movie. WOW  I guess",
        "I was so happy when Dreyfus first appeared but Jesus can we just get Dark Avengers already? No way can it live up to the hype, it's literally just Avengers but evil and we have like no interesting Avengers at this point. Everything in this phase is so dragged out, in the cartoon series Dark Avengers gets two episodes, in MCU it's been like 3 years.",
        "I can't believe a 60 pound girl beat 200 pound men in a fight, no matter how strong she is, physics has its limits. Takes me out of the movie in every fight scene.",
        "The movie had flaws but it’s was still good overall",
        "Today my girlfriend told me she had just watched this movie.  I asked her what she thought of it.  She gave me The Drinker's advise in about ten seconds.  \"The movie was about two and a half hours too long.\"",
        "I have to agree the writing was shit but I didn't feel the 3hrs at all, humour is subjective so I understand,it worked for me and the interactions between the characters felt genuine and real. 7/10",
        "Shuri gets struck with a spear through her spine? No problem. The writers don't know what a spine is since they don't have any backbone. The story really reflects the world THEY live in today.",
        "shuri and the queen are the dumbest and most irritating characters in the movie",
        "2 hours 2 long",
        "It was on TV for free and I still didn't watch it the 1st movie I will never see the 1st or 2nd in my whole life.",
        "hey i like ur critics of movies super cool..but stop using the name of jesus in vain his real bro thanks.",
        "This is exactly why I've watched reviews of many MCU films after Endgame but watched only 1 movie:  Spider-Man: No Way Home. If the Drinker finds a gem in the projectile vomit spewing forth from Disney, then I'll watch it. Until then, I'll just enjoy his savage reviews.",
        "There were so many poorly written scenes in the movie that just didn't make sense. When we first see the fish people attacking the Navy Seals, at one point a helicopter is trying to fly away, but then the pilot says \"We're being pulled in!\" Then the helicopter spins out of control and crashes and you can see someone flying in the sky above them. What pulled them in?! This is never explained and Namor doesn't have telepathic powers or anything. Also when Shuri escapes and goes back to Wakanda, there's only a brief moment where she says \"I'm going to elevate the defenses\" but there actually IS NO DEFENSE AT ALL and Wakanda gets destroyed so easily by Namor's small troops. WHERE WERE ALL THE SOLDIERS? NO GUARDS TO PROTECT THE QUEEN AT ALL?! Wakanda is suppose to be THE MOST POWERFUL NATION IN THE WORLD and you're telling me they didn't even have a military to defend themselves? THIS IS THE SAME NATION THAT STOOD TOE TO TOE WITH THANOS'S ARMY! And then the fish people - sometimes they're blue, sometimes they have normal skin?! The movie never explained why that is - did they just forget to paint some people blue?! Makes no sense!!!",
        "Black Adam > Wakanda Forever.  Black Adam isn't Shakespeare, but it's just better than Marvel.",
        "Just finished watching WF, 3 hours. It had its moments but I found myself constantly looking at my watch cause it had quite a number of long drawn out scenes.",
        "The movie continuing to push ton of social and political ideals just made it feels way to long",
        "watching Critical Drinker to start off the week with great banter is a perfect W, glad to see he is not sugarcoating opinions",
        "The whole infinity battle was fought in wakanda no1 went to wakandas aid bro you didn't even watch it usually you're on point but hell you aren't hitting anything I'll catch you on the next video",
        "It's honestly exhausting having to see people praise anything Black Panther related no matter the quality. It feels wrong to have to deal with subpar media being praised because of what group it's appealing to instead of its merit, I really wish that they could have made Black Panther but it was fantastic and it got attention for being an amazing piece of media showcasing underrepresented people rather than a meh piece of media showcasing underrepresented people.",
        "I Won’t Tell Why But Wakanda Was Redeemed.  Just Glad I Saw It As A Double Feature.  So Good To See Chadswick Again.",
        "The queen is in great shape, I need to get back to the gym ",
        "Thate was a great tpb copy 3 hr after it was out ",
        "I enjoyed the movie and all my friends did (5/5)",
        "This is disrespectful to Chadwick... he gave his heart and soul to the character… while not the best solo movie… his character was truly awesome and inspiring in the war against Thanos...",
        "I’ve seen so much praise from basically everyone, so I almost decided to watch it. But then you uploaded this video, so thank you for saving my time.",
        "When writers and directors are hired based on their social media viewpoints rather than their actual talent, is why we have movies like this.",
        "\"It's ok when we do it\" is literally the United States in REAL LIFE. I think that logic in a MOVIE gets a pass.",
        "Wow you Ethered (that’s Black slang for “you destroyed it) the shit out of this movie. Well done my friend. I was thinking the same thing. I get why you didn’t go all the way in on the social engineering and virtue signaling of this film - ultra feminism, emasculating Black men, the two lesbian characters (was it necessary), the way they made up the connection between the Blue sea people and the Mayans ( that’s not part of the original comic story). This film was horrible in so many ways. My 9 year old son was devastated by how corny this movie is and he loves the MCU. Disney is desperate because they’re going out of business and they thought they could finesse their audience with this BS.",
        "Does make me wonder...What kind of movie would have been made If Chadwick hadn't died? He likely would have been relegated to a supporting role to bolster woke garbage...but hey, at least Wakanda would have had another guy in it.",
        "Aight, your title screams clickbait. But, I'd figure Id see why you say this.  But, saying Namor was boring and forgettable MCU villian, by MCU standards, makes you lose all damn credibility",
        "I'm almost certain this storyline had to be written by a liberal woman. Logic & reason who needs that",
        "While these critical reviews are funny, I actually liked the movie. I think it's one of the better Marvel movies of this phase and the whole series.",
        "I didn't see the ocean man as a villan,  because his motives are more resaonable than the wankandans. Save one person from death by sacrificing hundres of lives... Really? That remindme of Tywin Lannister when he said: \"Tell me how is more honorable killing thousands in battle than killing a few in dinner?\"",
        "I wish it would be good but it's crap",
        "The only movie to make me fall asleep in theaters",
        "His point on ‘Its ok when we do it’ is actually straight facts. They went completely against what they said towards the end of the first film.",
        "Imagine if you took the purple  juice & the super soldier serum & your suit and claws are made from a mix of vibranium and adamantium & you give it to someone like spiderman, dr strange, black widow or antman, even iron man if he wasn't dead to wear under an iron suit MK65  falcon would actually be worthy of the captain america mantle, peter quill",
        "By the third hour of the movie, I constantly kept looking at my phone to check the time. Even with flashy action scenes and emotional ones, I just wanted out. At the point where Namor attacks Wakanda, I thought that was it: the classic big final fight. But no, it just kept going and going. It could've been a 2 hour movie easily if they had rewritten the script.",
        "Yeah that whole idea of Namor needing Wakanda to help him track down and kill a scientist made zero sense to me. I really didn't understand his whole motivation in this movie. And I agree that the pacing is horrendous in this movie. Ross didn't even need to be in this movie at all, he had no real purpose. Riri barely had a purpose. They clearly had no idea what to do with this movie and should have just done nothing smh",
        "Mess is a understatement",
        "Dear critical drinker, I think you're really mourning the downfall of marvel and can't just believe another movie can be good. I thought Wakanda forever was very enjoyable. The script was already done but when Chadwick died, they had to improvise.\nThe action sequences were 9 of 10 and it was almost prefect. Although the pacing was obviously quite an issue but come on it was a mourning movie didn't you feel anything?",
        "I went with my father and my two brothers to watch this (we went to the cinema since iron man watching the MCU). My father slept through more than half of the film",
        "Has anyone else noticed that whenever a new female character is shoehorned into a story, the writers put a lampshade over it by having another established character say \"I like her.\" They use this exact same ploy every. Single. Time.",
        "The bias is prosperous.",
        "Very bad movie even my kids did not like it",
        "Despite being someone who really liked Riri in this film, I do agree with your point that her role in this film is primarily setup for future MCU projects.\n\nLike you could tell me that Shuri developed the vibranium detector for Wakanda, in the original script, and I would’ve totally bought that.",
        "I enjoyed it.  I went in there, after watching your review, expecting to hate it - but I really liked it, even better than the first one.  Oh well!",
        "wokeanda forever",
        "They should’ve made it with an all white cast so I can relate better. #thelittlemermaid",
        "Batman is still more cool than Pantherman..!",
        "Damn. They had such a GOOD start! How tf did they fumble it that hard????",
        "When Pixar was good, they had a sign in one of the hallways that read, \"Story is King.\" Pixar seems to have forgotten that, and many studios never learned it.",
        "At this point I don't think Disney marvel can withstand too many more \"cultural events\".",
        "Nobody has a problem with Peter Parker dumpster diving tho",
        "You can call me nanour\n nah gay fish",
        "The whole unrealistic supergenius female scientist trope is tired. The 'we need more women in STEM' nonsense is tiresome. There are hardly any women in rubbish collection and sewer work, we should have female Marvel characters that are really competent at collecting rubbish and cleaning sewers to promote more women in those jobs.",
        "Weapon injuries back then: lightsabers, gunshots, and spears are lethal if not paralyzing \nWeapon injuries now: \"tis but a scratch\"",
        "Even if Chadwick didn't die,  it still wouldn't explain all the plot questions.",
        "This movie is what you get when Chadwick isn't there to say \"We don't do that here\"",
        "The number of time Chadwick Boseman has thrown the spear in this video is mind blowing",
        "Namor: I need to kill this little 19 year old Genius\n\nShuri: I cannot let you do that.",
        "The antagonist isn’t like Aquaman, he’s completely different, he only lives underwater and is named Hydroboy. Completely different.\n\nI wouldn’t even pirate MCU content, it’s not worth committing bandwidth to it. THIS is how you stop piracy, release the worst things possible.",
        "Who is really really watching this action graphics video game movie.  Hollywood magic wand  at its finest and meaningless.  Lol.",
        "Not a mess, a failure  and possibly the  death of the  franchise."
    ],
    "comments_disabled": false
}