{"video_id": "9XscvqG3CCU", "comments": ["Their plan of fighting people who live in the ocean and thrive in the ocean…. In the middle of the ocean had to have been the worse battle plan ever ", "\"It's okay when we do it.\" \"The situation is nuanced and complex when we make mistakes.\" \"There's historical reasoning that pardons our bad actions.\" - wakanda", "I've had enough of seeing a hero ran through with a spear or sword only to see them fighting minutes later.  It's like the writers don't understand that THE SPINE exists.", "I feel if we wanted to introduce Riri, they could’ve had her working in her basement or bedroom, not making time for family or anything else, always distracted by her work, only to hear a news broadcast of Tony Stark’s death, being the one thing that snatches her attention away from her creations. Then she could look at a picture of her getting an award, presented by Tony, starting her motivation to be as smart and as successful as him, as he inspired her way back when, making it more emotional when she dusts off a childlike drawing of her own iron man suit. Boom, introduction done and she’s already more of a character than the original.", "I thought it was really strange that Wakanda failed to honor T’Challa’s promise to the world to share Vibranium. ", "As someone who's worked in the filmmaking industry for too many years, in VFX/Post, it's always amazing to me that anything cohesive from Marvel even makes it to final edit.  All of these big budget high profile FX heavy movies are written by one committee, designed by a 2nd committee, directed by a 3rd committee, edited by a 4th committee, then distributed/marketed by yet another committee.  Each of whom have their own separate agendas and ideas, and barely communicate with each other.  Not to mention the teams of lawyers, 200 layers of approval on every little thing, and some clueless studio head randomly coming in at the last minute to play \"Director\" and demand changes!", "\"The Drinker has jurisdiction wherever the Drinker finds himself to be\" just has to become another classic line you use every few videos or so", "\"Don't think about it, just consume the product.\" \nThis perfectly zooms up the way movies have been feeling like these last couple years.", "He really sacrificed his friends for a refrigerator. I respect it.", "Also I wholeheartedly appreciate your admiration of Angela Basset’s figure, I swear she’s actually her Marie Laveaux character from AHS coven - she DOES NOT age", "“Makes a garden rack look morbidly obese” absolute classic had me in stitches.", "the line about the 2 yr old weapons designers was just so well executed and absolutely brilliant xD", "\"It's okay when we do it.\"\n\"The situation is nuanced and complex when we make mistakes.\"\n\"There's historical reasoning that pardons our bad actions.\"", "Batman Forever had a brutal pacing problem. Makes me wonder if the word \"Forever\" in a movie title is a warning for how long its going to take for the plot to become interesti", "16:34 Angela Basset really did carry the movie almost singlehandedly. She really does radiate authority and power. Saying that she \"commands attention\" was absolutely spot-on, especially during the scene where she strips Okoye of her title after finding out Shuri had been taken under her watch... Angela's performance in that scene was incredible and I believed every second of it... probably why I was so pissed off when she died. The movie lost one of its most interesting characters.", "I remember when everyone was talking about Shuri being smarter than Tony Stark, yet Tony has created Jarvis, and solved the Arc Reactor issue, he even created a new element to prevent his own illness/exposure to the radiation of said Arc Reactor. Shuri couldn't figure out how to save T'challa. What a bad take", "The amount of time Chadwick Boseman has thrown the spear in this video is mind blowing", "Riri Williams is like a parody but her creators are dead serious.", "Marvel: \"Don't ask questions, just consume product.\"", "Seeing how T'Chala's ex was the one to push him  into opening up Wakanda you would think that SHE is best suited to carrying on his legacy. As well as being the head warrior for another tribe (shown in the first movie, during the king-making ceremony), so it's not like she would be chosen haphazardly.\nInstead they shoe-horn in the genius kid sister with zero combat experience who already has an important, non-combatant role based on the previous movies. ", "Wtf, the level of artistic freedom they took with Namor is fucking hilarious ", "Namor: I want the scientist and kill her\nShuri: We can't let you kill her\nNamor: Actually, never mind, let's kill everyone on surface\nThat escalated quickly", "Just make Winston Duke (M'baku) the new Panther Man. He's extremely likable. He could grow from the guy who lost the fight to the original Panther Person, because he was too angry or didn't have the right mind set. He could be the new Panther Guy after some personal growth.", "I think this movie put the actor to rest in the right way, yes this unfortunate turn of events that happen to the actor is indeed sad but we can't just brush over how many ppl he inspired as the first black main superhero character, the movie told us even though our king is dead does not mean that our country is unprotected, the other tribes agreed that the OUTSIDE world is what's important, Namur (I think) was like tchalla wanting to protect his home at any cost (him attacking the whole world is crazy tho) over all 10/10", "When Ironheart was flying in her suit in this movie I couldn’t stop dying laughing of how bad her suit is lmao it looks like a Power Ranger.", "I don't know if this has been commented before... But: I felt like Ramona was the main antagonist in this movie, and Shuri and Namor got caught in the crossfire. Namor tried the more peaceful way towards Wakanda and Ramonda said basically \"fuck that\" which I totally understand. That being said, I understand where Namor was coming from and was actually rooting for him in the movie. But as  I was watching a Black Panther movie, I knew deep in my subconsious that Shuri would win in the end.", "Despite being someone who really liked Riri in this film, I do agree with your point that her role in this film is primarily setup for future MCU projects.\n\nLike you could tell me that Shuri developed the vibranium detector for Wakanda, in the original script, and I would’ve totally bought that.", "honestly this is christopher reed all over again, a young intencly talented actor taken far before his damn time!", "You know the Drinker is a man of culture when even he admires how in shape Angela Bassett is for her age.", "He forgot to mention the after credit scene with ocean man, were he basically tells that despite his initial plan failing he still successfully alienated and isolated Wakanda from the rest of the world. That scene makes it very clear that all the flaws about Wakanda in this movie were put there deliberately and they they now come back to bite them in the ass.", "They put Riri in for the sole purpose of tying the incoming \"Armor Wars\" series to the movie and overall MCU. I legit am more interested in the Thunderbolts than in the new Avengers they're gonna bring in. Also: When are they going to start working in the Secret Invasion plot?", "Today my girlfriend told me she had just watched this movie.  I asked her what she thought of it.  She gave me The Drinker's advise in about ten seconds.  \"The movie was about two and a half hours too long.\"", "Something that just really baffled me was how the Black Panther suit, which was essentially a suit of vibranium armor that could withstand the swipes of claws made of the same material and was only compromised through destabilising it, was pierced through with a spear with minimum effort\nI liked it more than most of phase 4 MCU, but there is no denying that it still has a lot of flaws to work over before being really great. Not least of which was the process of heavily rewriting and rushing the script after Chadwick Boseman's sudden passing", "80% of the reason I loved the first Black Panther was because of T’challa. I was lukewarm to him in Civil War, but he really shined in Black Panther. Having a marvel protagonist who was dignified and kingly was sooo refreshing. Rip Chadwick Boseman.", "At this point I don't think Disney marvel can withstand too many more \"cultural events\".", "Namor's people actually started out green skinned in the comics & later on blue skinned when he was rediscovered by the Fantastic Four. These stories pre-date James Cameron's Avatar by 3 decades.", "I agree with everything you said about Chad incredible actor incredible person there are far too few people like him in the world.", "Angela Basset looks phenomenal in this movie. Timeless beauty.", "I remember them trying to advertise this by the cast saying The new black Panther isn’t who you think. Then it was who we thought", "Good review. I think the movie is mix of different ideas that on their own, would not make a movie. I don't really understand the thought process of the script, but again missing your main character , possibly having a script ready and having to redo it cost a lot to amend. Overall, I still think it still has some redeeming qualities. One negative: the movie filters they used, it made the movie too dark and I could not tell what was going on.", "When writers and directors are hired based on their social media viewpoints rather than their actual talent, is why we have movies like this.", "Its funny you would mention SheHulk at the end because when you said you couldn't wait to see the super hero creating surgical instruments in the womb; I was picturing the She Hulk writers furiously writing notes.", "Speaking of the video you made a while back where you said the Koreans are coming on strong in their productions, I've started watching a drama series called Extraordinary Attorney Woo, about an autistic girl that is an attorney, and the problems she faces in life. It's pretty much everything the train wreck of a show SheHulk tried to be, except the green monster.It's worth a watch, since the characters are deep, flawed and have their own motivations and goals in life. And it's fun, cute and serious.", "“She makes a rake looks morbidly obese” they should hire you to write the jokes lmao", "Point of correction Sir Drinker: the mosquito actually does come back in the scene preceding the chase through Cambridge Massachusetts. Shuri lets it out, and it flies and lands on the top of one of their Jeeps assuming control as in the first movie.", "Losing Chadwick was such a terrible loss. \n\nHe was such a light of talent. And knowing how hard he worked on the first Black Panther despite probably being in so much pain due to his illness.", "We're also overlooking WHY the F did his mom inherit the kingdom? The first movie made it pretty darn clear that you had to fight to become the Wakanda ruler. Shit they even did it twice. Yet when he dies all the other men who have tried to claim the throne before just said NAhhhh she'll do fine.", "I agree with all that you said about Wakanda. Something told me not to waste my time and money but I wanted to see it just to say I saw it;. I also wanted to see how they handled Chad's death. Someone should have spent way more time on writing the film. They could have left the funeral scenes and the last scene about the nephew but that Aqua man that had wings on his feet like the god Mercury was a complete joke including the balance of the film. He could have had a nicer body too.", "Dude, how can you be surprised by Bassett's muscularity? Did you not see that best-of-bunch cyberpunk flick called Strange Days?! OMG, no? It is awesome! Seriously one of my fave movies evah. And topical after the 2020 summer of Floyd more than ever.", "I’ve saw it and yeah it has issues but for what it’s worth. It was probably one of the better things in this phase.", "Drinker, I’d love to see how you rank all the MCU projects up to this point, or even a top 10", "Very useful tips, thank you! Yup, it's an incredibly good feeling to have clear skin and having no more pain. If there were an overnight cure it would be amazing. But it does take 3 days or so, or at least that's one way I found by go'ogling Kaena Ramingler's latest stuff.", "My main problem with namor was that they never said he was objectively wrong. Like they tried to show him as a bit sympathetic instead of ya know a guy planning to commit unprovoked genocide.", "Funny how accurately this describes my opinion of the first Black Panther as well.", "Absolute spot-on review in every way. Cheers from Oz.", "\"She makes a garden rake look obese.\"\n\n You made me wake the baby.", "My thoughts were exactly the same. Beginning and End? Beautiful. The middle so essentially the story was vague and I did feel every minute of it, like I was getting uncomfortable because I was sitting for so long and watching nothing happen. RiRi Williams shouldn't have been in the story, the character doesn't fit or make sense. All of your corrections for the movie are totally on point.", "My favorite part of the movie is when I refused to buy a ticket. I made the right choice, I think.", "Has anyone else noticed that whenever a new female character is shoehorned into a story, the writers put a lampshade over it by having another established character say \"I like her.\" They use this exact same ploy every. Single. Time.", "It was better than I expected, but I honestly expected a garbage fire. Definitely has its issues, but I think the supporting actors (Okoye, M'baku, CIA Bilbo Baggins, etc) really carried the day. Shuri had potential, and you see it shine through in a few scenes, but she's not QUITE where she needs to be to lead a film. The less said about Ironheart the better.", "I would love to see this one as a real Death Battle. It would just look amazing visually, if nothing else", "I hope they keep going in this direction. Let them reap what they sew and keep losing money from failure after failure", "Nice to see the Drinker and PJW both using each others signature catch phrases ", "One of the issues that I have with the MCU is the following:\nIf everyone can become a hulk (smart hulk) with a blood transfusion from Bruce Banner, everyone can pilot an iron man suit, everyone can become black Panter with some herbs etc. etc., why not just creating few tens of thousands of super-hulk soldiers with an iron man suit and the agility of black Panter? Just in case another intergalactic threat comes along.", "Congrats on the kickstarter, I can't way to see if the drinker recommends it when its out!", "Let’s not forget the after credit scene, was literally the last 30 seconds of the movie. ", "Man! Angela Bassett as Black Panther, I'd buy that ticket!", "Wait! So this wasn't a modern art masterpiece in the making? Who knew!", "I miss Boseman", "If the king is dead, according to the first film, there must be a competition to establish the new king.\nOr can anyone challenge the queen in combat and win the title of ruler of Wakanda?\nI'm really confused right now.", "Thank you for the smiles and laughs. I had a shitty day, and this made it better.", "I was in a mood today so i watched 10 critical drinker videos in a row. Now i'm feelin better", "Can you review Grimcutty (2022)? I'd be interested to hear The Drinker's take on it. Just watched it and was desperately hoping you had a video on it.", "Thank you for once again saving me from a disappointing trip to the cinema", "Namor: my enemies call me....\nEnemy: is fishboy okay?", "I love that the MCU is now a multiverse, because in my universe, the MCU ended with a snap.", "Great video. Got this vibe about the movie just by seeing a clip of the cast at a red carpet.", "Shuri: wait if I combine my brother’s dna with manor’s bracelet I can 3D print new herbs \n\nBakkus: wait wasn’t I in it and advise you guys take the herbs, you guys know I exist right?", "Another great review. This is as close as I plan to get to Disney Marvel.", "The best part of current the Marvel universe... these reviews!\nYour sultry Scottish tones enhance the flogging these movies deserve!", "Thank you for this. I just wanted ONE honest review.", "Namor casually giving Shuri a water suit of someone he probably killed painfully and removed their body from was pretty morbidly funny", "Oh, getting to skip a slog fest of a movie, but be entertained by The Drinker instead is tight!", "8:10 Wasn't the mosquito drone seen again during the attack on Riri's warehouse? It was a tracking shot of the mosquito, it sticks to the armored truck to hack it or something. Forgot what happened exactly after that", "I took it as a marvel movie, nothing more at this point. It was enough to enjoy, the whole family enjoyed it lol", "Namor: I need to kill this little 19 year old Genius\n\nShuri: I cannot let you do that.", "It seems like they wrote a script, put all the stuff they wanted into it and right as they were turning it in they were like, \"Oh shit! We forgot to put a villain in!\" And quickly crammed him into the story.", "I used to watch The Critical Drinker so I could avoid bad movies. Now I watch it just for fun because there's no such thing like a good movie anymore.", "Me and my wife went to see this movie 3 days ago. Upon exiting the cinema I turn to my wife, thinking to discuss the movie with her. I tried to engage my brain before opening my mouth (a sound habit of mine … one of many). But BIG problem : my brain wouldn’t engage …. flap, flap, flap, flap …. all I could envisage were these tiny wings attached to the blue guys ankles … flap, flap, flap, flap. All critical thinking was impossible … actually any thinking at all was impossible … flap, flap, flap, flap. ", "Hey Drinker! Finally there's a series that critiques EVERYTHING we despise about modern Hollywood trends. It's called BORIS 4, an italian series available on Disney+ (how ironic). \nPast seasons were about critiquing the italian fiction/cinema industry but the 4th is definitely what we needed! Try give it a shot! Pun intended.", "Basically, Disney was left with a pile of random script pages left over from several aborted drafts and hastily bound them together to make this.  I think the Dave Cullen Show had a good idea to deal with T'Challa's demise but of course the MCU would have none of it.", "\"It's ok when we do it\" - MCU writers", "My big issue with the modern crop of woke characters is that the writers seem compelled to always present them as competent and flawless paragons of virtue instantly loved and accepted by thier peers and legacy characters. Queen Romunda should've been absolutely grief stricken even to the point of descending into madness at the loss of her son. Instead of instantly accepting Shuri as the Black Panther, M'Baku should've challenged her and lost, so Shuri earns his respect instead instantly giving it on sight of a 90lb who he already knows wasn't raised as a warrior. Same thing with the SW sequels. Having to survive on a desolate planet by herself, Rey should've been more of a scrappy and untrustworthy thief that eventually becomes a good person. The presentation is the issue.", "Namor’s name is now short for “El Niño sin Amor,” or “The Child Without Love.”\n\nThis is because a Spanish enemy called him that.  Imagine an alternate timeline where the Spaniard called him “Hijo de Puta” instead.", "I'd completely forgotten the name of the CIA guy in the first film, so when you said \"Bilbo\" I thought \"Bilbo Baggins of the Shire\" from the Hobbit. Nothing would surprise me at this point, though that would be quite a crossover. (suddenly I was hearing Leonard Nimoy's singing about Bilbo Baggins popped into my head...)", "This is one of those movies I still enjoyed regardless of the issues. I noticed almost all of the things the drinker mentioned but I was finding that they didn't bother me because I genuinely was having a good time. It's one of those movies where I am actually able to shut off my brain and enjoy. Still love the drinker always but this was the first time I've really liked a movie he's torn apart this badly lol.", "\"You have to wonder how many more ancient previously unknown factions, cultures, and nations are going to come out of the woodwork in this franchise\"\n\nAnt man quantumania: *nervous sweating*", "9:02 Actually, they used the mosquito drone in the chase scene with RiRi. It transformed the cars and helped hold off the FBI", "“Characters swapped around at the eleventh hour”…yeah, Chadwick told no one he was dying.", "It's also weird how Wakanda was perfectly capable of fending off an extremely advanced space-faring civilization in Endgame, and then Namor is able to walk in and out of the city completely undetected TWICE."]}