{"video_id": "9YdgldMKGGU", "comments": ["I still bump Young Dolph no matter what, that voice can never be replicated ", "God knows this time of the year is the hardest , Dolph was ahead of his time and was an inspiration to millions even after a year , LongLiveFlippa ", "Dolph was on another level.   He was a introvert, who loved his family. Didn’t really care about the money and fame. Gave back to his community, kept his head down and kept grinding.  We all miss you flippa! Especially us folks in Tennessee.", "Man, it’s crazy to think bout someone constantly having not ever met them. Dolph you’ve continued to motivate and inspire me to do great things. RIP Dolph $Foreva PRE$", "Young dolph is in my top 5. He’s one of the most motivational rappers ever to me. I’m so sad that he is no longer here and making music or able to be a dad . I listen to him every single day. ", "The motion capture alone in this game is crazy, seeing the emotions on character's faces so clearly really adds to the immersion in the game. A masterpiece of a game.", "It’ll never be another Dolph #PRE ", "Crazy even after his death, we still waiting on his next album ", "Been bumpin Dolph music from the beginning, he inspired me to go get my money and now I'm stacking up bands thank you Adolph for all the great music you are never forgotten.", "Man, if this song doesn't affirm to all of us true Hip Hop fans that R.I.P. Young Dolph was & will always be regarded as a special & great emcee then you are life less while his spirit is flipping through frequency waves & touching the the ears & hearts of music fans like a dolphin in the open sea. Thanks to K.O.M. Dolph, his family & P.R.E. for sharing this elite man with all of us.", "RIP Young Dolph. A year later. One of the realest in this generation to do it. Much love & light to his family & community.", "YOU KNOW HE HARD WHEN YOU BOPPING YOUR HEAD SOON AS THE BEAT & HIS VOICE COME ON BEFORE THE WORDS COME ", "WHO'S WITH DOLPH EVERYDAY?! LEGENDS NEVER DIE", "His lyrics in this song came straight from his soul ", "Apreciem meus amigos ", "The lyrics in this song gave me chills… like he knew his time was coming", "This man still dropping bangers  rest up dolph   ", "\"A message to future generations\" \n\n\n- Don't let this masterpiece die", "Got goosebumps when I heard his voice.   No one will ever compare to Dolph ", "from the grave, I felt this one But one thing I really appreciate is his sacrifice for his family in his music and his hustle", "ALLLLL TIME GOAT !!! KING OF MEMPHIS!! KING OF RAP!!! ALWAYS NUMBER 1 ON MY PLAYLIST!!! RIP KING ", "Bumped this all the way home last night. Knew it sounded new, saw it released 2 days ago. I immediately got sad. RIP Dolph, you will always be the ", "Most painful song to listen to. He was tired of it all. Just wanted to enjoy his life. Long Live Dolph ", "Much love and respect to his team for putting this together. It is beautiful.. RIP flipper", "Chills in the spine  he was the best at high class street music", "I got this on repeat everyday ", "The pain still kicks... feels like yesterday bruv,  we bumping to your music man.. keep resting easy ", "Words can’t express how I feel getting to hear a new music of Dolph", "Dolph's music touches my soul man. I miss you bruh. You was too good for this world. Rest up ", "I love how the sight of techno strikes fear into anyone who sees him, Rest In Peace Alex", "This shit so hard let’s run them numbers up for doplh he deserves number 1 song", "R.I.P Young Dolph. Motivated me out of the gutter, Motivated me to Boss Up.", "No matter what young Dolph always gonna be here ️ long live Dolph", "Dolph creates these vibes that hit different, such a tragedy he's gone, but hes not forgotten thats for sure.", "This fire ass song and beat make me even more sad Flippa ain't here anymore. But he left us with plenty of blessings to last a lifetime! Long Live Dolph! Rest Easy King!", "He will never die. He was one in a million ", "Legends never die !!! It’s Dolph ", "Play this song on the radio and send this song to the billboard charts", "Young Dolph goes so hard on this, never disappointed. he is not like other rappers who are going viral by using authentic views to get the views up. Thumbs up who agree", "Best song for me this year hands down this man deserve it haters can hate but dolph is still amongst us P.R.E for ever dolph world ", "This beat makes you think you can rap...in my head I'm killing it", "I-finally-came-back, this stream changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience", "His team did a great job posting this today. rip dolph, a true big stepper", "I really respect Mick for standing up for himself and his work. MVP. GOAT. What a guy", "That \"I'm free\" quote at the end really hits different after his passing. Rest in peace, Techno. You will be missed dearly. =O:)", "He speaks to use through his songs. Long live Dolph ", "Long Live Dolph  We Bumpin You out here in Jalisco Mexico 🇲🇽 ️", "Thanks team PRE and keep dropping for him we will support and I hope y’all get his voice computerize so he can make more music", "Damn! He was truly working on something big, before he was taken from us. The songs he left behind have deep lyrics. He would have evolved to a much bigger icon than what he already became! ", "I can't believe how far the quality of these videos has come. It's absolutely incredible! From the animation, to storytelling, to just everything in general.", "This song goes to hard straight on repeat  LLD ️", "When I first heard this, it spoke life. It speaks life everytime u play it. Thank you Dolph  4 this one especially cuz I wanna get away all the time. Fr.", "This is insane Rest In Peace Dolph ️", "I really stopped listening to rap few years back and dolph still got me coming back beyond the grave always… ", "Let's get this to #1 on the trending list ", "He just don’t miss with the hits ", "Love You Dolph ! You helped me keep my mind focused on what matters most ! La familia Do it for them 24/7 ! Rest in Paradise King! Pray your family Stays Blessed and Your Legacy Lives on forever PAPER ROUTE FRANK ", "Dolph will always have a special place in my heart. We share the same birthday and I even got PRE tatted on me last July 27th in honor of him. RIP Dolph, you’re a legend ", "Wouldn't be where I am today without Dolph. Blessings to him and his Family Always", "Grateful for his team for feeding us som unreleased Dolph, we needed this", "Dolph told you how he lived his life, thru his music. From the beginning of his career till the end. Long live the !!", "Getting me through the worst times in my life thank you Matt for everything!", "Always remember: In the span of 10 months, he was suffering, feeling pain like probably no other, yet he still entertained us. While 6 videos is not that much, its at least something. Techno is in a better place now.", "When they finally see each other again, when Atreus embraces his father without a single word and Kratos understands completely what his son needs in that moment, I cried. My own father has been gone for over a year and there's nothing I wouldn't give to hug him again. Something so real and relatable in this game about fighting monsters and gods was an unexpected gut punch but one of the best moments in any game ever made. Can't wait to keep watching this series.", "Fire beat and his flow was so unique", "Still hard to believe he is gone.. So Much talent! RIP Dolph", "It honestly hurts hearing him rap, listening to his old songs. Especially when he brings up family, but for some reason this song reminds me dolph is up in heaven away from this cold world. Rest up dolph! You’re home now ", "IN YOUNG DOLPH WE TRUST TO KEEP PRODUCING HEAT️", "On repeat because I wanna \"get away\"", "Still dropping  Rip Dolph", "This shit go so hard! LONG LIVE KING DOLPH!", "Shit brough tears in my eyes hearing his voice LONG LIVE KING DOLPH, PAPER ROUTE FRANK!!! ", "Still can’t believe dolph gone honestly didn’t think any more of his music could be dropped that I could even vibe or relate to any more than his past work and my mind is blown yet again RIP Flippa ", "Beautiful! This stays on repeat!!", "I still bump dolph everyday. Listening to his last 2 songs it sounds like he was ready to get out and get money other ways. RIP TO THE KING OF MEMPHIS LONG LIVE BIG FLIPPA", "\"Don't be a young dragon, don't be an old dragon, be a superior dragon.\" This feels inspirational.", "Immortalized !!!! DOLPH got me through a lot of dark days I will appreciate him forever", "He was really on level where they really couldn't see this man rest in the grace man you was one of the greatest I am sixty years old old school rap  bro no mumble rap with straight fire !class by your self sir!", "Shout Outs to PRE & Young Dolph's Team Keep His Memory Alive He will never be forgotten", "That ending of kratos being happy/relieved seeing that image of people worshiping him made me cry. That part itself deserves GOTY. His growth throughout his whole journey is amazing", "first verse gave me chills !!!", "R.I.P. LEGENDS NEVER DIE WE STILL WITH YOU LETS GET IT. PAPER ROUTE NO.1 RRRRUN IT UP PEOPLE.. IT DDDOLPH", "Dolph still here with us. Can't stop his movement. Music just give you the chills. Trap God.", "REST IN PEACE YOUNG DOLPH ", "My favorite rapper before and after he was taken away so soon. \nRIP Dolph ", "I don't understand why they consider this artist dead who for me continues to lead this musical style perhaps with Key Glock and the revelation Muney. That's not to mention that he's still one of the best along with Lil Baby, Nav and Travis Scott. His style and voice are very remarkable, his songs with Snupe Bandz reaffirm that he is still an artist with a unique talent. Very outstanding songs like Here We Go, Ashtray and No Regrets please! More than anything No Regrets was a resounding success. My support is unconditional for YD, not to mention that their songs reach my soul and motivate me to make a better life and not settle for less. And why not look for a life with better economic well-being, thanks to him and all the artists I mentioned before because they show me that anything is possible. His song Hold Up motivated me a lot, the truth is that Young Dolph is an example that I have to keep going despite the difficulties I have to face. Thanks.", "I cant belive i heard his voice again this brings tears to my eyes, #longliveflippa", "rip tragic loss for the future world. But thankfully the music still keeps coming. Amen Dolph", "This dude motivated me so much during his time here. Taught me how to \" stack that money up and make boss moves \"  iykyk r.i.p flippa    ", "RIP DOLPH A LEGEND ALWAYS FOREVER IN MY TOP 5'S..", "Ever sense my daughter put me on to him I bump him every chance I get rest on Young Dolph you are truly missed", "Been listening to Dolph since I was 17 I'm 32 now & he never gets old. R.I.P. Flippa ", "Dolph  Was in Class By Himself Trap Music at its Finest  That Voice Can Never Be Duplicated  Long Live the King of Memphis ...", "The video for this track would’ve been CRAZY! Dolph will forever be a legend ", "Never fails us we miss u Young dolgh let's appreciate this man got more songs for us  I am gonna bump his songs till am 100 years old .", "Damn this is heat bro really knew how to make bangers it’s sad we ain’t get to see how far he coulda went frfr RIP DOLPH ", "Giving me goosebumps listening to it \nLONG LIVE DOLPH", "Legends never die #LLPAPERROUTEBLUEFRANK", "RIP THE GOAT   MISS HIM DROPPING THE  keep’em comin! ", "The loyalty of a Dolph fan is unmatched "]}