{
    "video_id": "9YdgldMKGGU",
    "comments": [
        "LONG LIVE DOLPH  THIS SONG GO HARD LYRICS STARIGHT  MISS YOU MY G #PRE",
        "His Spirit Lives On Through Glizock And His Music Will Forever Be On Repeat Till The End Of Time️ #LLFLIPPA #️RE5L",
        "Rip Dolph. You motivated me to be a millionaire. ",
        "This that Dolph we all know️",
        "Dolphland....flipper  ",
        "Pure Greatness. ",
        "That boss voice can never be replaced",
        "I still cry for you bro love u bro we all miss you bro love from Jamaica long live the king",
        "I the song but Let’s break down this video bcuz ik it’s very calculated as you can see by the details. First thing I see an “exit” sign in a hallway full of money n clothes(hat)  with a checkerboard floor. It seems to\nMe dolph meanings was to get away(exit sign) from the free masons(checkerboard floor)that’d he’d been in connections with who helped him gain fame n riches but caused so much pain inside of him. Idk maybe I’m tweakin. LL DOLPH THO",
        "Still can’t believe dolph gone honestly didn’t think any more of his music could be dropped that I could even vibe or relate to any more than his past work and my mind is blown yet again RIP Flippa ",
        "Long Live The GREATEST! RIP Dolph ",
        "Young Dolph pra sempre!",
        "Lyrics give me chills",
        "Long live king dolph ",
        "Baby just lmk if you still alive",
        "Rip to the real king of Memphis long live dolph",
        "LegendaryGone but never forgotten.",
        "My Nigga Dolph Immortal like PAC. GOD BLESS THE DEAD! ",
        "Rip young king song so hard thanks for dropping this before u passed away you truthy loved your fans️‍",
        "This beat makes you think you can rap...in my head I'm killing it",
        "Its like when the main character comes back after leaving for a long time",
        "Its crazy how you think about someone you never met. Long live Dolph  ",
        "We miss and love you Adolph I’m still emotional behind your passing I could write a paragraph just kno you will never be forgotten continue to RISE IN POWER KING ",
        "Honestly, i didnt even know who dolph was til about 2yrs ago. Whenever i heard his name, i thought he was one of these new mumble rappers. Then i heard \"play wit yo bitch, and 100 shots\" and that made me look more into him and his music. Ever since i was hooked. I still remember where i was the day he allegedly died. I was cutting grass for the last time, and my wife sent me a text that dolph just died. Yes, i said allegedly, because i believe he was kidnapped and murdered days before he was \"murdered at makeda's.\" His own crew, fam, and many other people set him up. Anyways, i've been hooked on dolph and his music ever since. ",
        "I don’t think he’s dead . I listen to dolph everyday",
        "Rip dolph real dying fake lit damn shame",
        "Yesss!! Dolph saved my playlist Again. The fake hate on the real, not the other way around. Long live the ",
        "Niggas killin to be like this man its crazy...",
        "I wanna get away.....",
        "I’ll foreva still bump your music ",
        "Heard the pain in his voice mane long live flippa ",
        "This makes you realize his character development was stunted",
        "I swear Dolph. Can't b fucked with he got a unique flow  ",
        "Man not even 10 seconds in and I'm already laughing my ass off, I LOVE THIS CHANNEL!",
        "He knew ",
        "Another one for da collection ",
        "Discovered This Song At The Gym, It’s So Hard !",
        "Shit crazy man RIP DOLPH",
        "My past I wish I could just erase it 🥹",
        "Gangsta you got the same respect as pac an nipsey after passing, \n\nWell you got the respect from me Dolph in life an after ",
        "That voice of Young Dolph  always rock in my head since day one. LLD Da Flippa  Paper Route Frank, The one and only King Of Memphis ",
        "I-finally-came-back, this stream changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience",
        "This Deep",
        "No matter where I go in life dolph will always be with me. Miss you dolph!!",
        "🇷",
        "Unmatched  ",
        "🇪 ",
        "I didnt really know dolph before he passed.. but now i know. His music gives me energy on the daily <3",
        "What's Funny is This Song More Harder Than Most Of These Niggas Releases This Year R.i.p Dolph Definitely Made An Impact On The Culture   They Just Don't Wanna Hear The Truth About Today's World And the Last Days",
        "He just don’t miss with the hits ",
        "RIP DOLPH LONG LIVE DOLPH WE LOVE U DOLPH!!! ",
        "#LL",
        "Whoever created this video is fire the building made of money stacks are sooo Dolph \n\nBeat is so dope and I expect nothing less from this legend. He’s a giant who truly made his mark on Earth. Long live Young Dolph ",
        "This you can vibe too. He never misses .still bumping his music everyday. Only the grinders and trappers can relate",
        "Love him for ever..",
        "I thought I'll never hear a new yD song again \nRip yD , takeoff , Pnbrock gone way too soon \nYo love forever through your music",
        "🇷🇷🇷 ",
        "YOUNG DOLPH GO IN HAM ON this right here, real talented artist! He aint like all them goofies and oppas who just be usin dat IG ROCKET    to go HAM ON THE GRAM like them Island Boys did to get they followerz up",
        "Shit brough tears in my eyes hearing his voice LONG LIVE KING DOLPH, PAPER ROUTE FRANK!!! ",
        "Dolph deeply missed in the rap game.RIP ",
        "I wish you were here with me",
        "On repeat because I wanna \"get away\"",
        "GOAT",
        "Still blast DOLPH telling others if it ain’t DOLPH turn it off RIP BRO BRO",
        "P.R.E 4 life ",
        "Young Dolph the only artist that gave us the rap game #free #independent #starreach100 #ripyoungdolph #fyp",
        "Rip king  ",
        "There will never be another Dolph",
        "You living though us now homie",
        "All 3 million views are by me......",
        "beat cold!!!!!!!",
        "Held me through many breakdowns lately, thank you. RIP ️",
        " talk",
        "Fire    ",
        "Long Live Flippa ",
        "The dolphin sounds give me chills",
        "Long live the  Dolph",
        "Bumped this all the way home last night. Knew it sounded new, saw it released 2 days ago. I immediately got sad. RIP Dolph, you will always be the",
        "Still hittin’ in the grave. Well done Dolph",
        "Shi so hard ",
        "Legends Never Die   And Forever Dolph Will Live in our Hearts and Memories Forever, Forever  LIFE",
        "Facts my new anthem song for all you haters",
        "Repeat",
        "Young Dolph Is The Absolute Goat   ",
        "Real true legend  Dolph music will never get old",
        "Dolph still here with us. Can't stop his movement. Music just give you the chills. Trap God.",
        "Energy that this man gives can’t be matched Rest easy dolph! ",
        "Dolph be the goat of all goats",
        "I always jam Dolph till I die.",
        "Who else playing this on repeat ",
        "️Legendary music/individual. RIH ITS DOLPH",
        "Forever you ",
        "Love it",
        "Rip Legend",
        "This shit, hits you to the core....",
        "Hard asf!!!",
        "RIP DOLPH. A REAL LEGEND. HE GONNA LIVE FOREVER!!!",
        "when you see them flippas dancing. R.I.P Young Dolph ",
        "🇹🇹 ",
        "Keep it real with yo dawg no matter what ",
        "Long Live Dolph!!!!!!!",
        "Dolph you da goat. We lost a legend",
        "Love you Dolph ",
        "Thank You For The Release Fam!  LLD  Keep Pushin!",
        "Damn thank you dolph...",
        "He sacrificed it for the family he a real one",
        "You will forever be missed RIP YOUNG DOLPH ️",
        "R.I.P Young Dolph  will always listen to his music ",
        "A mfning LEGEND !!!",
        "Still hard to believe he is gone.. So Much talent! RIP Dolph",
        "faker his death",
        "Long live ",
        "Still can’t believe they took a real one ",
        "Timeless! You can't kill him. Fux neegaz",
        "The goat will never be replaced!! ",
        "RIP dolph",
        "I swear to God he’s still here with us, his spirit lives on LLD, manifested this! I said imagine if we still could get Young Dolph hits even up till now…. Not even 2 weeks later!!! ",
        "R.i.p dolph  its P.R.E over here all day 4L",
        "Not gonna lie seeing Dolph as a computer generated image creeps me out because it looks like he's actually there but this song is lit ",
        "Not new but a classic! Rip Sir Dolph! 214",
        "R.I.P ",
        "I still bump dolph everyday. Listening to his last 2 songs it sounds like he was ready to get out and get money other ways. RIP TO THE KING OF MEMPHIS LONG LIVE BIG FLIPPA",
        "Dolph  4Ever !!!",
        "Miss you bro",
        "Teared up listening to you big bro ",
        "The thrill of this isn't even just the impressive but crazy driving - it's how everybody came together to make this a full production. The zoom in on the weed wacker was incredible. =)",
        "It’s dolph!!!!!! Uhhh huh!!!!",
        "long live dolph",
        "🇮 🇪",
        "We all miss you dolph. May your legacy live on through your music",
        "To all PRE family & his family sending you my utmost protection prayers. Adolph is and will always be a blessing to the World. I would always go to the gym with 2 -3 hours Dolph playlist but since I lost a role model it's been so hard to go back to the gym - I switched up to eating healthy organic foods. Adolph wherever you're I Salute you & thank you for been there for us and motivating us always to go hard on our dreams be about action & not giving up. Lot's of Love from a day 1 fan - China 🇨🇳",
        "LongLive King of Memphis #Dolph .. Im still a day1 fan",
        "Classic production fasho  Long Live Paper Route Frank Young Dolph  ",
        "Yall hold no ancestors",
        "This song gave me chills I shed a tearI miss u dolph it’s like you’ve been wanting to get away from this rap shit.LLD",
        " 🇳",
        "Is when he ask to be with his granny....rip his granny n rip dolph",
        "Man, it’s crazy to think bout someone constantly having not ever met them. Dolph you’ve continued to motivate and inspire me to do great things. RIP Dolph $Foreva PRE$",
        "RIP Young Dolph, gone but never forgotten. You left a legacy, PRE ",
        "🇹 ",
        "Thanks for the motivation in the dark times RIP the flippa ",
        "I'm from Australia I run my own business I bump dolps music from the time I leave every morning before work the man's music motivates me like nothing else to hustle my ass off everyday  he was so different then all these rappers out there today RIP flippa love from Australia  🇦🇺",
        "Dang I love how cracked a shot SMii7Y is though. Him breaking into the bathroom was smooth af",
        "\"All I do is get high and work..\"\nI felt that  . Long live Dolph ",
        "I still bump Young Dolph no matter what, that voice can never be replicated ",
        "It just fuck up bro damn",
        "Brah if this was 1 of his last songs he recorded….. it’s like he felt God calling… “I wanna get away”… That man was speaking from his soul… ",
        "Repose en paix ",
        "I’m not buying any merch until you show proof that the money going to dolph family",
        "Thank you Dolph...For all your music!!!",
        "Rip Dolph!!!",
        "Dolph n Key are in my rotation heavy shit just a reminder for me to keep it pushin n get dis money fr Dolph was just too real",
        "Been bumpin' dolph and I'll keep bumpin' his music no matter what. Man was the . He motivates me to become the best version of myself. LLDOLPH",
        "This fire ass song and beat make me even more sad Flippa ain't here anymore. But he left us with plenty of blessings to last a lifetime! Long Live Dolph! Rest Easy King!",
        "LONG LIVE FLIPPA!!",
        "all of this shit just to basic",
        "Anybody else wonder if faking your death is the way to retire just wondering",
        "I got this on repeat, we needed this ",
        "Not go feel sad, big dolph Elevated all the way to the top. Most high respect and blessings to the family. We all meet again.",
        "Favorite Rapper of all time PRE4L ",
        "Dolph ",
        "RIP Dolph",
        "So what sample is that?",
        "This shit so hard miss dolphin  so bad glad you keep it alive ",
        "God knows this time of the year is the hardest , Dolph was ahead of his time and was an inspiration to millions even after a year , LongLiveFlippa ",
        "RIP YOUNG DOLPH️",
        "He just speaks on real shit that I can always relate to. Long live Paper Route Frank",
        "Nobody will ever be young dolph nor replace his music , it hits different ️️",
        "I love this song on Repeat",
        "This shits  damn I miss you Dolph ",
        " R.I.P young Dolph  your music  lives on ...",
        "Uncle Murda funny asf at the end",
        "Young dolph is in my top 5. Hes one of the most motivational rappers ever to me. Im so sad that he is no longer here and making music or able to be a dad . I listen to him every single day.",
        "Rip goat shit a banger!! ",
        "Words can’t express how I feel getting to hear a new music of Dolph",
        "Rip pre",
        "I wanna be with my granny, Sacrificed it all for the family ",
        "🇨  🇳",
        "Negative lyrics not good",
        "What a crazy visualizer. Exit doors represent heavens gates. LONG LIVE DOLPH ",
        "This shit so hard ",
        "Rip dolph  your music motivates me to make money and never be broke again. LLD ",
        "Goat ",
        "I wanna get away yea yea yea dam ",
        "Young Dolph was one of my favorite rappers he is my favorite rapper too bad he's gone but I'm sure they're still some unreleased music Just like this it hasn't been released yet so I'm  looking forward to it . Long lived dolph",
        "Was gonna be sad if we didn't get no new dolph on dolph day...long live flipper",
        "I swear on my grandma I got tears listening to this ",
        "Young Dolph goes so hard on this, never disappointed. he is not like other rappers who are going viral by using authentic views to get the views up. Thumbs up who agree",
        "It’s like my boy wrote this from heaven ",
        "🇮🇮 ",
        "I just realized that the reason the bowl we used to summon skll and hati is so high pitched is probably because its supposed to be a dog whistle of celestial proportions.",
        "Damn! He was truly working on something big, before he was taken from us. The songs he left behind have deep lyrics. He would have evolved to a much bigger icon than what he already became! ",
        "I understand u bro",
        "Happy Thanksgiving Flippa",
        "Let's get this trending  too #1 Let's run it up to 100 million Views RIP Dolph",
        "It doesn’t hit the same!",
        "Rip big bro ",
        "GO GET THE MONEY FOREVER MY MOOD️️ Doesn’t feel right having to Miss You Like This. All Time Top 5  Continue To Rest Peacefully Flippa You Are Truly Missed Forever And A Day️",
        "On repeat \n LLD  ",
        "BFFM we got next ! blackfamilyfirst Muzic new YouTube channel",
        "Not even death can stop Flippa. A  real OG he'll always be. Long live PRE. ",
        "You're truly missed!! Long live a legend!!",
        "The best to ever do it, what a motivation your music is to keep hustling. Rest up thug ",
        "Can't believe its been a year",
        "My boi gone and still jamming after death!!!! They still can't stop em",
        "The ",
        "Even if death his music lives ETERNALLY!! IT'S DOLPH",
        "Okay y'all we got to 4 million let's play this thing everyday two times a day for the next week",
        "Dolph the goat of all GOATS",
        "RIP to my hitta DOLPH! He is alve forever! He aint like all them artists out there these days who just be goin HAM on the GRAM by usin dat IGROCKET dawwwt cawww to get they followers to go HAM ON THE GRAM... SMH",
        "Rip young Dolph   long live the king of Memphis aye ",
        "Rest In Peace Young Dolph ",
        "R.i.p.",
        "🇮🇮",
        "Sacrificed it all for the family ",
        "I wish this was a subliminal that he got away  ",
        "Them chills .. RIP Dolph",
        "Long Live The Memphis King ",
        "Miss you everyday Dolph. Listen to your music morning, day, night ! Fuck this world we live in… it’s dolph !!!!!!!",
        "Grateful for his team for feeding us som unreleased Dolph, we needed this",
        "Money makes everything old. Is why the little thing's to me are the biggest. R.I.P Adolph ",
        "RIP REAL LEGEND",
        "",
        "Been bumpin Dolph music from the beginning, he inspired me to go get my money and now I'm stacking up bands thank you Adolph for all the great music you are never forgotten.",
        "Já se passou 1 ano da sua partida King \nRIP DOLPH \nLong Live Flippa ",
        "Rip Young Dolph, he was a real one and gave back to his community and cared about his loved ones and family, I miss Dolph",
        "Rip one of the legends",
        "RIP dolph hear his music and it bumps all day he will get u motivated.",
        "00:36 Very nice! ",
        "Legends never die, RIP dolph ",
        "RIP THE LEGEND ",
        "Rest well Dolph.  Long live Flippa!!!",
        "He back w/ Granny now  ik she was proud of the man she raised and you became...job well done Adolph ...#LLF4L ",
        "Dam mane!!!!",
        "  🇨🇨",
        "Heard this on Xbox the other day and didn’t realize it was new 🥹",
        "Perfect song for some loud to get away!",
        "Unlock the vault. I know it's more shyt in there. LLFLIPPA",
        "We just miss you man ",
        "Damn Dolph, you really sacrificed it for the family. Also Granny is there with you my brother.",
        "Man his voice though ",
        "Even in heaven my boy still dropping heat down here on earth️",
        "Dam my nigga️️ they don't love until you're gone  shit sad my nigga  long live dolph  only da real will understand ",
        "Long Live Young Dolph Your Music Will Live On Forever ",
        "Damn this one hit hard rip goat ",
        "They killed my favorite rapper but they can't kill   PRE 4Life",
        "Long live flipper.. Rest easy",
        " 🇨🇨",
        "The video for this track would’ve been CRAZY! Dolph will forever be a legend ",
        "This the coldest song i heard this year!! RIP Dolph!!",
        "Young dolph will forever be a king ️",
        "RIP the GOAT dolph <3",
        "love the beat",
        "Dolph 4 ever this hits different ",
        "Man I ain't even gonna lie there's so much anger built up inside me bout Dolph being gone",
        "His team did a great job posting this today. rip dolph, a true big stepper",
        "Dolph was the one that did me in when he died. I never met the man a day in my life but I loved his style of rap so much. The way he delivers it and all the false beat drops that you assume is about to happen when you listen to a song of his the first time and you ready for it and you just about to pump that fist to it but nah just more Dolph. Shit always cracked me up in a way but like in 100 shots I swear to god man the beat don’t actually really drop until like 3/4ths of the damn song has played…. But when it does shhheeeeee worth it. RIP DOLPH unfortunately this world just couldn’t understand what they had. The only good thing to come of it is the fact that all the good ones in this world worth there weight are living in the ground. We can’t never have nothing nice I swear. Especially in the hip hop world. It’s gotten so bad I’m waiting for got damn NBA and NFL players to start doing drills on each other. If you think about it it makes almost as much sense as this shit do anymore. I can guarantee if you was to ever ask someone like Von or Durk what they opps really did to deserve to die the horrible deaths they gifted them they wouldn’t even know bruh. Can’t y’all see the system was designed in a way that even if y’all do make it out the hood they’ve got a way of causing you to be jealous over it instead of proud so you kill em over it. They made sure even when y’all become successful you still lose and it’s making me sick my brothers and sisters of color need to stand up and unite and once we’ve smoothed out all those rough edges then we need to ALL get along together. With that the government and everyone else who helped design this evil one sided shit can begin to pay for it.",
        "Tough to listen to without his natural adlibs. Miss you dolph ",
        "ONE LOVE!!!",
        "It's Dolph",
        "All I can say is ",
        "My favorite rapper ",
        "Dolph a real deal legend in the rap game. No dirt on his name, went out a real one. Nothing but respect ",
        "Dolp is the the G.O.A.T! Long lived ! Chi-raq Pie-Face",
        "Young Dolph. The greatest to ever make it out the streets. LONG LIVE THE MEMPHIS KING! No one will ever take that title away from you. You conquered the streets and will always be known as the self made boss of the rap game. LLD",
        "Goat",
        "LLD ITS DOPLH️",
        "RipDolph a real one",
        "Dolph made REAL MUSIC IYKYK he not industry and didn’t have to rap about the shit everybody else Do He Related Too REAL LIFE SHIT His music is comparable to pac and big   one of the Best to do it ",
        "Hardest shit i done heard in bout a YEAR. \n L.L..DOLPH",
        "BIG BOSS FLIPPA ",
        "Rip ",
        "I thought this was one of dolph s og songs off his first or second album when I heard it on pandora and when I went to look it up today it was 5 days ago good too see dolph still here and relevant this a banger dolph thanks PRE FOREVER",
        "We miss ya DOLPH love This track.",
        "That’s what I do get high and work",
        "It’s so nice to hear his voice again unforgettable!! Rip Dolph ",
        "I bump young Dolph every day for Dolph God bless his Famm",
        "Cant believe its been a year Was waiting for my dawg dolphs new music  always gonna bump dolph for life my fav rapper rip dolph",
        "LLD REST EASY",
        "Talk the talk king  every lyrics sound truth , people get jealous of you ahead of em keep rest in power PRE we miss u man!",
        "LEGENDS NEVER DIE",
        "It's Dolph!!!!!!! Rip legend 🇯🇲🇯🇲🇯🇲🇯🇲🇯🇲🇯🇲🇯🇲🇯🇲🇯🇲🇯🇲🇯🇲  rep dat PRE EMPIRE",
        "Sacrificed it all for the family!!!",
        "This shit  lit I feel like my nigga still here🥹thank you",
        "Holidays aint the same",
        "damn sure got that right long live dolph",
        "Rest in Paradise King Dolph  Real Hustler Music ",
        "I've probably heard this 100 times and it's still the best thing I've ever heard ",
        "ALLLLL TIME GOAT !!! KING OF MEMPHIS!! KING OF RAP!!! ALWAYS NUMBER 1 ON MY PLAYLIST!!! RIP KING ",
        "LL #Dolph 🇯🇲+🇺🇸=️",
        "Most painful song to listen to. He was tired of it all. Just wanted to enjoy his life. Long Live Dolph ",
        "Best feeling ever to see a new Dolph song. We miss this man. Rip",
        "Is this real !!",
        "This needs the #1 spot",
        "Great artist took from this world because of evil people. Yeah we all have evil instilled in us all but to kill a person the way dolph was killed was senseless, pointless, and the most pure of evil. I can understand protecting yourself or loved ones in a situation but his death was unjustified I need more young dolph hits",
        "What did this man ever do to deserve what happened to him? Smh miss dolph fr. But this beat go hard asf",
        "Can’t help but Rap Along with DOLPH in tears my nigga helped me get OUT SO MANY STRUGGLES just listening to what he says & they took my Idol from me . Life a B** staying Focused on the right path I can’t go back to 0",
        "I can’t stop bumping this shit",
        "This is sooooo fire no Voice like him. No perfect duo more than him and Key! Share this all over . His family deserves all his success even in death…🥹🫶🫶",
        "This shit hard af rip dolph",
        "WHO'S WITH DOLPH EVERYDAY?! LEGENDS NEVER DIE",
        "Be real I play dolphin everyday",
        "I really stopped listening to rap few years back and dolph still got me coming back beyond the grave always… ",
        "🇨🇨🇨",
        "First second in you know this was meant for Dolph because it made me smile and ready for more grind.",
        "Crazy even after his death, we still waiting on his next album ",
        "After a billion after that im doneee\n..... :|",
        "Dolph the real trap god fr big goat ",
        "rip doph may your soul rest in peace de will never forget you",
        "It's Dolph ",
        "Long Live The King Of The South",
        "He paved a way for a lot of people",
        "Won't no rapper from Tennessee ever fw dolph and I been bumping him since 2011 I'ma bump bro til I die LONG LIVE THE LEGEND... HE LEFT US KEY GLOCK AT LEAST SO PRE IN GOOD HANDS",
        "He was and always will b tha TRUTH!!!!",
        "Long live dolph ",
        "We love and miss you dearly ",
        "It’s still Dolph everyday  No skips",
        "RIP dolph  I was suggested here while listening to the song “Addictive - 3 Telefona” ",
        "His flow was smooth af. RiP Dolph",
        "Sad song. RIP Lil Flippa.",
        "Fire",
        "STILL THE KING OF MEMPHIS!!!REST IN POWER KING!!!",
        "Underground... and has the  backing him up AD  ️ ",
        "Here with young Dolph till the end rest in  peace Dolph ",
        "You still one the best to do it my boy ....Be Legendary Peacefully ️🇯🇲",
        "RIP Young Dolph. A year later. One of the realest in this generation to do it. Much love & light to his family & community.",
        "Only new gen rapper I appreciate",
        "This song is like my every introverted thought ️",
        "Rest in Peace Dolph your music hits every day",
        " 🇨",
        "Damn Dolph this shit give me chills it always be the unique ones the real ones to go RIP",
        "When I go to Heaven I want to have a cigar with Dolph.#Let the bands play  ",
        "Song so real, he was tired they did him a favor setting him free. He know his bm and kids will be straight!",
        "Another gift from beyond.",
        "This man's music will stand the test of time.   ",
        "RIP  (ART)...  I admire the man  not the pseudonym.",
        "this man had a top tier unmatched ability for picking beats",
        "Only thing missing here are Dolphs adlibs. Yeah yeah",
        "The world may dark sometimes but we are blessed to hear another Dolph track …  this goes HARD! It’s Dolph!!! ",
        "One of my favorite rappers not just because he raw asl but because he was a real one too I love u Dolph  Long Live Flippa ",
        "️",
        "No one will ever see this thanks to you tuube algorithm but I hope to make it big one day ",
        "So relatable so much pain but success I love u Dolph P.R.E Forever ️",
        "All Dolph Beats Knock  ",
        "Hey guys, I just wanted to stop by to send some positive energy to all of you! These past years been very tough to me. Ive been challenged mentally, emotionally and certainly spiritually. I feel like i’m finally finding myself and who I was once before when I had peace. I am thankful to come across a channel like this one that shows me that we are really all one in the same. We all have these daily struggles that we deal with that can keep us up late at night but just know that you are not alone. Knowing that I can come here and openly express myself and see others doing the same gives me hope that the world will indeed be a better place but it starts with us. We have to set an example for others and I know we can do it. Peace and Love to ALL OF YOU BEAUTIFUL PEOPLE.",
        "i really hope we get a Dolph project",
        "That \"I'm free\" quote at the end really hits different after his passing. Rest in peace, Techno. You will be missed dearly. =O:)",
        "I never knew you, but I miss you.. thanks for having new music for us to hear even when you’re gone.  Rip you didn’t deserve this shit man",
        "Dolph told you how he lived his life, thru his music. From the beginning of his career till the end. Long live the !!",
        " 🇳🇳",
        "Been listening to my boy since he passed,….still turn people over in his grave miss you dog",
        "🇪🇪",
        "I feel like he knew he was leaving and had to do this last song dammm",
        "🇨 ",
        "Real that ever did it man \"Got Damn\" we love you Dolph️",
        "Big flippa ",
        "🇮",
        "this video \nFIRE",
        "RIP KING THE BEST  LETS GET THIS SHIT TO 3MIL VIEWS",
        "Time fuckin movin can’t believe it’s been a whole year since dolph left us feel like hearin about his death is still fresh",
        "Rip still my top five dead or alive ",
        "\"keep going up the ladder they mad make em madder\" that line alone changed a lot in my life  keep flying high king ️️ it's Dolph 🇿🇦",
        "Dolph creates these vibes that hit different, such a tragedy he's gone, but hes not forgotten thats for sure.",
        "This a banger",
        "This shit hard asf RIP ",
        "The realest in the game under the wing of Gucci Mane, they both always go hard  \nLong Live Dolph  RIP",
        "🇱🇱",
        "Dolph never disappoints every song he ever dropped has been a banger.",
        "Dolph still giving us signs \n#LongLiveFlippa",
        "Long live Dolph",
        "Even though they killed him that don’t mean shit..anybody can kill anybody .. still king of Memphis!! ",
        "Mane hearing his voice got me wit mixed emotions. I wish I could bring Dolph back. Shit Don't feel fair or right. Can't question God but Mane feels like humanity died hope died, all type a shit died wit a Dolph. Bow Dolph gotta live thru ppl who love him. 4Life",
        "Young dolph always gonna be the goat in music. #FlyHighDolph ️",
        "Got goosebumps when I heard his voice.   No one will ever compare to Dolph ",
        "Drinking coffee eating shrooms",
        "Ain't nobody rapping like Dolph did. His whole style. Unmatched.",
        "The motion capture alone in this game is crazy, seeing the emotions on character's faces so clearly really adds to the immersion in the game. A masterpiece of a game.",
        "But I’ll never go away  Rip IAN",
        "I’m sick of counting millions I think I need a billion ",
        " My new anthem ",
        "Damn his vice is one of a kind they tryed but u could tell the vice differnce",
        "DAM This Bi So Hard ",
        "this gives me chills bro one of my inspirations ong LLD",
        "  from the grave, I felt this one\n\nBut one thing I really appreciate is his sacrifice for his family in his music and his hustle",
        "Long live Legendary Dolph",
        "Long Live Dolph Forever!! Prayers to his family and close friends! God bless his wife and children! ",
        "ITS DOLPH!!!! WE Miss u mayne u never disappoint",
        "I sacrificed it for my family ",
        "Geni",
        "Long Live Dolph. ",
        "Young Dolph will forever be truly missed.",
        "This song goes to hard straight on repeat  LLD ️",
        "Dolph da Goat️️️️",
        "Dolph will always have a special place in my heart. We share the same birthday and I even got PRE tatted on me last July 27th in honor of him. RIP Dolph, you’re a legend ",
        "Love to dolph from the bay area",
        "Still Going....",
        "Been the realest ",
        "Seeing Mark scream about his unstable internet really makes my day after a long day of work <3",
        "I know who ever responsible for his death mad as hell we keeping him alive.  Long live ",
        "i wonder if this would of dropped if he was alive or it would be a throw away .. nonetheless fire",
        "Rest in peace Young Dolph you'll always be the best.Feels like I'm still waitng on a album to drop but all I could say is Rest well Legend..",
        "Still young dolph",
        "Rip dolph",
        "Lyrics\n[Intro]\nI wanna get away (Yeah, yeah, yeah, yeah)\nI wanna get away (Ghostrage, yeah, yeah, yeah, yeah )",
        "🇳 ",
        "Dolph still best dressed Rapper yet!!",
        "LL DOLPH REST IN PEACE TOOK AWAY A LEADER REAL TALENT DAMN SONG WAS A MASTERPIECE",
        "R.I.P Young Dolph ur music will be legendary 4 LIFE!",
        "I don't understand why they consider this artist dead who for me continues to lead this musical style perhaps with Key Glock and the revelation Muney. That's not to mention that he's still one of the best along with Lil Baby, Nav and Travis Scott. His style and voice are very remarkable, his songs with Snupe Bandz reaffirm that he is still an artist with a unique talent. Very outstanding songs like Here We Go, Ashtray and No Regrets please! More than anything No Regrets was a resounding success. My support is unconditional for YD, not to mention that their songs reach my soul and motivate me to make a better life and not settle for less. And why not look for a life with better economic well-being, thanks to him and all the artists I mentioned before because they show me that anything is possible. His song Hold Up motivated me a lot, the truth is that Young Dolph is an example that I have to keep going despite the difficulties I have to face. Thanks.",
        "Real boss one of the best to do it R.I.P #YDForeverPRE",
        "🇰🇰🇰",
        "Currently: Addicted to Dolph ",
        "Impeccable .  L.L.D   PRE 4 LIFE",
        "R. I. P",
        "I miss you dolph. You the GOAT ",
        "I'm a fan of music and a fan of hip hop artists such as dolph may he rip he was one of my favorites I don't expect you to understand but when music motivates, moves you in a way that it speaks to you. That's how I felt he spoke to people like me through his music his lyrics his rhythm and blues it's Dolph Rest in paradise",
        "Hands down! Drop the mic!!! Rip",
        "Paper Route business  I listen to this mane every single day I love you  Dolph️ He be speaking some for real real shit Every time I watch this video tears fall",
        "King of Memphis TN ",
        "[Verse]\nGot tired of re-in' up and trappin' (I wanna get away)\nNow a nigga sick of rappin' (I wanna get away)\nAll of this shit just too basic (I wanna get away)",
        "Long Live ",
        "Miss that dawg ",
        "Покойся с миром легенда!",
        "Still feel like I lost a real blood brother everyday, still can't believe bro gone, my all time favorite rapper (RIP YOUNG DOLPH)",
        "Legendary RIP Dolph ️️️",
        "We want more young Dolph an key clock",
        "I get that Empire records is still tryna make some money off the dude but damn just let the man rest in peace this shit don't even hit the same",
        "Bumping ",
        "most relatable song ever",
        "Shout Outs to PRE & Young Dolph's Team Keep His Memory Alive He will never be forgotten",
        "8:02 was so simple, yet so fun. Keep on the good work Alex, your creativity knows no bounds",
        "We bumbin this everyday till it’s #1. Period.",
        "Young Dolph was like a modern 2pac in his own way",
        "This song is deep",
        "I still bump young dolph no matter what. LLD     ",
        "I still can’t believe he gone man \n\n“Don’t nobody understand me , wish I could go be with my granny .. sacrifice it all for the family “ ",
        "Pre young Dolph",
        "Rest in peace Dolph. Legands can't die.",
        "Platinum level artist mad love to Dolph for blessing us all with beautiful music and a great motivational human being. God loves you you will always be God's child",
        "Rip flippa ️",
        "This shit hard foo",
        "Rip to the goat ",
        "BEST ARTIST FROM MEMPHIS & IT WON'T EVER CHANGE! #longlivedolph",
        "No matter what young Dolph always gonna be here ️ long live Dolph",
        "Love you forever  you will remain on top and the shit ",
        "It’ll never be another …. ",
        "We never gon forget about you Big Flippa",
        "I miss you Dolph this voice connects with my blood and gets me motivated ... Long Live Dolph i wish you were here now i'm sad whole year because of this",
        "Crazy the things he’s saying in this",
        "WILL FOREVER BE IN MY TOP 5 I HOPE YOU HAVE ALOT OF MUSIC STILL KEEP DROPPING WHO EVER IS IN CONTROL OF THE RELEASE THE HURTING PEOPLE BEHIND DOLPH NEED THIS…. REST IN POWER KING ",
        "Rip wht a masterpiece of song long live dolph",
        "it's so sad and such a shame that it took his passing to be forever imprinted in the hall of fame. he deserved to be there before he died. rip",
        "This so hard mane Damn !!!!",
        "Sacrifice it all for the family.RIP paper route Frank ",
        "my fucking idol right here the only rapper that really makes me wanna go get the money even harder R.I.P YOUNG DOLPH ",
        "The King Of Memphis",
        "🇪  ",
        "My favorite rapper before and after he was taken away so soon. \nRIP Dolph ",
        "RIP DA GOAT ",
        "My Dawg!! Back with another ️. You left us too soon bro!! Real ones keep this on repeat .",
        "I tried to tell people he wasn't happy on the inside",
        "Wow, nice song, it's great to listen to HIM while I answer the modules, it makes me feel very relaxed",
        "Rip flippa, one of the best artists to grace the game",
        "🇹🇹🇹",
        "I really think Jook in trouble and Gotti gotta watch him go down or fall with him. Back to jail you go he waiting on you.",
        "RIP THE GOAT   MISS HIM DROPPING THE  keep’em comin! ",
        "Let's get this to #1 on trending I listened to this like 30 times already lmao",
        " 🇳🇳🇳",
        "Man…………………………….. Young Dolph was indeed a larger than life soul. “R.I.P. Dolph”. Gone but not forgotten. ",
        "Best song for me this year hands down this man deserve it haters can hate but dolph is still amongst us P.R.E for ever dolph world ",
        "Young Dolph will be a legend forever even though he is not with us his songs still get millions of views in just a couple of days in these top artists it takes months or weeks",
        "Rip dolph    saved alot of ours  life true ",
        " 🇷🇷🇷",
        "Fire, rest up goat we gonna miss you an your energy️",
        "Best song for me this year hands down this man deserve it haters can hate but dolph is still amongst us P.R.E for ever dolph world",
        "gone but never forgotten",
        " 🇪🇪🇪",
        "Hard asf ",
        "P.R.E FOR LIFE \nTHE REAL GOAT OF ALL TIME. GONE BUT NOT FORGOTTEN REST IN PARADISE HOMIE ",
        "He still the fucking fire ",
        "It don’t get no realer than this i felt that realness in it RIP  he knew what came with the game ",
        "We love you King of Memphis! You left us with another banger️",
        "Rocking DOLPH daily. Never taking it out. ",
        "Rest in PARADISE THE REAL SELF MADE MILLIONAIRE ",
        "Rip",
        "LL DOLPH  #FREERALO ️",
        "🇷🇷🇷",
        "Love you dog. We miss you Mayne ️",
        "When I first heard this, it spoke life. It speaks life everytime u play it. Thank you Dolph  4 this one especially cuz I wanna get away all the time. Fr.",
        "Heard this on Pandora today omw to work!! I knew it was new, cause wtf it come from!!? Love it!!! ",
        "Woke up in a whole mood! Straight banging my faves today at 7am, my girl was pissed idgaf tho isssss DOLPHHH!  , Love ya dawg, long live dolph for ever! PRE",
        "Always jamming Dolph",
        "The lyrics in this song gave me chills… like he knew his time was coming",
        "Been refreshing the channel daily for new music and today they blessed me ",
        "LongLiveDolph ",
        "Keep running it up ",
        "I'm calling it now. He faked his death",
        "I love and miss you dolph 🥹",
        "Will forever stay in my rotation long live Dolph",
        "Dolph was on another level.   He was a introvert, who loved his family. Didnt really care about the money and fame. Gave back to his community, kept his head down and kept grinding.  We all miss you flippa! Especially us folks in Tennessee."
    ],
    "comments_disabled": false
}