{
    "video_id": "_FD6Fyn2s0c",
    "comments": [
        "The thing with Sauron... He is a lesser god. Meaning that he is simply higher tier than LK.",
        "My proposition is Medivh vs Amon Jerro",
        "My favourite line sauron speaks in all the movies is simply, \"I see you.\" When something that powerful has It's full attention on you, I would be shitting bricks. \nLoved that you included it here.",
        "This battles would be awesome: Dracula Vs. Strahd Von Zarovich. Merlin Vs. Raistlin Majere. Conan The Cimerian Vs. Drizzt Do Urden.",
        "never really cared for sauron or the lord of the rinfs but seeing this episode really made my jasw drop. I know like Sauron !",
        "You have to do bugs bunny vs goku",
        "You know I was gonna recommend Deku bS Joseph Joestar, but Astra is fine.",
        "Death Battle recommendation: Heihachi vs Yugiro",
        "Is there a series where they take the best that have appeared on the channel, place them in a bracket style tournament and see who comes out on top? Or better yet. Let the fans vote on their favorites and then they play out the randomized bracket. Sure some of the matches might be one sided but some of them might end up being matches that would never be explored and be major upsets. Like maybe someone that previously lost can beat superman but Goku gets a good line to the finals. it would be cool to see how the fan favorites really stack up in a randomized Death Battle Royal.",
        "There was really only one outcome. The Lich King is super strong but has canonically been defeated in combat by adventurers, meanwhile Sauron hasn't really been defeated the same way. So the Lich King has a clear physical limit whereas Sauron is much more ambiguous.",
        "This fight was so one sided it's not even a fair match up.",
        "Sauron vs superman",
        "Senator Armstrong VS Godfrey aka \"Horah Loux\"",
        "Sauron only loses if he is micromanaging entire armies and if they fight in Mt. Doom",
        "wonder why sauron have these super duper powers outside of his world xD",
        "It's amazing they can think of options how will Sauron can survive but for Vergil they didn't just to let Sephiroth win..",
        "Here's the issue though. You are basically comparing an angel/god thing to a man. An empowered man, but a man nonetheless. This was imbalanced from the beginning. Do Sauron vs Sargeras, that's comparable.",
        "There have been a lot of powerhouses throughout this channel, but this fight FELT the most powerful",
        "I like this episode but don't combatants have armies to command, this would be cool to see in a robotnik vs. Wiely style death battle",
        "Can we talk about how well animated these death battle fights are?!",
        "This should have been Sauron vs the nipple commander himself, The Jailor. More on par with each other canonically.",
        "was rooting for sauron, glad he won hes way more badass",
        "The funniest implication of this fight is that SpongeBob would beat the living crap out of Sauron, according to their calcs.",
        "did you really say Arthas sound like the name of a fungus? daaaayyyumn",
        "this is cool and all but the death battle i want to see is def Crocodile (One Piece) vs Gaara (Naruto)",
        "Sauron wins",
        "I appreciate the proper pronunciation of Tolkiens name",
        "When this fight was announced I was immediately rooting for Sauron he THE fantasy dark lord",
        "Hmmmm not so sure about this call. I agree that Sauron has more experience and is physically stronger, but I think two points get glossed over here worth noting;\nFirst, Sauron being able to fight as a spirit without a body and change and warp his own soul is a pretty potent flex that needs to be accounted for sure- but Frostmourne explicitly damages and slices souls. I feel like that is a counter to that defense and a hard one at that. Isildur managed to at least debilitate Sauron, separating him from the ring, by slicing off his finger with a broken and less powerful blade.",
        "Sauron felt weirdly like a protagonist in the animation. I'm not saying he seemed heroic, but like... the way he shows up as the aggressor, only to be repeatedly put on the defensive in battle.\nHe spends most of the fight going out of his way to counter Arthas's abilities, instead of being the one Arthas has to counter, except for when he turns into a wolf and later when he unleashes his anime super mode",
        "Quick question, why couldn't the Lich King had just cut the One Ring from off of Sauron's hand? From what the opening to the Peter Jackson films showed us, that was a one hit KO. And that was done from a non magical blade too!",
        "Why did I read this initially as liver king",
        "Every so often I think, oh maybe I should do voiceovers and narration. Then I hear someone like Phillip and ... nah I'll keep my day job.",
        "15:30 SKIP\n\n\nFIGHT TIME!!",
        "I like the ice vs fire theme of this fight.",
        "Now do Alleria Windrunner vs Legolas or Anduin Wrynn vs Aragorn.",
        "Such amazing fantastic",
        "Time stamps:\n0:34 Sauron\n8:45 Lich King\n15:30 Battle",
        "sauron leaving his body means he's dead and he need the ring to come back together, he can't do nothing while in eye form, otherwise all of the LOTR saga would have been pointless, this makes no sense... litch king would have kicked his ass",
        "The battle takes place at the site of the Frozen Throne, between two insanely powerful, soul-claiming Tin Tyrants. Whoever wins, both the world of Azeroth and the world of Middle-Earth lose.",
        "Please do Kratos vs Dante that would be brutal",
        "These guys look so badass also the battle was epic.",
        "They got so much wrong about Sauron and left so much out of the Lich Kings power set......",
        "Amazing what you can accomplish when you actually read the source material and stay true to cannon. Take notes Amazon!",
        "you guys seriously going shonen jump for the next episode? . . .Deku wins quirks aren't magic and Asta even with his brother's help anti-magics and swords he is still way more limited in his combat versatility",
        "I really like this scene. 18:23",
        "Grimgor Ironhide (Warhammer fantasy old world) vs Garrosh or Gromosh Hellscream (Warcraft/World of Warcraft)",
        "I have a recommendation\n\nArnold (Hey, Arnold) vs Arthur (PBS)",
        "As Randle would say. \"Eh not bad but still.. there's only one return and it's not of the king it's of the Jedi.\"",
        "This honestly makes me wonder why WoW never has done a LOTR collab",
        "Wow. I have an incredible new respect for the Eye of Sauron form",
        "You know I'm just sitting here wondering what the long term effects of eating the one ring might be",
        "I’d love to see the gremlins Vs minions ",
        "Seeing Deku in the next death battle:\n\nSeeing who he's fighting:",
        "Sauron is the literal embodiment of evil. He's has had thousands of years to plan out his evil deeds and build himself as the strongest MFer to ever exist, physically and spiritually, therefore he cannot be defeated by sheer power and magic. The only reason he was defeated was because of his own hubris, a lesson taught in Tolkein's work. Poor Arthus/Lich King could only do so much before he would be inevitably overwhelmed.",
        "Team Sauron! ",
        "Best pet is that the LKs power comes from his army, so if they fought with their army and themselves LK would win without a doubt",
        "This footage makes me want to play the Shadow of Mordor and War games again",
        "Gru vs megamind",
        "Ohio final boss next please",
        "That was one of the most metal things I've seen from Death Battle.",
        "if asta dosnt win ima be mad",
        "This debate needs to end once and for all and please deathbattle do this for a lot of others including myself!!\n\nTalion and celebrimbor (Shadow of Mordor & Shadow of War)",
        "Ah yes, nothing like watching two magical, evil-whispering warlords fighting and magically evil-whispering to each other while doing so.",
        "Given Arthas' fate in Shadowlands, this tracks.",
        "I actually would like to seeba db with unit 01  from the rebuild evangelion movies vs gipsy avenger",
        "Why Asta versus Deku? Deku’s not even close. Asta can literally travel as fast as light if not faster.",
        "No matter what happens, how old I get, what happens in my life, who comes in and out of it, these videos will always be here for me, and for all of us. Techno was a light that shone brighter than any other out there, and he was a real beacon of hope for many of us. I'm just very glad that he's resting now, and doesn't have to suffer anymore. Props to you, Techno, and as the saying goes, \"Technoblade nevah dies!\"",
        "Way closer than I thought it would be but Sauron still won.\nGotta give props to the Litch King though, didn't know about most of his feats",
        "Does anyone know the music that was playing during Sauron's Rundown?",
        "Sauron to get more screen time than in 6 movies combined ",
        "Ofc the clows have to make tarded calculations with  drawings and frames  ",
        "Chrno Crusade.",
        "...the heck kinda match is this? lol\n2004 WoW player here to say Sauron would use LK as a floor mop.\nBut seriously though, these are two different WORLDS here people.\nYou just don't mix this kind of stuff together.",
        "Nah the setup for Deku is crazy why you gotta just poop all over him like that",
        "Without a doubt my new favorite Death Battle!",
        "Damn, a battle between two evil overlords in menacing full armor. Nice",
        "God damn this one is the best Death Battles in a long long time. Maybe even my fave. Good job! I can see the animation and editing team put a lot of time on this. Great job!  ",
        "Ik its kinda stupid but I'd honestly love to see whitebeard from one piece vs escanor from seven deadly sins",
        "Welp, looks like Asta Vs deku is next, deku has some good feats, but Asta blitz and slams",
        "This was an amazing episode, Absolutely love both of these Dark Lords but the next episode is gonna be a blowout. \nBase Asta pre-training arc is faster than light speed, thats without the spade training arc, devil union, or zetten.",
        "Sauron is a powerful Lord of the Rings villain",
        "Basically a downgraded God vs a upgraded human. Kind of a obvious answer.",
        "To quote a certain incredibles character.\n\nTHAT WAS TOTALLY WICKED!",
        "The giant silly weapon club is looking STACKED today",
        "As someone who has fought the Litch King AND read LotR I can say this outcome is correct.",
        "Well this was pretty cool. And now it has me wondering which side would come out on top in an army vs army fight. Could the forces of Mordor similarly stomp the Lich King's undead, or would Sauron have to step in personally like he did against the Last Alliance to turn the situation back in his favor?",
        "The real Song of Ice and Fire right here! ️",
        "This is the most tamed comment section in the entire Death Battle series",
        "Sauron’s voice sounds like the love child of Noob Saibot and Baraka",
        "The Lich King: You serve me.\nSauron: I serve no one.",
        "The one wearing a stylish helmet will be the winner.",
        "one of the best action sequences in a DB, awesome guys",
        "This is one Death Battle I would love to see get the big budget treatment someday. No idea what would have to happen fictionally or IRL to make it happen but man, would that be cool.",
        "16:48 Me, a Lobotomy Corporation player upon hearing that someone will find Nothing There: !!! Terrified",
        "I honestly don’t know about the next matchup Asta is literally in the middle of learning new powers so this one might have to be a redo, since the power is not at its greatest atm if they include it",
        "@16:15 I thought the Nazgul would show up to fight those Lich King's spirits",
        "Wonder if the Jailer could beat Sauron. The jailer or Zoval in Wow has been around forever and is quite powerful. He made the Lich kings armour...well got help and then he controled it.",
        "So next time is: deku vs asta (MHA vs BC)\n\n\nI do not know who asta is and I don't know how strong he is, but Asta FTW",
        "\"Sauron, the Lord of the rings. The Lich King, Warcraft's Lord of the Scourge.\" Micheal Flatley, the lord of the dance.",
        "I'll be honest... that ended up being the most bad-ass Sauron I've ever seen. Fantastic and it really, really made it clear just how terrifying Sauron was.",
        "Nerdge time. This was amazingly entertaining... But during that fight, all Arthas had to do was instead of aiming for the head, aim for Sauron's hand and disembody the Ring.. it might have been anticlimactic to do that, and sure the fight wouldn't have been \"over\" but it would've been delayed 2000 years while Sauron slowly built back his form. The silly Maiar was significantly weaker in the Third Age after he built the Ring than he was in the First Age before he lost his Werewolf/Vampire transformations, and even the Second Age when he lost his fair form in the Flood of Numenor (Numenor, a human/half-elven nation that had such a mighty navy that Saurons army noped out of fighting, not so supreme a dominating will it would seem).",
        "Sauron wins, hands down. But man, the story of Arthas is amazing",
        "Those who fights well and seems to win first in a death battle always loses.",
        "Wow this was the most epic death battle so far! Amazing work.",
        "Sauron: I will rip out your heart.\n\nLich King: You will wind nothing, there.",
        "How do you even win against a being that even death wont accept..",
        "As cool as this was, my Tolkien fan brain is questioning Sauron's actual fighting skills outside of being a sorcerer because he still lost to an Elf and a Human in the last alliance and got his finger cut off... But epic animation though.",
        "Super Android 17 vs Amazo",
        "beautiful matchup!!",
        "Shadow of war Sauron and map",
        "As much as I was rooting for my boy the Lich King, I was hard pressed to think of any way he could have beaten Sauron. There’s just no beating the OG Dark Lord",
        "I always thought that Frostmourne breaking in game was specifically due to being struck by a holy sword of extreme power (Ashbringer), rather than just through sheer force. Still an amazing fight to watch and I doubt it would have changed the result.",
        "What the F#@K just happened?",
        "Badass",
        "Isn't frostmourne capable of sealing souls? Which Sauron would have any way to defend against other than his will? Also the Lich king is not just Arthus, it was is the fusion Arthus and Nerzhul... Also not using his army of the undead vs Sauron's Uruk? Missed opertunity. Pulling in non canon Sauron lore but ignoring/missing Lich King lore is a rookie move guys.",
        "I knew Sauron would win, but I was hoping the Lich King would. There must always be a Lich King!\nWait... Lich King Sauron... shudders",
        "A sad boi with a magic helmet vs a literal god.  Pretty surprising outcome to say the least",
        "Wasn´t the only thing capable of destroying Frostmourne a literal definition of light, the power Sauron doesnt have, considering hes a Dark Lord? Also, wouldnt Frostmourne at least severly weaken Saurons spirit by trying to absorb it all the time at least? I feel like this one is really compromised on based on the island stuff while it could go either way. I mean in game players whack up Ragnaros who creates stuff like MT. Doom by walking around and Sauron´s power is near unmesurable, (+ Frostmourne draws power from like, the Maw and literal gods- just like sauron)",
        "This battle wasn’t the most brutal but it was probably the most epic. Seeing Sauron get that win was so satisfying. Put respect on the OG dark lord.",
        "YEA! YES! A THOUSAND TIMES YES! A MATCH UP I HAVE ASKED FOR HAD Finally ARRIVED!",
        "Ok, WoW sounds so freaking nerdy",
        "I wish they would do more Gundam characters like Zeon's Red Comet vs Zechs from Wing",
        "Speaking of anime death battles, hope one day we see one including a Tengen Toppa Gurren Lagann character on here ",
        "And that folks is the reason why the LotR good guys really, REALLY didn't want him to get his jewelry back.",
        "Um, no. This is incorrect.",
        "NEVER!!! Sauron could never beat the Lich King!!",
        "This has to be a joke. People think this is one of the best Death Battles?\nSauron at the height of his power didn't have a physical body. It was the ring keeping him together. That's why he exploded after Isildur cut the ring from his hand. The Plague of Undeath would have done NOTHING to him, he never had to shapeshift into the Eye.",
        "T-T-THE ONLY REASON SAURON WON WAS CAUSE HE'S A FIRE/DARK TYPE POKEMON AND ARTHAS WAS AN ICE/GHOST TYPE POKEMON!!!",
        "how many times did you watch this ?\n\nYES? NO? YES? NO? maybe..",
        "By far my favorite death battle to date. The last half of the fight was epic.",
        "Why didn’t you have Arthas summon sindragosa or his literally horde of undead? But y’all gave Sauron the ring ok. It was over before it started this battle sucked.",
        "Epic matchup, clunky animation\nThough I am glad to see the true Dark Lord pull ahead",
        "Damn it next up is my two favorite anime's against each other",
        "Damn that was a pretty legit battle scene. One of the best ones so far.",
        "The cool thing to remember when watching this. This is sauron holding back since canonically if he took you serious, he preffered to end his enemies with his bare hands to humiliate you when youre armed, the mace was just for the movies to show how much more powerful he was compared to everyone else. Even morgoth used the hammer grond and was able to note saurons savagery. Also sauron lost his shape shifting after his first fall locking him in one form as a sign he could only destroy no matter how much he wanted to created something beautiful hence why his created language of black speech was harsh for everyone else to here as shown when gandalf spoke it at the council when forming the fellowship.",
        "Do mount lady from my hero academia vs annie leonhart from attack on titan.",
        "The next fight in a nutshell:\n\n'Stop! He is already dead!'",
        "SAURON REALLY WHOOPED HIS ASS AND TOOK HIS THRONE ",
        "Fantastic dialogue",
        "1v1 wise arthas would lose for sure, but army wise arthas would deffo have the upper hand in winning wars.",
        "In response to boom stick. Eating the ring the one move to feel it all . Makes Taco Bell diarrhea sound nice.",
        "I want Death Battle to one day do Anakin Skywalker (Star Wars) vs. Arthas Menethil (Warcraft)",
        "Arthas would easily beat sauron man. He's literally 2 guys with fighting experience, and literal power over death.",
        "How is this even a Battle? Lich King wins all day.  \n\nSauron was beat by two gnomes wearing junk loot and like 2 greens,  deleting a rare.    ",
        "It'd be kinda cool to know the Victor between Sebas (Overlord) and Sebastian  (Black Butler). Battle of the butlers ftw",
        "This was the most metal death battle ever. So glad it didn't come down to just whacking each other with their weapons. Few indeed could endure the eye of Sauron the Terrible.",
        "The Lich King is like the Night King on steroids.",
        "You ignored how death magic works in Warcraft, Arthas literally dismantles and carves souls along with spiritual bodies. Arthas can literally cut ghosts in half and kill them. I'm not saying the LK would of won regardless but you ignored like the entire magic tool kit he has. Arthas also beat Illidan who literally fought something that would of erased Sauron from existence.",
        "You should do:\nSpeed o' Sound Sonic\nV.S.\nMinato Namikaze",
        "Just a minor nitpick, but technically Sauron wouldn't have his index finger at this point, assuming you're using a version of him after he got the ring back.",
        "Damn, that animation, especially that final clash, is just god level",
        "Until tomorrow morning, Please!!!",
        "Imagine Cirno. Letty and Kel'thuzad shows up as Lich King's allies",
        "Thor vs kratos?",
        "I think everybody can predict the next fight’s winner, \n\nI love Deku, but the Gap between the power scale in the verses is WAY too wide. Asta wins with little difficulty",
        "How'd you do the math on this one? It took 25 wow nerds and Tirion Fordring to defeat the Lich King, but just 1 man with a broken sword beat Sauron by slicing a finger off...\nIt was an epic fight sequence though!",
        "arthas was upscaled for this fight .  Interesting",
        "It would be cool if you guys did a Death Battle with Lei Shen The Thunder King, he's also a character from World of Warcraft and is pretty strong.",
        "Only thing that could truly destroy Sauron is to cast the one ring into the fires of Mount Doom. And Arthas can die from... being killed.",
        "I feel like Fuecocco will be excellent for a trick room team in competitive play. I think itll just be a juggernaut with an assault vest equipped. Im so excited to use it :)",
        "What about Kratos vs general zod as a MU?",
        "Then agin the litch king wasn't really fight at full potential there I mean he controls the undead so we're tf is his minions lmao not to mention he controls a crap ton of raid bosses too and another litch that is super loyal to him",
        "Holy crap Gus reference??? These guys do their homework!",
        "Though I like both of them , I think an easy way to compare them would be the fact that in the world of azeroth there were a lot of strong characters able to wield magic or other unatural powers compared to LOTR eventaully sauron was defeated by mortals wielding nothing impressive but regular weapons and regular powers with a very few exceptions like ( the astari , aragorn , elves etc ) the lich king managed to become the top dominating power against multipule races just like sauron did but the difference here is that Dalaran alone holds probably enough power to kill everyone in middle earth. Also while both of them were terrifying to face 1 on 1 the peak of their power comes from their armies and domination , Sauron had to be crafty and deceitful to defeat the other races since he knew alone he couldn't achieve that and raising an army of orcs does require some time the lich king on the other hand just went on and killed everything that stood in his path and oftenly in much worse way since your troops are dying means his army is increasing",
        "i wonder if frostmourne could have contained ole 1 eyes soul if it had consumed it upon impalement as it tends to do that",
        "Now I wanna see Dumbledore vs Gandalf",
        "oh man asta vs midoriya the hype is finally real",
        "I wish you guys would do a death battle with Pennywise versus the violator from spawn",
        "\"You no longer need to take innocent souls with that wretched blade of yours. You no longer need to bear the weight of your crown. I have taken care... of everything.\" - Sauron",
        "Get rid of boomstick dude, everyone hates his voice and he's not funny. Literally makes us want to click off the video everytime he talks",
        "That second to last exchange between them was actually epic tbh\n\nSauron: \"I will rip out your heart \"\nArthas: \"You will find nothing there \"",
        "I'm a die hard LOTR fan. I was rly worried Sauron might actually lose this battle for a second. It seemed impossible but when I heard the lich king also had a continent feat I got concerned",
        "frt, these two characters are two of the best written villains in fiction.",
        "It was a 33.33 repeating the floors chance of survival for Arthas",
        "Who else is only here because of popularmmos",
        "You missed the Lich kings true power blatantly his true power comes in the undead armies he commands this is a Lich king win no contest",
        "Now I knew the ending... trying to compare Sauron to the Lich King is like trying to compare Golden Age Superman to anything (could sneeze solar systems away). But since Frostmourne can cut souls, why was it unable to cut Sauron, ghost form or not?",
        "Sauron vs Razor",
        "WOW!THAT' WAS A TRULY SONG OF ICE & FIRE!",
        "The devil verses a demon possessing a man",
        "The final episode of death battle \nWiz Vs Boomstick\nit would be an amazing battle it will be legendary",
        "well its just me or the winner was soo obvious?",
        "You guys should do Kratos vs Gorr the god butcher",
        "meager analysis, content for the sake of the fans of the most hyped franchise at the moment. At the very least, Frostmourne is a weapon that strikes the soul first. Mortal or immortal, it doesn't matter. This is the weapon of the halls of Death. Everyone is equal before him...",
        "ngl this was entertaining asf I wanna see more of these animated fights they are better then the typical tally vids",
        "Saruman vs Count Dooku we’ve been waiting for it for years!",
        "Do one of Swamp Thing and Man Thing",
        "One D.B. that would be interesting to watch, especially for me, would be...\n\nDevilman vs. Chainsaw man",
        "I'm hoping that next time Batman shows up on this channel he'll win for once\n\n(Posted after Kevin Conroy's Death)",
        "I’m not a huge fan of both LOTR and WOW, but I bet Sauron will win in this.",
        "Larfleeze vs. Ainz Ooal Gown.",
        "Fun fact: The only place where the Lich King can actually be defeated on is the Frozen Throne.",
        "Bro they did not have to do popularmmos like that ",
        "SHAZAM VS VEGETA.",
        "I rlly to see Gravity queen Kat from gravity rush in a death battle",
        "When Lich King shouted \"IMPOSSIBLE!!\", it just reminded me of just how masterful the voice acting in this death battle is. This show is a treat.",
        "Honestly Shadowlands brought more context to the powers of the runeblade itself which wasn't included in the video. however, determining the ability to dominate a soul and resist domination is a difficult problem to solve when involving different universes so I'll take the \"physical power wins\" answer. though put simply the frostmourne is actual built to deal damage to souls not just dominate them, which wasn't shown. ",
        "I think it wasn't investigated what the runes on frostmorn really are. They come from the Maw, the literal place that tortures and destroys the most evil of souls. We've also seen blades with those runes harming spirits that are the most powerful in their perspective shadowlands, meaning that frostmorn would actually give the edge to Arthas when Sauron went into the wraith form.",
        "One fight I really wish to see is Kratos vs Dante.\nThis one got me curious.",
        "That was a great one. Really loved it. Thanks!",
        "\"ill tear out your heart\" \"you'll find nothing\" ",
        "“I serve no one!”\n\n\n\nGod that line gave me the chills",
        "But the biggest question of all is: who would win in a 5 man free-for-all between the scooby gang. Fred with his planning, traps, and versatile skillset, Daphne with her toolbox of fashion-themed tricks like picking locks with hairpins, Velma with her vast intellect, Shaggy with his speed, creativity and mindgames, or scooby himself with his human-like intellect in the body of a great dane able to leave nasty bites.",
        "Arthas pulling out a big Observer wards lmao",
        "You want to know the scariest part about Sauron?\n\nHe dominated this fight, but never raised his voice once.....",
        "That second to last exchange between them was actually epic tbh\n\n\n\nSauron: \"I will rip out your heart \"\n\nArthas: \"You will find nothing there \"",
        "Given Arthas's propensity towards picking up cursed artifacts and Sauron's propensity for making them, I'm surprised you didn't have Sauron try to make a ring to enslave Arthas.  There is a chance that Arthas could have resisted the control like he did Nerzul, but I still figure Sauron would have tried; it seems to be his MO.",
        "Did I tell you how much I love this?\n\nWell, I F*cking LOVE THIS!",
        "Bane vs Crossbones!",
        "Werewolf sauron form awesome",
        "This is one of the best Death Battles ever\nA future death battle should be Miraak vs Eredin (Skyrim vs Witcher)",
        "The fight is cool and all, but none of what happened here was within sauron's capability. What made Sauron effective is his minipulation, not his combat ability. And the things he could do here he cannot do instantaneously, corrupting and reshaping beings takes time and he would need to apply his own \"soul\" to do it, which is why the ring being destroyed took much of his power away, a large part of his soul was destroyed with it. Warcraft magic has no such limitations requiring to use life essence or your own soul to perform the things done here.",
        "top notch production on this one boys. Arthas is my favorite Warcraft character but if he had pulled off a win here against Sauron I would have been upset. The two simply aren't in the same league",
        "Litch King reminds me a lot of the Witch King of Angmar in LOTR, they are very similar, both were mortal men made powerful by a god... The Witch King serves Sauron, so its no surprise the Litch King stood no chance.",
        "Preservered lol",
        "Good video and very interesting",
        "NGL, I couldn't see how the Lich King was going to even come close to stacking up with Sauron, but damn, that was an exciting battle.",
        "All I want for Christmas is Jack Skellington vs The Grinch! PLEASE!",
        "Guts (berzerk) vs Eren Jaeger (Attack on Titan)",
        "Chrno Crusade in DEATH BATTLE!",
        "a good followup would be Sargaus vs Morgoth that would be awesome to see",
        "Wait a minute, wouldn't frostmourne absorb Sauron's soul after it left his physical body?",
        "Dear deathbattle, can you make a gandalf vs. Dumbledore? I would like to see you make it... that would be highly appreciated..",
        "This death battle is for the super nerds from back in the late '80s early 90s people that were bullied by kobokai",
        "Sauron claiming he serves no one is really overlooking some important lore, but, I assure you, the Lych King is no Morgoth.",
        "This was definitely a death battle where I was pleased by the outcome. This was definitely a close one. They were both iconic and famous Dark Lords of the Fantasy genre, but Sauron just outplayed the Litch King. I mean Sauron's power is just more powerful than the powers of The Litch King, and was slightly more durable, plus since Sauron was around longer and had more experience he definitely was a greater threat than the lord of The Scourge. This was definitely a good fight, a battle definitely worthy of being one of the best out there as well as being a great clash between two powerful and iconic fantasy villains. Honestly The Litch King gave a valiant effort and I'll always be a Litch King fan...but he just couldn't outmatch the awesome might, enduring spirit and millennia of treachery of the dark lord...Sauron. Plus, I Sauron is the grandfather of fantasy villains...I really couldn't see this fight going any other way. This video was posted during my early recovery period after my jaw surgery and I've finally gotten to watching today and it just gave me some joy to watch one of my favourite series...so thank you.",
        "Can we appreciate that at least one person at Death Battle had to actually read “The Simarillion” to get some of this information?",
        "Omg!!! Sick animations and dialogues! Arthas is one of my fav villains, kinda knew he would fell to Sauron, but still he gave an amazing fight  thanks guys!",
        "I feel like Arthas woukd win a 1v1 but just imo. Fan of both.",
        "Wrong you need 25 man raid for Lich King and only 1 chic for Sauron",
        "The explanation of Sauron was better than the whole of Rings of Power",
        "The one tiny loophole for Sauron returning besides Morgoth's return.  Is Mt Doom, it's been revealed that Morgoth actually created Mt. Doom and several other locations as a power generator of sorts.  Which is why Sauron made the One Ring at Mt. Doom, so as to suck up as much of that energy as possible.  The thing is Mt. Doom is still generating dark energy, so after a long enough period of time Sauron, could in theory use it to come back, again.",
        "Wow, one of the best death battle so far, thank you :)",
        "20:37 \"When compared to the Balrogs & Illidan, Sauron & the Lich King could both reach high hypersonic speeds of around Mach 30.\"\n\nIn what world do these two ever move THIS fast? (Sauron, in spirit form, MAYBE, but in physical form? No chance is he moving THIS quickly)",
        "DOOM GUY VS KRATOS \nLove you guys! Keep Going",
        "....O MY GOD ...This BATTLE a LEGEND!!  A Two Necromancy Battle  Fighting for . Mental mind...and winer is.. Sauron. And we're interesting  the booth has a magic powers \"Shadow\"",
        "While I'm glad to see Lord Of The Rings finally make this I've sent a suggestion of Gandalf versus Dumbledore for the past 3 or 4 years. ",
        "Anyone who understands what Sauron is would know that Arthas never stood a chance. Lol",
        "The real challenge is... can Sauron solo the Lich King raid boss?",
        "Okay so 1 thing. Are they gonna be using the manga feats for Asta and Deku?\n\nAnd I'm sorry I have to say this. Someone please explain to me why we didn't get Tanjiro vs. Asta and Jonathan Joestar vs. Deku.",
        "Really excited for the next battle. Two of my favorite characters and honestly don't know who will win",
        "Can't help but give it to Lich hands down.... I like sauron but can't see how he has a chance...",
        "Deku's getting stomped. He has no chance. Thought it would be boruto vs deku when deku was shown.",
        "YES! I am so happy that you guys actually listened and brought Lich King into a Death Batlle.\nNow please make a death battle with Anos Voldigoad ( The Misfit of Demon King Academy )\nThat is going to be one of the most OP and badass Death Battles of all times!!!",
        "DB boutta start a war for the ages with the next death battle ",
        "This is what I wanted, great battle",
        "Deku is gonna wipe the floor with Asta in the next Death Battle!",
        "Actually Frostmourne waasn't shattered because Tirion used Ashbringer. Frostmourne was shattered cause the literal entity god of azeroth \"the light\" helped him. That mace shattering Frostmourne is bs.",
        "Actually, I half expected the Lich King to cut the ring off Sauron's finger.\n\nThe fact that this didn't happen shows how much respect the Death Battle team has for the character Sauron and on the other hand it doesn't diminish Isildur's performance.",
        "Honestly, individually these combatants are not super interesting. What I would love to see would be something like combined forces - the entire Scourge invades Mordor.\n\nNow THAT would be some amazing content.",
        "I think everyone knew Arthas didn't have a chance.",
        "I knew noob saibot would beat ermac good match",
        "And yet a human took out Sauron with a single lucky strike",
        "Arthus also killed A dragon of creation,  frostmourne could cut through SOULS, and increased strength the more souls taken in by it. He also killed high end demons.",
        "i should fight one of them...",
        "One thing I take away from this is that the names people make up for high fantasy characters can be sourced from the names of drugs.",
        "sauron sitting on the frozen throne is so badass",
        "so basically this was a battle of a human turned evil while obtaining crazy magical powers and can be taken down by normal means, vs. someone that doesn't really have a physical body and can only be beaten if his ring was destroyed. Yeah I call this a one sided match as it was a no brainer that Sauron would win. This is basically Deadpool vs The Mask all over again which if you guys are going to pit someone that can only be beaten by crazy conventional means or can't be beaten in any given way against a regular person then it just looks lazy. I mean Link vs cloud is a good example of how you guys used to be and how far you've fallen since then.",
        "Now I want to see Lord's of the Ring again",
        "I love the voices of these two.",
        "Maybe it should have been The Witch King vs the Lich King. Sauron is on another level. It is like pitting him against Morgoth.",
        "No body Can beat our boi Sauron!.",
        "Who wins between Emperor of Mankind and Sauron?",
        "Hype for asta vs deku. I personally would have done boruto asta cuz that’s a bit closer, but I definitely don’t mind seeing deku die",
        "I always thought it would be Sauron with the One Ring versus Ganondorf with the Triforce.\nBut Sauron vs Arthas is okay.",
        "Can you do danta (devil may cry) vs rayden (metalgear)",
        "LOTR deserves more representatives in this show. There's so much to do with that franchise. Also, this episode is so good, that this is the best 3D episode so far this season. 9/10",
        "One thing about Sauron and his defeat: \nFrodo didn't overcome the rings temptation. Frodo didn't succeed in destroying the ring. If it wasn't for Gollum *slipping on a rock*, Sauron would've gotten his ring back. Someone might correct me but it is believed that Eru himself made Gollum slip, so the only thing that defeated Sauron in the end was another act of God.",
        "yeah I really can't see anyone killing Sauron in a face to face.  Loved this episode.  Epic",
        "you guys should do a Death Battle of Meliodas from Seven Deadly Sins VS Asta from Black Clover! ",
        "Arthas did nothing wrong!",
        "Definitely would love to see Goku vs. Sailor Moon",
        "Now after watching this, I now have my own choice of who would be in Death Battle... The Dragonborn vs The Tarnished. Who's with me?",
        "Lord of the rings WINS KO",
        "Both of these characters are unbeatable unless the fight occurs in a certain place, and that place only exists in their respective universes. We'll see how DB solves that issue, or if they ignore it.",
        "We need a final Mortal Kombat fight between Scorpion vs. Sub-Zero.",
        "I love the Lich King but this fight is so one sided . Sauron takes this easily",
        "Now do Trigon (DC / Ravens Dad)",
        "This is like putting a Stormtrooper against a Space Marine and having the Stormtrooper win.",
        "The Invincible does not drop even for Sauron and who am I to complain?",
        "Arthas never had a chance against Sauron, they're on completely different levels. HOWEVER, a group of 25 geeks did NOT defeat the Lich King. The players lose at the end of that fight and the only reason they even got that far in the first place is Arthas was testing their worthiness to become his new army of Death Knights, Tyrion had to catch him by surprise while he was focused on killing said 25 geeks to defeat him.",
        "Gabe Logan vs Sam Fisher vs Leon",
        "I mean The lich King would probably win since he cannot die for real. He can only be sent back to the Jailer who can forge him a new. Morgoth can’t make another Sauron.",
        "I've wanted the next death battle for so long omg",
        "Makes me proud to be a dragon in that universe.",
        "Before watching this battle I'll just say...I have no idea how Sauron stands a chance. If you look at the LOTR from an MMO standpoint Sauron had trash mini-bosses and to kill him was basically an escort quest. The campaign through the whole trilogy was so weak, only one main NPC died at that was Boromir. No one else of any consequence even came close to death. Where is this nerd rage coming from? Ever spend a thousand gold respecc'ing from tank to heals to dps and back just to get your guild through the first 11 bosses only to get to the Lich King and WIPE because of a freaking BUG??? Sauron is nothing compared to  shoddy development and what's worse.....I hear Classic is bugged too. SMDH",
        "As much as I love Arthas I gotta agree with this outcome, he just doesn’t stand a chance against the Sauron. I think a better match up would’ve been The Jailer vs Morgoth",
        "I miss the lich king.",
        "LOTR characters in the books are insane",
        "Bullshirt",
        "So... soooooo... BADASS. This was one of my favorites ",
        "Well, we have Super Sauron...\nWho's the next overlord so we can get Super Sauron 2?\nOr pit some divinity against him so we can get Super Sauron God.",
        "17:40 I serve no one",
        "It’s one of the most coolest fights ever made. Both Sauron and The Lich King are definitely the coolest battle ever,but one of them is going to win and his name is Sauron.",
        "Y’all know Melkor comes back right? Suaron wasn’t more clever or powerful. Heck, Melkor made the entirety of Arda his ring. Also: Eru (god) destroyed Sauron’s “fate beautiful form”. That was the intent. If Eru wanted to, Eru could have snacked up Sauron’s soul.",
        "Gonna be a lot of but hurt mha fans if Deku loses.",
        "Don't worry, fellow WoW players, the Jailer planned the whole thing millenia ago.",
        "Please Death Battle....Moaui from Moana vs Hercules from disney \n\nAlso Minions vs Rabbids!",
        "I knew Sauron would win the match even when this video was announced before going against The Lich King",
        "Would love a Death Battle style Weapons/Items series. Like, they could animate Training Dummies that are given weapons/Items [ones that are comparable] and they do challenges (similar to forged in fire lol) and at the end of the video would be a fight to the \"death\" [if it's weapons]",
        "THIS IS THE VIDEO I'VE BEEN WAITING FOR ALL MY LIFE!!! I DIDN'T EVEN KNOW THAT I WANTED IT! BUT I WAS BORN TO WATCH IT!\n\nBuuuut, the outcome was kinda predictable.",
        "Sauron: \"I serve no one!\"\nMorgoth: \"can you repeat that?\"",
        "There could be only one outcome here... SAURON.",
        "This fight has the energy of two Max-Level Edgelord D&D PCs duking it out and I'm here for it.",
        "And Naru is somting like a God",
        "asta absolutely STOMPS deku.",
        "Do saitama v goku",
        "So we all know dekus going to win right???",
        "Some things here are iffy with me about stats they used for sauron but their little box info that they use to show more stats while they talk was  wrong I'm 90 percent sure that it's cannon that dragon fire was power than powerful enough to destroy the ring as it attacks the enchantments placed on things as well as brute force as that's how smaug was able to breach erebor in the first place",
        "I really want to see a deathbattle between wizz and boomstick",
        "Deku vs Asta....\nWas hoping for Mirko vs Yoruichi,\nNot that it can't happen though....",
        "Meh, Lich King just forgot to go through his Frost DK rotation for high DPS",
        "Best fight of this season easily",
        "this was epic! Wish they had fought with armies though",
        "I never knew Sauron is left-handed.  Huh, neat.",
        "I want to see kil'jaden vs Devil Jin",
        "So, I'm guessing next would be Morgoth vs. Zovaal? Lol who am I kidding, Morgoth will wipe the floor with Zovaal in mere seconds; if 25 players could do mythic Sepulcher, Morgoth would solo the whole thing with ease.",
        "WHATTTTTTT OMG OMG OMG OMG THAT WAS Awesomeeeeeee",
        "Silver and Gold (GOLGO13) vs The Plague (Hobo With a Shotgun)",
        "One question though. When did Illidan beat Guldan? He killed him off, sure but he kinda stole a win there xD",
        "That was a sweet battle!  The animators did a bang-up job with this one.",
        "What do you expect? Fire beat ice",
        "The biggest problem is Sauron's VA is passable but not really all that good. He sounds like a generic  evil guy\" without any of the deeper voice work, as limited as it was. The films did.",
        "I had always hoped for the Lich King to appear but to fight Nightmare from Soul Calibur, since their stories are very similar... and their look too",
        "Bruh..Even WoW cosmology is much bigger than Game of Thrones Cosmology..Don't see in feats,See in lore.\nSauron in cosmology is even nothing in all primordial god in Game of Thromes lore,And arthas already beat Ilidan which scale as outerversal.",
        "Even if this fight was \"inaccurate\" (which I don't think it was) you have to admit, it's still a pretty cool fight scene.",
        "Sauron closing his hand and erupting the mountains nearby, and the instantaneous temperature change evaporating all the snow on the other peaks really set the tone for how out of his depths The Lich King was.\n\n2 minutes into the fight and Sauron has turned the Lich King's resting place into Mount Doom.",
        "That's my man sauron",
        "Damn.. we could call this battle A Song Of Ice and Fire. ",
        "Can't wait for the Second version of the video where it's a Death Staring Contest",
        "Asta win",
        "Sauron wins because his eye is on the high ground",
        "Bro Deku wipes the floor with asta, it’s not even close",
        "Did they grab the quote \" I will rip out your heart \" \" You will find nothing there \" from somewhere? or did they came up with it?\n\nCause DAMN that's a sick exchange",
        "WHERE'S THE \"FROSTMOURNE HUNGERS\"",
        "do a golden bat death battle golden bat is one of if not the first super hero ever made",
        "This is EASILY the best animation I’ve ever seen on this channel.  You guys went above and beyond with this matchup.  Great job!  Your animation skills have come a long way",
        "Red Zaku (Gundam) vs Volkein (Gun x Sword).",
        "Yeah okay when the lich king throws a playfull snowball \"is this an late april fools joke?\" C'mon guys put some effort in.",
        "Really? An very powerfull sword just get destroyed by a freaking mace, ok. Pretty sure you know why Frostmourne got destroyed. Because Arthas unleashed all of collected souls, and therefore it needed to be struck with the Light, to be destroyed. And btw, that spell of unleashing souls just kills everything in the game, so, even if itd be weakened in fight, still, my opinion that Sauron and Lich King is equal",
        "Bout time one of these fight made a little sense and have a rightful winner",
        "Nice ",
        "Looks like All Might is going to need a new successor ",
        "I wanna see MCU Thor vs GOW Ragnarok Thor",
        "Thumbs up",
        "The actual fight was so good I had to immediately rewatch it.",
        "Can you guys consider a Spider man battle royale with peter, noir, miles, Gwen, Miguel, and peni",
        "The scene where Sauron casually erupts a mountain and turns it into a volcane is absolutely badass.\nSauron shattering Nerzhul (yes Nerzhul, not Frostmourne coz its literally one powerful spirit being destroyed by another more powerful one) was equally badass.\nThe director did a fantastic job with this one. So many great moments and scenes!",
        "\"Now... I'll tear out your heart!\"\n\"You will find nothing there!\"\n\n\"You serve me now...\"",
        "nice vid!\nhelps to show just how dumb Amazon is as well. these 2 fellas made a 7 minute run down of what people would have actually wanted for a lotr prequel",
        "Gambit vs Nightwing.",
        "can u guys do zeus vs odin from god of war series next",
        "That was such a sick fight.",
        "Sauron may destroy by because sauron ghost is kind of nothingness to sopport a fight but \nWhen he gonna posses by using its temptasion skill \nCause he definitely \nConquer his soul just like the old lechking",
        "So ... we're going to ignore that Frostmourne can hurt souls and instead focus on the plague? I mean, yeah LK prob would have still lost, but c'mon.",
        "Sauron:” Remember the nine kings of men?”\nLich king: “no.”\nSauron: “funny, because that will be same response I get when I ask those worthless peasants about you.”",
        "Even as a total Lichking fanboy I got to admit, you cannot defeat Sauron with a dark heart. The one ring is just too much of a bad ass artefact compared to Frostmourne.",
        "Sauron better put on the helmet and become the next lich king or the undead will kill us all ",
        "Feels like the same guys that animated the Jason vs Mike fight....excellent.",
        "So Sauron can get his fingers cut off by a mortal but the LK can't do it? Cap Arthas would dog walk any physical form of Sauron.",
        "As a fan of Warcraft for 2 decades, I unfortunately predicted the result ",
        "I read that frostmourne not only steals souls but the memories and abilities of those it steals and arthas was not the first lich king so I think we need to go back in time although I don’t know the entire history of Warcraft. Arthas in your video didn’t have an army of dead including frost wyrms let’s talk about it",
        "The voice affectation is a lil grating",
        "Sauron only won because fire is super effective against ice",
        "\"You serve me now\"\n\"I serve no one\"",
        "It is very clear how insignificant Arthas was before the might of the mighty Sauron, he just doesn't realize it yet. \n\nso Epic.",
        "100% Arthus whoops Sauron’s ass. Hell I actually think he’d slap Gandalf… and that’s just terrifying.",
        "Glad that Sauron's cunning got mentioned. Against Denethor, his ability to directly affect a person's mind failed... which might have undone a pulp-villain, but Sauron just changes over to deceit and illusion, tricking Denethor by the content of his 'visions' (which had otherwise been accurate) rather than assaulting him directly.",
        "If it was dumb one on one battle then obviously lich king wins. That is not even a question. The whole lord of the rings trilogy is about sauron being already defeated, yet hidden in his tower still plotting and slowly dominating throughout lies, deception, corruption and gathering power.\nNow if it was a battle of wits, where both entities would sit on thier respective thrones, gathering power, armies, champions etc. that is where Sauron would shine.",
        "LOL this isnt  even going to be  a close match",
        "I'm just gonna add my tiny voice in here, but I am very disappointed in Rooster Teeth. Homophobic and toxic work environments is not something I can support. I'm out.",
        "Ay we need an illidian Death battle now",
        "ghost vs skeleton. Ghost won!",
        "Isn't Sauron supposed to be 10ft tall?",
        "Brooo why deku vs asta, asta would open deku like a can of beer and toss him to the side when he’s done with him and this is coming from a guy who absolutely loves mha, this is a absolute aqua man vs SpongeBob stomp",
        "Darkseid: \"I like your chair.\"\nSauron: \"Thank you, same here.\"",
        "Once again LOTR is THE #1 fantasy of all time",
        "The graphics on this death battle duel are the best I have seen on the show so far.",
        "Can yall do kratos vs superman",
        "Mordekaiser solos",
        "The 1 big thing that the Lich King and Sauron have in common. Having huge armies.",
        "Okay as much as I love World of Warcraft and the lich King, when I read who is fighting who I thought it was going to be just one giant smackdown with sauron without any trouble. I mean essentially he's damn near a god compared to the lich King who was merely just a possessed human",
        "I knew Sauron was a boss, but I didn't know he was THAT boss! That was AWESOME!",
        "Lich King: You will serve me! Sauron: I serve no one! Morgoth: Sauron:",
        "Sauron melting the frozen throne and Northrend is so satisfying ",
        "THIS WAS SO GOOD! Really showing the power of hard work and dedication. Very exciting! I’m also excited for the next one!",
        "Literally everything but the animation was great lol",
        "Had an Exalted game running where a friend was a piece of a Solar Exalted who was previously Sauron. Sauron was saved, from a primordial, by his lover being split into pieces. The only way to get himself whole was to gather his fragments. Only way to do that was dimensional genocide or a lot of ground game killing specific heroes. So he had other fragments hunting him.",
        "I wasn't sure on the outset, but when they showed Sauron take a god's attack to the face and still stand, that kind of clenched it in my mind.  No skin in the next Death Battle.",
        "Literally the only way Sauron could lose is if Sauron's ring fell into the Mount Doom he foolishly summoned for some reason.",
        "This was awesome.",
        "Let's Go! Sauron Team!\nEdit: Now I Am So Happy They Left Sauron Wins",
        "I want to see all death battle winners vs DarkSeid",
        "Please, I wanna know who would win in a fight between Baba Voss (See) and Daredevil (Marvel).",
        "so this death battle was cheating Sauron being a a unkillable god when hello cant have unkillable people in death battle thats cheating angel or not sauron should have lost his holy powers or etc since he became truely evil no redeemable anything he is like satan Gandalf is like jesus/god who erases evil",
        "Sauron's one ring cannot be destroyed intentionally, only by accident or the ring's own machinations.",
        "Anybody nearby must be freaking out about the weather lol",
        "Great vid. I'm a huge Warcraft fan and was rooting for Arthas. However, I would guess Sauron is the superior dark lord. Arthas is from mortal origin afterall, and considering Shadowlands lore, a wayward pawn of the Jailer. Most of the Lich King's might consists in his army, which i would think is superior to Sauron's. But again, on a 1x1, Sauron with his demi-godly origins should win.",
        "I’ve always wanted to watch the Lord of the Rings, and I saw this video and saw the thumbnail and thought “oh those guys look awesome let me watch this video” I guess I just spoiled myself smh",
        "The Original cannot be defeated by a Copy.",
        "Bro sounds like noob saibot",
        "I love this one! Sword vs Mace. Fire vs Ice. I knew Sauron would win. I am truly pleased that more literary characters are being added. I hope trend will continue. I do have one question. What would be a good opponent for Monsterverse MECHA-GODZILLA?",
        "Their dark evil voice acting is perfection",
        "should have be arthas vs lord soth",
        "You made a mistake with the lore that I am obligated to highlight. The heroes did NOT succeed against The Lich King. At the end of the fight, everyone dies. The Lich King kills the 25 heroes and gives a monologue about how Tirion Fordring delivered the greatest fighting force the world had ever seen, and that he was going to raise them as undead to serve him. It literally took a miracle from The Light to shatter Tirion Fordring's bonds so that he could get a lucky strike from behind, and for the ghost of Arthas' father to resurrect everyone to finish the job, all the while the spirits of the people Arthas/Lich King killed held him in place. Basically, it was a cascade of miracles that defeated The Lich King. Even still, I do not belive that this detail would have changed the outcome of the battle.",
        "Can we please have death battle winners battle eachother? There'd be some super cool match ups!",
        "They used The Lich King's Heroes of the Storm model and Sauron's Shadow of War model. Nice. I'd have preferred the Lich King's cinematic model and Sauron's movie model, but this? This allowed smoother animation. And therefore more awesomeness to happen.",
        "sauron's conceptual weight is far too great for anything that is mortal or at least once was",
        "OK, you posted on Twitter about talking about a match up with Kamen Rider Ichigo, but since it was just DB-CAST, that'll probably NEVER get seen here.\nKind of disappointing and totally got my hopes up. Seriously, feature a Kamen Rider in Death Battle. Ichigo, Black-RX, Kuuga, Decade, OHMA FREAKING ZI-O. One of them, please!",
        "If Loki and Satan did a fusion ",
        "Its like watching Narutoad and Sasuki fight, but quietly.",
        "Unfortunately, Sauron did not take into account only one thing that the Lich King had hundreds of millions of dead and without the Lich King the Scourge Army would become uncontrollable and his faithful servants mighty creatures from different worlds And each of them is stronger than the other, and they definitely won’t forgive the death of the ruler, they will come and take revenge!",
        "Another great fight! \nI have some fight suggestions if you're looking: \n- Katara (Avatar) vs Juvia Lockser (Fairy Tail)\n- Eli Shane (Slugterra) vs Whisper The wolf (Sonic IDW)",
        "Are there any plans for Sauron VS Voldemort?",
        "God of war Zeus vs god of war Odin who would win in a death battle of what we’ve seen in the games",
        "So the lich kings helmet couldn't figure out the ONLY ring he's wearing that does something op each time he clutches his fist wasn't his weaknesses. I smell bs",
        "waiting for the bald king reaction",
        "Well Sauron actually was right about his power being irresistible in the end, the One Ring was only destroyed by accident because of two people fighting over it.",
        "I desperately want a Megaman X vs anybody type of Death Battle :( please make it happen",
        "43,000 thumbs up and No thumbs down?  I yield..\nI'll probably never watch 'Ring of Power but I could watch this all day",
        "umm good video but if i am not wrong sauron can rebuild his body at instan it requires  1, 10, 100 years each time he was hurt o defeat",
        "Lots of missed stuff on both sides. I could have seen either winning just for the fact that they each have a \"counter\" to the other. You can't dominate Sauron and Sauron can't dominate LK because of the Jailer. Sauron can have no body and be a spirit yet Frostmourne literally attacks the soul and spirit and consumes it. Sauron is bound to the ring and LK to the sword and helm but mostly the sword. LK also uses tons of undead but you could argue Sauron has the orcs so I guess is equal. Sauron's armor and weapon aren't special to my knowledge. LK has stronk armor and soul rending sword. Sauron uses fear as a huge tool in fighting, but you can't fear a being with no soul. I think LK wins ONLY because he seems like the perfect match to counter Sauron. But Sauron is basically a demi god so I get it.",
        "Great fight, sound effects were great and these guys are awesome villians, but fellow needs remember finer details, they skipped some stuff of time. Sauron, after the sinking of a 3.9 quadrillion island, was unable to keep his shape changing even with the one ring. Thanks to God after that plan was washed away, he was reduced to his physical body. PERMANENTLY no shape changing, just old fashioned...everything else. Still crazy powerful though.",
        "It's like fire vs ice",
        "Do a Sung Jinwoo video, also do another Spawn, Doom slayer or Kratos video.",
        "It's about time we had a Warcraft rep on the series, and I couldn't have asked for a more perfect pick.",
        "Arthas could have just cut off the ring finger and claimed the ring for himself.",
        "I thought Lich King's Sword can easily clapped corporeal beings?",
        "cut off his ring\nalso the sauron \"ghost\" form needed to be built over time and was technically summoned by multiple people, he can't just switch between whenever he wants, also its mentioned that even when in his \"ghost\" form he still needed to by his time and build up his strength.",
        "\"And by this point, he was just done. Like, with everything. We've all had one of those days, right? Where you see all of humanity as so pathetic, they can only be saved by just killing 'em all, so, you rip out your own heart.\"\n\nAh yes.",
        "I feel like Lich King vs Mordekaiser would have been a FAR more fair fight.",
        "Just gonna say it, Arthas did nothing wrong",
        "Can you do a death battle for meliodas vs rimuru if you can",
        "The supremacy of Sauron!",
        "Overlord from the game Overlord will win! Because he has a female harem, a tough jester and loyal cute henchmen! They don't even deserve his sweat! Miserable bastards!",
        "\"... but by the most unlikely creature imaginable:  Elijah Wood.\"\nI can't stop laughing.  ",
        "hats off to whoever did the linework for this one, My God....",
        "Death Battle: Stuart Little Vs Remy",
        "Sauron:There's No life in the void\nArthas: Dude I gave up everything so I can become this thing to conqueror Azeroth so that I can ready it for when the voidlords come from the void....",
        "Sauron defeats the great value Sauron mimic. Who would have known. Lol.",
        "Boomstick has now canonical ate the one ring lol",
        "Knew that would happen",
        "\"It's like if Loki and Satan did a fusion battle dance\"\nChristians already did that, Boomstick",
        "wonderful video",
        "i thought of a weird match up. proto saber(fgoac) vs vergil. i just think it would be funny.",
        "Sauron couldnt even conquer one chunk of Earth. The Lich King was in a world filled with beings who conquered planets on the regular. Lich King wins by a mile.",
        "Sun god Nika vs Bugs Bunny",
        "Looks like the Lich King just couldn’t take the heat",
        "I knew it had to be, there’s no other outcome.",
        "You should do Human Torch Vs. Firestorm",
        "Yes, yes i know who would ever make a third comment cringe yada yada yada but hear me out or read this, whatever you can get what i mean\n\nSauron Vs. Castlevania Dracula.",
        "I'd have to disagree.. Lich King had home field advantage.",
        "Start: I call Lich King",
        "I'd love to see Optimus prime fight someone or something again",
        "To put it simply, Ner'Zhul is just a powered up spirit. Sauron is a literal Deity, on par with Archimonde or even higher since he played a part in creating the universe.",
        "Ephialtes vs gollum",
        "ME: BROS CAN YOU INCLUDE MORE ADVERTISEMENTS?!?!\n\nDEATHBATTLE: HOLD MY BOOMSTICK- -",
        "Arthas couldn’t resist the call of Frostmourne, couldn’t resist the Helm of Domination. Cursed magical items are literally his number one weakness. Sauron could have just dropped the ring in front of him and it would be over.",
        "That was an awesome battle",
        "They really used a significantly weaker version of Arthas, who was also having his power siphoned away, to scale his over all power….this is some old death battle logic.\n\nRegardless the fight was pretty cool, but the scaling is definitely off.",
        "Cthulhu vs Godzilla",
        "While I did expect Sauron to win, i have an issue with the way you portrayed the battle. Sauron was mortally wounded, but gave up his physical form and was fine, sure. But Frostmourne is a soul stealing blade. Wouldn't it be super effective against a spirit that takes physical form?",
        "Wait next fight is going to be gogeta vs vegito ?",
        "Really fun video guys, enjoyed the effort put into the videa  + the knowledge / research you  guys put in",
        "WTF after third thime watching WTF",
        "The animation for this one is just so dang good. That fight was so cool!!!!",
        "You guys are doing way good and usual I like that",
        "Both guys are my favorite but part of me was rooting for the Lich king and the other for Sauron",
        "I just thought of an awesome death battle it's just hit me when I was playing the new Batman game since you did something similar with the Mega Man's they had all them fighting each other why not have all the people that was ever Robin fighting each other to see who is the ultimate Robin I think that will be pretty good to see if you can do it",
        "12:21 You can hear, there in the silence, the exact moment Droid realizes he gettin cancel'd.",
        "DIABLO VS A BALRAUG  LORD OF THE RINGS",
        "Lich King can literally rip out Sauron's soul via Frostmourne. Plus he can create death gates to bring any of his forces to bear. More often than not, Sauron would lose this fight.",
        "Asta vs deku is gonna be such a good battle. I've been waiting for them to do that, even if asta does stomp",
        "These Would Make Great Death Battles!!!!\n\n1.Princess Merida (Brave) vs Wreck It Ralph (Wreck It Ralph)",
        "Congrats to my good friend Ryan Solis for his wonderful voice acting for Sauron.  You were amazing!",
        "More than how these two compared to each other, I wonder how they compare to Malthael, the Reaper of Souls from Diablo 3. A former Archangel of Wisdom, he became disillusioned to the eternal struggles of good vs evil, and ultimately saw fit to become the Angel of Death in an attempt to eliminate humanity from the equation (in DIablo, humans are effectively the grand-descendants of the union between rogue angels and demons that didn't agree with the war, so humans hold within them both good and evil, and are allowed to choose for themselves, which leaves the balance of power eternally unstable, though more often than not tipping in favor of evil, at least in Malthael's eyes). Malthael's origins seem to make him a good match for Sauron, while his abilities and nature as a video game antagonist likely make him scale better to the Lich King. Either way, it'd have made for one hell of a three way.",
        "This is one of the coolest deathbattle ever! Without deathbattle, we would never see Sauron in action too",
        "I got good ideas and bad news \nThe good news is LOTR Fans are happy that Sauron won \nThe bad news is Warcraftian warriors and fans Are DOOMED",
        "Sauron not only taking the KO but then sitting in his throne? Total disrespect and i love it",
        "So can we call this the battle of ice and fire…",
        "Little do people know, when Sauron said “i shall claim what is mine” he probably meant finally getting the reins of invincible to drop. Mans been probably raiding ICC for damn near a year by now",
        "Since when did Sauron become more powerful than osse? lol",
        "Now this is what i like to see, two evil badasses in sweet armor duking it out.\nThis is the first Death Battle ive enjoyed since Popeye vs Saitama.",
        "did you know frostmourne can absorbs Souls by the Touch of the blade",
        "I'm an MHA fan but Asta is gonna roll Deku so hard it won't be funny XD",
        "I don't think Rings of Power should be used in conjunction with the rest of Tolkien lore. They did specifically say they were ignoring it, and by that logic it should be considered a separate series.",
        "You know i really like the fact that instead of an actual death with the gore and all that, arthas just had his soul destroyed. Definitely something different that is awsome.",
        "Blade vs Selene (underworld series)",
        "Sauron melting the frozen throne just by sitting on it is honestly kinda raw",
        "Sauron didn't mind control Numinor\nHe manipulated them to get him into and advisory role then convinced them that they deserved the gifts the elves had e.g immortality and the never dying lands which is west of Numinor",
        "No one can beat Sauron!",
        "Even though I think Sauron would win, Arthas was a bit underrepresented. He did beat Illidan in a 1 on 1, however while Illidan had absorbed the powers of Gul'Dan's skull, arthas was weakened and on his way to recover. He won only because Ner'Zul gave Arthas the last bit of power he had, which was enough to defeat him. We can definetely assume that the \"last bit of power he had\" from Ner'Zul is not the Lich King's full power.",
        "Let’s admit it, Sauron sitting down and steaming The Lich King’s throne was the most badass thing ever.",
        "The animation, the dialogue, (and the victor), all Hella Dope! loved it",
        "I think Frostmourne in particular got lowballed here. It’s arguably worse than Arthas himself. Only the Ashbringer had a prayer of stopping it.",
        "That was amazing. Despite never watching Lord of the Rings Sauron’s analysis sent me chills.",
        "This is kinda unfair, like I know the Litch king is a powerful guy, but tbh…… Sauron is completely immortal…. He is literally a dark angel increased in power to the point of a lesser god, and even after the destruction of the ring, he didn’t die, just at a weakened state that Eru Ilúvatar sent him to the void with a gust of wind, he is alive ….. he can never die",
        "Knowing what I know about the lore of Middle-Earth, I was like, \"there's no way the Lich-King beats an immortal power that has literally seen God and amassed enough power to terrify his most powerful servants.\"",
        "I am so devastated that we didn’t get a “Frostmourne Hungers” from Arthas… loved the rest though!"
    ],
    "comments_disabled": false
}