{"video_id": "_FD6Fyn2s0c", "comments": ["Sauron about to get more screen time than in the entire franchise", "The ring doesn't make the wearer invisible, it puts them in a spiritual plane. That's why when Frodo wore the ring, he saw the Wraiths in their spirit form, and why when Sauron wears the ring, he isn't invisible, because he lives on both planes.", "\"Now... I'll tear out your heart!\"\n\"You will find nothing there!\"\n\n\"You serve me now...\"", "Time stamps:\n0:34 Sauron\n8:45 Lich King\n15:30 Battle", "Lich King: “In this cold north you will find only death”\n\nSauron:”There is no life in the void, only death”", "It’s kind of funny. Tolkien first coined the phrase ‘necromancer’ to describe Sauron, but the Lich King was more of a necromancer than Sauron ever was.\n\nClarification: when I say ‘necromancer’, I mean the modern definition in most popular media: a being who can raise the dead or has some control over life and death, or both.", "Sauron is so smart", "“By the most unlikely creature imaginable… Elijah Wood!” Had me rolling on the floor dying of laughter lol . These guys are too funny", "I’ve always had respect for Sauron, but it was so awesome to actually see him fight! Probably the only time we will ever see it unfortunately", "Well Sauron actually was right about his power being irresistible in the end, the One Ring was only destroyed by accident because of two people fighting over it.", "You guys left out Sauron's greatest feat...\n\n...he won a Magical Singing Contest against THE Elf Lord, Finrod Felagund. This was without the One Ring and was so great the Elves dedicated an entire poem just to that event!", "Dude did anyone else get the feel that this was gonna be one of the most intense death battles watched in a while", "That second to last exchange between them was actually epic tbh\n\nSauron: \"I will rip out your heart \"\nArthas: \"You will find nothing there \"", "A small correction to what you said, melkor didn't give himself the name morgoth, it was given to him by Feanor after finwe was murdered.", "The comparison of LOTR and WOW's lore is a great example of the difference between complex and convoluted.", "I knew Sauron would win from when this matchup was announced, but I'm glad that a) it was closer than I thought it would be and b) that the fight was actually good considering how much I love both characters", "4:58-5:20 I have gone back through this bit over ten times already. It is unbelievably hilarious.", "The ring doesn't turn the wearer invisible, it let's them step into the wraith world, which most people can't perceive. That's why it doesn't make sauron invisible when he wears it, because while in physical form he exists in both worlds at once.", "Lich King: You will serve me!\nSauron: I serve no one!\n\nMorgoth: ", "That was one of the sickest fights I have ever seen. Glad my boy managed to pull through and win this amazing duel!", "The \"I serve no one\" gave me goosebumps", "If this is how powerful Sauron would be in a death battle, just how insane would Morgoth be I wonder!?!", "\"... but by the most unlikely creature imaginable:  Elijah Wood.\"\nI can't stop laughing.  ", "If only Monty Oum was still alive, he would be pretty much the best available to choreograph/animate this fight", "I like how in more recent Death Battles, they go for more character-driven deaths rather than gory spectacles. Sauron sucking out the Lich King's soul before dumping his corpse on the ground and then taking his throne feels truer to his malicious character than some Mortal Kombat demise.", "Gul’Dan only raised the broken shore. Suramar and Aszuna could have been underwater as Aszuna’s just full of ghosts and Suramar had a magic dome over it, but High Mountain and Stormheim had people living on them for centuries. High Mountain had people living on it before the shattering. That was thousands of years ago.", "I always thought that Frostmourne breaking in game was specifically due to being struck by a holy sword of extreme power (Ashbringer), rather than just through sheer force. Still an amazing fight to watch and I doubt it would have changed the result.", "I love how when they compare pros and cons after the fight, one of Sauron's is literally just \"More Powerful.\"", "this is just pure art great animation great work", "The animation, the dialogue, (and the victor), all Hella Dope! loved it", "Sauron melting the frozen throne just by sitting on it is honestly kinda raw", "This one surprisingly kept me on the edge of my seat, was not expecting that. Good job ", "I haven't watched death battle in a while but this one was really good. Glad Sauron pulled through.", "17:53 is just a beautiful touch. A foreshadowing of Arthas losing Frostmourne.", "The animation in this fight was absolutely outstanding!", "Pretty damn good. Great job on the animation", "The fact that Sauron literally had no cons in the aftermath analysis is honestly badass. Especially considering that he is the ONLY combatant to have that at this time.", "Great battle, but a shame no servants of the Scourges/Nazguls were involved. Both characters despite their powers were more dangerous as heads of massive armies of loyal monsters than actuall fighters", "Wow, one of the best death battle so far, thank you :)", "What about the spell Apocalypse from the Lich King? I feel like that would have been interesting to see.", "Wow. I have an incredible new respect for the Eye of Sauron form", "Damn that was the best death battle of all times ", "I like how causing the mountain to erupt did nothing to actually benefit Sauron, he was just being extra", "Arthus wasn’t loosing it when he Culled Stratholme, the people were already infected.", "This was an iconic battle!", "Thank you for this one. I truly enjoyed it.", "Thank you, Techno, for making my childhood so much better.\n\nRest in Peace, Potato King.", "Guys one of your best work yet...Please keep it up..", "\"I will rip out your heart\"\n\"You will find nothing there!\"\n\n Such a metal line.", "I  really apreciate the fight and the sound effect it's so cool thx DB", "I think this is one of the best, and one of my favorite matches Death Battle has made. Also I think for the next goofy or joke match we go meta and have it be: Broomstick vs. Wiz!", "Best battle so far. The animation is awesome. I was waiting for Sindragosa to come out to help Arthas. It wouldn't change the ending since Sauron is overpowered. But still, I wanted to see Sindragosa.", "This is probably one of my favorites since guts vs nightmare.", "Gotta say 17:05 is a fantastic shot. Great work you guys", "Little do people know, when Sauron said “i shall claim what is mine” he probably meant finally getting the reins of invincible to drop. Mans been probably raiding ICC for damn near a year by now", "This is one Death Battle I would love to see get the big budget treatment someday. No idea what would have to happen fictionally or IRL to make it happen but man, would that be cool.", "This battle was amazing!!!", "2 of my most favorite evils. Hard to see Arthas lose but facts are Sauron is a more ancient deadly evil with more tricks. Gotta give it to the OG.", "Really fun video guys, enjoyed the effort put into the videa  + the knowledge / research you  guys put in", "This was a good match up, good video!", "I like how this Death Battle is basically Fire vs. Ice.", "here through asmongold. that battle was insane. amazing cinematics, animations and choreography", "This Death Battle was like something straight from a heavy metal album", "Lich King: In this cold north you will find only death\n\nSauron:There is no life in the void, only death", "this one was 3d I think it seriously adds to the spectacle a lot. Well done all around", "In contrast with the other death battles, this one oozes pure fantasy.", "The last shot of the One Ring King sitting upon a melting throne was absolutely divine.", "The animation was on point this time", "This was epic as F! My only critique is that at the end, Sauron should have claimed the ice throne tower like in Shadows of Mordor. And then capped it all off with a a malevolent one liner \" All will serve or die!\"", "I loved it, two giant eyeballs fighting. Fire and ice.", "Really excited for the next battle. Two of my favorite characters and honestly don't know who will win", "I played WOW when I was a kid and only played it once i didnt know the story. Never understood the story of the LOTR as well.  Thank u for explaining both series in one go.", "Sauron sitting on Lich King's Throne after lighting his entire kingdom on fire went so hard.", "Had an Exalted game running where a friend was a piece of a Solar Exalted who was previously Sauron. Sauron was saved, from a primordial, by his lover being split into pieces. The only way to get himself whole was to gather his fragments. Only way to do that was dimensional genocide or a lot of ground game killing specific heroes. So he had other fragments hunting him.", "grizzys screams are literally pure serotonin", "One of the best fight videos I’ve watched", "The 1 big thing that the Lich King and Sauron have in common. Having huge armies.", "I'm more impressed that Arthas lasted as long as he did against Sauron", "I love how Sauron’s breakdown is presented in such a Tolkien-esque way, very fitting \n\nAlso the Black Speech whispering is just a really nice touch", "this fight scene is fitting in a villain vs villain scene", "Can we please have death battle winners battle eachother? There'd be some super cool match ups!", "Now I wanna see Dumbledore vs Gandalf", "I think this is one of the few deathbattles where they don't heavily joke on either character in the buildup, (The humor and shade throwing is fine, it's not a negative although one or two episodes were very trash talking in a sense) and just been a 'wow' factor to the lore of both characters. ", "Man, Arthas hasn’t had a W in 15 years…", "Okay, but that “You will find nothing there!” In response to Sauron’s “Now, I will tear out your heart.” was a raw as Hell line.", "Dammit, I was sure this was going to end with Arthas cutting the ring from Sauron's hand, only to fall to its temptation and be turned into a ringwraith. \"The hearts of men are easily corrupted,\" and all that. But yeah, the Lich King never had a chance against Sauron.", "As much as I love Arthas, I knew this was a Sauron win.", "This was great guys, do you think you'd be willing to do Red Hood vs The Punisher sometime in the future?", "17:04 best scene EVER in death battle\nAlso one of the best sauron voices ever", "Now, a Sauron against someone from the Soulslike franchise would be a good one.", "\"I'll tear out your heart\"\n\"You'll find nothing, there\" \nHas got to be the most badass line, of all time.", "Uff, so first of all, amazing animation. The pan out while the two just slugged eachother without taking a step back, chefs kiss of a shot. And while I don´t necessarily disagree with the conclusion itself, there seem to be some holes in how you guys reached it. Illidan, a demon hunter, beating Guldan (a demon user), and Guldan lifting an island, and Arthas beating Illidan, therefore Arthas can lift an island, doesn´t hold up. The logic was basically, Bruce Lee could beat a professional body builder in a fight, therefore Bruce Lee can bench press 700lbs. And the same goes for Sauron. I don´t think these were the best examples of their feats to measure them against eachother.", "my two favorite characters ever so it's like cheering for your mom instead of your dad in a domestic", "Would love a Death Battle style Weapons/Items series. Like, they could animate Training Dummies that are given weapons/Items [ones that are comparable] and they do challenges (similar to forged in fire lol) and at the end of the video would be a fight to the \"death\" [if it's weapons]", "There is also the little fact that Sauron can not be trully destroyed, being an original spirit of the creation death its trully not a limit to him. Even destroying the One Ring didn´t really killed him, only utterly crippled him to the level of a lesser evil spirit, thus according to deathmatch battles this is a default victory for Sauron.", "There could be only one outcome here... SAURON.", "I still can't get over how EPIC Sauron sounds to this day. His \"Black Speech\" still lingers in my mind all the time. Just imagine what Morgoth would've sounded like.", "Can we appreciate that at least one person at Death Battle had to actually read “The Simarillion” to get some of this information?", "one thing I noticed throughout this entire battle, is that Lord Sauron doesn't laugh at all. I must admit, that is something I am not used to when it comes to this type of villain but is also what makes it \ninteresting.", "The whole fight was a lot like Ganondorf vs Dracula since it involves two iconic dark lords fighting each other to the death, beginning with one of them intruding on the other's evil domain. (Sauron even explicitly activates the One Ring a few times in the fight similar to Ganon activating the Triforce of Power) Except this time, the intruding dark lord wins."]}