{"video_id": "AbgRB3arCpY", "comments": ["FTX’s new CEO says he’s never seen “such a complete absence of trustworthy financial information…” in his career.\n\nSo what’s next after FTX’s bankruptcy filing? WSJ breaks down the three key points around the largest crypto bankruptcy ever: ", "Its< natural to see so many investors panic amid a worsening bearish market but it is also important to note that the market situation is nothing new in the crypto world.Several factors are driving negative sentiment in the stock and crypto markets right now including inflation, a shaky stock market, rising interest rates, and recession fears. As a result, bitcoin has dropped significantly from its all-time high, breaking below several key technical levels.", "This guy knew what he was doing, he should be held accountable. Investors wants their money back.", "They have to make an example of SBF and give him the maximum penalty for this kind of violation of trust.", "I love your analysis, so clear and straight to the point. A lesson learnt for everyone and I've seen a lot of CEX sitting up cos of this. I'm looking forward to the Merkle tree reserve certificate from MEXC. It's a new ball game from henceforth, that we all know", "The amount of work the above team put into bypassing is really unbelievable, this a true masterpiece  and the recovery of my $5,000 within minutes it's impressive, So much respect for how much positivity you put while going through jobs! I wish you all the best, mate! You deserve it loatedcyber", "Please I need someone to help me trade or invest the forex or crypto market because I'm tired of trading in losses myself. I've blown my account twice and it's frustrating..", "Those investing channels really bowed to him.  He wasn't JP Morgan, he was Bernie Madoff.  LOL.", "Wall Street pitched so-called quality stocks with high profitability and low debt, as a kind of insurance against whatever the economy might throw at you. Quality stocks have underperformed the S&P500 this year, My $400k portfolio is down by approximately 20 %, any recommendations to scale up my ROI before retirement will be highly appreciated.", "An entire industry based on selling pretend “assets” to financially challenged individuals through slick promotions and a fear of missing out? What could have possibly gone wrong? ", "They're currently 4.5 hours into the stream and have reached 88% of the goal amount.  Good on Charlie for caring and doing this for Lance and his family.  Looks like they'll make the goal easily. :-O", "It's called money laundering and kick back money to politicians, people.", "I’m nasuru away by how much this guy actually wants to help people as much as he enjoys messing around with the scammers. Thanks før being good to us!!! \n#z5cracks", "The funny part about crypto, is its basically repeating problems the financial institutions went through. Bank runs, how to classify assets on the BS etc.", "I appreciate Charlie absolutely absorbing that jump scare to protect the rest of us. Truly a hero we do not deserve! :D", "Everyone should have listened to Larry David, he is always right.", "It appears giving someone a label/labeling someone a genius is easier than actually being a genius.", "Great stream, as always. I appreciate the level-headed approach you take to the news and the markets. Most beginners believe that investing in crypto and stock is all about holding till it rises, with the recent crash in the market and recession, we should know that long term price predictions are very difficult to achieve. It's better to trade short term and make profit. Mrs Shelagh Lynch got me covered as I am comfortably making up to 6 BTC monthly.", "\"anything big that starts big is a call for concern\". i will never forget this quote from an entrepreneur who made it big time.", "How much respect for the amount of positivity you put in as you go through the Loatedcyber work process!\n  I wish you the best Loatedcyber, you deserve it and thanks for the recovery", "Remember the companies who said 'buy gold through us' while you send them money and they 'hold on' to your gold for you? Yeah, me neither.", "Over the last few years I have looked at crypto several times as prices rocketed, but decided to stay clear. If something appears too good to be true, it probably is. How these big players could get duped is another matter, as with subprime scandal a lack of oversight and pure greed has won again.", "SEC Chair Gary Genslers old boss at MIT was Glenn Ellison. His daughter Caroline Ellison is the CEO of FTX sister-company Alameda Research (and Sam Bankman-Frieds lover apparently). The GC of FTX used to be lead counsel to Gary Gensler when he was CFTC Chair.", "RESPECT BRO. That's called real skills few hours ago he got my money back. I do appreciate what you're doing, keep it up, I don't have much words to say but every words said about this dude is adequate, I wouldn't be talking here if not for the awesome job they did.", "I love your service and work you are doing.. My 53 year old dad was scammed twice in a year for over $120,456 ! Took a year with the FEDS to get her money back. These scumbags need to STOP and glad there are people like Z5CRACKS willing to fight back. ", "Eh, after I lost 40% on the FTX drop I decided to keep a closer eye on crypto and my portfolio. So I downloaded the crypto portfolio app. I advise you to do the same", "That \"I'm free\" quote at the end really hits different after his passing. Rest in peace, Techno. You will be missed dearly. =3:)", "The wisest thing that should be on everyone's mind currently should be. To invest in different streams of income that doesn't depend on government, especially with the current especially with the current economic crises around the world.", "During downturn markets, just a few investors acquire equities at a bargain. During a raging bull market, all other investors purchase at a premium. Investors who purchase during weak markets have three characteristics: company knowledge, conviction, and a long-term outlook.", "This video was the only video I understood it was well put together simple to follow simple to understand and with good information I finally understand who this guy is what his business was and why it started to fall so on", "This could be the fastest hero-to-zero in history.", "It amazes me how people can put their hard earned money into video game gold.", "I can't stop thanking snf praising Loatedcyber after a job well done. I'm grateful for the way you've helped alot of people including me. Your integrity and honesty are one of the few to be talked about...", "If you have trouble understanding what was wrong with Alameda Research having most of their assets in FTT tokens, then just think of the scene in Dumb and Dumber where the \"heroes\" find a suitcase full of money and replaces the money with IOUs. Same thing.", "The time and efforts you put into this work that is beyond excellence. Take my cordial Thsnks! You are really an efficient, organised man, thank you for all the extra hours and extra effort you had put on for getting my account back. I appreciate every bit of your effort. Thank you for pulling this off so smoothly...", "Nothing went wrong. All goes well according to their plan. Right now, they are playing innocent and investigators are playing seriously investigation game.", "The price of BTC declined over 15% and even trade below 16k. Binance opted out to bailFTX, resultin in an increase in selling pressure… The market is bleeding and many altcoins such as eth, bnb, ripple are down over 15%. If BTC fails to start recovery, it could continue to move down. In addition, Godwin Myers has stated his bullish stand on the crypto market. I have made over 22.5 btc from his teachings and his accurate daily trade signal to my trade with just as little as 3.7 btc.", "Finance YTbers will definitely make an \"apology video\" wiping their tears away because they're not going to be earning more of that sponsor deals..... waiting for the next scummy brand to sponsor them again", "Binance knew what it was doing: it offered help then withdrew its help a couple days later. Why? Because by doing so the demise of FTX would be guaranteed in a matter of just days instead of weeks or perhaps even months. \nYou try to save then back off at the last second, beautifully executed!!! For sure and without a doubt CZ was applying a secret technique from The Art of War.", "Thanks LOATEDCYBER  you're such a talented person, and I can't just stop thanking you for this successful recovery. If I had my ways, i would give you a big hug...", "This is the same thing that happened during the depression, banks did tons of borrowing which lead to bad investment with depositors money. Then that triggered a mass withdraw from said banks forcing them to collapse.....all because it wasn't safely regulated", "This scam was common in small public companies where one asset, i.e. a patent or copyright, was valued on its future cash flows and used to support the company's stock valuation.", "Dein Kanal hat mein Leben wirklich verändert. Ich studiere und recherchiere schon seit einiger Zeit über Krypto und bin irgendwann in der Lernkurve hängen geblieben. Jetzt kann ich sagen, dass ich mein Verständnis dieser ganz neuen Welt wirklich verbessere und jede Woche große Gewinne mache, alles dank Ihnen ", "Gensler's in on it, and he presenting himself as an outsider.", "I love the \"nobody could have seen this.\" Everyone with a brain has said this is exactly what would happen many times.", "We need more people like you. If we had an army of people like you, we could stamp out these total loss in no time. I love that you re helping the victims, too it's ultra gratifying when you are able to save people in real time like you do thanks for recovering back my money..", "Thanks to QE from the federal reserve for the last decade firms like this were able to get funded due to investors looking for gains anywhere. Market turns and companies like this can't survive a quarter let alone a few months. Good riddance to them and their investors, the only real losers are the general retail investors milked by sly ad campaigns luring them into a speculative bet.", "Weird, his brother also got billions from COVID funds. “Protect against pandemics”. He just ran a little non profit mapping DNA and RNA.  I’m sure zero COVID funds need up in that index.", "I think that he was given advice and in the end just became the fall guy. Like another guy said there must be an agenda. At this point it's really putting their people in the spot light and it's coming in other ways.", "I was actually doubting Loatedcyber at first but this is me here today having my funds retrieved due to his kindness and willingness to work..", "The thing is, I don't feel sorry for any trader's loss, it's just naive to invest into an unregulated market thinking nothing can go wrong...", "To obtain financial freedom, one must either be a business owner, an investor or both, generating passive income, particularly on a weekly and  monthly  basis .that's the key to living a financially stable life. This trick has never failed.I pray that anyone who reads this will be successful in life..", "Nothing is going to change until these crooks start receiving street justice.", "Crypto has a lot of problems. Chief amongst which is the fact that it's primarily used as a highly-volatile speculative tool, instead of its intended use. Anyone who loses money in this wild west arena only has themselves to blame. You bought tulips too late into the bubble...", "Wow, short and straight to the point.", "You have influenced my life in such a positive way word cannot express my appreciation thanks so much sir for Retrieving my lost funds ", "Crypto keeps giving!! Cannot wait for the Netflix adaptation", "Successful people don't become that way overnight. What most people see at a glance-wealth, a great career, purpose-is the result of hard work and hustle over time.", "Blockchain has some really useful applications and I'm excited to see how people build on the platform over the next decade, but the vast majority of the crypto industry adds no value and is a tulip bubble", "With markets tumbling, inflation soaring, the Fed imposing large interest-rate hike, while treasury yields are rising rapidly—which means more red ink for portfolios this quarter. How can I profit from the current volatile market, I'm still at a crossroads deciding if to liquidate my $125k bond/stocck portfolio", "Loatedcyber is like a brother to everyone, he helped people in every possible way he could and I really appreciate meeting him for my retirement", "I'm here to learn how to trade and also to invest. After listening to a guy on a live program about the importance of investing and how he made $410k in 4 months from $145k, somehow this video has helped shed light on key points, but I'm still confused as a newbie and I'm open to meaningful ideas.", "SEC should have partnership with CZ and binance for crypto regulations and CEX monitoring. Binance can monitor things that other cannot.\n\nThe only problem might be Binance and CZ are more on transparency while the other parties/people might be prioritizing under the table transactions for their own benefits", "In spite of the fluctuation in crypto, I still thank you for the level-headed financial advice. I started crypto investment with $4,345 and since following you for few weeks now, I’ve gotten $18,539 in my portfolio\n\nThanks so much  Mrs Cynthia M. Levi", "If I wanted to know what happened to FTX I certainly wouldn’t trust The Wall Street Journal to tell me.", "Because, from day one, there was a backdoor to FTX's system for extracting/stealing  funds.", "If you wanna be successful, you most take responsibility for your emotions, not place the blame on others. In addition to make you feel more guilty about your faults, pointing the finger at others will only serve to increase your sense of personal accountability. There's always a risk in every investment, yet people still invest and succeed. You must look outward if you wanna be successful in life.", "A true caliber friend is as hard to come by as a priceless diamond, I am blessed to have this team helping everyone financially, thank you........", "This kind of event is a great way to filter the shills and scammers from the people that genuinely care about the industry.", "This is VERY concerning going forward. As crypto grows and the total market caps get bigger and bigger, a bigger crash like this in the future could tank the entire economy like in 2008. Crypto cultists might not like it, but regulation is needed.", "Money is an issue that everyone has for a better and luxurious life, Life was hard for me until I started trading bitcoin and am now earning $18,435 per week.", "Derivatives are criminal in any and all investments. Fried is dirty and so is his staff. Jail time.", "Thanks for the information. It is a real eye-opener.", "Ok quick question. If I would have bought crypto from FTX and stored them on a Nano Ledger X offline, wouldn't I have avoided all this? This essentially affected only people who entrusted their holdings with FTX and stored them online with them. Right. Didn't we learn things from Mt. Gox and this both now people??? Store offline.", "\"even though there has been speculation about Alemeter research and FTX being joined at the hip, nobody could've foreseen that SBF was willing to transfer billions of customer funds at HIS crypto exchange to help HIS crypto trading firm.\" ", "\"No one could have foreseen -\" he literally described what he was doing, on a podcast, more than six months ago.", "You forgot to mention the MIT connection between Gary Gensler (SEC), Glen Ellison (Garys old boss) , Caroline Allison CEO alemidia doughter of Glen Ellison and Sam Bankman (MIT) relationship to Caroline a full circle of scam need to investigate Citadel to hold this mess whit all naked shorting ", "Bummer for those who lost. Seems like a crime. I never bought into the vapor coin stuff.", "There’s no hack, unless you consider an employee moving things around before it’s too late a hack. And I don’t think the Gary Gensler clip is the flex you think it is WSJ, both he and his kid are involved with SBF.", "One thing important lesson did come out of this.. DO NOT LEAVE YOUR CRYPTO ON AN EXCHANGE. But in this case they also had a crypto associated with FTX being FTT so whether in private secure wallet or not any investmwnt into FTT was like a cash cow for this guy. Also had access to everones crypto that was being stored on FTX exchange though. Meanwhile he's living in the Bahamas with 20 other people from Alameda they all frolicing in investors cash and having company orgies everyday ", "Everyone is keep saying \" FTX lost his value \" it's worth noting from the beginning. Same said explained for first day \" I tool an empty box and I valuated it to  $100,000 \" and people start gabling for an empty box, there is no real value or service behind his box ", "Well explained. Thank you", "Looks like Binance got out relatively unscathed.  They announced their intention in apparent good faith but Madoff could be precedent for clawback.", "Always be weary of someone who tells you how good of a person they are", "And people call me paranoid when I say don’t leave your crypto in exchanges. I only lost $3 when FTX shut down because I’ve been in crypto for years and know what I’m doing.", "I noticed at the start they put cardano as one  of the cryptos that got hurt. I want to be clear when I say, we did not get hurt by this at all. ", "I still think it could be a fake pump as long as #BTC stays under 17,7k daily resistance and the consequences of the whole #FTX drama are still not assessable. btw, #defiwarrior will launch #themera mainnet later this month", "Thanks LOATEDCYBER  you're such a talented person, and I can't just stop thanking you for this. If I had my ways, i would give you a big hug\nthanks for getting back my funds.", "Something I never understood: If bitcoin is truly decentralised, how is it possible for multiple exchanges to have same prices with small spread differences at all times?", "We are currently in the jaws of the worst bear markets I have seen, the average stock has been cut in half, and the only way to make money this year has been to either short or to trade long in very short time frames. I'm still at a crossroads deciding if to liquidate my dipping $117k stock portfolio, what’s the best way to take advantage of this bear market.", "Incredible series of events", "Your dedication and hardworking shows how legit and professional you are honestly works along can't be express how grateful I'm rn!", "This is an amazing  video and i enjoyed every  bit of it.  And i'm also excited to  share my investment  experience so far  this year.  I believe it will help a lot  of people here who are confused  on how to startup theirs and  be productive for  the year .. ...", "How was FTX immune from or not affected by the provisions of the Sarbanes-Oxley act? Wasn't this sort of debacle the entire point of SOX?", "To summarize - this is like a bank taking all its deposits to the casino.......and losing.  All of it.  This is an absolute disgrace and 'SBF' should go to jail for a very long time.", "I thank my stars my financial advisor told me to sell almost half of my cryto balance which was mostly this particular FTT token. I would have probably being in the hospital now", "The itemization part, its like a match i played against a Trundle. The guy made BORK, divine, infinity and some ADC items and the damage was absurd, and the tankiness too. Gotta love some alt builds >:-(", "This is what happens when you don’t regulate things. I know this is a hot topic but you can see why you need some type of oversight. You have people like this that ruin the game. Maybe years down the road people will learn and not fall for this or maybe they don’t. The legitimacy of coins are at an all time low. Basically you have scum bags forcing the government to step in and soon they will. You can then thank all the scammers and rug pulls individually ", "Explaining away scams  is always an interesting watch", "I pulled out as quickly as possible. But it took time because they had a really weird and difficult way to transfer your money out and it was exhausting. Got all my money out. Thank God\n\nI hated FTX. Hated it."]}