{
    "video_id": "AbgRB3arCpY",
    "comments": [
        "Binance knew what it was doing: it offered help then withdrew its help a couple days later. Why? Because by doing so the demise of FTX would be guaranteed in a matter of just days instead of weeks or perhaps even months. \nYou try to save then back off at the last second, beautifully executed!!! For sure and without a doubt CZ was applying a secret technique from The Art of War.",
        "I'm glad I listened to Dan Pena and never bought crypto.",
        "This goes to show you There’s No Real Cure for Greed theses people are never gonna be satisfied with the amount of money wealth or fame their Ego’s are on Overdrive which needs to be Feed Non Stop ( we can’t help ourselves we’re Money Hungry junkies… )",
        "The greatest wealth is to live content with little. —Plato ",
        "steal from the poor and give to the powerful's political campaigns. way to go SBF the most generous billionaire in the history of the world or should we say R.B. hood.",
        "Request for an update on  AMA1000X   . Your the man, keep up the hard work in the depths of this bear market and we will all be asking “what’s a few trillion among friends",
        "When referencing corporate America, he said “They don’t really care about you as they make it seem” realest thing he said...I’ve seen experienced it first hand in the DMV. Black ppl aren’t really respected in corporate America. Glad that he was able to get out of there and become his own boss VERMONTCORPLTD",
        "Invest in clepto,  we clepto-manaics will handle your money,  \" but you may never see it back\"   \n\nBoy am I glad I got out of that before I invested a dime.",
        "Anyone who continues to listen to this arch criminal deserves to lose all of their money.",
        "Crypto keeps giving!! Cannot wait for the Netflix adaptation",
        "What went wrong was he donated for democrats",
        "hand rubbing intensifies",
        "As Joe Pesci states in 'Casino', \"You put my money to sleep, I'm gonna put you to sleep\".  Bang Bang !\nThat's exactly how I would handle this.",
        "Unregulated. Enough said...plus this has happened to other crypto companies where the owners flee with all the money.",
        "He is a visionary. AMA1000X is a long hold",
        "\"nobody could have foreseen\".....\nmaybe if you were doing actual journalism.....",
        "thanks",
        "Any good suggestions on a legit platform where I can deposit my coins and make consistent returns??",
        "Fair opinion on AMA1000X now that a big brand is entering the scene I believe we can have big shifts at all markets not only the AMZ market",
        "This is why you keep your assets decentralized... Everyone is able to and it takes no extra time, yet people want their money in the hands of a company",
        "Sounds legit. NOT.",
        "At the moment, the ideal option is a crypto exchange crp is",
        "I’m so excited , my life has totally changed since I invested with $10,500 and I now make $23,550 every 14 days. Thanks to Mr John Parker.",
        "This people ️️️just gave me hope of living again with a lot of bitcoinssuccessfully they are the key to my success am so thrilled",
        "I will forever be indebted to you, You've changed my whole life and i continue to preach about your name for the whole world to hear you've saved me from a huge financial debt with just little investment,Thanks so much  Luciana cruz",
        "Biden said I want a cash out and give 10% to the big guy ….! 🇺🇦 \nC’mon man..",
        "This is enron 3.0",
        "Fun fact, Bankman-Fried and Allison's parents are (all four) faculty at Stanford Law School and MIT Economics Department, respectively.",
        "First voyager now FTX all in one year \nYea this was a horrible year for Crypto",
        "I'm glad this scam is collapsing.",
        "Crypto bads are really sad.",
        "What went wrong? One word, GREED. All side including the investors.",
        "Remember the companies who said 'buy gold through us' while you send them money and they 'hold on' to your gold for you? Yeah, me neither.",
        "Super cool video ! Do you think amazons AMA1000X will pump before ETH ? I ask myself if there is a pattern in the order of the altcoins pumps.",
        "This Can’t Be True!  SBF Donated Millions to the DEMOCRATS and He Had Pretty Superstar Athletes T.Brady and S.Curry as Spokesman for FTX.  This Must Be a Misunderstanding is What his Attorneys will Say as SBF Flees to a Non-Expediting Country.",
        "I’ve been in finance for the last 15 years, starting from economists to broker. \n\nI really really really hope these new age clowns finally realise that it’s a mistake to deal with and take advice from dude in shorts t shirts and flip flops sitting in fancy offices behind screens…. No matter how “intelligent” they are or what ever Ivey league school they showed up from…",
        "Why has he not been placed into custody already?",
        "The sooner the wealthy elites are rounded up the sooner working people can survive.",
        "Nicely explained.",
        "Could you please talk about AMA1000X it’s very strong and took off in short time thanks",
        "Tulip",
        "Crypto is over with pull out.. highly unstable!!",
        "its obviously AMA1000X, and the only I would buy is to make money. Personally, not a huge fan of this one",
        "Thanks Lammonhack he was able to recover my money back from FTX I really appreciate sir",
        "No word about his democratic party connection",
        "In late September 2021, the People’s Bank of China (PBOC) banned all cryptocurrency transactions. The PBOC cited the role of cryptocurrencies in facilitating financial crime as well as posing a growing risk to China’s financial system owing to their highly speculative nature.",
        "I will forever be indebted to you, you’ve changed my whole life I’ll continue to preach about your name for the world to hear you’ve saved me from a huge financial debt with just little investment thanks so much Mrs Rachelle Hughs.",
        "GUUUUUUYS there's a bug right now on the Binnce official DEX, it exchanges for 10x, I made video",
        "He knees shaking I think he's a liaaar",
        "Rumors were that Amazon would launch  AMA1000X   this month and judging from this it's pretty accurate haha",
        "TRADE WELL ON DEMO BUT I THINK THE REAL MARKET IS MANIPULATED... CAN ANYONE HELP ME OUT OR AT LEAST TELL ME WHAT I'M DOING WRONG?",
        "Can I get multiple entries for AMA1000X or only one?",
        "Lyn Alden has a great simple definition of FTX:  \"FTX is/was an offshore casino built on top of a Ponzi scheme\".",
        "GUYSSSS Right now Binance official exchanger have a bug\n\nit exchanges BTC to ETH almost x10 rate fully automatic\n\nI posted a video'",
        "Hello, I'm new to Biticon trade and I've been making losses but recently I see a lot of people earning from it. Please can someone tell me what I'm doing wrong",
        "should you sell a little of AMA1000X when you start to make a profit or just hold?",
        "Someone removed the bottom card in the house of cards.",
        "should've listened to Larry.",
        "This is the same thing that happened during the depression, banks did tons of borrowing which lead to bad investment with depositors money. Then that triggered a mass withdraw from said banks forcing them to collapse.....all because it wasn't safely regulated",
        "I hope that SBF will be sent to prison for 300 years. This is a good old fashioned rip off.",
        "Playing in the real world with virtual game money. Sort of like an E-Pyramid scheme.",
        "If you're reading thru the comments to find useful feedback, please watch out for the spam and come-ons scattered throughout. The fraudsters are still looking for new suckers, even as the crypto market appears to be in a death spiral right now. If you're waiting to buy the dip, I'm not sure that the market is at the bottom just yet. Be careful...and enjoy your Thanksgiving!!",
        "BOBUTENSIL has a very special spark, and I trust she will go far in making our world a better place, she's very much open to help us all in getting back our money that I'm so sure of she's willing to do",
        "How they gonna launder war money now ? No more cocaine for Zelensky?",
        "You can't invent your own money. Period the end. Stupidity and greed = you lose your money. Period the end.",
        "Im not good at math nor expert on how digital economy works but when I have first heard about crypto first thing thought that it was stupid. Ibjust cant fattom why do people invest their money on a \"pretend\" asset and has nothing to cling on. Like for and  example food,water,housing,technology these are investments that makes more sense because these are things people cant live without unlike crypto that only lives up due to trend.",
        "Well, turns out Larry was right.  ",
        "Hey Wall Street; play stupid games, win stupid prizes... ",
        "AM has been extremely helpful to me in personally managing stock and fund portfolios over the past 10-15 years. It has made tax preparation easy and helped with asset allocation. I've found it valuable enough to purchase copies for my son and son-in-law VERMONTCORPLTD",
        "A lot of investors trusted SBF due to the glowing reporting from authoritative sources, which made SBF safe in the market.",
        "Had to stop watching after the 10th \"according to sources familiar with the matter\". Hurts my brain your journalism.",
        "Was he JP Morgan or PT Barnum? Greed often outweighs intellect- sorry guy’s- a fool and their money is soon separated",
        "Seems like competition Biance got what it want, FTX closure!",
        "SOMEONE SHOULD HELP HERE. I LOST OVER $5000 ON LIVE TRADE. I THOUGHT LIVE TRADE IS THE SAME WITH DEMO TRADE BECAUSE I WAS WINNING WITH MY DEMO ACCOUNT. THIS IS QUITE ANNOYING, WHAT SHOULD I DO PLEASE ",
        "Ahahahhhhhhhh",
        "Looking forward to the Netflix Documentary.",
        "Guys like this will forever keep the show “American Greed” in business. Lol.",
        "VERMONTCORPLTD is young.  Holding almost anything mentioned here is a good hold because the VHS or Beta will only show in time.  I want to hold them early.  Its sad that most dont think of these things as good future holds instead of being out of the market and bottom hunting.  Are we the adopters or are we scavengers?  surely one of these layer ones will become the standard and i dont want to sell any of them too early.",
        "Lies  Follow the money trail, an you will see who is behind the scam.",
        "now t’s snap into  AMA1000X",
        "Remember there's only one Savior and his name is Jesus Christ every other name and person will be exposed and that's what's happening",
        "He isn't even wearing \"grown-up\" man pants.",
        "Great stream, as always. I appreciate the level-headed approach you take to the news and the markets. . A lot has changed and that's on everything but the truth is I don't even care much about bullish or bearish market anymore because VERMONTCORPLTD got me cover as I am comfortably making 5.1B T C monthly.",
        "this is why we should not change  what works like cash cash is king",
        "Honestly, just owning it and not trying to hide it is partially why I watch you. It's the honorable thing to do and it make the rest of the jobs much more believe when you are call out of the spots like that, so thanks to LOATEDCYBER for the money back job.....",
        "This is ironically hilarious because the underlying reason they give for cryptocurrency is to circumvent banks and do peer to peer trades, but the reason banks were organically created in the first place is to have a regulated, trusted middleman that can be held liable and scrutanized when they do sketchy stuff. We need another Frank-Dodd bill to enforce seperation of retail and risky investment banking in the crypto space(while your at it re-impose dodd frank on the banking sector as well!)",
        "Really. Come on man.",
        "This is why I follow Charles Hoskinson.",
        "When he said it's not like the stock market and then proceeded to explain exactly what wall street does made me laugh.",
        "Bummer for those who lost. Seems like a crime. I never bought into the vapor coin stuff.",
        "Mind You, Nothing went Wrong, in fact, everything is Right, this is exactly what happens to people who do things like investing funds just because, Celebrities advertised it.  How soon they forgot about Maddox or is it his name.",
        "Due to the fact his name is \"BANKMAN FRIED\", hence every investor is FRIED....",
        "AITX : artificial intelligence ",
        "What about FTX ties to Democratic Party, Ukraine government and the fact that the head of SEC is a closed friend of the father of SBF girlfriend which is also an executive of FTX? No saying about that at all in the history?",
        "A kid like that couldn't rise billions in a short period of time without a network !",
        "He took the millennial casual tech look to the extreme didn't he?",
        "Geed and dishonesty. The lesson for the general public is that don't invest in a fund that you are not familiar with. If the return on investment appears to be too good then it is too good to be true and one should stay away from it.",
        "I had no idea that buying Air  is cold an asset ",
        "All the fangirls for AMA1000X shine bright  Love you all",
        "FTX's balance sheets make Enron's 2001 balance sheets look sound and legitimate.",
        "Mr Sam Deymon is also very generous with his time. He is more than available. He will answer your questions about any chart, about the market or the course very quickly.",
        "I always wonder, when people know this is not logical why would anyone encourage these investments to bubble? I think same story is going on with housing, the only difference is everyone is a thief or culprit in housing. How can Leanders gave away money at 2.5% flat for 30 years? How is this logical at all?",
        "I thank my stars my financial advisor told me to sell almost half of my cryto balance which was mostly this particular FTT token. I would have probably being in the hospital now",
        "Good thing I never understood sarcasm and took that FTX commercial with Larry David to be true",
        "Sam Harvey Oswald.",
        "Alexandra Larkin really did justice in the explanation of the sudden liquidity crunch that led to FTX collapse. Though, it is stale news that Idle money gets killed due to inflation. I'm in a privileged position to be able to save almost 65% of our net household income, as I placed it on safer investments. The key for us was not spending beyond our means. If you invest and have other sources of income outside of dividends then you will be able to live off dividends. Got north of $520K in my portfolio as I bought a lot of dividend stocks before, I'm buying more now, and I will buy more when it drops further.",
        "A round of applaud for the great analysis and breakdown of personal perspective. I woke up to the sad news by FTX. The market circumstances are driving me insane, my portfolio has lost almost $18500 this month alone, my earnings are tanking, and I can't see how my retirement will go smoothly when I can't even increase my stagnating reserve. I wonder whether those who lived through the 2008 crash had it",
        "Government has been waiting to use CBDC they needed a scapegoat to finally get to this point. Sam and FTX was that scapegoat.",
        "It seems like Binance was planning the fall of FTT all along. They invested enough money to intentionally own most of the FTT coins, when the right opportunity comes Binance withdraws all its FTT coins resulting in panic selling from the investors.",
        "IF THE FTX - i THOUGHT WAS IMAGES, - SO WHAT IS FTX U ALL TALKING ABOUT.",
        "Another \"chosen one\"",
        "I already lost 75% of my lnvestment to crypto crash this year, but good news on AMA1000X",
        "Over the last few years I have looked at crypto several times as prices rocketed, but decided to stay clear. If something appears too good to be true, it probably is. How these big players could get duped is another matter, as with subprime scandal a lack of oversight and pure greed has won again.",
        "How was FTX immune from or not affected by the provisions of the Sarbanes-Oxley act? Wasn't this sort of debacle the entire point of SOX?",
        "This guy is holed up somewhere laughing so hard he has to be careful he doesn't collapse a lung.",
        "Wouldnt it be weird if ftx recieved money that was meant to aid Ukraine and then was making massive political donations prior to its collapse?",
        "How much did SBF pay you?",
        "SBF BIGGEST SCAMMER :(",
        "“What went wrong”\n\nHis hair",
        "Dein Kanal hat mein Leben wirklich verändert. Ich studiere und recherchiere schon seit einiger Zeit über Krypto und bin irgendwann in der Lernkurve hängen geblieben. Jetzt kann ich sagen, dass ich mein Verständnis dieser ganz neuen Welt wirklich verbessere und jede Woche große Gewinne mache, alles dank Ihnen ",
        "Nothing is worth nothing. About time",
        "everyone should go on Twitter and poke at FTX, the Bahamas gov/SEC, our SEC, and tell them to undo the fraudulent expense Sam bankman fried has done such as buying houses at 1.2 million, over compensation, and transfers that they should not have done and to work SBF to the bone yo repay. \nThe FTX court proceeding in Colorado and FTX assets is with the Bahama gov. Currently. ",
        "oh look another crpyto scam. yawn",
        "People couldn't tell this guy was a criminal by looking at his last name, face, or party affiliation? Lol.",
        "how do LOIs and due diligence get drafted and completed in a couple of days??",
        "You got taken. Get over it.",
        "My largest holding is Amazons  AMA1000X   . Glad it came out to be this. I’m a fanboy and I like Charles. He reminds me of Steve Jobs when he speaks.",
        "It is a fraud in the beginning, we just covered our eyes and believed the lie.greedy is context behind it",
        "some only fan users fart is more valuable than ftx",
        "Why are we still pretending this is a real market?",
        "You would have to be a fool to invest in an unregulated industry like crypto.",
        "If you trust a 20 something \"CEO\" in shorts, who doesn't make eye contact and shivers at speaking and lives in the Bahamas you know what's gonna happen ",
        "Look like Algorand has the same chart then Amazons  AMA1000X",
        "Boats land watches cars gold silver",
        "#buyBitcoinCash",
        "Good video",
        "I genuinely appreciate his withdrawal and recovery services render to investors in making sure we receive our stolen funds back. thank you so much for your guidance and support..",
        "if AMA1000X can grow organically like that they will dominate that industry",
        "Love seeing Gary in the vid considering he met with them.",
        "AMA1000X   , a pick with potential if they follow through!",
        "Banks do this BS all the time dont they ?",
        "Clearly zero due diligence done, red flags everywhere from day 1",
        "You have influenced my life in such a positive way word cannot express my appreciation thanks so much sir for Retrieving my lost funds ",
        "A shocking revelation that the guy speaking about boxes doing nothing did a box that does nothing",
        "I guess he’ll be known as the Lehman Brothers of Crypto now ",
        "Stability, usecase, utility. These are factors which should transform you into a buyer and not the idea of whatever it's gonna work. This sounds simple but apprently still too difficult to most. My idea is Amazons AMA1000X, they provide all these values and more.",
        "A con from the start",
        "I literally watch all of your content. I believe I can succeed following your advice and wisdom. I want to make 30000 every month lol that's what came to mind but Honestly. My main Affirmation is , I Am Self Employed, and everyday my company is getting Stronger. That's honestly the first step walking away from my 9 to 5.Forever grateful to VERMONTCORPLTD",
        "Thanks to the above user for help regarding to scammed investment funds recovery I got my funds back I'm so excited ......I'm impressed thanks",
        "Could you please talk about AMA1000X it’s very strong and took off in short time thanks.",
        "Can we agree though that the move from binance was quite voracious I mean theey offload the crypto knowing what the effect would be at that time and then couple of days later try to eat them up...pretty straight forward strategy there well they might now have seen how problematic ftx was at the start and just decided to stay clear at the end.",
        "Sam Bankman Fried \"chicken\" anyone?....",
        "Wall Street pitched so-called quality stocks with high profitability and low debt, as a kind of insurance against whatever the economy might throw at you. Quality stocks have underperformed the S&P500 this year, My $400k portfolio is down by approximately 20 %, any recommendations to scale up my ROI before retirement will be highly appreciated.",
        "scam story",
        "Mention the fact that SBF Professor was Gensler current chair of the SEC",
        "That's why i don't invest in bitcoin.",
        "This is VERY concerning going forward. As crypto grows and the total market caps get bigger and bigger, a bigger crash like this in the future could tank the entire economy like in 2008. Crypto cultists might not like it, but regulation is needed.",
        "Thanks LOATEDCYBER  you're such a talented person, and I can't just stop thanking you for this successful recovery. If I had my ways, i would give you a big hug...",
        "What did you all expect?",
        "That was totally different to what Forbes said..",
        "Good day everyone, l enjoyed watching the video. But sincerely l'm a newbie to trading. Please I need someone to help me trade or invest the forex or crypto market because I'm tired of trading in losses myself. I've blown my account twice and it's frustrating..please recommend a good expert that can\ntrade on my behalf and generate profit for me.",
        "Thank you For making my work life more comfortable enjoy working with you, and your dedication to your job inspires me. I'll always wanted to get into my spouse phone but I was not able to figure it out, kudos to You, you are really good.",
        "If you’ve decided to invest in the market, it’s important you trade with  Mr SAM DEYMON platform as with any other investment, explore what you should know before you invest. I plead and also encourage you to do your best.",
        "AMA1000X is also kicking off and showing A LOT of potential. Don't Sleep on it",
        "I bought 5k usd  AMA1000X   . I feel like this token will raise to $10 really easily.",
        "I still think it could be a fake pump as long as #BTC stays under 17,7k daily resistance and the consequences of the whole #FTX drama are still not assessable. btw, #defiwarrior will launch #themera mainnet later this month",
        "Gosh with this slump in crypto prices I was wondering to invest into cheep crypto. I'm trying to get educated which coin is the best investment now. Can anyone give me some advice?",
        "It<> makes sense,  BTC and crypto is off helping to regulate, rather than pretend it won't ever happen.  The big institutions getting in is the catalyst that will launch us into the stratosphere.  Most people don't like change but after the change is made they grow used to it and it becomes a non issue usually because their fears never materialize.   The projects that initiated the process of regulation have not been ruined, they got involved in setting guidelines and helping the regulators understand the crypto space. I’d get involved more knowing that I have made over 7 btc and 15ETH from day-trade with VERMONTCORPLTD in few weeks.",
        "05:13 Can someone explain how the money is missing ? I am not in crypto but all peoples are speaking how safe it is and you have full control . How can the money be missing now ?",
        "ANYTHING THAT IS NOT BACKED BY GOLD IS LITERALLY WORTH NOTHING",
        "So if someone lost that money then who got it?",
        "When you take your client's investments (the cryptos in their exchange wallets) and use it to gamble, that's called theft. Banks do it with limitations (usually, and I would hope ~10% of assets) and thats still frowned upon, but ultimately a controlled risk. What FTX did is a strait up felony and those responsible deserve the book",
        "I knew he was a sham.",
        "With everything going on I am fully putting trust in AMA1000X and I can give you three reasons why you should as well: Stability, utility, brand power",
        "Clear and straightforward to use, help function very useful. Also helps to know that there are humans in the background. No negative issues to report. Withdrawals are straightforward and not time consuming VERMONTCORPLTD",
        "The whole banking system would have tanked like Lehman if the government (aka citizen taxes) had not bailed them out.",
        "God going to show where they money went all going to be exposed",
        "They're currently 4.5 hours into the stream and have reached 88% of the goal amount.  Good on Charlie for caring and doing this for Lance and his family.  Looks like they'll make the goal easily. :-O",
        "Warren Buffett be like\" dumb kids should have invested in Coca-Cola\".",
        "I have been seeing alot of good reviews about LOATEDCYBER , he's really outstanding and a genius.\nI got my money back through his help.....",
        "so basically there was a run on the bank (ie FTX)",
        "Is the WSJ coming to bat for one of its' own? Why yes it is.",
        "I wouldn’t rush to judge him unless I had all the facts in front of me.  One thing for sure is there’s going to be a lot of litigation down the pipeline.",
        "I still have absolutely no idea how cryptocurrency works. Literally no idea. I just get paid, very little, I pay my bills (barely) and this goes on and on each month. My salary did not go up since Bidens election win, but everything I buy did. How am I supposed to survive if this keeps happening?",
        "Millennials brain child",
        "johhntechie\nThis guy ️️ is really a lifesaver, I don't know what I would have done, he helped me get my money back.  My whole family thanks you and I will recommend you.",
        "WSJ, why not talk about how Democrats profited from FTX? SBF was the second biggest donor 2022.",
        "Your explanation is realistic and straight to the point . On the other hand there are many ways of manipulating the market . I am glad as a small investor , that I am putting my hard earned savings into the most , better said the only transparent market there is day trading . If not for yield via bitcoin trading, this period would have been tough for me. Playing it safe regardless of what is happening in the economy is key and you must work with an advisor. Mr. Frederick Craig Nelson  is my financial advisor, always there to guide me to avoid making looses while trading. I copy trade with his trade signal and i have accumulated over 16.5 btc as a trader with an initial of 4.7 btc as a hodler. he's trust worthy to guide you to invest, trade and earn. If you trade through his guidance and trade signal, profits are assured.",
        "SBF is the fall guy. We need to go deeper.",
        "Gonna report more on this?",
        "Informative content, the easiest way to build a good portfolio is through leverage. I make great returns on my investment  trading with expert broker Sir Arthur Morales, his trading strategies are very exceptional.",
        "Sam is just the face of ftx, there are bigger players behind this company. Sad for Sam he is the only one to be blamed for ftx misconduct.",
        "The thing is, I don't feel sorry for any trader's loss, it's just naive to invest into an unregulated market thinking nothing can go wrong...",
        "That's why you always store your crypto in a Cold wallet, not in the hands of exchange.",
        "KANYE IS RIGHT ABOUT ANOTHER ASHKENAZI HERO SAM BANKMAN-FRIED",
        "Explaining away scams  is always an interesting watch",
        "\"a person familiar to the matter\" lol Gary Gensler is the biggest protected criminal in all this and more",
        "Thanks for the old news wsj",
        "Hahahaha ",
        "He’s obviously a straw man, like Zuckerberg.",
        "He took  investors  funds  and sent it to  the democrats every  democrat  that received stolen money needs to pay it back .",
        "The wealth of the wicked  gone to the righteous",
        "Who'd have guessed when SBF called crypto as a ponzi scheme, he was talking about himself.",
        "The world choose to trust an excel person instead of an experienced person",
        "All lies",
        "I have learned in recent months is to remain calm, especially when it comes to investments in cryptocurrencies. Learn not to sell in a panic when everything goes down and not to buy in euphoria when everything goes up. I advise y'all to forget predictions and start making a good profit now because future valuations are all speculations and guesses. The market is very unstable and you can not tell if it's going bearish or bullish. While myself and others are trading without fear of making a loss others are being patient for the price to skyrocket, I would say trading has been going smoothly for me, I started with 2.5 BTC and i have accumulated over 15 BTC in just Five weeks, with the trading strategy given to me by expert trader VERMONTCORPLTD",
        "The true definition of a mastermind is what this genius is. His outstanding in his field, when it comes to recovery, there is no one better than Z5cracks l literally don’t do recommendations but this man is a legend, l have tried and I can vouch for him.",
        "Scam con ponzi theft",
        "How Gensler is explaining the fraud on FTX sound alot like what hedgefunds are doing on the stock market!",
        "Thanks for the information. It is a real eye-opener.",
        "They (DOJ) need to investigate  Gary Ginsler/SEC.  Investigate the Snuggy Wuvvy relationship between Gary and FTX which has been going on for some time.",
        "Those investing channels really bowed to him.  He wasn't JP Morgan, he was Bernie Madoff.  LOL.",
        "Wasn’t it all Pokémon money to begin with?",
        "There’s a much simpler answer to the question, and it’s one word…GREED",
        "I had a very good experience with these guys!*BOBUTENSIL*  They were very easy to communicate with and did a good job in helping me recover my money when FTX crashed",
        "The problem is that crypto is not just financial products. The finance bros have brought that to crypto. Blockchain technology is so much bigger than just using it like stocks. NFTs for example are the best way to record ownership data on a third party. In that case the root coin is just used to secure the network. All these weird derivatives and loan products are useless to me and I've been in the blockchain space for 12 years. I tried using one of these yield projects once, Thyme Wonderland and it didn't work. I just don't really care about defi. Bitcoin is great for transferring value. Smart contracts are great for storing data, payroll, and other things, but financial derivatives in crypto are just a way for finance bros to pull over their same old boring games from walstreet on to crypto.",
        "In spite the dip in crypto, I still thank you for the level-headed financial advice. I started stock and crypto investment with $4,345 and since following you for few weeks now, I’ve gotten $19,539 in my portfolio\n\nThanks so much Mrs Vellajean Scarlett.",
        "My largest holding is Amazons AMA1000X. Glad it came out to be this. I’m a fanboy and I like Charles. He reminds me of Steve Jobs when he speaks.",
        "This is like being in the Netherlands a few hundred years ago lamenting the crash of the tulip market. Who ever would have thought crypto and tulips might be a highly volatile and temporary foundation of wealth?",
        "Looks like Binance got out relatively unscathed.  They announced their intention in apparent good faith but Madoff could be precedent for clawback.",
        "A 6 minute piece without once using the word fraud. WSJ's standards for you.",
        "today I learned about one project, they say that it has a great future. Guys check it out and give your opinion. The project is called Uniqo",
        "why isn't anybody mentioning how Binance out-played FTX? If it weren't the Binance's move, FTX may have endured the downturn and rebounded. All the financial wrongdoings aside, Binance's move laid coffin and nailed it.",
        "Don’t judge a book by its cover doesn’t apply here folks.",
        "I think..this is the same..system..I've \nSeen..in medical intuitions \nLike with..fisa\"\"& fical;\nWorld\"\"\"!",
        "What went wrong?\nA few privileged individuals in the crypto community enjoyed spending other people’s money now they’re broke!",
        "Well explained. Thank you",
        "I totally agree with what you are saying .... <The fact is, BTC is the future of crypto and the questions traders ask themselves now if this is right time to invest? before jumping into conclusion and think you should take a look at things first. for the past few days the price of BTC has been fluctuating which means the market is currently unstable and you cant tell if it is going bearish or bullish. while others still continue to trade without the fear of making lose, others are being patient. it all depends on the pattern with which you trade and also the source of your signals. i would say trading has been going smoothly for me, i started with 2.5 BTC and i have accumulated over 10.6 BTC in just three weeks, with the trading strategy given to me by expert trader VERMONTCORPLTD",
        "WSJ conveniently left out the part that SBF is the second largest doner to Democrats",
        "Everyone waited for Amazon to create  AMA1000X   and the time is rdy",
        "a royal rug pull on the entire economy, I'm frankly impressed",
        "Great stream, as always. I appreciate the level-headed approach you take to the news and the markets. A lot has changed and that's on everything but the truth is I don't even care much about bullish or bearish market anymore because VERMONTCORPLTD got me cover as I am comfortably making 3.1B T C weekly",
        "I literally doubled $28,000 last 1 hour with  AMA1000X   .",
        "I sincerely appreciate LOATEDCYBER prompt response in resolving this unexpected issue about my scammed USDT. Your willingness to take risks and make quick decisions helped me in getting back my funds. I'm grateful to have such talented and perceptive person like LOATEDCYBER",
        "This is the kind of guy I always fear coward weak and a stingy geek ...this is the people that you stay away from",
        "Even with this current crypto dip, the market has been pretty bad until today it decided to surge. Everybody was  Practically Crying then. It kept  dipping. That's what you get when you feel you can navigate the process on your own. Big thank to Hilder Ferguson. I'm not bothered with how bad the Market is because my assests are insured due to her advice and I still receive my profit.",
        "Unless you can exchange crypto for real goods, it will always be a speculative investment looking for another sucker to think they will find another sucker.",
        "Making money is action. keeping money is behavior.\nGrowing money is knowledge",
        "When it comes to investment, diversification is key. That is why I have my interests set on key sectors based on performance and projected growth. They range from the EV sector, renewable energy, Tech and Health.",
        "Like's 17000 to 1.3m views, and full of fake comments?",
        "Nothing went wrong. The ponzi scheme went perfectly wel. It shows how stupid the big market could be.",
        "Whos in AMA1000X Now that it is released I think we have a huge momentum ",
        "Great video as always. I notice that you display the  AMA1000X   ! I just got some too!",
        "When you buy something worth nothing, well...",
        "AMA1000X will do x100 until next summer, done deal!  Just be patient and HODL",
        "Democratic Money Laundry or war money a normal way for War Machine",
        "AMA1000X Has great potential with the Vasil Fork!!!",
        "Successful people don't become that way overnight. What most people see at a glance wealth, a great career, purpose is the result of hard work and hustle brover time. pray that anyone who reads this will be successful in life.",
        "Everything now going back to its true value",
        "Jeff Bezos is a visionary. AMA1000X is a long hold",
        "The SEC hasn’t been doing much lately anyway ",
        "Something I never understood: If bitcoin is truly decentralised, how is it possible for multiple exchanges to have same prices with small spread differences at all times?",
        "Scam fraud, lock him, where did he hide his money?",
        "What did you expect?  The guy always looks like he rolled out of bed at 2 in the afternoon just to wake and bake and eat a twinkie.  That and the fact that his exchange allows people to buy and sell assets that have a value based on nothing.",
        "I'm betting on  AMA1000X   a very promising coin by amazon with great opportunities",
        "There's a joke here about how certain people are supposed to be good with money. Something Cartman calls Kyle.",
        "What happened to FTX is exactly what banks do with your money. The differance is that they have an unlimited money printer to bail themselves out.",
        "VERMONTCORPLTD is incredibly easy way to track your investments, dividend income and cost basis for tax planning, a very intuitive tool",
        "This is why you keep your crypto off exchanges!!!! Keep it in your personal wallet",
        "<Good to hear your logical analysis. It's been pumping and dumping in this range for ages! It's technically just going sideways, sideways means generally stagnant. Trading went smooth for me. More emphasis should be put into day trading. Thanks to VERMONTCORPLTD   for his amazing skills for helping me earn 9 Btc from 2.9 Btc through day trading. Great TA as always..",
        "If you wanna be successful, you most take responsibility for your emotions, not place the blame on others. In addition to make you feel more guilty about your faults, pointing the finger at others will only serve to increase your sense of personal accountability. There's always a risk in every investment, yet people still invest and succeed. You must look outward if you wanna be successful in life.",
        "What went wrong?! Greed, avarice, corruption, etc. etc. Sheesh! Get a frickin clue!",
        "This kind of event is a great way to filter the shills and scammers from the people that genuinely care about the industry.",
        "Waiting for the movie where SBF is played by Jonah Hill and the screenplay written by Aaron Sorkin.",
        "I thought Tsm ftx.",
        "<Always good to hear your thoughtful and logical analysis. I think we are entering a crab market Personally. We will still get our pumps and dumps but based purely on what the Fed are doing. That being said, as traders we are still making good money Thanks to VERMONTCORPLTD for her amazing skills/signals which helped me earn 9 Btc through daily trading chart.  Great TA as always>",
        "If you're right about this  AMA1000X   this could really help people offset the losses they experienced this year",
        "is it possible AMA1000X reach out 10$ ?? In next 2 year",
        "How did nobody at the Wall Street Journal not see this happening????",
        "How much of the loss found its way into Democrat party hands and how much ended up in Ukraine?",
        "I really appreciate your work, thanks again for your good job ",
        "What went wrong? Greed.",
        "I'm confused as to why any of these cryptocurrencies are \"traded\"  When bitcoin first came out I thought it was amazing, you had a secure transaction with no outside involvement.  Years later after a hiatus of me using bitcoin I tried again.  Deposited a large amount to make a purchase a few days later only to find out I lost hundreds of dollars because the price of bitcoin failed.  I just want to be able to send money via an encrypted transaction with little to no outside influence.  Why is that so hard?",
        "Imagine believing in crypto, serves them just right!",
        "Nothing went wrong. All goes well according to their plan. Right now, they are playing innocent and investigators are playing seriously investigation game.",
        "RESPECT BRO. That's called real skills few hours ago he got my money back. I do appreciate what you're doing, keep it up, I don't have much words to say but every words said about this dude is adequate, I wouldn't be talking here if not for the awesome job they did.",
        "if sbf had put 20 percent of his crypto empire into \"boring\" govt bonds he would still be a billionaire",
        "Moral lesson: Only invest in stuff people actually want and want to keep for themselves.\n\nWhen people only want something to resell it for a bigger price, there are no final customers, people who want that thing to own forever, it's a bubble waiting to burst.",
        "The FTX or the Follyamorous Tax XChange  2022 gaming traders  allegedly",
        "Nothing is going to change until these crooks start receiving street justice.",
        "Did binance just pump and dump FTX ? To solidify theirs rank in the crypto world ?",
        "I will forever be indebted to you, You've changed my whole life and i continue to preach about your name for the whole world to hear you've saved me from a huge financial debt with just little investment,Thanks so much  MARY SMITH",
        "Just use the name mentioned above for your recovery or retirement issues, he made mine completely stress free.  I'm so excited rn",
        "Never understood crypto...still dont",
        "The sec will try to crush crypto but let hedgefunds do whatever they want to stocks.",
        "As an investor I am constantly searching for solid investment opportunities and the ones presented by Mike and his VERMONTCORPLTD  team always rise to the top.  I have invested in seven VERMONTCORPLTD  multi-family projects and each has met or exceeded Mike's well-calculated projections.  Mike is a conscientious investor who maintains discipline in his underwriting and his strategy, to which his success is testament.",
        "This is an amazing  video and i enjoyed every  bit of it.  And i'm also excited to  share my investment  experience so far  this year.  I believe it will help a lot  of people here who are confused  on how to startup theirs and  be productive for  the year .. ...",
        "Getting rich off crypto is much tougher than it seems.I keep losing money while trading with these YouTube videos, and finding a trustworthy professional trader to help out with these trades also appears to be nearly impossible. This is extremely annoying",
        "Criminal Enterprise. That’s what went wrong.",
        "I pulled out as quickly as possible. But it took time because they had a really weird and difficult way to transfer your money out and it was exhausting. Got all my money out. Thank God\n\nI hated FTX. Hated it.",
        "Don’t have the least bit of sympathy for these investors that lost money. If you choose to gamble you should pay the prices if you lose",
        "Stocks and traditional markets are ruined, in a way also the crypt.. but not all of it as the recent announcement of AMA1000X is blowing through all roofs",
        "They have to make an example of SBF and give him the maximum penalty for this kind of violation of trust.",
        "I'll stick to regulated money. Thanks.",
        "Get out of crypto! Check out guaranteed winners and learn from prolific lithium stocks LITHCF & LITM long term (Eric Sprott invested 25 million) and get CTRM a maritime shipping company doing a stock spinoff 2:5 on Dec 6th. Excellent Quant rating. About yo go on a bull run.",
        "Nice trading content for beginners. To effectively examine the workability of this content one needs a good broker like Mrs. Emily Brown . Her business Strategies are more suitable for new investors. Give her a try",
        "H we is a thief!",
        "remember: if it's crypto, it's ALWAYS a scam",
        "LoL lol LoL",
        "I already converted all my ETH to AMA1000X  , now I feel like moving all my BTC to ADA as well.",
        "Elizabeth Holmes-III ?",
        "Most investors are idiots, they follow trends instead of creating it. But they learn nothing at the end. There’s a reason why they call it “Crypto” currency",
        "And no one single word about SBF being the biggest donor for Dems.",
        "A fool and his money are soon parted",
        "what explaining has people got to do? about the lost of crypto currency, they don't even know the inventor of bitcoins is still a secret, no matter how many guys admit this is a big scam, they will defend bitcoin transactions, the only way for them is bump your head, don't complain",
        "The funny part about crypto, is its basically repeating problems the financial institutions went through. Bank runs, how to classify assets on the BS etc.",
        "I'm DCAing in VERMONTCORPLTD as well. ETH heavier DCA and ALGO. I'm taking your advice and starting Google tomorrow with a 50 dollar purchase and continuing Microsoft and Apple. VTI and VOO on another app and longterm portfolio. Here we go family!",
        "Bill gates pls help us.",
        "What makes crypto valuable? I would argue that NOTHING. It is but a supposedly clever computer validations called the Block Chain. But what do you validate against something that is essentially thin air? \n\nIn the early days of civilization, when humans began to learn to trade. But it was more bartering than trades. You bargain for a sag of potatoes for a couple of chickens, something like that. This meant that there was something tangible in the exchange. But as we became more efficient at producing/farming, we get excess produce. You don't want a warehouse full of potatoes, or to build a new chicken shed to keep the extra chickens, you exchange \"tokens\" or cash as we know it. Tokens i the form of hard to get items such as seashells, or even carved stone rings.",
        "BTW Gary Ginsler is very close Sams family. They were working together. We need to know what Gary knew and when!  The SEC's reputation is for protecting the mega rich , not the Citizens.",
        "Hopefully  AMA1000X   will do good.. have alil over 10million  AMA1000X   coins",
        "I love your analysis, so clear and straight to the point. A lesson learnt for everyone and I've seen a lot of CEX sitting up cos of this. I'm looking forward to the Merkle tree reserve certificate from MEXC. It's a new ball game from henceforth, that we all know",
        "Amazon released AMA1000X the first market change this year simply cus of that release ",
        "No one trust legacy media. If I want information about FTX, I will to a source that isn’t compromised or not leaning to one side too much",
        "Words alone can't express how I feel for my withdrawal going through by your help #fleektoolz how I wish I could do more then what I'm just doing thanks man for the Recovery I already followed your Instagram page",
        "The best way to find that balance between saving and living is by investing, This way you get to have your saving intact and then live comfortably off the revenue coming in from your investments. Financial freedom is possible, you just need to know what to do and when to do it. I am a living testimony.",
        "I'm indeed Greatful for your support on making my withdrawal possible, you did keep to your words on getting back my money from ZICTOOLS .",
        "You forgot to mention the MIT connection between Gary Gensler (SEC), Glen Ellison (Garys old boss) , Caroline Allison CEO alemidia doughter of Glen Ellison and Sam Bankman (MIT) relationship to Caroline a full circle of scam need to investigate Citadel to hold this mess whit all naked shorting ",
        "Hahaha, what went wrong?   These people were scammed by these young kids.   I can not believe how many AND  The Who was scammed by these kids.  1st strike this is Crypto currency.   How many of you out there believe these companies, they aren’t a bank they are a business.   2nd issue no can say these companies are following the rules, ohh no rule on these companies, none that will protect you.   I don’t feel sorry for the money lost. People see huge returns on their money and they did not do their due diligence to make sure such a wishy washy business was up and up.   I am sure anyone looking into this company would have seen enough red flags to say no. The funnest part is how all the other crypto businesses dropped like a rock when this company failed.    Fortunately most the people that lost money may not be happy but they will survive.   I told my wife years ago when hit coin came out that watch people will invest and the money will be gone .  Maybe not bitcoin but another company.   It will happen again but much sooner.",
        "I'm glad I never invested in that f**** garbage",
        "Legends still investing in Crypto  ",
        "Google who his brother, mother and aunt are and u will have a clear picture how he pulled it off.",
        "I came here to learn how to invest after listening to a guy on a television program about the importance of investing and how he made $460,000 in 4 months from $160k, somehow this video has helped shed light on some things, but I'm still confused, I'm a newbie and I'm open to ideas.",
        "Since the crypto was all made up the real loss was $2.00",
        "Good grief, the narrator makes my skin crawl. Is professionalism in journalism completely dead? This is not a TikTok video. Act like an adult. Deliver the FACTS without injecting your personal emotion!",
        "So he did some fractional reserve lending like the banks? ",
        "Everyone watch Coffezilla's video. He's been calling out crypto scams for years!",
        "'It is easier for a camel to pass through the eye of a needle than a rich man to enter the Kingdom of Heaven.\" -- J Christ. ",
        "This is what happens when an industry is not regulated. I don’t know why people nowadays don’t want to be regulated. Now they will realize that regulation is an important aspect of healthy financial system.",
        "All ze plan ja,ja,eat ze bugs",
        "A tru Exchange's job is to facilitate trade .. that is all all the nerds and Crypto believers seems to miss that point . Client money on deposit MUST not be used for operational expenses  let alone trading on side!",
        "I really appreciate your clear and simple breakdown on financial pitfalls! I lost so much on Crypto's, but now making around 7-$11k every week trading different on stocks and Cryptocurrencies.",
        "Is this kid the real Mr. Robot??",
        "Money is an issue that everyone has for a better and luxurious life, Life was hard for me until I started trading bitcoin and am now earning $18,435 per week.",
        "Guys, a new \"Uniqu\" project has been released. I advise you to study the information about him, in my opinion a very cool project",
        "My AMA1000X shorts are doing pretty well and I plan to hold much longer.",
        "Another QuadrigaCX. Only difference is CEO is not missing/dead.",
        "took our GPU then, got payback and served.",
        "Success is dependent on the action or steps you take to achieve it.. Show me a man who doesn't have an investment and I will tell you how soon he'll go broke. Investment is building a safe heaven for the future. With the right choice of investment that has at least 1% minimum risk and with an expert guidance profits and interest is 100% guaranteed. I’ve come to realize as an investor that instead of letting my money sit idle in my savings account it’s more productive to invest the little available and build a portfolio from the accumulated profits of investment. The competition is on and every trader wants to be the best and successful but the truth is not everyone can be successful in trading. But I stand to say in Crypto-currency and Stock trading. That's to say trading is more profitable than hodling. I really trust Prof Greg Darrell i have made 0ver 21btc and his services are top notch.",
        "We need more people like you. If we had an army of people like you, we could stamp out these total loss in no time. I love that you re helping the victims, too it's ultra gratifying when you are able to save people in real time like you do thanks for recovering back my money..",
        "I own numerous investment properties and very rarely invest with others as a purely passive investor.  However, I felt very confident with Mike Flaherty’s attention to detail in analyzing the investment, his conservative underwriting approach, his research of the local market, and his thorough understanding and communication of the benefits and risks of the opportunity.  I feel comfortable that my investment expectations will be met with Mike at the helm of the investment VERMONTCORPLTD",
        "I have kept my eye out over the years whenever there is a printed review of portfolio management software. I can say unequivocally that there is not a better all-around portfolio management software program out there today. LIBERTON CORP handles everything... even those esoteric transactions that no one thinks about talking about in the media. And, Quicken is not sophisticated enough to handle the transactions as seamlessly as VERMONTCORPLTD",
        "AMA1000X  Thx for this update",
        "Buying stocks doesn't make you a winner, the ability to make profit daily out of your capital is what makes you a winner, Ray F Johnson made me stop depending on the market price to make profit rather to choose Trading over Holding and it's huge returns are awesome. Can't say much.",
        "Its all a scam",
        "and everyone is acting like this is normal and moving on about their day. welcome to the matrix.",
        "nothing will go wrong until it is wrong. don't worry, only ordinary investors pay the price.",
        "The fin-Markets have underperformed the U.S. economy as fear of inflation hammers the prices of stocks and bonds. My $400,000 portfolio is down by approximately 25%, any recommendations to scale up my returns before will be highly appreciated.",
        "VERMONTCORPLTD does everything I need to manage a number of accounts; it is quite intuitive; it handles large amounts of data so I don't worry even though I have more than 28 different accounts with all their transaction going back many years; the income summaries and basis data are so helpful in preparing my taxes",
        "Great WSJ nice promoting amd legitimizing this guy without ever asking, how did he make his money",
        "When I thought all hope was lost,I was introduced to this dude ️,and I couldn't believe it when he reactivated my FTX account and recoverd all my funds back to me",
        "So turning USD into FTT was a bad play? What’s keeping Bitcoin at $16,000? Hopes and dreams",
        "AMA1000X Saved me after the LUNA Crash",
        "Can you make a video explaining how beginners can make huge profits within a short period of time? I mean I was at a seminar and the host spoke about making well over $880,000 within 4 months of investing $150,000 I just need to know how",
        "The price of BTC declined over 15% and even trade below 16k. Binance opted out to bailFTX, resultin in an increase in selling pressure… The market is bleeding and many altcoins such as eth, bnb, ripple are down over 15%. If BTC fails to start recovery, it could continue to move down. In addition, Godwin Myers has stated his bullish stand on the crypto market. I have made over 22.5 btc from his teachings and his accurate daily trade signal to my trade with just as little as 3.7 btc.",
        "WHAT IS THIS WOURLD COMMING TOO IT'S A SCAM",
        "FTX/Alameda Research makes Enron look like a bunch of highly regulated Boyscouts.\n\nThat Larry David commercial aged very well!!!",
        "Successful people don't become that way overnight. What most people see at a glance-wealth, a great career, purpose-is the result of hard work and hustle over time.",
        "I thought I lost everything until I saw the recommendation about BOBUTENSIL, I had my various doubt, but they were able to help me recover",
        "He stole money from consumers and Gary Ginsler is nowhere to be seen.",
        "Sam Bankman - Thief ;))))",
        "And the money laundering of democrst party and Ukraine??",
        "What about the link to the democrats funding and Ukraine.",
        "I hope you are right about AMA1000X?  Thanks for the highly educational video.  Keep up the good work -",
        "It was wrong from the start.",
        "Crypto Currencies:  Physics matters:  \n\na.  Not everybody has an internet connection.\n\nb.  Not everybody has the same speed internet connection.\n\nc.  Not everybody is at an equal distance from the 'server'.",
        "I have a dozen different investments throughout the world and L5’s rank among the absolute best.  Mike and his team are very knowledgeable in their field, professional and only look for the opportunities that promise good returns.  I am in numerous investments with VERMONTCORPLTD  and can't say enough good",
        "That series of moves by Binance (selling, offering to buy, rescinding) seems suspect. Was Binance conspiring against FTX?",
        "Everyone waited for Amazon to create AMA1000X and the time is ready",
        "You really can’t blame people for investing in something they can actually tangible hold.",
        "Nothing to see here. Go away you minions.",
        "I realized that the secret to making a million is saving for a better investment. I always tell myself you don't need that new Maserati or that vacation just yet. That mindset helped me make more money investing. For example last year I invested 80k in stocks (with the help of my Financial Advisor of course) and made about 246k, but guess what? I put it all back and traded with her again and now I'm rounding up close to a million.",
        "FTX Collapse Is going down for good",
        "\"No one could have foreseen -\" he literally described what he was doing, on a podcast, more than six months ago.",
        "with unpredictable market which goes slightly down, I'd rather save tether",
        "Please read the book:  The Smartest Guys in the Room.",
        "Thank you for being there VERMONTCORPLTD when I wanted you to..... I was lost in this new world that I was hassled to start with ....you not only guided me along the way but you also showed me the proper way....whatever little I have been able to achieve in life is because of you today ..... I want to thank you for being there and showing me the proper way of doing thing for me you are my best guide as you truly showed me the way to life....once again , I would like to tell you a heartfelt thanks for being there.",
        "Never believe that the fish can cry in the river.",
        "No one care about what went wrong, It should had never happened smh.",
        "Хороший еще один прогресс",
        "that's right once in a history even a 12 year old kid and a grandma can do it, no brainer, take customers' money and trade the money against the money!",
        "I wish I invested more USDT in AMA1000X. It has huge potential. The recent pump proved it.",
        "What a cohencidence.",
        "Never Invest in crypto. Tax and accounting nightmare.",
        "Y’all wanted no regulation...ya got it",
        "Now I realize how cryptos currencies like Bitcoin went up so rapidly in last few years. Because there are exchanges like FTX pumped those up like Tulips in the old days! Lol",
        "I can guarantee you the Gary guy from SEC knows more.",
        "WSJ finally talking crypto!  U missed the huge FREE PASS for etherium deep dive. And your readers deserve the truth on Hinman's speech, where SEC employees are now working, and, the ELEPHANT in the room, the Ripple Labs and XRP / SEC lawsuit?  I think the impenetrable platform that is already in major banks delivering 24x7  instant int'l settlement it groundbreaking. Yet crickets.  Step up and do unbiased reporting.",
        "Bankman Fraud is his name",
        "The reason that Sam’s clients (most of whom are super-rich) are not taking any loud action against him in the media is that they are embarrassed in front of the world that they had trusted a kid (literally a child) because of their greed to make money out of thin air and that they have been conned by a kid (literally a kid). This is what greed does to you—you get blind-sighted by a child.",
        "I’m nasuru away by how much this guy actually wants to help people as much as he enjoys messing around with the scammers. Thanks før being good to us!!! \n#z5cracks",
        "What about  AMA1000X",
        "BRO WHY ARE YOU NOT TALKING ABOUT AMA1000X",
        "My family and I have being living a better life ever since I met Loatedcyber\nHe was able to recover my money from FTX completely\nI really appreciate bro️\nYou're the best..",
        "In this era trust is no longer something you can afford to hand off so freely! Lesson learned don’t trust a lot of people and you will stay out of trouble!",
        "When I started properly following up on my investments I started accumulating wealth. The value of expert mentorship cannot be overstated. Without proper mentoring, people tend to exit the market too soon after losing money. That is why I prefer to invest with a professional investment firm because their methods are mind blowing and extremely profitable.",
        "I don't know what I would do without it. VERMONTCORPLTD helps me track and plan my investments. Even though my funds are limited and I am electronically challenged, it works for me. I believe it is a valuable tool for everyone regardless of the size or complexity of accounts. It works well for businesses and individuals.",
        "I didn’t believe that first but this has huge impact  AMA1000X",
        "What also isn’t mentioned here is that the CEO of Alameda (Caroline) is actually SBF’s girlfriend or ex-girlfriend\n\nA whistleblower from Alameda has also made claims of having straight line of credits funded from FTX of up to 9B which presumably could be from customers wallets ",
        "fake news",
        "One word: fraud.",
        "What was the interaction between the SEC and FTX??",
        "What went wrong??? Nothing. This is what happens when you steal peoples money and use it to gamble and finally the house of cards comes falling down. I hope he gets serious jail time but very doubtful. Maybe a disgruntled investor will snuff him out.",
        "Sir, I appreciate you taking the time to recover my money, deep down recommending it to others it is the best i can do",
        "May God bless amazon. the AMA1000X is the game changer",
        "I missed out on crypto's big gains and now I'm missing out on crypto's big crash.  Guess I'm missing out on a lot.  ",
        "Smartest campaign ever that   AMA1000X",
        "We need more people like you Z5CRACKS ON INTERNET .. If we had an army of people like you, we could stamp out these scammers in no time. I love that you're helping the victims, too its ultra gratifying when you are able to save people in real time like you do thanks for recovering mine keep up the good work ",
        "sam will be on his knees a lot in his future",
        "Can’t wait to see this as an accounting case study in a few years ",
        "Another case among many of white blindness syndrome.",
        "Nice content. To me trading the forex and crypto market is way better than any online investment ",
        "So, you give him real dollars and he prints FTX currency in exchange, he goes and buys real things like houses and cars while you get the digital coins in your wallet hoping that someone else buys your digital token for a bigger price...  wow, just wow",
        "I noticed at the start they put cardano as one  of the cryptos that got hurt. I want to be clear when I say, we did not get hurt by this at all. ",
        "A true caliber friend is as hard to come by as a priceless diamond, I am blessed to have this team helping everyone financially, thank you........",
        "The amount of work he put into this recovery process is unbelievable, this is a true legend !!",
        "EVERY FAMILY HAS THAT ONE PERSON WHO WILL BREAK THE FAMILY FINANCIAL STRUGGLE I HOPE I BECOME THE ONE ️... IN A FEW WEEKS I WAS ABLE TO PAY OFF MY DEBTS THROUGH INVESTING IN CRYPTO TRADING",
        "CZ  ",
        "Amazon’s Record breaking coin AMA1000X with actual use case!  Great team and coolest community",
        "I hold AMA1000X. Very promising project, and its ecosystem maintains complete anonymity",
        "Wanna buy some monopoly money ?",
        "Nothing went wrong, it was a scam\nfrom the beginning.",
        "Shaky legs during every interview was the tell.",
        "Seeing  AMA1000X   breaking 1$ had me make out with a random gradma on street today.",
        "who can trust a person with that hair",
        "The time and efforts you put into this work that is beyond excellence. Take my cordial Thsnks! You are really an efficient, organised man, thank you for all the extra hours and extra effort you had put on for getting my account back. I appreciate every bit of your effort. Thank you for pulling this off so smoothly...",
        "If you are not in the financial market space right now, you are making a huge mistake. I understand that it could be due to ignorance, but if you want to build generational wealth, and cultivate financial knowledge, you must be in the market.",
        "so NO indictments? another Bernie Madoff situation???",
        "Why are you not talking about the multiple meetings SBF had with Gary Gensler or that the CEO of Alamada and SBF girl friend is daughter of Gensler's old boss at MIT? This is not a cryptocurrency problem - this is corruption in the legacy financial system going unreported in the legacy media.",
        "If you hold into the crash it's your own fault. Amazons  AMA1000X     the way out and it's here for anyone to use - should be aware on this as a chance this year which is rare even for the century guys",
        "that happens when you trust all your money to Bojack Horseman’s best friend.",
        "computer monny .. hahahaha is not reel monny",
        "Significant jail time is the only way this thief will develop a moral compass.",
        "DON'THATE THE PLAYER , HATE THE GAME.SAM PLAYED the  WORLD.",
        "Think about it. Why would anyone invest with a guy who can't even invest 15 bucks at Supercuts? ",
        "Typical attitude of most millennials we shouldn’t be surprised",
        "Why is the guy not peeling potatoes behind bars?",
        "1:50 was my reaction when my prideful and arrogant social media friends preached to me about investing in crypto.",
        "Might want to take a look under the hood of SBNY",
        "I remember watching Sams video a few months back ... And not surprised at all ",
        "These crypto bs are like the pronouns, nobody gets it",
        "Wasn't he the guy in the Coffezilla video that described his business model and it was a literal ponzi scheme?",
        "Glad I moved all my money into pork bellies.\nWorst case scenario, I'm eating bacon for the rest of my life.\nA lot of people could live with that.",
        "Even with the current dip in crypto, I still thank you for the level-headed financial advice. I started stock and crypto investment with $4,345 and since following you for few weeks now, I've gotten $18,539 in my portfolio. Thanks so much VERMONTCORPLTD",
        "Always be weary of someone who tells you how good of a person they are",
        "Thank you FTX for funding democrats before your downfall.",
        "Loatedcyber is like a brother to everyone, he helped people in every possible way he could and I really appreciate meeting him for my retirement",
        "I am seeing  AMA1000X   everywhere can you make a video for these ico projects especially  AMA1000X",
        "Unlike stocks, your crypto portfolio on these exchanges is actually owned by the exchanges. The account holders got scammed and are screwed. Never keep your coins on an exchange, EVER!",
        "Coins and tokens are utterly without value. People are learning that the hard way now……and there’s more to come.",
        "I adore how this game became even more impressive and ambitious than its predecessor,the graphics,the story,the old and new characters appearing has me blown away. :-O",
        "Your word of encouragement inspire me during a difficult time you never knew how much it meant to me thank you sir for the sucessfully recovery of my 9,600USDT you've got the best in all.",
        "Nothing went wrong it went exactly as they hoped",
        "not dominant, crooked.",
        "Talk about the connection to the democratic party and Ukraine.",
        "Never trust a CEO who doesn’t comb his hair",
        "It’s funny how most of crypto investors don’t want regulations or government involved until they lose money then they start looking for regulators or government to get their money back. Go figure",
        "Hahahahaaaa…..",
        "The smartest thing anyone can think of right now is to invest in various income streams that don't depend on the government. Especially with the current economic crisis across the globe, this is still a good time to start investing in gold, silver and digital currencies (BTC, ETH...).",
        "\"anything big that starts big is a call for concern\". i will never forget this quote from an entrepreneur who made it big time.",
        "Nice trading content for beginners.",
        "Crypto is what  went wrong lol.",
        "Sam was a good guy, he just got a litle bit greedy just like any of us! i.e. watching youtube instead of getting out there and exercise. I am sure Stephen Curry is still wealthier than you even though he lost some money.",
        "Investment is the key to sustaining your financial longevity. And not just any investment but an investment with guaranteed return.",
        "How about the Bernie Madoff of crypto….does that bother you?",
        "Crypto goes down, FTX implodes\nMe: Oh no! You mean the magic bean exchange wasn't worth anything?! How could that PoSsibLy be?!' ",
        "Like that movie Greed Is Good, for a lack of a better word ",
        "Brilliant analysis of the different things to watch for on the different time frames. Good to see everyone feels the same way when they lose money, everyone thinks they could do this or that with that money which is as good as gone, instead people refuse to seek help from professionals, Frederick Craig Nelson set to be different and unique, I have made about $470k already from his day tradng, all i did was to copy his daily signals, am done having heart breaks hodling and trading myself lol.",
        "I will forever be indebted to you, You've changed my whole life and i continue to preach about your name for the whole world to hear you've saved me from a huge financial debt with just little investment,Thanks so much EMILY JOHN.",
        "Please I need someone to help me trade or invest the forex or crypto market because I'm tired of trading in losses myself. I've blown my account twice and it's frustrating..",
        "Lets ready for binance",
        "If a company is suspected of fraud bankruptcy shouldn’t be an option",
        "I*'ll quote a variant on Forrest Gump's \"stupid is...\" axiom: \"fraudulent is as fraudulent does ...\"!",
        "So basically bro lent his giflfriend money, customer money",
        "So far the only person to officially lose their job over the whole FTX scandal was the black guy at CoinBase that said \"hey guys, maybe Kanye was on to something?\".",
        "Hey great story, please keep us informed of your journey.  Just a thought, I noticed the book that got you started was written by Jared Martinez. Jared is known as The FX Chief, he owns a company, Master Traders Institute ( Vermontcorpltd  )in Florida. I am sure he would appreciate your story.",
        "As short on the opposite.",
        "AMA1000X ONLY Few hours OLD !! IMAGINE THE POTENTIAL",
        "The flow and utility of AMA1000X integrating with online stores is just amazing concept through and through",
        "\"even though there has been speculation about Alemeter research and FTX being joined at the hip, nobody could've foreseen that SBF was willing to transfer billions of customer funds at HIS crypto exchange to help HIS crypto trading firm.\" ",
        "I am China, we use Binance. Everyone from USA should use Chinese Binance instead of FTX.",
        "Despite the economic downturn, I'm happy ️. I have been earning $60,200 returns from my $10,000 investment every 13 days",
        "This guy knew what he was doing, he should be held accountable. Investors wants their money back.",
        "if this AMA1000X rises like mana and does x30, I'll get 500k usd",
        "I appreciate Charlie absolutely absorbing that jump scare to protect the rest of us. Truly a hero we do not deserve! :D",
        "Its a ponzi. Only high risk takers or dupes would ever go there. Just useless paper.",
        "Amazon  AMA1000X is the future",
        "I'm speechless, all I have to say is that when it comes to hacking or recovery of funds LOATEDCYBER is genius and perfect\nthanks for helping me get back my money sir..",
        "That HAIR & that VOICE...should've been super early RED FLAGS!  ;)",
        "It’s only a matter of time before the other crypto exchanges go belly up as well, and then our economy will truly be in trouble.",
        "VERMONTCORPLTD has been an invaluable tool for me to keep track of multiple brokerage accounts each holding numerous types of securities. It has allowed me to maintain a comprehensive summary of assets across all of my accounts",
        "Best utility so far in whole crypto space",
        "There are some who lost there life savings",
        "What about how CZ of Binance put nails in their coffin by dumping FTT onto the market,and how much FTX donated to the Democratic party? They are a top donor. What about that?",
        "WE ARE OWED OUR MONEY! HE STOLE DIRECTLY FROM US.",
        "I totally agree with what you are saying....The fact is, BTC is the future of crypto and the questions investors ask them selves now if this is right time to invest? before jumping into conclusion i think you should take a look at things first. for the past few days the price of BTC has been fluctuating which means the market is currently unstable and you cant tell if it is going bearish or bullish. while others still continue to invest without the fear of making lose, others are being patient. it all depends on the pattern with which you trade and Alabama o the source of your signals. i would say trading has been going smoothly for me, i started with 2.5 BTC and i have accumulated over 15.6 BTC in just three weeks, with the strategy given to me by expert Harry J Ledford",
        "With all this crisis happening around the world one needs to have different portfolio,I already invested in forex and crypto which are really profitable.",
        "I already converted all my ETH to  AMA1000X   , now I feel like moving all my BTC to ADA as well.",
        "AMA1000X   will change the trajectory of my future investements/trades.... I feel it!",
        "If CZ was not created panic  situation would have been different."
    ],
    "comments_disabled": false
}