{"video_id": "ag5-v590Ksw", "comments": ["“I believe these ghost pepper wings are spicy”", "I wanna see this man eat as many In-n-out burgers, fries, shakes, and other menu items as he can. Can’t wait for the next one!!", "“Love that chicken and Popeyes!” Gets me every time. Could be the way he says it, could be the fact it’s not quite the phrase, probably both. Simply sublime", "Shoutout Troy fr for putting his personal health on the line for our entertainment and also shoutout Troys girl for making sure Troy doesn’t fall into the abyss of fast food and for taking care of him ", "Troydan literally sacrifices his intestinal integrity to make us laugh. GOAT YouTuber fr", "Petition to eat the entire chickfila menu next. Like if you agree. Also, Jesus loves you all very much!", "This man will forever have my respect for such good content and laughs. I love you TroyDaddy", "The dedication you have to us is much appreciated TroyPapi. We would’ve understood if you didn’t finish, but gotta keep the Timmys happy I guess.", "Never seen Troydan do an eat the menu.  But he’s brilliant for doing this.", "The dedication this man has, also very underrated YouTuber.", "Imagine Troy explaining the doctor in the ER he thinks he ate too many Popeyes lol", "He never fails to entertain us ^_^", "I love when Troy does these kind of videos", "Troy is a treasure and forever will be", "Not sure why troydan continues to subjects himself to this but imma watch every single one regardless ", "I ate two sandwiches from Popeyes once and damn near passed out. You’re a savage for eating the whole menu.", "The fact he doesn't use sauces for a lot of this is crazy", "Dang major respect to troydan for doing this ", "You gotta do the whole Tim Hortons menu next if your a true Canadian", "Respect to troydan he vomited 3 times for our entertainment.Thats true commitment", "This video makes me want to eat more Popeyes.", "You are one hilarious person I laughed the whole time. Love that chicken from Popeyes bahahaha", "Take a shot every time Troy says “Love that chicken from Popeyes”", "gotta love food challenges from troydan", "When he said “dry a$$ biscuits” I rewinded it like 4 times  gotta love this guy", "19:04 I started dying of laughter ", "Mana-thirst is one of the most underrated effects in the game. It allows control decks to play decently stated minions against aggro decks for the tempo, and it allows them to gain some needed value against other control decks in the late-game. Totally underrated effect without much needed craziness in what it does. Very simple design.", "The potatoes and gravy definitely had someone’s balls in it", "You always have a big table for big amount of food I love it keep up the good work", "No way this man is doing good challenges now", "Love the content, keep it up", "Hope you do more of these vids in the future Troy their awesome", "Troydan is a God!! Eating one single biscuit is like sitting in a room full of mustard gas. All hail Troybiscuit", "Troy should eat a whole Chinese restaurant menu", "Troy is rlly a national treasure", "\"my mom called me a munch this morning\" had me crying ", "I swear the poutine wasn't that bad. The cheese wasn't that bad the fries and grave were good. Filled me up and it was pretty good imo", "I lost it with the first dessert", "Troy I’ve been watching since 2016 u don’t disappoint !", "Man you have the best content for putting your health on the line", "Nooo Troy don't do it Agent00 just returned to normal after his popyes lifestyle, also you made me want to get some popyes tonight thank you!", "\"Its too early to poo, I have to hold it in\"\n\nThriller of the year", "Lol Damn That Popeyes sure did come out of all of TroyDaddys Holes ", "0:44 Troy traumatized by them dry ass biscuits. ", "Shoutout to you Troy for staying with the challenge", "Chester always has a good look in every video", "I’ve never seen someone take such small bites ", "Troy u give off hella good energy", "Now for the burger king menu", "To be honest, I cried as Freya desperately broke each of the world tree's branches off. Such phenomenal voice acting, and as a woman who has suffered from the wrath of a man, her line \"get out of me\" hit so close to home. What a powerful moment.", "As a fast food worker myself, if I saw this order I would unalive myself lmao", "How did he not expect the ghost pepper wings to be spicy  literally has ghost pepper in the name", "Those biscuits are staler than hell", "“And of course we got to have a biscuit, so I’ll get 6 biscuits.”", "\"Its too early to poo, I have to hold it in\"\nThriller of the year", "I love how he keeps saying “love that chicken at Popeyes” when you can hear even more clearly in the slowed down version he put in that it’s “love that chicken from Popeyes” lol", "Troy should do the Chick-fil-A menu", "DO MORE FOOD VIDEOS !!", "\"It, bites back... like a nasty h0\"\nBeing just dumped, this really feels.", "at this moment we are watching Troydan slowly turning into nikocado avocado lol", "nice to see you in great spirits troy.", "once you got to the first sandwich I was like oook those things are filling as hell.", "Did he actually think that hot sauce was expired? Lmao", "Chick-fil-A needs to be next. I work at Chick-fil-A and I know that his experience will be better than Popeyes. The worse thing on the menu is probably the parfait or the kale.", "I like the food videos do more Troy Daddy ", "How did ye forget the actual chicken ? ", "We need the entire menu at taco Bell, so poodan spends the week on the dunny with the shits.", "Them biscuits almost took you out my boy ", "I wanna see him try the whole canes or kfc menu", "Good news is the biscuits have no calories lmao", "haven't watched the video yet but bro I'M SO GLAD YOU'RE DOING ANOTHER EATING VIDEO!! Especially cause it's popeyes and i'm from louisiana lol", "why the hell do i decide to watch these when i havent ate all day", "I  every time he said “LOVE THAT CHICKEN AT POPEYES!!” ", "This mans is actually funny af jo", "I liked when he was choking in them biscuits lol funny ", "In order to increase my pack odds I must change my form. Say hello to…. Popeye Dan! That’s right, I’m Popeye!", "Rest in peace insane craft you will be missed.\nHope you release even crazier series after this", "Thousands of peeps lined up? That's what my food service nightmares are made of. A neverending rush, slammed without end for hours on end. Then I wake up and I'm glad I got out. But they're living it.", "Love that chiken of Popeyes ", "Waiting for the massive Louisiana kitchen shit", "Love these videos Troy", "FINALLY ANOTHER IRL FOOD EPISODEEEE", "As a Louisianian this makes me proud", "I love Troydan, it's funny how he doesn't like a lot of Popeyes food but to me it's all good, bc I'm fat", "Me from america casually eating Popeyes while watching ", "I’ve been waiting for another one ", "Me: “Mom, can we see Matt Stonie?”\n\nMom: “We have Matt Stonie at home.”", "Troy is definitely a munch", "when he tried the poutine his face got me dying for the next 20 mins", "Love how he picked the  poo-tine  to eat after he started feeling like he had to go  Troy is the ", "Eat the entire Subway menu next time.", "that foo troy hibernated half way thru ", "The Apple pies are super good and this is a new troy Dan classic", "Dang that must be tough with chicken having so much protein…I can understand how that is so filling", "Now you will have to do a burn 9999 calorie challenge ", "Troy, i’m a fan from the Philippines Watched all your videos and these types of videos of your are so funny. I hope you can try eating Jollibee on your next challenge!", "Them ghost peppers wings with honey are so good", "Can you do this with the wendys menu", "Troy even you should know to request everything freshly made, cause that food sits under the heat lamp all day drying it out", "I got the 30 dollar family meal with 9 big chicken and 2 large fries and 4 biscuits, was really good for price."]}