{
    "video_id": "ag5-v590Ksw",
    "comments": [
        "Next time you should eat from the entire Portillo’s or Culver’s menu.",
        "Hogan court you may wanna edit that out man",
        "Bro is the popeyes president",
        "Somebody sticking there balls in the potato’s had me dead",
        "“it’s like it’s a spoon trying to be a fork”",
        "is this really how clueless Canadian people are",
        "Troy should eat a whole Chinese restaurant menu",
        "Don’t worry I ate the wings with you Troy Dan",
        "Ohh no",
        "If Troy ever does the Fanta dance my life would be complete.",
        "Troydan on top",
        "Troy is a treasure and forever will be",
        "This man should do mr beast burger it’s a short ass menu",
        "What u talking about CAJUN POUTINE IS DA BOMB I ORDER A LOT OF THESE LOL ",
        "how can you hate mac and cheese",
        "If only he had hottie sauce",
        "Bro went to popeyes and didn’t get regular chicken",
        "I LOVE MAC AND CHESSSSE",
        "DO MORE FOOD VIDEOS !!",
        "food looked disgusting. If fast food then I stay with the Döner instead of visiting McDonalds, Popeyes, Burger King or whatever garbage there is.",
        "Cuh",
        "Why not use jelly for the biscuits?",
        "34:12 I think In 2016 is when the Louisiana hot sauce was established",
        "gotta love food challenges from troydan",
        "You thought I was feeling you-",
        "that foo troy hibernated half way thru ",
        "Nah that’s 20k calories",
        "Anthony Edwards Challenge (Impossible)",
        "We need the entire menu at taco Bell, so poodan spends the week on the dunny with the shits.",
        "Chickfila menu next",
        "13:22",
        "Me from america casually eating Popeyes while watching ",
        "In order to increase my pack odds I must change my form. Say hello to…. Popeye Dan! That’s right, I’m Popeye!",
        "The dedication you have to us is much appreciated TroyPapi. We would’ve understood if you didn’t finish, but gotta keep the Timmys happy I guess.",
        "I live in Halifax and the Popeyes is trashhhh",
        "popeyes gravy sucks that cajun spice mixed with the gravy with the poutine is awful",
        "Please adopt Islamic traditions and teachings Troy_Dan ️ ️",
        "Fedyyg",
        "why do i feel like troydan can't drive",
        "look up what a munch is",
        "I'm very surprised you like it lol",
        "I open the video after stopping earlier and hear “I’m gonna die anyway”",
        "For that much money troy you deserve at least 3 girlfriends",
        "watching this after the POPEYE shift hits different",
        "Can't believe he keeps doing these challenges and hasn't figured out to drink diet coke lmao",
        "14:06",
        "GREEN GIANTS",
        "I was just rewatching the Taco Bell video yesterday !!!",
        "wendy’s next",
        "You gonna have a heart attack bro! You need to detox, do an enema, and not eat fried foods for a few weeks",
        "Take a shot every time Troy says “Love that chicken from Popeyes”",
        "Love these videos man Ty",
        "Did he make his head look big on purpose?",
        "This man will forever have my respect for such good content and laughs. I love you TroyDaddy",
        "Can you do this with the wendys menu",
        "when he tried the poutine his face got me dying for the next 20 mins",
        "U got this cuhhhhh",
        "Do a five guys challenge",
        "This video funny asf I'm from New Orleans we got the best Popeyes",
        "bro said so many words on that menu wrong lmao \"caJun\" \"bAyu\" tARtAR\"",
        "im a munch",
        "God loves you Jesus loves you and The Holy Spirit loves you️️️️️️",
        "what desert",
        "False advertisement, it’s 9,999 calories",
        "IT GAVE ME A KFC AD",
        "why use extra food for the thumbnail",
        "Dude thats not how u eat Popyes. You gotta take a bite of everything each time. Lol",
        "sucks that this is false Advertises just to get views.. why i say that is because of all the quick skip edits and everything eles. also when ordering the entire menu that means your order every single item in every make and also every sauce and every soda pop flavor and sizes. god i hate lies.",
        "It’s so weird seeing troy walking.",
        "Do you like Popeyes",
        "I strongly recomend you to stop doing this type of content before you becoming second Nikocado Avocado",
        "the entire sonic menu. since i work at sonic drive in, i think it’d be cool to see",
        "He never fails to entertain us ^_^",
        "I also can't stand coleslaw.",
        "Please do the whole menu of Jollibee from philippines",
        "This video makes me want to eat more Popeyes.",
        "30:39 wow what the fuck was that made me ball",
        "The only reason the chicken is like that is because the bone cracked",
        "U was supposed to put jelly on dem biscuits u ate 8 dry u a warrior",
        "Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh Cuh",
        "\"It, bites back... like a nasty h0\"\nBeing just dumped, this really feels.",
        "He lookslike he lost weight",
        "Bro really put foil in the damn microwave",
        "i really want popeyes",
        "Good to see you not uploading much Nba 2k23 because it is dead.. ",
        "Didn’t get no blackened ranch smh",
        "They got rid of dirty rice but they was going downhill before that so",
        "StonerDan",
        "Don’t get me wrong, 9,999 calories is a lot but like surprisingly not a lot for an entire menu",
        "The employees probably like “This gotta be an error”",
        "you?",
        "TROYS A GOAT",
        "BLM",
        "As someone from louisiana (where popeyes originated) im offended by some of his pronunciation and disrespect.",
        "26:30 cause cold",
        "I thought that rice was maggots at first lmao",
        "5:02 \"Can we get much Higherrrr\"",
        "Agent would have done this challenge easily ",
        "Hating Mac and cheese is a character flaw lmao",
        "POPEYES NEEDS TO SPONSOR YOU BEC U ATE ALL OF THERE FOOD ",
        "Maybe have some heavy exercise before having these food challenges.",
        "Troy, i’m a fan from the Philippines Watched all your videos and these types of videos of your are so funny. I hope you can try eating Jollibee on your next challenge!",
        "It’s pronounced “bye you” not “bay you” lol. Here in Louisiana we just got the blackened chicken sandwich. It’s pretty good! Hopefully y’all get it soon",
        "troy u should do jollibee next",
        "The micro aggression here is crazy️",
        "anthony edwards",
        "YESSS THESE ARE DA BEST VIDS",
        "Bro should've had honey with the biscuits ngl in my opinion",
        "Nothing left on the bone counts as done troy lol",
        "Love the content, keep it up",
        "I like the fact that his gf is considered for our hero:)   I don't think she got her chicken tenders:)",
        "This was prolly the most ‘MERICA video I’ve ever seen which is funny coming from Troy in Canada",
        "No idea how you can actually do this. I’m fully just looking at it ",
        "No one :\nAnthony Edwards:",
        "pls do Chik Fil A next",
        "I work at Popeyes and if we saw that order we wouldn't make it we would say someone has already picked it up or it's the wrong location and it works most of the time they get the refund but it only works with 3rd party apps like door dash and Uber eats etc...but if they order on the Popeyes app we have to make it \nI hate making them 32 piece family meals with like 7 Large sides and 20 biscuits like damn wtf",
        "Sporkdan ",
        "Yeah he didn’t eat the gravy so he never finished the challenge smh nice try tho Troy",
        "Fastfood is repulsive at this point how processed does chicken need to be to be formed in a rip form",
        "Respect to troydan he vomited 3 times for our entertainment.Thats true commitment",
        "I swear the poutine wasn't that bad. The cheese wasn't that bad the fries and grave were good. Filled me up and it was pretty good imo",
        "Every salad from a fast food restaurant",
        "14:49 that’s the most I ever heard him \nNot have that accent",
        "1:56 please tell me that's not how you think bayou is pronounced",
        "microwaved lettuce, yum.",
        "If I do this \nIt will end in Hospital challenge",
        "CuhDan gonna be shitting for days",
        "Hi I apologize for cussing at you and having bad thoughts and I ask for forgiveness",
        "once you got to the first sandwich I was like oook those things are filling as hell.",
        "BoldBQ cuh ",
        "Nice leak Troydaddy",
        "am i trippin or does his voice sound like not canadian it sounds like american",
        "Troydan literally sacrifices his intestinal integrity to make us laugh. GOAT YouTuber fr",
        "try jollibee menu",
        "“I hate Mac and cheese” bro what?",
        "The potatoes and gravy definitely had someone’s balls in it",
        "you made it neat and tidy",
        "Popeye’s is not even that good. But i admit the chicken sandwish is not half bad. \n\nI prefer Jolibee’s chicken though.",
        "Do Burger King or Wendy’s",
        "Troydan. Hey I'm the man you robbed for the Popeye uniform. I WANT IT BACK! U bastard u",
        "Or did they stay broke up",
        "This man just added two pounds of body fat in one day for content. \n\nNot to mention the blood pressure, colesterol, and blood sugar. Couldn’t be me. Respect, I guess ",
        "Troy should do the Chick-fil-A menu",
        "exercise to get hungry",
        "Troydan is a God!! Eating one single biscuit is like sitting in a room full of mustard gas. All hail Troybiscuit",
        "Troydan GODDAMMIT. Please come up with actual quality content. You are funny, and likeable, and even pretty cute. I know you can come up with cooler shit than this. This is a STUNT, cuh. This is that joey guacamole shit. TroyDaddy, I love you and believe in you. You have so much more potential. REALIZE IT.",
        "Popeyes is overrated",
        "Chick fil a",
        "“louisiana moment” is so funny for some reason ",
        "Wonder how many days it took him this wasn't one sitting you can see the cuts",
        "don’t go down this path troydan",
        "You seem like the kinda guy to milk snakes while reciting the North Korean national anthem every Wednesday evening",
        "WATCHING SINCE I WAS A JET LOVE U MAN",
        "Yo Troy maybe shake shacks entire menu plzzzz",
        "dry biscutis for a challenge?\n\nuse gravy",
        "Me: “Mom, can we see Matt Stonie?”\n\nMom: “We have Matt Stonie at home.”",
        "That was a crazy comment  18:09",
        "Ghost pepper wings aint spicy ig im just used to Louisianan food",
        "for sarah",
        "What’s that Hispanic instrumental while Troy eats the ghost pepper wings",
        "I’ve never seen someone take such small bites ",
        "How did he not expect the ghost pepper wings to be spicy  literally has ghost pepper in the name",
        "try jollibee papatroydan!",
        "Try Jollibee menu next time troy!",
        "Took a fall",
        "Do the kfc menu",
        "Gets sauce and doesn’t use any of em that makes sense",
        "Don’t turn into Nickado please",
        "The nap after this meal was extraordinary I already know",
        "Troy makes a sad day a happy day",
        "Popeye's is like McDonald's. Once it gets cold... Just throw it away.",
        "Jesus Christ is our savior, he died on the Cross for our sins. Putting your faith in Him is the only way to get to Heaven when you die️️",
        "Troy is rlly a national treasure",
        "Your not supposed to eat the shrimp tail you can eat the Shrimp head.",
        "it’s a spork Troy",
        "I would love to see do a Wendy’s or other types of food place",
        "eat the whole kfc menu",
        "I feel bad for the people who are making this food and i work at Burger King I know the pain",
        "Been a minute since I watched daddy troydan.",
        "canada popeyes is a L",
        "Chick-fil-A needs to be next. I work at Chick-fil-A and I know that his experience will be better than Popeyes. The worse thing on the menu is probably the parfait or the kale.",
        "You should do chick fila next",
        "4?",
        "No way this man is doing good challenges now",
        "Jollibee Menu next!",
        "You're a great listener.",
        "Don’t fall into a downwards spiral. Please don’t end up like niko",
        "Hope you do more of these vids in the future Troy their awesome",
        "How tf do you not gainweight?!?!",
        "1st person I’ve heard of who hates Mac and cheese",
        "This mans is actually funny af jo",
        "\"My mom called me a munch this morning\"",
        "You should come up to Annapolis Royale and eat at my resteraunt :)",
        "\"spicy ice\" ",
        "My man said bay-u",
        "Ongnin rings lol",
        "\"It bites back like a nasty ho \"",
        "You said your mom called you a maj, maj means buffalo in punjabi",
        "Do Wendy’s next!!",
        "tim hortons menu next",
        "37:17 that gravy looks like cat vomit cuh lol",
        "“Word life” ",
        "Petition to eat the whole kfc menu\nLike if you agreee",
        "Rest in peace insane craft you will be missed.\nHope you release even crazier series after this",
        "Has anyone ever told you that you have great posture?",
        "Got a popeyes ad on this video",
        "a munch ",
        "Eat the entire smokes poutinerie menu. It’s all poutine.",
        "Hi troydaddy",
        "Troy Dan you have to dip your biscuits in some sauce",
        "It",
        "My dude has never heard of a spork?!?!",
        "troydan should make an eating channel",
        "what if you missed an item",
        "keep your stick on thee ice",
        "It don't have to be eating menus but these vlogs are very high quality I love em",
        "Troydan… what happened man",
        "Eat the entire chick fli la menu next",
        "W Troy I love the eating whole menu challenges",
        "Troydan is crazy lol wth",
        "",
        "Popeyes ’s are the worst ",
        "Do chick fila next time",
        "Spicy ice ",
        "RIP Troy's throat (the biscuits u weird fu-)",
        "you forgot the cajun sparkle",
        "To be honest, I cried as Freya desperately broke each of the world tree's branches off. Such phenomenal voice acting, and as a woman who has suffered from the wrath of a man, her line \"get out of me\" hit so close to home. What a powerful moment.",
        "Arby’s and Wendy’s next",
        "Could have gave sum to the homeless in this kinda weather",
        "His voice is irritating.",
        "No sweet tea a Popeyes sacrilege!!!",
        "Is this how you got food poisoning for a week? Lol",
        "Is nobody gonna talk about this man’s microwave",
        "an hour?",
        "I love you troydan",
        "Coleslaw is the best thing with fried chicken g",
        "Hate to say it, but I heard they have full frozen turkeys too",
        "Who is she Troydaddy?",
        "Troy?",
        "Bros gonna be Nicovado",
        "Bro really Hopped in the bath tub,he was being fr tho️",
        "you gotta drink water while doing these, carbonation fills ya",
        "Cole slaw is gross",
        "We need this as an MMG Live Segment",
        "He discovered the spork",
        "W",
        "“My mom called me a munch this morning”",
        "Troydan dont do these alot but good one",
        "Try Jollibee",
        "Bro troydan lookin fit",
        "Eat whataburger next",
        "That's cruel that you were \"forced\" to eat coleslaw.  I'd take 6 more of those Ghost Pepper wings...than eat any coleslaw.\nI'm 200 miles from Louisiana and I can't order Ghost Pepper wings on the Popeyes app?  WTH!!!!  Guess I'll just do their spicy chicken.",
        "Wroy",
        "U RODE I LOVE POUTINE WITH THAT FRIES",
        "He said water squirts out the onion rings ",
        "Chicken sandwiches are overrated. Po Boys were WAY better",
        "Shoutout to you Troy for staying with the challenge",
        "Literally haven’t met a single person who dislikes Mac and Cheese lol",
        "Petition to eat the entire chickfila menu next. Like if you agree. Also, Jesus loves you all very much!",
        "He's mom called he a munch   ",
        "Troydan is so  he doesn't like Mac and cheese ",
        "“It smells like semen” ",
        "more",
        "Gotta do Chick-fil-A if you guys have it",
        "7:05 i happen to know what a munch is, its a person that is trying to hard to get someone or something ",
        "4:98 is a classic",
        "We do indeed love that chicken and popeyes",
        "canadians...",
        "Yo Troy since your from Canada can you try to eat the whole Tim Horton menu pls from Montreal",
        "Good news is the biscuits have no calories lmao",
        "why is there an order limit",
        "I’m confused. Last time I checked biscuits were bread and bread is always dry. I’ve never had a juicy biscuit from anywhere. Why is that a knock on Popeyes biscuit specifically?",
        "Nice troydaddy",
        "I can confirm, I physically and mentally abused the last chicken sandwich you ate ",
        "What is the deal with those tasteless dry biscuits?",
        "“I think i am a munch” MISTA EAT IT AND LEAVEEEE",
        "You seem to really know who you are.",
        "They so stingy with the sauces",
        "W troy",
        "12 hours is wild",
        "I cant afford food atm so i dont eat alot so i can have leftovers THIS MADE ME HUNGRY",
        "Heheha",
        "how you know post editing",
        "Do Jollibee next troy",
        "Hi",
        "The hottie sauce was an endorsement brodie .it was for Megan the Stallion. ALSO……y’all popeyes look so clean.. I live in Louisiana and ours look horrible lol",
        "You can do it",
        "Try Jollibee Menu next. Please",
        "eat the whole burger king menu",
        "Ummm you straight cheated....you ordered a ripn chicken and you put it on the ground saying it was for your girlfriend!!!! LIAR!!!!",
        "13:21 Got me dying (Skull emoji)",
        "Canadian Popeyes",
        "Why is there no MyTeam?",
        "do more 2k pack opening videos",
        "Time for burger King its time to defeat the king",
        "They didn’t make your food good tbh",
        "ranch good",
        "The poor workers that had to make everything on the menu… for ONE guy lol",
        "This guy totally reminds me of morgan from chuch lol. with his beard, and the way he turns his head :P",
        "do Wendy's next",
        "Troydaddy has 3M subs already?",
        "Are the tires on your vehicles there in Canadia really square shaped?",
        "Just don’t make it a trend stay healthy",
        "can someone wright the  time he did on each all menu challenge",
        "Next u should do Arby’s",
        "I bet he vomited so bad",
        "I love how he keeps saying “love that chicken at Popeyes” when you can hear even more clearly in the slowed down version he put in that it’s “love that chicken from Popeyes” lol",
        "Hard and thick, pause",
        "Ps this video is sponsored by Popeyes",
        "Them ghost peppers wings with honey are so good",
        "“Wtf this things like a spoon but trying to be a fork…. Wait maybe that’s what a spork is!?” ",
        "Do jack’s restaurant next",
        "\"my mother called me a munch\" no way ",
        "You never get any separate orders for your gf??? What a Syet .",
        "Earlier today I was watching the Taco Bell one now this one",
        "As a fast food worker myself, if I saw this order I would unalive myself lmao",
        "ok, -rep after you said you absolutely hate mac and cheese. what is wrong with you troydan.... you should be ashamed of yourself.. smh ",
        "It's to try jolibee troy!!",
        "That’s gonna be a mean shit",
        "larry uteck popeyes!",
        "Was hoping u would Puke on the table all over the food",
        "at this moment we are watching Troydan slowly turning into nikocado avocado lol",
        "Lmao let’s go!",
        "Your exercise is somewhat ridiculous biscuits are nevet meant to be eaten by themselves  the gravy duh! Red beans and rice duh! And the ghost pepper dish your worst idea that's more of a challenge. And you are no fried chicken at all.",
        "Troydan should weight himself before and after the challenge",
        "I feel bad for Troy shit dude gets the old batch of biscuits like damn they haven't looked that bad in my life tf I go to popeyes for the biscuits",
        "GET READY TO CLOGGED THE TOILET  ",
        "EAT JOLLIBEE!!!",
        "Troy daddy",
        "bro that belt was sacrifised..sussy",
        "Popeyes is a pretty good fast food chain just remember guys do not eat that sh*t all day everyday. Treat fast food like a treat. Eat it here and there. But Popeyes is good and I’m from the states and I enjoy that fried chicken, lol..",
        "I would absolutely demolish all of that Popeyes….. except the coleslaw",
        "Is Popeyes even good",
        "I’m your biggest fan.",
        "Troykado Avocado",
        "You should do the Burger King menu next",
        "I love Popeyes bubba",
        "GOAT DAN",
        "Bro have this shi isn’t in the US. Wtf bru. Making me hungry and shi",
        "i wanna see him try wingstop bro",
        "W Troy",
        "Cajun and cheese shouldn’t be in the same sentence bro.",
        "Troy shut up and eat those biscuits!!!! ",
        "I wanna see this man eat as many In-n-out burgers, fries, shakes, and other menu items as he can. Can’t wait for the next one!!",
        "A Munch is a person who eats alot of food",
        "No bone in chicken",
        "Now you will have to do a burn 9999 calorie challenge ",
        "this man does the dirtiest bulk ever ",
        "Eat the entire Subway menu next time.",
        "troydans mom is a ice spice fan fr",
        "@troydan pls do the  eating the entire jollibee menu it is better than mcdonalds pls notice this",
        "Do subway sandwiches menu",
        "Try Jollibee next time. A filipino fast food. Better than mcdonals ",
        "Now for the burger king menu",
        "Troydan looks like as if he was doing Mukbang but there is no sound and he’s talking",
        "Love how he picked the  poo-tine  to eat after he started feeling like he had to go  Troy is the ",
        "Man try to put aluminum foil in the microwave",
        "Wait when did Troy get a new gf",
        "You would love the canes menu",
        "I love these",
        "Thank you for the content you create and thankful you still like the NBA, keep up the good work.",
        "It’s always after the fries",
        "4:00 Uhh… does anyone know what Troydan got on that top of that elliptical machine ",
        "Do Tim Hortons full menu",
        "Where did you rob the man for this",
        "Bro really was wearing Gucci belt in a Popeyes costume",
        "you don't wanna know what a munch is troy lol",
        "“I believe these ghost pepper wings are spicy”",
        "Didn’t eat the red beans and rice….. INVALID",
        "lOovE tHee chiCckENN FroOm PopEyeEss",
        "Raising Canes menu could fit in a YouTube short",
        "Those biscuits are staler than hell",
        "This is fucking insane Troydan",
        "chick fil a overrated",
        "Love these videos Troy",
        "Bro really needs an air fryer for these videos",
        "Troy, I really do not appreciate the level of disrespect you showed towards the biscuits.",
        "BOW DOWN TO THE CHAMP CHUMP",
        "Pls don't turn into Nickocado Avocado bro",
        "where was the apple",
        "10:28, 10:31",
        "Not sure why troydan continues to subjects himself to this but imma watch every single one regardless ",
        "You know that food would of been better hot.",
        "Spice ices ",
        "I love this being form Louisiana",
        "My question is how the heck can u hate mac and cheese",
        "Raising Canes next!",
        "I love you Troydan you are the best",
        "Yoo gotta do more of this",
        "bro almost burnt the house down",
        "Do Tim Hortons next please",
        "how ois your networth 250 thousand",
        "you should eat one bite each at the start for the review man",
        "You should do Burger King next",
        "We don’t have onion rings at Popeyes. ",
        "Vid made me hungry for Popeyes",
        "Bro doesn’t know what a spork is",
        "You better love those red bean and rice or I swear .",
        "Poutine is the first thing u eat.  Try a microwave.",
        "U should eat Chinese food next",
        "I stuck my bawls in the potatoes and you rated them a 6",
        "Dang major respect to troydan for doing this ",
        "why the hell do i decide to watch these when i havent ate all day",
        "He looked like Adam Sandler with the Popeyes costume",
        "Eat panda express full menu",
        "He should do Burger King next",
        "Next nickacado avacado",
        "How do u hate Mac and cheese?",
        "Those employees were too nice. Rude and bad service part of the experience.",
        "His Stomach: HELP ME GET THIS STUFF OUT OF ME",
        "Do burger king",
        "A munch is somebody who is a liar basically",
        "I’ve been waiting for this video",
        "5:40 spork",
        "Incomplete challenge becasue you didn’t get the Cajun turkey",
        "POV you don’t know what a fried pie is",
        "This feels wrong for some reason ",
        "I  every time he said “LOVE THAT CHICKEN AT POPEYES!!” ",
        "Not all heroes wear capes.",
        "This the reason you the  who thinks to do this ?!?!",
        "Does Canadian Popeyes not have actual whole pieces of chicken???",
        "Troydan's Food Challenge 3 (Popeye's)",
        "Next is Jollibee Troy",
        "The fact he doesn't use sauces for a lot of this is crazy",
        "I liked when he was choking in them biscuits lol funny ",
        "Troy I’ve been watching since 2016 u don’t disappoint !",
        "Pp",
        "When he said he don’t like Mac and cheese had to leave the video.",
        "The Way Troydan Talks Sounds Like Sportscaster ...",
        "A munch is a proper young man",
        "nice to see you in great spirits troy.",
        "troy your food opinions are invalid as you choose fanta as your choice of beverage",
        "You leaked your adress",
        "Good lord we need a bathroom vlog",
        "Troy even you should know to request everything freshly made, cause that food sits under the heat lamp all day drying it out",
        "He really is clueless most of the time",
        "try jollibee",
        "God loves you Jesus loves you and The Holy Spirit loves you️️",
        "As a Louisianian this makes me proud",
        "I like the food videos do more Troy Daddy ",
        "Eating hockey pucks at the end ",
        "Troy’s a munch ",
        "Do the whole pizza hut menu",
        "Troydan u the most unhealty healtyh person ik",
        "He put his health and credit card for us in these videos w troydan",
        "\"I believe these are hot\"",
        "He looks like if he was forced to do this by a Popeyes CEO with lots of money and a weapon ",
        "The sandwich is great but it's literally the only thing on the menu I like.",
        "I want to know the culture and food of other countries",
        "Well this answers why Troy looks so juicy for a 62yr old",
        "Not the Mack and cheese that is good",
        "Troy do a kfc video",
        "Can you do chic fil a menu",
        "Is Popeyes like kfc? I’m Australian so we don’t get the luxury of Popeyes haha",
        "Burger King up next",
        "Never seen Troydan do an eat the menu.  But he’s brilliant for doing this.",
        "I don't know you and you don't know me, but please don't destroy your body for content like others, people may request more, but please be safe about it.",
        "Remember that one time when Troydan ate all them Popeyes biscuits to win the bourbon bowl do ya?! I don’t know what I’m saying, this video made me malnourished.",
        "I wanna see him try the whole canes or kfc menu",
        "Take a shot every time he says love that chicken from popeyes",
        "lets appreciate how much work sml puts in their videos!",
        "Love that chicken from Popeyes",
        "Nooo Troy don't do it Agent00 just returned to normal after his popyes lifestyle, also you made me want to get some popyes tonight thank you!",
        "This is much different than 2kk",
        "Dl full menu of chick fil a",
        "Seeing “Canada Dry” on the menu ",
        "34:40 cause no gravy",
        "KFC menu next?",
        "troy is slowly turning into nikocado avocado",
        "trouble respect you I no joke threw up watching you down all this. It wasn't the Brett far e in his underwear thing",
        "Well what do u know i had popeyes today",
        "Eat entire Timmy’s menu…. Gotta rep Canada",
        "“Sorry I’m Caucasian” LMAO",
        "“Sorry I’m Caucasian” made me lol",
        "Do KFC next please I’m a big fan",
        "Don’t choke on the biscuits",
        "Man's still doing fire videos",
        "If he cant break bread he fake",
        "Troy once sad “ this is borderline slavery”",
        "I ate two sandwiches from Popeyes once and damn near passed out. You’re a savage for eating the whole menu.",
        "29:46 ",
        "Who doesn't like Mac & cheese?! Canadians are weird... Love ya Troy!",
        "Hey troydan your eating the whole menu of Popeyes your gonna get fat but I'm praying for you to work out",
        "spicy ice 14:04",
        "You can try jollibee",
        "“Pouteen”",
        "how you track what you remove",
        "Me too ",
        "Let s get ot",
        "i love how when he first exploded the cube tnt he was like oh so cute",
        "Bruh why did I get a Popeyes ad before this video",
        "Troy really put foil in the microwave",
        "Worst Popeyes commercial ever! ",
        "Do they still have the po’boy sandwhich? That shit was bomb",
        "Eat the Arby’s menu next",
        "Petition to have troydan go to Culvers next",
        "Troy is turning into Erik the electric",
        "Ungion rings bro",
        "9:20 he sis whatttttt?",
        "Now do Arby’s"
    ],
    "comments_disabled": false
}