{
    "video_id": "akYcnR8cOyM",
    "comments": [
        "How refreshing to have a QB like Tua. Class Act 100 %, the team clearly loves him and respect him.  To many more years of him leading this team.  Go Phins!!!!",
        "He's amazing....Tua #1",
        "With a atmosphere like this. How you can't win. They all love each other efforts.,. I never been so happy in my life to be a DOLPHIN fan. WIN OR LOSE.. I GOT MY CHEST OUT WHEN I TALK ABOUT THEM",
        "MVP",
        "Tua \"The Truth\" Tagovailoa The Man of God the Greatest Quarterback the World has ever seen.....",
        "Was literally checking hourly for this",
        "Tua is him, they hated bro since Bama",
        "lovin them PHINS",
        "We are witnessing greatness. He hasn't even reached his full form yet, and is already at MVP level.",
        "We absolutely love to see it! Been a Dol-Fan since birth (1994). So happy to see this team thriving right now and getting the puzzle pieces together. Tua is the man, and it's so good to see him succeeding despite all the injuries that he endured in his football career. Go Fins!",
        "The best thing I’ve ever seen! ",
        "I love this guy! I always believed in him.",
        "We must protect this man at all costs for so many reasons.... What a good dude, and an EXCELLENT baller",
        "GOOSIES GALORE!!!",
        "Personality-wise we have a 100% different QB from last year and you cant help but cheer him on.",
        "This team is freaking special. Tua and Mike McD need to stick together for a long time.",
        "Phins up baby! ",
        "love seeing tua happy",
        "Can we appreciate robert jones. Eichenberg has been one of the worst guards in the league and rob jones has been so solid. Another reason this offense has been absolutely humming the last 3 games",
        "I love seeing this from Tua been the #1 supporter of him ever since we drafted him and now he’s showing all the haters what he’s about",
        "That's my  QUATERBACK!",
        "The moment between Coach McDaniel and Uno is special man. LFG!!!",
        "How can you hate this man, needs to be in that MVP talk, jus to much people love to criticize him tooooo much, WAY TO GO UCE KEEP IT UP ",
        "glad how happy and how much fun Tua is having",
        "Omg i need Game 11 already",
        "Best mic’d up",
        "why tua got that dollar store ass mic on him bro  come on y’all",
        "8-3, way to go, Phins!!!!!!!!!!! Can we say playoffs, Can we say Super Bowl,, Could be!!!! With Tua at the helm, I believe!!!!!!!",
        "Best one yet",
        "Coaching and players matter !!!",
        "Best quarterback in the league, nobody just wants to talk about it",
        "“Tua Turnemtobelievers”, I created that nickname",
        "Not even going to lie bring Teddy back for another year. This is a good qb room",
        "love seeing tua n teddy",
        "My god he looks SO much different this year. He looks so happy. I love this so much. Was really cool seeing him cheer on Skylar too. What a great dude",
        "I love this kid and he's a winner.",
        "I love to see Tua giddy and jumping around. This makes me happy ",
        "Sky's the limit for this team and Tua, so excited!!!",
        "Give that man not just MVP but also team player of the year. Look how excited he got when skylar got that 1st down!",
        "Dolphins are looking so good this season. Hope they make it all the way.",
        "those mvp chants gotta have him feeling next level!!!! love you uce",
        "Why is he so humble?? I LOVE IT!! PHINS UP ",
        "27 year old fin fan finally gets to feel what winning is like  thanks tua",
        "Thank you for not giving up on Tua. As a Bama fan my whole life, Tua was the best QB that I’ve ever seen.  The guy is just incredible. Great competitor with a heart of gold. Fins Up! Roll Tide! ️",
        "Sounds exactly like I imagined him out there just a kid having a blast toying with their defense!",
        "I love tua",
        "That little “Not your fault, you hear me? Not ur fault” was so kind",
        "I'm the happiest dolphins fan ever",
        "Tua gives me High School football feels. Just having so much fun. Love it.",
        "MVP!!!",
        "🥹🥹🥹 To my true Dolphin fans,we deserve this feeling. ",
        "My man.",
        "Been a Dolphin fan 30 of my 37 years of life man I was here when Marino was in the prime of career to now an I’m glad to see Tua happy big difference from last year. McDaniel definitely was the coach that Tua needed.",
        "Those mvp chants give me goosebumps",
        "Tua is calling Browns' Willis \"UCE\" for the Samoa \"Uso.\"  Is Willis Samoan?",
        "I love happy Tua so much!!",
        "the content i never knew i needed",
        "A happy, giggling , dancing Tua is the nFL,'s worst nightmare. It means he knows that this offense is unstoppable and he knows you know it too",
        "Mvp chants gimmie chills",
        "Genuine!",
        "Superbowl",
        "i love tua and this team it feels nice to be good for once",
        "When 305Tua says to Coach 'I don't care about the yards I just want the tuddys ' Hell yeah we're bringing it ",
        "My uso let’s go ….",
        "What a classy guy ",
        "Tua is actually the dude Russell Wilson pretends to be...",
        "28 years of being a Dol-Fan and it is FINALLY nice to have a franchise QB and an amazing head coach. I can’t wait for the years to come with these 2. Truly blessed. Fins Up!",
        "M.V.P !!!!!",
        "He's a baller. Genuinely seems like a great lad as well.",
        "2 head injuries (concussion) in less than 4 days yikes. Experts say he should retire already ",
        "The way Tua made sure jeff wilson was safe but so much joy in my heart",
        "WELCOME TUA MIAMI!!! TUA TIME!!!",
        "look at the chat  everyone so angry at me hahahah",
        "Too much fun ",
        "He gon be a legend",
        "McDaniel got that percentage fast",
        "The LOOOOOVE that permeates the whole team is beautiful 🥹",
        "Tua is such a good dude fr and those MVP chants are finally here ",
        "Tua and Teddy is a duo I didn’t expect to love",
        "42 years old and have been a Fin Fan my entire life. Been a long time since there’s been so much to cheer for. So glad we got this group this season. Finish strong and make a deep playoff push. FinsUp!!",
        "Tua just loves the game.",
        "i was not tryna be in your graveyard.",
        "Let’s Freaking Gooo UCE!!! ",
        "How long he been back? He forure gonna CTE... sad",
        "Is this real life!? We've been bad for so long....",
        "What a happy dude!",
        "Gonna let that dude get some confidence and swagger and the hole league will be In trouble",
        "@omar Kelly doesn’t look very weird to me",
        "I have watched this not Tua enough",
        "Tua MVP!!!",
        "Go Tua. Go phins",
        "When Flo was here the team morale was dark. Now it looks like their at Disneyland  This year is already special and it's just getting started. Phins up!!",
        "This whole team has such a vibe.  Coach, QB, Tyreek and Waddle.  Now Wilson and Mostert.  I've been waiting a very long for the Fins to be a contender.  I've never seen anything like this team.",
        "Uno is him",
        "This was amazing. He is having so much fun. His energy is flowing through the team. It's special!",
        "M V P !!!",
        "Love that Teddy is giving Tua some advice.. glad teddy is enjoying his role here… great so flo guy(even though he did lose when he played )",
        "One of the guys that needs motivation, encouragement, and boost in confidence is J. Sanders. He must forget his bad kicks and focus from now on. We need him.",
        "I had a smile on my face from ear to ear for the entirety of this video! It's SOOO good to see Tua having fun and looking like he's enjoying playing football again. I watch all of Miami's games and every time I see him play I'm yelling \"Alabama Tua!\" The haters are AWFULLY QUIET these days! I LOVE seeing him shutting them the F up! Way to let your haters be your motivators TUA! Keep balling out! Keep doing you! I'm ABSOLUTELY LOVING IT!!!! Fins Up!!!",
        "Tua to Coach: \"Which play do you like? Because I like the one YOU think will get us a touchdown...\"\nCoach: \"Well I'll go _____.\"\nTOUCHDOWN!\nThat's chemistry.",
        "Dolphins are loaded.Phins up!",
        "Love Teddy B man",
        "numero uno is him",
        "HOW CAN ANYONE HATE THIS KID? IF YOU HATE THIS KID IN ANYWAY YOU MUST HAVE A REALLY SAD LIFE.",
        "Allen real MVP. Tua Trash. Bills mafia cumin",
        "He just looks glad to be here, it’s so heartwarming",
        "Halfway through this video I did not realise how hard I was smiling  Tua brings out the happy happy joy joy in my heart and shows nothing but love and encouragement for his fellow warriors. ️  reminds me how special it was in the trenches of sport with my boys.",
        "Great to see the Dolphins in such a happy place but especially Tua he has a great nature",
        "That’s my quarterback",
        "Finally the MVP mic’d up! Lmaooo so wholesome",
        "THATS MY MVP",
        "I haven't been sho excited to be a phins fan since marino!",
        "2nd time he’s been mic’d up this season. First time was against the Bengals.",
        "Tua is too humble",
        "this qb is special",
        "How can you not route for this guy? love him. Fins Up!",
        "I want to go back to old videos and see how many people praising him now wanted him gone last year. I been a Tua fan since college.  I am loving these people dogging  sanders but in 2020 they was saying he was the best in the league. I still know he good but in a slump right now. He will be back",
        "LFG IN TUA WE TRUST",
        "As a Dolphin fan very happy to see Tua and his sportmenship and keeping his attitude positive happy he is back on the feild  Phins uppp",
        "Hill is ready to LET LOOSE",
        "I love seeing Tua happy. Such a different demeanor than when Flo was here.",
        "Not a coach",
        "Cleveland browns",
        "This guy is just awesome",
        "I love how excited tua got fit skyler",
        "Feeling the flow. Working it. Working it.",
        "“I like the one you think gets us a touchdown”\n\ngets touchdown",
        "The best QB since Marino",
        "Can't help but smile ear to ear the whole time watching this",
        "MVP MVP",
        "I love this young man. He deserves all the praise he’s getting now and in the future. I’m really starting to believe this is going to be a magical season!",
        "Tua is so relaxed out there.   Having fun.   It's leading to great things!",
        "Im a Niner fan, and also Samoan… I hated that McDaniels left but damn I’m happy he landed with the uso TUA. My niners be taking Ls but I haven’t missed a Dolphins game the last two seasons. Love this team, hope they go all the way!",
        "That’s my QB 1",
        "me smiling the whole time ",
        "I'm over here damn near happier than Tua. ",
        "Do the 34 of us waiting get free super bowl tickets when the dolphins go",
        "The Samoan sniper",
        "What did he say to clowney?",
        "Tua getting more excited for Skyler Thompson on the sideline than he did for himself all game is peak wholesome",
        "Never seen my QB this happy  you deserve it all uno !!! New Miami let’s go!!!",
        "Man, I’m really hoping dolphins go far into the playoffs. They are my favorite team to watch this year!",
        "What a class act!! Uno is ELITE and humble.",
        "I could literally cry rn. How do you not feel good for this man. 2 years of unwarranted scrutiny to MVP candidate ",
        "I absolutely love my quarterback mic'd up he is for Real",
        "Tua the movie!...the incredible story of an underdog kid...Alabama qb...broken hip...hated by org..concussion...only to rise and raise the Lombardi..I can see it",
        "first time that I actually seen him into the game . He usually sitting by himself set back from the field.",
        "this made me like bridgewater so much more haha",
        "The mvp chants at the end gave me goosebumps. How long has it been since we've had an mvp caliber qb heading into week 10?  An mvp caliber anything for that matter....... what a fun season so far. Keep chopping that wood!",
        "Tears of effen joy. Go Phins. Phination can't be anymore happy for our dog, Tua \"The Samoan Sniper\"",
        "I love how the Uso is just having fun out there",
        "THATS MY QB! Shine young man we believe in you! ",
        "What an amazing athlete and human being! Go phins! ️",
        "Tua is a natural born leader and on a solid team. Dolphins are legit.",
        "I remember fitzpatrick made the energy awesome but flo killed tuas mojo. Glad flo is gone. But should kept Fitz as backup",
        "For all you Phin fans out there, if you haven’t watched the full episodes of when Tua won the Elite 11, watch it asap. I’ve been a huge fan of his since then. Trent Dilfer and all the coaches were effusive in praising Tua. His mindset is the same now as it was when he was a teenager. He’s transcendent.",
        "A healthy relationship with a coach really pulls greatness out of you. Just the way tua respects his coach and coach respects Tua.",
        "That MVP  chants at the end hit hard!",
        "Win",
        "He’s holding back what a humble dude u can tell he jus wants to rage but he’s keeping his head down and celebrating gracefully",
        "he sounds like olaf",
        "He’s a special player, MVP all the way!",
        "Teddy reminds me of Jay z with that do",
        "Just look at this dude!! Look at him in this vid... no one can tell me hiring mcdaniel isnt the best thing this franchise has done since drafting Marino... sorry but flo had to go so we could get the best head coach in the league... I’m so happy for tua and everyone on the team.. I cannot believe how much fun they’re having and how well they’re playing and this transformation happened in 1 off-season.. that’s insane! This is gonna be normal for years to come... what a bright future the Miami dolphins have... finally we got it figured out ",
        "“You like Bobby boshey”",
        "After two concussions, I'm sooooooo excited that he's back in the game and having a great time with his teammates! Fins up!",
        "Dolphins fans don’t deserve Tua.",
        "He never should been allowed back, ever.",
        "Been a fan  since pre-Marino. Happy for Tua, McDaniel and ALL the players. But also -- thank you Miami Dolphins! Because I'm happy for us fans who have waited for long -- LOVE this team",
        "Wow, when I saw and heard how calm and nice the coach was to Tua, I couldn't believe it. What a difference from the previous coach!",
        "That’s what you call being in the Zone!!! PHINS UP!!!  TUA TIME!!!",
        "IM A BENGALS FAN BUT HAVE FRIENDS WHO LIVE IN FLORIDA. THIS QB TUA IS WAY BETTER THEN BURROWS. BENGALS HAVE A LOT OF GREAT PLAYERS. DOLPINS CANT DEPEND ON JUST THE QB.",
        "Mike McDaniel is the best thing that's happened to this team in a long, long time!",
        "I almost cried watching this. WTF. \n\nWe been through a lot the last 15  years guys....this is insane. \nThere's room on the bandwagon, everyone is welcome, just know there's fans that are touched by these performances we you guys are def different than any other team personality wise and genuine characters. Love you all <3",
        "It’s been a long time since MVP chants have been yelled…. Exciting times.",
        "25 years i’ve been alive and a Dolphins fan… not once have I seem this type of QB.. not for us. This guy with our new coach McDaniel..  man.. these dudes are something special. The respect he has from everyone even other players is amazing. Well done Dolphins organization. ",
        "Tua is the freaking man bro.",
        "I was the biggest tua doubters of dolphin fans.",
        "Listen to both teams talk to one another after the game.  Awesome",
        "Mc Daniels got Tua his Mojo back yeah baby",
        "That’s my QB 🥹",
        "I’ve been a dolphins fan for 22 years of my 30 year old life…a die hard fan at that. I remember that 1-15 year like it was yesterday. Something about this team just feel different, unlike any other dolphins team I’ve had the ability to watch. Every time I see them play it puts a big smile on my face. They get better and better every year for the last 2-4 years. This years gonna go down in the books. Glad to be here to see it happen. Keeping grinding fellas.",
        "Dolphins you got this throw them fins up baby",
        "MVP MVP MVP TUA",
        "That was awesome. Love Tua man so inspirational",
        "Dude seems so happy & confident! M.V.P.",
        "Great jobs phins ..",
        "Love to see it.",
        "You ARE da man Tua!! Marino 2.0!! Been waiting a LONG time 4 this!! Keep believing!!",
        "i love this team so much. i don’t know any of these guys personally but i would give them my kidney if they asked for it. miami fans have waited so long for a team like this. and we’re just really happy for tua, he deserves to shine.",
        "He’s having fun like a kid a recess.  to see it.",
        "Do yourself a favor and YouTube footage from last season. I have never doubted Tua, but the energy, scheme and personnel, it’s like a complete 180.",
        "I LOVE HIM SO MUCH",
        "Tua needs to wear a flak jacket. We need this man to stay healthy. He is really fun to watch out there",
        "Tua= Bobby Boucher ",
        "how can people hate on this Kid i dont get it..",
        "Great environment ,  Great talent, Great results",
        "I have been a Dolphin  fan since 1974. I admit Tua is good but he has a big head. His jumping around and acting a fool on the field is a bit Conceited. But we are all different God bless.",
        "we noticed that you cut out the part where he went to pray, Dolphins. We see you.",
        "Finally the Dolphins are playing HAPPY!",
        "I absolutely positively love this kid how could you not love this kid he has turned a franchise around. Yes he has gotten superior weapons to work with but somebody has to get the ball to them the humility the work ethic and wholesomeness of his character is going to take this team to their goal",
        "W",
        "MVP MVP MVP MVP!!!...",
        "Tua wasn’t kidding. There really was a lot of language in this. \n\nThe wholesomeness is awesome.",
        "Love his energy and the relationships that he is building with the coaches and other players!",
        "M. V. P.",
        "This one compared to the old miced up vs the jets, he’s a completely different person. Amazing what a good coach and good people around you can do, he’s finally himself!",
        "good day to be a Phin Fan",
        "How can you not love everything about his ALOHA SPIRIT. THATS MY QB!! PHINS UP BABY",
        "SHOUT OUT TO WIDE RECIEVER COACH WES WELKER..WE LOVE YOU",
        "If anyone says anything negative about this man, they need to look at themselves in the mirror.",
        "If Tua doesn’t play well his 400lb father will spank him with a Bible and his belt. Spank that weakness right out of him.",
        "That’s my MVP",
        "''I love the one you think will get us a touchdown.\" Thats confidence!",
        "How can you not love this guy... His energy is so great.",
        "LETS GOOO!!!!",
        "Old boy is out there having fun and putting good plays together ",
        "NATURAL AURA OF AN ISLANDER",
        "How Russell Wilson sees himself",
        "I never thought Tua would turn it around like this!  I am and have always been a Hugh Dolphins fan and I could not be happier!",
        "Wooooo, wooooo hell yeah that man is winning us games and enjoying it just like us. Love to see it",
        "The offensive line has good reason to keep this man up right.  When He is they all win!",
        "Not one bad word ever comes out of his mouth, any of them!  What an absolute joy to watch. Love this team!",
        "That MVP chant at the end gave me goosebumps ",
        "Watching this with the biggest smile on my face. So happy for Tua man, he’s our future! Thank you Uno!",
        "Awe God bless him and keep him safe and healthy for years to come. So wholesome to see how the joy he has for the game and this team.",
        "This is the  Tua!  Productive and happy!  Watching him and Coach McD, they're like brothers...Best friends.  Amazing to watch this! We luv us some Tua",
        "Bengals fan here, it's a pleasure to see him healthy and doing well. Hard not to root for him, will be doing that until they face my Bengals again....when that happens i'll root for Tua to have a good abd health game, but come up just short :)",
        "not full 10 mins ️",
        "Tua is a winner!!!",
        "Keep Teddy around",
        "Tua: \"its not on you\" ..... \nA real LEADER!!!!",
        "\"It just means were efficient\"",
        "He’s gonna win the real MVP soon and Pro Bowl Stay Tuned Fins  up",
        "Tua and teddys relationship looks cool",
        "MVP MVP MVP MVP MVP",
        "Nobody can tell me that there is another team in the league having more fun than the Miami Dolphins. The more the Samoan sniper gets stronger and more confident the more this league gets in trouble. This dude and mystic Mike are orchestrating a symphony offensively and and casuals are too dumb to realize it until it’s too late and we put up 40 points",
        "️",
        "Love the MVP chants in the end. This is amazing.",
        "I like how he lets his Teammates know he is mic'd up so they don't say anything crazy lol. As someone who runs its mouth a little too much, I appreciate this.",
        "I don't just feel superbowl. I feel DYNASTY",
        "I've been a dolphins fan since 74 and never seen a player transform so quickly. The power of believe from head coach , players,, front office and the fans is something to behold.",
        "That's MY QUARTERBACK!!! Uno is H1M!!! Keep on balling, Tua!!! Fins up!!! ",
        "This guy playing like the truth ",
        "These guys are having fun and the future looks quite \"Bright\" for my Fins!",
        "MVP MVP MVP",
        "The energy tua brings is electrifying. No wonder we win every game he plays. He is our energy. He is the MVP",
        "Man went from being hated by the fanbase to getting MVP chants.",
        "He looks so happy. We finally have a franchise QB 🥹",
        "Love Tua, very positive, shows his other players respect and respect goes a long way, God bless him",
        "He's freaking amazing I'm buying his jersey \n-Raiders fan",
        "MVP MVP MVP MVP MVP MVP MVP MVP MVP MVP MVP MVP MVP MVP MVP MVP MVP MVP",
        "I’m so happy he’s playing excited! Love it",
        "love to see tuas energy",
        "The Samoan Sniper🇦🇸🇼🇸",
        "What a class act! No foul language, respectable, and leads by example.. Dan Marino must be proud im sure.. Its fun watching the Phins again!  Get em Tua!",
        "I want Tua micd up every game",
        "He's such a wholesome dude. Very easy to root for. Looking forward to everything else he's about to achieve!! ",
        "Tua \n1st in yds per pass attempt\n4th in yds per game\n3rd in TDs",
        "Teddy is definitely the right guy to be backing up Tua that guy has always been a leader and always seems like he’s willing to help. Tua though looks incredibly confident and I love it and that’s what is making him play like the mvp right now he’s a baller",
        "B Chubb do it again!!! I love this team ",
        "Thats my QB. I love you, Tua.",
        "QB1 ",
        "I love seeing Tua happy. Such a different dimeanor than when Flo was here.",
        "That is a man having FUN!!!!!\nLove coach and Qb1",
        "That 3rd down sneak was BS. They moved like 2 yards",
        "Teddy was a very good Co-star in this! Words of wisdom he passed on to Tua",
        "GOOOSIESSSSSS - TOBIN",
        "It’s been a rough time being a dolphin fan the last 7 8 years but this guy gives me so much hope",
        "this is so amazing to see anyone who saying tua is not THE guy is absolutely wrong this man is a leader.",
        "When it comes to the players being mic'd up I'd prefer them not know they are mic'd up so we can get real  game time conversations otherwise what's the point, if nothing else just dont advertise being mic'd. also its just 10 minutes of repeated \"hey I'm mic'd up\" ",
        "Tua + McDaniel = Super Bowl Contenders",
        "That's my DAMN QB!",
        "finally they mic up the best player in the nfl",
        "Big Tua energy!",
        "Bridewater said “you in Miami. when you make a play you gotta have swag”",
        "One of the best edge rusher in the league gave him his props after the game because he has seen how good Tua is up close and person. So why can't the Sports critics do the same. #1 hater (Chris Simms)",
        "Let’s ride",
        "Tua whole game - wooooo",
        "How does anyone not love this kid? Absolutely Killing it out there Tua!! Fins Up!!",
        "He’s having so much fun.  Love it!  Show them who you are!",
        "This is so amazing 20 years of being alive and I’ve never been this excited about my dolphins!!! Fins Up!!!!!!!!!1",
        "so nice to see him happy. i’m more excited that he’s enjoying himself finally than seeing his massive jump in play. It’s so refreshing to see",
        "Phins up! Superbowl season with our one and only UNDEFEATED TAGOVAILOA",
        "Imagine censoring stand-up comedy",
        "I need to show this boy some new moves man. He only ever do that dance. ",
        "He’s so humble and doesn’t care about his stats. He just wants to do good for his team 🥹",
        "Tua even talking like Mike when he talked to him",
        "This years gonna go down in the books. Glad to be here to see it happen. Keeping grinding fellas.",
        "Im mucked up. A.K.A be respectful,",
        "Was excited to see this one, I feel tua is real chill and controlled in his interviews with media so to see him just being his on field self is awesome and good to see him enjoying himself after everybody was writing him off and can’t explain how happy I am to see this team doing so well",
        "Love this guy.   I hope he wins a SB and the MVP.",
        "I love seeing Tua enjoy himself and the game!! I just started getting into football not too long ago and he’s such a great player to watch ",
        "I LOVE IT",
        "Tua Time ",
        "If you know my first name you know why I've been a dolphins fan since I was born. Fins up .",
        "coming to the next game for the first time",
        "MVP MVP MVP MVP",
        "The energy in Miami man",
        "This league have no idea what’s about to hit every team in the next 4 years with this dolphins",
        "Tua for MVP",
        "I love this team so much bruh never been happier to be a dolphins fan",
        "When you love what you do, you won’t work another day in your life .. literally",
        "Bama gave Miami a gift.  To think that he almost slipped through and gets dragged down by the haters is purely shocking.  There are still some haters left but thank God the transformation is completed.  Bama Tua has finally arrived. Coach Mac, Reek, Waddle, Gisecki,  and the rest of the gang.  Miami Dolphins are you ready for some football?????!!!!!!!    Fins up.",
        "Tua anytime something good happens: Woooooooo",
        "What did he say to Clowney? ",
        "McDaniel changed the culture ! Super Bowl culture ",
        "Leadership by example",
        "Wow I just smiled ear to ear through this entire 10 minute video I wish we had more give us the whole game",
        "Only with that positive mind and upbeat is that Tua could overcome all the adversities since he was injured in college.  He leads by exemple not by yelling and trashing.",
        "THE GOAT",
        "For a guy I’ve never met and will probably never meet- I love this guy. Lead us 1  ",
        "This gives me Cam newton vibes when they did good that 1 year, also the team dynamic here compared to the Raiders, omg..",
        "Does anyone else say. What if Tua did not get injured and was out for 3 games. The FIN maybe 10-0??? They only lost 3 while he was out.  Thoughts??",
        "Am i the only one that couldn’t stop smiling ",
        "Sick of people acting suprised tua was this good , so none of you watch him at alabama when he was putting up 45 points in the first half of every game?",
        "Miami dolphins finally got a good coach",
        "BIG UCE! Been your fan since day one. So happy to see you happy Tua.",
        "I freaking love this team!!!",
        "Love this, coach telling him his stats for past three games! FINS UP!!",
        "dude is loving the game rn <3",
        "I love teddy B hyping him up, man I love THIS TEAM",
        "he is here , our leader \"Tan Marino\" lol ,Seriously  the happiest i can ever remember being as a 37 y/o life long phin fan , this is what it used to feel like when marino played , i hope the fans of my generation can finally feel what a Superbowl victory feels like , tua we love you bro and the fan base is 100% behind you and got your back win , lose, or draw . \"Tan Marino \"",
        "I’m not a Dolphins fan but I love the young uso. It just amazes me what can happen you have a coach that believes in you. Tua was always a baller. Keep it up uso.",
        "LOVE IT!!  M.V.P.  Legit!!",
        "You know what I'm a dolphins fan and Miami got two qb that good Skyler and Tua 1 and 1a",
        "Think of the story line…..battle of bama qb’s in the super bowl…..you know that’s huge ratings for nfl……..eagles vs fins Super Bowl….watch it play out…….",
        "Uno. ",
        "This is our year",
        "Let's go 17,534,295,546x",
        "that mvp gave me chills to see what he has done before his concussion and after is amazing god bless tua and our phins let’s keep griding",
        "Salvon Ahmed got them vocals",
        "Y'all can't tell me this kid ain't special. No one can. Everything is about the cohesion that comes about when you have a culmination of all the right pieces from top to bottom.\n\nThe Tua slander doesn't even phase me anymore because at this point the haters are literally looking crazy ",
        "This Team is awesome. Tua T is the man. Coach McDaniel is a mad scientist. Love these guys. Pleasure to watch.",
        "That alabama alum Pic at the end I need it",
        "️Tua telling Garret you not sending me to his cemetery he’s learning get rid of the ball ",
        "It's almost like he gets to play the game he loves for a living and is doing it at the highest level. How can one not be as happy as he is right now surrounded by competent players and coaches allowing him to do what he is doing.",
        "Those mvp chants at the end  feels good man",
        "I find it extremely hard not to like Tua. He has fun and it flows over to the other players.",
        "such a humble man",
        "That's my quarterback (TO voice)",
        "Praying at centerfield, absolutely love to see it !!!!",
        "Teddy Bridgewater seems chill af Bobby Boucher… Mama says…  love thag movie",
        "just started watching the nfl and i’m a Rams fan but golleeee i am most definitely a Tua fan. went to go see Tua in miami against the steelers for my first in person NFL game and it was amazing.",
        "Chris Grier drafted tua and waddle.  Traded for tyreek and also hired McDaniel",
        "a healthy ... and having fun Tua is great to see.",
        "Simply amazing to see our QB and his teammates absolutely loving their results, sharing the enthusiasm, supporting each other and playing the best FB I've seen in a long time. How old am I.  My first FB game was in the Orange Bowl when I watched Super Bowl III as an 8 year old boy.",
        "THATS MY FRANCHISE QB",
        "Tua sounds like Mcdaniel for a little",
        "No Myles graveyard ",
        "There are plenty of Tua positive comments here. I agree with them all. But it just breaks my heart to not see Gesicki happy. He looks miserable on the sideline there. Wish he would get more touches.",
        "Tua is so awkward I love it",
        "Amazing he is going to set records",
        "OMG I LOVE THIS TEAM",
        "This kid Tua is  really influencing the field (God, Universe) with his emotions/feelings. He's gonna attract more good things in his career. He's really feeling it. On top of that he's got my respect bc he's so humble and respectful himself. He's got my vote for sure. Fins up. Haha.",
        "Thanks Tua !!!!",
        "\"MVP\" chants at the end if the video ",
        "Mike McDaniel is all he needed",
        "Love it! ️",
        "@Miami Dolphins...73k in 8 hours...best MIC'D video counts in the history of Tua-Dolphins Era!!! It shows everything Good about the Dolphins",
        "A Humble beast!!!  He loves to play football. May not be the best speech giver, but when on the field he is in full command & where he belongs. The coach has a great relationship with him and as  you see he doesn't want the credit he deserves, just wants to keep playing at a high level, not talk about what he accomplished only a few minutes before. At the end \"MVP MVP\" chants reighning down on him from the crowd, he took it in \"thank you, thank you\" but as humbly as you can. Gotta love TUA!!",
        "I've never been happier.",
        "THE SAMOAN SNIPER!!!",
        "Being a Dolphins fan is so strange, 20 years of absolute mediocrity and now it literally feels like overnight this team got super good. Us true Dolphin fans know what I’m talking about when i say it doesn’t even feel real. It’s hard to put into words this certain feeling. It’s wild. LFG Tua and the boys!! ",
        "Tua is the fn man. He was at Alabama and now killing it with the fins. Thank you Miami Mike. This team is legit and going deep in playoffs.",
        "I can't help but to think about his joke with Saban after he won the Natty",
        "It's just the browns..calm down T.",
        "i love this relationshir this is the relationship form coach and\nQB that last for a lot years to come and wins championships wha a great person is tua he call every one boss MVP MVP MVP ",
        "Fins for the win again and again and again!",
        "I love this man so damn much",
        "My daddy Tua",
        "\"Let's go.\" - Tua mic'ed up.\n\nThat was about it.",
        "Pure ALOHA! Give 'um Tua!",
        "Loving the Alabama pick at the end of the game ROLL TIDE ",
        "Tan ( Tanned) Marino",
        "Seriously HOW CAN YOU NOT LOVE TUA ?!? ",
        "That’s my qb 🥹",
        "Uce in Samoan is brother for y'all who didn't know :) keep it up uce your killing it ! ",
        "The way he was getting pushed and still was the first to pick up Jeff on the failed first down tells me everything. He’s accurate we all know that, he’s a warrior who’s faced the most adversity. But above all he is a true leader, who corrals teammates who respect him in every manner. ",
        "MVP!!! Do fans get to vote!?",
        "This made my day",
        "Sigrun and Baldyr were epic bosses to fight. It was nice to see Kratos have compassion for the wolves too. This game is so fun to watch Sean. It just keeps getting better and better. Cant wait for the next part.",
        "Uso-UNO 🇼🇸",
        "man bro tua is the best when he's just himself. that's what mcdaniel brought out of him and i cant thank him enough",
        "UNO FOR MVP",
        "I can’t wait to be watching another Miami Dolphins Tua mic’d up 10–15 years from now.",
        "Vi’ia le Atua!️",
        "Thats my QB1 !!!!!",
        "Magical That boi got the touch",
        "Man i just enjoy TUA so much, made me fall in love with the dolphins again after all those bad strings of qbs we had",
        "Although tua is such a good quarterback in this league rn, its just funny to watch this cuz tua is just having fun lol",
        "That's my Tribal Chief!!! ️️️ WE THE ONES in the East!",
        "the Tua-McDaniel combo is perfect for a team and a comedy lmao",
        "Roll tide man, Love seeing TUA playing great",
        "Man just loves football and life. So refreshing!",
        "I love this team. Tua looks like a little kid having the time of his life.",
        "Been rooting this man since day 1. Keep elevating, Tua!  you deserve all the success ",
        "He looks so happy ",
        "Flo was the problem",
        "The man the myth the legend UNOO",
        "Guys. Idk what to do with my hands, I’m way too excited.",
        "Fun video. Tua is like a kid on the playground just having fun and enjoying every moment",
        "God I pray tua stays health and is protected by the O line every game  phins up, any team can get it, Kansas, buffalo, or Baltimore, this team doesnt shy away from the challenge, they embrace it now",
        "If youre a dolphin fan and that doesnt make you smile, youre dead insdie.",
        "This has to be the most anticipated micd up in phins history. Tua is our guy",
        "it’s sad how they followed concussion protocol put him back but those punk ass bengals who try to always injure our players like they did to jakeem grant yrs back we would’ve been 10-0",
        "Love this. That's my dude!",
        "Listening to Teddy, i think its his last year here. At this point we can't have a backup telling a current QB he feels like a younger him. Just set wrong with me. TUA IS THE TEAM LEADER! end of discussion. TUA = Class!",
        "Tua man",
        "That MVP chant ",
        "Love Tua he's a great guy all around! ROLL TIDE AND GO DOLPHINS",
        "You just want this dude to succeed.",
        "MVP MVP MVP!!!",
        "Man I’ve gone thru SO MUCH with this team! LOVE to see where its going. FINS TF UP",
        "TuAnon.....we've arrived",
        "The way mc Daniel is treating tua.🫶🫶🫶️",
        "Superbowl bound",
        "The guy bleeds football.  His whole world.",
        "Crazy to see how happy Tua is with Mike, love seeing him support Skylar as well",
        "The handshake he had with Waddle at the beginning made me happy as a Dolphins fan, and a Bama fan.",
        "This video is just beautiful 🥹",
        "He`s GOT THIS.....Tua time !",
        "Stay healthy out there young uce...what a talent!!!",
        "Bro it’s like a complete different feeling being a dolphin fan…🥹",
        "The chemistry that Tua and Mike McDaniel have is unbelievable. You can tell they really care and love each other. It's fascinating to watch. Don't be surprised when they win the Super Bowl. This team is SPECIAL.",
        "The best Cheerleader of all...Great QB too",
        "Lets GOOOOOO! \\m/",
        "It's awesome how its not the defense and offense as separate units anymore. It actually looks like 1 whole team who supports each other. Tua is just an amazing leader and I have a new respect for Teddy after watching this. He is supporting Tua and I think I saw more emotion out of him in this video than I have when he was on the field. I could not be more excited right now!",
        "Teddy's 0-3. Stop smiling dude. U been terrible",
        "Praying for Tua's health every week and I invite you to join me. Bless up and Fins Up ",
        "Please love my Tua",
        "The transformation of Tua with the right coach is amazing. He looks so happy out there",
        "I absolutely love Charlie, always going out of his way and doing everything he can to help people in any way possible whether it's with money, with a silly competition, a serious stream to promote exposure but still being silly to make people jus laugh, a charity stream or just something as simple as streaming to thousands of viewers every day making us all laugh and constantly putting smiles on her faces. I don't know about you guys but that sure does a lot for me  thank you charlie, for just simply being new <3",
        "Tasi cooking .",
        "He’s such a nerd",
        "MVP! MVP!",
        "This is amazing, he’s so happy.",
        "The MVP chants at the end… I’ve never been so proud of this team",
        "Hope that crow tastes great!!!! MVP!!!!",
        "Can’t wait to see him and his brother taulia battle it out in the NFL",
        "So looking forward to The GOAT coming to play for my Dolphins next season !!!",
        "Love this kid!! Go Fins!",
        "Three Tuggss",
        "Nice one Uso! Roll Tide!",
        "It's beautiful.",
        "For some reason They remind me of my ravens squad in 2019 this team dangerous",
        "Damn TUA got some cakes",
        "I like this point of view. It's toned down because he knows he's mic'd up but it shows you need to have fun first and then the wins will come. This is what I always told my high school team when I used to play. Go Fins!",
        "Teddy is chill?",
        "Just having so much fun out there !!!",
        "Wheres all the haters at?",
        "MVP! MVP! MVP!",
        "“What I was not gonna do is be in your graveyard”  ",
        "I haven’t been this proud since #55 Junior Seau!",
        "How can u not like him as a person. Humble, works hard and puts others first. This organization has been needing someone since Marino and I think at times they forced it and finally found someone who can lead and be an example",
        "My son's favorite player is Tua and now I see why - he's just one big kid and I love it. So happy.",
        "I'm calling him the Samoan Jesus now hahaha Go Tua!!! I believe!!!!",
        "I’d like to imagine he was always like this. \nI’m sure the team is glad he’s not.\nGreat playing and season Dolphins!",
        "chee whoo...nice brada",
        "It’s awesome to see the transformation he has made just from having a coach that genuinely loves the team and the game.",
        "H1M. I am so happy for Tua. Watched this young man ball out in college. He deserves everything and I hope the haters enjoy eating the shit sandwich Tua has served up for them.",
        "Love his humbleness…his energy is complementary to the system and what we always needed on the team…I’m happy to have the right coach to help him bring it out and help him be the player he always should of been…",
        "Never been a Dolphins fan but Tua and team are playing great football and are great to watch this year. Please keep it going Miami.",
        "I hope we go all the way because this is beautiful and it's been a long time coming",
        "ELITE",
        "I think i enjoy seeing this man happy, more than he enjoys being happy himself  QB1 MVP! ",
        "This team is great and my qb is playing well ? Keep up the good work",
        "Love how the players win or lose come together show appreciation for each other leaving the bad intentions on the field.",
        "We're witnessing history.",
        "Y’all hear them MVP chants!!! I could cry  lol",
        "In tua they trust!!  Tua the throwin Samoan sniper!!",
        "When Wilson did not get the first down on 4th.. He picked him up and said that ain't on you to him twice.. THAT is leadership.. He's come a long way and so happy to see him being himself, thank god they got rid of the joke of a coach they had previously",
        "Tua happy we happy ",
        "Wow! Tua is fun!",
        "Where are the Tua haters now?",
        "Love this guy, love his energy, love his comradery, love his commitment and determination. This is THE Miami Dolphins QB1 we’ve been waiting for.",
        "Uno is h1m!",
        "What a guy! So proud to call Tua our quarterback.",
        "I’m just glad he finally looks happy",
        "I'm a Vikings fan but I'm rooting for Tua, seems like a good dude",
        "This may go unnoticed One day threw hard work and dedication ! I will make my dreams of being the best rap artist in the world\nCome true . ",
        "i watch tua play at bama EVERY SINGLE GAME everff week yup for 2.5 half years i know wat i saw i know wat coach saban saw too this is where he suppose to be the best of the best im happy for miami ROLLTIDE",
        "Uh oh this team now has a running game ... The ingredients for a championship team.",
        "You guys  make my day every time I watch you boys play it puts a smile on my face fins up W tua",
        "This is the best ",
        "Tua time!!!!!",
        "Look at Tua man. So inspirational",
        "Man, been a fan of Tua since Bama. He was the most talented QB I had ever seen come through that school. I know all of us Tua lovers have been made fun of for two years, so glad to see Tua finally healthy and fulfilling potential.",
        "That’s our 2022 MVP",
        "Something special is happening with this team",
        "DOLPHINS FO LIFE... ",
        "This kid is special",
        "We have our qb and our head coach. It’s only up from here!!",
        "That was incredible,  team has the love  n love .It reminds me of being in Marine Corp( 1976).Brotherhood that  WILL become unstoppable",
        "The MVP chants gave me goosies",
        "THAT'S MY QB (FINALLY)",
        "So awesome to see players like Clowney and Garrett joke around with Tua",
        "This is tua!!",
        "Tua calling everyone uce.  My uso repping 🇼🇸",
        "Tua should just finish the Let’s go with Let’s go and win a super bowl! "
    ],
    "comments_disabled": false
}