{"video_id": "aVUSsXiKkbA", "comments": ["Grizzy, BigPuffer, ElasticDroid & Pezzy is a phenomenal team, these lads made my Wednesday even better", "The moment they take a slight whiff at the first one, the sync reactions were everything", "We all got food poisoning shortly after this", "Between the gagging with the ranch soda,droid looking scared with his eyes closed, the listerine safety net,and the surprise gag by grizzy I have never laughed so hard in my life", "Grizzy expanding to more irl content, gotta love it", "I can't wait for Grizzy to use his mouth wash in a few days and only remember the taste of the ranch soda", "1:38 Bacon Gym Sock Soda\n7:35 Sweet Corn Hub\n10:58  PB & J OK\n15:00 Ranch and mouth wash", "Grizzy = laughing a lil too hard at night and your mom hears you", "Love the fact that the bacon soda was presented with a Perk-a-Cola tune.\n\nEdit: Didn't know it'd be all of them lol", "Puffers reaction to Pezzy drinking the buffalo wing ine is hilarious lol", "The fact they passed the Pepsi around after the drinks and didn’t worry about the others germs or anything is true friendship", "I love how you can tell they are genuinely good friends and actually like each other, unlike some other youtube friend groups.", "Thank you everyone who donated, so glad to be apart of this community, so glad I was able to see the stream and donate what money I had", "Over 10 years on this website, and never before has a video made me consistently hold such a massive and genuine smile throughout the whole thing. This truly was the best thing I’ve seen in a while. Thank you for true happiness Grizzy!! Always a pleasure to be a part of the community", "Grizzys a certified large lad for enjoying these drinks", "Pezzy was so comfortable with the fact that he got judged on the smell of lube...... the reactions had me dying!!", "Yo, I bet your house has the best vibe, more then  4 times a day you guys are smiling and laughing", "Their reactions are so funny", "29:00 got me wheezing bro. If I wasn’t laying down watching it I would’ve folded ", "grizzies realization at 25:00 killed me", "Chemistry is A1 with y'all, just seeing genuine friends enjoy each other's company is dope. Plz more Irl vids <3", "Always a good day when grizzy uploads", "This video made me go through an abs workout laughing too hard! \nsince the Ranch soda, 15:40, I died re-watching over n over! Great video Grizzy!!", "im dying at the fact u can see at 15:45 the moment both grizzy and puffer's wavelengths clicked ", "the simultaneous table slap as Grizzy gagged is unmatched lmfao", "These 4 make any video enjoyable, the personalities bounce off each other so well", "I love when the crew hangs together its funny af grizzy's laugh is contagious\n\nAlso jelly fish have stingers lol", "This video made me laugh really hard when I really needed a laugh. Thank you guys for always being funny as hell.", "their reactions had me dying I can't imagine how bad the drinks tasted", "I haven't laughed this hard in so long. We need more videos like this.", "Oh lord, not this challenge! Y'all are bringing it back! \n\nWhen I saw the ranch soda at the beginning of the video I knew that crap was going to hit the fan because everybody who done this challenge talked about how nasty that one is.", "Every frame you pause this video at gets progressively better. I feel the urge to just take every single reaction face they make turn it into a wallpaper. Pause at 4:21, Pezzy becomes a goblin.", "the fear in puffers eyes throughout the whole thing had me dying. this video turned my crappy day around.", "16:07 their laughs together are unmatched", "I love these challenges so much lmao it's always so good ", "I just want to say that it is really comforting just sitting here watching you, been going through some stuff and this really helps", "I was laughing and getting disgusted with each drink throughout the video. Pezzy's facial expressions is what cracked me up the most.", "You guys are just so enjoyable. It's like chilling with my old friends again. Much love. Hope you guys least enjoyed one of them lol", "Haven't laughed this hard in a while, my god y'all are the best lmao", "I love how the worst-tasting soda got the quick revive theme  Lore-accurate", "Coming back to watch for the 3rd time. So hilarious! Thank you for making amazing content for us viewers!!!", "dude needs to do more stuff like these, its very enjoyable", "I was going to say how Pezzy was being a boss throughout this....and then the buffalo wings one happened. ", "Oh lord, not this challenge! Y'all are bringing it back! \n\n\n\nWhen I saw the ranch soda at the beginning of the video I knew that crap was going to hit the fan because everybody who done this challenge talked about how nasty that one is.", "25:00 has to be the best moment in the whole video, the way pezzy gets up and says he knows what it is, is some game show answer and the way grizzy goes aw shit we need more videos like these grizzy boss", "The lads IRL are always great ", "Really makes you appreciate the fact that both Sean and Mark were so thoroughly spooked by the mannequin that they both used it as their intro. >:O", "I’ve had the ranch soda before and I remember it tasting just like a cream soda. It was definitely weird but not as terrible as I was thinking. Guess I have to try it again now ", "Loved this video!! Really love the irl stuff, hope to see more in the future  You guys are super funny", "Damn we need more of this shit, I love this type of content and seeing y'all do it is great", "This is amazing! Theres a carbonated soda machine where you can make your own carbonated drink out of anything. They should do one where they make their own carbinated drinks and make it into idk some kind of  challenge like this video. Like you drink more flavors of the nasty soda and whoever guesses the most least correctly they have to drink a home made carbinated drink mixed with whatever.", "anytime any of these four upload a video of them together, I just KNOW itʻs going to be good", "Bro you guys are so good together lmao. Would love to see more stuff like this", "You know you laugh hard when your mouth turns into a defective spray bottle. Y'alls reactions are hilarious! I'm diggin this irl content", "I would pay cold hard cash if they did another one of these, I never have laughed so hard at a youtube video.", "This is really funny considering someone had to buy these and knew the flavors, but nobody guessed the right flavor other than the ranch and bacon.", "seems like alot of fun, good watch lol. Keep up the good work grizzy!", "25:02 grizzy’s reaction is amazing!", "\"It's bad?\" \"Let me breathe\" ", "I'd love to see you and your friends tast more sodas", "Man this was hilarious, props to the editor, killed that ish!", "You should definitely try to find more odd drinks or foods this was awesome.", "Everytime Grizzy laughs, he sounds like he's saying \"yeah\" while laughing", "1 minute in and im already dying of laughter great video grizzy", "You guys should swished it around in your mouth, thats how you truly taste things. Though I understand that these are probably so bad that you dont want to do that lol\n\nAlso I love how they all ended up huffing mouthwash to get rid of the taste haha", "We need more irl videos like this gotta love the change up in content", "Hey Grizzy I’m a big fan. Thank you for making me laugh all the time. Your videos always make my day better.", "Bro I love this type of content irl trying things  with the boys is awesome because they can be them and mesh but also you get their genuine reaction to things", "We need more irl vids there always soo good", "Love how puffer already seen the bacon one in the beginning then proceeded to act like he didn't know and guessed correctly", "I love this type of content from The Boys, amazing shit. Also, editing and subtitles are gold. Always love when there's subtitles for my deaf ass. ", "The way Puffer's eyes went wide every time the others have an awful faces ", "so when is the follow up video of you guys trying the Jones cola thanksgiving soda collection or the thanksgiving flavored candy corn? this made me laugh so hard I love it", "Love the fact that the bacon soda was presented with a Perk-a-Cola tune.\n\n\n\nEdit: Didn't know it'd be all of them lol", "The way Puffer acts like he doesn't know the first bottle when they're guessing but it's the bottle he turns around at the beginning of the video   ", "This was suck a good video. I was smiling the whole 30mins straight. Amazing video, love it when all 4 of you guys get together", "Needed this laugh before work, thanks guys", "Pezzy taking it like a champ", "19:40 Puffer's eyes when Pezzy gagged had me dying", "I remember when BHD and Randy did this with more nastier Sodas, brings back some Memories", "Puffer’s face when Pezzy freaked out ", "love that format, absolutely hilarious. this made my day so much better", "it wasn’t about the flavours, it was about the friends we made along the way", "Love seeing these four together. I am pretty sure by now, that I am having a low key crush on Droid, want to be bestfriends with Pezzy and Grizzy, and want to have Puffer as my oldest cousin...\n\nAnd I kinda want to try these Sodas too.", "You guys have to do more videos like this!!! Had me rolling!!!", "Please more IRL videos like this! ", "As much as it probably sucks, I love these videos and would love to see more.", "i love these type of videos, you should do more of these", "Tune in to the next episode of Grizzy's Gauntlet where the boys will be trying to guess Bean-boozled flavors while blindfolded. ", "0:08 it's a nice bit of confirmation that droid acts the same way when he thinks the camera isn't recording", "This video is on par with the time they trued to make brownies of some nature & Puffer was the certified food taster coming by. These 4 idiots make me laugh, cry & make me feel warm on the inside.", "I love these moments, yall were having actual fun ^_^", "droid and puffers faces when pezzy tasted the buffalo wing one ", "I remember me and my freinds did this, we started off with pumpkin pie, then after that, was mustard, and right after sweet corn, those two combined completely stunned me, and that's all that I could taste for the ones after", "Y'all should do more like this", "As someone that enjoys partaking in weird sodas, my personal favorite is bacon cream soda", "I actually quite like the pumpkin pie soda. I'm terrified of the others though.", "Puffer is just drinking all of pezzy's pepsi bruh", "16:44\nI like how droid walks out of view and comes back with a pan in his hand", "The fact that Grizzy looks damn near just like me, always trips me up."]}