{
    "video_id": "aVUSsXiKkbA",
    "comments": [
        "I love this type of content from The Boys, amazing shit. Also, editing and subtitles are gold. Always love when there's subtitles for my deaf ass. ",
        "I love this fr",
        "My guy droid is lawyer, doctor now what an astronaut (if you know you know)",
        "I’ve had the pbnj one, I think I threw up later, it sits in your stomach weird",
        "Like to see it’s now the grizzy+ house",
        "I don't think puffer should've gotten the bacon point he looked at the bottle in the beginning",
        "For your own health, please don't do this again Grizzy. We love you guys enough. You don't need to risk food poisoning over this. We will give you da views we swear.",
        "14:22 Nah Droid off that drink, no more for him",
        "Great video, but uh....wheres Smii7y??",
        "Like how at middle of the video they are basically just huffing the mouth wash",
        "Jacksepticeye tried the same drinks a few years ago",
        "Bro I wanna see a part 2 with smitty in it",
        "There was no butter soda. unfortunate",
        "This this good content XD as thor would say ANOTHER",
        "God bless droid for actually wanting to go down on a girl. God bless",
        "I like the wall art in the dining room ngl. also that big ass plant. and the color choice for the wood. GoDDAMN your interior design is fuckin nice lads",
        "Can't wait for the inevitable gingerbread house s building stream lol",
        "Grizzy is having a good time while the others \"SUFFER\"",
        "i love watching irl content over gaming even though ive had a strong grasp on watching gaming videos but seing him explore in different kinds of content make me happy and im so excited for the future",
        "As someone that enjoys partaking in weird sodas, my personal favorite is bacon cream soda",
        "Literally the worse video to eat to ",
        "ninja (pezzy) absolutely hated all the drinks",
        "The peanut butter and jelly the dry part was the peanut",
        "This has to be the best video in 2022 bro ",
        "Bro it’s at 666k veiws",
        "I remember when BHD and Randy did this with more nastier Sodas, brings back some Memories",
        "First",
        "Grizzy turned into m’baku before downing the ranch one",
        "puffer says sooo much with no words 19:43",
        "When your first name is actually Lester.",
        "They need to do this again..But get the Butter Soda!",
        "Not them huffing mouthwash fumes",
        "Can we take a moment to realize dude said stainless steal pot when it was a cast iron pan ",
        "THIS IS SO COOL. The job I work at makes these labels for the beverage companies shown here. I’m finally on YouTube (somewhat)",
        "I clicked on this really hoping I’d get to hear Grizzy YELL “RANCH DRESSING!” but as a question",
        "Bro ayy low key droid lookin swoll he starting to get that jawline of a gym love the vids keep up the good work all ya",
        "Real talk, ive had all these before, the sweet corn one kinda slaps. The rest are awful of course.",
        "I have to say the quality is AMAZING !",
        "Grizzy pulling the Quick Revive Jingle, man!",
        "Why that dude look like radel?",
        "Fun Fact: 7-Up was launched 2 weeks before the 1929 Wall Street crash",
        "The fact that the video actually got 50 thousand likes",
        "So we gonna ignore how Pezzy was a complete homie in this vid?",
        "either the camera is tilted or all the framed art behind them is crooked and unevenly spaced lol",
        "I was laughing so much I almost ran out of air a few times lol",
        "Germans; NO! We like corn",
        "Towards the end when Grizzy at 29:00 ",
        "Needed this laugh before work, thanks guys",
        "I love vids with all 4 there the best friend groupand you know there homies when pezzy drinks after someone",
        "Why does pezzy look small, like you know the filter that makes your head bigger but for him its made his head and hands smaller ",
        "Yeah the white man reacts horribly you know it’s going to be bad lmfao",
        "I was watching this on my break and i wish i was one of these guys instead of working a 9-5. Deathly sodas sound like fun content",
        "The lads IRL are always great ",
        "Puffer is just drinking all of pezzy's pepsi bruh",
        "Most spiciest food challenge next!!!",
        "This was actually fire ngl",
        "Grizzy slow",
        "Bro, idda gave them the point for hot sauce.",
        "Love the Smii7y plus house ",
        "You guys should swished it around in your mouth, thats how you truly taste things. Though I understand that these are probably so bad that you dont want to do that lol\n\nAlso I love how they all ended up huffing mouthwash to get rid of the taste haha",
        "This was wholesome as f",
        "Best moment is at 19:20I was dead laughing on the floor",
        "Jacksepticeye flashbacks",
        "29:00 Sounds kinda like the noise from Terraria im not gonna lie!",
        "2:24 Nah, Grizzy definitely just blocked his nose on purpose before the recording",
        "Really makes you appreciate the fact that both Sean and Mark were so thoroughly spooked by the mannequin that they both used it as their intro. >:O",
        "Pumpkin pie is the best.",
        "Now that ik droid is a cowboys fan he is my new favorite youtuber",
        "the cod zombies perk music got me of guard, specialy the quick revive",
        "\"Lester! What a bitch.\" ",
        "Bacon soda mhm",
        "Damn we need more of this shit, I love this type of content and seeing y'all do it is great",
        "Aw a minute after this is great",
        "Why you do this to yourself guys the ranch is worse",
        "11:12 Next time you have to get dirt soda",
        "Damn puffer without glasses looking ",
        "That was interesting",
        "WE LOVE YOU BOYS and the candid irl content",
        "Grumpy pezzy go crazy 4:04",
        "When pezzy said “I was lying” puffer immediately in his mind went “fuck yeah you are”",
        "grizzy is so fine",
        "These do be some yee yee ah wonky slush liquids",
        "pezzy would like the ranch drank",
        "Chemistry is A1 with y'all, just seeing genuine friends enjoy each other's company is dope. Plz more Irl vids <3",
        "I was wheezing the entire time ",
        "this shit mad fun",
        "He he he ha",
        "\"are you sure you dont want a bottle of water\" I felt that ",
        "Good ol’ grizzy group",
        "You guys should totally play bean boozled!",
        "The first thing I did was to be a part of the world, and the other was a great way to get the best out there that are in a position where they were in the same manner as in the Example of the most important things to do in the future, and the other is a great way to get the best out of the way, and I have to say that I am not a fan of the most important things to do in the future and the other is a great way to get the best out of the way, and I have had a lot of fun to watch the game, and the other is a great way to get the best out of the way, and I have to say that I am not a fan of the essential things in life that you have the option for you can do is make a good point of the world ",
        "haven't even watched it yet, its already funny-",
        "Pezzy is Runt from Chicken Little.",
        "love that format, absolutely hilarious. this made my day so much better",
        "You guys are just so enjoyable. It's like chilling with my old friends again. Much love. Hope you guys least enjoyed one of them lol",
        "why is grizzy look like a big teddy bear bro i kinda want to hug him",
        "anytime any of these four upload a video of them together, I just KNOW itʻs going to be good",
        "The boys eat bug candy next thoughts",
        "Soda absolutely does expire. Some soda will even grow mold if you leave it long enough.",
        "I love these challenges so much lmao it's always so good ",
        "AAAAAAAAAAAAAAAAHHHHHHHH ooh grizzy upload",
        "I can already see 25:00 - 25:05 becoming a meme.",
        "You guys should try the Beanboozle  Jelly beans next",
        "Corn is good",
        "this has the same vibe as an (insert game here) funny moments video",
        "Puffers reaction to Pezzy drinking the buffalo wing ine is hilarious lol",
        "F Lester",
        "I like how everyone is a basic white girl and just instantly knew Pumpkin Pie  I love it",
        "Where can I get the soda at?",
        "I LOVE BEING ONE OF FIRST TO WATCH. KEEP UP THE GOOD WORK GRIZZY.",
        "After Pezzy realized what the last drink was, * Zoom to grizzy* \"Aw Sh*t.\"",
        "PЯӨMӨƧM ",
        "10:52 Imagine just seeing this without context \n18:03 Droid knew what he was doing\n21:37 Damn, Droid \n24:04 & 25:00 Whoever edited this: ",
        "I have a 4 full shelves the wall in my bedroom full of those weird/obscure sodas. My favorite weird ones I have are marshmallow, \"dragon drool\", horchata, and sweet rice",
        "",
        "Watching this with covid, legit almost puked like 5 times during this shit lmao",
        "When grizzy was calling his “lawyer” he shoulda called matt and put him on speaker ",
        "Bro, serving on jellyfish others, they should we can’t Jutters",
        "MORE IRL PLEASE",
        "Also congrats grizzy this is the video that got me to sub",
        "Puffer cheated on the bacon b r o",
        "seeing this in 4k my first time, with you folk",
        "Y'all should do the one chip challenge",
        "I remember hearing you say you think animal voice over are one of the funniest things you should react to @KLRProductions",
        "Did you hear about the new tongue twister? Its called Stun Seed, it stuns the person for 1 second until they read it backwards",
        "I dont know where Diabolical Grizzy came from but I like him",
        "The epitome of misery loves company.",
        "i love how they are huffing mouth wash",
        "Why is Puffer without glasses kinda cursed",
        "Drinking perks from cod zombies",
        "Yo Grizzy, plz do a other video of Random Drinks but search that some of them has sweet, sour, disgusting and spicy taste >:D",
        "The mortuary assistant got 51,000 likes it’s time for shift 2",
        "Top notch video man",
        "I don't normally like self harm content, but this was pretty great lol",
        "\"It smells like feet!\"\ni am surprised that none of them just downed it with a \"HELL YEAH!\" after that comment.",
        "7:09 well droid asking for 50k likes for being poisoned happened",
        "so when is the follow up video of you guys trying the Jones cola thanksgiving soda collection or the thanksgiving flavored candy corn? this made me laugh so hard I love it",
        "I saw these sodas irl before",
        "Whooo!",
        "Ay y’all buy me this I’ll post a video of me chugging all the bottles",
        "I feel so sorry for you guys. I had these while I was drunk and it SUCKED...",
        "Grizzys a certified large lad for enjoying these drinks",
        "they need to do more like these XD",
        "Oh no",
        "skoden",
        "I like this type of content:)",
        "Perk-A-Colas",
        "02:50 \nNobody:\nViewer: so…Pezzy why do you quit YouTube?\nPezzy: bc of a bottle that smells…",
        "If they get a sponsor for something like this, they need to use puffers forehead as a billboard for it.",
        "dude droid freakin carried",
        "This is a bad idea they going to throw up afterward ",
        "This video made me go through an abs workout laughing too hard! \nsince the Ranch soda, 15:40, I died re-watching over n over! Great video Grizzy!!",
        "Yo",
        "City Boys do be getting sensitive can't even handle sound of a drink being poured",
        "\"Y'all Get Yer Fixins!\", by Lester... who also looks disturbingly similar to a 36yrs ago deceased president in my home country...",
        "love the IRL stuff",
        "I would drink that cup of all those flavors if I was given the challenge",
        "candy shop at the local mall has some of these disgusting sodas i low ki love the ghost pepper flavor they have. its not real hot like a legit pepper but its like a good bloody mary",
        "The furry has spoken 50,000 likes",
        "bro when droid grabbed the bottle and grizzy made that sound i died",
        "Love the fact that the bacon soda was presented with a Perk-a-Cola tune.\n\nEdit: Didn't know it'd be all of them lol",
        "Bro puffer's face when he was looking at pezzy",
        "Love how puffer already seen the bacon one in the beginning then proceeded to act like he didn't know and guessed correctly",
        "im dying at the fact u can see at 15:45 the moment both grizzy and puffer's wavelengths clicked ",
        "I saw this from Blarg's Pov and thought that Smii7y would eventually upload his own, now here it is. Stick fight was a fun game and having  this Stick Spider game makes it even better.",
        "love these videos",
        "Did you guys actually get sick after this?",
        "sees the title Oh. Oh no.\nWatches the video\nOh yes.",
        "The fact they didn't wash the glasses out at all definitely didn't help the flavours",
        "Please do this again with the dessert flavors",
        "I had the ranch one a while ago as a dare. I’m so glad to see someone else try it. Definitely worst food experience so far/",
        "A video with the boys? Automatically a 10/10",
        "Droids mind is an Enigma and I’m all here for it",
        "Mukbang? Idea with @bigjigglypanda ?",
        "Please more IRL videos like this! ",
        "Puffer’s face when Pezzy freaked out ",
        "So we really gonna ignore that bacon was the one flavor puffer saw beforehand?",
        "Anybody else catch grizzy and droid whiffing a dap at the end there next to puffer’s continental forehead?",
        "Also the chocolate covered version of the bacon soda taste relatively better",
        "Ya’ll look so cuddly ",
        "No way I’m here before bigpuffer",
        "Yooo what up",
        "Everyone laughing and focusing on their reactions…\n\nMe: noticing the indirect kisses with the Pepsi",
        "We all got food poisoning shortly after this",
        "Grizzy would be a fun drinking buddy",
        "28:10 \nGrizzy had an awakening lol",
        "Grizzy is fine as hell wtf",
        "You guys should try Moxxie and Sunset Sarsa Parrilla",
        "13:49 Love those reactions.",
        "The Way They all just ran when grizzy gaged in the end i can’t",
        "Puffer faked his reaction!",
        "8:12 lol",
        "18:51 jolly ass laugh lmao",
        "Puffer be rethinking his life choices right now.",
        "I thought that was Fred",
        "Frist",
        "turn the lights on ",
        "WTF HAPPENED TO THESE BOYS?? Holy fuck they went through one hell of a digi volve",
        "I was waiting for pezzy to call droid too lol",
        "By the way grizzy there’s more of these even worse ones so part 2?",
        "D20 - My Band but instead of saying \"Fuck Marshall\", it's Grizzy saying \"Fuck Lester\"",
        "seems like alot of fun, good watch lol. Keep up the good work grizzy!",
        "How you all Looked at Pezzy @ 19:26 lmao.",
        "Did puffer actually throw up?",
        "absolutely love these videos",
        "The fact that there are more gross sodas is crazy. Like for part 2",
        "Half of the video is Pezzy looking like his about to retch",
        "more vids like this pleaseeee",
        "Droid reminds me of JP when Wade (Lordminion777) did his weird soda videos.",
        "Btw I really hope he does a lot more of these i Fukn love em",
        "I remember when I was like 10 or 9 I drank the corn soda and bacon soda at my cousins and it tasted tolerable lol",
        "Jellyfish udders ... you mean juddters",
        "\"Need a lil reviiiiiiiivvee!!\"",
        "Ayyyyooooo",
        "ThAtS a vERy DiStiNcT tAstE WOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO lmaoooo",
        "If MOZART was black would gis name be NIGART",
        "19:41 The way Puffer's eyes just widen.",
        "28:58 is still the funniest part ",
        "I’ve done all of them before in fact have all of the lesters fixins bottles behind me in a box knowing how they taste I felt like puking. Worst ones are sweet corn and pickle",
        "16:07 their laughs together are unmatched",
        "Grizzy: \"Dont smell it.\"\nPezzy: immediately sticks his whole ass head in the cup",
        "I was going to say how Pezzy was being a boss throughout this....and then the buffalo wings one happened. ",
        "Watching this while having a vomiting/gagging phobia is like playing Russian roulette",
        "the simultaneous table slap as Grizzy gagged is unmatched lmfao",
        "Wtf was the sound when Droid took the bottle from Grizzy and started drinking?",
        "The emotional support mouthwash.",
        "Grizzy looks like an absolute unit",
        "Good vid\nBut dislike how they be peekin\nJust get invested in the content.\nHate me all you want just my opinion.",
        "25:02 grizzy’s reaction is amazing!",
        "FOR WHYYYYYYYYYY",
        "Is it just me or do they all sound like rich white dads when they laugh together?",
        "A better challenge would be, get similar drinks that are good and roll dice type shit to see which one you pick. But the catch about this version of the challenge is that there is a chance you get a really gross drink or a really good drink.",
        "You guys should do this again but you actually have to guess and the person that got the most wrong you mix all of them and the loser drinks it",
        "Every single reaction is fucking golden... i laughed at every single reaction.",
        "So apparently there is 4 other flavors.",
        "There was one time I went to a candy store known for exotic candy. I tried the bacon soda and a Pickle flavored pickle Rick gummy. Grossest waste of pocket change ever",
        "Coming back to watch for the 3rd time. So hilarious! Thank you for making amazing content for us viewers!!!",
        "The Honeywell thermostat is the same thermostat I have to deal with all the time (installing them, not using them) they're the basic Honeywell T4000, lol, random, I know",
        "Ur very funny reaction",
        "28:37",
        "Bro I love this type of content irl trying things  with the boys is awesome because they can be them and mesh but also you get their genuine reaction to things",
        "Nice",
        "bruh grizzys hand is the size of the bottle",
        "okay pumpkin pie and pb and j soda sound pretty good.",
        "There is a what soda???",
        "Haven't laughed this hard in a while, my god y'all are the best lmao",
        "it wasn’t about the flavours, it was about the friends we made along the way",
        "yo why is grizzy double grippin the bottle when he pours like mans life depends on not dropping it or sum shii",
        "ummm.... who's gonna tell them that there's even more flavors....",
        "Pezzy looks like beardless Sindri.",
        "Grizzy, BigPuffer, ElasticDroid & Pezzy is a phenomenal team, these lads made my Wednesday even better",
        "This video made me laugh really hard when I really needed a laugh. Thank you guys for always being funny as hell.",
        "Droid the GOAT",
        "You know what, they remind me of Jeremy Clarkson, James May, and Richard Hammond in some ways",
        "Every frame you pause this video at gets progressively better. I feel the urge to just take every single reaction face they make turn it into a wallpaper. Pause at 4:21, Pezzy becomes a goblin.",
        "Grizzy switches the mouth wash for gas: get pranked bro",
        "0:08 it's a nice bit of confirmation that droid acts the same way when he thinks the camera isn't recording",
        "Cutie in the blue hoodie ",
        "What's next? Wierd flavored ice cream?",
        "Can someone tell me how many times puffer said he hates corn",
        "This video is on par with the time they trued to make brownies of some nature & Puffer was the certified food taster coming by. These 4 idiots make me laugh, cry & make me feel warm on the inside.",
        "As much as it probably sucks, I love these videos and would love to see more.",
        "Ayo keep these type of vids up I like thus plz",
        "Oh lord, not this challenge! Y'all are bringing it back! \n\n\n\nWhen I saw the ranch soda at the beginning of the video I knew that crap was going to hit the fan because everybody who done this challenge talked about how nasty that one is.",
        "Freds brother",
        "Pezzy looks like Ninja bro when he says \"I already know what it I then\"",
        "Imagine soup doing this haha",
        "Between the gagging with the ranch soda,droid looking scared with his eyes closed, the listerine safety net,and the surprise gag by grizzy I have never laughed so hard in my life",
        "There's also a bacon and chocolate flavor. I heard the sweet corn one is actually pretty good, but the ranch one is actually disgusting. Pretty sure Melba's fixings are better, though.",
        "Cogate out here saving people lives",
        "You should do another one of these, there's alot of different soda's, even dirt",
        "You’re a man! HUELLLLH",
        "Honestly i might like their irl video's then their gaming video's of them idk yet it's to decide",
        "there was so many instances where this experiment almost turned into a Boys video",
        "Lester makes so much money from all those heists and still can’t make a good soda",
        "For our next line up we need Birthday Cake, Grass, Maple, and Pickle",
        "I have a bottle of bacon soda on my shelf that has been there for a long time because im too scared to try it",
        "man yall gotta try the dirt soda. it literally tastes like gravel and iron pelletes. they did a better job ad replicating flavor than jelly belly does.",
        "ayo bro wheres that mortuary assistant second night episode???",
        "Did this boy just say hotsauce and salsa as in they're two different things? Ima have to teach droid some Mexican history on chile",
        "grizzy, us whitey boys love corn bread too\nwe do got a flavor of southern tradition tho",
        "Am I the only one who noticed Grizzy and Droid missing that in the background?",
        "I have never seen mouthwash be treated like a chaser but for your nose. ",
        "You know you laugh hard when your mouth turns into a defective spray bottle. Y'alls reactions are hilarious! I'm diggin this irl content",
        "Dude I remember when Jacksepticeye did this years ago",
        "Is pezzy wearing smii7y merch?",
        "their reactions had me dying I can't imagine how bad the drinks tasted",
        "Their reactions are so funny",
        "Just imagine if they drank the dirt soda",
        "Pezzys grossed out face during the buffalo wing one reminded me of Yzma from the emperor's new groove",
        "why is Pezzy Wearing Smii7Y merch? xDD",
        "Puffer having a tantrum over corn giving me huge toddler vibes",
        "11:03 yo this comment is EXACTLY what inspired the editor to do the transitions w the diff perk jingles  hats off to that man give homie a raise for that lmao",
        "I tried the ranch soda in high school with my friends. Shit tasted like spicy chlorine water. Sweet corn soda is fire though",
        "He still slays gods, but now hes sad about it? This line really impressed me. This tells me the writers used their brains.",
        "have they tried the beanboozled thing? i did that with some family at a rocky and bullwinkle place and the dog food bean scarred me for life",
        "It's so sad to hear that Grizzy's last vid before dying was this ",
        "Amazing editing",
        "I fuckin love him not knowing that camera is recorded bruh he's funny off camera too lol",
        "If only grizzly did more challenges like thid",
        "This brings back memories, watching Captain sparkles punishing himself on these drinks was gold",
        "Bro, I've got that exact same Ikea table",
        "Fun Fact: BlastphamousHD did this challenge and it was hilarious",
        "droids funny as hell",
        "Grizzy a YouTube fureal",
        "How this man hate corn?",
        "Pezzys taste buds are delayed lmfao",
        "And Pepsi is still the nastiest thing on the table",
        "this is the first time ive seen a group of yugioh players that have a successful channel for something thats not playing yugioh",
        "Ayo great video man",
        "YOU NEED A LITTLE REVIVE",
        "19:39 Puffers face:   ",
        "Bro at 25:14 Grizzy Puffer and pezzy lift there cups at the same time",
        "The fact they passed the Pepsi around after the drinks and didn’t worry about the others germs or anything is true friendship",
        "I’m watching this in the car and my step dads name is Lester bruh that shit was too funny",
        "This is what becomes of guys who don't have girlfriends. No, seriously!",
        "My boyfriend is Mexican and he says a true Mexican doesn’t need a bottle opener",
        "We were right! This vlogging thing is fucking gold! ",
        "Have you ever heard of Jones turkey and gravy soda?",
        "mans with the red hoodie lowkey look like ninja wtf",
        "puffer said the aftertaste of the pb&j left his mouth dry so that's where the peanut butter is, to me at least cause peanut butter leaves my mouth dry",
        "18:37 the ranch one might have tasted like cat piss",
        "These are in a candy store chain over by where I live. Badlands Chugs chugged some bubblegum soda from there and I can say it’s good. The store is called Rocket Fizz",
        "I wanted to watch, but the audio is terrible in a large room without proper mics. And I won’t watch in front of my kids with the vulgar language. Maybe good mythical morning has a similar video instead",
        "How am I just realising that I wasn’t subscribed to grizzy and I’ve been watching him for over a yr now",
        "Coffee soda tastes way better",
        "Pezzy looks like Ali Imsirovich",
        "Who hates corn? Mexicans love corn\nDroid mixing up SpongeBob with real life",
        "Not Grizzy clutching that bottle like a little baby sized",
        "They're white and I like five types of corn one of them not being from America from Mexico actually",
        "At the part where Brok was asking for a blessing, I just noticed that Kratos bowed slightly to the Lady. He thanked her but didn't ask to have it blessed. He wanted Brok's blessing",
        "It smells like Rengoku he's a scorching donut",
        "I just love the \"I hate being a YouTube\" from puffer before the ranch soda.",
        "Did he say “that is oil change”.",
        "i absolutely NEED grizzy’s shirt",
        "droid is so dramatic",
        "not puffer looking at the bacon and magically guessing bacon",
        "grizzy like glizzy swoda",
        "all they were missing was the chili dog gfuel",
        "I'm coiffing though the screen",
        "What was that at the end Grizzy  28:58",
        "i was gonna make this idea my first video with my friends and you beat me to it",
        "Pezzy taking it like a champ",
        "Dang, Im here early-early",
        "THEM GAINS ON GRIZZY THO",
        "i say again, I LOVE THE IRL CONTENT",
        "Need more videos like this man",
        "Pezzy with the smii7y merch",
        "i  pezzy",
        "Seems fun",
        "smelling mouthwash XDDDD BAHA",
        "Hey guys, I think puffer hates corn.",
        "I thought that was 407 in the thumbnail",
        "came to me afterwards and had to say it, if ya mixed the buffalo hot wings, ranch, sweet corn, and pumpkin pie together, ya got yerself a backyard bbq meal basically (unless they make a blue cheese version)",
        "this is a petition for a cards against humanity video",
        "just noticed grizzy is fvcking huge",
        "if that shit on grizzy’s wall is art, my daughter is a millionaire waiting to happen",
        "Now this is some content.",
        "What in the slap my daddy on the back kick my momma face hell is this video ",
        "You guys have to do more videos like this!!! Had me rolling!!!",
        "There’s a place at my city called rocket fizz and there’s a variety of sodas like that grizzy",
        "Puffer acting like he guessed \"bacon\" right, when we all saw him look at the bottle at the beginning of the video",
        "Everytime Grizzy laughs, he sounds like he's saying \"yeah\" while laughing",
        "Oh sweet, there’s a store near me that sells those kind of drinks. My favorite one is “doomsday lemonade” and the slogan was “taste the apocalypse” and the bottle has Kim Jong un",
        "You can HEAR droid fuck up ",
        "Puffer: looks at the middle bottle and sees its bacon then guesses bacon... 9ts tastes like grease",
        "Excellent video",
        "Bruh did Droid lose weight?",
        "Lester should've stayed planning heists",
        "These 4 make any video enjoyable, the personalities bounce off each other so well",
        "4:04 Pezzy turned into Ebenezer Scrooge from A Christmas Carol",
        "We need a bean boozled challenge lol",
        "22:26 bros got that FNAF ass hallway laugh",
        "Saying \"YO what is up YouTube\"unironically in a intro",
        "Love seeing these four together. I am pretty sure by now, that I am having a low key crush on Droid, want to be bestfriends with Pezzy and Grizzy, and want to have Puffer as my oldest cousin...\n\nAnd I kinda want to try these Sodas too.",
        "Ranch dressing is fine but ranch flavored stuff is disgusting.",
        "droid and puffers faces when pezzy tasted the buffalo wing one ",
        "Of all the things in this video calling your doctor and him saying thats a lot of money, i wheeze into oblivion",
        "10:00 i don't spit i swallow ",
        "1 minute in and im already dying of laughter great video grizzy",
        "\"It smells like feet\" Ayo how would you know what feet would sound like? ",
        "29:12 droid got played both times ",
        "When they were talking about smells my notification sound played and it was the \"I can smell you\" Morgan Freeman voice",
        "dude needs to do more stuff like these, its very enjoyable",
        "Any I'm ah 100",
        "Why does puffer look like the coolest dude on the college campus?",
        "yall didnt mix the Ranch and Buffalo?",
        "I for some reason wanna try some of them (especially the last one)?",
        "Love that you used the old cod zombies perk music on them",
        "28:35 - D: \"Hello?\"\n             P: \"We're gonna need an ambulance stat...\"\n             D: sigh \"That's a lot of money!\"",
        "i'm so early here that it feels illegal",
        "Puffer acting like he didn't look at the bacon bottle before everything started smh",
        "Please do more stuff like this",
        "Damn, that's a good ass lawyer",
        "Some jerk brought severely expired Vernors to a school function and I got poisoned from the thing once. \nBeyond that I've drank stuff that's been under a year expired and it treated me alright, you just need to trust your taste buds when it comes to expired pop.",
        "City kids trying new stuff, so cute",
        "You guys should try sodas from Different Countries. Different Video for each country!",
        "Yall highkey smart af for bringing out the mouth wash, I forget what percent but some percent of what u taste is caused by smell, so by doing that your tricking your tastebuds to make the soda tolerable",
        "They didnt get all the flavors",
        "19:47 puffer really wanted to be a bi*ch at that moment ",
        "27:05 Me watching Mafia Work",
        "I can't wait for Grizzy to use his mouth wash in a few days and only remember the taste of the ranch soda",
        "Tune in to the next episode of Grizzy's Gauntlet where the boys will be trying to guess Bean-boozled flavors while blindfolded. ",
        "the second droid said \"My throte is burning\", I instantly thought of his hot ones with the chicken wings and sure enough Grizzy says something with the hot ones XDD",
        "Love the content",
        "Puffer really do be looking like a nerd ngl",
        "yay",
        "They literally tried the best ones the only one that actually bad there is ranch dressing",
        "“The worst thing she can say is ‘no’”\n\nHer: 16:00",
        "13:52 What The Hell Was That Noise Grizzy!?",
        "YEPLOUD",
        "Challenge for all the viewers at home with a horrible gag reflex: try to eat some food without gagging along.\n\n(Ngl I expected just a funny video to yk watch while I enjoy my food, got the haha’s, almost threw up too )",
        "they got 50k likes ;)",
        "Bro I saw the ranch soda in a meme and thought it was a joke it’s reallllllllll",
        "As a white man I can confidently say I like corn\nEdit: my taste buds never have been the same since I think I had covid, I never went anywhere to test but I had some of the symptoms including lost of taste and smell, but everything tastes like a wonky version of what it used to be, food is kinda ruined for me until it returns, and that was like 10 months ago so idk if it will ever return",
        "OMG GRIZZY????????????????",
        "Very nice video",
        "They need to try my Gross sodas it wound be funny",
        "Aches watching this feeling alone",
        "So I was watching this video and went to open a Dove chocolate at the end right when Grizzy gagged and the little not inside of the wrapper says \"Laugh it off\" -Amy T., Kentucky.  Buhhhh!! HAHAHAHA",
        "We need juggernog and speed cola",
        "good vidbeo, me like",
        "Grizzly: Bottom's up!\nEveryone: Raises cup\nAlso Everyone: Fucking dies",
        "Bruh",
        "I got abs after this, I haven't laughed THAT hard in a while xD",
        "Which one was the best in your opinion Grizzy?",
        "Did no one else see droid look at the ranxh bottle grizzy pit down?",
        "I feel like soup would like some of those drink",
        "puffers eyes i cant bro 19:42",
        "i would fucking love to do videos with these guys on god bro",
        "YALL WAKE UP GRIZZY UPLOADED!!!",
        "Puffy cheated on the first guess. looking at the bottle when Grizzy moves his heads",
        "Bring Siege back??",
        "When grizzy said this might expired pezzy wanted to say the N-word so bad ",
        "It’s a weird but fun fact that pumpkin pie is actually primarily made with butternut squash and not actually pumpkin",
        "This video had my dying ",
        "mom i thew up ",
        "ABSOLUTELY LOVED IT",
        "This was suck a good video. I was smiling the whole 30mins straight. Amazing video, love it when all 4 of you guys get together",
        "The thing is at the start puffer turns around the bacon soda and suddenly guesses bacon bit sud",
        "1:13 cool little Grizzy hand movements",
        "actually 50k",
        "Great Funny moments dude",
        "If this video gets a 3 million likes they have to do a part 2",
        "Nobody tried the jungle juice! I'm not gonna lie that would have been hysterical",
        "Kinda wish they had the teriyaki beef Jerry soda.. just got a feeling they'd love it. Another group of youtubers just enjoyed it.",
        "More irl lets go",
        "Thumbs",
        "If these are perk-a-colas, they are Tombstone or Who's Who because they are useless and terrible.",
        "Why the devil would they make ranch flavored soda? Just drink regular ranch if you love it that much",
        "The Buffalo hot sauce one is by far the worst one I’ve tried",
        "25:00\nPezzy-“I already know what it is the then!!”\nGrizzy-“Aw, Shit!!\nXD",
        "Droid and Grizzy looking pretty hot!",
        "Y’all should’ve saved ranch for last",
        "You guys tried the ranch and buffalo wing? That's ballsy. Those two are rumored to be the worst ones from Lester. I've seen a different youtube try Lester sodas before. They even mixed the buffalo wing with the ranch, worst mistake.",
        "Look at 18 sec then look at when puffer is guessing and acting so smart",
        "Love the fact that the bacon soda was presented with a Perk-a-Cola tune.\n\n\n\nEdit: Didn't know it'd be all of them lol",
        "I love how the worst-tasting soda got the quick revive theme  Lore-accurate",
        "Grizzy house looking kinda fire",
        "Pov you don't know jellyfish reproduce asexually so you can't off one",
        "That was enjoyable",
        "I was waiting for them to say WhY iS iT sO sPiCy?",
        "Yo where can one purchase these lovely drinks",
        "all my homies hate lester",
        "I was laughing and getting disgusted with each drink throughout the video. Pezzy's facial expressions is what cracked me up the most.",
        "At the end they still missed the dap up",
        "I HAVE BEEN  WAITING FOR THIS FOR SO LOOOOOOOONG!!!!!!!!",
        "Durian, anyone? ",
        "Pezzy needs a beard",
        "Puffer without glasses looks like a Puffer Fish.",
        "SOUR CHALLENGE",
        "The way they all scattered at the end Lmfao",
        "i love findel castrio root beer",
        "The CoD Zombies jingles make it ",
        "Perk jingles from zombies thank you grizzy",
        "wao what a funny video i liked it..",
        "The fact pezzy got on Smit7y merch might have to get it",
        "Grizzy's soul left his body like halfway through bro ",
        "Who hates corn?! I don't think I've ever met anyone that hated corn.",
        "How did I know that Ranch was gonna be the revive?",
        "You guys should have do thw same but the loser will drink the combine",
        "19:05  built like a renaissance painting",
        "Puffer needs to go back to editing",
        "The ranch knocked the air outta him",
        "Idk about you guys but I think we need more vids like this",
        "25:00 has to be the best moment in the whole video, the way pezzy gets up and says he knows what it is, is some game show answer and the way grizzy goes aw shit we need more videos like these grizzy boss",
        "Is it me or during the 5th drink puffers face was a different color then the rest of his body",
        "Wow",
        "13:49 Ayo pass that shit dawg",
        "THE END WHEN GRIZZY NEARLY RHROWS UP AND THE OTHERS JUST ️",
        "The moment they take a slight whiff at the first one, the sync reactions were everything",
        "These four just getting high off the mouth wash ",
        "Thought FRED was in thumbnail",
        "Love the perk a cola jingles",
        "Kinda funny how my grandfather's name was Lester-",
        "you should buy the rest of the drinks there is a lot more I think",
        "Yes",
        "droid and puffers reaction to pezzy drinking the buffalo wing ",
        "MORE FOOD VIDEOS!",
        "I am very disappointed that I didn't hear a single Korn reference when they were talking about the corn soda."
    ],
    "comments_disabled": false
}