{"video_id": "BdAD28gN5nA", "comments": ["Man that turtle looks so cute I wish I had a turtle like that one ️️", "Love this! You give the animals for your setups proper housing and lighting but still pull off a awesome theme! ", "Three things to say 1 your tanks are so creative and awesome 2 you have a really deep love for fishes and aquatic animals and 3 good luck to the person that wins the wetpets kit", "I love that you hide those little charecters in your videos! It keeps people involved to watch the whole vid", "Harry is so cute!  Happy vacation, little buddy!", "I want to see the coral reef and how much she puts effort into the build and it turns out amazing ", "He’s So Cute!  I had tiny turtles growing up. Great job! ", "Harry is so adorable and I wish that I could have an aquarium from you! It would be an honor", "I love how happy he looked at the end", "This is so cute and very creative. I can’t wait to see what you’ll come up with next?", "1:38 chest, 4:05 puffer fish,and last but not least alex 6:11,I love and you I love your work maybe you should build a a coral reef for a puffer fish keep up the good work", "I love seeing aquatic pets getting the love they deserve, and these lego tanks are awesome!!!! ", "Hi, I love ur pieces and all the creative aquariums you make", "You put so much time and effort into your videos keep up the good work", "The amount of effort and creativity is so entertaining! You basically raised me throughout my childhood . With love, K", "You are so inspiring, and I love this build!", "This was fun to watch and made me think about that one show I used to watch when i went to my grandma's called \"Tanked\" where they built huge fish tanks for a bunch of people, lol.", "Love every project you do!!", "your dedication to building for your fish is unreal and i can’t wait to see what you do next!! ", "Can we take a moment to appreciate aquarium info? She spends days and money for us to be entertained! Thanks aquarium info ,and thanks for taking your time and money for us.", "This is an amazing MOC love the techniques. Keep up the good work!", "This was cool your efforts are unbelievable  nice job ", "Your videos are always so entertaining and interesting you make my day", "This is absolutely positively amazing I can't be more proud of how Far  you have come. Also my childhood I have watched you videos and I just can't be more proud of how Can you make all these tanks and finally I got my fish but I really need a fish kit I like subscribe and literally watch all your videos You're just amazing", "Your videos are so cool! I look forward to them every week!", "I loveee your videos! Your so kind to your animals unlike other youtubers!", "I waited so long for a new video, so happy finally one came!! Love the turtle! :)", "I absolutely love what you do for these animals people should be more like you.", "Omg I love seeing all your videos with all the sea creatures and how much effort u put into this awesome builds", "amazing you are absolutely amazing! i appreciate all of your hard work and many other should do as well. you are so talented and knowledgeable ", "I love your videos so much  I look forward to every upload!", "this is probably better than the last mc video. I love when you combine 2 things I love and you do it correctly (unlike some people *cough r/shittyaquariums). thank you so much for helping us enjoy the fish hobby and putting a fun spin on things", "Harry must really be living the life if he has a new tank every month", "A fridge might be something you can turn into a fridge, Nothing is impossible!", "O my gosh!!! Harry looks so cute in his new tank", "Love your videos and hard work,keep going", "Joo that tank is so awesome. I wish I had a turtle like Harry too!!!!!", "I love your videos! Next, you should do an ocean monument!", "Chest=1:37\nPufferFish=4:06\nAlex=6:11", "Chest 1:37 Pufferfiish 4:05", "This is so cool! I hope harry loves your tank,btw its aswome and so cute️ ", "Amazing! Your videos ALWAYS make my day! When i see a notification for your video im like as fast as flash to click it! \nHarry is so cute! :)", "Legends has it Sigils is still trying to get the purple mask", "Hi I just wanted to say hi and say how beautiful all your builds are and how much effort you put into them.The amount of effort you put into your channel. From you I have learned a lot about fishes from the little facts you throw.", "This was so cool! Your videos are so entertaining :)", "OMG! I absolutely LOVE minecraft! This is just AMAZING! I LOVE IT!! I really love axolotls and Lucy is my favorite axolotl you have. Just from watching your videos I always wonder, \" How long did that take because it is insane!\" I love the content you create it is wonderful. It is literally all I watch all the time! Thank you so much for putting so effort and time into your videos! PS, can you please do a forest biome next?", "Another great build using your unique imagination!! So inspiring! Thanks for sharing!", "love your daily videos great job on that tank", "I love it so much keep up the amazing work!", "This was a really cool video! Keep up the good work ", "This is every child  dream aquarium. Love your channel. Love to sit down with grandkids and see how excited they get.", "Awesome new video! We love it!! Harry will enjoy that new tank!", "I'm literally in awe!  I have to say as a mother of two young boys I greatly appreciate your show. I constantly am turning off YouTube because of all of the nonsense my children watch. However after today you have restored my faith! Your tanks are absolutely amazing! You are so  informative and just fun to watch. You should be very proud of yourself! Way to go girl!!!!!", "Ur sooo nice!!!! Didn't know people can be so nice to their pets!", "The destroyed drowned houses? I want to see them next!", "Love seeing you make all the fish tank", "What underwater biome do you wanna see next? ", "Can we see an ice biome? You are perfect for making it!", "Harry is sooo cute! Then again, I've always had a soft spot for turtles", "I love your videos they're so good it makes me so happy to see you build things for your animals it's so nice see how the animals react and all that it's just very nice and cute", "i love you videos soo much! Soo cute and amazing! you are awesome! WOW what a tank!", "“Look how nice Harry’s face looks” Harry proceeding to try to bite her finger", "11:00 The sheer terror in this guys voice when Techno goes 140 kilometers/hour to commit massacres in the name of charity is so wholesome. :'(", "this is amazing to see. i have a turlte of my own and this was heartwarming to see created. a really nice habitat for that cute turtle", "What you do is so cool you are so talented.I love your Channel", "Its funny because she smiles when there is a problem ", "That was so cool! You always come up with the neatest ideas.", "That was sooo cool! Thanks for this video! ", "The amount of effort in this video and channel is amazing! Now me have faith in humanity! ", "Hey, I love your videos alot and I watch everyone of them, it would be my dream to be gifted the fish tank you are giving away!!️ I also really appreciate all the behind the scenes work you do to make the videos possible!", "Amazing! How do you even make this you are so creative!", "Hi aquarium info I love your vids, I think they are very interesting and entertaining", "secret minifigs hidden are : 1:38 the fish chest. 4:05 pufferfish.  6:11 alex", "Adorable! Could the Lego lamp serve as a basking light?", "Makes me so happy every time you post!! ", "wow! Amazed like always! This one was so cool! The effort you to put to this is incredible! So amazing!", "Could you make an underwater sunken ship for some of your fish? That would be awesome", "I found the chest and the puffer fish but couldn't find Alex.You're so good at hiding things!", "Jamie is so freakin adorable....", "I love the island on top with the palm tree it is so cute", "This is amazing! I think that you should do the coral reefs from Minecraft next! And the amount of time you spend in your videos is amazing! Keep up the good work!", "I know you want them |\n                                      |\n                                      |\n                                     V", "I love your videos and they are really entertaining. ", "Just found your channel and I already love it! 1 more sub.", "What a cute turtle!", "Our 15 yr old son, Samuel, LOVES aquatic pets. He plans to have a fish room when he gets older!\n   Harry's new lego aquarium looks great!", "You’ve gotten my six year old sister into fish keeping! She loves your channel so much, and I just want you to know how happy you make her.", "Love the work keep it up", "I liked What you did for Harry hope you make more new content", "i work with fish every day at school your channel is so entertaining, cant wait to see whats next", "This is so nice. It's awesome.", "You also always try your best! This channel is amazing!", "i really like legos and turtles so seeing them both at the same time is crazy", "That tank was amazing.", "The little squeaks is so cute  :3", "Hi aquarium info!! I think Minecraft coral reef would be really cool!!!", "Make a coral reef set up I would love that ", "Your videos are always so interesting and so fun to watch them. Harry seems so happy with his tank. Keep it up with the good work.", "I Love All Your Buildings It Looks So Cool And When You Think It’s About To Fail And You Don’t Give Up And It Turns Out Amazing", "Can you do a fridge fish tank it would look so cool! Also love you videos!!!"]}