{
    "video_id": "BdAD28gN5nA",
    "comments": [
        "Can you make a Disney theme tank",
        "I saw chest and puffer fish but i dont see alex",
        "How do you move these tanks tho? , and where do you put them like I never see any of them ",
        "lego is plastic. Can't beat it, join it",
        "That looks so cute and pretty!!! ",
        "I’m Celine. Make a  female   a home and a male  from: Celine. To: you (I love sea animals so I call myself Queen of the sea)",
        "Man that turtle looks so cute I wish I had a turtle like that one ️️",
        "I realy love turtles once I went to lumbini the birth place of lord butha and I hot to touch one and there were 3 babys so cute tbut they were in water I wish I had one ",
        "I found all the Legos￼",
        "AQUARIUM PLANTS FOR FISH",
        "Time for a little too good day today",
        "Built a alfebet lore",
        "Can you please make rainbow friend aquarium",
        "My son and I love watching these",
        "I found the puffer fish",
        "The sound he's making",
        "I think you should make a the owl house themed house/aquarium for a catfish",
        "Cute turtle i also have a turtle he's bigger and he'd a pond turtle and his name is Leo/Leonardo from teenage mutant ninja turtles",
        "I was a gacha mouth.",
        "I got easy and medium",
        "You are so cool and I am a little kid",
        "Reminds me of pancakes my turtle",
        "I wish I had a little like that one I have an orange ear one",
        "I found all easy medium and hard",
        "0:59\ni found them all",
        "Finally she reaches her goals ",
        "This is so cute!",
        "Me : yay I found hard and medium uhm were  is easy",
        "Chest was ssooo easy",
        "Do a  Dino",
        "Emma green Lego pile I think I saw like a green flathead",
        "I found all of them the papa fish was in the bricks and Alex was near the bridge and the chest was in all the bricks",
        "I found easy and medium but not hard I think it's not in there.",
        "Hi I love your videos! I even got an axolotl and started a channel because of you! I wanted to expand my fish keeping hobby. Do you have any advice for me!",
        "I love your videos!",
        "Treasure: 1:36 , Pufferfish: 4:05 , Legohuman: 6:11 (idk why but I was so desperate to find them all)",
        "I found the chest the puffer fish and Alex!",
        "I love how you make Lego minecraft !",
        "I loveee your videos! Your so kind to your animals unlike other youtubers!",
        "omggggggggggggggggggggggggggg",
        "Found em all exept pufferfish",
        "i found the chest is so esey",
        "1:38 treasure chest\n4:05 pufferfish\n6:11 alex",
        "So cute! ",
        "Do frogs next ",
        "She is working so hard",
        "I love the turtle idea!! Have you considered a Mario themed tank? I think it would be awesome to make!",
        "A Ravine",
        "Looks like you LOVE lego!!",
        "I love your outfit and your little friends and how you love your animals",
        "I want to amputate my feet and replace them with Lego feet so whenever I step on a Lego, I get a little bit taller.",
        "Am găsit toate cele 3 lego de găsit",
        "I did it!!!!!!!!!",
        "What underwater biome do you wanna see next? ",
        "Thank you for the win ️️️️️",
        "Love the work keep it up",
        "I found o all",
        "I love this teredl!!!!!!",
        "Hey I have to go but I want that cage",
        "ee!",
        "found puffer fish",
        "i have found them all first the chest second the pufferfish and last alex.\nYour so talented i wish i can be like you but keep that talented on",
        "Harry is MVP!!",
        "How big will harry get",
        "what abt kirby how is she :(",
        "Woooooooooooooooooooooooooooooooooooooooooooooow",
        "Hiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiuiiiiiiiiiiioiiiiiiiiiiiiiiiiiiiiiiiiiiiii",
        "i found all the things",
        "Btw if you didn't find Alex go to time 6:11",
        "You should do a fish tank inside of a fish tank",
        "i saw them",
        "See easy médium hard",
        "This is absolutely positively amazing I can't be more proud of how Far  you have come. Also my childhood I have watched you videos and I just can't be more proud of how Can you make all these tanks and finally I got my fish but I really need a fish kit I like subscribe and literally watch all your videos You're just amazing",
        "THIS IS SOOO COOOOL! btw thank you for inspiring my mom to let me have fish:)",
        "Alex mtble flash",
        "I know i said this on your last video but  thank you for taking the time and care to make such incredible videos. Also thank you for being flexible and willing to spend so much money and time on just internment for people you don’t know.(I know this also helped the fish/aquatic animal)",
        "That tank was amazing.",
        "I found all",
        "i have a turtle too",
        "Omg so good!",
        "Wee got me dead cute",
        "Yeah me to i founb them",
        "Make a LEGO axolotl next",
        "1:38 the chest",
        "I love Minecraft and real fish and so I also like turtles so this tank was perfect",
        "Hi I love him he’s so cute",
        "I saw the chest",
        "I love the beach and the aquarium",
        "I didnt find the easy i found the medium and hard lol",
        "ASTA e",
        "Her:this is not good",
        "He is so cute but also make sure that the Lego not found a water today he doesn’t think it’s a snack",
        "A Roblox themed and and I'll be to help your trolls get more strong by the way I love you and your channel",
        "how?",
        "O my gosh!!! Harry looks so cute in his new tank",
        "Awesome masterpiece ",
        "I only found the pufferfish and the chest",
        "1:38 easy",
        "how you dont get scared about the fact he can eat the lego palm tree? i have a turtle too and he loves eating green things! i even have some toys for him but i dont put them in the tank cause he tries to eat them (he even bit me lol)",
        "harry is mvp! can’t believe I didn’t get the notification for this video",
        "I'm like it!!!",
        "1.37 1st",
        "Try a frog Minecraft tank",
        "Why would you put legos in the tank if they eat that they will choke and die",
        "Very nice, New Subscriber",
        "6:12",
        "Yay",
        "I found the chest!",
        "mmm yes aquarium filled with plastic + they are small plastic part + the animal is less inteligent than a human baby , i cannot see what will go wrong!",
        "U best U.S.A.'s youtuber! ",
        "This was a really cool video! Keep up the good work ",
        "Love your videos so much",
        "where do you keep your tanks that you make?",
        "Harry. Potter?",
        "Are use to have that turtle",
        "Now make a real aquarium for a lego fish",
        "co o l",
        "The chest was at 1:36 on the legos the puffer fish was at 4:05 in the bricks and lastly alex at 6:11 on the turtle hand",
        "I found to the puffer fish in the chest",
        "Very creative, love it !",
        "Goldfish tank",
        "I’m subscribe and can you make Sandy’s house for a squirrel without water because they are mammals and they can drown",
        "Dirk",
        "I Know You Want Them V\n                                          V\n                                          V\n                                          V",
        "I like your pet turtle it's cute",
        "how is kirrby",
        "I have two turtle such like your turtle, but they are small then a piece of cookie.",
        "Jajajia",
        "Love your videos ️ ",
        "Lol found all",
        "Always with the cringy ass sounds",
        "Harry : yo sup",
        "this is my dad mack",
        "",
        ":)",
        "Eudueudud",
        "1:37 Chest, 4:04 Puffer Fish, Alex 6:11",
        "Ye",
        "Awesome tank!!! I love it",
        "What type of turtle is harry",
        "Hew I saw a lego box and I have it",
        "Here’s the things to find! \n\n1:",
        "the 2 minutes was 2 seconds",
        "Subsrice",
        "And I found two",
        "can you make a nether biome",
        "uhu",
        "so cute",
        "e",
        "Pls makes more videos i will do anything for you",
        "Harry: “mmmm! LEFY LEAVES  maybe she put me a snack!!!”         Hours ago: “hopefully harry doesn’t eat ‘em!”",
        "Me find all of them",
        "Kirby update",
        "Omg I love seeing all your videos with all the sea creatures and how much effort u put into this awesome builds",
        "harry is cute",
        "I want to see the coral reef and how much she puts effort into the build and it turns out amazing ",
        "Do the plane pls",
        "I love your videos",
        "What Kind of turtle is it?",
        "what kind of turtle is he? mine a red eared slider",
        "0:9 “I’m even going to surprise everybody” \n\nwell it’s not much of a surprise anymore is it",
        "Fish*",
        "Hey, I love your videos alot and I watch everyone of them, it would be my dream to be gifted the fish tank you are giving away!!️ I also really appreciate all the behind the scenes work you do to make the videos possible!",
        "My sister has a turtle and shes SO CUTE I so happy that you included turtles",
        "Easy is first to see second hard thir mideum",
        "I found all them thanks",
        "Ok  Sub sus gra LEGO Minecrafte",
        "I watch all your videos  as soon as I get the time",
        "here is the fish 4:05",
        "Now I just saw medium",
        "Can yo please do a crab Minecraft biome",
        "But that thumbnail Minecraft+Lego bruh ",
        "You are absolutely omg ",
        "Love it!",
        "hi i like the krusty krab",
        "Babbbbyyyyyy turttttlleeeee!!! I love your dedication! You are my favorite YouTuber :)",
        "This is amazing! I think that you should do the coral reefs from Minecraft next! And the amount of time you spend in your videos is amazing! Keep up the good work!",
        "I saw the pufferfish and chest but no Alex",
        "The nether",
        "I think harry is lonely he might need his friend",
        "L see3",
        "i really like legos and turtles so seeing them both at the same time is crazy",
        " Amazing",
        "I found all three of the things of the challenge",
        "What about if you do the enderworld",
        "Harry iz so cute♡ happy vacation  buddy",
        "Hello i like aquariums and fish",
        "Makes me so happy every time you post!! ",
        "hi",
        "🪸 hey I think you should get one of the biggest crabs in the world",
        "I found the chest",
        "Do a squid",
        "you are the animal loving female Mathew beem",
        "Peppa pig!\nFor a real ",
        "I subscribe 1:30",
        "I bet Harry is so happy",
        "harry its to cute!!!",
        "Yay turtle",
        "Make a  home for your pet puffer fish out of Legos",
        "️",
        "Your videos are amazing!!!!!!!!! ",
        "I think I spotted the hardest character in the video",
        "i  no have lego",
        "I only found the chest and Alex",
        "I love your videos! Next, you should do an ocean monument!",
        "even tho im 3 days late i still find the legos you mention in the video:\n1-chest 1:38\n2-pufferfish 4:05\n3-alex 6:11",
        "i love you videos soo much! Soo cute and amazing! you are awesome! WOW what a tank!",
        "I Love you ️️",
        "I would love if i could get a kit",
        "Ruduehf",
        "Next we make the coral reef with dolphins",
        "I saw Alex and puffer",
        "Wet  pets yeah  he looks like a berry   awww",
        "I know people probably dont care but \nPuffer is 4:05",
        "Love the work love your videos your videos are so cool awesome Don’t let anyone let you down",
        "I know you want them |\n                                      |\n                                      |\n                                     V",
        "I have a turtle and his tank is to small could you help us pls",
        "i found it all :D",
        "How much do you earn ?",
        "I spotted the medium one at 1:38 minutes",
        "My fish died and I really want a new one please pretty please",
        "this is everyone’s dream",
        "The turtles probably gonna end up destroying the tank in a few days or weeks the most turtles I have destroyed their tank all the time Because musk turtles are very destructive critters lol",
        "Love harry",
        "I love turtles they are so cute ",
        "!vimos los 3¡",
        "See 1 2  3  I  won",
        "Make a lego hoyt aquarium",
        "I want one",
        "i saw the pufferfish",
        "hahahahahhhahhhahaa",
        "Can you put 1 plus 1 is a huge sweeper1+1=?",
        "And I found three",
        "How is it a Secret if you already told us",
        "I find all of them",
        "Done with your plan",
        "1:43 ”Lets build legos only turtle set”\nCries in 21152 The pirate ship adventure",
        "Always happy to watch your new videos ",
        "You should make a Minecraft ocean monument and have a  Fish or animal that looks like a guardian/elder guardian",
        "thanks for Lucy getting a friend and also how is butters doing",
        "I love watching your videos",
        "I Have a Turtle so i like harry he is very cute",
        "Another great build using your unique imagination!! So inspiring! Thanks for sharing!",
        "dddooonnneeeee",
        "Do you like Lego since childhood.",
        "Me and my son Jacoby are big fans so happy to find your channel",
        "I have a pet  too but it is a land I named her tortiea",
        "You: “Hiding his favorite snacks” \nTurtle: *screams*",
        "I subed",
        "Love the video!",
        "1:38",
        "COOLLLLLL",
        "WHERE IS THE ALEX",
        "Subsribe",
        "so many epic setups",
        "I found the chest with the fish and other thing when you spilled the box at the beggining",
        "the fact you do all this, spending hundreds of dollars on youtube. amazing",
        "Chest and puffer",
        "I saw medium",
        "I saw the chest when you where throwing out the Lego\nI saw the hard one at 6:13 in the video on the side of the flippers of the turtle\nHopefully I won a fishtank  Even tho I didn't see the pufferfish ",
        "@Aquarium info \n\nHello and if you don’t remember me I’m Pierre and I need help. \n ",
        "Can I please have a fish set",
        "Dang she can't hide them all I already found them",
        "Amazing! How do you even make this you are so creative!",
        "OMG! I absolutely LOVE minecraft! This is just AMAZING! I LOVE IT!! I really love axolotls and Lucy is my favorite axolotl you have. Just from watching your videos I always wonder, \" How long did that take because it is insane!\" I love the content you create it is wonderful. It is literally all I watch all the time! Thank you so much for putting so effort and time into your videos! PS, can you please do a forest biome next?",
        "Really put plastic near a turtle",
        "Adorable! Could the Lego lamp serve as a basking light?",
        "i see all easy medium and hard",
        "4:05 a pufferfish",
        "That was so cool! You always come up with the neatest ideas.",
        "I see all and i sub",
        "Chest 1:37 Pufferfiish 4:05",
        "These are so cool! These tanks are so creative and amazing! Keep up the good work, Aquarium Info! ^^",
        "My turtles are very cute to!",
        "I found the pufferfish!",
        "I love your video is amazing your fish and your turtle is vary cutie like I'm dying by look cus it sooooooo cutie.byeee",
        "I found easy",
        "The bubble rest",
        "Hi I just love the things you make and you have made me love nature and animals more so I would appreciate if you sent it to me but \nYou don’t have to",
        "I love all the turtles  ️  ️  ",
        "The destroyed drowned houses? I want to see them next!",
        "I FOUND  ALL THREE ️ and  treasure  cest.",
        "I love your video and when I grow up I want to be a marine bio",
        "Really want one of those wet pets tanks",
        "Can I have on my fish tAnk is in very bad condition ",
        "Hi I just wanted to say hi and say how beautiful all your builds are and how much effort you put into them.The amount of effort you put into your channel. From you I have learned a lot about fishes from the little facts you throw.",
        "I am your biggest fan",
        "I love to watch your videos I just feel relaxed while watching",
        "I found 1",
        "Next do tropical fish tank can you use real croal",
        "I found Steve",
        "I se one",
        "too easy",
        "Hi aquarium info I love your vids, I think they are very interesting and entertaining",
        "I FOND THEM AND THE BOIME IS ULTRA SICK",
        "I am a couch fan at your videos",
        "Harry is my brother's name but he is not a turtle",
        "Can I please have the fish tank I’ve watched almost very video and love your work I want to be just like you when I grow up",
        "iPhone",
        "Build no built",
        "I HAVE A TURTLE TOO HE'S  NAME IS ALSO HARRY",
        "HARRY REMIND ME OF LEO MY DEAD TURTLE REST IN Peace Leo  IT'S BEEN 9 YEARS",
        "Your videos are always so interesting and so fun to watch them. Harry seems so happy with his tank. Keep it up with the good work.",
        "Nether",
        "i work with fish every day at school your channel is so entertaining, cant wait to see whats next",
        "I found them all",
        "Harry is cute",
        "can anyone say where the characters\n are",
        "The tank is beautiful",
        "This video was alsome",
        "THE TURTLE COULD CHIP HIS NAILS WOMAN FIX IT NOW",
        "You4 good at this stuff",
        "I found them all!!",
        "I want my acuarium webpets!!!!!!",
        "the next one is a baby  ",
        "This was fun to watch and made me think about that one show I used to watch when i went to my grandma's called \"Tanked\" where they built huge fish tanks for a bunch of people, lol.",
        "this is amazing to see. i have a turlte of my own and this was heartwarming to see created. a really nice habitat for that cute turtle",
        "i found ol of them icsept the hard wun",
        "this is so amazing!",
        "I absolutely love what you do for these animals people should be more like you.",
        "I want to test",
        "Get one more turtle for harry",
        "i found the pufferfis! 4:05",
        "Hello make me a sandwich made of Lego please",
        "I found easy medium and hard and I love your videos so much i wait so long for you to post I loved this vid btw",
        "Oh my gosh this is so intense and I love the turtle I’ve just started watching",
        "I have a limetid turtal Lego set",
        "Not being mean I  ur vids but u could use glue u know that",
        "I find easy and hard",
        "#animal lover ",
        "0:59 i spot the characters",
        "4:05pufrfish",
        "I hope I get a wetpets kit! I love the hard work in every video!",
        "You love animals so much and give them everything they need so cute",
        "WOW THAT IS SUPER COOL AND AWESOME 1000000000X PLEASE CAN YOU NEXT PLEASE SPONGEBOB SANDY HOUSE PRETTY PLEEEEEEEEEEASE THAT'S VERY COOL FOR YOU",
        "1:00 İ found them all",
        "ILove",
        "I saw it the hard one",
        "I love turtles!!!!",
        "We all know she loves harry imagine how much she spend",
        "I think you can do a swamp biome",
        "I waited so long for a new video, so happy finally one came!! Love the turtle! :)",
        "These videos are great for bedtime",
        "I would love a kit I subscribed and you always try your best to get your tanks done ",
        "people, lol.",
        "pls make super mario pls :)",
        "I love it so much keep up the amazing work!",
        "Ok",
        "4.O5",
        "I will sub",
        "Please do a new video on the seahorses ",
        "It’s so cool and I’m starting watching it",
        "I found all the animals in the vid",
        "One for raplah",
        "So cute                          ",
        "Your videos are always so entertaining and interesting you make my day",
        "Legends has it Sigils is still trying to get the purple mask",
        "kit pies",
        "Never has a video been so satisfying and pissed me off so much at the same time",
        "Omg that Turtel is so cute!!!!!!!️️️️",
        "I got them where I can send u photos",
        "Chess and Lego person",
        "Subscribed:)",
        "Hello I watch your videos and it made me super interested in fish thank youand have a wonderful year",
        "You don’t seem like a Lego builder but of how cool it is and money spent, I got to give respect.",
        "I have a turtle named taco in real life",
        "How old are you I have four turtles",
        "I’m sub",
        "Never let them know your Next move\nALEX PUFFERFISH AND CHEST",
        "This is insanely creative and interesting content.  you deserve  A LOT more viewers and subs. This is what I wanna see on yt",
        "Found them all",
        "i have 2 Lego Minecraft",
        "Please I have fish",
        "puffer fish 4:05",
        "The puffer fish was at 4:05",
        "You should post a video will you show us what Alexis",
        "i spoted all of the charectors becouse you showed them so i win",
        "nice fish tank this one",
        "Buy a second turtle and name Him yoga okay  okay",
        "lucky you. you probably have Lego for $3 or $4, but in Russia it' eeeeexpensive",
        "4:05 the puffer fish",
        "Yay I did the challenge I feel smart",
        "I found the treasure chest in a pile of lego's",
        "I found easy medium and hard",
        "your the best!!",
        "That’s so cool ",
        "This is so cool, these ideas never get boring. The Lego ones are AWESOME.",
        "the noises harry makes are just so adorable!",
        "Minecraft, and turtles. The best!",
        "I found all three of them",
        "Wait! You remermber the fridge? Yeah i dare you to make a fridge into a tank",
        "So cool and cute!!! I love building legos but this tops it off!!!",
        "Sorry I missed spelled it",
        "I found them all I found the puffer fish I found the chest now you find I found the Steve girl Alex",
        "Wow so cool ! Can you maybe do some more Turtle videos or maybe make a tropical fish tank for a pair of tropical angel fish ",
        "Can you make more minecraft aquarium whit tropical fish",
        "Can you deliver that and sunrise pagadian city",
        "Why is Harry so cute",
        "Found all hiding seeckis",
        "I had that turtle but he died",
        "Or you worked with another company.",
        "Your turtle is so cute",
        "I only found the chest fish and Diamond and the fish",
        "Our 15 yr old son, Samuel, LOVES aquatic pets. He plans to have a fish room when he gets older!\n   Harry's new lego aquarium looks great!",
        "love your daily videos great job on that tank",
        "2/3  maneraft lego",
        "3:29 that is probably a hint for a next video, so watch ppl",
        "I SAW ALL THE THINGS",
        "I love these builds, such cool ideas. \nI would love to see you add 20-30 seconds of final glamour shots at the end of each video",
        "JOUR DA BEST",
        "A fridge might be something you can turn into a fridge, Nothing is impossible!",
        "Do you know that  set came with eggs right",
        "Lego has done more than one set with lego turtles",
        "I want a aquarium so badly ;-;",
        "I saw all of Them",
        "6:11 for alex",
        "Amazing build it is great for that cute turtle",
        "Thank you for making my day, \nI so was upset today.",
        "Make octopus pet nane it ron please",
        "I love the island on top with the palm tree it is so cute",
        "I found all the Lego things",
        "I find them all",
        "Toca Boca ",
        "I have a turtle named Luna she is 2nd  and harry is so cute",
        "Where did you get the sea grass?",
        "If the vegan teacher checked your channel she would be happy",
        "I fond the oll",
        "Ralph is contsum",
        "YOOO THERE IS GREEN FROM RAINBOW FRIENDS",
        "I have a baby turtle too! Mine is named April and she's a girl.",
        "Hmm I think a among us do you know a among us? Pls",
        "I need to do would be to hide Alex are you supposed will you find Alex in the next video please",
        "This channel is the best! I love how you are so creative and fun!",
        "Can  you  make a jallyfish tank",
        "I LOVE THE SQEEKS",
        "i sol it oluv it",
        "Flip??",
        "IM like you and you turtles is Soo cuteee",
        "Maybe you could store Harry’s food. In the turtle head",
        "Hey Jamie!  I got a new betta fish the other day, and he is not eating his food. I find that he only eats when I crumble the food up, even then he doesn't eat all of it. Is there anything you know about how to help him eat?",
        "Do a my singing monsters tank",
        "You literally showed us the characters",
        "I find all chest is blocks.\nAlex right head of turtle time 6:12 \nFish in your favorite products",
        "I can’t believe you made it walk on the Legos",
        "The fact you use the desert rain frog sqweeck for the turtle",
        "Ur sooo nice!!!! Didn't know people can be so nice to their pets!",
        "1:37 found treasure test \n4:05 found puffer fish \n6:11 found Alex at corner",
        "You put so much time and effort into your videos keep up the good work",
        "Its funny because she smiles when there is a problem ",
        "Like ILove! LEGO",
        "I love how happy he looked at the end",
        "I love all your videos so does my family we think you're amazing and me and my family are trying to talk my dad and to getting a turtle tank we have fish but they're kind of boring but We still like them they're cool but we really wanna turtle so please send a turtle tank thank you",
        "The amount of effort and creativity is so entertaining! You basically raised me throughout my childhood . With love, K",
        "Found medium",
        "It like where is Waldo",
        "I didnt find Alex and your Harry is cute️",
        "4:05",
        "Çok güzel bir çalima keşke benimde kablunbağ olsa",
        "Imagine that harry automatically goes for the plants",
        "We're was the alax",
        "Done subscribing",
        "1:00 found all the characters",
        "I found the chest and the puffer fish but couldn't find Alex.You're so good at hiding things!",
        "I have found them",
        "Harry is cute ",
        "I want to see the neater biome next",
        "Minecraft  is fun!!!",
        "you should do a planz bio and put some gold fish if you have some\nor put butter in",
        "this is probably better than the last mc video. I love when you combine 2 things I love and you do it correctly (unlike some people *cough r/shittyaquariums). thank you so much for helping us enjoy the fish hobby and putting a fun spin on things",
        "How You buy that?",
        "Next: I built LEGO Minecraft for a Real Squid (Ocean Biome)",
        "KIRBY UPDATE",
        "That’s one spoiled turtle!! Awesome video as always",
        "You are a good mom",
        "one tank is worth a full pc setup",
        "It would be cool if you made a coral reef",
        "This is every child  dream aquarium. Love your channel. Love to sit down with grandkids and see how excited they get.",
        "Can I pls have a kit?? I use to have a fish but he died 2 days later",
        "Can you do a ocean monument with a pelagic porcupine puffer",
        "You guys work really hard and I like that by the way I am new the date is 2022 November something",
        "Jag såg dem toaletta Super lätta",
        "I just want to say this, I love your videos they really are amazing and unique I have been subscribed for a while now hope I win the wetpets! ️",
        "New sub ",
        "Does anybody want to see Kirby again?",
        "i found all the loges figure u already show them",
        "Congrats on over 2 million",
        "Can you build a Minecraft biome for Ralph? It would be fun to see!!",
        "Omg is in the legos! 4:03 pufferfsh",
        "WOW",
        "i love it ",
        "Just to say she said the axolotl video was from a week ago yet it’s actually a month",
        "is it safe for turtle to have plastic bricks ina water if u planning let them be in aquarium for long time?",
        "You are making me have a turtle",
        "Kinda early!",
        "The easy Box was in the Lego Box  the 2nd thing was in the Blond Legos 3rd one i cant not find",
        "This was epic",
        "Next time you build a Lego fish tank use glue to keep it together love the videos",
        "What a cute turtle!",
        "6:11 found Alex at corner",
        "Give me my wetpets aquarium I subscribed"
    ],
    "comments_disabled": false
}