{
    "video_id": "C2YSX4sV_bA",
    "comments": [
        "Guccis evolution as not only an artist but person has really been an incredible thing to witness. RIP Takeoff",
        "One of the most underrated rappers ever ",
        "This is so cringe",
        "Rest in peace  takeoff",
        "This song was very heart felt ️ it takes a lot for a rapper to show their softer side since they have to play the role of being a tough, badass most of the time so people don't think their weak, and I praise him for letting us see his. \nHis words are powerful, really telling us that no matter how much money you have or how famous you are, your life can be taken in an instant, here today and could be gone tomorrow. ",
        "How is he clout chasing for dedicating a song to his friend?",
        "LLJ",
        "This is insane",
        "Solid my bro well spoken Rip take",
        "Take off was good Riprest in peace to him sorry to hear that this man was good guy",
        "This made me tear up. I’ve never got so emotional over a loss of a complete stranger as I have over the loss of Takeoff! This was an absolute tragedy  Gucci is a real one for this. RIP TAKEOFF",
        "Gucci such a real one ",
        "🇨 ",
        "Rip Takeoff",
        "️And that folks is how you speak from your heart in rhyme with reason  ",
        "Loved 🇲🇿",
        "Gucci Mane thank you very much, be blessed",
        "Legends never die. He is with each of us and will always live as long as his music and our memory of him are alive. RIP Take",
        "This is so REAL!  Make a grown ass man shed a tear!  Every word on this track hit HARD!  I thank you for this one Gucci!",
        "Big shout out to the video director of this",
        " Love u you Takeoff ",
        "🇪",
        "Real homie much love Gucci ",
        "Descanse em paz Take Off!!! Essa mensagem é pra representar todos nós de língua oficial portuguesa que sentimos muito pela morte do Take!",
        "RIP LEGEND",
        "Damn Gucci you must be misinformed about about Herschel Walker he's a patriot and a legend if he gets in it will be great for America don't know what you were told or what you heard",
        "This song will always be remembered  rip Takeoff ",
        "Take ",
        "Was take off buried or cremated",
        "U are the best Gucci I respect u man",
        "He always gonna give us music when a rapper dies and i salute him for that ",
        "I love this the beat the flow everything just flows together absolutely beautiful ️GUCCI",
        " 🇪🇪🇪",
        "He always shows so much Respect and Honers these Men almost the only one to make songs for those lost in this business \nThis1Hurt\nLong live TakeOff As lyrical as they come!",
        "He’s needs another ALBUM .",
        "We can't lose Gucci Mane ",
        "This song is so beautiful and speaks with love and respect to the artist we lost.  Thank you, Gucci Mane.  Rest in peace Takeoff, PNB Rock, Young Dolph, and XXX.",
        "Crazy to see Gucci so healthy and alive… thought he would have been dead a decade ago.  man’s really turned around his whole life.",
        "Gucci sempre foi muito referência pros migos, geral sabe, muito merecido essa homenagem 🇧🇷",
        "never heard of Gucci mane, though he really moves it",
        "Gucci is a real one, RIP TAKEOFF🥹",
        "Gucci NEVER disappoints!!! REST IN POWER KING TAKEOFF!! ",
        " 🇮",
        "Xxx\nPnb rock\nJuice world\nTakeoff",
        "🇨  ",
        "rest in peace easy, Take\nwe miss u",
        "Love you  Takeoff. Love you  Rick Ross ️ thanks for the song I'm sorry  I'll pray for you and your families ️",
        "Thank you Gucci for this song ",
        "GUCCI MANE IS A DIFFERENT KIND OF RESPECT ",
        "Zaytoven got me on repeat",
        "w",
        "Gucci take quavo Jackie chan Woooh",
        "Wow…this deep. RIP to all our fallen angels …we miss y’all ",
        "No matter what happens, how old I get, what happens in my life, who comes in and out of it, these videos will always be here for me, and for all of us. Techno was a light that shone brighter than any other out there, and he was a real beacon of hope for many of us. I'm just very glad that he's resting now, and doesn't have to suffer anymore. Props to you, Techno, and as the saying goes, \"Technoblade nevah dies!\"",
        "But damn TAKEOFF was perfect ",
        "I ain't gone lie this song touched my heart ",
        "A legend",
        "Last banger for 2022, RIP TAKEOFF",
        "Its gucci",
        "This man always shows respect to all the fallen rappers and soldiers. Have to show him and give him his respect. 🫡  ",
        "Finally I hear something for my man @takeoff RIP 🇵🇷🫶 thanks @gucci ",
        "RIP ALL LEGEND I WILL REMEMBER U FOREVER ",
        "METRO!!!",
        "Damn this is hard",
        "I felt them bars real talk ",
        "🇳🇳 ",
        "This gave me goosebumps.",
        "Gracias Gucci Mane...\nUna muy buena manera de rendir homenaje a nuestra gran estrella Takeoff  una gran forma para decir cuanto se extrañará y dolió su adelanto, El Uno de los mejores nos dejó muy buena música y quedará para siempre, así como cada una de las estrellas del hip hop que ya no están con nosotros, Los tenemos en el corazón mi pésame para todos sus seres queridos que sufren esta gran pérdida, Descansa en paz takeoff ",
        " 🇹🇹🇹",
        "It's hitting hard",
        "It’s Gucciiiii!   ",
        "The growth and transformation of guwop is great to see",
        "Y’all should’ve heard the song he did for dolph Gucci definitely be dropping heat on his loved ones",
        "FYEE!<3333",
        "take off  we love",
        "LL ",
        "🇰🇹 ",
        "BFFM we got next ! Jersey stand up ! blackfamilyfirst Muzic new YouTube channel",
        "Letter to Take'\nHuh? Go\nJust left another funeral, I shed a tear (damn)\nI'm still in disbelief, I can't believe it's real",
        "Blessings Gucci",
        "G shit ",
        "Is it wrong for me to have almost shedded a tear listening to this song? Take was definitely one of a kind and brought a unique delivery and flow to the rap game that quickly and drastically influence today's hip hop generation, it hurt my heart to hear of his passing and I didn't even know him personally. We miss you Take Off! R.I.P. to all of the fallen stars!!",
        "Don't blame God he said not to kill.. these are people decision.",
        "Just left another funeral, I shed a tear (Damn)\nI'm still in disbelief, I can't believe it's real\nI think about the memories, it give me chills\nI'm wonderin' why they left the fake and took the real (Real)",
        "🇳 ",
        "I cried watching this and then put it on repeat to watch and cry again. He paid respect to quite a few. Guwop always been my dawg. ",
        "Nicki haven't forgot Gucci",
        "Might as well say it.\nA Gucci Mane, Jezzy, Stat Quo & Cool Breeze album would be !!!",
        "🇰  🇳🇳🇳",
        "I cry every time I hear this song.",
        "It’s nice to see Gucci Mane evolve , seems like his gotten way better than he was before ",
        "I'm so so so sorry for Your Loss.. Praying for Healing Strength and sending Love to All Takeoffs Loved Ones. RIP TakeOff\n️️️️️️",
        "I can also feel how touched is Gucci",
        "Damn a rap song ain't Neva made me cry until now *luv Gucci",
        "Repose en paix takeoff ",
        "love Gucci",
        "For the respect",
        "We don't look for old songs, we look for the memories they carry",
        "To hard I look up to you big bra ️",
        "I Love This he hittin' feelings \nWith This One \n\n#LLMama ️",
        "Gucci showing these youngins how you supposed to mature in the rap game ",
        "Rest in peace to Young Dolph....that made me cry.",
        "Don’t really listen to Gucci but big props to him for putting x in his song. RIP to the fallen soldiers",
        "Desde Argentina 🇦🇷\nPor siempre takeoff",
        "The last line of the song is really touching about how he talks about the personality of Takeoff and also gives his condolences with hiw he have known him for 10yrs and knew he was going to be a star. Ur legacy will never be forgotten Takeoff and may ur soul RIP",
        "Muito foda essa homenagem ter vindo por parte de uma das maiores lendas do rap, de uma lenda pra outra, descanse em paz take seu legado e sua voz nunca morreram... Rip Take",
        "Wow Gucci",
        "Gucci is such a legend. This song is bittersweet to hear from all the losses of incredible musicians but as a fan, it means a lot to hear what he has to say.",
        "Respect",
        "Thank you Gucci for this sont",
        "Heartfelt",
        "The fact the beat is reminiscent of the type of trap beats Migos blew up with, is touching. This really was a tribute. RIP Takeoff, fr",
        "I don't play Politics ",
        "Gucci’s growth as a man and an artist is amazing to witness. I’m glad that he made a song for takeoff to help everyone grieve for him as well, there’s no way takeoff should be gone so soon ",
        "Damn Gucci ",
        "Gucci Mane go in sooo hard on this, Shoreline dun went in HAM too! They aint like all them other artists out there who just be usin dat IGROCKET dawwwt cawwwwm jawwwn to go HAM ON THE GRAM smh seem like anyone can glow up these days...",
        "Perfectly done. Gucci thank you for showing vulnerability and truth in this work of art. Praying for the family and friends. LL",
        "🇪🇪🇪 ",
        "Rip LLD. REST IN PEACE. To ALL those lost.",
        "Ohh shitt he put them gloves on time to kill..........",
        "Gucci, what a class act. We're lucky to have you here with us sharing your thoughts and prayers.",
        "Respect TAKE…..One time for GUWOP!",
        "The definition of growth as a rapper right before your eyes",
        "Gucci always shows the most love & respect.\nRIP to everyone who ain’t with us anymore! ",
        "This really summarizes alot of how I feel being a rap fan. Lotta loss and heartache in this shit. Thanks for this, GuWop. Long Live Take ",
        "Bruh Gucci has never disappointed me fr he been killing it since forever  Rip Take ",
        "This is why I love Gucci mane,he's always the first rapper to pay tribute to dead rappers.  Rip Takeoff you'll never be forgotten ",
        "He said it's a  society when he look through eyes .",
        "N***a Gucci\nI loved that song is talking about memories of takeoff",
        "Well done Gucci this is coming straight from your heart.",
        "Respect, you can feel the grief he personally feels and that anyone feels when loosing a good friend. Rip takeoff that man was legend",
        "Gucci never disappoint R.i.P  TakeOff For the Family Sad Times We living in praying for better days",
        "Gucci got this one right",
        "Takeoff will truly be missed. This letter was full of love. Glad to see your growth Gucci.",
        "Emocionante a Firma N O R U E G A  R E C O R D S Agradece\n\n ",
        "Fuck yeah Gucci",
        "Thanks so much Gucci for your tribute  song. RIP ️ TAKE ️",
        "This the best dedication rap song in 2022. Rip Takeoff & others who has loss there lives to senseless gun violence. Jealousy & hatred destroying lives daily. Gucci got down with this one",
        "Damn!! I truly did feel this shit. I felt it even before this but I’m REALLY feeling it now. What a beautiful tribute Gucci…first class just like TakeOff️. And let me just say how suave Mr Guwop looks in this video. Your stylist (probably wifey lol) did that!! Come through Davis’s.",
        " 🇱",
        "Try profit off him what happen let the dead rest as in leave them be no need keep talkin about it just for a buck ",
        "Love this",
        "That line about Slim Dunkin sent chills down my spine. SQUAAD!",
        "This song go hard!! Respect. Rip to Takeoff ",
        "Damn I’m surprised he didn’t mention offset 2:38",
        "Does the beat remind anyone else of goldeneye 007 for n64?",
        "Now that’s the old Gucci music I remember!!!",
        "🇨🇨🇨 ",
        "I’m proud of Gucci has become fam. Respect. Long Live spaceman ",
        "Guwop! Much respect for this track...",
        "Gucci expressed how we are feeling through music & that’s what we need. Not another ig caption but a space to fill when fans & other musicians can’t put together our words. Love Gucci for this. ",
        "This Gucci tribute to the late rappers will always be remembered ️",
        " 🇰🇰",
        "Gucci did his thing..appreciate him even taken the time out to make this song.  much love and respect. R.i.P Takeoff and Dolph ",
        "Thank you Gucci for the song: Respect and Love: RIP to TAKEOFF",
        "Thank you, Gucci. This is so dope, so thoughtful, so heartfelt. Rest in peace, Takeoff.",
        "That Hershel line was real",
        "Well said Gucci! Respect! RIP TAKEOFF! ",
        "They kill our rappers thinking hip hop will die, hip hop will never die, we shall multiply. Special thanks to Gucci, we needed to hear this. RIP TAKE",
        "RIP to all the legends ",
        "\"When Gucci called ma manager, that night it changed ma life\" - Quavo\n\nRIP Take Off",
        "Rest easy Takk️️",
        "Gucci holla at Capone beats ain't Free..",
        "gucci a real one fr",
        " fan since Freaky Gurl. Never skipped a day ",
        "I got mad respect for Gucci mane for this because, not only did he talk about Takeoff he mentioned a lot of other rappers passing and getting locked. This is so wholesome and sad at the same time. R.I.P all the rappers mentioned in this song️",
        "God Bless you Gucci ManeRest in Love Takeoff️",
        "Respect to Gucci for this track 🫡 #TheLastRocket",
        "Gucci is a real one for this song. Showing love to my homie takeoff and all the others who lost their lives so sad  Rip takeoff ever since I woke up to the news of you being shot n killed on Facebook. I haven't been the dame since it felt like a nightmare till I realized I wasn't dreaming this was real life.",
        "He will not hear u btw",
        "Gucci needs to make every RIP track!! Rest in Peace Takeoff",
        "Always on point !! We appreciate what you do for the culture Gucci ! True living legend\n\nRIP Takeoff ",
        "TakeOff was perfect. ",
        "This thing we call, LIFE... It can be taken away from you in a second. Be grateful, thankful, and love everyone because you never know when you'll be called home. Rest Easy TAKEOFF ",
        "Thank you Guwop for this drop here....I love it ",
        "Man I've been a fan of Gucci since you first dropped a radio hit icy over the summer he is very smart and well-respected for him to make a song like this is unbelievable major props we all hurting due to all these rappers dying Keep Your Head on a swivel and keep 10 toes down",
        "Legends don't die, they live forever! RIP Takeoff.",
        "We miss you takeoff    for real why the take the real and keep the fake",
        "us vs them was made for a reason ",
        "I just got chills listening to this I commend everyone who is turning to music instead of violence during this because too many great artist been lost over the years most are preventable… long live takeoff forever in are hearts",
        "Great record from Gucci...  Glad he spoke on Dunk.",
        "Rest In Peace, TakeOff",
        "Everything  he saying is strat facts",
        "R.I.P takeoff️ great tribute Gucci, when you sing directly by your heart music comes automatly",
        "I got mad respect for Gucci mane for this because, not only did he talk about Takeoff he mentioned a lot of other rappers passing and getting locked. This is so wholesome and sad at the same time. R.I.P all the rappers mentioned in this song",
        "🇨",
        "Rest in peace takeoff the game not going to be the same bro",
        "this shit make me sad seeing a rapper talking bout these dead legends makes me sad, respect to gucci",
        "Vão fazer muita falta na cena da música tekeoff descanse em paz guerreiro..🇧🇷🇧🇷",
        "🇨🇨",
        "Hershey walker ",
        "Thats a amazing tribute",
        "Making me cry though ",
        "Man we gotta stop doing this to each other. Shout out big guwop much love and respect for this . Still in disbelief cuz he was my favorite out the group",
        "#GRHS  # LLtakeoff  ️ #guccimane I'm so glad he got to tell you he love you them the best words eva better than money you can't buy that  #LLtakeoff ",
        "Romelu Lukaku this you or what?",
        "Just becomes more obvious this was an industry sacrifice",
        "Deus te guarde, voc vai fazer muita falta em todos nossos coraes Take!!!!! O Brasil te ama, o mundo te ama. Sua msica ser eterna, voc , e sempre ser uma lenda.",
        "Please we need to stop killing each other love one another we need it the most today",
        "Much respect ",
        "THATS NOT JUST A LETTER , THATS A GANGSTA LOVE TALK  , MAD RESPECT TO LAFLARE",
        "Mommaaaaa",
        "This beautiful ",
        "Damn, this man is an amazing artist. My people need to stop the violence, and jealousy!",
        "Man this shit hard no CAPP",
        "Gucci snapped",
        "Gucci a verdadeira lenda, sempre com palavras fortes em suas músicas porém tudo real. Ouvindo gucci á 2 décadas nunca desaponta. Descanse em paz JOVEM  CONDOLÊNCIAS A TODA FAMÍLIA MIGOS.",
        "Respect Gucci! That hit hard much love.  RIP Takeoff...Gone but your legacy will be Infinite ️ ",
        "Dope track gucci mane ",
        "🇹🇹 ",
        "Respect to Gucci for this!️ Love him anyway, but this was really putting his heart out there to recognise those precious artists/people lost. This is a beautiful, I would say “memorial” but its better than that, its a flying flag in the sky to show everyone what Takeoff meant to the world. I say “in the sky” because hopefully Takeoff sees it, from where he has parked his Rocket in Paradise️ and I’m sure he would join me in the Salute to Guwop for this!! This is GOAT material",
        "Rest in Power and Paradise LEGENDARY RAPPER FOREVER TAKEOFF ",
        "Well Damn",
        "Gucci sure has grown. Not a lot of artist at his age matured like this.",
        "BigGuapNat",
        "One of the best songs",
        "Gucci",
        "Thank God Gucci lived to see himself become a voice for the masses to be an example of how a man can change for the better. It's unfortunate, but I think this was almost this era's 'I'll be missing you' and it was done so tastefully while also paying tribute to the other artists who have passed. This was the way to go. Good work Gucci.",
        "️",
        "I'm here to say that Gucci has come along way. I guess you can say that we pretty much grew up together. He really holding it down and I feel him on this Takeoff . Rappers really are targets these days. Remember who you are and what you are. Rip up Takeoff and Young Dolph ",
        "The evolution of Gucci is inspiring. He has come a long way in his career. I am still in disbelief about what happened to Takeoff. This tribute to Takeoff is well done and you can feel what Gucci is feeling. @guccimane thank you for this heartfelt masterpiece and Long live Takeoff ",
        "Real talk",
        "Salute to Gucci he’s such a stand up dude can’t do nothing but show respect",
        "Got me in tears all over again.",
        "🇪🇪🇪",
        "The rap game is dangerous.prayers for all rappers that they all stay safe",
        "Gucci, you are amazing for this. As we all still trying to wrap our heads around this, it's definitely good to see this",
        "Long live rocket man",
        "Gucci always coming with them bars even in hardship or loss he still lay it down  R.I.P. to all the young Greats that we have lost.",
        "Been awhile since I heard some Gucci but bro still going hard.",
        "R.I.P ️",
        "When it comes to tribute Songs, Gucci is undoubtedly the G.O.A.T. \nThe guy raps with his heart. We can feel the emotion in his voice.\nWe love you Gucci \nRIP TAKEOFF  ",
        "U get past 20 million$$$..they see u b worthy\"$$ .& They come for you. Remember tht young Rappers",
        "Rip",
        "Gucci never ceases to impress.. I would love if he dropped a whole project as serious and powerful as this",
        "Nice to see #guccimane being #guccimane again",
        "Ay Yo Wop Was SPITTING on This One",
        "That was absolutely beautiful Gucci!  Loved the song and video and how you told Quavo here is your solder if you need to lean and your testimony right after. Thoughtful and encouraging.  I have always liked Gucci!  Always like the Migos as well. I usually prefer conscious rap but it was something about them where I said okay I like them, they grew on me quick.  ",
        "Closure",
        "U're a legend Gucci!!! out of everyone u were the only 1 to make this work ,Rip takeoff the world will always remember you",
        "Shiit.. I feel this one Gucci R.I.P  ",
        "RIP Takeoff Gucci is one of the GOATs like Takeoff <3 They aint like all these artists out here these days who just be blowin up on the GRAM by usin dat IGROCKET dawwwt cawwwm jawwwn to get they followerz up like them Island Boys dun did... SMH",
        "I never heard Gucci Mane this deep before",
        "It is crazy out here, I just lost my Momz ,nephew, uncle, and aunt in less then 2 months and including all these great people you’ve mentioned . We’ve gotta stay strong. Much love.",
        "Crazy how we don’t see more things like this in the industry. He paid tribute to the most innocent person he knew in the game and did it on a beat that Takeoff probably would’ve slid on himself… RIP Take. Everybody got you bro. People always say to take the high road but Atlanta gone get justice for this one no matter what…",
        "Another tribute well put together  SALUTE THIS MAN",
        "Whoever is reading this, God has a plan, trust the process ",
        "Talent!",
        "Damn...@YRNTakeoff would have done the most on this beat also...S/O 1017 CEO..Gucci \nRest in Paradise Young King Rocket  man",
        "I just watched the whole video and I must just say! It had me tearful! Gucci was spitting the truth and also sending a positive message. I haven't seen no others do what Gucci just did with this video. He gave his condolences in a whole video! That is some real and strong love right there. I have nothing but love and respect for Gucci. RIP to the  one and only Takeoff! Gone but will never be forgotten!",
        "RESPECT TO GUCCI MANE !    REST IN POWER TAKE OFF!!!!",
        "Hay que recordar lo que nos dijo papá Dios, que nos amemos unos a  otros y bendiciones a nuestros enemigos ️",
        "That's song went into my heart Guccie I hope you feel better Guccie Rip To Takeoff your artist for life",
        "The Best Song Gucci has ever made!",
        "Un hommages vraiment touchant \nBig respect a Gucci \nRepose en paix TAKEOFF",
        "Fire",
        "Gucci mane you are a legend",
        "Best song ever",
        "Didn’t know Takeoff personally but what an impact he made with each move he made in silence. Gucci thank you man for keeping everybody’s memory alive and reminding us of how precious life is.",
        "Much respect Gucci, you did it for Dolph and Tha boy TakeOff ",
        "Hell yea Gucci that's what's up bro keep that grind an that head up bro I know your pain an time don't heal it but do you for them that's all we can do ",
        "I still remember when wop said he met the Migos and they all had fake chains on so he gave each of them one of his and they took theirs off and threw them in the trash  ",
        "Respect to Gucci!!!! Growth!!!!!",
        "Real Gucci Mane underground medios temas que tiene ahora ",
        "Rest in Peace Takeoff",
        "🇪🇪 ",
        "Gucci Mane ",
        "You're  a real",
        "OMG I'm only 58 seconds in and I'm already shedding tears. He's saying everything I been feeling and reading about Take since he passed. He truly didn't deserve it.",
        "This song is ass it’s like a pre school kid reading a sad version of cat in the hat but RIP Takeoff.",
        "Him in all these damn trench coats, regardless of the season ",
        "RIP legends",
        "The speech he made at the end gave me actual chills. R.I.P Takeoff️.",
        "Keep it up man. This is what we need in these dire days. Let’s stop the senseless violence. Rip takeoff, rip dolph, rip x, rip pnb, rip juice",
        "for real I didn't know him and I can't stop crying",
        "Gucci never disappoints ",
        "Fresh fit af",
        "Love you and the family and your business  I am   for your time in the future       is the only one  mommy has a good day at home with her and her husband is going ",
        "This is why I consider GUCCI MANE as my fav. Rapper...\nThis letter made me cry \n\nREST IN POWER TAKEOFF ️",
        "R.i.p rocket shit is tragic,legendary",
        "So much Respect Cucci\" ur a Real Rapper not fake one May God Continue blessing u ",
        "Why this kinda sound like quavo",
        "Rest in Paradise Takeoff  big ups to Gucci for this heartfelt song... But not one time did he mention Offset. Did yall peep that? Dang man smh Take was so solid..",
        "I have a lot of respect for Gucci. He really grew up in front of us all.he has become really mature",
        "Wiser with age & time. We all calm down, we all fall down. Long live the Righteous ....footprints in the sand, when times get hard,an Shit hits the fan,  God don't walk with me he Carry me Man.....",
        "This video hits hard hats off to Gucci for this... it's really a shame that rappers are getting shot over some dumb shit and it's sad the people that want to be rappers and have good talent are going to end up with targets on their backs",
        "Man I wish Gucci would make a song when I pass. I would love to be recognized by the legend himself",
        "Wow this is amazing! Rest In Peace Takeoff. You will forever be missed. We’ll never forget about you! ️",
        "Always listen to this jam ",
        "We gotta make some from the pain ️",
        "It's been some while, but still I can't stare any photo or video or even just words talking about Takeoff's passing for more than a second just wishing I didn't just read or see that. Damn I'm just a fan but this really feels like a major loss. Why did it have to be him man? I'm still in disbelief just hoping this is all a bad dream. I swear I don't think I'll ever live my life the same, I'll forever be hurt that such a soul could be taken away from the world so soon and most importantly, I'll forever live my life trying to live up to just how Takeoff had such a huge impact on the world. Even if I'll have an impact on an significantly little crowd compared to you Take, I'll make sure it's great and worthwhile, just to put some respect on your existence in all our lives. I pray to God to please rest your soul in eternal peace and in paradise cause I feel that's the least that you'd deserve for all the good memories and smiles you gave all of us. As much as these words hurt,  Rest In Pease Takeoff. Truly the most talented rapper I've ever listened to in my life ",
        "And this is why we love you Gucci #Guwap you Glo",
        "This shit brought tears to my eyes fr because you know Gucci don't normally make songs like this and he said what he needed to say R.I.P takeoff ️️ never forgotten",
        "This is hard ! Rip !!!",
        "Eres chingón Gucci Mane",
        "Blade vampire",
        "this song is wild! the beats dope, the flow is nice, the message is strong, and he's spitting straight facts! rip takeoff and to those who are no longer with us ",
        "RIP! GUWOP out with another banger as always GUCCI 4eva! He aint like all them artists out here these days who just be blowin up on the GRAM by usin dat IGROCKET dawwwt cawwwm jawwwn to get dey followerz up... SMH",
        "Сильный тип",
        "🇮🇮🇮",
        "Much respect to you Gucci. This was beautiful and sad at the same time. From my family to the Takeoff family we are praying for you. Rip to all of the young men we lost.",
        "Gucci always has songs that hit deep when a loved one dies",
        "That's some real ish  Gucci always keeps it . Facts",
        "beautiful and from the heart, thank you for speaking whats been on everyone's minds Mr. Davis. You and Zay created an amazing tribute and I'm definitely going to keep coming back to this.  Extra sad that all this is going down right around the 1 yr anniversary of Dolph, too.",
        "Pretty much ",
        "I really can’t believe this is reality ….. Shout out to Gucci for being a stand up person outside of all of his other attributes ",
        "Still brings tears to my eyes knowing even the humblest of rappers/people can be gone today or tomorrow  … R.I.P Take ",
        "This song grabs me by the heart <3 Seriously, RIP to all of those we lost far too soon.. I lost my closest friend in my entire life in 2017.. It still lives with me every single day, and he will always be on my mind. I will continue to tell our stories and treasure the memories we shared until the day I take my own last breath <3  Love to all of those who have felt this pain",
        "WE ALL SHOULD JUST CALL HIM NEWS MANE",
        "It’s crazy how the loss of his life is taking a major effect on everyone. It somehow feels like you’ve lost a family member. Since his death I think about him daily. He was so quiet, and out the way. This is a cold, cold world. Rest easy Takeoff",
        "(Letter to Take')\n(Yeah, go)\n\nJust left another funeral, I shed a tear (Damn)",
        "Real ones check out too soon . This shit gives me chills. Legendary young ones gone way to soon. We will hear yall raps in the speaker forever. ",
        "I feel like every sense he did that verses with Jeezy it changed him mentally. In a good way of course because his mindset before the verses and after are different. What a outstanding man you’ve became to be Gucci.",
        "Much love bro",
        "Rest in peace TakeoffThank you Guwop.",
        " 🇨🇨",
        "Legends never die bro ",
        "I'm so tired of funeral's man.",
        "Mano do céu...",
        "My God! Right on time brother     I literally crying  through the entire song    Gucci came first class with the song we (FANS) NEEDED THIS! STAY SAFE OUT THERE GUCCI! LOVE FROM CHICAGO ️",
        "I dont listen to gucci, but nothing wrong with this song right here, gucci went in",
        "Mad respect for Gucci and RIP to all the rappers who had their life taken and it's sad as a hip hop fan to see our musician loose their lives",
        "Gucci gets all the respect for this act of kindness ️️️",
        "⚘",
        "Made me sad.  Dam. Migos. Trap out da bando. Handsome and wealthy was the first song I ever heard by them. Ah man",
        "Respect ",
        "Rather I sign to Gucci . I'll be safe",
        "“They killed my nigga bout some candy now they blaming me” - RIP Slim Dunkin",
        "RIP Takeoff, Salute Gucci Mane",
        "Location",
        "Hip Hop Most Dope 2022 . riptake",
        "I use to hate this dudes music when I I was in high school but I have no hate at all for him since Ive been an adult . His growth and maturity is speaking volumes. Nothing but respect for Gucci",
        "shit too fucking fire",
        "️️",
        "Well put together!!!! As a community we must find better ways to end arguments peacefully instead of violence. Rest in Peace Takeoff!!!!!!!!!",
        "Damn Guwop this brought back all the pain man! I know he played a big role in the Migos getting seen. \nLong Live the Rocket Man his was a massive loss!",
        "Hi",
        "RIP to the Rappers we lost,we miss y'all,RIP pnb",
        "I hate that he has to do these but dam both of em ",
        "Beautiful tribute ",
        "Thank you Gucci, You spoke on some real shit. I'm a day one fan of Gucci... He's a REAL ONE!! RIP TAKE",
        " REST IN PARADISE TAKEOFF ",
        "Take",
        "This is amazing and super emotional. Rest easy takeoff",
        "Shit gave me chills ",
        "R.I.P TO ALL THE LEGENDS",
        "MUCH RESPECT GUCCI GOT ME IN TEARS ALL OVER AGAIN ",
        " essa foi de arrepiar  Gucci vc é fodaa   passou a visão é representou os que não está mais aqui  que todos eles descansem em paz  R.i.P Takeoff",
        "We Have to Give Gucci his flowers \nHis Consistency and Realness is unparallel",
        "This track gave me chills incredible rip take off and rip to everybody that lost there life",
        "U Gucci giving condolences ...now dats mane.. much love in ..Pa.. Remember Braddock where we smoked..and stay smoked out.....$$$$$ u remember dim dollars $ all over ur ride when came threw...I miss it..but uttermost I miss  all my lost niggs....... mckeesport hold it down now......",
        "This man really never lose the flow, even on the hardest times he shines :(... RIP Takeoff a great inspiration for me",
        "Real lyrics ",
        "🇳🇳🇮",
        "He wrote that song with heart. He cried writing the whole song..Gucci is a legend...we all gotta find our way home ..rappers needs to get into the movie Bussiness...the music business is not fun no more...you never heard Curtis Blow and other rappers doing this...we never know what's at the end of the day...but if we all can just make it home safe...we live...",
        "Never listened to your music much man. But losing any artist with a beautiful talent like yours always hits hard man. You had talent man and I seen that just like we all did. Rest up take off.",
        "That was beautiful, thanks gucci.",
        "life wont be the same after Take off funeral Pass away i think about this song alot RIP cucci did good song rest in peace take off God bless Gucci man",
        "Anyone know what Prada glasses those are",
        "Seems like Gucci finally got what Jeezy was tryna tell him…I say Jeezy won hands down ",
        "Beautiful Respect",
        "Every one tryna benefit of take off",
        "Never know when it’s gonna be our time. Cherish the ones that are in your life. R.i.p. to a legend ",
        "Gucci we love you too bro ",
        "#EasyTakeoff",
        "Live by the sword die by the sword!!!",
        "Gucci really vented on this one. Heartfelt tribute to Takeoff  and spoke on much more. You can feel the pain and raw emotions through his lyrics. Long live Takeoff, Dolph, Slim Dunkin ️",
        "So much respect to Gucci for this. I wasn’t expecting him to name drop everybody else we lost. You can really see how sad Quavo looks when he goes to embrace Gucci. Long live every legend that we’ve lost. Wether they were mentioned in this song or not",
        "Hell of a Tribute Salute 🫡 Gucci.",
        "That's really nice of your part gucci and rip all these young  rappers who lost their lives",
        "Respect to all fallen angels  ️",
        "What a King this man is!!",
        "RIP Takeoff  much respect Gucci",
        "It's all love",
        "Damn Guwop  rest easy take off. This joint ",
        "King",
        "Dolph and takeoff…their passing still today hitting me like a Mike’s  punch",
        "Gucci! ",
        "Gucci straight facts with the barz ",
        "It looks like Gucci made this video the same day as the funeral. Or he's atleast wearing the same jacket/gloves etc. Respect for the genuine message and my condolences to anyone who's lost a loved one to gun violence.",
        "Gucci is definitely a real one, to put out a song and video to pay respect to one of the coolest ATL Legendary artists  of a group such as the Amigos who changed the direction of rap. Big Guwap you sent the brother Takeoff to his final resting place in style.",
        "This song gave me chills and tears to my eyes. God Bless you Gucci and I'm Praying for Take Off's family and everyone. This is so sad ",
        "No one will ever see this thanks to you tuube algorithm but I hope to make it big one day ",
        "Rip to the real ones ...and thank you shaft for this new song it's appreciated",
        "Thanks Gucc! Made me emotional hearin this! Man this hit hard! I'll never get over the fact hes gone an his life was taken selfishly! Makes me so mad! I may have never met him but I felt like I knew him through his music! He spoke on so many different levels through his lyrics for anybody goin through it! I'm one of them! Sometimes I felt like he was speakin facts on my life! I related to some of his lyrics in so many ways! The way he made it his own style an the way he performed it! Just was legend! He was walkin proof that you can do anything u put your mind to! He made it happen! I was in the process of getting a VIP Ticket to come to a show an hopefully had the chance to meet him! makes me sad I didn't get the oppurtunity to! I miss my boy TAKE!! Jus ain't the same! Man you a legend an this song right here proves it! Love you Gucc ya did ya thing for TAKE!! It still feels like a dream! ",
        "Good look on this one Raddrick!",
        "Legends Never Die but Live forever in your heart ️",
        "Love this song Gucci. This was powerful and what the culture needed. I thank you for this. So touching",
        "All I Can Day Is That This Summed Up How Everyone In The ATL Feels.THANK YOU GUCCI,WELL DONE YOUNG MAN",
        "Death is real we should always thank God when you wake up still alive",
        "Takeoff descansa em paz ",
        "Legends never Die, they live in us forever...LLTakeOff",
        "Crazy man this shit was fire",
        "RIP LEGEND TAKEOFF",
        "This Shit give me chills ️",
        "Just a legend paying his respects to another. This one's gonna be on repeat!",
        "Protect Wop At All Cost ",
        "Love This",
        " ",
        "   Fire Just like his tribute to Young Dolph now his Letter Take Off ...️‍️‍️‍",
        "May Takeoff rest in peace .  I can't believe that he is gone  but never forgotten",
        "Gucci , one of those rappers who still got value in society",
        "A letter from Goat to Goat RIP Take you will be missed Legend",
        "Black on black crime let's forget about the money and the rhymes",
        "I know you're going through a lot and you're sad, if you want to cry more, I suggest listening to this song too:\n\nhttps:https://youtu.be/-p6jmhbrLE4",
        "THANK YOU GUCCI! This has got to be one of the REALEST SONGS I've ever heard in MY LIFE!!!  \n#RIPTAKEOFF ",
        "Great!",
        " gucci",
        "Amen   It’s Time To Love Each Other ",
        " RIP takeoff and all the others lost  ",
        "thats love",
        "Don’t let this die ️️",
        "Much respect  amen fly high takeoff",
        "That's solid G",
        "Straight from the heart this! We miss Takeoff already  Thoughts with the world right now ",
        "I really felt that...much respect Gucci",
        "8 days holding that #2 spot on trending!! Mad respect to everyone grieving TAKEOFF!!! Thanks Gucci.",
        "Gucci, you a real one for this!",
        "BIG UPS GUCCI️️ this is some real genuine music so very thoughtful to recognize takeoff! I still can’t believe just like all the other rappers that have been killed so sad man human decency has went down the drain  R.I.P. Takeoff",
        "this is a masterpiece ....thank you Gucci Mane ....Rest In Peace Takeoff",
        "This was truly real fam rip",
        "I literally crieddd",
        "Man Gucci has came a long way & his maturity level is beautiful to see. Rest In Peace to everyone we have lost,   to their families & parents. Y’all be safe, love yourself & others!!",
        "So deep!! ",
        "A nossa vida realmente  um sopro! Voc sempre ser lembrado Takeoff. Suas musicas  referencia e ecoaram para sempre.  Eu te admirava pela sua personalidade, discreto e brilhante! Descanse em paz Take. #BR",
        "Ight Gucci naw make a somg about how great yo mama and grandma is or something about some babies das gone or sumn bhlood. R. I. P take-off but in all reality he just another dead rapper naw days. Shit sad bro. Take-off the best migo seemed like",
        "Low key dissed Hershel walker lol",
        "This isn’t a rapper.. this is a King",
        "Too many young men gone this shit got to stop RIP TAKE OFF RIP Dolph ",
        "“I don’t hold the right to vote, I don’t play politics” - shit goes hard",
        "It's nice to see a rapper always take time to pay tribute to  his fallen comrades  when other rappers don't '. Bless up Gucci  Rip Young blood.",
        "This is probably one of the best songs ever! Like how many rappers speak on these topics?! It’s usually just hoes, money, opps etc. Thank you for this Gucci R.I.P Takeoff ",
        "Bankroll fresh beat x who can I trust . Rip takeoff Gucci killed it ",
        "I love Takeoff your still and will always be in my heart and music. 3",
        "RIP Takeoff. Song is trash af though.",
        "RIP Takeoff Will forever love you ️️",
        "️️️️️️",
        "This song is about to blow up️‍",
        "1:19 poor Quavo man you can see his sad face. We been losing rappers over the dumbest reason bruh and nun of us can take it nomo.",
        "Thanks for your love Gucci ,we love you too ️ RIP takeoff\n\"let's start giving love ones their flowers when they're here\"",
        "Damn having a hard time holding back tears man I’ll miss em and regret taking a break from the migos, been listening since 8th grade and this shit broke my heart, thank you for the song Gucci you’re a beast",
        "We love u take ",
        "Don’t get realer than that. Rest In Peace  king ",
        "Can’t believe Gucci dropped this track. Much respect to him, thank you for letting us fans get a tribute song dedicated to the great Takeoff",
        "This was an amazing tribute to his family and him. Rest Easy Takeoff",
        "I love this for real!!! Even though I don't think this is the real Gucci",
        "I think about the memories it give me chills. I’m wondering why they left the fake and took the real",
        "I truly understand the words that you throw out there!! Unfortunately I do not have anything positive to say except I will Always and Forever pray for you and our World!! I lost 2 brothers with in 3 months of each other!! I pray and try very hard every day!!",
        "I love you gucci. My heart is broken and goes out to his family his friends and all his fans ",
        "Gucci is a living legend.",
        "This is why Gucci respected in the streets",
        "Been a gucci fan since day 1 and been a migos/takeoff fan for 10yrs. I'm glad I got to know takeoff thru his music. It's hard to listen to his music lately without a smile on my face that turns into tears. Imma really miss his place on this earth.",
        "RESPECT",
        "Great thanks to Gucci fo this track, trust me i shaded tears when this song was dropped........RIP TAKE",
        "That hit different ",
        "Gucci’s evolution as not only an artist but person has really been an incredible thing to witness. RIP Takeoff",
        "Its sad rip takeoff",
        "Flight ️  ",
        "This is perfect",
        "Damn ",
        "Joder se me pone la piel de gallina al ver que además pone a los rapperos que tambien fueron asesinados Gracias Gucci por hacer esta canción esperemos que la violencia armada pare de una vez por todas no podemos seguir perdiendo leyendas",
        "Rest in peace Takeoff :(",
        "🇰🇰 ",
        "My favorite artist ",
        "Rip  takeoff",
        "\"I go from sad to mad, I'vе been through every stage of griеf\nWe need some time to heal, but my job got no work relief.\"\nI'm sure so many ppl can relate.",
        "Much Respect to Gucci for making a song and paying Tribute to Take Off. Rest In Peace to all of the other Artists that we loss throughout the years. Keeping their families in ",
        "HUGO ARMANDO building VASQUEZ",
        " 🇪",
        "this made me cry so much ",
        "Hats off",
        "This the second week am still listening to this song. It still gives me  chills, Long live Take",
        "When he said x I almost stared crying X was my biggest inspiration and keeps me motivated just like when Kobe Bryant and Chadwick Boseman died same with Pnb Rock it's so sad and heartbreaking. This world is coming for everyone so keep your head for people that feel down and want to give up ️️",
        "  🇪🇪🇪",
        "Gucci always coming with them bars even in hardship or loss he still lay it down  R.I.P. to all the young Greats that we have lost",
        "Rip ️",
        " 🇷🇷",
        "i can’t believe this the way the world is today it’s insane it makes me so sad gone but never forgotten",
        "Gucci is a selfless rapper I know from rapper to future star rapper your song is lit rest in power takeoff my condolences to takeoff family",
        "️️️️️️️️🫶🫶🫶",
        "Gucci Forever A Legend For This One!!!!!!",
        "Gg",
        "Don't nobody give Gucci his flowers for this type of stuff. Shout-out to Wop for taking time to SALUTE the fallen. #ATown Legend #zone6shit",
        "beautiful",
        "That song come deep  rip takeoff",
        "Such a beautiful tribute, however I’m sick and tired of tributes due to senseless violence and death. R. I.P.",
        "Damn this broke my heart “I’m wondering why they left the fake and took the real”  it’s crazy how we’ve been watching them for years and him losing his life hurt like it happened to my own blood shit is crazy. \nRIP TAKE ",
        "Awww so sweet #tears ️",
        "Gucci did his thang...LOVE IT!R.I.H TAKEOFF  JUST A YR AGO I LOST MY BROTHER I UNDERSTAND THE PAIN AND HURT ",
        " love it tribute to my man take off rest in pace our angels love you love ️",
        "YOU ARE THE BEST GUCCI MANE",
        "Much love. ",
        "Legends never die",
        "It's crazy how we lost so many good rappers. This one hits deeper. We will miss you takeoff! You were the best out there",
        "still here for Take n DolPh",
        "Good rap until he dissed Herschel Walker. What a short bus shorty.",
        "I like this!",
        "Guwop went from straight hood to straight inspiration. Been a fan since 2002. Rip takeoff",
        "This beat is beautiful, these beats need to come back fully",
        "To see Gucci do two videos like this in damn near less then a year is heart breaking. The king of Trap losing his trappers "
    ],
    "comments_disabled": false
}