{"video_id": "C2YSX4sV_bA", "comments": ["You can tell Gucci going through it and he expressing himself the best way he knows how. This is real respect. LL TAKEOFF", "Guwop you the goat for this and for speaking on the other artists that we have lost I know it's too many for you to mention but it's definitely a blessing and a pleasure to hear you spit some real shit like this and I've been a fan of you for many many years and to see your character development is amazing keep Rising King  and rest in heaven Takeoff", "Honestly, this is why I I have lot of respect for Gucci; a rapper that respects life and death is one in a million.", " essa foi de arrepiar  Gucci vc é fodaa   passou a visão é representou os que não está mais aqui  que todos eles descansem em paz  R.i.P Takeoff", "A nossa vida realmente é um sopro! Você sempre será lembrado Takeoff. Suas musicas é referencia e ecoaram para sempre.  Eu te admirava pela sua personalidade, discreto e brilhante! Descanse em paz Take. #BR", "Deus te guarde, você vai fazer muita falta em todos nossos corações Take!!!!! O Brasil te ama, o mundo te ama. Sua música será eterna, você é, e sempre será uma lenda.", "Gucci is such a legend. This song is bittersweet to hear from all the losses of incredible musicians but as a fan, it means a lot to hear what he has to say.", "So much respect for Gucci mane. I grew up listening to Gucci to see him grow into this is amazing. He’s still that hittah but he’s learned and passing his knowledge. As a Tennessee native always rocked with dolph and he got me through some fucked times in my life too. So when Gucci sent love that means a lot to us. ", "Gucci expressed how we are feeling through music & that’s what we need. Not another ig caption but a space to fill when fans & other musicians can’t put together our words. Love Gucci for this. ", "Joder se me pone la piel de gallina al ver que además pone a los rapperos que tambien fueron asesinados Gracias Gucci por hacer esta canción esperemos que la violencia armada pare de una vez por todas no podemos seguir perdiendo leyendas", "Grande homenagem \nRIP TAKEOFF", "Thank you, Gucci. This is so dope, so thoughtful, so heartfelt. Rest in peace, Takeoff.", "RIP Takeoff. I paid close attention to the careers of the Migos and I have never seen a single person say a negative thing about him while he was alive or now after his passing. That says it all.", "Respect to Gucci for this!️ Love him anyway, but this was really putting his heart out there to recognise those precious artists/people lost. This is a beautiful, I would say “memorial” but its better than that, its a flying flag in the sky to show everyone what Takeoff meant to the world. I say “in the sky” because hopefully Takeoff sees it, from where he has parked his Rocket in Paradise️ and I’m sure he would join me in the Salute to Guwop for this!! This is GOAT material", "Legends don't die, they live forever! RIP Takeoff.", "Well put together!!!! As a community we must find better ways to end arguments peacefully instead of violence. Rest in Peace Takeoff!!!!!!!!!", "This song gave me chills and tears to my eyes. God Bless you Gucci and I'm Praying for Take Off's family and everyone. This is so sad ", "Whether For clout or sincerity, for a man to go in the studio and record a song dedicated to takeoff and the other rappers being killed speaks much regard for the music and artistry.", "O Brasil te ama Take!!!!! Sentimos sua falta irmão. Nós te ama muito cara. Tô arrepiado só de escrever esse comentário. Muito triste cara. Saudades eternas. Minhas condolências pra todo mundo da família. Jesus Cristo tenha misericórdia e conforte seus corações. ", "Caramba que música foda descanse em paz takeoff  nunca será esquecido jamais ️️️", "Gucci sempre foi muito referência pros migos, geral sabe, muito merecido essa homenagem 🇧🇷", "It’s nice to see Gucci Mane evolve , seems like his gotten way better than he was before ", "This really gave me goosebumps. Very Heartfelt ", "Bela homenagem  vai fazer falta pro trap takeoff  🇧🇷", "Gracias Gucci Mane...\nUna muy buena manera de rendir homenaje a nuestra gran estrella Takeoff  una gran forma para decir cuanto se extrañará y dolió su adelanto, El Uno de los mejores nos dejó muy buena música y quedará para siempre, así como cada una de las estrellas del hip hop que ya no están con nosotros, Los tenemos en el corazón mi pésame para todos sus seres queridos que sufren esta gran pérdida, Descansa en paz takeoff ", "Música muito boa 🇲🇿", "This was an amazing tribute to his family and him. Rest Easy Takeoff", "Takeoff estará vivo en nuestros corazones y su música vivirá para siempre", "Gucci sempre consistente passa o tempo que for ", "Gucci’s evolution as not only an artist but person has really been an incredible thing to witness. RIP Takeoff", "That was absolutely beautiful Gucci!  Loved the song and video and how you told Quavo here is your solder if you need to lean and your testimony right after. Thoughtful and encouraging.  I have always liked Gucci!  Always like the Migos as well. I usually prefer conscious rap but it was something about them where I said okay I like them, they grew on me quick.  ", "Wow this is amazing! Rest In Peace Takeoff. You will forever be missed. We’ll never forget about you! ️", "Gucci never disappoint us with these songs. Love how he showed love and respect to all those we lost. Takeoff death hit so many people hard. He was loved by so many. I loved this. True respect. Rest in heaven Takeoff ", "Been in love with hip hop ever since 1992...that's all I'm going to say.", "This song grabs me by the heart <3 Seriously, RIP to all of those we lost far too soon.. I lost my closest friend in my entire life in 2017.. It still lives with me every single day, and he will always be on my mind. I will continue to tell our stories and treasure the memories we shared until the day I take my own last breath <3  Love to all of those who have felt this pain", "MUCH RESPECT GUCCI GOT ME IN TEARS ALL OVER AGAIN ", "I have a lot of respect for Gucci. He really grew up in front of us all.he has become really mature", "R.I.P takeoff obrigado por tudo mano jamais será esquecido foguete ️", "How crazy is it that one young man’s life can affect so many.  Bless his soul and those grieving Takeoff’s passing, hopefully we’ll truly learn to spread love first.️", "This hit sooo hard! Thanks for blessing us with these lyrics Mane! Love ️ #riptakoff #rip2myson", "Crazy how we don’t see more things like this in the industry. He paid tribute to the most innocent person he knew in the game and did it on a beat that Takeoff probably would’ve slid on himself… RIP Take. Everybody got you bro. People always say to take the high road but Atlanta gone get justice for this one no matter what…", "This man has come a long way in life. I find it amazing how he has changed from a rugged street side guy to a refined smart looking man!\nVery good role model and it's nice to see!", "Legends never die. He is with each of us and will always live as long as his music and our memory of him are alive. RIP Take", "Man I've been a fan of Gucci since you first dropped a radio hit icy over the summer he is very smart and well-respected for him to make a song like this is unbelievable major props we all hurting due to all these rappers dying Keep Your Head on a swivel and keep 10 toes down", "This bought tears to my eyes, heartfelt thank you Gucci and yes this has hit hard for a lot of us, Takeoff is truly truly missed. His parents truly raised a remarkable young man. To reach the world as he did you have to have been raised by a very strong village.  Continue to rest easy Superstar, we love and miss you Takeoff ", "It’s crazy how the loss of his life is taking a major effect on everyone. It somehow feels like you’ve lost a family member. Since his death I think about him daily. He was so quiet, and out the way. This is a cold, cold world. Rest easy Takeoff", "Man Gucci has came a long way & his maturity level is beautiful to see. Rest In Peace to everyone we have lost,   to their families & parents. Y’all be safe, love yourself & others!!", "Such a beautiful tribute for this young man Gucci! Prayers lifted to Takeoff’s family and friends. Unbelievable...", "Gucci be dropping quick and it always hit home with the lyrics ", "Another tribute well put together  SALUTE THIS MAN", "BEAUTIFUL!!! THANK YOU GUCCI MANE WE LOVE YOU TAKEOFF STILL TRYING TO GET THROUGH THIS LOSS BUT THAT MADE IT A LIL BETTER ", "Damn, he came through quick with the track ", "I've always been a Gucci fan I remember how his music back in the day would be about drugs & violence. Gucci mane is actually taking the time out to talk about the losses in the rap game due to senseless gun violence while grieving. He shows so much maturity & growth meanwhile promoting positivity on this song after him facing incarceration that's inspirational. Gucci man is a diverse individual Gucci will forever be a legend in HipHop... We lost Takeoff & are still not over death of Young Dolph I'm glad he expressed this !!!", "Buenas letras para takeoff.. seguro las mejores dedicaciones para este gran artista.", "obrigado Gucci homenagem linda Angola esta com toda familia Migos especialmente a mãe do Takeoff", "Thank God Gucci lived to see himself become a voice for the masses to be an example of how a man can change for the better. It's unfortunate, but I think this was almost this era's 'I'll be missing you' and it was done so tastefully while also paying tribute to the other artists who have passed. This was the way to go. Good work Gucci.", "Un hommages vraiment touchant \nBig respect a Gucci \nRepose en paix TAKEOFF", "Words can’t describe how good this song is… \n\nLong live Take & Dolph ", "Gucci was right on point on everything in this track... Plus the beat going in too!", "The last line of the song is really touching about how he talks about the personality of Takeoff and also gives his condolences with hiw he have known him for 10yrs and knew he was going to be a star. Ur legacy will never be forgotten Takeoff and may ur soul RIP", "I use to hate this dudes music when I I was in high school but I have no hate at all for him since I’ve been an adult . His growth and maturity is speaking volumes. Nothing but respect for Gucci", "This song will always be remembered  rip Takeoff ", "Wow..this is left me speechless.  There aren't words to describe how I feel about Takeoffs passing...Gucci said it all....RIP Takeoff ....kudos to Gucci Mane.", "Gucci has really grew beyond rap. He’s on some wise mature adult s**t now. I’m proud of him not only as an artist but also as an individual. RIP TAKEOFF!!! ", "Heartfelt, ️To everyone that ever lost a loved one.", "Respect Gucci 🇮🇳\nTrue legend ️\nLove from India 🇮🇳", "Linda homenagem!", "One bad thing about this song is it ends ", "This was really an amazing tribute Gucci ️   # RIP TakeOff", "Muito foda essa homenagem ter vindo por parte de uma das maiores lendas do rap, de uma lenda pra outra, descanse em paz take seu legado e sua voz nunca morreram... Rip Take", "This was so good on so many levels...much respect   gucci", "The growth of Guwop is jus soo damn amazing. Gucci is a GOAT & ain't no stoppin that! I respect dude to the fullest! ", "This video hits hard hats off to Gucci for this... it's really a shame that rappers are getting shot over some dumb shit and it's sad the people that want to be rappers and have good talent are going to end up with targets on their backs", "Rest In Peace all legends. Thank’s for this Gucci ", "So many heartfelt words  I felt every word. Gucci hats off to ya. Rest in peace ️ takeoff praying for your family and friends", "Didn’t even listen yet but I really appreciate this initiative from Gucci he has all my respect RIP Takeoff ", "You’ll never be forgotten Takeoff. We miss you Legend . Rest in power", "I cant be the only person to start balling my eyes out on this video.... Mad respect guwop . RIP TAKEOFF MAN honestly this is the saddest shit ever. ='(", "That was so from the heart. His delivery was on point and I really loved his outfit with those shoes.", "My heart the chills everything I'm feeling right now man so much respect to Gucci . #LONGLIVETAKEOFF ️", "Gave me chills his voice is so calming to me. RIP Takeoff ", "Much Respect to Gucci for making a song and paying Tribute to Take Off. Rest In Peace to all of the other Artists that we loss throughout the years. Keeping their families in ", "Rest in peace all legends THEY LEFT THE FAKE AND TOOK THE REAL", "More of this and of artists honoring human life please ️", "When love reigns in our midst ,the world will know peace️LL Takeoff ", "RIP Takeoff. This is the best song about all the legends we lost way too soon. Love the diss on Walker, keep it up! #riptakeoff", "This is why I love Gucci mane,he's always the first rapper to pay tribute to dead rappers.  Rip Takeoff you'll never be forgotten ", "One GOAT to another REST EASY TAKE ️", "my first time listening to Gucci and all I can say is man is talented...\n\nRest easy TAKE", "This is real hip-hop not the same money hoes cars and clothes Poppin pills on repeat. This is real hip-hop from the hard stuff that’s actually happening deep down.", "This rap is a written poem!\nGucci always ", "Gucci always gonna be one of the legends \nR.I.P. TAKE ", "So much respect for Gucci not scared to express himself talking about real shit rip to everybody we lost this year even the ppl who aren't famous", "Beautiful Tribute to a Legend...Takeoff...Rest In Peace", "Rest Well TAKEOFF. Hope Everyone who’s heart he has touch will be blessed.", "Damn!! I truly did feel this shit. I felt it even before this but I’m REALLY feeling it now. What a beautiful tribute Gucci…first class just like TakeOff️. And let me just say how suave Mr Guwop looks in this video. Your stylist (probably wifey lol) did that!! Come through Davis’s.", "Much respect to Gucci for this one  RIP Takeoff", "The fact that he credit to other rappers that died recently just proves how much the Rap game is a family sometimes.", "All I Can Day Is That This Summed Up How Everyone In The ATL Feels.THANK YOU GUCCI,WELL DONE YOUNG MAN", " rest in peace ️️️️ my favorite artist!!!! Thanks Gucci mane for paying tribute!!!"]}