{
    "video_id": "C342dfNPCyg",
    "comments": [
        "Very tragic",
        "Thank you for explaining this air incident in such a professional and respectful manner. Your comprehensive review is the best I’ve seen. I love airshows and know it’s not an easy task to maintain",
        "It’s weird that we wake up never knowing which day is our last",
        "I was there and I want to bring this up , from the angle we watched the show on the airport grounds at the north side of the airport with the planes flying towards us , they were flying two lanes so to speak with a horizontal separation between the bombers and fighters , also the planes were not flying a dog bone configuration but more of a cloverleaf, see other videos online of Flightradar24. ",
        "Juan,  this was a very poignant and respectable review of this tragedy… Such tremendous loss of 6 very talented airmen. Thank you!",
        "Guys I think we know what happened…. Unless someone has clout to find an illegitimate reason and make it legitimate",
        "P-63 caused the accident. I do not know why. The B-17 bomber is unable to avoid the collision and both crews are killed in the crash. The things that caused the accident happened in a P-63 fighter.",
        "Condolences to the families if the men that passed. I knew you would cover this better than anyone else.",
        "So sad that these men lost their lives.",
        "There is absolutely  no reason why modeling should NOT have been able to model the visibility for the analysis and possibly planning this airshow maneuver. I agree with maintaining SA but modeling could have solidified procedure planning,",
        "No lateral separation, no altitude separation...\nOne more hole in that Swizz cheese and we have a mishap and people lose their lives.\nI hope someone comes down with a hammer on this. Not only did we lose great people and traumatized thousands, we also lost basically priceless historical artifacts.",
        "I agree with everything you stated and concluded, and offer my most sincere condolences to all families, loved ones, friends, and colleagues of the deceased; and I sincerely include yourself. While it may seem callous to say at this early stage, I KNOW that painful lessons will be learned from which everyone who flies (pilots, co-pilots, flight engineers, WSOs), and ground controllers, will benefit IMMEASURABLY. ",
        "Having flown in formation during airshows with multiple different type aircraft together it's definitely a challenge, the group preflight brief is normally very long, you point out a very critical aspect of joining the formation, never join while turning. This reminded me when I was flying a C-47 in formation with a super DC-3 and 3 YAKs , 5 aircraft together and me in the #2 position my escape route was only up or down, in the C-47. My heart goes out to these guys.",
        "Blancolirio on another Youtuber  ( Probable cause) apparently  he got some info  that the air boss told the P63 To over take the B17 on  for that fly bye but what's  not mention is when was the pilot suppose to execute the maneuver.",
        "Tragic and sad.  They did die doing what they loved.  Thanks for the breakdown it was very educational.",
        "Major Fubar on the P63 pilot and the Air Boss for flying the planes at same altitude if that's what happened? Situational awareness is so critical.",
        "Your breakdowns are so very good. But they are also sad. I'm sorry for your loss of a friend. Take care and keep upp the good work.",
        "So sad and so traumatic for the friends family and witnesses. But your demonstrations were surprisingly effective in explaining what likely happened here.",
        "Thanks, Juan…\nWhat a tragedy. Let’s learn from it e move on!",
        "Thank You.",
        "I agree, no altitude separation…. A pilot would only be said to be experienced in his aircraft knowing this, a romp in the pilot seat should never have been dangerous in any kind of way, shape or form, and it seemed to know that the pilot was over his head way over his head, and a maneuver, he was trying to create…",
        "This accident broke my heart.  Rest in peace aviators.",
        "thank you for explaining and describing in such a professional manor sir, this horrible event. i would just like to take this time to give the families of these great men my most sincere condolences. there is no greater loss than that of a loved one. i am also saddened by the loss of these great aircraft that made it through a world war.",
        "So, finding some scapegoat reason, should be out of the question.",
        "Thank you for this.  I know it was difficult but it was very informative.",
        "Juan, you explained this tragedy better than the NTSB ever could.",
        "This grandstanding must stop!  Is the loss of 6 lives even remotely worth it?",
        "It is very interesting what you said about the deadline and the penalty for a pilot to cross it. It is possible the P-63 found himself wide and fast in the turn and banked hard to avoid this penalty, just unfortunate to be at the same altitude as the B-17. You explain it so well Juan. Terrible loss of life ",
        "Criminal incompetence of that driver of that P-63 single plane...I flown 23,000 hours in 50 years and never lost sight of any other flying airplanes...I flown in zero-zero conditions but always knew exactly where I was...but this guy had no idea what he was doing!",
        "12:36  One thing I notice here is that the fighter was pretty consistently flying at 1400-1600 feet during the previous pass, until he came out the turn on the SE end when he continued dropping until 600 feet around the moment of impact.  I'm unsure whether this might be planned and intentional, but it would appear that this is the first moment he has dropped down to the same altitude the bombers were - around 500', I believe you mentioned.",
        "your pain and Frustration comes thru loud and clear..sorry for your loss",
        "Such a sad moment... Sincerely asking here.  Could the design of the P-63 (specifically engine placement to the CG) plus the P-factor along with the inertial velocity contribute to the (forgive the lack of accurate phrasing) drift wide right?  My initial thoughts on each of your topics you presented were spot on similar.  That was a very busy pattern.  Saddening for that to have happen.  Keep up the great work with your channel.  Always a fan!",
        "Very informative. Thank you.",
        "Prayers for all those lost, their families and friends.",
        "Thank You Jaun for a very good technical description of the parade. I have flown high and low wing aircraft and each has its unique blind spots.\nNon aviators need to understand this is a three dimensional environment. You explained this very well.",
        "Great analysis and vivid explanation.",
        "I'm sorry that you lost your friend. Aviation is a serious and dangerous endeavor.",
        "Always horrific of-course, I don’t understand why todays electronics are not used !?; knowing the obstacles already known ( sight awareness) beyond pilots control with such tight regrouping & NO CONSTANT GROUPING !?…🇺🇸️",
        "So very sad to hear this. Condolences to family and friends.",
        "What a terrible accident. Lessons will be learned, and I hope future measures will prevent this from happening again. Thank you, Juan for your contribution. I always learn something new from your videos.",
        "Very good analysis of a rough situation. Thank You",
        "Thank you, Sir, for the analysis. Especially due to the personal connection you have with those lost. Terrible tragedy for the community. This event, though terrible, illustrates the risks faced by the B 17 crews and their escorts in WW 2.  Thank you for the professional forensic report. Please accept my condolences on the loss of your colleagues.",
        "R I P",
        "Sorry for the loss of your colleagues.  Thank you for presenting this even though it was painful for you.",
        "During the war my mother taught school mornings and worked swing shift at Wrights building aero engines. We might have lost some of hers. Condolences to all affected by this tragedy.",
        "Looks like that King Cobra pilot was flying for the Luftwaffe.",
        "At least they died doing what they loved and not killed by a heart attack or some freaky sickness",
        "Juan your review  is as professional  as ever. Sorry for the loss of your friend. In my life time in aviation there is usually  a reason for these tragic accidents and from them one learns a better way of doing things. Condolences  to all those airmen who died in this tragedy.",
        "Why would you not have someone in the pilot's headsets telling them constantly their proximity to the other aircraft? And if not that why not software in front of the pilots to show the proximity of the other aircraft.  After all, this is 2022, not 1943.",
        "Terrible tragedy- the only point of relief is that neither aircraft impacted spectators. Two thoughts- perhaps there should be a designated \"escape manuever\", like they do in air racing. If you cannot stay on course or have dangerous separation issues, the pilot could climb AND head away from the circuit (and of course avoid the crowd). Then he could either plan and negotiate via radio  re-entry into the \"parade\" or loiter in a designated area until until it was safe to rejoin and/or land. Second thought- 2 traffic lanes plus not crossing the crowd line seems tricky, especially with large speed differentials. Perhaps the 2 lanes could be separated with a line of several inflatable pylons, like those used in the Red Bull racing series. These would be easier to spot from a distance vs the typical ground references available. (I do NOT mean planes should fly low and between them, but at 80 feet high and colorful, they would sure establish a line marker!) It seems clear that more rules are needed and the whole airshow community should work on them quickly, before something is imposed on them which may not be optimal for safety or practicality. As always, thank you for your great aviation coverage and insight!  (BTW Red Bull has a short youtube video on how they work)",
        "This has got me to thinking…just imagine being a fighter escort in a 200, 500, or 1000 bomber raid in combat in WWII…There must’ve been some collisions in those days with all the flak, enemy aircraft, and the nervous anxiety of those situations.",
        "Here's an angle I don't think much people have seen\n\nhttps://youtube.com/shorts/PyOEb-halm8?feature=share",
        "Thanks Juan. Horrible loss of life and history. Fly safe out there.",
        "I get it, in the last few \"Seconds\" there was a blind spot...but what id like to know is how many seconds before he \"Lost\" sight of it did he see the B-17",
        "As always, a clear, concise and informative Blancolirio video.  Just one small correction: \nthe P 63 had an M4 37 mm not 70 mm cannon.",
        "Thank you for the respectful treatment of this terrible incident.  Rest in peace to the men who brought us history and shared their love of aviation.",
        "With the greatest of respect, is age not relevant here ? these pilots might have a huge wealth of experience but reaction times & spacial awareness declines with age. \n\nAlthough the patterns flown & altitudes with no height separation between the bomber and fighters seem to be the initial reason for this tragic incident.",
        "Craig lost his orientation for a moment with deadly consequences. RIP",
        "I have flown many airshows like this one from Oshkosh to local small airshows.The bombers are at one altitude and the fighters should fly at a higher altitude.A lot of times they also fly different patterns for aircraft separation.The P-63 should have been at a different altitude or pattern and was responsible for separation from all aircraft.The P-63 was never in any formation with anyone it was following a P-51 that was way in front of ",
        "Great analysis with excellent info. Thank you for taking the time to offer your expertise in this tragic accident. I would suggest, however, that the word \"report\" in your title is misleading. It implies that an investigation has released findings in the form of an accident report.",
        "That display setup with fighters and bombers flying with different speeds along the same lines and at the same altitudes was an accident waiting to happen.",
        "I'm not trying to be a jerk, but, I am trying to be 'straight up'. And, after watching a few of these videos, it sure seems to me like the FAA and NTSB are going to say this incident was: 'Pilot Error'(on the part of the P63 pilot). That is sad for all the families involved(P63 pilot and B17 pilot/crew). In all fairness, this incident could still come down to a mechanical issue with the P63, which could have resulted in the pilot drifting in to the flight pattern of the B-17. I guess we will just have to see what the report says...",
        "Thanks for providing the most cogent explanation  on the web of this tragedy.",
        "I know if I travel 2 the us I will not be going 2 any airshows.\nThere has been so many devastating accidents.\nYour safety can’t be guaranteed.",
        "Great Brief !!!!!!!!!",
        "@ 7:03 is like a Fauci \"trust the science\" moment.",
        "The three causes of aircraft collisions: situational awareness, situational awareness, and situational awareness. Add these three, and the forth is pilot error.",
        "RIP!!",
        "It seems to me in this day and age of advanced electronic-/computer technology, it should not be too dificult to build an advanced TCAS specifically for these types of situations. A network of transmtters/receivers in every airplane taking part that calculates the future possible position of each plane based on heading, speed, and maneuverability limits and transmits this info into the network. Evasive action could then be coordinated on the network, possibly even for multiple aircraft proactively (rather than simply after a collision is immenent). I don't understand why something like this has not long been implemented.",
        "Really well done, Juan. Super respectful towards the fallen airmen while giving us all a great run down of the facts so far ",
        "He was too focused on following the P 52. He stopped critically thinking when he became a follower in that situation. He just followed the plane in front of him and was focused on his speed and not his location. Also he couldn't see the bomber because of the large instrument panel and left bank.  The entire flight plan was a terrible idea and an accident waiting to happen. The fighters and bombers should NOT be at the same frigin' altitude! They should have been 400 feet apart vertically at a minimum. Terrible idea.",
        "Rest in peace guys...",
        "Bottom line..Why?? Why are smaller faster aircraft “chasing” the bombers. These planes are rare and should be flown respectfully not participating in some pretend war scenario. Really bad thinking in all of this",
        "Tough loss.  Thanks for providing this and sharing your personal connection.  We all mourn their deaths.  I also imagine we all are grateful they lived.",
        "Poor planing and direction..",
        "Too many good souls lost in this type of accident in the uk has resulted in severe restrictions for safety reasons. display height, pilot hours / experience on type, limitations on aircraft that have any known risk factors. Height separation, discipline, visual contact and crowded airspace, possibly glare from the sun could all have played a part in this awfull tragedy.",
        "My deepest sympathies to family, loved ones and friends of these 6 pilots.  Not one of these pilots started their day thinking this would be the last one.  They truly were doing what they loved and bringing tons of joyful nostalgia to old and young alike. May our Heavenly Father grant peace to so many that are heartbroken at this time.",
        "P 63 king cobra pilot has been ignoring his Blindspot for many years to create this pattern of flying blind. He’s been lucky to not hit anything prior with his style of flying his luck ran out. To say this is the fault of a Blindspot is a copout. He has not cared about what is in that Blindspot for many years it’s a style of flying he has just been lucky prior",
        "Thank you for your insight and sensitivity in explaining all that was happening during this tragic accident.  I have learned some valuable lessons that will help me in my flying",
        "well done,\nyou TOTALLY MANAGED to clarify the situation particularly the overhead map",
        "Thank you for the coverage . RIP to the pilots and crew.",
        "I keep saying it over the years. This is the best channel on the internet. I know nothing about any of this, except for the bell to fasten my seat belt. Blancolirio just nails it everytime. May God care for those lost.",
        "Best Kamikaze plane Hit since ww2 direct hit .",
        "So at fault is the show planner.. the air boss you say? … obviously you d NEVER put 2 different speeds “ vehicles” on the same track with different approach routes on top of.  And the ‘ planned ‘ three fast planes  always at some point intersecting with the slow vehicle .. sorry , that is asking for troubles EVEN if the p63 has sight of the b17. Unbelievable how amateurish this flight “plan” was preconceived…",
        "What a great breakdown. I'm an airline pilot, but NOT trained in formation. As is the case with most accidents, it's rarely one cause. Craig may have made a mistake, but it kind of looks like the entire display was set up in a risky way. Those fighters should never have been flying at higher airspeeds, co-altitude, AND inside the bomber line. Higher speed means wider radius. I think he was trying to fly the line he was given and got really unlucky. Either way, RIP, gentlemen. They were all just trying to spread their love for aviation.",
        "You nailed it. That was my initial observation. Lost sight of the 17. \nRIP, aviators!\nModesto, Ca",
        "RIP to these great guys.   I hope the air show community develops a better protocol for air shows....no overtakes just in trail, or offset....maybe limit bank angle.  So sad to see.",
        "I think that if there would have been a person on the top turret, they could have seen the airplane approaching and inforned the pilot of the B17 . After all these planes where made to look and avoid incoming enemy aircraft.",
        "70MM Cannon ? um, NO,  it was a 37 or 20MM cannon",
        "Why is there so many planes in the air at that time. so sad they didnt have a chance. F...",
        "Condolences to families and all flying communities ",
        "Highly coreographed yet 6 men wont go home to their family this was preventable government should be ashamed",
        "Dreadful loss. Shows you just how fragile we all are. It took just a few seconds to turn it all upside down. Thank goodness it didn't kill anyone on the ground.",
        "Juan Browne's channel is always the go to place to hear some aviation sense midst the babble elsewhere.  I suspect that his comments here on this tragic accident will be apposite.",
        "I agree, I can't understand the reason to parade all A/C at the same altitude (especially those with high speed difference)  It does appear the P-63 was concentrating on keeping formation with the Two Mustangs and lost sight of the B-17. If so, he should have broke off and climbed Being too low to slide under as you explained very well. He probably thought he passed the Fortress but he was moving much faster than the Mustangs as they flew overhead.... I am amazed at the Airboss instructing a change in altitude and allow a Pass at that point(A final turn entering the Parade route) It would seem all pilots are assigned an Altitude in the holding Pattern and maintain that altitude through out the Show and receive clearance while returning to land....",
        "Very sad thing to happen ",
        "My man I have watched a number of these analysts trying to describe what happened, \n\nBy far you are number one and tell Inez and showing us and it was really what happened , No one else even comes close  to your analyzation ",
        "anything that involves killing, anything, should NOT be paraded.  I'm do regret the terrible loss.",
        "the best channel.",
        "I don't expect to ever fly anything more risky than MS Flight Simulator, but I actually had a chance to ride in the jumpseat of a B-17 alongside my dad about 10 years ago at a similar air show in Oklahoma. We got him the tickets for a retirement gift (he worked for the Air Force as a civilian), and we were both blown away by the professionalism of the crew as much as we were by the plane and the views. Always had a bit of a soft spot for those vintage warbirds since that day, and am so sad for the loss of these skilled gentlemen. I hope we can learn lessons from this collision that keep these historical artifacts flying safely for years to come.",
        "First: Love your experience in all your videos\nSecond: This specific peace time formation of flying sadly reminds me of a visit the PIMA museum in Tucson AR.  In the hanger with their B-17 is a wall of banners in which each identify a variety of crews and their outcomes.  I had to ask a volunteer what the ones listed as 'crashed during assembly' meant, only to learn that it (though rare) wasn't uncommon for aircraft to collide and crash after take-off while running a circuit around the airport waiting for other planes in their group to get airborne.  The danger of close circuit flying is larger than that of straight high altitude bombing runs it appears.",
        "I noticed in one video, that was shot minutes prior to the accident, that the P63 pilot was having trouble keeping a proper distance in an echelon formation with a couple of P51s. The P63 appears to be drifting towards the other aircraft. Then they bank to the left and the P63 drifts away from the formation as though the pilot lost the ability to maintain the formation. ",
        "I\"ve never done formation flying, so I can't much comment.  It's easy to understand however the necessity to keep visual contact.\nOf Course!  It's a great tragedy, the loss of life.  Sickening.  \nBut my other point, in the past 3 years, we have lost 2 B17's.  Both of them irreplaceable.  I think that gets us down to 8 remaining.",
        "Holy shit, this was just a few blocks from my house.",
        "Situational Werness should not be a scapegoat reason.",
        "You did your friends justice. This was the best analysis video on this accident that I have seen yet. And I watched several. Very well done, God bless the victims in this tragedy.",
        "Sad day.  When I was a kid I loved it when the Confederate Air Force came to Modesto. I hate that you all lost 6 pilots but they ain't building B17s any more either.",
        "So sorry for your and everyone’s lose.  I know it’s a tight community.",
        "Great explanation of what most likely happened, and what is supposed to happen. My question is once a pilot loses sight of the other aircrafts in a low altitude parade like this, especially when you are trying to scrub airspeed why wouldn't you pull up and out of formation gaining altitude seems like the safest strategy in this scenario. You can see above you and there is no better way to scrub speed. That's what they have done at the Reno air races for a long time,  so why not do it here? What am I missing?",
        "Thank You so much for your evaluation of this crash. This must be so difficult for you to recount, the loss of a friend and other aviators. RIP to them and peace to you Juan.",
        "37 mm cannon anyway...I don't know how they could have fit an M4 Sherman gun on that hood",
        "Let’s see, lost a husband and father of three in stol drags in Nebraska, a up and coming race pilot in Reno and now another six well respected men in Texas. Not a good year for air shows.",
        "They were doing what they loved, loved what they were doing. Rest in Peace, gentlemen.",
        "Was there a separation in altitude? Obviously not......",
        "Many thanks for your detailed explanation of this terrible accident. Well done, Sir. Prayers for their families, friends, cadre, and all devastated by their loss. ️",
        "R.I.P.",
        "Interesting analysis.  With all the precautions, professionalism, experience, etc, that make this a head scratcher as to why the P63 lost sight of the B17, could the P63 pilot have experienced a catastrophic medical emergency rendering him unable to control the P63 at that moment in time?  We will never know of course since there is no body to investigate. RIP to all that lost their lives.  I appreciate all of their efforts in bringing these old birds back to life.  I had the privilege of seeing both of these exact airplanes in person up close at an airshow in 2013 in Hondo Texas.  Have pictures of both. So sad to look at them now.",
        "Why would you allow the fighters to be at the same altitude especially a plane with known  poor visibility like the P63     the CAF is all i can say",
        "Extremely Sad! Prayers for the Families.",
        "You handled this video with elegance and grace, Juan. Had to be a tough one to do….",
        "I thought this was some official report.",
        "I am so sorry Juan for this lost of national treasures.  My condolences to the family and friends.  Thank you once again for your in-depth details of this accident as I’m sure it helps those concerned.",
        "You won a subscription from me with the demonstration with the two planes in the visual of how one couldn't see the other . Very nicely done Mayday air disasters couldn't have done it better. Thank you for the information.",
        "So sad, thanks for your thoughts",
        "is it possible the P-63 pilot knew he blew his pattern pulled too hard, G-LOCed and that was it?  The ADSB data is eerily similar to G-LOC jet crash at Reno...",
        "Interesting",
        "Thank you for your work, Juan. I am not a pilot and found your site several years ago during the possibility of the Oroville Dam collapsing. I have great admiration for pilots and the old planes. When I heard about this accident, I went looking for your site to get the updates. You and the flying community are in my thoughts during this heartbreaking time. I appreciate the brevity and the respect you bring to this incident and to the family of the flyers involved in the crash.",
        "This must have really hit home Juan, especially with Len having done your A320 ride check. RIP to them all.",
        "you nailed it again, ...... are these airshows worth it?",
        "Mr Browne, we can hear in the tone of your voice how difficult it was for you to make this report.   My condolences on losing colleagues, especially those you know well.  Thank you very much for breaking this down so eloquently and professionally; for non-flyers like myself who have a genuine love of flying and the warbirds legacy.",
        "Thank you Juan for your evaluation and objective analysis. Even though we will never be completely sure of the true reason, yours seems to be a very plausible theory. As we learned in the AF accident investigation school, most accidents are chains of events stacked up that you work to identify and break. In this case, by speculation the big one might have been no altitude separation, combined with the inside rejoin, trying to catch up to fighter lead (target fixation and desire for perfect formation crowd pass) and failure to break away when the sight of the bomber was lost (situational awareness) could have had the results and tragic event that happened. Even if other factors were there, as you said much can be learned and applied from this. My thoughts and prayers to the families involved and thanks again Juan.",
        "Thank You Sir...Your Explanation and Facts and your Experience  comes highly Valued.....The Air Boss and Pilot Error and Poor Briefing caused this Accident....Speed and Altitude and situational awareness ..is key for safety.",
        "Them guys were probably partying before hitting the skies.",
        "Thank You very much for your clear explanation of the factors involved in this tragic accident. Our sincere condolences to the families and friends to these wonderful men.",
        "R.I.P.  Condolences to all the family and friends of these airmen and especially to you Juan as you lost a friend as well as a fellow pilot.",
        "Other than the loss of a couple personal friends in light aircraft several years ago who were ex-combat and experimental pilots, this to me is the saddest thing in aviation since the Collier B-17 was a total loss, a plane that I flew in.\nI tell you Juan, if you love aircraft it's hard enough losing those two vintage planes, but also to instantly lose all the good men on board is beyond tragic.",
        "Juan, My condolences. I was there working the show. I see your point exactly here. I am not assuming anything here but this makes the most sense. RIP",
        "Thank You.  A tragic loss of Man and Machine.  My condolences to Family and Friends.",
        "Fifty years in this flying game and your analysis is very plausible and well explained.  It will be interesting when the NTSB releases their report to see if they concur. This event is a major double whammy as we lost six great aviation people but we also lost two aircraft that will be surely missed on the vintage airshow circuit. Let's hope we learn from this and ensure that the loss of personnel and aircraft will not be in vain.",
        "Juan, I’m very sorry for the loss of your friend, as well as the other pilots. Gone west too soon.",
        "While I dearly love, appreciate and support all those preserving our History, especially the flying air museums, the circuit layout for this Parade of Bombers was just to over-saturated in the aspect of Aircrews' SA.   I may have just been a Backender most of my Naval Aviation career, but that sort of close in circuit with several formations, each different aging Type/Model airframes is just an accident like this waiting to happen.  Far too many holes in that Swiss Cheese.  Remember, these airframes where built to destroy America's enemies, not put on air shows. They don't have the benefit of more modern avionics, controls and designs of later jet aircraft.  May the Souls of those lost to us be at Peace.  May God comfort their Families and co-workers in this great time of tragedy.",
        "You can hear the fighters under heavy throttle from on ground videos. This was an impeding dangerous aerial stunt using antique planes. Using high speed maneuvers on approach seems to differ from normal War bird airshows.",
        "Correct me if I'm wrong, but if he performs the overtake maneuver that you described at 16:30, does that put him over the crowd? Even if they had more altitude, he'd violate the rules and not be allowed to fly with these groups any longer. Could he have been avoiding the crowd fly over? Thanks to anyone who can answer this.",
        "dunno why folks keep talking about visibility when the plane was traveling twice the approved speed and way out of formation while descending?   10 to 1 he couldn't pull out if he had to, did he have a health issue that caused him to pull back on the throttle?  these things happen, or it was mechanical.. the wing tip never even twitched so he never saw it or wasn't able to do anything about it, you can't see that?  also, where does the 63 end up if it doesn't collide with the 17 ..  and the 63 was not running the same altitude as he is descending pre collision, flying in an oddball heading?  staggered elevation and pattern, same as a battle arrangement..",
        "Thanks for a very informative video at this sad time.",
        "In an interview, Mark Coburn, a Dallas police dept pilot who was taking the photograph and listening to the radio call from the show coordinator on the ground said that the show coordinator told the Kingcobra to overtake B-17 and he thought that's kind of rushing everything. And he was right moments later the collision. So this was a negligence on the air boss side who made that fatal call. I hope he is held accountable for the deaths",
        "I was a longtime member of the CAF going back to the late 1970s.  I left because I saw too many things I couldn't abide and I was tired of seeing planes get destroyed and people dying.  Their track record is dismal, and a large number of aircraft I worked on or helped clean up are no longer with us; their A-20, the B-26, several Mustangs, several C-47s, a B-25, Lockheed Lodestar, their Spanish Heinkel 111 (which I was fortunate enough to have been up in several times), a P-38, and it's a matter of time before Fifi crashes.  I love the big old warbirds but it's time to keep them on the ground and do what the Champlain Fighter Museum does - keep them running and do running and taxi demos, but leave them on the ground.  I was aboard Fifi back in the late 1990s when we lost engine #3 because an oil line blew - it could've been much, much, worse.  I first went up in Texas Raiders at Houma, Louisiana in 1979 when Van Skiles was piloting her.  He did a lot of maneuvers in that plane that didn't seem humanly possible.  I love 'em, but it's time to preserve the history, and stop putting the lives at risk.",
        "That accident was horrific",
        "My heart aches for each person lost and their families as well. The sudden loss like this, just can't even be described I am sure.\n\n   I love these old aircraft,  and I  am just fascinated anytime I get to see them fly. I've even flown on one of the B-17s still around, and I can't describe the thrill that the flight was to me.    But......",
        "The fighter pilot have seen the p17 as he is increasing the banking angle more and more , he is trying to evade p17 by ‘closing’ the cycle, but in this case what he should do is to reduce the banking to 0 immediately and pull out, which is quite counter-intuitive as by doing the right measure, you are seemly heading into the bomber at the first place. No excuses, they are killed by conventional habit and more importantly: the age........",
        "Sad so many killed in Show crashes over the years.\nSome notes of Interest from Wiki\nP-63F Bell Model 43 variant featured an enlarged vertical tail and Allison V-1710-135; only two (43-11719 and 43-11722) built.",
        "Thanks, Juan. Your simple hand visuals are more effective than a bunch of CGI!",
        "I am so very sorry. My condolences to the families.",
        "As always Juan your reporting on this trajic accident is professionally done. Prayers go out to the families and friends of those lost. Rest in Peace gentlemen!",
        "Your analysis is always appreciated, however, it's always under tragic circumstances these videos are made. We can only learn collectively and apply these lessons in the future. RIP aviators.",
        "Terrible loss of both flight crew and airframe. \n Tight airshow formation protocol needs revision bro. \n Hopefully this tragic SHOCKING incident will spurn a rethink into how things move on. \n What a shame, massive loss on this occasion. ",
        "Excellent and sensible analysis of the tragic events.   Your clear and logical explanation of a couple of formation issues was illuminating.  My hope is that there are solutions that do not shut down these kinds of demonstration flights.   Thank you, Juan.",
        "...they wanted to pretend to be WW2 pilots flying WW2 planes...they got what they wanted.",
        "Well done Jaun, sorry for your loss. Thank you for what you do for aviation.",
        "Excellent analysis. Thank you.",
        "Say what you will about this tragedy, but the crash and deaths made this the most realistic WWII airshow anyone has ever seen.",
        "Protect the vintage aircraft in the museums. Just a matter of time until the rest are destroyed. Average of one a year. ",
        "Your analysis is always really solid. Thanks for your work!",
        "Being a former USAF Crew Chief it hurts when lives are lost in a mishap be it mechanical failure or pilot error. May these gentlemen rest in peace.\n\nMy condolences to you Juan that \"Len\" was someone you knew.",
        "Maybe it's time to stop performing hot-shot stunts over airports, cities, and audiences.",
        "At 4:50, you state that the P-63 was built around a 70mm cannon. That is incorrect. It was a 37mm cannon. The B-25G carried a 75mm cannon. Perhaps you conflated the two. This accident is a terrible tragedy. My condolences to all the aircrew's families and loved ones. May their memory comfort the families of those lost. -I do not understand the practice of flying single seat fighters at the same altitude as four engine bombers. It is, clearly, a recipe for a real disaster. I hope future airshows will prohibit this practice. Those fighters should have been 500 feet above the bombers at all times.",
        "It appears the p-63 was losing altitude into that turn.  If he was bleeding off altitude and at his aoa in that aircraft, no way he could have avoided the 17.  So why was he so far out of his position and also descending?  Love to hear what their altitude separation was supposed to be.",
        "I have to wonder, with that many birds in the  air around a relatively small area, there has got to be a better understanding of what kind of deviations from the plan is aloud.   For example, if you drop out of formation - when and how can you rejoin.  Pouring on the coal and cutting a corner or two doesn't seem safe (in hindsight)",
        "I think Craig tried to turn harder to avoid the B17 because of the deadline. Had the deadline not been in play, he may have exited the turn and gone wings level to avoid the crash. Something tells me that heavily drilled well enforced line may have had a negative psychological effect.",
        "Thanks for your insightful video, Juan.",
        "I knew Craig for almost 20 years in and out of work.  One of the nicest and most generous guys I’ve ever met.  Flew with him many times.  Just an all around great guy.  He was liked by many people.  What a horrible tragedy.",
        "Great and informitive explaination. Thnx. So Tragic. Bless all involved",
        "This is on the show coordinators.",
        "Rest in peace good gentlemen, hail fellow well met!",
        "Holy crap Juan.  IF I were still flying (and we worked at the same airline) I'd be very glad for you to be part of my crew.  Your knowledge is outstanding.",
        "Thanks for this. I was watching other YouTube channels explaining what happened, but I was waiting for your in-depth analysis.",
        "Truely a shame those who lost their lives...also a true shame to see the b17 go....after all these years..can’t be replaced.....so sad",
        "In looking at the path of the P63, it seems at least possible he was about to cross the deadline. Regardless, why did anyone believe that flying essentially the same path, at the same altitude, with that potential disparity of speed was anything other than utterly ridiculous? I wonder if the culture of these airmen is what's in need of review. This should never, ever have even come close to happening.",
        "There has to be more to this \"narrative\"   It's just hard for a laymen to be able to digest this.  I mean this is an airshow that only has seasoned pilots I'd should expect. Something just doesnt make sense.",
        "Great work Juan!",
        "Excellent Analysis",
        "Thank you for your insight on these videos. I am very sorry for your loss and the other pilots that lost their lives. Condolences go out to the families!",
        "This is why they usually run fighters and bombers at different altitudes.  This should become a new rule for air shows.  \nSeparate aircraft by Elevation based on their Air Speed.  Sorry, but safety over recreation realism.  Learn to use perspective of the audience to create the Illusion of fighters harassing Bombers.",
        "Bless you Juan for another excellent technical, factual review of an unfortunate,  tragic event. You bring first hand experience with respect and love for all involved.",
        "Why didnt the fighters had the outer cyrcle ? Tha fact that the sight is poor and they may loose sight with the bombers must have been known bevore the show. Looks like the planning was not good at all.",
        "Juan made a very professional and astute assessment of this trajedy without overtly blaming the P-63 pilot.",
        "RIP gentlemen, may the lord bring peace to to your families during these tragic times.",
        "Such an excellent explanation, Juan. Especially the geometry of rejoins. Only thing I would add is that when you misjudge the closure rate on lead and must slide under and outside, you HAVE to ask lead for permission to rejoin the formation.",
        "Painful video, sorry for the loss of your friends.",
        "For all you all speculate, the fighter pilot may have been looking down or aft of wing for a moment. I’d call it a sightseeing moment.",
        "Did the P-63 pilot have a Covid jab medical emergency ? Anyone think of that?",
        "Juan condolences on your loss as well. To review the loss of a friend has to be difficult. Take care and prayers for the families of these lost souls.",
        "the b17 is just bad luck it seems,\n\nwhether over enemy territory or not",
        "It wasn't a near miss,,,it was a no miss.  All this bloviating is useless because there is no possibility this was not a real, actual accident.  None of the participants were TRYING to have a collision.,  I really hate all this \"after the fact\" pontificating by people who have no more expertise than any homeless bum at skid row.  Bah.",
        "Juan, I'm so sorry for the loss of your friends and colleagues.  My heart breaks for their friends and families, and for those who were impacted by this tragedy. Peace and comfort to all ",
        "Hindsight 20/20, have the fighters fly the outside route not inside route or have the fighters and bombers separated by 500 to 1000 or have the bombers go up only with fighters on the ground. Land the bombers and then send up the fighters, RIP",
        "People forget that during WW2 many losses were not only from enemy action and flak, but caused by mistakes in maneuvering while trying to form up bomber formations with aircraft in very close proximity.  I like his comment.  \"That is alot of aircraft in the pattern to keep track of.\"  Remember you would never allow this kind of proximity and low flying in civil aviation - all for good reasons.",
        "Juan - thanks for educating us on the role of the air boss in shows like this.  I just cannot even imagine how hard it must be right now for the person who air boss that day.  \n\nMy heart goes out to everyone involved.",
        "Sorry for the loss of your friend, other pilots and crew and two classic aircraft.\n\nBest incident analysis I seen yet on this, once again you are the best of the best.",
        "I'm sorry to hear of the loss of your friends and of the flying community.  I sincerely hope the wounds will heal and we can continue to see these old war birds fly for a long time into our future.  It IS inspiring, despite the potential tragedy.",
        "My heart hurts. The video is hard to watch And  hard not to watch. God bless the souls of the 6 lost and their families.",
        "found the following analysis interesting: https://www.youtube.com/watch?v=Sceufd1Xutc\nfrom my understanding, the guy (an air-force history channel) never usually does accident reviews but was rather involved in the restoration of warbirds and used to work with the Texas Commemorative Air Force(this is from his claims, but, he does not seem uninformed or hype seeking, so it looks legit).",
        "Very sad",
        "Putin did it!",
        "The sense of loss and sadness is evident in your voice, a very difficult explanation to deliver, and as \"Commerce USA\" has said a very respectful approach to the sad and very tragic accident RIIP the airmen lost on that day , our very sincere regrets and sympathy are with their family, friends and loved ones.",
        "       God demonstrated His love to us by sending His Son Jesus Christ, who died and rose from the dead to Give us eternal life. He also promised to heal your body. If you confess with your mouth the Lord Jesus and believe in your heart that God has raised Him from the dead He'll give you eternal life",
        "The air boss never should have allowed no vertical separation to happen. Last year at the same event, the fighters kept a 500 foot additional vertical separation. The P-63 should have immediately called blind and knock it off, slowed slightly, leveled his wings, and/or climbed slightly into clean empty air.",
        "I'm so sorry for the loss of your friends. The crash was heartbreaking to watch. Thank you for putting this together I'm sure it was difficult",
        "Fantastic report Juan as usual! Such a tragic loss all around, the pilots and crew and the museum pieces too. Peace and comfort to all involved... ",
        "This was just a tragic event in a couple of ways. Primarily, the loss of the lives of six men who can never be replaced. But also the loss of two historic aircraft. It was a sad day in aviation.",
        "Thanks for helping me understand",
        "This is so sad. I nearly got wasted at Shoreham, UK in 2015, and the fear of wanting to run but surrounded in flame is unimaginable. God bless those affected.",
        "Totally Reckless- and it's \"Reckless Texan Hubris\" .. to Boot.   Not surprised one bit.   Excellent Commentary and Video Explanation.",
        "Thank you for this detailed and comprehensive report of this accident. Gives us all a much better idea of what occured. A tragic loss for the aviation community.",
        "This one hits home, sorry for the loss of your friend and our thoughts and prayers go out to the family’s. Godspeed🇺🇸",
        "Maybe he lost sight but he looks like he went off his flight path.",
        "Thank you so much for your analysis of this tragic event and our Hearts go out to all those men and their families. I was waiting to hear what really happened and I cannot believe that anyone would even think of mixing these dissimilar types of aircraft at the same altitude and you are spot on in your\nconclusions. In the film clips of a earlier airshow it looks like they are running the three ship fighter elements at a higher altitude as they should be and it is",
        "Juan,\nSorry for the loss of your friend.\nThis script was doomed to failure on the air boss’s fault. You never ever Shane the script in mid show unless it is for an emergency. This placed them in direct line for an emergency.",
        "TRAGIC ! is the only possible word that can properly describe this !",
        "Thank you Juan for taking us through how this terrible accident occurred.  Sorry that so many good people lost their lives.",
        "Your assessment is clear - to the point - and makes sense. RIP aviators.",
        "Very tragic incident.  Condolences to all of the families involved.  May we learn from our mistakes.  Thanks Juan.",
        "Just a quick look tells a crowded airspace above that field. The other fighters look like they are more distant to the bomber but it's still too crowded looking.\nThere is a window of time whereas the level flying Aircobra should've seen the fort heading in the opposite direction but was apparently distracted even before being affected by his blind spot / wing . . . \"situational awareness\" as you say. You know you can roll over a bit and see where you're going to turn to before you even start the turn. . There still seems a window during banking the turn where he should've spotted him and straightened to cross the spectators rather than collide . . .  unless he was looking down the other side of his fuselage behind the Fort . . . for either Mustangs or the Fort maybe?.. . . Crowded airspace.even if different paths. Replicating a combat \"furball\" is a dumb plan.and not for every pilot no matter experience at an airline career.  RIP",
        "Thank you, sir for your explanation of the crash.  I am so sorry for your loss and the families of the pilots and crew members.",
        "I have a few videos from that day of everything flying from the police academy that shares the land with the airport if you want me to send them to you",
        "Man! I been to several air shows & myself a pilot. I must admit tho, I’m getting somewhat concerned about my safety. We have all these rules and procedures for safety and continuity yet - all that seems to be put on the shelf for and air show !  I think the lines of safety are becoming blurred. An air show IS NOT A RACE! Why no one in the briefing raised their hand or called out their concerns???  MAYBE they will loose their “slot” as a pilot in the group ?",
        "First clear explanation I've seen of how and why the B17 was essentially in a blind spot of the P63.  Thank you for your usual calm and considered summation of the info so far available without undue speculation.\nCondolences to the aircrew and their families.",
        "Excellent explanation. Condolences for your loss. Clearly errors not only in execution but planning. So much to learn from this accident",
        "Wow MrJuan. I just got smarter…thank you, from an Oroville student.",
        "Good analysis. Some hard answers about why the dissimilar airframes were operating co-altitude on similar flight paths. Which does appear to be a change from the standard show script.\n\nCondolences on the loss of a friend. Those hurt worst.",
        "As a USAF C-17 Loadmaster who has flown in 20 years of worth of air shows around the country, my heart is heavy with grief and filled with sadness. I can assure you all these airmen were the best of the best. They flew for the love of flying and for the past air crews who did not make it home from their own missions during war. May they all RIP.",
        "Juan. I just saw the video that Col. Richard McSpadden have posted on this mid air collision. Definitely worth the watch!",
        "This sure sounds like the ops plan was a set-up for disaster.   While I would like to continue to see these airplanes fly for the public, it may be time to limit their operation to simple parade passes and small formations of airplanes having similar performance.   This mix of high-speed and low-speed traffic, with the fighters also climbing and descending, perhaps simulating combat maneuvering,  is just a recipe for someone to lose situational awareness.",
        "Brilliant explainations as well as respectful commentary. RIP to all whom lost their lives. One can only hope they went out doing what they loved so dearly.",
        "I'll give you a thumbs up but I just can't watch this accident. I heard the video and that was enough.",
        "The sky is the limitsorry. One was blind on the left eye, the other right. I cant believe, that something can happend. Sorry for my bad english",
        "Well done Juan, and certainly matches my own thoughts and training.  The low altitude part of your analysis is certainly a head scratcher as the 500' pattern basically cut off the only escape from the hazardous situation.  Your camo and inflight visibility explanations from the P63 perspective were quite revealing.  Airshows lead to lots of show specific hazards that need to be Murphy Proofed and What-iffed, before the show!  Tragic loss of both men and airplanes any way you slice it, and we all feel for the families.",
        "That is why I am still alive. Slow Cessna 150 flying",
        "I think I know what happened, somebody wasn't paying attention to where he, she, it, they were going.",
        "Does anyone have input on G-forces he may have pulled?",
        "Prayers",
        "An excellent analysis of a sad event, Juan.  Your knowledge of aviation is essential in understanding the aircraft involved and the rules for flying in formation.",
        "Sad day",
        "This whole situation just sucks in so many ways. We should not be loosing these high time vintage pilots flying and these amazing airplanes like this. I think your opinion of the  P63 Pilot loosing the sight of the B17 is spot on. I cant imagine that all of these aircraft where assigned the same altitude (IF they were) that makes no sense that they would be and if so seems almost criminal knowing the speed differential and the amount of traffic in the air. Sorry for everyone's loss if you knew any of these pilots. Sadly this day all the holes lined up.",
        "Been waiting for your review (and avoiding all the others rushed out)  of the incident and as always, you have done an fabulous job of reviewing what should have happened as well as what did happen, and done so in the respectful manner you always do in tragedies such as this. I am deeply saddened that such an incident occurred, especially during what should have been an enjoyable day. You have one again informed us on the tragedy in an intelligent manner and respected those whom we lost in the process.",
        "Thanks Juan.\nWe lose friends and it's hard to admit that mistakes were made. Lost a few over the years and we know what went wrong. \nI fight the complacent feeling that comes with so many years experience.",
        "if you where sitting in the P-63; I believe the P-63 couldn't really see the B-17 as it banked into it",
        "This was an \"accident\", that is, nobody did anything intentionally and I am sure that it will be determined that no one individual was the sole cause of it all. Terrible tragedy and loss of lives and aircraft to be sure. Thank you Juan for presenting this clear and factually. Out of this tragedy will come safer procedures and better safety for all, but that is little solace to those we lost.",
        "Multiple aircraft, greatly varying speeds, all at the same altitude—is just flat a recipe for disaster. Not a question of if, but when. Specific aircraft visibility, pilot skill, pre-planning etc. are all just extraneous points. Bad setup = this result. “Proof’s in the pudding” What amazes me is that these “experienced pilots” willingly participated in this activity, which only highlights that experience sometimes instills a dangerous boldness and overconfidence. ",
        "theres allot of plane crashes at these shows... like how many has there been past 20 years",
        "Question: Is it posible to mount a screen in these older planes like the P63 with limited visibility with an external mounted camera(s) to assist the pilots situational awareness?",
        "That’s a good demonstration with the models Juan. Really brings the point home.",
        "Pretty straight forward Juan thanks. I rode in TR a year ago in Sept. My takeoff position was radio operator room right where P63 impacted. Very sobering. Incredibly sad day for these guys, they had no chance to evade. I think the altitude separation is critical for fast movers and bombers together. My heart goes out to these families, the CAF and pilot community. They were the nicest guys, very professional, and passionate about their flying.",
        "Brings memories from  USAF Jet Training ( Webb AFB , TX. ) , just warning about this situation. \nI'm very Sad for all this happening. \nMy Condolences for Families and Pilots.",
        "Excellent debrief. I know there will be more details but you did a great job explaining a lot of the norms for formation flying.",
        "Condolences to all those affected by this accident. They died doing what they loved. Thank you for helping make some sense of this tragic event. It’s a necessary evil, but you tell it how it is. And it always makes sense compared to the news. Prayers to the families and friends   hero’s are never forgotten.",
        "Juan, Sorry for the loss of your friend, and I share your opinion presented at 17:08  Why was this briefed with no altitude sep. ? It would be so easy, with the bombers at 500ft., to give the fighters a 700ft hard deck, as demonstrated around 2.00",
        "That's nuts. Fighters and bombers are flying the exact same pattern. Yet the fighters with low wings are going much faster while ascending and descending throughout the pattern, alongside, aft, and forward of the bombers. Crazy that people thought of this plan.",
        "Definetly calls for strict rules and FAA enforced rules at airshows. So many airshows per year , so many accidents !!!",
        "Juan thank you so much for your video. I was at the airshow and witnessed the tragedy. I am an aviation enthusiast and have seen those planes flying times. It was a horrible thing to witness.",
        "That's a great analysis and explanation. Thank you for helping us to understand this tragic accident.\nRespect and condolences to all involved. May they forever fly as free as a bird. ",
        "How could the idiot in the Cobra run into something so large and slow moving as a B17?",
        "Condolences to the friends and families of those we lost.  Thank you Juan for the way you handled this incident.  I have intentionally avoided other sources until I had a chance to hear your report.",
        "Excellent analysis ... Thank you.",
        "Terrible Tragedy RIP",
        "why all this bs , the fighter pilot couldn't see the bomber under his floor . A tragic mistake . Good people will always die doing a  simple mistake .",
        "Thank you for telling us about this, even through what is very obviously a terribly painful personal loss of friends.",
        "superb",
        "Thanks, Juan.  So sorry for your loss.",
        "Lots of people saying the crash was intentional due to mental issues (depression) of the P63 pilot.   \nIt's a shame...depression is called the silent killer for a reason and some guys just want to take others with them when they go!",
        "\"Im looking forward to Marty's apology video.\" Is what I would say if I didn't believe Marty was a self absorbed sociopath. \nGood on you Mick for coming forth with this.",
        "Excellent and reverent depiction of the unfolding sequence of events.  Sincere thanks for this video, AND, God bless the families and witnesses of this tragedy.  RIP",
        "How a beautiful show can go so wrong it’s unbelievable how this happened it’s unimaginable that something like this could ever happen,my condolences to those involved.",
        "A tragedy.   Thanks for your thoughtful analysis.   I am sorry for the loss of your colleagues and fellow airmen.",
        "1:22:09 Cory just letting Atreaus die was one of most funniest and satsifying things I have ever seen :-o",
        "Sorry for your loss, Juan.",
        "Thanks. And condolences\n.",
        "what a tragic loss. can't continue to have these fatal airshow crashes over and over.",
        "Thanks for the video!",
        "This is the first I've heard this sad news. RIP to all who were lost. I'm assuming that the Super-Fortress and the Liberator shown are the same ones operated by the group that used to have the moniker, the \"Confederate Air Force.\" Obviously, since we all live in the United States of America, \"Land of the Offended,\" and because of political correctness from people gettin butt-hurt, their name has changed. Anyway, if so, I've been on those two aircraft...I've also seen the B-17 in the air, but never been on it. Besides the poor souls lost, we lost two important pieces of history. Very sad...",
        "As always, this channel provides the best analysis I've seen in the past couple of days, without the need to replay the collision over and over. Very respectful. My condolences to all the families involved.",
        "I think that the speculation in Animarchy History's video was mostly correct. The basic theory in that video or at least what I grasped out of it, the P-63 was moving too fast, maneuvered out to level potential stalling and unfortunately did not see the B-17 as they crept into her airspace. After watching this video, listening to your analysis, the P-63 moving too fast attempting to keep up with the Mustangs sounds convincing. I can also believe that the P-63 had taken a wide turn to scrub their airspeed which resulted in collision because of improper separation. In any case, all hands were lost, both crew and historical aircraft unfortunately.",
        "So sorry about all this but really sad you lost a friend Juan. Thanks for the explanation.",
        "I train as a student pilot here at that airport the airport just reopened today it’s very sad and unreal this happened here",
        "Juan my sincere condolences on the loss of your friends. It is clear Len was someone you respected and admired. \nI lost friends in my line of work, and it is never easy and you are always left with an emptiness that is gut wrenching. The work you do with these videos is hard enough, I am sure, without having to do one like this.",
        "Thank you for NOT showing the video!",
        "Object fixation by P-63 on P-51. Bet they won't allow co-altitudes on different speed parade routes in the future. Yep. And in combat,  those fighters would be flying high CAP anyway, right? I know it's an airshow but it looks cooler with the fighters at higher altitude anyway. Complete chaos at co-altitudes",
        "Former Redbird Airport?",
        "Thank your work on this video. I'm also not a pilot, but the way you explained things made perfect sense to me. It just seems to me as if having the plans parading at the same altitude was a bad idea. Of course hindsight is 20/20. My prayers for the families involved.",
        "Just finished listening, 500 AGL. with no escape sounds very risky.\nSorry about losing your friend, Juan.",
        "Would it be safer if the faster planes take a wider turn path so the bombers are always inside always in view of the faster fighters?",
        "I've heard it suggested that the fighter pilot didn't see the B-17 because he wasn't looking forward. He was keeping formation, leaving it to his leader to maintain a safe path.",
        "Such a huge tragedy.",
        "Another superb breakdown. Your level-headed and direct dialog is exemplary. It’s shocking that these aircraft were using the same pattern altitude. If this was planned it was designed for disaster. If it wasn’t the plan, there was obviously a great deal of miscommunication. Condolences to the families who lost loved ones.",
        "I fear that a fraction-of-an-inch, Juan - cost us six Championship lives.\n(that they may have been flying-at-same-altitude as you point out)",
        "Your breakdown is incredibly comprehensive compared to the air safety information available.",
        "Thankyou Juan\n\nNew video recently posted showing apparent \"drone\" strike on the P63\nhttps://youtu.be/FeP3P0LFIiM",
        "Sorry you lost your friend. ️",
        "the faster plane should always pass on the outside maintaining visual Of the slow aircraft which is now above him in the arc it seems basic why was the air boss not on top of this",
        "Sadly avoidable. GOD rest the souls of all these men.",
        "As lead investigator into the Space Shuttle Challenger accident, physicist Richard Feynman said NASA was engaged in very risky behavior by continuing to launch shuttles in spite of unresolved safety-related issues. Even worse, they believed that past successful launches validated their decision-making. Feynman was having none of it:",
        "Thank you for a great analysis. Looks like the choreography of this show was very questionable to say the least. But most accidents are a cascade of bad factors so there is probably more to it to find out. What a tragedy for all lost and their families. ",
        "My heart is broken. These lessons come so hard.",
        "I know it is an achievement that you would prefer not to have, but I am sure that for many of us who take an interest in aviation, whatever the level of our expertise (or, in my case, lack of it), your analysis of such incidents and accidents has become an invaluable resource. Thank you.",
        "My question is why would this Parade route be designed for them to be at coaltitude? I just feel like it's so risky with that many planes in one space.",
        "My deepest condolences to all involved. What a tragic way to lose these great men and aircraft.",
        "Juan,  I was waiting for your report on this.  I'm so sorry for the loss of these pilots.  It is more difficult when you know someone involved.  Thank you for your professionalism in your reports.",
        "when you think about it,,how stupid to try an re create a damn war..Just show people the airplanes in a nice SAFE way...Things will change now...",
        "Such a tragedy  I'm sorry for your loss. Thank you for taking the time out to thoroughly explaining what may have happened. I kept asking myself, how could he have not seen the bomber?! Well ... quite easily in fact. My heart is broken for them all. Thanks again ",
        "Sympathies to all of those brave men. The visibility out of the P-51 and the P-63 are not as different as people think. Both have long noses. I think if that had been a D model Mustang in the place of the King Cobra in the same exact position the accident would have still taken place.",
        "What a tragedy. So sad to see this. But it was also shocking to see so many angles of a mid air collision. Back in the day we wouldn’t have good visual documentation for evaluation like we do today.",
        "Juan, it's terrible that anybody was lost, but for you to have worked with Len and to have also known him in your personal life, to have discussed the 909 with him in the earlier video you made for that, I am really sorry. This must be hard for you. I have seen time and time again that these incidents and those that happen unnecessarily in the military really hit home for you. All the best to you and the families of the crews. Thank you for covering this and helping us to understand the factors involved.",
        "This was hard to watch but thank you, I have such a clear understanding of what happened.  Rip friends",
        "Ill continue to say this, belly up join to a formation......",
        "Condolences.  Juan, I can't imagine how hard reporting this must be for you.  The ATC recordings should tie it all together.  Somebody(s) really messed this up, might not have been the P-63 pilot.",
        "Thanks for explaining. This is the reason why I despise air shows. Too many unnecessary accidents.",
        "Thank goodness no one on the ground was hurt in this accident.",
        "Any airshow routine takes methodical planning. Some of the experts were Bob Hoover, Sean D. Tucker, and the pilots of the Blues and Thunderbirds who demonstrate a well organized, highly complex airshow.\n\nThese experts still have odds stacked in their favor. Hoover and Tucker fly alone. The Blue Angles fly the same type with identical performance. And they stay clear of the JATO C-130 and parachutes.",
        "When I was doings formation flying our escape from the formation when anything went wrong was to climb up.",
        "I feel specially very bad for the B-17 guys, they had nothing to do with it, never understood what happened and lights out in 3, 4 seconds? Damn.  Safety rules are there for a reason.",
        "Such a terrible tragedy. Being a big fan of World War Two aviation it really shook me up. Thank you for the informative video.",
        "Excellent analysis, Juan.  The circuit looked confusing and I still don't completely understand how the separation controls were supposed to work.  I think the Mustangs and King Cobra's should have used a longer downwind and base (beyond center line) to ensure visibility of the slower bombers.  I know that would be less exciting for the show, but a whole lot safer.  God bless the lost pilots and their families.",
        "It’s sad but these guys are putting themselves at risk flying this way.    Was it worth the risk?  Everyone thinks their invincible. Too sad.",
        "it doesn't really matter the plane design or the color, someone didn't follow their route.",
        "My heart felt condolences for the loss of your friends and the planes they loved to fly.  My older two kids and I were there that afternoon and saw the crash.  It was a beautiful day with so much excitement at seeing and hearing those beautiful planes and gut-wrenching to watch those few seconds of catastrophe.",
        "Dear Juan, I’m very sorry for your loss of a fellow AA colleague. May they all Rest in Peace doing what they loved. Do you know if there is any “Go Fund Me” type donation fund for their families?  I’d like to bless their families. Again, my deepest condolences.",
        "This really made sense. To much sense in fact I wonder why they allow these performances at air shows as they could have easily crashed into the crowd which is where they were headed. . We’re talking about dead lines no altitude separation no where to go if you overshoot limited visibility altitude restrictions etc  so you begin to wonder if the complexity precludes doing these demonstrations safely. I just wish this explaination didn’t make so much sense because I enjoy airshows. You have teams like the Blue Angels and Thunderbirds that spend countless hours( years actually ) choreographing these aerial demonstrations so that they are entertaining but mostly to ensure they are safe whereas I wonder how many hours were spent practicing the maneuvers that were preformed at the Dallas Airshow.",
        "",
        "Good demo! I'm really surprised at lack of altitude separation - even just doing 200 - 400 ft loses almost nothing on the show and adds a lot of safety with planes of different speeds. Did the P63 maybe get a bit low? Would really need to know what the plan was, folks doing turns inside but then lining up on the same runway AT THE SAME ALTITUDE makes little sense to me even from a plan standpoint.",
        "was this the same air boss as the year 2021 ..... ?",
        "Best failure analysis I've seen in a long time, covering a technical subject in a way a non-expert can understand.  And with great sensitivity to the tragic nature of the event.   My daughter flies for the USAF and I pray for her every day.  Condolences on the loss of your friend and thank you for your service.",
        "That's a lot of aircraft in the pattern to keep track of indeed !",
        "thanks for your insight! my condolences as well.",
        "another very well explained video Juan - my deepest condolences to you and the bereaved at such a hard time when Christmas is around the corner and families are so important - blue skies to those lost\n\nafter the accident we had here in the UK in 2015 at the Shoreham Air Show where the Hawker Hunter crashed on a road outside the airfield killing 11 bystanders, i knew straight away this would be a game changer in respect to how air shows are run - rules were tightened up possibly for the better, and i watched a year or so later easily one of the best displays i have seen for many years of a single Spitfire going through its paces - after 2015 displays are not as full on as they used to be, and with respect to aging aircraft i think is a wise choice, its great to see them fly and continue to fly",
        "This accident is totally on the air boss negligence from the time they had their briefing till the accident. They should not have had that many aircraft in the sky at any one time with a tight pattern. Also speed differential exacerbated the problem. This is so sad and totally avoidable",
        "Great job in analyzing this crash.",
        "If you watch the video from the McDonald’s parking lot, it looks like the P63 hit something like a bird out a drone shortly before the collision",
        "As a former accident investigator, I know it is important to gather facts before speculating about what might be at cause. However, your analysis seems very reasonable and spot on. Lack of lateral and vertical separation, combined with visibility difficulties are likely links in this chain of event. As always, tragic and all of us are heartbroken. Loss of fellow pilots and friends always hurts. That said, understanding what happened is essential to prevent it happening again.",
        "Good morning to all from SE Louisiana 27 Nov 22.",
        "RIP GUYS",
        "At lunch today one man knew several of the men that died in the crash. He told us the fighter plane was trying to catch up with the other fighters and did not see the big plane. He said normally they need to keep a 500' distance apart since these maneuvers were planned well in advance.\nIt's said this happened. All we can do is pray for the families.",
        "It's very unfortunate and tragic watching  six-man crash this way. I commend you for analyzing it and picking it apart for us. I think you're on Track with what really happened there isn't much more to it, it's all on video.",
        "Horrible, horrible tragedy. I had flown twice on the Collings Foundation B-17, so that crash hit hard. To lose another one of these magnificent pieces of history, the airacobra and such dedicated professional and experienced pilots and crew during an event is just devastating. Sincerest condolences to everyone affected. ",
        "prefer FAA report over civilian opinion",
        "I think the number one thing the people who keep replying \"it looks like it was intentional!\" on the accident videos do not understand is simply this:\n\nThe B-17 was moving.",
        "The amount of fx used in this one is insane. Love it. :(",
        "Very saddening, may the aviators rest in peace and condolences to their families and friends",
        "Thanks--so horrible and devastating at many levels",
        "Excellent job Juan.",
        "Prayer's to all those who perished and their families.",
        "As usual Juan, your reporting on this tragic event is very respectful and educational. Thank you for explaining this so well.  My thoughts and prayers go to the families of these wonderful and dedicated airmen. May they rest now in peace.",
        "The examples you give that show the reduced visibilty and blind spots should be taught in every groundschool.  I have been flying as a profession for over 43 years now and that very basic example was a real eye opener for me.",
        "Im just going to go ahead and say it, the display seems poorly thought and executed, theres planes crossing paths at different speeds all circling the same spot at the same altitude... Kinda hard to understand how this has been allowed.",
        "Here are a couple of other related links.   This is another analysis:  https://youtu.be/rumZ1jc74f4",
        "So sorry for the loss of your friends, May the Rest in Peace.",
        "Sad loss of many old  hands flying these rare aircraft, and the loss of another B 17. Thanks for your analysis Juan.",
        "Well done sir. \nBruce Frazer",
        "Analysis - somebody didn't think to themselves: \"these are priceless; should I let them get anywhere close and should I let them cross patterns ever?\"",
        "So sad and so ironic that the pilots safely delivered thousands upon thousands of passengers in their airline careers only to perish in an airshow.",
        "My love of these planes and events was tempered three decades ago when my young daughter was almost sliced in half by airplane crew who actuated bomb bay door closure while she was standing on the ground looking into the bomb bay whose doors flanked her. Good thing that the doors close slowly with a noticeable whine and that she reacted quickly to my yelled instruction to duck. It astounded me then and still now that procedures either did not exist or were not followed, such that the footprint of the plane was not under direct observation and control before cockpit actions were taken, particularly as civilians were present. The incident caused me great loss of respect and confidence in the operation of these events.",
        "Very excellent presentation of the FACTS and using the models for us to see what the pilot saw was very insightful. Good job!",
        "Juan, you have hit the nail squarely on the head. I was an Air Traffic Controller in the Marine Corps. From the first videos of this accident that I saw, I couldn’t understand why so many aircraft were allowed to fly in such close proximity to each other…oh I know the idea was to give the audience a glimpse of wartime reality, but IMHO the margins are much to close and did not allow for any deviation…and unfortunately that’s exactly what happened. Once again you have provided a concise view of what happened in a manner that totally respects the loss of these fine men on Saturday. May God be with their families and the CAF family in general in this terrible tragedy. Thank you again Juan! You are the best!",
        "Terrific job, Juan, on producing such a well organized and illustrated explanation of this tragedy. The concise information is a tribute to those gentlemen lost. Sorry for your personal losses.",
        "Thanks for your explanation. I was wondering if you flew with or knew any of the former American Airlines pilots. Definitely a sad day and a loss to the aviation community. Thoughts and Prayers for the family and friends of these gentlemen. RIP",
        "Shouldn't someone be aware on the ground and be able to advise pilots of a dangerous situation developing?, I guess I am asking was there ground coordination taking place and where they in contact with the pilots?",
        "Well said sir! RIP aviator's!",
        "Would have been much cooler if the B17 had crashed into the middle of the crowd.\n️",
        "Dude, this was absolutely brutal. At extreme times like this we all want a little bit of clarity. Typically, that’s so hard to find.  Thank you for sharing your analysis and providing some insight. I’m sure I speak for everyone in hoping for a safe way to continue to share these beautiful birds without the risk. Praying for those families.",
        "So sad six guys have lost their lives. For the love of flying, condolences to the families.",
        "The world is running out of B-17's.",
        "Sadness doesn’t begin to describe this horrible accident. My sincere condolences to the families of all involved, and to you Juan, I know you lost some great friends this day. Prayers for all.",
        "Wow,  detailed report.... thanks Juan...so, so very sad! One key phrase that echo's was \"...in 2021 the fighters where ABOVE the bombers in groups of three\". A friend of mine was a pilot in the B-25 that day behind the B-17 and saw the accident....a good young man who works as a Gulfstream pilot , so thoughts to all the survivors as well. RIP Great Airmen!",
        "This is whitewash. Still looks like it was intentional to me. The vector of the P63 looks unrecoverable. You can't see when your right over something but you most certainly can all the way there. It's not like these guys were flying blind.",
        "All this is very well, but all visuals lead to the most unfortunate conclusion: the King Cobra pilot deliberately suicided his P-63 into the \"Flying Fortress\" for personal reasons we may never know. Watch the crash video again, especially in slow motion, and this explanation becomes not only apparent, but self-evident.",
        "It made me sad that this happened. ~R.I.P. All Pilots & Crew~",
        "8:40 -- Back in the early 1970s Grumman launched their \"Boredom Fighter\" series of the \"AA\" and \"TR\" series plane models that they inherited when they bought American Aviation.  The \"Boredom Fighters\" differed from other little Grummans mostly in the camouflage/quasi-mliitary paint scheme, and were largely intended as a way to draw students from Cessnas and Pipers by offering a more adventurous image to training planes.",
        "God bless you sir for that Information and effort into the video.  Well done.",
        "Sadly loss of both personnel and flying museums.  May God be with their family and friends. ",
        "No altitude separation for the bombers and fighters sounds certifiably insane.",
        "If I'm flying this pattern in the smaller plane and I realize I have lost situational awareness, what would be the proper course of action? Should I pull up and out of the pattern in a direction where I have good visibility?",
        "Thank you for alluding to what caused this accident, Juan.  I'm not a pilot and have waited to say this, but it's obvious what created this tragedy.  I didn't know any of these people, but this accident has given me the blues all the same.  “Any man's death diminishes me, because I am involved in mankind; and therefore never send to know for whom the bell tolls; it tolls for thee,” John Donne, 1624.  Respectfully, Steve",
        "Aviation is metal.",
        "It's pointless to speculate at this point. We'll let the NTSB give us a thorough explanation.\n\nWhoever based on the above pattern, having two paralleling loops at the same altitude that converge seems flawed by design.",
        "Thanks for this detailed analysis. My condolences to the family and friends of those who perished in this tragedy. I am sure they would all be happy if we continued on to support the commemorative air force and their mission to keep the planes of WWII flying as I surely will.",
        "I still don’t get why they where flying at the same elevation it just seem like an unnecessary risk or just being stupid",
        "Waiting for your comment Jaun and all the others you getting information from. Lost track of what happening. No real estate to abbort. Safety rules written in blood. Your personal loss of frienship.",
        "Unfortunately all that was needed was a tiny bit of luck ! But sometimes it’s just not there ! It’s always hard to accept that you have all these experienced pilots lose there lives in an aircraft ! My Dad who was a TWA 747\nCaptain would always say a little bit of luck goes a long way in aviation !I myself retired from the regional airlines with 25000 hrs and I can say ",
        "Maybe an ego got in the way of doing the correct thing given the situation.",
        "Wouldn't doing that drop under maneuver also push him out past the dead line",
        "So clear. Thank you for the video.",
        "Not enough practice for this \"formation\" display ? Very sad...Altitudes should have been different for both types.\nSo sorry for those who lost their friends and loved ones.",
        "I have always believed it takes 3 things to be out of order for somthing real bad to happen.im sure there are other people that believe this too.just from what I see there was to many planes in the air at one time.now that's 1# the problem with humans as we get complacment.take things for granted",
        "Juan, thank you very much for doing this video! I know it was not easy as it left all of us very sad. Ironically when I saw this accident I immediately thought of your knowledgeable perspective and knew you could explain it to us non-pilot types. Your videos are always greatly appreciated. I will now say Rest In Peace to these fine gentleman and aviators. God Bless their families and friends.",
        "G'day Juan, When I viewed imagery of this deeply disturbing fatal incident; it was a lack of S.A. on the part of the fighter aircraft, that flashed through my mind. Being ex-RAAF, I'm fully aware that crash analysis should be left to the appointed authorities. I deliberately waited until you posted your thoughts on this tragic event. I was totally confident that your comments would be of value and, of course, respectful to all those involved. ",
        "I realize my opinion regarding this incident isn't going to be very popular. This was a sad, unnecessary loss of life and should never have happened. Mixing arcraft",
        "When planning these shows, does the airboss have the ultimate authority?  Or can the pilots flying offer input to counter one person's thought process? There needs to be a margin of safety built into these shows. And I doubt the spectators would notice. I love airplanes and a good show. But let's get smart and safe about this.",
        "A second thought, concerning these old warbirds and their dwindling number...I wonder if it is time to limit flying displays; by that my meaning is to have only one at a time in the air for a few passes, this to allow time for all to get some air/photo time. They carry tons of history and I feel it is important to honor the past crews who used them to defend our country. Any loss of life is tragic but losing these aircraft is another kind of tragedy, a loss of living history so to speak.",
        "Great Great demonstation. Unfortunately, I live 10 minutes away from this fatal crash and have been devasting to everyone. Praying for the family of the deceased.",
        "Save lives quit putting more than one plane in air at time.",
        "Flying at the same altitude makes my thesis, as follows, an easy get.\nThe fighter was inside the bomber, and overtaking it, on a tighter radius inside and closing aspect. At some point, in a reverse video, we see the Bell ship at the Boeing'S",
        "Thank you for your steadfast class and respectful conduct in sharing this with us, Juan. Your imaginative and simple, accurate use of the models to demonstrate the visibility limits was spot-on. Your brief demo would go a long way to educate a lot of the public, most of who would likely appreciate such a graphic, credible explanation. Also, to very much agree with 'rightmarker1's' comment below, it would shut down a lot of the shameless, know-it-all blogger trash which pops up within seconds of tragedies like this. Each of those gents now rests in peace, and I wish their families the strength to cope with their loss.",
        "At least they were vax'd.... it could've been worse",
        "I absolutely hate the double-standard, even if I'm guilty of it to some degree. There is a lot that can be said about it, but I think the most important thing to note is that these companies run on money. DO NOT pre-order the game. You aren't helping them make your game any better. You're paying for a promise that they'll deliver, with no guarantee that they will.",
        "From both the videos and the ADSB data, it looks pretty clear that the P63 pilot was going to pass the “deadline” in a major way. He had too much speed on the Mustang, the Air Boss saw it and cleared him to take the lead, but I think he had already lost sight of the Mustang also. In extending north, he was coming at the dead line at about a 30 degree angle. It would have taken about a 15 G pull to have not violated the crowd space. It appears that just before impact, he’s barely pulling any extra G at all. The CA has been pulling this crap for a number of years and, sadly, they’ve paid the ultimate price for their hubris. If they’re still allowed to do this type of exhibition in the future, the bombers need to have a hard ceiling and the fighters need a hard deck separated by at least 250 ft. RIP brave men.",
        "Juan as usual, you do a great description of what most likely caused the crash. You didn’t show the video of the crash over and over as others have done. Sad to hear that you had a personal connection to those lost. Take care and look forward to hearing more on this from you.",
        "Only 1 episode left tomorrow! I hope you guys are ready",
        "I'm no pilot. But flying all those planes at the same altitude is just nuts.",
        "How many more operational B-17s do we have left in the world?",
        "Lack of vertical separation.  Was the fighter pilot incapacitated?\nRest in peace",
        "The P-63 was turning right with a high left wing which also took the bomber out of his view.",
        "because of all these air show accidents someone need to step in with some type of protocols.  Such as separation and altitudes. they seem to be different at different shows. Sometimes egos get in the way of safety. I elect you Juan.",
        "What a breakdown and understanding of things.    Thank you.",
        "How awful...  thank you for this succinct analysis.",
        "Excellent debrief of what we saw captured on film.  We will learn more in the months to come, because we know there will be a chain of events which aligned passing through the  “Swiss cheese holes” in the barrier block.  Let’s hope the knee jerk reaction isn’t the end of warbird flying.  I am confident none of these pilots would want this to be the end of what they devoted their lives to do. RIP.",
        "Thank you for acknowledging all six crewmen who died in this accident. So many pages are only acknowledging the three pilots, when three more souls were also lost.",
        "SAD event! God bless all of the loved ones, of those lost.",
        "Thanks for the video.",
        "Thanks for the initial explanation Juan. I've watched the video on another channel and that coupled with your presentation of the ADS-B info is stunning. This is tragic and my heart goes out to the family and friends of those that lost their life entertaining others.\nThings that I don't understand:",
        "I'm sorry for your loss, too, Juan. :/",
        "Just WoW.. Lets just stop arm chair quarter backing this event.  You tell the story from a perspective from someone's camera from the ground. Release the cockpit audio before the moment of impact  Until then everything is suspect.",
        "Thanks Juan. I am still torn up over this crash and I didn't have any relationship to any of the people we lost. Just such a sad one, only thing I have thought of as a somewhat silver lining was because they were at a low altitude it was all over with before they had much time to think about it. This is one of those crashes that will stick in my mind forever my condolences to everyone who lost someone in this rare kind of accident but I think the entire aviation community is grieving over it even if we didn't know these people personally I know I am truly saddened by it.",
        "May they rest in peace. No matter whose errors were made, six lives were tragically lost, and that is all most of us really need to know. Hopefully steps are being taken to ensure that this will never happen again. Thank you for your analysis of the accident.",
        "A plane on the wing does not turn unless the pilot pulls back on the stick. The conclusion is Capt Hutain born in 1958 had a cerebral stroke or a heart attack.",
        "I am very sorry for your loss, as a colleague of Len Root. Life gives us the opportunities to do the things we love to do, however dangerous it can sometimes be.",
        "Thanks for sharing and sorry for your loss.",
        "Nice analysis. Visuals with the scale models really makes clear what was evident in the videos captured from the ground. The fast-moving P-61, banking into a turn wouldn't have seen the B-17 until a fraction of a second before collision. Very sad loss of dedicated pilots and historic aircraft.",
        "Seemed like p63 pilot was flying at a phenomenal speed at the time. If he wasn't sure of his position surely better to slow down & take stock of the situation. Who knows, wild speculation on my part. Truth will out eventually. \nWouldn't it be better if they'd designated a lower altitude for fighters to make it easier for them to see the bombers?",
        "Day 1 of Navy flight training - \"everyone is trying to kill you, including you\". Overhead the ship, case 1 recovery, there are aircraft of all types stacked 1K apart. You MUST do constant belly checks to make sure you're not going to hit someone. This is BASIC airmanship. The same in dogfighting in a multi aircraft environment - if you're closing on someone's '6' you do constant belly checks to make sure someone else isn't doing the same thing. Aviation is a self cleaning oven. This is an absolute tragedy but one that was absolutely preventable.",
        "So sad, but was avoidable. Would be interesting to see the Risk Assessments for this display. Hopefully lessons learnt, albeit late . RIP",
        "Same altitude, different speeds. Insane. A huge tragedy for the pilots, the families, and the historic aircraft. Such a shame.",
        "I know these men lost their lives being warriors. I wish to pay my respect to these gentlemen and thank them and their families for their service to our country. I’m sure these gentlemen will be missed.",
        "As good of an explanation of a complicated situation as can be expected of anyone. Thank you!",
        "Is that Dale Earnharts twin brother",
        "Russia go!",
        "Man, two pieces of aviation history lost forever.\nOh yeah, and I guess those 6 guys too.",
        "Let me start by saying....I am not a pilot, but love history and  old war birds.......from what i gather here by many people way more knowledgeable than i.....and looking at it from a novice point of view.....I believe that flying all these planes at the same altitude is ludicrous.....also what caught my eye from other airshow that the sky was crowded.....and too many planes at the same altitude does not make much sense.....people say it is ultimately the pilots responsibility to speak out if he feels it is unsafe.....it would be interesting in speaking with the other P-51 pilots to hear their opinions of all flying a the same altitude.....another thing I would stress here is that pilots are people....and people will make mistakes.....no matter how well trained or how many hours they have in that particular aircraft.....sometimes those mistakes allow you a do over....sometimes it does not.....who here can honestly say that they never made a mistake....or a close call ? If you are honest with yourself....not many....from what I am hearing....the P-63 pilot was a professional in every way, but he made a mistake going 300 mph  same as Thomas McGuire did .....same as Dick Bong....same as Don Gentile.....all we can do now is wait for the investigation correct the problem and prevent this from happening again....may they all RIP and they died doing something they loved.....not from COVID or from a heart attack,cancer, car accident dying in a robbery....they died doing what they loved.....i hope no one is offended by my comments.....and if you are....my sincere apologies.",
        "Juan, I am so heartbroken to know that you lost Len in this avoidable tragedy. Words can't express it. Your video is perfect, as usual. Your professionalism and character come through the most at times like these. RIP, gentlemen.",
        "Truly an accident.  An outstanding demonstration for the less informed such as myself.  Now the challenge is for everyone to learn from the mistakes that occurred on this sad day.",
        "This one really hurts. They all hurt.  My heart goes out to all the families and crews impacted by this mishap. May they all Rest In Peace. Damn.",
        "In total shock. Prayers for those friends and\nfamilies. Peace",
        "I watched another head on video that showed both P51s passing the bombers with about a 500 feet horizontal separation.   The video also stated that the fighters track was 500 feet inside the bomber track and that the fighters line was marked on the ground and the bombers were using the runway to establish their track on the south - west side of the runway.  This is very similar to the procedures we used when my C-130 did demo flights while on Thunderbird Support missions and other airshows.  And other civilian and military airshows I was involved with through out my flying career.",
        "The primary requirement to be a pilot is wealth. The primary requirement to fly warbirds is extreme wealth. The end.",
        "as always... great job... sorry for your loss of a friend.... my observations from the collision, the B-17 crew were gone before the aircraft hit the ground due to shrapnel. I doubt they had any idea what happened.",
        "Man, this is a tough one on a hundred levels. Very sorry for your personal loss, Juan. Thank you for a sensible analysis of the accident amidst the noise and conjecture.",
        "Thanks Juan for bringing some clarity to a very unclear situation. RIP to those who perished, and condolences to their families.",
        "Such an excellent explanation, especially how the smaller plane could have been in a position where the pilot could not see the B-17.  Your demonstration with the model planes really helped me to understand.  Such a terrible tragedy.  Maybe not for others, but for myself,  I could be happy just seeing a B-17 taking off, flying around, and landing without all the other planes flying around together at the same time.",
        "I knew Terry and Len; Terry was a 777 check airman when I was on the 777. Fair, straightforward, with none of the typical bullshit that seems to make the rounds in the schoolhouse. It was a treat to show up for recurrent and know Terry was giving you a checkride. I knew Len when he was on the 737; he helped my wife out numerous times when she was heavily involved in doing mission trips to Guatemala. Another great guy.",
        "Sorry you lost a friend and  check airman RIP.",
        "So tragic. The avoidable part is so tough to take. So, i surely stand with those advocating a closer look at co-altitude (esp. with dissimilar speeds, aircraft type) in a low altitude pattern. Let's hope NTSB recommendations will enact changes that honor these gentlemen and save some future souls.",
        "Thank you Juan for sharing from experience what likely took place. I hear the pain and stress in your voice. This one hurts more than usual for us all.",
        "Thank you for doing this. I was as horrified as anyone upon learning of the accident and knew that you would provide a detailed analysis within days, and you have. Thank you for helping so many of us understand how this could have happened, even if we are not all pilots.",
        "Poor B-17 and P-63.",
        "Great analysis... It is sad that some of the basic formation rules got ignored and this tragedy happened... Some great men have paid the ultimate price and our prayers are with them and their families...",
        "well done sir.. great explaination... the p63 speed was very high as you said... respectfully done..",
        "I cant convey enough sympathy for the loss of your fellow airmen and friends Juan. Wishing you didnt have to do this one. ️️",
        "First off, I'm so sorry that this occurred, and blessing to all of the families and friends of the deceased. I have a thought that I did not hear mentioned. In the video I can see the B-24 in trail of the B-17. Possibility that the pilot of the P-63 mistook the B-24 for the B-17 and thought he had plenty of room? Both four-engine bombers. Both blending in with the ground. Confirmation bias can be very powerful. Sometimes we see what we expect to see. Nice job with the video Juan.",
        "Thank you for the recap on these tragic events. Peace be with the families and friends who lost loved ones.",
        "Wow! As usual, excellent, especially about the formation flying rules. I am SHOCKED they were flying those airplanes, with the speed differentials, at the same alititude during the parade. I have been to Chino multiple times and they ALWAYS fly the slower, heavier stuff at a different altitude than the fighters...  Also, the fighters should have never been inside of the bombers, I would think. R I P to all.",
        "After an aviation incident,accident,media(youtube) is flooded with speculations, even if nobody knows anything at such a very early stage. Maybe just for chasing sensation.\n\nIf you want to hear precise,objective, b.s. free,factual analysis, you simply wait for the video on subject on blancolirio channel. ",
        "Thank you for the flying lesson...   sorry for the loss of these friends.",
        "As always Juan, an excellent appraisal of this tragic accident. Especially hard for you as you have lost a mentor and friend. As a 40-year military and commercial pilot with fast jet display experience, the fact that both patterns were apparently co-altitude just beggars belief. As you explained so well, joining on the inside of the turn at low alt gives you absolutely nowhere to go as far as safety is concerned. My condolences to all the families of those lost, but there will be lots of questions raised by the bereaved families as to why the planned vertical separation between the fighters and the bombers was so inadequate considering the sheer number of aircraft in the sky that fateful day.",
        "Thanks for this well thought out analysis of the mishap. Sad to say that Craig may not have even known what happened. He must have been too locked in on the P-51 and then the low visibility, he had no clue he was that close. Prayers for the families. Many people heart broke there.",
        "4:50 - 37mm m4 cannon, I believe you said 70mm. Thank you for video, Sir",
        "A terribly tragic accident.  Not just for the loss of the six experienced pilots, but also for the two historic planes.  May they all rest in peace.",
        "I'm so sorry for the loss of your friends on the B-17.  I've had line checks with Craig as a check airman.  He was a great pilot; his grin and sense of humor were infectious, and he was just an overall nice guy.  The worlds of both airline and airshow aviation lost a lot on Saturday.  We'll miss them all.",
        "This video hurts all of us, we lost 6 invaluable aviators, and 2 irreplaceable war birds. I'm not trying to echo what has been said but if so,  it's worth hearing again.  Juan's respect, knowledge, professionalism, facts, and opinions are extremely valuable and indispensable to this community . I also appreciate all the smart people who post comments too,  you add even more value to these videos, keep it going y'all. ",
        "just imagine in WW11 400 of them planes in the air at the same time..",
        "Excellent synopsis; however the P-63 has a 37 millimeter main gun firing through the propeller, not a 70 millimeter gun",
        "Excellent commentary Juan, thank you for sharing your experience and insight with us which sheds light on these tragic events.",
        "Why make excuses, we all saw the guy fly straight into the bomber. Was not paying attention. Did not look where he was going",
        "Lorem culpa mollit et ipsum velit tempor nulla pariatur labore do.",
        "Nice job…as usual!!!",
        "The Men on the plane: OH SH**!",
        "I am upset for those who have passed… they should have had the right to walk away from a wonderful experience!",
        "Now the lawsuits begin.",
        "I’m an amateur novice, and well…you can see in the video, the Cobra was coming into the B-17 at a heck of a closing rate, looked to be as much as possibly twice the airspeed of the B-17.",
        "Looked intentional to me. ️",
        "I have been patiently waiting for your report Juan. No nonsense, just facts. Thanks.",
        "Thank you so much for the knowledgeable, informative presentation.",
        "Thank you for your report Juan. It seems unbelievable to me that there was no altitude separation between the  bombers and the fighters during the parade. A truly tragic crash with too many lives lost. My heart goes out to the families.",
        "I wonder what some of the other pilots are saying about what their requirements were throughout?",
        "Thanks!",
        "Thank you for some great information adding crcial details to the conditions leading up to such a sad and needless event.",
        "all so avoidable.",
        "I never really understood how traumatic being a pilot can be. You know a lot of people that perish tragically. RIP",
        "Thank you for your respectful analysis. I also lost an old friend from my CAP days, Curt Rowe, in this disaster. I agree with everything you said. My main question from the beginning has been why there was no altitude separation between the bombers and the fighters. I have many other questions about communication, airspace congestion, etc, but I’ll wait on the NTSB report before making further speculations.",
        "Thank you for the excellent dissection of this terrible event.\nGod bless.",
        "So, in a nutshell, \"Pilot Error\" was the. cause.",
        "I think that not only could he not see the B17 as you alluded to with a clever demonstration, but I think he was also watching the P51's in front of him that he was trying to shadow. I think they'll learn from this tragedy and make changes that will prevent it from happening again.",
        "Thank you so much for this. I'm not a pilot, my late brother was and my husband has studied flying (unable to get the ticket). I knew enough after seeing that particular parade for many years. The explanation helped a lot. I'm heartsick that this happened, may peace come to the families and air community.",
        "Juan, as an Aviation Enthusiast and an A & P since 67 & 40 of those years were in multiple military roles. I did participate as an accident investigator on two Class A Mishaps with fatalities. I praise those investigators for their unbiased investigation and looking at All aspects of the incident. I love it at air shows and talking with the air crews. My first emotional response to this news was a Very Sick feeling in my stomach. These moments are always heartbreaking, and this one is no no different. Your Knowledge in the aviation industry & the art of Piloting. Your explanations are easy to understand to the general public. I understand that you knew some of these folks. Your unbiased observations are exemplary. Thank You &,I wish to add my Solomon & Sincere Condolences to ALL who have been touched by this Tragedy.",
        "Always enjoy this guy's videos. Been watching since that dam failure in Cali a few years back.\nKeep the good work and my condolences for the loss of you friend and coworker, Len Root",
        "Sad to hear the loss of all the crew and the 2 planes",
        "fighters eat bombers for breakfast",
        "I’ve been waiting for your analysis on this. Your analyses of aviation accidents is, imho, the best and this is no exception. I trust some of the idiotic analysts of this tragedy we’ve been subjected to will now STFU. Thank you JB. Utterly professional as always.\nRIP all those airmen.",
        "Warbirds need to stop flying in formations; especially mass formations.  These are a bunch of old timers that don't have the reflexes nor the experience to be doing this type of formation flying.  I'm sorry - tragic loss of life - but that's a fact.  At this rate we'll lose all our warbirds to pilot error.  Note: I think there have been TWO B-17 crashes in the last couple/few years; B-17 CRASHES!  IF we fly these old warbirds - send em up around the flag pole and get them on the ground - safely.  This WWII reenactment crap needs to stop.",
        "Thanks for this informative video. \nMy thoughts and prayers are for the five airmen lost, and also for the Flight Director (‘Boss') who, even if cleared of any fault, shall have to live under the weight of this accident. \n     The analysis of this video is close to that of an Australian YouTube channel [‘’B17G and P63 collide’’ by Animarchy History]. Both hypothesize (with strong credibility) a wider turn made by the P63 to avoid the preceding P51, with no visibility on the B17 from the P63 pilot. ",
        "so sad... I hate that things like this happen... I've been waiting for this video... thanks for all that you do to help us understand the basics of these sad events...",
        "My Thoughts and prayers go out to the families of the lost.prayers from England.\nFrom the grandson of a WWII RAF Heavy bomber pilot,",
        "I'm sorry this happened....\nThank you for allowing me to understand this event.. \nI'm sorry for the loss, friends and family."
    ],
    "comments_disabled": false
}