{"video_id": "C342dfNPCyg", "comments": ["Thank you for the respectful treatment of this terrible incident.  Rest in peace to the men who brought us history and shared their love of aviation.", "Thank you for this detailed and comprehensive report of this accident. Gives us all a much better idea of what occured. A tragic loss for the aviation community.", "I like the way you held the models in front of the camera. By doing this you brought a whole dimension of clarity to situation that I would not normally have seen.", "I knew Len Root from Texas Soaring Association.  A great guy, true professional.  He will be missed by all of us.  Craig Hutain was one of my check airmen when I upgraded to Captain on the 737.  Hard to believe their fates came together like this.  Juan, you make an excellent point about the lack of altitude separation--but it's amazing to me that a professionally run organization like the CAF would not insure complete separation between these priceless aircraft and their even more valuable crews in the name of an airshow performance.  If they did not plan to separate the participating aircraft in one or more of three dimensions (vertically/laterally/longitudinally), I will be shocked.  They plan and brief the heck out of these things, as you mention, and I just can't believe the show could have been organized so sloppily.  Just tragic.", "Juan, thank you very much for doing this video! I know it was not easy as it left all of us very sad. Ironically when I saw this accident I immediately thought of your knowledgeable perspective and knew you could explain it to us non-pilot types. Your videos are always greatly appreciated. I will now say Rest In Peace to these fine gentleman and aviators. God Bless their families and friends.", "Thank you for your explanation. As a non-pilot but someone fascinated by aircraft and air shows, I love your easy to understand and logical approach.", "I’ve been waiting for your analysis on this. Your analyses of aviation accidents is, imho, the best and this is no exception. I trust some of the idiotic analysts of this tragedy we’ve been subjected to will now STFU. Thank you JB. Utterly professional as always.\nRIP all those airmen.", "Juan I’m sorry you lost someone who was part of your journey. Your treatment of every incident is always both insightful and respectful. Your models (OK, sometimes Pete’s as well) show where pilots were in the situations you’re explaining and your wide experience informs us of what they were probably thinking and trying to do. Congratulations to you for always producing great videos", "Thank you, Sir, for the analysis. Especially due to the personal connection you have with those lost. Terrible tragedy for the community. This event, though terrible, illustrates the risks faced by the B 17 crews and their escorts in WW 2.  Thank you for the professional forensic report. Please accept my condolences on the loss of your colleagues.", "Thank you for your work, Juan. I am not a pilot and found your site several years ago during the possibility of the Oroville Dam collapsing. I have great admiration for pilots and the old planes. When I heard about this accident, I went looking for your site to get the updates. You and the flying community are in my thoughts during this heartbreaking time. I appreciate the brevity and the respect you bring to this incident and to the family of the flyers involved in the crash.", "So sorry for the loss of your mentor Juan, and the rest of the pilots as well. Just a terrible terrible tragedy. As with all aviation accidents, there is a lot to learn from this. Lets hope that in the end it will make airshows safer for these irreplaceable pilots, and aircraft. My heart goes out to the families and friends of the victims. Blue skies gentlemen. 🇺🇸", "Thank you for doing this. I was as horrified as anyone upon learning of the accident and knew that you would provide a detailed analysis within days, and you have. Thank you for helping so many of us understand how this could have happened, even if we are not all pilots.", "Juan, let me echo others' comments on how you handled this first look. I know this one hit close to home, but you still maintained an objective viewpoint on what you feel to be the most likely cause of this terribly tragic accident..", "Thank you @blancolirio for your professional coverage of this.  This cannot be easy considering how many of the pilots you knew, flew with, and learned from.  We all need to learn from this, and that’s going to take honesty and humility.", "Fifty years in this flying game and your analysis is very plausible and well explained.  It will be interesting when the NTSB releases their report to see if they concur. This event is a major double whammy as we lost six great aviation people but we also lost two aircraft that will be surely missed on the vintage airshow circuit. Let's hope we learn from this and ensure that the loss of personnel and aircraft will not be in vain.", "Thank you for the clear explanation of a horrible accident and my sympathy to you for the loss of a friend.  The air boss has some tough questions to answer. I think the toughest one is going to be the lack of altitude segregation, especially since the 2021 clip clearly showed that it had been done before and effectively.", "I'm not a regular at this channel but do watch occasionally. I find these videos to be very well spoken respectful and educational. So sad to hear about this terrible accident.", "Very professional analysis of a horrible mishap.  I have lost a number of friends, a couple in midairs so I know how heart wrenching it is trying to understand it all in the aftermath.  We’ll just have to wait as it all shakes out.  Condolences to you and all their families for this terrible loss.", "I know for a fact that the P63 pilot was very sensitive to the crowd line. He was at ground zero in Reno in 2011 and was spared by a few feet. People standing directly next to him vanished in an instant. One of the most respected and admired aviators most of us have known or flown with. A true gentleman and the best friend anyone could ever have. Blessings and prayers for all affected. RIP Craig", "Thank you for putting this together and helping make some sense of what went wrong. I was planning on going but cancelled at the last minute. I attended Wings Over Dallas in the past, and it was a great show.", "As always Juan your reporting on this trajic accident is professionally done. Prayers go out to the families and friends of those lost. Rest in Peace gentlemen!", "Thank you for your insight on these videos. I am very sorry for your loss and the other pilots that lost their lives. Condolences go out to the families!", "As always, you are the consummate pro when explaining these things with honor and dignity, Juan. Thank you so much it’s much appreciated.   I lost a good friend at Reno years ago, Rick Brickert in the Pond Racer. These tragedies are not easy to stomach. Thanks again.     Jack Northart", "So Tragic! Thank you Juan for the explaining what happened. Sympathy to all families and friends of these men. May they RIP and may we learn from this accident to make the changes needed to prevent this from happening again.", "When you work line maintenance for a major airline you get to meet and talk to a lot of these pilots when you perform 'daily checks' or other maintenance on their aircraft, and time permitting you get to chat with them for a few minutes. I remember Terry and always enjoyed talking to him when he flew through our fair city. You couldn't meet a nicer guy! My heart breaks just thinking about it. Thoughts and prayers for all involved in this tragedy.  ", "I just learned a lot. I was a patrol plane (P-3) pilot in the Navy. I now have even greater respect for my shipmates in the tailhook community. Thanks.", "watching this makes me realize even more how much u and other youtubers & influencers go through and dont let their fans know for them not to worry. ur the most genuine person. i wish u and ur family the best always!! loved this video hands down one of my favs! thanks for being so vulnerable with us.", "Thank you for the succinct explanation of this horrific accident. As a non flying enthusiast its great to get an early view of the events leading to this accident. I have attended airshows for most of my 73 years and always marveled at the expertise of the demo pilots. Regulations for performance have tightened over my lifetime and maybe once this accident has been investigated there is a good chance that dissimilar aircraft will be separated by a greater altitude variation in future.", "Excellent and sensible analysis of the tragic events.   Your clear and logical explanation of a couple of formation issues was illuminating.  My hope is that there are solutions that do not shut down these kinds of demonstration flights.   Thank you, Juan.", "Juan,  I was waiting for your report on this.  I'm so sorry for the loss of these pilots.  It is more difficult when you know someone involved.  Thank you for your professionalism in your reports.", "So sorry for your losses.  I am not a pilot but your explanations of these events makes all the variables so crystal clear.  Thank you for what you do.", "I have come to always appreciate your detailed breakdown of situations such as this.  Thank you for sharing your expertise of such a tragic accident.", "One of the best things is that he never takes credit for himself when he achieves something. He always respect us, the audience, and his team, and he is always polite in all of his videos. We congratulate ourselves on this achievement. More to come and everything to come", "As always, an insightful and respectful overview of a tragic incident. Thanks for doing these.", "I'm sorry for the loss of your friend.  Doing this video was very difficult I'm sure.  These guys are to be commemorated for their passion for keeping these birds out there for people to see.", "Juan your review  is as professional  as ever. Sorry for the loss of your friend. In my life time in aviation there is usually  a reason for these tragic accidents and from them one learns a better way of doing things. Condolences  to all those airmen who died in this tragedy.", "As a former accident investigator, I know it is important to gather facts before speculating about what might be at cause. However, your analysis seems very reasonable and spot on. Lack of lateral and vertical separation, combined with visibility difficulties are likely links in this chain of event. As always, tragic and all of us are heartbroken. Loss of fellow pilots and friends always hurts. That said, understanding what happened is essential to prevent it happening again.", "Thank you for a well done video. I’m sorry for your loss and the loss of all the victims of this tragedy. I’m not a pilot but, I think you did a excellent job explaining this accident. I thought the same thing when I saw what happened. Thanks again and God bless the families who are affected.", "My deepest sympathies to family, loved ones and friends of these 6 pilots.  Not one of these pilots started their day thinking this would be the last one.  They truly were doing what they loved and bringing tons of joyful nostalgia to old and young alike. May our Heavenly Father grant peace to so many that are heartbroken at this time.", "Thank you for your insight and sensitivity in explaining all that was happening during this tragic accident.  I have learned some valuable lessons that will help me in my flying", "Thank you for the insight, such a tragic loss for all involved. Prayers for all the families and the loss of your friend. My heart breaks for such a pure accident.", "Thank you, Techno, for making my childhood so much better.\n\nRest in Peace, Potato King.", "As always, this channel provides the best analysis I've seen in the past couple of days, without the need to replay the collision over and over. Very respectful. My condolences to all the families involved.", "Thanks Juan for another excellent analysis. I know this was tough for you personally, but your professionalism shown through with another well executed and detailed report.", "Once again Outstanding job explaining what might of gone wrong in this tragic case So sad people just doing what they love and in a split second they are gone but hopefully by looking at what went wrong we can  prevent it from happening again  I am so truly sorry about the loss of your friend and everyone else our thoughts and prayers go out to all the poor families that have lost a loved one and to everyone who was sadly lost in this  tragic accident may they all please RIP", "Condolences for your personal loss of a friend. Thanks for the excellent explanation of safe formation flying and how it likely was a factor in this incident. Sadly, we all make mistakes, and it only takes one in the air.", "My deepest condolences to all involved. What a tragic way to lose these great men and aircraft.", "Thank you Juan for the excellent explanation of how and why this collision occurred and how it could have been avoided. I could see and hear the pain you were feeling as you described the incident.", "A terribly tragic accident.  Not just for the loss of the six experienced pilots, but also for the two historic planes.  May they all rest in peace.", "Thank you for the explanation of this terrible accident.  My thoughts and prayers go out to all the families of those we lost that day.", "@blancolirio as always your videos are so thorough and helpful. I am not a pilot but I do like aviation. It makes no sense to me why safety is always put at risk. These are really talented pilots so why would they agree at such low altitudes and similar altitudes. It's such a shame this happened. I am also so sorry for your loss with Len. I can’t imagine what you are feeling. Take care", "I knew Terry and Len; Terry was a 777 check airman when I was on the 777. Fair, straightforward, with none of the typical bullshit that seems to make the rounds in the schoolhouse. It was a treat to show up for recurrent and know Terry was giving you a checkride. I knew Len when he was on the 737; he helped my wife out numerous times when she was heavily involved in doing mission trips to Guatemala. Another great guy.", "Takahashi leaves behind an amazing legacy. He created so many of the powerful cards we had as kids, but showed how powerful his dedication to helping others was, even though it cost him his life. RIP Takahashi; you could've sat on the sidelines and lived life easily, but you chose to risk your own to help 3 others live theirs. Cheers mate >:-O 8)", "What a terrible accident. Lessons will be learned, and I hope future measures will prevent this from happening again. Thank you, Juan for your contribution. I always learn something new from your videos.", "My heart felt condolences for the loss of your friends and the planes they loved to fly.  My older two kids and I were there that afternoon and saw the crash.  It was a beautiful day with so much excitement at seeing and hearing those beautiful planes and gut-wrenching to watch those few seconds of catastrophe.", "This is so sad! Strong of you to post this video with some explanations of the accident. \nI have never seen this air show but many others here in Sweden and in Great Britain. First of all it’s a huge lost in some great men how seems to have honor their life to the aviation and then it’s a lost of some iconic warbirds. ", "Man, this is a tough one on a hundred levels. Very sorry for your personal loss, Juan. Thank you for a sensible analysis of the accident amidst the noise and conjecture.", "RIP Len and all the others who lost their lives in this tragic accident. Thank you Juan, for giving an understandable breakdown of this incident.", "This was really well explained. As a non-pilot it helps immensely to understand the issues. Terrible tragic accident, RIP all. Thank you", "First of all JB,my condolences to the families and RIP to the pilots who were called up to the Heavenly Kingdom. \nYou ALWAYS do these updates with respect to all impacted.\nYou continually take your time to allow us to understand every aspect of these tragedies.", "Really well done, Juan. Super respectful towards the fallen airmen while giving us all a great run down of the facts so far ", "Thank you, Juan, for such a thorough and well-explained analysis of this tragic (in so many ways) event.  As one who was personally familiar with both this and the Collings Foundation B-17s, the loss of them both has left me sickened, but even that is not nearly as poignant as the loss of a personal friend, and my heart goes out to you.", "Juan, you really are a great resource of analytical and a compassionate analysis of even these terrible accidents. You bring a lot of facts that most of the public would never consider to light.", "Thank you for this explanation and the work to put it together. What a tragedy, what a loss. RIP", "So sorry for your loss Juan. I was a flight attendant for 13 years, and never went to an airshow because I never wanted to witness something like this happening. It is so sad for their families. I grieved the loss of one of my Pan Am co-pilots back in the 1980's who lost his life in an airshow. Tragic.", "Thank you for this update. I imagine you had a really heavy heart while making it. I fondly recall all my IOE Checkairmen over my career. They truly are special folks. Not running the heavies and fast movers at different altitudes seems like insanity to me. How do we separate aircraft with TCAS? Altitude! I have witnessed one similar warbird gathering years ago at Prescott AZ. It was not nearly as busy or had as many aircraft as this one seemed. How many aircraft were in the air in the parade at the time of the incident. Prayers for all the friends and families of these great men.", "First: Love your experience in all your videos\nSecond: This specific peace time formation of flying sadly reminds me of a visit the PIMA museum in Tucson AR.  In the hanger with their B-17 is a wall of banners in which each identify a variety of crews and their outcomes.  I had to ask a volunteer what the ones listed as 'crashed during assembly' meant, only to learn that it (though rare) wasn't uncommon for aircraft to collide and crash after take-off while running a circuit around the airport waiting for other planes in their group to get airborne.  The danger of close circuit flying is larger than that of straight high altitude bombing runs it appears.", "Great to see that Pete, like us as youngsters, loves his Airfix models! JB's technically sophisticated analysis and respectful coverage is valuable to all.", "I don't expect to ever fly anything more risky than MS Flight Simulator, but I actually had a chance to ride in the jumpseat of a B-17 alongside my dad about 10 years ago at a similar air show in Oklahoma. We got him the tickets for a retirement gift (he worked for the Air Force as a civilian), and we were both blown away by the professionalism of the crew as much as we were by the plane and the views. Always had a bit of a soft spot for those vintage warbirds since that day, and am so sad for the loss of these skilled gentlemen. I hope we can learn lessons from this collision that keep these historical artifacts flying safely for years to come.", "So sorry for your personal loss Juan. Thank you for your courage to give us information on this tragedy.  Be well.", "Your analysis is always really solid. Thanks for your work!", "Juan, Thank you for your comprehensive , thorough, and pin point analysis. I wish it  it helped me feel better about watching that event happen in front of my eyes but this is something I will never get over. I joined the CAF in 1977 at age 17 jumping out out the C47s reenacting the 82nd airborne Normandy jumps. That inspired me to learn to fly and 45 years later I have 20 months left before retirement from Delta. I had the privilege, honor and dream come true to fly for the CAF in the PBY Catalina and B-25 in the Southern Minnesota Wing, for 2 years and 4 years respectively. Also enjoying a partnership in an SNJ-4 With Don Hinz who spearheaded the restoration of Tuskegee Airmen(Red Tail).  For me it was all about giving back and honoring all of the men and women who gave their all for our freedom. Just like the men we lost Saturday who made the ultimate sacrifice for what they loved and believed in with all their hearts! It never gets easy losing friends and family so I pour my heart and soul out once again. God Speed to our family who go before!", "An excellent analysis of a sad event, Juan.  Your knowledge of aviation is essential in understanding the aircraft involved and the rules for flying in formation.", "Oh, Juan. No words can be expressed from this tragedy. I am so sorry for the loss of these brave men. Men who LOVED flying. Men who were honored to have the opportunity to fly such beautiful works of machinery. The only solace I have for any aviator (as my Texas hubby says) \"they died with their boots on\".", "Juan - That was a professional analysis by a professional pilot whilst keeping personal opinion aside unlike some other reviews on accidents that are riddled with personal projections. Your delivery was further the more professional considering one of the victims was a friend. The only way we will learn from these aviation accidents is with concise non biased analysis such as the one you presented. Condolences from Australia to the families of these remarkable gentlemen", "Another superb breakdown. Your level-headed and direct dialog is exemplary. It’s shocking that these aircraft were using the same pattern altitude. If this was planned it was designed for disaster. If it wasn’t the plan, there was obviously a great deal of miscommunication. Condolences to the families who lost loved ones.", "Excellent commentary Juan, thank you for sharing your experience and insight with us which sheds light on these tragic events.", "It must be very tough to do this kind of report when a friend or colleague is involved. Thanks, Juan, for your continued work.", "Other than the loss of a couple personal friends in light aircraft several years ago who were ex-combat and experimental pilots, this to me is the saddest thing in aviation since the Collier B-17 was a total loss, a plane that I flew in.\nI tell you Juan, if you love aircraft it's hard enough losing those two vintage planes, but also to instantly lose all the good men on board is beyond tragic.", "Despite the clear grief you're feeling over the loss of friends, this is a spectacularly clear explanation of what happened in this tragedy. It's exactly what I thought happened. Now lessons need to be learned as to why those aircraft were in those positions. Were rules broken regarding separation? It does seem strange they are all at the same altitude.", "Sadness doesn’t begin to describe this horrible accident. My sincere condolences to the families of all involved, and to you Juan, I know you lost some great friends this day. Prayers for all.", "I’d not heard of this awful tragedy (here in the UK I stopped watching and reading all mainstream news years ago) but this is a respectful and very enlightening explanation of procedures at such events. I’ve attended many such events here and always marvelled at the skill and dedication of those taking part.", "Thank you Juan for taking us through how this terrible accident occurred.  Sorry that so many good people lost their lives.", "I'm not a pilot but my dad was and I flew with him many times in a small 4 seater Tri-Pacer.  It is hard to pick out other planes in the air even when you know that they are there.  Just a terrible crash with the loss of life. Condolences to all affected.", "That's a great analysis and explanation. Thank you for helping us to understand this tragic accident.\nRespect and condolences to all involved. May they forever fly as free as a bird. ", "Excellent analysis, Juan.  The circuit looked confusing and I still don't completely understand how the separation controls were supposed to work.  I think the Mustangs and King Cobra's should have used a longer downwind and base (beyond center line) to ensure visibility of the slower bombers.  I know that would be less exciting for the show, but a whole lot safer.  God bless the lost pilots and their families.", "The very low altitude of the multiple aircraft turning and the difference in speed without any proper vertical separation is always going to be risky airshow aviation. You can be lucky most of the time but eventually your luck runs out. The fact the smaller faster fighters were flying on the inside of the circuit is incredibly dangerous, especially considering the 'situational awareness' you bring up in your breakdown.", "Thanks, this is a perfect analysis, I’m just someone that loves to go to the shows, and it’s a terrible tragedy for the families. I didn’t know that bit about the rejoin, but brilliantly explained that you have to dip wing and go under and as you explain with fighters and bombers at same level, there was insufficient space to do that. Thanks for your explanation", "How incredibly sad! Prayers to all of the families and friends of those who passed! RIP", "Thank you for a great analysis. Looks like the choreography of this show was very questionable to say the least. But most accidents are a cascade of bad factors so there is probably more to it to find out. What a tragedy for all lost and their families. ", "Extremely well done especially given the circumstances for the guy I feel really bad for him and all of his friends he lost.", "Dude, this was absolutely brutal. At extreme times like this we all want a little bit of clarity. Typically, that’s so hard to find.  Thank you for sharing your analysis and providing some insight. I’m sure I speak for everyone in hoping for a safe way to continue to share these beautiful birds without the risk. Praying for those families.", "Juan,  this was a very poignant and respectable review of this tragedy… Such tremendous loss of 6 very talented airmen. Thank you!", "Thank your work on this video. I'm also not a pilot, but the way you explained things made perfect sense to me. It just seems to me as if having the plans parading at the same altitude was a bad idea. Of course hindsight is 20/20. My prayers for the families involved.", "I am so heartbroken over this whole thing.\nI love aviation, I love these planes, and have nothing but respect for the people who make this all happen for all us to enjoy.\nSo deviating for the family, and for the group.", "Thank you, sir for your explanation of the crash.  I am so sorry for your loss and the families of the pilots and crew members.", "I'm sorry for the flight community's loss of these wonderful men. Thank you for your in-depth explanation; I know very little about aircraft so it's very helpful in understanding the situation.", "I knew Craig for almost 20 years in and out of work.  One of the nicest and most generous guys I’ve ever met.  Flew with him many times.  Just an all around great guy.  He was liked by many people.  What a horrible tragedy.", "Best failure analysis I've seen in a long time, covering a technical subject in a way a non-expert can understand.  And with great sensitivity to the tragic nature of the event.   My daughter flies for the USAF and I pray for her every day.  Condolences on the loss of your friend and thank you for your service.", "Very tragic incident.  Condolences to all of the families involved.  May we learn from our mistakes.  Thanks Juan."]}