{"video_id": "caVoqAfdkYQ", "comments": ["Do YOU even do anything, Drew?!?!", "the way to tell how much time has passed has never been easier than watching drews blue hair slowly turn more and more into a seasick green while his roots grow in", "Today was my last day in my Psychology 101 class and my professor put this video in her slideshow as an example of how she also gets really pissed off about predatory business practices like these. She loves this video and was really relieved to hear that everybody else is also sick of this type of thing.", "i bought something for my mental health that was $200 and has a monthly subscription of about $100. although its very pricey, it has absolutely helped my mental health! (its a cat)", "Watching Drew's cat in the background did more for my anxiety than any of these products probably would", "Hey, Drew. As someone who has suffered with extreme panic attacks and anxiety in the past, I wanted to say thank you for this video. My anxiety got so bad that I had depersonalization and derealization. This lasted for almost two years! Raising awareness of mental health issues and attacking fraudsters is very important and I truly appreciate your vulnerability, openness, and advocacy (this literally was an advocacy video dressed up as a commentary video). Thank you again!", "You should’ve just strapped an electric toothbrush to various areas on your body. Not only would that device generate soothing vibrations, but it also has a clinically proven ability to help fight plaque and gingivitis.", "Wow, Drew! You got smarter and smarter over the course of the video. At the start of it, you bought these dumb products and at the end you stopped buying these dumb products.\n\nThese things must work!", "Am I the only one that thinks Drew looks really good during the unboxing part with the messy blue hair and long sleeve black shirt and glasses idk man", "I love Drew's style around 21:31-21:41, with his messy long ish hair, glasses, shirt and his mood and expressions at that moment he looks like an overstressed virologist to me", "I love this two for one debunking of \"it's your fault you can't function because of your mental health\" and \"it's your fault you can't function because you didn't buy our product\". This video was a weirdly refreshing reminder of the seemingly obvious truth that neither is the case.", "I was worried that because this video is 40 minutes long, it wouldnt have captions. but it did. Thank you Drew for caring enough to bring subtitles to us so we could enjoy your videos better:)", "Funnily enough, my mental health went to rock bottom for like a month straight earlier this year and I went and rewatched most of drew's videos whenever I was having a bad time and you know what? They made me laugh so much during a dark time and made me feel okay for a bit. I don't need a stupid headband!....just a dude talking about said stupid headband (but yeah, love ya drew)", "One day i turned on drew gooden and my grandma immediately said “i hate this guy.” And i now i think about it everytime i watch him", "I find it adorable how Drew having two different hair colors fighting on his head makes him resemble Amity Blight if she was a grown ass man still throwing shade at Jeremy Renner lmao", "I really appreciate that drew and Amanda have the john and yoko effect where they start to look more and more like each other with every day", "Obsessed with how obviously poor Drew’s vision must be if he looks at the camera and his eyes are shrunken and miles apart. I love you Drew let’s have bad vision together forever", "\"Sometimes my brain forgets we are supposed to be on the same team.\" LOL that is so very accurate", "Am I the only one that thinks that Drew's hair looks really good? yes? well ok then.", "I'm proud of Drew for finally leaving his ninja phase, they really do grow up so fast", "Great video, but jokes aside I really want to thank Drew for talking so openly about mental health and anxiety. It’s so comforting to see someone with such a large audience discuss this stuff and raise awareness", "Thank you for openly and normally talking about your mental health it’s really confirming as someone with anxiety and just refreshing", "Hearing Drew talk about his own mental health genuinely made me feel a bit better about my own struggles being valid. Thanks drew", "Drew speaking about mental illness and anxiety like it’s something natural. Thank you.", "The transformation of Drew’s content over the years from ranting about terrible influencers to terrible products is amazing and seamless.", "I'm loving these honest long videos/ video essays. They're so thought-provoking (and I didn't need to spend half a grand to experience it!)", "I spent my entire high school watching drew so he’s so comforting to me. It’s nice to hear that other people get panic attacks and weird insta ads lol. There is rlly nothing more isolating than anxiety. Thank you drew for being so open you’re my comfort person", "I have as much anticipation and excitement for this kind of lets play as I would have before any kind of triple A Disney+/HBO series or high end cinematic at the theaters. Having this kind of content delivered in my feed for free is a real gem", "I just wanna say Drew looks absolutely stunning w the two colors fighting on his head and these beautiful glasses. This blue color, I didn't like it before but it grew on me and the way that his natural hair color is showing more under it, it's a whole vibe imo. ", "I love that Drew has gotten more and more jaded as he makes these purchasing videos", "Watching you comedically eviscerate these scumbag, predatory companies, who con desperate people suffering from very real mental health conditions was ironically extremely therapeutic! Thank’s Drew!", "Can we take a moment to appreciate how much work he puts into these videos for us", "Thank you for uploading Drew. I’ve had an extremely chaotic day today, and I couldn’t sleep. After this, I think I will be calmed down and I can sleep. Thank you.", "25:37 the cadence of his speech being in perfect rhythm with the device slipping down over his eyes like a pair of futuristic monolens sunglasses is very funny to me for some reason", "i do hope he’s doing okay, he mentioned a bad panic attack and also just seemed tired. it’s none of my business, but if he’s feeling down i hope it gets better soon.\n\n\n\notherwise, i really enjoyed the video! i always do. and i like the new hair but i think the bright blue really suited him LOL (he looks fine as hell while on the couch icl)", "Jokes aside, the fact that drew talks about his panic attacks in such a casual non chalant way makes everyone feel less self conscious to talk about their own mental health and that's amazing. Personally, I have been suffering from anxiety for most of my life and had some periods of depression. The things that have helped me the most was getting therapy and using the strategies they gave me such as mindfulness and grounding when I had a panic attack. Also just having good sleep, diet and regular exercise can help majorly with mental health as well as physical health", "I love watching Drew slowly develop a debilitating shopping addiction", "on a serious note, i am so glad you were able to feel better after your panic attack, drew! your content has helped me so much and i am so grateful you are here", "I may not have had that exact little pebble thing that vibrates on your chest, but what I do have is cats who sometimes sit on my chest and purr when I'm laying down. And I can confirm it's 10/10 depression cured (until you have to get up and do something, or the cat gets too heavy and you can't breathe properly, in which case it's maybe a 9.5/10)", "i literally cried when drew spoke about his anxiety bc i normally feel so alone in mine despite it being so common. thanks drew for validating it and making me feel more normal !", "Hearing about your panic attacks made me feel sad. I truly hope you feel better and won't have to worry about them as much in the future (and that if you do, it's not gonna bother you as much). Just know that your viewers are behind you. You bring me and many others joy, and you're honestly one of my all-time favorite youtubers on the platform", "Drew's Angry Old Man Energy is impecable here", "Thank you for being open about your mental health Dr. Ew Gooden", "Thank you for sharing your experience with panic attacks. I have extreme anxiety but I’ve never had a panic attack to that extent. It really means a lot for people to shed light on how much it sucks.", "Thank you so much for being open about your mental health struggles. I think you may be helping a lot of people by letting them know that people they respect, like you, have to deal with the same problems.", "Let's just appreciate how much time and work he puts in these videos to make our day, huge respect!!  8-)", "Hey, I just wanna say thank you for talking about anxiety. I recently had a terrifying panic attack as well, and something like seeing a creator I really enjoy talk about his own mental health struggles made me feel a lot better about mine. It's also very brave of you to talk about anxiety online, since the internet is, well, the internet. Idk if you'll see this, but I just wanted to say thanks! :3", "Wonder if Drew would ever do a follow up video reviewing products that are genuinely used to reduce anxiety.", "On a serious note, I really appreciate how open Drew is about his mental health. As someone who also struggles with anxiety it's refreshing to see a \"public figure\" of sorts talk about his own.", "I've only had one full-blown panic attack. It came out of nowhere and I truly, honestly thought I was going to die. It was the most terrifying thing I've ever experienced.", "I appreciate the openness your talking about your anxiety and panic attacks; lot of shame associated with those things and its comforting to hear someone talk about it so casually :) great vid", "Just wanted to leave a small thanks for talking about your mental health. I know it's a vulnerable thing to share, esp with a lot of people, but people like you help normalize talking about it, and help people understand the truths of some of these things. Esp with anxiety, even openly talking about my anxiety can threaten a panic attack for me.", "Thanks for making this video! Hearing about your struggles with mental health makes me feel more hopeful about my own.", "hi drew i loved this vid mainly bc i love all your vids but I really endlessly appreciate you being open about your mental health! it destigmatizes mental health in men and it means a lot to me as someone with anxiety to have someone you look up to also have their own struggles and be open about it. love u king", "I've never seen Drew as stressed out as in this video, engaging with calming technology", "Drew has somehow become even more relatable as he struggles with growing his hair out.", "I just wanted to say thank you so much for the captions!!!!! its very hard for me to understand ~words~ and I dont think enough youtubers do it. ((: you always cheer me up Drew", "I think you should do a part two cuz I remember when it’s was a  thing to have anxiety pens, even tho they’re literally just vape pens minus the nicotine. Basically, there is an endless stream of these products which is why you should do a part two :)", "Thanks for being so funny, my abs are sore from coughing my guts out and even more so from your specific and incredibly effective sense of humour", "I love when company's prey on people with mental health issues!!! Gotta be my favorite kind of companys!", "\"I was causing the problem that I was stressing about by stressing about it!\" anxiety in a nutshell", "i have anxiety and watching these longer videos are always comforting so thanks drew", "Thank you for making this video and putting so much work into it. Kinda dealing with increased anxiety as well at the moment, so you being open about your experiences is really appreciated.\nAlso, sad to see the blue/green hair go - it was a look", "I recently bought an anxiety necklace by komuso, there's much cheaper versions out there but I chose to invest 195AUD as it was stainless steel, waterproof etc. ive had it for a couple weeks and it's been rlly helpful in the lead up to final exams. its almost like a whistle (if anyone has tried the blowing through a straw technique when you're experiencing high anxiety levels - it basically does the same thing but it's always on you). this type of 'mental health' product would be the only kind I suggest buying - a one time investment and no shits and gigs with it, just a metal pipe around your neck that actually does jack. anyways, rant over", "Drew bringing up his panic attacks and anxiety so casually is sort of refreshing in a way. It always feels like something to avoid talking about, but he talks about it with honestly and confidence. Im glad Drew is able to recognize his panic attacks and talk about them to spread awareness….. also why is the work oneie guy everywhere?????", "So i have stress related seizures and the calmigo actually helps me when im starting to have an episode. What it does is make sure youre inhaling and exhaling in the right proportions, basically a scented timing assistant. Its super useful. And its really more useful when you would normally do deep breaths so like at the onset of an epjsode", "I can't wait to watch this video. I've been having some struggles managing my mental health recently, and as is always the case with Drew Gooden videos, I expect to find some useful things to alleviate that stress", "28:30 yup! Same exact thing happened to me. Just so happens I decided to get a Samsung watch probably a year after manifesting severe anxiety. I spent the next YEAR freaking out every single day, literally CAUSING my own panic attacks when I'd notice my resting heart rate was near 100, and then it'd spike to 120, make me more nervous, and then I'd just sit there having a panic attack telling myself not to look at the watch (I didn't usually listen) I literally had to just stop wearing it. It's been sitting on my desk for over a year since. I immediately was so much happier and more calm, and stopped noticing subtle feelings in my chest that used to freak me out lol you really can manifest your own fears if you dwell on it enough", "My grandma bought me an Apollo against my wishes and within the first 20 minutes of wearing it I had a panic attack and every time after that when I tried to use it I would end up feeling worse lmao, now we’re trying to find a way to get rid of it", "Finding out Drew has anxiety too did way more to make me feel better about my anxiety than a sketchy $200 electronic doodad ever could", "I have anxiety too, and I did the exact same thing with the Apple Watch, worrying about my heart rate. This video makes me feel so much better now that I know I’m not the only one with this problem", "Kinda interesting that Danny and Drew both got a haircut because they are definitely \"two different people\"", "My friend got scammed by a number of these “health devices” thing is, she really needs the help and this was marketed as a simple fix. She’s still the same nervous wreak, just poorer. These companies should be so ashamed.", "This was a very good video, I don’t think these things work ever. It is definitely just a placebo when people think it does. But I do believe that you can overcome mental health issues, and that they don’t need to be something one struggles with forever. I am trying to overcome anxiety myself. I wish you all the best.", "hey drew. i love you guy. you might never read this but i felt in this video you were (sort of) a different person, but because of your anxiety, probably not because of the products. this was a refreshing one and I've always thought you have a really good, creative style and i can see you writing and selling books one day. i really hope you do better moving forward; you've definitely helped me feel better just by being your goofy funny sensible self! mental health is such a wonderful yet difficult journey and sharing our stories - and warning each other about unnecessary products - is important. you're doing an amazing job, whether it's roasting a bad movie or exploring the mental health world. much love and affection ", "I was like 99% sure that this video was going to be sponsored by \"Better Help\" and was gladly surprised when it was \"Hello Fresh\". A true leader of aiding people in mental health.", "Hey Drew, something that actually helps with stress and anxiety that I use is a supplement called L-Theanine, which made an incredible change to the way my brain works when it comes to stress and the causes of stress, actually has an active affect on the way your brain processes anxiety creating scenarios, (not sure if any of that makes sense but it's hard to explain )", "Ah yes my favorite drew series “please support my reckless shopping addiction” keep up the hard work!", "Hey Drew, interoception is the sense of interpreting internal sensations. Hunger, thirst, racing heart, tiredness etc. Often people who are oversensitive to this sense, experience symptoms of anxiety as your brain misinterprets the physiological discomfort as you are in danger. No idea what this product is but interception is real. Other senses not often taught are proprioception (knowing where your body is in space) and vestibular (your sense of balance/ knowing how your head is moving against gravity).", "I remember back in the days when bs vibrating devices were suppose to help you lose weight. Are you telling me the were trying to cure my anxiety this whole time?", "The wrist/ankle one reminds me so much of the tracking devices they made us wear when I was inpatient at a facility recently LMAO. Serving no other purpose but just being in the way and annoying", "I will never get tired of Drew’s never ending desire to understand and explain these products’ mysteries when they’re literally just marketing schemes some guy made in his home office", "Thank you Drew for doing this work <3", "Thank you for this.  People with mental illness are particularly vulnerable to these kind of scams, so having someone try and discuss these products, especially someone with a mental illness themselves, helps a lot.  And we can always use more honest, nonjudgmental discussion of mental health care--if you ever are willing, I bet a video where you speak about your illness, its history and your experience, would be very informative and helpful to your audience.  And if Amanda is willing to be involved, to speak about being the life partner of someone with a mental illness, that might be very helpful too.  Sort of like Gary Gulman's \"The Great Depresh.\"", "My guess with the cove is that they made too many health claims and accidentally got themselves classified as a medical device. Also that paywalled paper isn’t even a full journal article - it’s just a conference abstract which doesn’t go through peer review.", "funny and amazing video as usual, and really really appreciate the topic :') more people really do need to have legitimate conversations about mental health and the commodification of it as a market....", "I'll never skip Drew's ads because I'm worried he'll end up with credit card debt at the rate he's buying things", "So sorry to hear about your anxiety, Drew! It can be debilitating. A friend recently recommended a supplement called GABA to me and I've found it quite effective.\nGreat video, always love your content! ", "Bro. Not only are these videos entertaining but your actually doing a public service by helping us not get scammed. I mean the safe bet is that everything is a scam, so instead of telling us what the scam is you are more-so potentially finding something that works in the pile of scams. Continue this series to eternity please!!!!!", "I have actually bought the calmigo because whenever I do have panic attacks I do tend to hyperventilate. You breathe through and the lights and vibration tell you when to breathe in and out. I don’t use it often, but it has been effective at times!", "thanks for addressing the whole mental health thing - a small thing but helps :) recently I have been feeling a bit sad because people question the legitimacy of my problems", "as someone who's been telling everyone about my anxiety since i found out i wasn't experiencing \"normal\" worry i LOVE THIS VIDEO!! gimmicky products are exhausting in general but especially when they prey on something that people are desperate to treat.", "i love how drew has just become a product review channel at this point", "i just totally abandoned college\nnow i know i could profit the shi out of drew just by making plastic vibrate\nthanks drew", "My favourite thing about Drew videos is that he often buys stuff that most of us could never afford and acts like it's normal", "I didnt realise until watching this video that mental health can be treated as an illness rather than a quirk... I always thought my lack of motivation stemmed from laziness rather than depression, and I thought my panic attacks occurred only because I was a fucking coward.", "#4 in Trending! Congrats Drew. You deserve it!.", "Trying to \" focus\" while being measured feels like trying to use telekinesis. It feels impossible", "thank you for opening up about your mental health struggles. it's a vulnerable thing to do", "You are the only person I watch ads for. You seriously make them all incredible."]}