{
    "video_id": "caVoqAfdkYQ",
    "comments": [
        "Thank you for subtitles!!!",
        "My mom said you sound like ben stiller",
        "'Not doing anything' can be a huge plus. In addition to the placebo effect, where you do something trivial like a sugar pill and feel better, there's also the 'nocebo' effect. Nocebo is when you do something trivial and feel worse.",
        "thank you for being so candid about how challenging anxiety can be to live with every day. i deal with obsessive compulsive disorder and i have spent much time in my day panicking over and tossing the same thoughts over and over in my lil pea brain. but also, thank you for using comedy to make the experience with anxiety a little less uncomfortable!",
        "I love when people I follow openly talk about their severe panic attacks, it makes me feel less alone, as corny as that sounds.",
        "why buy this when you can just insult trump on twitter and put your phone on vibrate",
        "i live for these videos",
        "Love your long form videos",
        "DO A BETTER VIDEO THANKS",
        "about the emails!!! make a second google account have one be personal and sign up for stuff on the other",
        "put the blue back in your hair",
        "Drew!!   I love your videos!! I've been watching them for the past 3 or 4 years now. You absolutely funny!  We need more of that comedy. I know people progress and move on but in the same all that you have done should be seen as your material, and with it the ability to reuse.  Hear me out.  How about we dust off the old landlord skit?  I loved it. And the dollar. And maybe we even bring arnold back. We add a few laugh tracks, and you got a new video!! No need to thank me, but you can.  I wont get mad big boy.",
        "whack",
        "25:37 the cadence of his speech being in perfect rhythm with the device slipping down over his eyes like a pair of futuristic monolens sunglasses is very funny to me for some reason",
        "this was like a real life flowers for algernon. drew became so much smarter from the vibrating plastic garbage and then he was a genius forever. I think that's how the story goes",
        "It's nice to hear another person talk so openly about anxiety and depression when it was never their goal in the first place. I don't usually come to Drew's videos to feel validated but I'm glad it happened today. Made it a bit easier to get through the day.",
        "Hearing Drew talk about his own mental health genuinely made me feel a bit better about my own struggles being valid. Thanks drew",
        "\"This product doubled my productivity\" 0x2 is still 0, lady",
        "i've found this is true for a lot of chronic illness products as well— it can be more material to track, but when you're dealing with pain that fluctuates from minute to minute, let alone day by day, it becomes hard to register what's helping and what's not. the idea of something being \"medically useful\" has become another avenue of the human experience for businesses to exploit instead of focusing their wealth on actively helping people. great video, drew, thank you for calling to attention how many people get scammed in an attempt to just make their lives a little more bearable.",
        "dude anxiety is not real because i dont have it",
        "drew, please explain the chart at 34:41 i am so confused its giving me anxiety omg i'll buy the apollo to calm myself",
        "I was like 99% sure that this video was going to be sponsored by \"Better Help\" and was gladly surprised when it was \"Hello Fresh\". A true leader of aiding people in mental health.",
        "The mendi thing honestly reminds me of a toy I begged my parents to get me as a kid. You put on the headset, and it connected to this thing with fans and a ball. The idea was, if you thought hard enough, the fans would blow harder and make the ball go higher. And you had obstacle courses to set up to practice. Idk how it worked, if it was just random when the ball rose, but I thought for sure I would be apart of the X-men if I mastered it",
        "I’m abt to get hello fresh just so i’m incentivized to cook and eat more! It’s so expensive that I can’t waste it lol. Will be using the code and happy to finally have a chance to support you, fellow floridian ",
        "Sorry to hear about your mental health troubles, Drew. Just a thought, have you ever tried meth??",
        "That dude who works several jobs is also Drew's real wife.",
        "I have as much anticipation and excitement for this kind of lets play as I would have before any kind of triple A Disney+/HBO series or high end cinematic at the theaters. Having this kind of content delivered in my feed for free is a real gem",
        "Never seen this channel before. For some reason it was recommended to me right as I had to take a break from work because I started having anxiety attacks every day. Never had problems like this before so I have no idea what to do right now",
        "I can kinda understand the faux inhaler- i find that the only thing I can do to trick my brain into not continuing to have a panic attack is to use my inhaler ️ but I know it’s a waste of my 400 dollar device ",
        "I think you might be getting panic attacks and anxiety attacks mixed up, they are often used interchangably but they are very different. The really bad attack you had sounds like a panic attack because you had a variety of physical symptoms (in order to be having a panic attack you need to have 3 or more of certain physical symptoms) but its possible the other attacks you had coulsve been anxiety attacks and thats why the other attack was so much worse.",
        "I feel for those who are just really trying to find help... but get scammed instead.",
        "CalmiGo is just a device that makes you breathe... which is surprisingly good at throwing off a panic attack. Get a paper bag. You can breathe into that for under $0.02!",
        "It probably didn't recognize the oats because it wasn't strapped on tightly enough",
        "very enjoy the last dinos shirt drew ",
        "The thing that changed me and others, bio tuner by sota instruments hands down",
        "Inspire is an actual pharmaceutical product. It’s used to treat sleep apnea. It’s not really a mental health thing.",
        "Watching your cat in the background did more for my mental health than any of these products",
        "My dog always does that lol. She scratches on my door to come in, walks a little lap and wants to go out 5 seconds later lol",
        "a lot of these brands seem to try to copy the concept of electromagnetic therapy, which is basically where a doctor will put a magnet on the right frontal cortex (im pretty sure, bare with me im not a doctor, just someone who has been through it ), and basically buzz the magnet tonstimulate the part of the brain that produces serotonin. the irony is that unlike these devises, this therapy is often covered by insurance and actually works for tons of people who are clinically depressed;",
        "Apollo... moon pod... hmmm sensing a pattern here",
        "Glad you’re doing better Drew! I’m sorry for what you have experienced but I want to say that we all appreciate the amount of effort that you put into your content. Even though you most likely won’t see this I feel it’s important to say an encouraging word whenever possible.",
        "Really Frew? Blue hair? Keep politics off this channel!!",
        "Am I the only one that loved the vibe on the unboxing couch? That music and vibe was so chill",
        "Anyone else spend the entire end rant section just watching Drew's cat being a cute cat",
        "What if one of those products actually worked but you couldn't figure out which one?",
        "A pet cat seems to do just the trick!",
        "I kept thinking this was a better help add",
        "Hey Drew, I’ll keep this short so that you possibly read this:\n\nPlease review the fever dream that is warriors of virtue.",
        "I don't think Drew's hair looks bad and I'm tired of pretending that I do",
        "It's really inspiring to hear Drew talk so openly about his mental health struggles, it helps me feel a lot better about mine :)",
        "Yeah I have a cat, it's just as expensive and it loves me",
        "the fact that you have to charge all of those devices would make me 300x more anxious",
        "When i was learning how to play flute we sometimes used to practise with a plastic tube with ping-pong ball inside. You had to keep ball floating in the tube for as long as you could to enhance your lung capacity. It costs about 15$ i think, and I always found it really rellaxing. I believe it could work similar to this 200$ device Drew bought and you could pretty much diy something like this.",
        "“sometimes my brain forgets that we’re supposed to be on the same team” what a great way of describing anxiety I appreciate this. what a mood.",
        "I love Drew's style around 21:31-21:41, with his messy long ish hair, glasses, shirt and his mood and expressions at that moment he looks like an overstressed virologist to me",
        "If the only benefit a $400 object can offer me is a placebo, I may as well find a cool stick to help my mental health.",
        "Uh, yeah, I sure hope they do",
        "If they send Free batteries the profit margin is crazy",
        "as far as i know \"interoception\" is just a term for internal senses in general, e.g. your senses of hunger, thirst, fatigue, etc.\n\nso it's not a bullshit term but obviously that plastic headset's appropriation of it is nonsensical",
        "Space your seperate crop fields out in Rimworld more, blight is going to annihilate you.",
        "I love that your ads know you’re rich. Mine just tell me to get tested for HIV or take a ‘Am I Gay?’ quiz ",
        "Weaponizing buyer's remorse to FORCE your mind to get better? What an idea!",
        "I burst out laughing to your reaction to the InspireSleep implant xD It's a vagus nerve stimulator, and I have one. I got it for my epilepsy, but it works for a number of different things including sleep and mood disorders. Being advertised on Instagram definitely feels sketch, understandably. Ironically, that's the one I trust the most.",
        "Drew, is that the recent Acceptance pressing on your shelf?! Love that album and have that pressing!",
        "no i was watching",
        "Now that we're talking about actual things that work. The Oura ring is very highly touted smart device to track activity, hr , Blood Oxygen levels , and sleep. It's worth the price tag imo. Linus Sebastian from LTT really fights for the ring. Even though the company got angry he mispronounced the company name numerous times (funny) , but its byfar a non distracting device to help you  with your day to day activities. No I wasn't paid, I just like the device.",
        "Aw, I'll miss the blue hair. It was fun :-)",
        "Drew looking like a knockoff Ninja Tyler Blevins with the blue-ish hair and the headbands.",
        "The brainwave tracking is actually a ver useful tool. In hospitals you can get a more in-depth one to check for seizures and things called an EEG. Its a lot harder to scale this type of study down to commercial use because of how those tests are done, with strobe lights and probably 20-30 electrodes put on the brain with very expensive algorithms monitoring all the different brainwave patterns. But nonetheless these tests are done to track seizures, propensity of seizures, sleep issues and narcolepsy as well as many others. ",
        "Drew and Danny both cut their hair at the same time, they truly are not the same person indeed",
        "@lobosjr DS1 Mendi run when????",
        "Who else was busy watching the cat in the background at the end of the video? LOL",
        "Oh god he’s back",
        "These ads are full of people that would could achieve the same effect by, I dunno, drinking more water and going for a walk?",
        "Drew speaking about mental illness and anxiety like its something natural. Thank you.",
        "Interoception is absolutely a thing.\n\nI know, because mine has always been garbage, but has actually improved with medication. Which is useful, because it's the sense that tells you about stuff like hunger, or needing to use the bathroom.",
        "Cyberpunk: chapter one",
        "the honesty about your panic attacks was really refreshing, Drew. I've been having intense and very traumatising panic attacks almost daily for nearly two years now after only having them rarely before then and it feels very lonely, so thank you for speaking on it so publicly. I hope it helps others to know it's ok for our brains to be broken<3",
        "My anxiety has been especially bad recently too, it’s nice to hear someone talk about it so transparently",
        "OMG ITS NINJA",
        "Calmigo actually works really well. As someone who has a panic disorder I use it when I’m in a panic headspace in order to focus on breathing. It helps you time your breathing and gives you something outside of your mind to pay attention to. It is a bit expensive but I truly think it’s worth it.",
        "hey Drew, I’m sorry to hear about your anxiety. I have it too. It probably means nothing to you but knowing that even big content creators and celebrities experience these feelings and issues makes people like me feel less alone in this world and is enough to keep us going. ‘if others can, so can I’ that kinda thing",
        "3:13 vibrating egg sounds an awful lot like a different kind of product, which might be more efective at this...",
        "Next video: Drew debunks local chiropractors who use the same BS pseudoscience to sell their weird holistic products and crack your back.",
        "Your blue hair was actually awesome. It looked so much like you.",
        "The Mendi is just an expensive, modern day Mindflex",
        "27:00 ironic how my speaker said “please charge” during this part",
        "Drew speaking about mental illness and anxiety like it’s something natural. Thank you.",
        "I’m gonna be sad when the blue hair grows out. It grew on me!",
        "Hey drew, glad you’re doing better after your panic attack. I struggle with horrible anxiety and depression as well and in case you’re not already, recommend going on meds for it. Made a world of difference and is not a quick fix like any product advertising themself to be. You’re not alone friend!",
        "I didnt realise until watching this video that mental health can be treated as an illness rather than a quirk... I always thought my lack of motivation stemmed from laziness rather than depression, and I thought my panic attacks occurred only because I was a fucking coward.",
        "Hoping things get easier for you soon, Drew. Even with therapy, I used to have panic attacks so bad that I thought I was dying as well. That and many other disorders got so bad it was eventually start taking meds or giving up life entirely. I may take 13 different medications, but I'm the best I've ever been. And getting better every day. Hoping you can get there too.",
        "I noticed you talked about not 'seeing' how it works (pulse waves and emf's are used) and how they would benefit someone. The same concept can be applied in reverse - we also don't 'see' harmful pulses and waves that give us shee like restless leg syndrome - so, the diseased population may be proof of harmful invisible waves...should we not buy into a 'fix' or harmonic resetting with helpful waves??? - Who TF knows...but you also mentioned placebo...sometimes you just preach straight from my head. Also- I'm putting a bid in for your oldest subscriber!",
        "Turn the mindi off, and that ball app will do the EXACT SAME THING. Because there’s no way to measure concentration.",
        "Say what you will Drew, but these things genuinely made me feel smarter. I bought one for hundreds of dollars, wore it daily, and then finally had the brainpower and motivation to realize I'd been scammed.",
        "friendly reminder that for online scientific journals, they almost always list the names and contact info of the author(s) (it's often required of the authors to include it as part of publication), and most authors are more than happy to send you a copy of their research publication if you ask politely. they don't make money from the journals' access fees. did this awhile back for a research project and the author sent me the study I'd requested as well as two other publications she'd co-authored with additional info on the topic.",
        "You are the only person I watch ads for. You seriously make them all incredible.",
        "The screen that just says “Pain Control” at 25:31 made me laugh so hard  what does that mean?? Why does it sound so threatening?? Also, am I the only one who thinks the blue and brown hair looks good?",
        "I may not have had that exact little pebble thing that vibrates on your chest, but what I do have is cats who sometimes sit on my chest and purr when I'm laying down. And I can confirm it's 10/10 depression cured (until you have to get up and do something, or the cat gets too heavy and you can't breathe properly, in which case it's maybe a 9.5/10)",
        "So, the Calmigo is basically a $200 plastic version of breathing into a paper bag?",
        "Dingo YouTube sucks !",
        "Drew will never let us forget how disappointed he is in the Moon Pod. Never.",
        "Some of these zen items can also radioactive",
        "wait but interoception is real tho lmao",
        "Drew’s in his mint chocolate chip era",
        "Your hair is fine, could be worse. Could have fallen off.",
        "There is this movie series that my little cousins LOVE. It's called pup star and it is a four-movie series about a DOG SINGING COMPETITION. Full on animated mouths, chock full of plot holes (including treats that make dogs talk), and starring the dad from alone for Christmas as the dad in pup star. Drew NEEDS to react to it",
        "Drew is looking for anything to help him cope at this point",
        "hey andrew, nice vid",
        "Si I just wanted to shed some light on the whole research paywall thing. Most psychological studies are hidden behind a paywall. Typically when you're in university or something the university pays for a license to use and view that study and distributes it to students. The reason they do this is so that the people who conducted the study can actually make some money to fund further research. However, usually these people aren't also selling a product, so this particular one is dumb, but research being behind a paywall is actually very common.",
        "why does drew sound strangely like andrew glouberman\nalls im saying, ive never seen them in the same room at once",
        "Holy shit, the calmigo chick is the one who completely fabricated her whole career.",
        "I work at a large research university, so I found the Toward Emotional Prosthetics article Drew mentioned at 17:26. The journal it's coming from looks like it's been around for a while, so that's one thing in its favor (there's a huge problem in academia where fake journals target professors who need their articles published, take their money, and never publish anything). I can't share it for copyright reasons, but it's super short and has literally no numbers in it, using words like \"most\" or \"majority\" instead of exact numbers. Most of the other studies next to it include at least an exact percentage of subjects who performed/felt a certain way and some correlation statistics, but the Apollo article is totally devoid of numbers. It's super vague and like Drew said, there were only 38 participants. The methodology is also super vague. It talks about the tasks the participants performed, but it doesn't go into detail of how they measured participants before and after. Super suspicious all around as someone who read the article",
        "He should really troll us with a product that doesn’t exist",
        "The fact that he thinks they want to help anybody is so sweet. The reason they're priced so high is so they can make as much money as possible before somebody cracks down on their bs.",
        "the mendi is 100% just \"the game\" from season 5 episode 6 of star trek: tng",
        "\"Anxiety's not real because I don't have it, and I'm the main character.\"\nThat is - without a doubt - the greatest and most accurate description of idiots who don't understand mental illnesses.",
        "i like what you said about the mental health tax and these companies preying on a vulnerable group. i also think these might be targeted to people with high stakes high paying jobs that can afford to buy dumb shit to help with work stress",
        "Today I went by a road work ahead sign and quoted his vine by then tragity struck about 100 meters ahead a sign said ROAD WORK ENDS HERE PLEASE IM STUCK HELP ME",
        "100% agree with the heartrate monitor thingy on digital watches. I never looked at it until I suffered a breakdown last year and suddenly I realised it was there in full view and after a very bad panic attack where my heartrate seemed to go haywire I kept looking at it, seeing it went up which would then trigger another panic attack.",
        "3:50 im sorry, drew. panic attacks are fucking terrible",
        "Can you pretty please review one of those cat litter boxes that clean themselves I wana know before I spend 100s or dollars on one",
        "no more green gamer hair sadge.",
        "for a minute i thought \"just see a doctor and get meds please\" then remembered that this is the USA and expensive quack technology has sadly become a viable choice bc of a bad healthcare system",
        "I don't know why but pls Drew do a video about Love, death + robots",
        "You should have put the mendi on a dog",
        "Drew's videos are the only proven mental health product",
        "38:16 ghost sighted",
        "Your breathing calms your life. Play phone games that make you angry. Undo the anger slowly, safely and enjoy the game.",
        "When the ad shows someone saying they /think/ it's working, that's not the best sign",
        "wow. it's almost as if the problems that these products claim to fix is born out of capitalism and the gig economy.",
        "I'm disappointed the oatmeal couldn't keep up with Mindi. Oatmeal is dumb.",
        "ur slayest video drew congratulations ! ! ! ! ! ! ! zoloft time",
        "Gotta respect omnipemf for at least leaving the bad reviews up",
        "Damn, Ninja, you really fell off…",
        "it is called licensing they are going to let other people sell it.",
        "It's pretty smart to put ads for a product on tiktok and instagram and have the selling points be that it both helps you sleep and helps you stay awake. Those are the two things that tiktok and instagram users struggle with the most, other than staying focused and relaxing of course.",
        "They are so useless lmao",
        "a new jacksepticeye video nice!",
        "There is probably something to the vibration for calming (cats purring really is calming and helps with anxiety) but you could probably just get a cat or an electric toothbrush.",
        "I’m glad you’re doing better, it’s tough to keep picking yourself after life decides to go a bit sicko mode. I’m really impressed by your ability to keep making content and especially making really good content. Keep up the good work! We’re all rooting for you.",
        "When you watch the ad break because you feel bad for Drew spending all of that money and you want to feel like you're helping him a little bit.",
        "Thanks for taking one (thousand four hundred sixty-two dollars and ninety-six cents) for the team. Your humor and candidness actually helps drive the point that these products are quite predatory. This might be one of my new favorite videos.",
        "More of these kinda videos, please!",
        "Thank you for being open about your mental health Dr. Ew Gooden",
        "“do they work on the jeremy renner app?” i can’t man i can’t",
        "These videos would be a lot more entertaining is they went ad -> review -> ad -> review, right now it feels like the first ten minutes is a whole separate video of complaining about ads before you get into the main part you came for",
        "Poor kitty was just going to go in and out and probably in and out again, and now it is stuck with Drew's ramblings lol. Look how patient it is, waiting and grooming, and sleeping and walking around and not interrupting - very distinguished! (:",
        "Hey Drew, there are two distinct hair colors fighting to the death on top of your head.\n\nYou should stick with the blue.",
        "Drew I think it’s important to note the distinction between clinically proven and scientifically proven. Clinically proven means they basically paid people to manipulate results",
        "Ironically, it seems that drew has been the most aggravated in this video lol",
        "This is like those products that promise weight loss \"when used in conjunction with proper diet and exercise.\" Well, yeah. Anything at all will help you lose weight if you're also eating right and exercising. That's like saying, \"This proven strategy will earn you millions when used in conjunction with a winning lottery ticket.\"",
        "So glad you’re talking about this. I think companies have realized how many ppl struggle with mental health, and they’ve decided to grossly capitalize off it, knowing that ppl are desperate to try and preserve their mental health as it is. It’s that constant reiteration of “maybe THIS stupid thing will fix my life!”. As someone who’s had chronic mental illnesses for years, you soon realize that no amount of quick-fix products will help, you just have to continue fighting with yourself in an effort to preserve yourself.",
        "Selenium and lions mane mushroom capsules. They have turned my life around. I haven't had an anxiety attack in months. ( I was having  them once a week)",
        "too good to be true, wish we could fix and rewire our brain by buying expensive crap like this",
        "WHY DO YOU LOOK LIKE THAT",
        "Had a dream the other night that Drew found his doppelganger at a highschool talent show and did a Prince and the Pauper-esque life swap with the kid. No one noticed the height difference",
        "Do YOU even do anything, Drew?!?!",
        "the product is bs but interoception is real and actually influences a lot of adhd and autistic traits",
        "Actually liked the blue hair! Looks cool!",
        "nice is this it vinyl",
        "Personally, my favorite overpriced mental health product that I've ever bought was my anxiety meds (prescribed by my doctor)",
        "i have tachycardia — my apple watch sends me high heart rate notifications all the time and it raises my anxiety, which in turn, makes it even higher ... great thinking apple",
        "ugh DHL sucks amirite? (i work at DHL)",
        "Ever heard of the placibo effect?",
        "his shirts are so cool",
        "This is the angriest I’ve seen Drew in a while",
        "Drew, I love eating your content, it’s so tasty. On a side note, I always watch pizza while eating your videos.",
        "Your hair looks like a snow cone melting in the dirt. Absolutely breath taking...",
        "I'm loving these honest long videos/ video essays. They're so thought-provoking (and I didn't need to spend half a grand to experience it!)",
        "I like how they are making devices targeted for people who live the opposite life of The Liver King",
        "my mom has a panic disorder so she can definitely relate to your situation. It's been very difficult having to see her get panic attacks almost daily and sometimes even multiple times a day. I wish she can get better because it just makes life so much harder than it is. I hope you feel better Drew! <3",
        "Okay so I definitely want to get a piece of this market lol. I have an idea for a product that fits the category but actually does something.",
        "I LOVED THE HAIR I AM SO SAD",
        "The hellofresh promo didn't work for me in the UK :(",
        "my best guess for the inhaler thing is that its working like an incentive spirometer, which could reduce anxiety through the deep focuses breathing but god only knows",
        "That Jeremy Renner app call back ",
        "I just wanna say Drew looks absolutely stunning w the two colors fighting on his head and these beautiful glasses. This blue color, I didn't like it before but it grew on me and the way that his natural hair color is showing more under it, it's a whole vibe imo. ",
        "As I clicked on the video i was thinking \"oh hey how's his hair\" and that intro did not dissappoint",
        "i was thinking about how your hair was returning to its natural color and i was like \"he's probably not gonna mention it\"\nwithin the first 10 seconds istg",
        "I enjoy these types of videos you do. :) Also your cat is so cute!",
        "What is wrong with your hair????",
        "why are most of them worth as much as a few weeks to a licensed therapist",
        "In the 8 years of watching Jev, it makes me happy seeing him as energetic, as happy, and just as consistent as he was. Jev really is one of the best youtubers",
        "Oh my goodness, blue hair! A trait most commonly associated with popular Fortnite streamer Tyler “Ninja” Blevins, what a twist!",
        "Great video Andrew!",
        "I realize that it's all a scam, but let's be real: if you play Rimworld, some of the times in your life that your focus is laser-tight is when you hear that horn blare and Fun Starts Happening.",
        "instagram ads are wild mine are for ketamine studies ab depression",
        "Drew, I wanna see you play Rimworld :D",
        "The Mendi is just the star wars force trainer toy lol",
        "I'm just a random viewer... but are you okay? You've talked a lot about mental health and anxiety lately. Take care of yourself.",
        "I recently bought an anxiety necklace by komuso, there's much cheaper versions out there but I chose to invest 195AUD as it was stainless steel, waterproof etc. ive had it for a couple weeks and it's been rlly helpful in the lead up to final exams. its almost like a whistle (if anyone has tried the blowing through a straw technique when you're experiencing high anxiety levels - it basically does the same thing but it's always on you). this type of 'mental health' product would be the only kind I suggest buying - a one time investment and no shits and gigs with it, just a metal pipe around your neck that actually does jack. anyways, rant over",
        "If only this video was sponsored by Better Help, that would make this into modern art. XD",
        "You look MUCH more handsome without the blue hair, Drew! Good job ",
        "If you want something that vibrates to lay on your chest, get a cat...lol....my Sid likes to wake me up by laying on my chest....",
        "His name is andrew?????",
        "Am I the only one that thinks Drew looks really good during the unboxing part with the messy blue hair and long sleeve black shirt and glasses idk man",
        "Drew: \"Do these mental health products do anything?\"\nMe: \"Yes. Causing despair/depression over the money wasted on the products is technically doing something\".",
        "The funny thing about the “sixth sense you’ve never heard of” is that there’s a bunch of senses that could be considered the “sixth sense.” Proprioception, nociception, vestibular sensation. Interoception isn’t even really it’s own sense but a category of them.",
        "My boy look like a transitioned ninja",
        "Drew. You know you have to be extremely focused to play RimWorld. You should try the joywire next video. Am I right fellow gamer?",
        "As someone studying neuroscience, the definitions of how these products work are painful",
        "18:18 \"You know what else has Bluetooth and the ability to vibrate?\"\nMe: A vibra- oh yeah an Xbox controller yeah that ",
        "man Drew since that tom brady video youve lost a ton of weight, and you still have a wife! unlike tom brady",
        "16:28 drew why are you so hot that's not right it's not allowed",
        "funny and amazing video as usual, and really really appreciate the topic :') more people really do need to have legitimate conversations about mental health and the commodification of it as a market....",
        "Just smoke some weed!",
        "Jack Septiceye I love you",
        "24:50 drew you literally bought it",
        "Just get your cat and put them in your chest while you watch tv",
        "It's kinda telling how visibly angry Drew is when you think about why these products are even being sold",
        "I thought when Drew said “Slovenia” at 11:44 he was saying “Slowvania” as a joke… didn’t know that was an actual place ",
        "Watching Drew's cat in the background did more for my anxiety than any of these products probably would",
        "You trying on the different head pieces reminds me of that scene in Napoleon Dynamite where Uncle Rico is trying to use the time machine lol.",
        "One interesting thing about the placebo effect is that it works even if you know it's a placebo. The problem is I still don't have a PS5, so 400 bucks is out of the question. That's why I bought a healing rock for 5$ and slapped some googly eyes on it. Now I got a placebo, and a friend.",
        "That mendi bruise lol",
        "wrap the oatmeal in a heating pad and give the mendi another try.",
        "I havent been getting notifications from this channels uploads for almost a whole year! I thought guy disappeared. Well, I have a lot to watch now.",
        "u should replace ned in the try guys",
        "I love this video so much! I really love his sweatshirt from “the results” and want to get one myself. Anyone know what sweatshirt this is???",
        "people really do be commercializing electral shock therapy",
        "Beatriz is my aunt. Makes sense",
        "I have a ton of vibrating devices that help my mental health but they weren’t like this",
        "I almost had a panic attack once. It was awful. There was this feeling that I was dying. I was super anxious. I felt like I couldn't breathe. Anyways I randomly remembered that panic attacks happen and that it would eventually pass. I calmed down a bit and then it went away. Knowing what was happening to me helped a lot and I'm glad I didn't have a full scale panic attack because it was scary.",
        "This could have perfectly led into a betterhelp ad and I cannot tell you how happy I am that it was not!! Loved this video, relatable struggles and very comforting!",
        "\"i don't want ANY emails, EVER!\" - drew gooden, 2022",
        "Drew please take care of yourself, I think you might have an online shopping problem",
        "Am I the only one that thinks that Drew's hair looks really good? yes? well ok then.",
        "11:12 $1462.96!!! ",
        "Jokes aside, the fact that drew talks about his panic attacks in such a casual non chalant way makes everyone feel less self conscious to talk about their own mental health and that's amazing. Personally, I have been suffering from anxiety for most of my life and had some periods of depression. The things that have helped me the most was getting therapy and using the strategies they gave me such as mindfulness and grounding when I had a panic attack. Also just having good sleep, diet and regular exercise can help majorly with mental health as well as physical health",
        "My brain is perfectly broken thank you",
        "Snake oil salesmen have never gone away, essentially.\n\nYou'd think that with all this information and the freedom to be skeptic at all our fingertips it'd be harder for them to sell shit, but no, stuff like this perfectly showcases that they'll probably be around forever.",
        "Next review all the popular VPNs advertised on Youtube and talk about how they negatively impact internet use, don't allow you to access streaming from different countries as advertised, and how VPNs in general don't add much more security than the anti-virus and other security that comes pre-installed in most PCs",
        "seeing someone talk so openly about mental health struggles is so comforting, especially a man because us men often get more ignored in that department. i hope you're doing better drew, and thank you for doing what you do :)",
        "thank you for making this one luv xoxo",
        "Take them apart, see what’s inside : )",
        "Wow, what’s your hair care routine? The color has stuck around a lot longer than I expected.",
        "The Mendi is literally just a headphone band with a cloth strap. lol.\n& so is the other one you wear on your head.",
        "does anyone know the background music that plays around 1:48 ?",
        "You have two distinctly different hair colors fighting to the death on the top of your head, they're both...winning",
        "Whew! Shout out to our boy for being transparent about his mental health ",
        "Call me old fashioned but ima just stick with doing drugs ️️ it's easier",
        "DREW WHY ARE YOU TRYING TO INHALE LAVENDER THAT WAS SOME PPL USE INSTEAD OF WEED it’s acc meant to clam you and sorter like the effects of weed",
        "I spent 2k on my mental health. That was copay on two weeks of an intensive group therapy program and my anti depressants. It’s been 2 years since I was finally able to recover. Even tho it took me a while to pay it off it was worth every penny, especially since im emotionally stable enough to hold down a nice job. Idk these things look great when you’re desperate. I think everyone should try to remember actual medicine",
        "HAIL THE SUN VINYL?!?!? Drew has impeccable music taste. Also love the vid",
        "Ask these people to reach out to you and interview them.",
        "I legit see people who buy this use it for a year then never wear it again. think the only people who really would absolutely benefit would be elders and caregivers and so family members caring for elders. otherwise all this shits great capitalism. legit spend my money on eating better and changing my health without buying dumb shit lmao",
        "The breath thing you bought was basically a spirometer (I think?) with a light. They have them at hospitals and use them to test and strengthen your breathing",
        "I thought he said \"OmniPimp\", and I had to back up.\n\nIf I had a company that sold horses××t, that would be a great name for it.",
        "Don’t worry Drew, I relate to the hair issue right now. Pink and Purple are having a war on my head and somehow orange seems to be winning",
        "Fun fact of the day: he had bad sleep on the night of my birthday",
        "just subscribed I am truly Greg",
        "i would just buy an actual vibrator and tape it to my chest. it has up to 10 different vibrations and can Also connect to blue tooth and u can adjust the vibrations from your phone for like. 50 bucks not even",
        "Dear God I feel bad for you about the panic attack. I can't imagine what it's like. I had a panic attack once and that shit was the worst thing ever.",
        "You have two distinctly different hair colors fighting to the death on top of your head. They are both losing.",
        "I met one of the founders of the wristband tech. The funny thing is that they didn't actually need the $400 wristband. They just needed to have an app for the apple watch to vibrate and have you flip the watch face below your wrist. However, a $5 app will never make as much money as a $400 wristband right :D",
        "Interoception is something they're bringing into schools, it's supposed to be a support system of sorts for neurodivergents... Though I think companies like these are taking the key words in interoception and make profit off of them. But the theory behind interoception does work for a lot of people/namely children.",
        "Yeahhhh so the \"calm me go\" gives the same effect as breathing into a paper bag worth a couple cents. when you have an anxiety attack you exhale too much oxygen and your blood becomes acidic. The treatment for that is a device that catches the exhaled oxygen and has you rebreathe it, like a paper bag",
        "All of the ads I got on this video were for metal health products.",
        "Drew..... Someone ce.into the sushi place I work at in Virginia Beach, VA.... WEARING A COVE. and left a huge tip. Very business man type. So weird.... Maybe he's involving ",
        "28:45 you just described anxiety simple way",
        "25:40 FUTURE DREW",
        "As a Psych student it's actually super interesting to see the ideas behind those items. They aren't that far fetched (controlling a game like this with your brain activity) but it's usually not that easy. \nBut I have to say, yes you can definitely design studies to find out if it's for example only the mediation that's working or actually the device. That's kinda the whole point of empirical studies",
        "I thought it was fairly obvious of a cashgrab..",
        "Kek u had a panic attack that sent u to the ER, insert soyjak here",
        "Seeing that you uploaded this almost made me cry of happiness. I thought a 41:18 minute Drew Gooden video was only something I could see in dreams. ",
        "Drew Gooden - buying junk on the internet that no sane person would buy.",
        "Future Drew's lighting makes him look like Mark Zuckerberg",
        "You should get a special for junk only e-mail address, and probably a separate Instagram or google account.",
        "Thanks for pointing out the predatory tactics used by these types of companies. It’s such a scummy thing because most of us with mental health problems are desperate for solutions and these companies know that :(",
        "If they do anything, then I guess they could claim they do something for you",
        "#1 on Trending son! That’s how it’s done.  You sir deserve all the success you get. More effusive praise, more effusive praise, congratulations. ",
        "It worked! You now know better than to buy expensive plastic headbands so you got smarter.",
        "plz consider more videos per month :)",
        "Reminds me of Mulaney. In a good way.",
        "I wear my oura ring every day and I still got pregnant",
        "Dyed hair drew gooden looks like a cool art teacher",
        "i like to imagine drews glasses arent real and just have pictures of someone elses eyes on them",
        "Idk why but watching this video gave me anxiety, maybe it's because i have exams in a few days or something i don't really know but i have very bad anxiety after watching this video.",
        "Good job",
        "I prefer to eat my vomit while going 60 mph on a reverse roller-coaster  than to try any of those devises and just hearing you talk about it for 41min was painful and unnecessary.",
        "Spiteful consumer Drew Gooden is all i could ever hope for in this development",
        "thank you",
        "interception is actually a real sense that we do have but it has nothing to do with this weird headset",
        "Adult stores hate them, they give bad name to things that vibrate!",
        "Drew you are a treasure",
        "fuck yeah hail the sun!!!!",
        "it’s gross how companies like this take advantage of those with mental health issues just to get more money. great video drew ",
        "I love the cat interaction  so powerfully years-in cat owner energy",
        "you have two distinctly different hair colors fighting to the death on top of your head and they're both losing",
        "The only anti anxiety product I have is a weighted blanket. The technology is simple…crushing weight makes me feel safe. \n\nAlso thank you Drew for opening up about your anxiety, I appreciate more men talking about their struggles with mental health. ",
        "\"my brain forgot that we're supposed to be on the same team\" is a pretty good way to describe a panic attack",
        "It was the hey Andrew for me",
        "Thumbs",
        "Hey Drew, I just wanted to say that it’s really comforting to know that you’ve also been to the er for panic attacks before. I’ve been coping with the worst anxiety of my life this year to the point of going to the er a few times, and it makes me feel better to know that I’m not alone :’) thank you for being so open and normalizing the experiences that come with anxiety!",
        "I don’t want any emails ever could be put on a tshirt",
        "I recently had a 4+ hour panic attack that came out of nowhere at work. It would not go away and I eventually had to go to the ER (luckily I work in a hospital) but it was still a terrifying, exhausting and of course embarrassing experience. \nHearing that you also have panic attacks and have had a recent 2 hour one, (which im sorry you had to experience) somehow makes me calmer knowing I'm not alone. Thank you and great video as always.",
        "This is one of your best videos yet. I really like how critical you were of these products. I'll just stick to boring mental health stuff, like meditating, movement, and eating well.",
        "Ok ninja",
        "I love how drew just posts whenever the hell he wants and we're always here ready to listen to him talk about shit we've never heard about or care about. That's star power right there",
        "Why is it that every time drew wore black, I thought he was hot? I have never thought he was hot before. It’s just when he wears black. \n\nI’m unsure how to feel about this.",
        "I love how you and Danny are have hair struggles  a true friendship",
        "I went to a checkup and they had to retake my heart rate 4 times cause it was so high. They even switched from the instrument to doing it by hand. My heart rate is fine, I was just anxious about the visit which made it skyrocket. And then each time they said it was too high and they needed to check again it made it worse lmao",
        "I feel like Xanax could just replace all of these products ",
        "Is this the jackspedicey i hear people talking about?",
        "on a serious note, i am so glad you were able to feel better after your panic attack, drew! your content has helped me so much and i am so grateful you are here",
        "this is just politically correct electroshock therapy",
        "Drew buys snake oil the series",
        "From one panic attack person to another, I just love how on point all your comments are lol. The hardest part is knowing about it, then obsessing about it, then trying not to then vicious cycle? Lol sending my love guy!",
        "i don’t think ive ever seen drew this angry",
        "From what I can tell the cove are just bone conduction headphones which are actually pretty good when used correctly with a lisensed therapist who is experienced with using them I used them for a while good for headaches",
        "all those reviews that are positive are paid for",
        "why does drew from the future look like drew from 2011",
        "24:50 \"Call me a cynic, but I'm not buying it.\"\nRight...b/c you already bought it. ",
        "I wonder if Drew knows how helpful it is to know about his anxiety and know that as someone with anxiety that his videos will never bring about an anxiety attack. Incredible. Truly.",
        "drew you sound like Sid from Ice Age",
        "i really didn't realize how much of a gem annoyed and cynical drew is",
        "YEAH SLOVENIA GOT MENTOINED!!!",
        "gj",
        "One of the songs in the background during the unboxing couch segment has a very quiet sound that made me keep pausing because I thought there was a small dog barking outside my window.",
        "\"H e y A n d r e w\"",
        "That is a hairstyle I wish I could afford.",
        "negative but good",
        "Can't get behind any of these mental health products but i can get behind hello fresh lol. I'm vegetarian and wasn't a huge fan of vegetables- it sounds counter intuitive but i do like tomatoes, onion, lettuce, and like broccoli and stuff but like i know tons of meal kids be doing weird ass vegetables so i actually used to sub to hello fresh and stopped when i switched diets. Finally decided to come back and browse their veggie options and lemme tell you 10/10. They have so many different dietary options and if anyone wants to try, just try lol",
        "So many little hilarious things like Drew smiling back at the instructor at 22:20 ",
        "something about the unboxing couch drew is soooo ",
        "One year ago I was barely able to leave the house due to my anxiety and panic attacks, and the thing that helped me the most by far was going for walks. You know, that thing you can do for free. At first I didn’t go beyond my own street, but sometimes I would be able to walk a little further and that would be a massive win. ",
        "love this <3",
        "there's no way that I was the only person who initally thought Bright Side's 10 Home Exercises to Become Taller In No Time (at 23:45) was not YouTube, but another popular video streaming website.",
        "It only a movie",
        "There are vibrating stuff that will calm people down that are proven to  worked especially for ladies.",
        "i actually only pretended to watch sorry",
        "I love how Drew always goes into these things with the enthusiasm of Jack Skellington trying to figure out Christmas.",
        "Thanks for opening up about mental illness",
        "DREW I love the new hair. Partly because it suits you, and partly because of the crippling anguish that the blue hair caused you.",
        "VCR soundtrack?",
        "Fact if you into a syringe trying to push the plunger out it calms you slows the heart rate especially in panic.\nSecond three deep breaths resets the nervous system",
        "Ever since a bought a C.A.T My mental health has just been so calm and \nI have fewer panic attacks! Purchase (or adopt) a C.A.T!",
        "I totally empathize with the anxiety.\nI ended up in the ER a few weeks ago because my chest hurt so bad I thought I was having a heart attack or something. After many tests, they decided it was my anxiety and that my acid reflux set it off.\nI don't even know anymore, man ️",
        "18:07 The most genuinely angry I've seen Drew.",
        "i had my first panic attack in a while today, but drew uploading made it easier to distract me while i stop breathing so damn fast",
        "Of course he has anxiety, of course. He looks like the type",
        "For those curious, interoception is actually a sense, it's basically a fancy word for being able to listen to your body's signals. Knowing that you're tired, hungry, need to go the bathroom. That feeling that you really need to eat a carrot since you've had nothing but pizza all day... Interoception can be poor with certain mental disabilities, but like all these other problems, things like therapy tend to help, go figure",
        "I wonder if the FDA gave The Cove a warning and that’s why they disappeared.",
        "THANK YOU for talking about the depression loop. it’s so real and exhausting hearing that you were stuck in one for two years made me feel so much less alone. idk how long i’ve been stuck in one at this point, but hearing you be so vulnerable and candid about it and getting out of it gives me hope.",
        "I don’t know why, but Drew’s nonchalant talk about being anxious and depressed made me feel very valid and happy.",
        "With that mendi one: if you're using a product that you believe is going to help you learn to focus better, you're already kind of training yourself to pay beter attention because you've spotted the issue, accepted it, and decided to do something to fix it. You also believe the device will fix you, so you kind of manifest it.",
        "Sometimes I forget just how muscular he is until moments like when he showed his arm\n\nalso albert if you see this, please return to making myth videos. I have some non-controversial myths for you to check out:",
        "Drew looks good wearing blue clothes.",
        "Drew can you please review this movie of Hulu called mistletoe and menorahs for a holiday episode",
        "ANDREW GOODEN the father of eyes",
        "If you are done with the blue you can dye it orange and it cancels it out and makes it look brown.\nPlease do not use a color remover in your hair if you have weak hair.",
        "The Fisher-Wallace device for anxiety, sleep, depression is GREAT!!! It's one of the first, and it's the most researched, electrical brain stimulation device. They are currently seeking Medicare and insurance approval as well!!!",
        "Please stop giving those scammers your money :(",
        "Interestingly enough, there is a 6th sense most people don't know about that isn't interoception! In fact, there are two: equilibrioception is our sense of balance, and proprioception involves how we register the space around us [i.e. someone sitting beside us]",
        "Here ya go engagement algorithm. Cuz I feel bad for this guy ngl",
        "Drew kind of looks like a lesbian history teacher during the unboxing part",
        "I do have a device that has helped me improve my sleep and overall mood. It's a fitness tracker that tells me to go to bed at bedtime and motivates me to be active, which makes me sleepy in the evening.\nWhat I paid for heartrate teacking, step counting, stress response tracking, sleep phase tracking and an alarm if my heartrate becomes to high or low? €150. Still overpriced, but it does some real things.",
        "How much money would it take for you to say, “I’m proud of you”? I just really wanna hear it. ",
        "Do you know what's causing your anxiety?",
        "Buying these products relieves the anxiety of knowing you haven't bought them yet.",
        "Hey, Drew. As someone who has suffered with extreme panic attacks and anxiety in the past, I wanted to say thank you for this video. My anxiety got so bad that I had depersonalization and derealization. This lasted for almost two years! Raising awareness of mental health issues and attacking fraudsters is very important and I truly appreciate your vulnerability, openness, and advocacy (this literally was an advocacy video dressed up as a commentary video). Thank you again!",
        "I did watch the whole video eventually, but it was also on my Watch Later playlist and I fell asleep one night watching it, so I guess I DID pretend to watch your video…",
        "idk probably kinda corny but hearing drew talk about anxiety and depression since these are things i also suffer from is making me feel more valid and loved",
        "drew's hair actually looks really good imo, the faded blue looks so nice with the natural color",
        "I have this horrifying brand-new phobia. I actually just sleep with a crystal. idk.",
        "\"You know what else has bluetooth and can vibrate?  A thirty-five dollar. . . \"\n\nwas not expecting that sentence to end with \"xbox controller\"",
        "Great video- \n1st time watcher - I suffer from depression ( from time to time) \nReally enjoyed your insight &\nI appreciate how you’ve exposed these snake oil companies!! ",
        "DREW IS THAT A STROKES VYNL AT THE BACK",
        "Hey Andrew",
        "What sleep tracker do you use Drew? That seems like an actually useful thing",
        "It was also very entertaining to watch the cat at the end of the video just sit there like a potato after being trapped.",
        "59:19 The comedy of Odin having to turn again because he has no right peripheral and didn't see Heimdall move to that side, incredible",
        "Idk why i feel the need to share this but I watched my first hallmark movie the today and it was called \" The Christmas Detour\" and by people's usual hatred of hallmark it wasn't the worst but the plot was terrible",
        "this is the most annoyed i've ever heard drew",
        "Don't worry I ended up with practical the same thing. Dyed my hair like 5 months ago and now half my hair is blue the rest is dark blond. Gonna tell people I'm cosplaying as drew gooden now",
        "\"too bad youre trapped\" this is literally the entire relationship with cats",
        "The sponsor for this should have been BetterHelp ",
        "So good!",
        "Hi Drew, try the \"waking up\" app for your phone. You can choose if you want to pay for it (it's very expensive) but they also give you the option to send them an email to ask for free membership if you can not afford their prices. They have given me 2 years in a row a free membership now and the app is really helpful in learning how to meditate and think about life. Might help with your anxiety. Good luck!",
        "I've never seen Drew as stressed out as in this video, engaging with calming technology",
        "great video is fantastic",
        "I love how for like 3 minutes the cat is just cleaning itself wild. I can hear the slurps from here",
        "His hair looks like heavily dyed mint chocolate chip ice cream",
        "Thank you for sharing your experience with panic attacks. I have extreme anxiety but I’ve never had a panic attack to that extent. It really means a lot for people to shed light on how much it sucks.",
        "11:44 OH MY GODDD that's where I'm from :'D i almost never get to hear my country mentioned because it's like. Tiny. Not surprised it got stuck here though, everything gets stuck in Slovenia",
        "18:19 I was expecting a different answer... Realizing you probably can't say that on YT though ",
        "wow drew and danny got a haircut at the same time",
        "Plot twist: the panic attack Drew had was a direct result of the realization that he had knowingly spent close to $1500 on scam products.",
        "“my brain forgets we’re supposed to be on the same team” is the best description of anxiety i’ve ever heard",
        "hey drew. i love you guy. you might never read this but i felt in this video you were (sort of) a different person, but because of your anxiety, probably not because of the products. this was a refreshing one and I've always thought you have a really good, creative style and i can see you writing and selling books one day. i really hope you do better moving forward; you've definitely helped me feel better just by being your goofy funny sensible self! mental health is such a wonderful yet difficult journey and sharing our stories - and warning each other about unnecessary products - is important. you're doing an amazing job, whether it's roasting a bad movie or exploring the mental health world. much love and affection ",
        "I watched this a few hours after having the worst panic attack I've had in my life so far and it felt very.... comforting when Drew talked about his one mental health. Sometimes when you feel alone after or during those kinds of things it's nice to have a reminder that others understand what you're feeling and going through.",
        "that things a vape without the good part",
        "Anxiety is tough, I’m glad you are ok drew, you seem like a strong person mentally :)",
        "I was watching this in the same room as my mom and she thought you were so funny she’s subscribing",
        "13:45 is that ninja from fortnite?!?",
        "\"Sometimes my brain forgets we are supposed to be on the same team.\" LOL that is so very accurate",
        "Your mic is so perfectly lit ",
        "Me: Orders packages during November \n\nMe: Opening package in July",
        "It’s weird but I like hearing Drew talk about anxiety struggles and stuff. Obviously it sucks that it’s happening to him, but his transparency about it makes others with anxiety (like myself) feel a little less alone in the fight against bad mental health, yknow? Thank you Drew :)",
        "This guy looks like he enjoys watching if you know what I mean.",
        "I’ve never been attracted to drew before now.",
        "As I get older sometimes I worry about not finding my favourite creators funny anymore but the line \"I don't want any emails ever.\" is by far the most relatable and funny sentence I have heard in a while.",
        "This seems like a new iteration of those balance bracelets.",
        "watching late stage capitalism unfolding through the lense of drew's hyperconsumerist videos are genuinely so eye opening",
        "13:10 made me choke from laughing thanks for almost killing me drew",
        "Honestly, slay",
        "I love how they are like \"Be less stressed by putting expensive electronics near your brain. The human brain has no history of working properly without this device.\"",
        "drew more like blew",
        "This guy is not an actor, he was just so stressed out by wearing a onesie to work so he needed something calming to stick on his chest.",
        "7:09",
        "Obviously I don’t hope for you to have another panic attack, but I at least hope if you do, that little breathey thing really does something helpful because you spent so much on it. \n\nAnxiety is awful. I haven’t had an anxiety attack in almost a year now and I’m so grateful. Good luck out there Drew, thank you for making this video and talking about mental health. Means a",
        "please try this chocolate called Tabs haha",
        "imagine spending $400 on a vibrator lol. My girlfriend bought a pink egg for $50 bucks. She seems pretty relaxed to me after she uses it.",
        "my most expensive vibrator cost around $40 and it definetaly reduces stress and anxiety",
        "Toning the vagus nerve is actually proven to be effective with anxiety! However you don’t have to buy an expensive product to do that. Humming, tapping on your chest, and applying something cold to your chest are free ways to help with vagal tone.",
        "idk how to fix depression, but for anxiety what helped me is gabapentin(prescribed by a psychiatrist). It’s not an ssri, so it won’t make you happier, but it helped me leave the neet lifestyle I had fallen in and i could be in a room with for mother for more than a minute again without feeling intense discomfort, and even leave the house without feeling like I’m falling off a rollercoaster.",
        "As someone with ADHD, Anxiety, and BPD I love hearing youtubers I watch talk openly about their struggle with mental health. It makes me feel like im not alone, Thanks Drew",
        "I think a lot of these products are heavily based on \"Use the placebo effect AS MUCH AS POSSIBLE.\"",
        "My mom saw me watching this on my computer and asked \"Is that that Ninja guy that was on Jimmy Fallon that one time?\" and seeing as Drew took the masterclass, I said Drew was Ninja's younger brother and she was totally surprised but saw it and smiled!",
        "25:40 \"Mr. LaForge! Run a level 3 diagnostic on whether or not any of this crap does anything!\"",
        "drew you have to make a review of lindsay’s lohan new christmas movie it’s called falling for christmas. Please️",
        "Hey Drew, interoception is the sense of interpreting internal sensations. Hunger, thirst, racing heart, tiredness etc. Often people who are oversensitive to this sense, experience symptoms of anxiety as your brain misinterprets the physiological discomfort as you are in danger. No idea what this product is but interception is real. Other senses not often taught are proprioception (knowing where your body is in space) and vestibular (your sense of balance/ knowing how your head is moving against gravity).",
        "I’m sorry you had a panic attack drew  I know everyone has their own techniques but what usually helps me is something to write with when I go non verbal and a glass of cold water. I know it honestly feels like your dying but it helps me. ",
        "I’m eat pizza!  thanks drew",
        "hey drew, thanks for opening up about mental illness. It made me feel better :)",
        "Thank u drew gordon",
        "Placebo doesn't mean it does nothing, it means it doesn't do more than the act of doing something and/or trusting an expert/celebrity. \n\nThe costs make some sense, because their market is going to be tiny. Most people will assume it's a scam. Economies of scale suck when you're the little guy. ",
        "Love this man's videos. Always brings a smile to my face to see he uploaded \nOne of my favorite stress reliefs is playing Minecraft PE in the late, late hours with Drew's videos playing on the miniwindow\nThank you so much for your humor and entertainment, Drew. It means so much to me and is a massive help to, well, ironically my mental health",
        "Random invasive suggestion: store your water jugs out of direct sunlight. ",
        "The calmigo is like the opposite of an inhaler. It's literally an exhaler",
        "I was at a restaurant in Bundaberg Australia where a Drew Gooden doppelganger was playing Piano. If that was you, you have a gorgeous baritone voice and fantastic choice of songs.",
        "the cut looks fresh Andrew",
        "Hey I'll sell you a pair of those 1980s space visor sunglasses with magic brain synchronizing hologram stickers installed on the inside. Guaranteed to maybe make you feel better or sleep or whatever if you wear them for 12 hours a day for 6 months.",
        "yeah my mom got me the calmigo and it did not do shit ...as expected",
        "these things are so transparently a scam that it makes me mad, taking advantage of people whose mental health might not be the best",
        "You know what cures anxiety? Going to the gym, living an active lifestyle that affirms life. Stop sitting around on social media knowing your stalling the inevitable. Do something that pushes your limit, your brain will thank you later.",
        "Was hoping Drew would try the Oura ring bc it’s something I’ve heard about from ppl in passing rather than ads but it’s sold more as a health thing even though seems to do similar stuff",
        "Smoke some weed. Sure fire way to guarantee to cure anxiety unless it makes you paranoid ",
        "It’s really messed up that mental health items like this are so expensive. The markup alone is insane. And the products are basically nonsense.",
        "you know what else has Bluetooth and the ability to vibrate? \n\nme: a vi-vibrator?",
        "So, to sum up, you recommend these?",
        "\"Call me a cynic but I'm not buying it.\"\n\nYour bank account has stated otherwise.",
        "glad to hear you’re doing better now drew, i struggle with anxiety too so i understand what you’re saying. also your “sometimes my brain forgets we’re supposed to be on the same team” metaphor is spot on and i will use it forever now",
        "11:47 why he kinda… ",
        "I would say my anxiety overall is fairly mild and fairly easy to cope with, but I do want to add that I'm happy you mentioned what it's like to be in a depression loop and people thinking \"you're not depressed, you're just lazy\".  That has been the bulk of my life since I was a teenager. I know you've mentioned you used to smoke a lot of weed back in the day and I did too - like a seriously excessive amount - and I wonder if we were both doing it as a 'coping' mechanism. I think a lot of people turn to weed as an anti depressant but I don't think I've ever seen it work. All it did for me was make me very quiet and give me a different excuse as to why I didn't get off the couch for 10 hours.",
        "Real question. .. WHEN ARE YOU GOING TO TRY SHARK TANK ITMES",
        "i’m glad you’re doing better, drew. i just got out of one of the worst depression and anxiety bouts i’ve had in years. you just sort of mentioning your struggles, even as quickly as you did, was a kind of therapeutic reminder that i’m not alone and even people whose content i adore so much go through the same thing.",
        "Have you tried giving up Caffeine? (if you even use caffeine). If giving up caffeine doesn't work you should stop committing crimes.",
        "\"You know what else has bluetooth and the ability to vibrate?\" \nXbox controller was not what I thought the answer was going to be lmao",
        "drew “stimulated by the ball” gooden",
        "Whatever marketing department thought that someone saying 'I think it works' would be a convincing testimonial, needs to be fired.",
        "to think all this data, including literal brain activity, is collected and sold is actually scary",
        "Do a Rimworld lets play drew plz i would love it so much",
        "have you tried drug?",
        "that egg that you put on your chest is almost exactly the same idea as nested bean pj's for babies. those have a little weight on the baby's chest to stimulate the idea of mom or dad's hand on the baby's chest to calm it down. we're adult babies now.",
        "Genuinely I love how drew uses both sides of an argument as a thumbnail it’s very cool. Also I feel bad that he had a panic attack, I’m glad ur doing ok drew",
        "The sensate thing looks like the insert that one of my kids teddy bears has in it. The teddy bear is meant to soothe small children and has a heartbeat setting and a constant vibration setting. The teddy bear was $30 though so a very different price.",
        "I used to suffer from extremely debilitating panic attacks basically daily, I remember feeling like it could never change. \nJust want to put it out there that things definitely can get better, I don't have panic attacks at all anymore. \nA big thing for me was learning to identify early on when my brain was starting to go down that route and take some action to slow down and keep things steady. ",
        "Anyone have experience with opiate drugs? just for the sake of asking if anyone who has panic attacks and is somewhat familiar with drug overdoses, I wonder if the 2 horrible experiences are similar or not at all. I ask bc I was doing some strong opiates that I wasn't used to, that wasn't exactly pure. Anyways upon ingesting caffeine, with opiates and some calming meds, xanax, and all of a sudden a sinking feeling in my chest, and focus on whats happening and if Im going to need the hospital or not. for hours I was walking around, I feel like i couldn't sit down and I did'nt for 4-5 hours. Later in the hospital I finally felt safe as well as took more xanax, I felt back to normal.",
        "I love how your videos are edited, from the music to the clips inserted to the random zooms. Such quality content that’s enjoyable to watch.",
        "nice sanitary pads, drew",
        "you should play one of those games that promise you real money",
        "I see that hail the sun album cover in the back, they are my favorite band",
        "I love watching Drew slowly develop a debilitating shopping addiction",
        "I haven't been getting Drew's or Danny's notifications!",
        "Something that has helped my panic attacks is actually coloring books lol. I don’t know why it helps but I think it gives me a sense of control. I’m 27 years old and color in my coloring book every night before bed. It hasn’t helped with insomnia though. Still in the dark for that journey lol.",
        "I literally just learned what interoceptors are last night in my anatomy class. They’re receptors that perceive information coming from INSIDE your body, like from your organs, and they send info to your central nervous system (brain and spinal cord). I’m pretty sure that vibrations would be perceived by exteroceptors, or receptors that send info to the CNS about external stimuli/ environment, since the vibrations are coming from outside your body, not inside. But hey, I could be wrong.",
        "2:08 I’m scared at how much that sounded like danny",
        "Next time that you want to read a paper that they cite in one of those product you can go through the paywall with Scihub. I personally think access to this kind of knowledge should never be locked through a paywall (if you dont agree its fine but i wont answer if you want to argue about whether or not this is ethical)",
        "Interoception is a real thing. Your ability to close your eyes extend your arms and to know where they are without seeing them is a part of interoception. Sensory nerve cells in your tissue (skin muscles and sinew) telling you where in space your arms are. This is specifically proprioception one segment of interoception. The other being visceroception which pertains things like the feeling of a full stomach or the need to pee.",
        "I find drinking water can help if I'm having a bad anxiety moment, because I can focus on the water and swallowing. The only issue is when I stop drinking, it usually comes back because I haven't resolved my feelings about whatever is worrying me. Bruh",
        "The Oura ring you mentioned has a subscription base. The company had some drama with Linus Tech Tips. They seem suspicious given their businesses practices. Basically Linus said he would never work with them again.",
        "The oura ring is a legitimately goated heath tracker that was probably just used to collect data for their sham study.",
        "The real mental health booster here was watching and rooting (heh) for the hair journey. What an absolutely exhilarating experience. Got so much satisfaction, greatly improved my mood. Congratulations on no longer hosting the alien on your head Drew!",
        "you are very good and handsome thank you for working hard.",
        "“Sometimes my brain forgets we’re supposed to be on the same team.” I’ve never felt Drew more relatable than I do now.",
        "Maybe it’s not that deep but it’s pretty disheartening and upsetting how aggressively these companies are taking advantage of desperate/vulnerable people. ESPECIALLY at these price points. \nI admire your patience but very early on they stopped deserving the benefit of the doubt lmao",
        "4:21 I’m sooooooo happy to hear someone else describe it like that, whenever I get freaked out or have panic attacks I’m just like why the fuck is my brain sabotaging me all the time we’re on the same team!",
        "This 41:18 min long video created by drew did more for my mental health than any of these things could do",
        "Always good to have 41 minutes to watch Drew.",
        "This video is goofy but also Drew is a true homie for openly discussing mental health.",
        "22:20 sir, blink twice if you need help",
        "86 the hair but keep the concern for your viewers.",
        "how does the lief subscription even work? do they come to your house and rip the thing off your chest if you don't pay or what",
        "are we just gonna ignore drew's guitar skills ️",
        "selling a brown paper bag you breathe into for panic attacks $400",
        "the inhaler looks like freiza",
        "I didn't know Drew suffers from severe panic attacks, too. I've been dealing with them for most of high school and landed in a mental institution just a year ago due to them. My para-social bond to him just grew stronger lol",
        "My heart rate was worrying low when I started wearing my smart watch",
        "You should have tried the Fisher-Wallace! Lots of credible research that’s publicly available, and the device helped me a lot. I bought one that was previously used in one of the studies for a good price. Cheers.",
        "ngl i kinda liked the blue hair\njust a little",
        "I like how his hair has gone from light blue to Baja blast green",
        "Glad to hear that you're doing ok.I have anxiety attacks every now and again and they can be debilitating, so I get you on some level",
        "the strokes are overrated.",
        "Tbh, Drew, the case of the Work Wonnies guy makes perfect sense. Remember the distress that going to the bathroom in that onesie caused you? No wonder the dude needed some anti-anxiety product after that traumatic experience",
        "I actually did get a calmigo! My mom bought it for me, kind of a while ago and I really doubt she would've spent that much on it. I think it used to be cheaper. I really liked it; haven't used it in a while coz I'm actually on anxiety meds now but at the time it was really helpful. I struggled a lot with regulated breathing so it was a nice guide to have:) def would not recommend it for 200 bucks tho",
        "Of course they don't.",
        "Panic attacks are awful.  None of the stuff will fix you.\n\nRead some Nitzche and Jung.",
        "Drew's hair looks like the paintbrush I would carry around everywhere as a child, oddly green and probably smells like mold"
    ],
    "comments_disabled": false
}