{"video_id": "CXIr6VOt5Xg", "comments": ["http://www.planetballs.store/\nFun fact: our store uses mostly recycled and organic materials!!! \n\nThe store will be available for 30 days (and 2 nanoseconds) starting TODAY!!!", "Legend has it Jupiter is still saying,  \"Extra-extra-extra...\" to this day", "Planets doing a shopping spree might be the greatest thing I've ever seen yet!", "Let’s just appreciate the team real quickly? Their talent and work really shows in the animation quality and voice acting !!!", "A legend never truly die, because as long as his videos are still around, we have something to keep him alive.", "I just love the little detail over the fact that jupiter keep on going with the \"extra\".\n\njust shows how does the team cares about making these little series, althought it's really short.", "That \"I'm free\" quote at the end really hits different after his passing. Rest in peace, Techno. You will be missed dearly.", "TWO VIDEOS IN A DAY!? That's right! Rejoice!!!", "The fact that he uploaded 2 videos a day is just Amazing Let's give this guy a applause Keep up the good work.", "This will be so iconic, to see planets shopping together in a mall! Can’t wait to see what each planet will buy! :3", "Love that Jupiter still going extra extra extra !!", "Just imagine being on earth and then you look into the sky and see the roof of a store. Would be kind of cursed ngl.", "The transition from the Pixar lamp to the boat train, that was incredible", "What we expect: Two solarballs videos explaining more lore or something\n\nWhat we are getting: m e r c h  a d", "I'm so excited to order these, Love your incredible animations!", "This is the best solar balls surprise ever, expect when they appear, THAT WAS A THE BEST MOMENT", "I love the idea of them just having that stuff in the back or instantly 3D printing it somehow", "Thank you solarballs and friends for this amazing content I really appreciate it.", "Solarballs is on fire with uploading videos. Can’t wait to watch both videos!", "Let's take the moment to appreciate how much effort and time he puts into his content for us", "What we expect: Two solarballs videos explaining more lore or something What we are getting: m e r c h a d", "It’s hilarious how well solarballs hid that this was a merch advertisement", "I’m very excited for these two videos I can’t wait :D", "Holy shit Mick living life like its death note. Dude spent two years creating and refining his defense for absolute destruction.", "I don't know how they make these super quality thumbnails....+2 videos in 1 day!Yay!!", "Siglis reaction to SSundee being of the cause of his torment that entire round made my day priceless", "I'm defiantly getting SolarBalls merch love your channel keep up the good work", "Annihilape and Tinkaton are definitely the ones I'm looking forward to the most outside of the paradox Pokmon", "I never thinked a channel about planets and cosmos will drag me down than the original channel with countryballs.", "Jupiter says extra multiple times, the faces he makes are so funny, Nice Job!", "Thank you so much for releasing this now I get to have your merch everywhere", "Gonna be buying some soon! Definitely gonna get a mug.", "These guys are able to do 2 vids in a day thats very impressive", "I am telling you right now, this is gonna be a merchandise announcement.", "As a cuber, the most iconic part is when he throws the rubik’s cube", "I swear in 5  years or something I'll come back to these videos and go \"ahh my teenage childhood I miss it so much\"", "Yay! We finally get SolarBalls merch! Also I actually got shocked at the fake outro screen there lol, I was like \"Bruh, that was it lmao?\"", "Two episodes in a day!!!! Wow! keep up the good work!", "Wasn’t expecting an ad here but still always makes me crack up", "I always wondered where they got those huge cards.", "Hold up… a store?? How are they going to do that??\n\n\n(Oh, I see.)", "Podrías hacer un reencuentro de todas las lunas de cada planeta please", "I do like how Jupiter needs to say extra about a thousand times or more for his T-shirt size", "The fact that he made video on his merch but made look like real video is insane lol", "HUH that's so cool. Mad respect for him.", "I was drooling with my eyes wide open when i realized that that was merch.", "0:14 that actually convinced me for a second, the fading in looked so real", "episode amazing as usual", "If even your comercials are fun to watch, you made a good job", "Ayo? Number 11 on trending? This is the kind of achievement I love to see cool channels like this get ", "That \"extra, extra, extra\" at the ending! HAHAHAHAHA SO FUNNY", "0:14 I love the foreshadowing there", "I can't wait to see your merch!!", "We need a full episode of the planets going to a mall instead of it just being the thumbnail", "If there was a store in space I'm going straight in", "Two videos a day, AMAZING!!!", "Astrodude: opening a store in space.\nBiggest planet in the solar system: wants a shirt\nAstrodude: uh oh", "Looks like planets are getting civilized!", "Damn, Astrodude really broke the 4th wall", "I love how the video about the merch is the one that ends up on trending", "We don’t know but Jupiter might be still saying “EXTRA EXTRA EXTRA EXTRA” to this day", "This is the most creative merch ad I've ever seen", "0:13 I actually fell for it lol", "This is amazing can't wait for the next video", "Legend has it that Jupiter is still saying extra to this day", "ok this is awesome as hell.\nhope to see a shirt with the sun and his backround smile someday", "I shall buy merch, because it's actually dope.", "I feel like the pet shop would just be different alien life forms", "Solarballs is fantastic", "The fact this whole video is a massive advertisement for there merch is absolutely amazing", "Someone who goes to the ISS should take one with them and make a photograph of him wearing it in space", "I love how jupiter still says \"extra extra extra\"", "Jess is so close to 15M we need to get her there!!", "Wait, Everywhere on Earth? Okay! Let me pack my things together cause I'm gonna go into the Mariana trench and I'm gonna buy one down there, guess you need to get a sturdy submarine with a docking module! XD", "The sky on earth rn: A STORE", "I love how jupiter said \"as long as you are on earth\" imagine aliens watched this video", "Legends say Jupiter is still saying extra to this day", "did they seriously make a whole video on a plug for their store? Wow!", "They actually got me with that fakeout because I wasn't paying attention to the timestamp lol", "Is it just me who thought by clicking on this video they would show u how in the future we could have a store in space", "You could bet me 50 tries to tell me what episode this is and I could never guessed", "This is so well made solarballs", "i hope the merch is all over the countries i want it sooooooooooo badly", "Me encanta por que no se siente que me acabo de comer un anuncio. ¡Que creativos!", "Omg 2 videos In a day! My dream has come true! Also idk why but \"hey astrodude\" got me dead laughing on the floor ", "I like this video so much I want to watch it over and over again", "Make next one a battle :Sun VS Sirius?! How does that sound?", "Two videos in a day???? This is the best day of my life!!!!!!!!!!! ", "I like how jupiter keeps saying \"extra\". Even in the outro.", "Now this is a good way to plug your merch", "Legend has it that Jupiter is still saying extra to this day.", "You should do a video on Mars being terraformed!", "SolarBalls' content is starting to get a lot similar to Mr. Spherical's content. I wonder if he know that SolarBalls already stole their art design.", "We need a Solar Balls Wiki ", "theres a bittersweet irony to watching technos own videos as a comfort mechanism. rest easy", "20 years later and Jupiter will be stuck in the \"Extra, extra, extra, extra\" loop.", "You should do this more please", "Legend says Jupiter is still saying extra to this day", "Excelent", "This is probably one of the only merchs i actually want to buy."]}