{
    "video_id": "CXIr6VOt5Xg",
    "comments": [
        "Astrodude played a rubix cube",
        "Solar balls",
        "worlds shortest vid of slarballs 0:00 to 0:14",
        "Make plannet plushy’s and also plannets made out of wood (that will be the higer price variant) and a cheaper version made out of plastic.\n\n+sun and moons",
        "Can’t wait!",
        "Do I hear merch",
        "The fact that he made video on his merch but made look like real video is insane lol",
        "What",
        "Rocket flying to Venus lol",
        "Did you know that Venus and mars were both Habitable in the early solar system",
        "Hm",
        "Would've been cool with GLaDOS being the voice lol",
        "Next vid: Astrodude crashes on Venus",
        "how did i miss this???",
        "I just love the little detail over the fact that jupiter keep on going with the \"extra\".\n\njust shows how does the team cares about making these little series, althought it's really short.",
        "I’m sorry I’m a alien ",
        "0:14 fake screen cards",
        "Damn Nice ",
        "Spore aka space store",
        "0:14 Is that a new video coming soon in the fake outro?",
        "Oh Well I Why Space Astronomis Make A Space Store Thats A Good idea",
        "Someone who goes to the ISS should take one with them and make a photograph of him wearing it in space",
        "What if i live in ohio?",
        "Nive ",
        "2 VIDEOS IN A DAY?",
        "Well late",
        "The best merch I’ve ever seen in my life!!!",
        "Astrodude: opening a store in space.\nBiggest planet in the solar system: wants a shirt\nAstrodude: uh oh",
        "I AM BUYING A MUG",
        "Aumsum’s solarballs is more educating",
        "Wow two videos in a day!",
        "I dont have money to buy it, its really expensive for my country",
        "Day 1 of asking for you to make a skit about Ohio",
        "0:15 THERE IS A SIGN OF A NEW VIDEO AT 0:15",
        "At 0:14 the vid must be a leak for another video",
        "0:15 ayo new video",
        "bro i see a ad of smash planet idle taking your video and muted voice and voice it",
        "0:14 lol that got me",
        "You should also make a channel membership in this channel because I can't afford a merch but I will continue to support you",
        "1:15 new video thumbnail",
        "Solarballs: I think your video is an awesome",
        "Isn't Jupiter gas why is he getting a shirt",
        "I NEED SPACE MERCH I love space ",
        "Legends say that Jupiter is still saying “extra”",
        "Because I saw the sun consuming astrodude",
        "Ayyy back with the w videos",
        "i fr thought it was ending already ",
        "at 0:14 there's a sneak peek of a new video.",
        "???",
        "an advertisement is in 15th on trending :o",
        "Do you sell for $25.49? I can't read",
        "I love your videos SolarBalls it’s sooo cool So pretty especially Uranus and Neptune",
        "Nice advertising",
        "I feel clickbaited",
        "Sick clothes\nWell was that a video coming soon?",
        "Two videos day keep it up mate!",
        "0:15 new vid spoiler?",
        "again new video",
        "0:14 leaked vid?",
        "How much fabric would we need to make a t-shirt big enough to fit a gas giant like Jupiter?",
        "0:14 next thunbnail",
        "Is it okay if you can ship it to Saturn im too tired to go all the way to earth again",
        "I want to buy one, but I lived in Mars",
        "Way not on Pluto",
        "They actually got me with that fakeout because I wasn't paying attention to the timestamp lol",
        "Aliens are missing out",
        "My Question the end prank the Venus with rocket thumbnail can be a new solorballs video maybe get this to 100 likes please",
        "Congrat on your space store solar ball",
        "If even your comercials are fun to watch, you made a good job",
        "0:15 is that also a up coming episode?",
        "Lol",
        "Legend has it that Jupiter is still saying \"extra\" to this day...",
        "That is so cute      ",
        "aliens: bruh",
        "Did he just LEAK A THUMBNAIL",
        "Let's take the moment to appreciate how much effort and time he puts into his content for us",
        "0:15",
        "You guys shipping to North Korea?",
        "NOOO I LIVE ON MARS",
        "When there was that fake end of the video did you just leak a upcoming video",
        "If only you made a neptune plush",
        "0:15 we got a thumbnail to a new video",
        "This is the most special episode",
        "0:15 Is this recommendation one of the future premiers?? I wanna see!!!",
        "Jupiter Just Said Byyyyyyyyeeeeeeeeeee",
        "SolarBalls' content is starting to get a lot similar to Mr. Spherical's content. I wonder if he know that SolarBalls already stole their art design.",
        "0:14 is this a secret vedio?",
        "Nice Concept and Video SolarBalls!",
        "they leeked a new video",
        "best ad ever! ",
        "I always wondered where they got those huge cards.",
        "0:15.ayo is that a new video leak???",
        "Now, Show us all the voice actor.",
        "nice animatin hi from nigeria",
        "Planet balls?",
        "Aliens: WHY I JUST WANT A SHIRT BUT I HAVE TO LIVE ON EARTH",
        "Two videos!!!\nYEAH BABYYYYYYYY!!!!",
        "0:15 4th wall break and possibly a new video",
        "0:14 NEW LEAKED VIDEO11!11!!!!!",
        "Extra extra extra",
        "Are you a sushi astro dude?im just curious. ",
        "0:15 I bet you that’s the thumbnail for a new video",
        "The sky on earth rn: A STORE",
        "That's AWESOME!",
        "You should do this more please",
        "Yes",
        "We're shipping EVERYWHERE! ...as long as you live on earth",
        "0:14 new video teaser??",
        "Astronuts in space are very mad",
        "Seeing Jev genuinely enjoy a game while he does a camo grind is such a wholesome thing to me. ^_^",
        "Extra extra extra extra extra extra extra",
        "BRO I WAS WATCHING YOU AT 10K U HAVE GLOW UP SO FAST NOW 500K? Congrats",
        "At least we have a hint at the next video",
        "is the fake end screen foreshanowing another video? :0",
        "i live in a different universe so i can't get the merchandise ",
        "What how is there a space super market?",
        "2 in one day",
        "0:15 a new video?!",
        "0:14\nVideo leak (I think)",
        "0:14\nSPOILERS OF NEXT VIDEO????\nVENUS AND A ROCKET",
        "Has anyone seen the “end” there is a video I think it could be the next it could be something like: Why is Venus so hot?",
        "This is 12th on trending!",
        "Jupiter needs a t shirt  a billion extra large ",
        "How long until the plushies tho",
        "Two videos in a day???? This is the best day of my life!!!!!!!!!!! ",
        "0:15 LOL",
        "Did I just watch a YouTube video or an ad? ",
        "You should put Wheatley flyingthrough space If you know what I mean..",
        "When you hit a million please make a 30 minute video id love that",
        "I live on Mars how dare you.",
        "How many times Jupiter said extra to today it's 1500000 times why Jupiter is gigantic",
        "Hey I just saw a new video in 0:15",
        "Legend says jupiter is still saying extra until the next video",
        "Oh yes finally merchandises",
        "Merch boiiii",
        "Oh I'm on Mars :(",
        "It so funny",
        "a creative way of advertising!",
        "Legend says Jupiter is still saying extra to this day",
        "0:15 Teaser For Next Video?",
        "Hey if you guys saw in that little troll where the episode ended so early, you could actually see a rocket flying to venus.. and from the last video about the earths pollution we are pretty sure that venus kinda wants humans on him. So does that mean the next video or just soon in general we will get a video about venus wanting life on him?",
        "Ватофаааааак",
        "Can you do lazada and shoppe",
        "Dang it man I live on the planet 0-104",
        "Double upload let’s gooo",
        "0:15 Next Video Leaked",
        "Funfact: at 0:15 can you see a video, that’s not released yet.",
        "20 years later and Jupiter will be stuck in the \"Extra, extra, extra, extra\" loop.",
        "Me living on mats : ",
        "Can you make more videos about uranus and neptune there both funny please",
        "There are a lot of stores in space, because Earth is in space (and we're probably not the only creatures with stores).",
        "Me:Is this an ad?\nSolarballs:Yesn't",
        "0:15 is that going be new video soon?",
        "shipping everywhere as long as you live on earth...\n\nISS crew: .........frick....",
        "one small issue, where did they get cards that are bigger than Africa",
        "0:14 I love the foreshadowing there",
        "I never heard about this drama a few years ago. I knew Mick because of his work on the DOOM (2016) OST. I had heard nothing but good things about the soundtrack, and after listening to it, I started getting into the metal genre as a whole. The soundtrack was amazing, and to be called a sloppy and lazy worker just shows that they don't care. This Marty guy seems like a real piece of work, and I hope he gets what he deserves. ;)",
        "Wait a minute how did the planets learn English?",
        "bro this is an ad revanue",
        "In the end Jupiter is STILL saying extra I think it’s going to be a year until he stops",
        "I live in North Korea when can I get myn ?",
        "What we expect: Two solarballs videos explaining more lore or something What we are getting: m e r c h a d",
        "Annihilape and Tinkaton are definitely the ones I'm looking forward to the most outside of the paradox Pokmon",
        "Pleas do more two videos",
        "0:14 WHAT IN THE WORLD VENUS",
        "I need a T-shirt, can you send it to Saturn, please?",
        "At the first part I actually fell for the fake outro",
        "Extra extra extra extra",
        "I think you should make solarballs stuffed animals of the planets and moons",
        "Aw man  I live in Jupiter ",
        "planetBALLS (ayo?)",
        "When you wonder what size shirt Jupiter would wear.",
        "Oh man I gotta go to space to get it from the designer will IAM taking the first space X rocket",
        "I love these ️, but It's too short ",
        "when the computer said no I acctually thought the vid ended",
        "Dam noice 2 vids in an hour",
        "The 4th wall",
        "Extra extra extra extra extra…",
        "People who live in North Korea:",
        "0:14 new video leak ?!?",
        "I’m emptying my wallet!",
        "Could 0:14 be a new secret video?",
        "Moon: hey earth we should get this shirt it's has you and me on it \n\nEarth: uhh no I want something cooler than that ",
        "There’s no store in space.\n\nBut there’s a Restaurant at the End of the Universe.",
        "Sucks that it's only shipping to Earth. I live on Neptune which is pretty unfortunate.",
        "Aw man I live on Mars I wish I could buy one of those shirts :/",
        "The fact that he uploaded 2 videos a day is just Amazing Let's give this guy a applause Keep up the good work.",
        "This will be so iconic, to see planets shopping together in a mall! Can’t wait to see what each planet will buy! :3",
        "the shirts are close to the location i am in italy",
        "ooo",
        "There’s no storage space the only store they have is earth where are you live in",
        "episode amazing as usual",
        "buy some merch or Astrodude stays in Space",
        "Close one",
        "0:43 Is That The ‘What If Plants Collide’ Thumbnail?",
        "Thank you solarballs and friends for this amazing content I really appreciate it.",
        "Cool",
        "merch go brrrrrrrrr",
        "im totaly buying",
        "0:14 is this a teaser for an upcoming video?",
        "Wait did Jupiter get hes Merch?",
        "Very creative plug!",
        "Pause at 0:15",
        "It's so funny that even at the end, Jupiter keep says extra xd",
        "So in 1000 years, Jupiter will still be saying extra",
        "you could make plushies.",
        "How Come There’s a Merchandise Already? It’s Been Just 5 Months",
        "",
        "I don't know how they make these super quality thumbnails....+2 videos in 1 day!Yay!!",
        "Sneak peak of a video?",
        "Buy Uranus;)",
        "okay byeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee",
        "NOBODY TOLD ME ABOUT THIS!!!!!!",
        "I'm back from the shop I got ",
        "dang it i live in mars",
        "Of course, Jupiter needs a shirt so large! He's the largest planet in the solar system.",
        "people on the international space station be like,   :/",
        "Any saw The secret video",
        "Guys, I think we have hint for next video, when fake ending there is thumbnail with Venus and rocket but that thumbnail is not used in past, so I think this is a hint for next video",
        "Dude, my wallet is gonna be freaking empty after this.",
        "Legend has it that Jupiter is still saying extra to this day.",
        "Wow astrodude has really been in space for 5 months",
        "We need a full episode of the planets going to a mall instead of it just being the thumbnail",
        "0.15 when it says watch theese videos and subscribe u can see a thumbnail with a rocket landing on Venus so we don’t. Now if this can be a leaked video",
        "0:15 Forshadowing upcoming video?",
        "hey dude I just want you to know there’s a mobile game stealing your animations it’s called planet smash",
        "0:14 lol that vid looks like landing on venus",
        "The transition from the Pixar lamp to the boat train, that was incredible",
        "14 seconds is not even the end of video",
        "!?!?!?!",
        "0.15 that’s a pretty good thumbnail of a spaceship going into mars or some other planet",
        "Legend has it Jupiter is still saying,  \"Extra-extra-extra...\" to this day",
        "Planet \"Balls\"",
        "ok",
        "Jupiter says extra multiple times, the faces he makes are so funny, Nice Job!",
        "Me and the boys stealing every personality of the planets",
        "Nice advertisment",
        "LMAO",
        "This video is a ad",
        "Hey solar balls I saw that hidden video that you showed when you put up the fake and of the video",
        "The \"It's okay I can take it... I think\" made me sad :( \n\nAnd Astrodude is a bro.",
        "How do you make the vids?",
        "Who invited GLADOS to space? Hahaha.",
        "Already imagining size of store \nIt'd be as big as star and if star have it's own store then the store size would be of universe and if universe have it's own store then the imagination would be the my tiny brain with full load of craps",
        "Ayo? Number 11 on trending? This is the kind of achievement I love to see cool channels like this get ",
        "Es 9 planet zeta",
        "ok this is awesome as hell.\nhope to see a shirt with the sun and his backround smile someday",
        "Can you add childrens sizes pls because My nephew would love one sooooooo much",
        "Puzzles are only available in us",
        "Thank you so much for releasing this now I get to have your merch everywhere",
        "In the 15 seconds of this episode you can see a fake ending and a video that is probably a hint of the next video",
        "0:15 new video leak",
        "I wish I was on planet balls",
        "This is new I didn't see this video",
        "New video leak??????!!!!! 1:13",
        "0:15 future video ???",
        "WHERE IS UY SCUTI STAR ",
        "0:13 wow what a beautiful short",
        "Fun fact: Venus and mars used to have life",
        "I thought that was the end of the vid but the vid its only 1 minute",
        "Is that really possible?",
        "You should make a video about the theoretical 5th giant that got ejected from the solar system about 4.5 billion yrs ago",
        "But they are only shipping on earth",
        "Ha balls",
        "OMFGHFHHKHASKUHHOIAHOHOIDEUUAIASUG I WANT ALL THE MERCH SO BAD! IT LOOKS AMAZING!",
        "0:15 Next video spoiler?",
        "Wow",
        "Why does the sun have shading like I MEAN the sun is a star not a planet",
        "Pov:\nHim: want to buy some of these?\nJupiter: ok but i need EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA EXTRA BIG",
        "How did an ad get on trending",
        "Legend has it that jupitor is still going EXTRA EXTRA EXTRA.....",
        "Jupiter in the background lol",
        "I could print ur posters out instead of buying sorry abt that",
        "Who else saw the teaser in the fake outro?",
        "im guessing the next episode is venus begging for some life forms to visit him but mars is getting all the popularity from the earthlings",
        "I saw new thumbnail we never saw in the fake end!!!!! I smell new esipode ",
        "Also make plushy’s with different emotions: happy, grumpy, anoyed and a sun exclusif psicopath",
        "Where have you been?!",
        "Do u ship in north Korea ?",
        "Jupiter After Millions of Years : Extra, Extra, Extra, Extra..........\nAstrodude: ",
        "0:14 ey is that a new video??",
        "jupiter be like I need 10000000000000000000000000XL",
        "From the fake out I can tell a “Can we colonize Venus” is coming soon",
        "Ah yes",
        "Why only in earth tho no shipping for us in mars here  :(",
        "0:14. Отсылочка на новую серию? ",
        "Did y’all just tease us with a up coming video in the fake outro?",
        "no way GLaDOS just turned into a space ship",
        "Hey solarballs can you make something about blood moon? I will be happy if you do it ! Thats all i want to say. Bye!",
        "I love how in the thumbnail of the fake ending is Astrodudes Spacecraft clearly reentering Venus's Atmosphere And Venus expression be like >:D",
        "You pranked me",
        "Forth wall was broken, good",
        "Wow 2 videos in a day",
        "I dare you to make a video on triton",
        "Wtf....\nYou do a VIDEO just for AD!",
        "If you pause at the right time there is an unknown vid of the sun and a missle",
        "23 hours till this is 24 hours or 1 day old",
        "Интересно, почему это видео не вышло на русском шаронутом космосе",
        "I'm defiantly getting SolarBalls merch love your channel keep up the good work",
        "Make a video about the galaxys",
        "1:07 but i live in nor- 🇰🇵 (gets shot for using Internet)",
        "Sooooo, are the tshirts actually 3D printed?? If not I don't want em >:(",
        "Very settle merch drop",
        "everyone saying to get merch and stuff\n\nJupiter: I need an",
        "Dam I live on mars",
        "I’m very excited for these two videos I can’t wait :D",
        "Me thinking it ended  0:14.",
        "Nice one",
        "0:14 that Venus thumbnail thing tho-",
        "Can you make planets some hands please",
        "Это шо, реклама)))",
        "2 in 1 day! Also sadly i'm probably not gonna be able to get one because my parents would say no",
        "I think solar ball link the next video at 0:15",
        "\"We ship everywhere!\nIf you live in earth!\"\n\n*sad Titanian noises",
        "NOOOO I LIVE ON MARS",
        "This reminds me of the Space Mart from Super Paper Mario where you can buy Chocolate Bars for Squirps and other Stuff",
        "Just imagine being on earth and then you look into the sky and see the roof of a store. Would be kind of cursed ngl.",
        "Legends say Jupiter is still saying extra to this day",
        "I AM BUYING DA MERCH NOW",
        "I thougt it ended already",
        "Now this is a good way to plug your merch",
        "0:14 found thumbnail of your future video :)",
        "0:15 is that a leak for another video?",
        "Did you see that when it fake ended it showed an episode we never saw",
        "I am your biggest fan and i want merch but i cant get becouse i live in a nother galaxy ):",
        "First vid of the channel I see is an add ",
        "I think we just got a sneak peek of a episode",
        "Did anyone notice the thumbnail of venus and a rockship?",
        "0:14 what video is that, or maybe its a hint of a new video",
        "0:14 THEY JUST LEAKED THE EPISODE COMING TOMMOROW",
        "What even in North Korea",
        "Damn I can’t buy the shirts then since I live on pluto",
        "Damit they cant ship to me",
        "Can we see Hamea",
        "What was that video at the fake ending",
        "HOLD ON I SAW VID THAT HAS NOTCAME OUT YET",
        "0:14 IS that a tease of the next video with the fake thumbnail?",
        "Awh, i live on Mars, looks like i can't get it ;[",
        "Alien wil be happy",
        "0:14 is no one gonna talk about the sun and the spaceship?",
        "jupiter wants a uh \nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXL shirt",
        "The price way too high for my country",
        "Hearing that AI say balls is crazy",
        "I too need extra extra extra extra ....... shirt",
        "I WILL BUY YOUR ENTIRE STOCK",
        "The fake ending was funny…and hinted at Astrodude plunging into Venus?! ",
        "What do I Search to get the merch",
        "Jupiter 1000 years later: extra, extra, extra...",
        "They used a thumbnail that doesn’t exist in the fake outro",
        "Corporatism at its height",
        "Legends say, Jupiter is still saying \"extra\"",
        "Me, in mars: why are we still here, just suffer",
        "If the planets wore dresses I would laugh",
        "a double upload? no way",
        "Is it just me or did they just leaked a new vid when they tricked you that it was going to end at 0:15",
        "You could bet me 50 tries to tell me what episode this is and I could never guessed",
        "0:14 i tough is was the end",
        "yos",
        "\"Planetballs\"",
        "This is funny",
        "Guys when the robot says there’s no stores in space when it just cut to the end we saw a video that it’s not on this channel yet that might be the video for the future",
        "Will there be a new video tomorrow.",
        "as long as you live on earth\nmars colonists: you think we're a joke to you?",
        "well this is unusual.. but its great!",
        "wake up honey, new Solareballs lore dropped",
        "2 VIDS IN 1 HOUR",
        "Legends has it that Jupiter is still saying \"Extra Extra Extra Extra Extra Extra Extra Extra Extra Extra Extra Extra Extra Extra..\"",
        "Awww man I live on the moon",
        "Aliens rn: dang it",
        "0:15 sneakpeek of new video???",
        "Two episodes in a day!!!! Wow! keep up the good work!",
        "I love solarballs",
        "At 1:00 legend says Jupiter is still saying extra",
        "0:15 FUTURE VIDEO!?!",
        "BOUGHT A SHIRT CANT WAIT FOR IT TO COME IN",
        "Jupiter after saying the whole size XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXL",
        "0:14 that really got me",
        "Are you related to mr spherical by any chance",
        "I need an extra extra extra extra, extra extra extra extra, extra extra extra extra…..",
        "Did we just see a new video leaked? 0:15",
        "ok so the video ended right? no more?",
        "Two videos a day, AMAZING!!!",
        "New intro returns",
        "Are you actually gonna make a video of Astro dude going on Venus?",
        "You just posted two videos in the same hour?????",
        "There is a game using your content .Did you let them",
        "Jupiter is still saying extra until 5022",
        "\"Legend has that jupiter is still saying Extra Extra to this day\"",
        "0:13 слив?",
        "But I live on mars lol",
        "Jupiter: 90918291737397193817364528 universes later extra extra extra extra",
        "#15 in trending lmao",
        "0:15 the new video?",
        "0:14 0:15 New video",
        "Glados computer ?",
        "someone stole your video to make a advertisement",
        "SolarBalls is just gametoons but about planets instead of games",
        "Legends say Jupiter is still saying extra.",
        "HUH that's so cool. Mad respect for him.",
        "Sneak peak of a new episode",
        "Imagine them on black friday",
        "I like this video so much I want to watch it over and over again",
        "............ what does the planets talk",
        "Just got an add for a game called planet smash and they used your videos and then put robot voices over it",
        "How is no one talking about that thumbnail after the computer said no",
        "Hey there was a video title when the video \"ended\" is that the next video",
        "i actually thought that was the end",
        "0:14 Ayo we just got a teaser for an upcoming video",
        "Some people say that Jupiter is still saying extra",
        "0:15 is that a Easter egg for a upcoming video?",
        "Hey I know you’re not gonna see this but I saw a mobile game using one of yoru videos",
        "2 videos  in 1 hour?!? Just got back from school. NICE",
        "What's next? Plushies?",
        "But I live in the ISS",
        "Is that fake video the next video… cause I want to watch that now..",
        "Aww I can’t get mines am in mars :(",
        "Ok",
        "CAN'T WAIT FOR THIS. ",
        "In the video at 15 seconds where it showed a rocket landing on Venus that could be a future video I think it would be called “Venus has life?” But this is just a theory you can have your own opinion",
        "That upcoming vedio tho",
        "0:15 is that a leak to a new video?",
        "I live on Pluto so anyway you can ship it there?",
        "I shall buy merch, because it's actually dope.",
        "Legend says Jupiter is still saying extra",
        "This whole video=ad",
        "0:15 pause hear this might be a hint for the next video",
        "Planets doing a shopping spree might be the greatest thing I've ever seen yet!",
        "That one person who lives on mars:",
        "Earth can I have earth cup",
        "0:14",
        "0:14 i think the pic on left is his next video's thumbnail",
        "What about in nepal",
        "Let’s just appreciate the team real quickly? Their talent and work really shows in the animation quality and voice acting !!!",
        "0:15, did SolarBalls burn their next videos? There's some video where an astro-dude flies to Venus, I hope that's right!",
        "I's buy it if i had any money (atleast the cup woth all the planet ball stitched togethet",
        "0:15 HOLD ON IS THAT A SPOILER?!?!?",
        "that last byeeeee was from kreekcraft",
        "That actually tricked me for a bit",
        "A store in space? Well, your only customers are aliens and other astronauts currently in space, goodluck earning money! XD",
        "Is there a store in space\n…\nNo",
        "Aliens: shoot now I can’t get cool shirts",
        "Solar balls pls make Astro Dude go to the moon or other moon",
        "\"Somebody in a different planet\" Dang it I can't get my solar balls Merch",
        "I knew it would be a merch advertisement, I still love it though",
        "Mhm, planet balls",
        "\"Extra-Extra-Extra...\" never gets old",
        "Legend says that jupiter is still saying extra",
        "BUT WAIT!!!!! I LIVE ON MARS PLEASE HELP ME",
        "Great way to advertise",
        "It almost  ended at 0:16",
        "To this day, Jupiter is still saying extra",
        "Imagine if the video just ended with the robot saying no",
        "wHAT WITH FOOD??? WE ARE STARVING TO DEATH",
        "Fast upload lol",
        "Lol they made an entire video for merch",
        "0:13 is that a teaser for a future upload",
        "How can a store we have in space",
        "Imagine planets actually have face",
        "Wasn’t expecting an ad here but still always makes me crack up",
        "0:15 foreshadowing?!",
        "Legend says he still saying extra",
        "Yesyeyesysyeyeysysysyeyeyyssyyseyye",
        "Funny how people are talking about how this is an ad\n\nBut not the thumbnail in the fake outro",
        "Yo do you guys ship to North Sentinal Island? It’s on earth, and we kinda need them shirts, these leaf clothes are getting kinda boring",
        "I am glad it's shipped worldwide",
        "Podrías hacer un reencuentro de todas las lunas de cada planeta please",
        "dam i have to go to space to buy merch",
        "Jupiter was the best part in this lol",
        "1:10 DANG IT I LIVE ON MARS I CANT GET IT",
        "Wait why does the shirts have sleeves but they dont have shoulders???",
        "WONDERFUL. WONDERFUL.  Just need some more paying options, then I can buy some for myself too. \n\nBy the way, now that I took a closer look at Astrodude's clothes, it looks as if he's wearing a diaper. ",
        "0:14 New video leak?",
        "I’m in the other side of the world Qatar 🇶🇦 is there a store in qatar",
        "Pull i",
        "1 oF the vid Was sus",
        "Theorie: is there gonna be a venus video",
        "Watch all the knock offs do the same thing",
        "0:15 oMg nEw vldEo sPolLeR yAy",
        "You guys make criminally short videos and are fully aware of it. Is it lack of skill or resources? What's the problem?",
        "I do like how Jupiter needs to say extra about a thousand times or more for his T-shirt size",
        "I thought the video is already over lol\nI bet jupiter is gonna stop saying \"extra\" in a month",
        "Hey can you  make your content loner pls",
        "Omg thx",
        "A leak of a new episode",
        "If You Look At 0:15 And Pause It You See A VIDEO LEAK?!",
        "Two uploads in 1 day!!!1!!11",
        "ameeeeeeeeeee",
        "THAY LEACKING A VIDEO  00:14",
        "Planet balls️",
        "poor jupiter wanted his XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXL shirt mane",
        "Jupiter needs an XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZL shirt",
        "legends says…. the planet is sitll saying extra",
        "Was that a video leak at 0:14 ?",
        "make an video that earth has 2 moons. Earth got an second moon called cruithne it orbits earth weirdly but its still a moon it isnt an giant moon its an small astroid",
        "They sown us the next video idea a rocker landing on Venus",
        "0:14 I think that photo is a hint to another video",
        "Juptier’s size: extra extra extra extra extra gas giant size",
        "this video was so amazing! better all the time!",
        "This SolarBalls ad really caught me off guard ",
        "Good way to promote ur merch"
    ],
    "comments_disabled": false
}