{"video_id": "CyQkW1oTlMc", "comments": ["Also! since I see it's being asked, Necrozma, Solgaleo, and Lunala, were not included because while from ultra space and heavily implied to be \"\"ultra beasts\"\" they are not OFFICIALLY ultra beasts. Also they were in the Legendary Pokemon Battle Royale, so check them out there!\nWhat others would you like to see? And did you appreciate our mascot Snugooi making a cameo with me in the end of TerminalMontage's video?", "Kartana and Phermosa broke my heart.. \n\nThese are always a blast to work on, thanks for working on this with me! I look forward to the next one ;)", "See the funniest part of Jetstream Kartana is the fact that if there was indeed bloodshed, said blood would make the paper-like body of Kartana just become mush. Like what happens to a paper straw five seconds after you so much as touch it.", "Wouldn’t Kartana’s steel typing prevent any of said glue-shots from being effective?", "All I’m saying is Kartana can cut through time and space and make his own ultra wormholes. Combine that with being able to cut through anything, I think it should win 90% of the time", "Fun fact: in the anime, Kartana says backwards “once again I cut a worthless object” which is a reference to Goemon from Lupin III", "Appreciate that you don't just explain what happens scene-by-scene, but also your reasoning for why certain pokemon did well overall in the fight. Another really fun Battle Royale!", "I love that Poipole's adhesiveness and Nihilego's glassy composition were given focus, they're such cool little details! \nGotta give props to Pheromosa spamming the pheromones to cheese the competition, even when it cost them a few limbs for it eventually.", "Now I’m just wondering what would happen if the light trio was included as well in the royale, they are ultra beasts as well as legendaries. But to be honest, Necrozma would likely just annihilate everything", "I really do think Kartana should've won that epic duel. I also loved the Dalek reference. EXTERMINATE!", "I sure do like how the last video wasn't foreshadowing", "Pokemon has so much untapped potential with the Ultra Beasts, at least with designs. But their worlds are where it's at for me, beautiful, vibrant and strange worlds.\n\nI sincerely hope we see more of them in the future.", "I'm just wondering what type Nagnadel's glue shot is, if it even has a type. It looks like a poison type move, so wouldn't Kartana be immune to it?", "The fact Kartana speaks in backwards Sam is amazing", "After just finding the original Pokémon battle royal videos I was hoping that there would be more but wasn’t expecting it the next day! Since most of the Pokémon categories had been covered already I was unsure if any new ones would release. I can say waking up this morning to find these new videos made my day!", "If naganadels brain is on in its lower abdomen, shouldn’t it be at least a tie at the end considering it’s stinger tail was cut up? I’m not gonna lie I’m a little upset that paper boy didn’t win here", "The Pokedex says that Pheromosa doesn't touch anything because it senses something unclean about the world.\n\nBut then, wouldn't Buzzwole be exempt from that? Since it's not of this world.", "I LOVED the poipole opening, my favorite ultra beast is poipole for some reason and my favorite Mario character is yoshi. Thank you", "I feel like Kartana being able to cut “anything” should mean it can even cut the glue.", "Does anybody else remember those mega sized xurkitrees, and wonder how they would’ve fared here", "I really enjoyed the The Snatcher reference in the Terminal Montage video when Nihilego possesses Pheromosa. It made me chuckle probably a bit more than it should.\nAlso I just like seeing A Hat in Time get more recognition even in silly little references like that laugh.", "Fun fact, in the early days of Ultra Sun and Moon, of course with the new mons still being tested, they were all of course put into OU. Bad idea, as Naganadel's only counter in that tier and format was Heatran, who resisted both STABs and also trapped it. However if you didn't know, Naganadel has Nasty Plot, meaning it can even brute force a win against it by just setting up enough. I love this guy, not to mention its shiny is awesome. It even has one of my favorite moves, Fell Stinger, though of course not something it would ever use seriously as it's a special attacker.", "Love how they never disappoint us with their content.  -_-", "This video left me in stitches! I also love how you can see Alola between Gen 4 regions (With Sinnoh being mostly visible) on the left and Unova on the right, just like Hawaii sits bettween Japan and USA!", "A lot of people often forget that Celesteela is also a very clear reference to the story of ‘The Bamboo Princess’", "I do found weird kartana lose to naganadel, even being immune to poison and resisting dragon", "The only pokemon battle Royale that I can think of to come next would be a starter battle royale, Edit: ALRIGHT I GET THERE ARE BATTLE ROYALES THAT COULD HAPPEN", "Maybe Guzzlord’s the big bad for non-legendary Ultra Beasts in the anime, but in the games I’d say it’s a very close second to Nihilego, who really WAS the main antagonist of Sun and Moon.", "I genuinely love all the TCG nods. I absolutely need to see more content based around it on this channel.", "I was honestly hoping for Kartana to have Genji’s voice lines from OW lol", "Lovely to see the duo collab again! Jeremy’s videos were what got me to know Austin’s channel and now I can’t stop watching you!", "I’m confused about Naganadel surviving the explosion of it’s stinger which is a new concept that you created as the body parts of Pokémon aren’t cut open in the games or anime, and also you said that Naganadel’s brain was near it’s stinger so the explosion should’ve destroyed it’s brain or just damage it enough to kill it. So the ending should’ve resulted in a draw.", "I’m actually so glad Kartana made it to the final battle. Personally I feel like it’s one of the least popular Ultra Beasts (though it’s kinda understandable cus it’s 4x weak to fire). According to the Kartana’s official description, it can form tiny ultra wormholes by feverishly slicing into space & time itself, so that moment when Guzzlord devoured it was so funny cus I knew instantly it was gonna be sliced in half internally. I know that Naganadel ", "Looking back on these videos 2 years later after techno has passed it puts a smile on my face on how he truly entertained us all.\n\nWe miss you Techno. Rest in peace. We wish your family is recovering well", "ISHOWVIRUS, this stream changed my life. My entire view of everything that exist in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience.", "Imagine a Kaskade region battle royale. It’d be way too chaotic, but maybe if it was just narrowed down to fully evolved forms it’d work?", "I respect everyone who were involved in this , seriously the best piece that I ' ve ever seen on YouTube ,Hats of the Well All ! Love your videos", "Can we just talk about how beautiful the thumbnails are and whoever draws them should be awarded the best animator honestly", "Still hoping for a Lockemon battle royale", "I love how Markiplier went from an awkward, shy nerdy guy to an awkward, shy nerdy guy that's hot enough to make steel boil. He didn't let his glow up affect his personality outside of maybe being a tad more confident. Dude is a beacon of positivity and integrity.", "One thing i love about Buzzwole in this battle royale is that his flexing poses resemble the poses of the wrestler from Ringside in Rhythm Heaven Fever. Or at least they are similar to me.", "This video is the first one I got notified of instead of the TerminalMontage one. Made me realize I didn't ring the bell for TerminalMontage. So thanks for that, Lockstin.", "Can we just take a moment to appreciate Cory's  hardworking and appreciate him uploading frequently", "The amount of work you both put into these so they are accurate and extremely entertaining is always so wonderful! It makes me sad knowing one day you will have done them all. Till then wild and wonderful trips!", "My friend told me about a PKMN TCG deck that I proceeded to make. This was shortly after the Crimson Invasion Expansion.\nGuzzlord GX (X2)\nDangereous Energy (X4)", "It was kinda obvious that Ultra Beasts are considered aliens like Deoxys, but in a more dimensional invader setting.\n\nNaganadel managing to win against Kartana would make sense due to the former being a sp atk type with access to a fire move, since the latter is super fragile when it comes to range moves", "I appreciate the work you do, keep it up!", "I was rooting for Kartana for the entire video. And it made it to the end. It had fallen in the end. But it went out a hero ", "Fun fact: in vgc17 where celesteela was overused as a staller/leech seed recovery while attacking kartana was eventually used as a counter thanks to his huge attack stat, so kartana taking out celesteela actually make perfect sense as a vgc point of view (in the end people start running celesteela with flamethrower to melt the kartanas but those are some details)", "Petition for mark to have his own podcast where he just reads stories. Literally anything. His voice is so soothing. :-", "As a Hawaiian, I thought Blacephalon hiding in the storm drain was a reference to the nuclear warning (the explosion in the video) we had a few years back, and how parents hid their kids in storm drains. Especially considering Alola is based off of Hawaii. Had a good chuckle. \nGreat video and awesome references nonetheless!", "You forgot that Pheromosa’s laugh in this video was The Snatcher’s laugh from a hat in time. I love that game.", "19:15 I feel like the reason smiity's videos are always so good are because he and his friends are never afraid to make jokes like these", "Fun fact, the ultra beasts are in the same tier as a low-balled Goku in vsbattles wiki. Unfortunately their entries have very little objective feats, but they do have close feats across various media, such as Kartana cutting spacetime which puts him on the same offensive capabilities as Jubei, one of the strongest characters in Blazblue.", "Always love tcg references in these battle royales. A little research goes a long way to please people that enjoy every different medium of Pokémon at once!", "They did a great job of recreating the old vibes of the first warzone trailers for like verdansk. Just pure chaos, awesome maps, and mindless fun. Nothing too serious. Super excited for this!!!", "Man I was sure Kartana had this in the bag, I swore it was gonna slice open Naganadel’s stinger and it was gonna blow itself up, but I guess not", "The Harry Potter quote and saying she can do what she wants now has me crying, seeing how relived and free she feels. In a world so full of bad endings I'm so happy that, by the looks of things, she got the good one <3", "Thanks for being a youtuber cory, my parents just had an argument, and you always find a way to cheer me up! Keep it up!!", "As someone who once played competitively (though still refused to use legendary/mythic Pokemon even if they were low tier) and who still breeds semi-competitive teams to play in single player, I enjoyed the competitive tier-talk at the end.", "I was expecting Kartana to get hit by like one tiny cinder after taking out Celesteela and immediately dying to its 4x weakness.", "Everytime I watch this series I'm always so impressed by Techno's creativity, ruthlessness, and dedication to achieve his goals. Even after his passing his ingenuity continues to have an impact on Youtube and its creators. Rest easy, King. TECHNOBLADE NEVER DIES:_TechnoSalute: ^_^", "Fun fact: You can configure Celesteela to be come basically unbeatable. Give it a Leftovers and the moves Ingrain, Protect, an attacking move, and a Defense-boosting move, and then stat into the following stats in order of priority: SpDef, HP, Def, and whichever stat its' attacking move uses. Every time you knock out something else with it, its' SpDef rises one stage, and every turn, Ingrain and Leftovers regenerate its' HP by a fair amount. And if you find yourself in a pinch, Protect buys you another turn to heal up. The only things you'll really have to worry about with this are things like Perish Song and other one-shotting effects.", "As a TCG YouTuber, i really like you including it in this, although it does feel kinda strange but fun at the same time", "Finding out that Kartana said Sam's lines just made my day", "Kartana was the one I thought was going to get out first and it almost beating naganadel made me cheer", "Kartana needs healing.", "I have a theory where the next battle royale will be an “Everyone is here” kind of deal. Each Pokémon from the past royales duking it out to see who comes out on top. During the last 20ish seconds of TerminalMontage’s video, you can hear a cricket that appears to be emitting Morse code. While I don’t have the skills to decode the message, TerminalMontage usually only does this sort of secret/ARG-type thing when something big is about to happen (I.E. Something about Subspace Emissary)", "I thought poipole was just bassed off of poi, it’s a tropical-ish potato type vegetable down in the Hawaiian islands it’s packed with protein but pretty soft and hard to eat so that’s where I got my idea from considering I eat it a lot ️", "This and the animation are amazing as always, I'm just sad there's no mention of Wheatley and SPAAAAAAAAAAAACE", "They never disappoint me", "According to the Kartana’s official description, it can form tiny ultra wormholes by feverishly slicing into space & time itself, so that moment when Guzzlord devoured it was so funny cus I knew instantly it was gonna be sliced in half internally.", "Saw the title and instantly clicked. Can't wait to check it out!", "I wonder if the Ultra Beasts coming from alternate dimensions is an example or a parallel to how various Pokémon games and regions have different available mons.\n\nWhich reminds me of something I wondered recently, where exactly do Pokémon Go and Prof. Willow come in with relation to other regions? Is Meltan a foreign entity like an Ultra Beast except it's from here instead of a place connected by Ultra Space?", "As someone who has been with both Pokemon and Digimon since the very beginning I would confidently say the Cyber Sleuth games definitely would have been your best bet and I hope you play them in the future. The gameplay wouldn't be alien to a Pokemon player and the stories aren't bad at all with some nice funny moments.", "I loved the Space Odyssey and Stitch references. and also that Guzzlord was just screaming. great reference to the Japanese dub of the anime", "I think it's funny that, in addition to the head thing, both Naganadel and Blacephalon are resistant to poison. Both are special attackers, though, and neither of them learn physical ground moves that are the bane of Nihilego's existence.", "Since it wasn’t directly addressed, was it a coincidence that the cuts from Kartana send Celesteela to the moon? Celesteela is based off the Japanese folklore of Princess Kaguya (hence also the body shaped like layered kimonos), whom is from the moon and is reborn on earth in a stalk of bamboo. Her story is also called “Tale of the Bamboo Cutter”, because that’s who discovered Kaguya on earth. Hence, Celesteel was launched back to where her inspiration was from. Love these vids!", "Who knew super glue bee dragons would be so potent in a fight.", "You could say that Kartana cut its own path while Naganadel followed its wrath", "Now I'm worried what would happen lore wise if Kartana were to try and cut through Tyranitar...\n\n(Actually wouldn't they just pass through each other?)", "The real question I want the answer to is : In what universe is Kartana beating Celesteela ?", "Quick question relating to Naganadel. Is the \"glue\" it creates based on its dragon or poison type? If I assume poison, then it shouldn't be able to affect Kartana and Statataka because of their steel typing right?", "Naganadle is my favorite pokemon, and I love this battle.", "I definitely like how the final video is unannounced\n\nFun fact: in the anime, Kartana says the opposite \"again I cut something worthless\", alluding to Goemon from Lupine III", "With Celesteela burning down forests... what happened in the show was that it would bury the engines in the soil so that when it takes off the fire doesn't ignite the bamboo forest; however Team Rocket unearthed Celesteela because they wanted to capture it which meant that if the launch went off it would cause the forest to burn down but the Ultra Guardians built a barrier to contain the blast so that it wouldn't burn down the forest. ", "So, why exactly was Kartana not able to outrun the explosion at the end? Kartana seemed to avoid being slowed down or otherwise immobilized by the glue, and he both dodged Naganadel's intended laser and sliced the needle. Was there something to confirm that damaging Naganadel's needle would create an explosion that exceeded Kartana's maximum speed, and that said explosion wouldn't kill Naganadel via brain damage?", "Ok, so being Steel and Grass type, Kartana surviving the crushing forces of a black hole for a few seconds and being able to cut anything makes it surviving Guzzlord plausible, but I still don't see how Naganadel would be able to live that.", "1:30 I love the reference to the set name being \"Unbroken bonds\"", "Love the attention to detail guys! Great job! ", "im sad Xurkitree got evaporated, i feel like there was a tiny bit more potential with him considering hes the second or third best electric type in pokemon go. and also my favorite ultra beast", "I think Kartana being able to cut through a black hole is stretching a good bit. Maybe basing the ending on it being able to do so is a bad idea.", "Love that dunkey is having fun with a game and has good footage", "Love the little Snugooi cameo at the end of the vid", "The naganadel and guzzlord team up reminder me a lot the symbiotic relation of godzilla and mothra just look a it!! Guzzlord being the big powerful monster capable of destroy almost anything and naganadel being the aerial backup and very useful ally sometimes idk i just thinked about it also sorry if i type something wrong im spanish", "Not just a Amongus hommage, you could have made a Majorask Mask, or Lunatone moon with Celesteela impacting in the moons eye (forgot the movie).", "i love the way that buzzwole was referenced to be all-might and small-might", "Next should be all the Pikachu clones fighting it out.", "Fun fact Kartana sword slicing up Naganadel stinger is based off Cloud slicing up through Bahamut's attack into his body and destroying it in the movie Final Fantasy 7 Advent Children.", "The only problem I had with this one was the... utter lack of stuff that you could do. There are literally less than a dozen Ultra Beasts, so the confrontations are so limited."]}