{
    "video_id": "CyQkW1oTlMc",
    "comments": [
        "I literally didn't know what any of these Pokemon were ",
        "So, the \"pokemon\" got our of guzzlords mouth, but all the crap it ate didn't?",
        "Guzzlord is just majestic",
        "Surprised you didn't mention how you didn't include Necrozma cause that's an instant win lol",
        "but... Kartana is Grass/Steel, so poison wouldn't work?",
        "You forgot necrozma",
        "You didn't mention space core at 5:13",
        "My goodness didnt expect the BR video so soon! And it was great as always",
        "How would kartana be able to cut guzzlord once it’s inside the if he’s a black hole, him being able to cut “anything” isn’t even valid since he wouldn’t be able to move or even survive inside guzzlord",
        "Man I was sure Kartana had this in the bag, I swore it was gonna slice open Naganadel’s stinger and it was gonna blow itself up, but I guess not",
        "I love kartana so much\nHe’s just a lil guy with so much power",
        "Now you guys arw stuck working together. Lol April fools days you all should upload a video on each others page, or Jerm comes on your show with your script and you just animate something on his lol.",
        "at 4:28 i guess you could say that they were, grounded? lol",
        "The only pokemon battle Royale that I can think of to come next would be a starter battle royale, Edit: ALRIGHT I GET THERE ARE BATTLE ROYALES THAT COULD HAPPEN completely!",
        "The real question I want the answer to is : In what universe is Kartana beating Celesteela ?",
        "Was rooting for Kartana",
        "So Ultra Beasts are like Cthulhu?",
        "Do all pokemon Ash has ever captured!!! ",
        "Ultra Beasts are pretty similar to pokemon, its true. I think there is enough evidence to make an argument that they aren't pokemon though. A casual observer may not be able to tell the difference between a plant and a fungus. or a bacteria and an Archaebacteria. But they are different nevertheless.",
        "1:06 I just got over that bro. My stomache cant take anymore",
        "Still hoping for a Lockemon battle royale",
        "I loved the Space Odyssey and Stitch references. and also that Guzzlord was just screaming. great reference to the Japanese dub of the anime",
        "Mind if i got in",
        "I think Guzzlord should have won.  Cutting isn't very useful against something like a blackhole.",
        "0:30 - Being an Alien isn't contingent on being from light years away, it means you're foreign to the subject at hand.\n\nUltra Beasts are Aliens because they are not of the Pokémon reality.",
        "Fun fact about Guzzlord. The cry it does is an unedited audio clip of the Japanese VA for James screaming",
        "What about necrosma?",
        "Buzzwole would not have lost to that twig",
        "arent lunala, solgaleo, and necrozma arent ultra beasts too?\n\nedit *technically",
        "kartana dying at the end was a weird decision",
        "Kartana beating Celesteela in the context of the animation makes zero sense. Kartana is made of a paper-like substance, so the combustion of Celesteela's rockets, if potent enough to burn down an entire forest and the distant Xurkitree, it should absolutely decimate Kartana for getting near it, and especially for approaching from below. Not the mention the amount of force being exerted for the take-off, Kartana, being ones of the lightest things ever, should be thrown back and unable to even make any head-way from that angle. Heck, Kartana being so light probably shouldn't be able to get that high into the atmosphere even without the Celesteela there, considering how powerful winds get. And, you could argue that Kartana is closer to steel than paper, so it wouldn't burn up, but it would definitely soften it and thus weaken the cutting power of its blades significantly.",
        "#1 trending damn",
        "i was thinking that when celeestela gerts to space the message that apppears was a portal 2 reference :C",
        "Link to the clip: i met the creators of Pokémon battle royale \nhttps://youtu.be/_MXe1UGClTI",
        "wait why is everything blue now green",
        "And here I though the pheremosa vs buzzwole bit was a reference to Genos vs Mosquito Girl in One punch Man.",
        "Damn it doesnt look like people are happy Naganadel won",
        "when stackatacka crushes poiple amd pink liquid comes out the bottom is it a reference to danganronpa",
        "\"in an animated setting like this super glue attacks are very powerful\" \n\nMinoru mineta wants to know your location",
        "Pokémon Battle Royale but paradox forms",
        "I love the challenger reference you did with celasteela",
        "Your mispronouncing Naganadal. . .",
        "I’m still really happy that my favorite ultra beast got second place",
        "Well I mean kartana is a top ou threat meanwhile naganadel is kinda garbage in Ubers.",
        "Lovely to see the duo collab again! Jeremy’s videos were what got me to know Austin’s channel and now I can’t stop watching you!",
        "Everytime I watch this series I'm always so impressed by Techno's creativity, ruthlessness, and dedication to achieve his goals. Even after his passing his ingenuity continues to have an impact on Youtube and its creators. Rest easy, King. TECHNOBLADE NEVER DIES:_TechnoSalute: ^_^",
        "Lockemon battle royale would be a cool video!",
        "i think there should be a kaskade region battle royale",
        "Funny how it came after the power couple",
        "Imagine losing to a piece of paper",
        "Celesteela is also based on Kaguya-hime which is from the moon so it crashing into the moon is PERFECT",
        "Can we appreciate buzzwole repeatedly saying buff?",
        "\"Kartana can cut through anything, even time and space\"\n\nKartana: !!!!!GNIHCAOOOOOOOORPPA SI TAHT MROTS EHT MA I",
        "love is in the air? wrong. 5 Naganadel.",
        "Pokemon has so much untapped potential with the Ultra Beasts, at least with designs. But their worlds are where it's at for me, beautiful, vibrant and strange worlds.\n\nI sincerely hope we see more of them in the future.",
        "I would love to see generations battle royale! Where pokemon from different generations team up and battle against each other! Just an idea :)",
        "Never forget God loves you and is our lord and savior",
        "Ok, but why no Cosmog line? They're Ultra Beasts canonically.",
        "pseudo legendary battle royale next!!!! plz!!!!!!!!!",
        "Shouldn't have necrozma been in the video it IS an ultra beast",
        "The only problem I had with this one was the... utter lack of stuff that you could do. There are literally less than a dozen Ultra Beasts, so the confrontations are so limited.",
        "I just want to say that kartana is a grass and STEEL type and Naganadel sticky substance is a poisonous liquid and that would mean that Kartana would have survived it because it’s immune to poison",
        "It would make more sense that Ultra Beasts are from different dimensions rather than just being from very far off points in outer space, but that is contradicted in USUM, which specifically says \"you are X lightyears away from Alola\" when you travel to one of the Ultra Beast's home worlds",
        "If celesteela is burning rocket fuel I don't think katana could get close.",
        "I totally missed that backwards Jetstream Sam line! Thank you!",
        "What if we could make our own simulations? (they wouldn't have to me animated, just compiling the possibilities!)",
        "If kartana was sucked into a black hole wouldnt it die though",
        "Wait... I thought kartana won, not naganadel",
        "For a second, I thought guzzlord had won but then paper man cut him open",
        "Snugooi would have definately won if it entered the battle royal, especially if it teamed up with Tofrog.",
        "Congrats on first trending ",
        "Fun fact: In an interview with the creator of Naganadel (James Turner aka the guy who made Vanilluxe), Poipole and Naganadel are based off Xenomorphs. So I'm really surprised I didn't see an Alien reference lol.",
        "1:12 Ripped Robby s ells the best call of duty h ac ks",
        "Guzlord? no. Kirby? All the way",
        "Kartana should've won no matter which way you look at it. If it can cut through anything then superglue won't stop it either. Also Steel types are immune to poison and resistant to dragon moves. If anything it should've been eaten by Guzzlord",
        "I don’t like TerminalMontage but for some reason I’ll always watch these explanations with interest even though I don’t know the video",
        "I genuinely love all the TCG nods. I absolutely need to see more content based around it on this channel.",
        "I thought the paper cut would win",
        "I still think they should have based Kartana's voice lines on Genji from Overwatch.",
        "DAMN YOU IT SHOULDVE BEEN GUZZLORD! I KNOW THE STATISTICS ARENT IN HIS FAVOR, but still my poor baby boy. He deserved better. D:",
        "You guys should do a fossil pokemon battle royal next",
        "3 hours",
        "4:45 More famously, Samurai trained and practiced their sword slices on...  People!  Mostly the peasantry of Japan.",
        "I couldnt understand anything Kartana said and yet I 100% certain he was using Sam's lines",
        "Who's the bounty",
        "ISHOWVIRUS, this stream changed my life. My entire view of everything that exist in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience.",
        "Kartana and Phermosa broke my heart.. \n\nThese are always a blast to work on, thanks for working on this with me! I look forward to the next one ;)",
        "Kartana still won three seconds after the end he came out and killed nagandel",
        "nah the little paper bastard and the hot skinny bug shoulda won",
        "Is there a particular reason why so many Ultra Beasts hate being touched? Because as soon as they’re touched, it’s like “u wot m8”",
        "Paper cut is the worst",
        "well why no nekrzma he is an ultra beast 2 ??",
        "Rigged. Jk but Stakataka will always be my favorite.",
        "Ah yes, Spongebob, my favorite scifi",
        "Fun fact: Guzzlord in the anime is voiced by James' voice actor",
        "Aren't Lunala and Solgaleo also considered Ultra Beasts technically? They are the legendaries but they came from Ultra Space.",
        "Bet you didn’t think about beast boost",
        "I have 2 questions. 1 where is necrozma? 2 how did Kartana slice Guzzlord my understanding was that Guzzlord doesn't \"eat\" it which is why there are no droppings left behind and it's always hungry.",
        "i love the mha reference, you went plus ultra for this one",
        "Ultra beasts are based on invasive species\nah yes, Bricks- the most invasive species\n(Stackataka)",
        "I didn't realize Niganadel or however you spell it actually won at first because my boy Jetstream Kartana was too cool",
        "Where's cosmog necrozma solgaleo and loonala",
        "If Guzzlord has something similar to a black hole for a mouth, Kartana would be absorbed or annihilated and unable to reach the sides in order to cut Guzzlord open. Am I wrong in thinking this?",
        "Waiting for Pokemon Starter Battle Royale after ScarVio comes out",
        "\"I should've but AK-47!\"\nActually, official name for the AK-47 is the Kalashnikov Assault Rifle, which is pretty long-",
        "I thought Kartana got far because it’s good in GO",
        "Not just a Amongus hommage, you could have made a Majorask Mask, or Lunatone moon with Celesteela impacting in the moons eye (forgot the movie).",
        "The winners also make sense since you know naganadel is a metal dragon while kartana is a tiny origami samurai and being made of paper is really bad when a explosion happen",
        "Two bits of trivia! Celesteela being a bamboo ship is a reference to the story of Princess Kaguya, the Princess of the Moon who was found by a bamboo cutter. And Kartana's reversed lines in the anime \"A worthess object! Again, I cut!\" are a Lupin III reference; the samurai Goemon XIII's Zatetsuken sword was a sword that could cut anything (except seaweed jelly), and every time Goemon cut something he'd say \"Once again, I've cut a worthless object.\" Some really deep... cuts... in here? Yes?",
        "I think it's funny that, in addition to the head thing, both Naganadel and Blacephalon are resistant to poison. Both are special attackers, though, and neither of them learn physical ground moves that are the bane of Nihilego's existence.",
        "aside from the Among Us reference, there's also the Portal's Space Core going SPAAAAAAAACE",
        "I wanted kartana to win",
        "Is that a undertale reference",
        "Alternate timeline where pheromosas 151 speed allows it to dodge everything and kartana still Chara undertale’s naganadel and guzzlord",
        "4:15, It didn't burn down the forest in the anime because Ash and the gang had built a blast containment wall thing around it before it took off to prevent the forest it was in from being burned down when it took off.",
        "i think that space part was a portal reference",
        "Oh\nSo now...\nwe need...\nPhermosa  vs Gardevoir",
        "Sorry if this comment feels like I wasn't paying attention to the video, but what song(s) did you have playing in the background? They sounded amazing and I would really like to know...  ",
        "I always pronounced Naganedel as Nahga-Naydle. Is that correct or is your pronunciation the official one? I've never heard it, so I'm not actually sure. I just thought it sounded Naga and Needle.",
        "Kartana should've won, unless when Naganadel had Heat Wave, Flamethrower, or Fire Blast, those 3 moves aren't STAB, but Naganadel's a Special Attacker, so those 3 moves are good use",
        "I knew karttana was referencing sam in the slowmo cut at the end, but never would´gessed the backward voicelines :p",
        "I wonder if the Ultra Beasts coming from alternate dimensions is an example or a parallel to how various Pokémon games and regions have different available mons.\n\nWhich reminds me of something I wondered recently, where exactly do Pokémon Go and Prof. Willow come in with relation to other regions? Is Meltan a foreign entity like an Ultra Beast except it's from here instead of a place connected by Ultra Space?",
        "Pokemon Battle Royale: Regional Variant Teams !\n\nLike regular Vulpix teamed with Alolan Vulpix versus other similar teams.",
        "Someone should create a compilation of Ethan throwing",
        "2:32 oh hey look, stakataka having a logia df",
        "Should have included Nekrozma, Solgaleo, and Lunala if only to start the argument",
        "20 h.",
        "When Kartana realizes it can slice through the Earth itself",
        "Ultra Beast :D",
        "Where flex seal joke?",
        "I HECKIN LOOOOOVE ULTRA BEASTSSS",
        "wait i didnt even realize that naganadel won\nbruh",
        "With Celesteela burning down forests... what happened in the show was that it would bury the engines in the soil so that when it takes off the fire doesn't ignite the bamboo forest; however Team Rocket unearthed Celesteela because they wanted to capture it which meant that if the launch went off it would cause the forest to burn down but the Ultra Guardians built a barrier to contain the blast so that it wouldn't burn down the forest. ",
        "I thought the pink glue was danganronpa blood cus in danganronpa it’s pink",
        "\" C C I H T eb syawla lliw ssa ym dna egnirc eb syawla lliw ssa rouY\"\n- Kartana Idk, 2022",
        "It’s na-guh-nay-dell not ne-gahn-a-dell",
        "Maybe Meowth could give Kartana some speaking lesson's",
        "1:12 is jimmyhere's its Wednesday my dudes yell",
        "But can Kartana cut through my depression?",
        "Great work, but the bit about Buzzwole Popping is.... Debatable, to say the least, considering it's considerable defense stat. Also, I don't believe it's ever been shown that Buzzwole can pop like that at all. So.... Take that how you will.",
        "\"We put in a lot of sci-fi references in this as much as we could\"\nAnd I got zero of them (Guess what genre isn't my favourite hm?)\n\nBut at least I got most of the attention to details, like Guzzlord screaming, Kartana being able to cut through *anything*, who it looks like when Buzzwhole sucks it's prey to become more swollen (plus the All Might easter egg) etc.",
        "Imma be honest, I thought the \"SPAAAACE\" reference was for the Space Core in Portal 2",
        "I like the MGR reference",
        "i love the way that buzzwole was referenced to be all-might and small-might",
        "JetStream Sam woooooo yeah baby that’s what I’m talking about",
        "Pheromosa vs Buzzwole\n\n\"Top 10 Anime Betrayals\"",
        "Watching it, my money was on Kartana, so I was pretty close",
        "GOD CREATED US TO LOVE US AND EVEN THOUGH WE SINNED AGAINST HIM HE DID NOT ABANDON US,BUT MADE A WAY FOR US TO BE RESTORED TO HIM THROUGH HIS SON JESUS;WHO DIED IN OUR PLACE AND IS RISEN...TRUTH.PRAYING IS TRUSTING THAT GOD HEARS YOU WHEN YOU SPEAK TO HIM AND MEANING WHAT YOU SAY...LETS PRAY,LORD JESUS I BELIEVE AND WELCOME YOU INTO MY LIFE,AMEN.*READ AND SPEND SPEND TIME WITH GOD DAILY,PUT YOUR TRUST IN HIM*ASK GOD TO HELP YOU UNDERSTAND HIS WORD*ALLOW THE HOLYGHOST TO LEAD YOU...I LOVE YOU BUT GOD THE TRINITY LOVES YOU UNCONDITIONALLY.",
        "Im sad that no one thought to use genji's últ line for kartana",
        "i think stakalaka should have gotten farther",
        "Naganadel, James Turner's greatest creation",
        "Isn't karta a steel grass? So why would the poison dragon type do any damage",
        "kartana was kinda cheated from the win, in the final fight naganadel used poison moves which kartana is immune to and kartana cut open guzzlord but only naganadel survived how did it survive the black hole",
        "isn't guzzlords moth like a black hole tho? so kartana couldnt cut trough it?",
        "Noooo my paper samurai was robbed robbed I say",
        "You could say that Kartana cut its own path while Naganadel followed its wrath",
        "My favorite invasive species Bî¢|<",
        "and i also sound like guzzlord",
        "It was obvious who'd win as Bungee Gum has the properties of both Rubber and Gum",
        "I'll never forget when Guzzlord first appeared and everyone (jokingly) agreed it was DEFINITELY just samples of Arin \"Egoraptor\" Hanson raging. XD",
        "LMFAO bruh",
        "Why is this video so green??",
        "I'm excited to know how the battle royale  between pokemon paradox will be ",
        "I thought the video says Kartana won. (?)",
        "hello",
        "As a Hawaiian, I thought Blacephalon hiding in the storm drain was a reference to the nuclear warning (the explosion in the video) we had a few years back, and how parents hid their kids in storm drains. Especially considering Alola is based off of Hawaii. Had a good chuckle. \nGreat video and awesome references nonetheless!",
        "You should do one for your lockemon",
        "Do a starter battle royale, it would be fun, epic and lots people will have some one to bet on, and psuedo one will be dope to",
        "Pheromosa is the perfect representation of women. You think you're close to them, then they get used by a man, you save her from that man, then they get mad at you, hurt you, and break your very soul",
        "If Kartana can cut through \"anything\", can't it cut through super glue? Shouldn't it be able to cut Phermosa free, and cut through Naganadel's glue rather than be impeded by it?",
        "Awwww, I wanted paper Boi to win",
        "NUMBER 1 ON TRENDING GODDAMN",
        "Finding out that Kartana said Sam's lines just made my day",
        "Kartana needs healing.",
        "Lockstin: we use all sources\nThe manga:(where it says that blaecephalon can dodge any attack he sees) am I a joke to you?",
        "When I saw Blacephelon get glued over, preventing the head from regenerating. I thought it was a reference to Heracles putting flaming acid on the Hydra's neck so the heads wouldn't grow back.",
        "Dang thought guzzlord would win for sure",
        "You missed the obvious flex tape joke ",
        "I knew there would be a Sam reference",
        "2:43\nDon’t forget Sonic.exe. ;)))))",
        "Missed the kaguya reference when Celestila crashed into the moon...",
        "Lockstin: Buzzswole and Pheremosa have an unbroken bond.\n\nAlso Lockstin: Pheremosa kills Buzzswole for patting her head after saving her life.",
        "I thought \"that\" spaaaaaace was a reference to one of the broken core in portal 1, but correct me if I’m wrong.",
        "Why is everything green",
        "I think Kartana being able to cut through a black hole is stretching a good bit. Maybe basing the ending on it being able to do so is a bad idea.",
        "I don’t know if this has been asked before but if Kartana can cut through anything according to the anime would it be able to cut Tyranitar who is, according to several pokédex entries, completely indestructible?",
        "A lot of people often forget that Celesteela is also a very clear reference to the story of ‘The Bamboo Princess’",
        "I'm just glad my favorite group of pokemon are still thriving in media",
        "I get it but I absolutely love Celesteela more then all the others",
        "I knew there would’ve been a mgrr reference somewhere",
        "I was rooting for Kartana for the entire video. And it made it to the end. It had fallen in the end. But it went out a hero ",
        "7:49 that's weird",
        "Guzzloard sounds like Arin Hansen from game grumps",
        "Space Pokémon :)",
        "The muscle mosquito isn't based off a Texas mosquito",
        "fun fact: Xurkitrees we can catch are probably juvenile, since there are mountain sized ones in ultra plant",
        "My question is: Instead of Kartana slicing Naganadel's tail/stinger, why didn't he decapitate him? He had the speed and the ability (assuming Naganadel's neck is thinner than a tree)",
        "Im glad my favourite UltraBeest won",
        "Hi all I just wanted to share something very important. If you don't have a relationship with Jesus Christ as your Lord, here is your sign to turn to Him!   This is the most important thing you'll ever hear in your life. Jesus is coming back soon! God sent His only Begotten Son into the world, that whosoever shall believe on Him shall not perish but have eternal life. Those who do not believe will be condemned. (John 3:16-18). Jesus died for our sins, and to set us free from our sins and condemnation (John 8:36, Acts 13:39). Jesus rose from the the grave 3 days later after His death, defeating death. He now lives forevermore, and seeing we have saving faith in Him,  we too will live eternally with Him! Jesus is the only way to Heaven (John 14:6). Following Him is the best decision to make in life. Though the Christian life isn't a life absent of difficulty, despite any circumstance Jesus gives true peace and fulfillment, a peace and fulfillment this world cannot give (John 14, John 16).",
        "...yeah no Naganadel is legit dead. The explosion would have decimated it's brain which is right near the stinger as you mentioned earlier. Not saying that Kartana would necessarily win but Naganadel should have lost right there or even earlier given that lore and stat-wise it's weak.",
        "Very glad my fav Ultrabeast won. Naganadel is also in my Overall Top 5on spot 4 of all Pokemon, maybe I’ll put it even higher in the future. I really like it.",
        "Fun story: I was once playing Pokemon Showdown with a friend of mine (Chosen teams, not random ones)... I was loosing, only two pokemon remaining on my team against 4 on his... then I pulled up a Kartana... and because he was overconfident chose a move that didn't one shotted Kartana... giving me one turn, enough to use swords dance... then swiping his whole team with Leaf Blade, Psico Cut and Night Slash... if I remember correctly his team had Lycanrock, Alolan Raichu... eh... I can't remember the rest... I just remember all of them had at least a weakness to any of the moves mentioned before...",
        "So I was into pokemon as a kid. By Gen 3 or so I had moved on. Always still loved it just didn't have time though. Now I feel so lost with ultra beasts, mythic, x y. Man it has gotten deep",
        "Why the h did I thot that kartana won?",
        "And if Eternatus is in some ways the \"boss\" of all the Poiple and Naganadel? They are really similar in their design and they have the same types in the same order.",
        "1:55 Ripped Robby s ells the best call of duty ch ea ts",
        "Kartana shouldn't be able to cut through a black hole once it's entered the event horizon. Because they are inescapable due to the intense gravity. If it would have cut guzzlers from the outside then I'd believe it",
        "So that's how to pronounce Blacephon.",
        "Miltank is my favorite UltraBeast",
        "Rip necrozma",
        "It’s pronounced Nag-a-na-dle",
        "wow very good history\nAll stories are the best\nI love these stories, so please read these stories>: 3\nThis is my favorite cartoon drawing. video no perco nenhum",
        "gah the link on the other episode wasn't directing me right? I don't know",
        "WERES NECROZMA?",
        "The Dalek reference was great to see!",
        "All I’m saying is Kartana can cut through time and space and make his own ultra wormholes. Combine that with being able to cut through anything, I think it should win 90% of the time",
        "Wouldn't kartana be immune to naganadels glueish substances due to it being immune to poison",
        "A bit confused. Aren't the Cosmog Lines and Necrozma also Ultra Beasts? Cosmog and it's evolutions are supposed to be from other worlds, and Necrozma comes from ultraspace having consumed literally all light in another world.",
        "Fun fact, in the early days of Ultra Sun and Moon, of course with the new mons still being tested, they were all of course put into OU. Bad idea, as Naganadel's only counter in that tier and format was Heatran, who resisted both STABs and also trapped it. However if you didn't know, Naganadel has Nasty Plot, meaning it can even brute force a win against it by just setting up enough. I love this guy, not to mention its shiny is awesome. It even has one of my favorite moves, Fell Stinger, though of course not something it would ever use seriously as it's a special attacker.",
        "I thought the SPAAAAACE bit was based on the Space Core from Portal.",
        "Hmm yes, origami is sci fi",
        "Ever notice how most of the Ultra Beasts don't like being touched?\n\nWeird.",
        "I love that Poipole's adhesiveness and Nihilego's glassy composition were given focus, they're such cool little details! \n\nGotta give props to Pheromosa spamming the pheromones to cheese the competition, even when it cost them a few limbs for it eventually.",
        "I wanted xurkitree to win but then after death kartana",
        "I was honestly hoping for Kartana to have Genji’s voice lines from OW lol",
        "No win % this time?!",
        "Guzzlord is now tied with urshifu, victini, rayquaza, and mewtwo as my favorite pokemon.",
        "Also Kartana in the anime make reference to Goemon from Lupin the Third with the Phrase \"another worthless thing to my katana\" like Goemon Katana",
        "Necrozma is technically also an Ultra Beast",
        "I thought the ending was a little metal gear revengeance",
        "I would say that the among us part is the wrong reference, but sure, go on young ones how never played PORTAL 2.",
        "Kartana got ripped off imo. It's immune to poison attacks, so naganadel shouldn't have done any damage to it.",
        "I love that everyone has time to go ham in this one.",
        "Naganadel is my favorite Ultra beast sick design, amazing typing and for sure an amazing Pokemon",
        "Naganadel is one of my favorite Pokemon so seeing it win soothes my unquenching thirst for blood.",
        "You're a smart cookie.",
        "I thought Necrozma was a UB?",
        "I like how all guzzlord screams are basically just from. \"it is wendsday my dudes\" referencing that and the anime of guzzlord just screaming.",
        "0:26- *Universes",
        "Much as i like these types of deep dive what if verses videos, this one seems to be based too much off of the card game.",
        "Kartana lasted because the sanctioned action is to cut",
        "Isnt kartana immune to poison attacks?",
        "tho naganadel can have more than poison attacks, like dragon, electric, fire, or flying",
        "I do found weird kartana lose to naganadel, even being immune to poison and resisting dragon",
        "Yeah but if Naganadel's brain is in its butt, wouldn't it have also died from the explosion to make the result a draw?",
        "Nag a nadle",
        "So what Pokemon Battle Royale is next? Galarian? Hisuian?",
        "5:12 among us and portal 2 reference, all in one",
        "I need a plushie of Nihilego holding milktank ",
        "I've been waiting for the UB fight!",
        "The Necrozma, Solgaleo, and Lunala thing is a \"it walks like a duck and talks like a duck but it's a goose\" type of situation. They share many ties, origins,and abilities but aren't ultra beast; just legendaries.",
        "Im about 5 hours in and its already one of the best games Ive ever played. I really dont game much anymore since Im older and dont really get excited for games at all. When Im at work all I can think about is coming home and playing this all night lol.",
        "I'm kind of sick of non lore or dex reasons being a factor whatsoever",
        "Did you consider that Kartana is immune to Poison and resists Dragon?\nAnd why was it not effectively an OHKO on Naganadel once Kartana got close enough to cut it, since it can cut \"anything\"? I feel it's also worth noting, \"anything\" is not an exaggeration, anime Kartana literally cuts the air to create an Ultra Wormhole.",
        "Only thing i learned from this is these Pokemon really hate being touched.",
        "Kartana speaking in Jetstream Sam is my new favorite thing. It's like an origami Meta Knight",
        "Craftee will never disappoint us since subscribers are never angry to unsubscribe!",
        "1:07\nO\nM\nG",
        "Buzzswole is himbo confirmed",
        "So.. Blacephalon is a n-nounce? Ok...",
        "I just realized that buzzswol and the other bug beast Contast each other",
        "Fun fact: guzzlord's scream on sun and moon anime isn't like that",
        "Is no one going to acknowledge the Undertale reference at 6:48?",
        "Essential Neganadel won bc of being most popular instead of who would actually win. Hence why Kartana dies from a random explosion rather than beating Neganadel. Steel resists Poison which is why Kartana had to go out that way via an explosion otherwise Kartana would win being so small and agile and having the ability to cut anything in existence and being able to be immune to Neganadel’s poison adhesive. Overall not a realistic battle royale but a very fun one to watch bc of how quirky in nature ultra beasts are.",
        "This is the first time I’m watching the explained thing because it’s the first time I have actual questions about it lol",
        "so that's why my pheromosa died",
        "The Pokedex says that Pheromosa doesn't touch anything because it senses something unclean about the world.\n\nBut then, wouldn't Buzzwole be exempt from that? Since it's not of this world.",
        "Okay I NEED to ask, does anyone know the name of that sick background music that starts at 7:33?? That’s the grooviest thing I’ve ever heard",
        "I knew kartana would probably be jetstream sam or something.",
        "Why is the color off in this video? Everything's green and it looks weird",
        "Erm i have a question, Since Naganadel's super glue attacks are technically poison, shouldn't kartana's steel type bypass the glue attacks?",
        "I thought kartana would win because steel is immune to poison",
        "If naganadels brain is on in its lower abdomen, shouldn’t it be at least a tie at the end considering it’s stinger tail was cut up? I’m not gonna lie I’m a little upset that paper boy didn’t win here",
        "But Buzzwhole wins??????!?!?!???",
        "Love how kartana kills like Chara from Undertale",
        "Isn't the glue shot a poison type move?\nShouldn't kartana be unafected by it?",
        "See the funniest part of Jetstream Kartana is the fact that if there was indeed bloodshed, said blood would make the paper-like body of Kartana just become mush. Like what happens to a paper straw five seconds after you so much as touch it.",
        "Okay but why was there recoil from cutting Naganadel? Is the glue explosive?",
        "should've ripped alpharad screams for guzzlord",
        "I really do think Kartana should've won that epic duel. I also loved the Dalek reference. EXTERMINATE!",
        "FUNFACT about Kartana's name: Carta, in italian, means paper, which is the material used for origami and is produced from trees, hence the Grass type!",
        "Bruh why didn’t it just cut through the explosion ",
        "Pheromosa HATES touching absolutely anything\n\nAlso Pheromosa: 6:14",
        "Kartana Literally sounds like an anime reject main character and he talks backwards",
        "Hello viewers how are you all",
        "These are a blast every time\n(Quite literally)",
        "Next should be all the Pikachu clones fighting it out.",
        "I’m actually so glad Kartana made it to the final battle. Personally I feel like it’s one of the least popular Ultra Beasts (though it’s kinda understandable cus it’s 4x weak to fire). According to the Kartana’s official description, it can form tiny ultra wormholes by feverishly slicing into space & time itself, so that moment when Guzzlord devoured it was so funny cus I knew instantly it was gonna be sliced in half internally. I know that Naganadel technically won, but that final kill slice basically secured Kartana’s victory in my opinion, albeit at a fatal cost.",
        "Guzzlord should win when they swallow them.. How would Kartana cut thru infinity..",
        "So, why exactly was Kartana not able to outrun the explosion at the end? Kartana seemed to avoid being slowed down or otherwise immobilized by the glue, and he both dodged Naganadel's intended laser and sliced the needle. Was there something to confirm that damaging Naganadel's needle would create an explosion that exceeded Kartana's maximum speed, and that said explosion wouldn't kill Naganadel via brain damage?",
        "After just finding the original Pokémon battle royal videos I was hoping that there would be more but wasn’t expecting it the next day! Since most of the Pokémon categories had been covered already I was unsure if any new ones would release. I can say waking up this morning to find these new videos made my day!",
        "I'd like what this man is on.",
        "Ngl, I feel Naganadel shouldn’t have been able to do much against Kartana due to the Poison vs Steel type matchup",
        "this is a bit of a nitpick, but tatami mats (the mats samurai use when cutting with their katanas) arent made of bamboo",
        "if naganadel's brain is in the abdomen then why it didnt die when kartana sliced him in the stinger?",
        "why did naganadel pop out after guzzlord had succ it in a black hole but not the other ultrabeasts it ate?",
        "One thing i love about Buzzwole in this battle royale is that his flexing poses resemble the poses of the wrestler from Ringside in Rhythm Heaven Fever. Or at least they are similar to me.",
        "4:06 That's because of Sophocles' plan to make an insulator around Celesteela to avoid the forest from burning down.",
        "I never knew what guzzlord actually sounded like, so now that I do it kinda sounds like a noise zach from Oneyplays would make\nI cant be the only one who thinks this",
        "Munch lol",
        "Ultra beasts was a short and fun treat. Thank you.",
        "Wheres necrozma he is still technically an ultra beast from ultra space in the games also being where it lives, comes from and where you defeat it in ultra sun/moon",
        "I thought poipole was just bassed off of poi, it’s a tropical-ish potato type vegetable down in the Hawaiian islands it’s packed with protein but pretty soft and hard to eat so that’s where I got my idea from considering I eat it a lot ️",
        "Guzzlord does not sound like that in the anime, the reference is purely a meme video.",
        "Lmao. I thought kartana was speaking Japanese.",
        "1:30 I love the reference to the set name being \"Unbroken bonds\"",
        "I feel like Kartana being able to cut “anything” should mean it can even cut the glue.",
        "You know, I always have a spot spot for kartana (for one it’s tiny like a eevee) but weighs at much as flabebe \nBut it’s not weak, (well specially tho) it’s has very high attack, and has ferrothorn like defense, but it’s fast",
        "I respect everyone who were involved in this , seriously the best piece that I ' ve ever seen on YouTube ,Hats of the Well All ! Love your videos",
        "So Poipole and Naganadel can shoot purple Gorilla glue......",
        "Naganadel is uses Flex Seal",
        "5:12 so thats why it sounded like sam",
        "Hold up Necrozma is not ultra beast or was it forgotten?",
        "\"Ew, don't touch me.\"\n- Ultra Beast\n\n(It's funny to me how multiple of them go berserk if you touch them)",
        "Wait so Kartana can cut time and space in half",
        "What is katana saying in the video? When I recorded some of the video, I couldn't really understand what it was saying.",
        "5:12 Can't believe you didn't mention the Portal 2 reference here \n6:48 and Sans' death here",
        "What are Naganadel and Guzzlord based off of? That's an easy question. They're Ridley and Kraid.",
        "Make ultra beasts with mega evolutions pleas",
        "Naganadel is based on a syringe and bee while Poipole is based off of a bee larva",
        "Naganadel is probably one of my favorite pokemon ever",
        "Y reali need mega ultra beasts pleas pleas pleaaaaaaaaaaas",
        "Can we just talk about how beautiful the thumbnails are and whoever draws them should be awarded the best animator honestly",
        "It’s not just glue. It’s a luminescent poison adhesive.",
        "y u no talk about undertale reference",
        "This series was an absolute gem, such a shame it had to end ;)",
        "Always love tcg references in these battle royales. A little research goes a long way to please people that enjoy every different medium of Pokémon at once!",
        "Kartana = Jetstream Sam",
        "im disappointed you didnt point out the undertale reference too ;-;",
        "5:15 i thought spaaace was a refference to the defect core from portal when defeating wheatly",
        "Time for me to nit pick can people please stop calling a katana a samurai sword if your going to refer to the katana by its name please call it by its name normally the one who crafted it will give it a name.\n\nSamurai might be popular but they often used a number of weapons its just anime or movies depict them only using katana's it would be equal to calling a claymore a long sword when a claymore is a two handed heavy sword while a long sword can in fact be wielded with one hand its just slightly longer then a short sword.",
        "No, no, they are not Pokemon. I refuse to accept them as such. Pokemon from a different dimension is akin to calling Digimon Pokemon from another dimension, or animals in our reality Pokemon from another dimension. In order to give them the title, there needs to be a standard by which Pokemon may be considered different than any other creature from an alternate dimension. If the standard is just \"creature that learns attacks and can be obtained\" regular animals fit that.",
        "surprised that Sogaleo, Lunala, and Necrozma were not involved. Just because they are considered Legendaries, doesn't mean they aren't ultra beasts.",
        "Can we just appreciate how Cory makes us smile:goodvibes:",
        "1:10 it just sounds like a big Pokémon just stepped on his tail ",
        "Feels like mew is an ultra beast",
        "but can cartana cut through poipols glue?",
        "Good",
        "Ahhhhh my paper boi did so well. Very close loss.",
        "Love these kinds of vids!!!",
        "NAGA-NA-Dell",
        "Nagandell and kartanas final battle should of ended in a tie because it's head was cut off",
        "Now I'm worried what would happen lore wise if Kartana were to try and cut through Tyranitar...\n\n(Actually wouldn't they just pass through each other?)",
        "How did kartana lose that tho, the shot Naganadel shot was it would have been poison type which it's immune to and the hit Kartana landed cut into what is basically Naganadel head causing where it's brain is to explode. Kartana resists everything Naganadel does and took basically no damage the entire fight.",
        "This video is the first one I got notified of instead of the TerminalMontage one. Made me realize I didn't ring the bell for TerminalMontage. So thanks for that, Lockstin.",
        "If Ultra Necrozma, Lunala and Solgaleo were counted Ultraa Necrozma would win!",
        "Why was the paper cut in 2nd place",
        "6:50 undertale reference",
        "I spent the whole video expecting Necrozma to show up and win, so that was a little disappointing, however, I understand the decision not to include it. Also the pronunciation of Naganadel is wrong. Nadel is german for \"needle\" and is pronounced very similarly.",
        "Honestly, had Kartana not sliced up Naganadel''s stinger trying to look cool he might have won",
        "I feel im an Ultra Beast.\n\n\nI too dont like to be touched.",
        "9:54 Today I learned that Kartana's Japanese name is Kamitsurugi. Its name is paper sword.",
        "Clean cuts and still cuts a tomato",
        "May I ask why Necrozma and why the two sun and moon legendaries are not included? Necrozma is the strongest argument that it is a ultrabeast, the other two not so much.",
        "What, Pennywise is an ALIEN?!",
        "They did a great job of recreating the old vibes of the first warzone trailers for like verdansk. Just pure chaos, awesome maps, and mindless fun. Nothing too serious. Super excited for this!!!",
        "Aren't Lunala and Solgaleo (and their pre evos) ultrabeasts too?",
        "Fun fact Kartana sword slicing up Naganadel stinger is based off Cloud slicing up through Bahamut's attack into his body and destroying it in the movie Final Fantasy 7 Advent Children.",
        "So, why is guzzlord so bad in competitive compared to the other beasts?",
        "What about Necrozma?",
        "As much as I would have liked thematically to have seen Necrozma and the box arts, Ultra Necrozma would have just one-shot everything. Probably a good call leaving them out.",
        "1:07 pov: you just stepped on Lego",
        "Wouldn't Kartana be immune to Naganadel's poison because it's a steel type?",
        "The ending was badass.",
        "The only pokemon battle Royale that I can think of to come next would be a starter battle royale, Edit: ALRIGHT I GET THERE ARE BATTLE ROYALES THAT COULD HAPPEN",
        "I knew Kartana had a really good chance to win.",
        "Could we get a paradox pokemon battle Royale next?",
        "My only question is why didn't any of the ultra beast get affected by beast boost",
        "GuzzLord is like Regigigas",
        "It would be Funny If Celesteela pulled a Ditto from the first Battle Royale and just landed on Naganedel at the end",
        "Wait, Celesteela is made of BAMBOO?",
        "I still think kartana should’ve won",
        "NERRRRRRDS! Nerds! Nerds! Nerds! Nerds! Nerds!",
        "Saw the title and instantly clicked. Can't wait to check it out!",
        "Actually the ultra beasts are not Pokemon as stated by the official Pokemon company",
        "Wait a sec…\nNihilego wasn’t shiny in the original video",
        "I'm sad Guzzlord lost, still hurts, though deep down I knew katana was going to be a problem, but dang, he made it so far it gave me hope, all I am now is a broken man.",
        "I still think guzzlord should have won, because as you said, it has a black hole stomach. Would this not imply that the stomach is inescapable?",
        "I would like if there was a reference to non-base form necrozma being an ultra beast, asd in the tcg dawn wings, dusk mane and ultra necrozma all get the ultra beast tag \nonly a reference, as the game doesn't classify those as ultra beasts, even if the tcg and the anime do",
        "Nothing can beat the mighty katana, as we see once more here.\nAlso, why is the video so green?",
        "solgaleo, lunala, and necrozma are ultra beasts it's just that because they exist more prominently in lore, pokeballs can recognize them as pokémon (it has info to compare to in nailing down their dna). in swsh, pokeballs can now work on ultra beasts just fine as they have now been researched.",
        "poipole always wins.",
        "Where was eternatus and necrozma",
        "The amount of work you both put into these so they are accurate and extremely entertaining is always so wonderful! It makes me sad knowing one day you will have done them all. Till then wild and wonderful trips!",
        "i hoped to se you, but i got your chibi, its ok, but i love you",
        "Tbh probably the only one I've disagreed with but more so because I think it would've been more so a draw between the last two.",
        "",
        "U should do a battle royale of the Paradox Pokemon in the future",
        "Not gonna lie, \n\nI was wondering who was gonna stop Kartana, what can dull sharp?",
        "Dang I was rooting for the big bad Guzlord",
        "i really like how he mispronounces naganadel",
        "I think Kartana losing was a bummer and didn't make sense since it seemed like you didn't take actual typings into consideration.\n\nKartana is Grass Steel. Steel. Immune to poison. Resisting dragons. ",
        "Why is the video green",
        "Wow",
        "#1 on trending !!",
        "If only naganadel evolved to a 3rd stage",
        "Didn't Know Terminal would Make this",
        "I love the aliens tie in excellent episode Lockstins and TM",
        "The most surprising part was the kartana having sams lines",
        "Katana should have won because it's steel type",
        "blacephalon would gladly be reze's pokemon from chainsaw man",
        "Smogon being mentioned by a Youtuber with 1 Mil Subs ",
        "Does anybody else remember those mega sized xurkitrees, and wonder how they would’ve fared here",
        "Is the video really green for anyone else? Or is it just me?",
        "Fun video but I still feel like naganadel should've lost/died way earlier in this battle royale.",
        "1:12 lol",
        "YES! My rules of nature jokes on Kartana were appropriate!!!",
        "Is Type: Null not an ultrabeast?",
        "My favourite invasive species … paper",
        "Love the videos! You put so much time and work into them and they make my day better",
        "i have come here for the lore️",
        "\"Nigangel beats it of easily\"",
        "I thought that kartana’s voice was the spy and/or the soldier from tf2",
        "Celisteela can't choose to burn down something beacuse in the alola series they built a wall to stop the heat",
        "I like how this is exactly a minute longer than the actual BR.",
        "What about the bot ubs? And nekrozma",
        "just so yall know guzzlord uses the scream of jimmyhere",
        "Guzzlord : AAAAAAAAHHHH\nIs basically what makes everything legitimate.",
        "U should make a battle royale on pseudo legendary",
        "I love Blachepalon :)",
        "I LOVED the poipole opening, my favorite ultra beast is poipole for some reason and my favorite Mario character is yoshi. Thank you",
        "Agar aapko video acchi lagi to mere channel ko subscribe kijiye",
        "The naganadel and guzzlord team up reminder me a lot the symbiotic relation of godzilla and mothra just look a it!! Guzzlord being the big powerful monster capable of destroy almost anything and naganadel being the aerial backup and very useful ally sometimes idk i just thinked about it also sorry if i type something wrong im spanish",
        "This fight broke up the lesbian relationship that is Buzzwole and Pheromosa",
        "You did a poor job on this one, D- for effort",
        "This is a good game",
        "19:15 I feel like the reason smiity's videos are always so good are because he and his friends are never afraid to make jokes like these",
        "But steel is immune to poison and resistant to dragon and so kartana should’ve won",
        "No bungee gum reference unfortunately",
        "I did not catch on that Nagnadel one.\nI thought that was a Kartana victory",
        "Naganadel is my favorite ultra beast so I'm happy it won here!",
        "1:14 I thought he was iron giant. He even says “Hogarth”. And the power plant bit.",
        "rip blacephalon they didnt deserve to go out that way.... ",
        "Was Kartana slicing Naganadel's stinger during the last moments of the royale a reference to Samurai Jack?  There's a scene in one episode where a multitude of bee robots combine to form a giant laser cannon that charges up an attack. Jack prevents it from firing by slicing the cannon's tip, resulting in the entire thing exploding.",
        "Isn't Stakataka based on the Colonials in After Man?",
        "I'm you tuber  \nnice  video",
        "Imagine a Kaskade region battle royale. It’d be way too chaotic, but maybe if it was just narrowed down to fully evolved forms it’d work?",
        "Is nacrosma considered a ultra beast or would it be to one-sided?",
        "But you gotta remember, since kartana can cut through anything, what's to saw it couldn't cut through the explosion to prevent itself from being hurt.",
        "Can we just take a moment to appreciate Cory's  hardworking and appreciate him uploading frequently",
        "why are th blue body parts green in this video",
        "I disagree that kartana would be able to beat guzzlord after being swallowed.",
        "What were all the kartana quotes?",
        "Okay but TF2 moment when",
        "im glad my favorite finished 3rd",
        "7:25 of all things this win makes 0 sense. It's bottom end was cut clean open and exploded..which is where it's brain is so it should be dead; and the \"glue\" shouldn't have any effect on a steel type like Kartana (it's toxic liquid, while it maybe possibly could stick to Kartana it wouldn't do any damage), also why would it of exploded?! Justice for Kartana! Cheating my boi out of a deserved win.",
        "that i want wings to from mom was adorable",
        "#1 on trending?",
        "I feel like if Kartana and Naganadel fought right off the bat the same way Kartana woulda won",
        "6:28 I guess you could say it's the only thing he's ever known. GUITAR RIFF  SIEROMEM NEKORB EHT HTUHRT SEOG NEKOPSNU!",
        "Nah see I'm just mad that Guzzlord didn't win.  When they sucked up Naganadel and Kartana, as they described it, Guzzlord used a \"black hole like\" method, which would supposedly destroy anything it sucks up.  To move faster than a black hole, Kartana would have to move faster than light itself, correct?  Especially because it was already in the black hole, as it was already inside Guzzlord.  Therefore, since Kartana may be fast -- but not above light speed in my opinion -- it should not have been able to slice Guzzlord in half and thus should not have won.",
        "5:28 Source?\nAlso, I didn't find anything in Poipole's Pokedex entries about it being adhesive. Is that extrapolating from its evolved form's abilities? Or an anime thing? Same question about the brain in stinger thing, is there any evidence for that beyond assuming from body structure?",
        "Wouldn't Kartana be immune to poison bc steel?",
        "Y'all remember where Kartana tried to cut up a rainbow?",
        "2:41 reminded me of ”The Cube”",
        "Not gonna lie, the big shots opening caught me off guard for a second.",
        "Also hal 9000.",
        "1:09 EHEHEHEHEH! Ohhh the anime was hilarious.\n6:12 Pheramosa needs scissors...SIXTY ONE!!!\n7:03 Being part steel type, Poison cannot marr it's surface. But the flame of a blast, it cannot survive.",
        "Where's Solgaleo and Lunala?",
        "Fun fact, Guzzlord's voice is literally just an unedited sound of James' VA screaming.",
        "Doesn’t explain why cartana didn’t just kill negonodale",
        "Number 1 Trending!",
        "hopefully the next one is paradox mons",
        "Just watched\n\nkartana is crazy",
        "That’s how guzzlers ate teh earth",
        "Buzzwole and Pheromosa should have teamed up as they have a tag team card too!",
        "*Kartana using Sams voice lines\nOh good. Why, that's very good yes I like that!",
        "I really want to see an Showdown with all the regional Pokemon...i mean different region forms",
        "For obvious reasons Necrozma, Solgaleo, Lunala and their pre-evolutions were not here",
        "I dont think that Lusamine borows her style from Pheromosa. It is the ultra beats themselves that are inspired from sun and moon characters",
        "\"5 Naganadel\" is a little misleading. You almost always play multiple of a Pokemon card in the card game, but that deck used two different types of Naganadel card for support. The TCG isn't particularly held to basing a card's power off of its Pokemon, though- Joltik was once the heaviest hitter around.",
        "I really enjoyed the The Snatcher reference in the Terminal Montage video when Nihilego possesses Pheromosa. It made me chuckle probably a bit more than it should.\nAlso I just like seeing A Hat in Time get more recognition even in silly little references like that laugh.",
        "Look, celesteela may not have won, but I choose to believe she survived, so I'm satisfied. Shame she didn't do much tho",
        "But wouldn't kartana not be damaged by poison as its a steel type?",
        "Guzlord: “the most powerful of all.”\n\nNecrozma: am I a joke? I fought God!!",
        "We need to see Smii7y and the gang playing battles in Mario Kart before we die.",
        "Ahh yes, it gets sliced then blows up from the inside by its own shot, but still survives.",
        "Anyone know what kartana is saying throughout the video?",
        "I thought Kartana won?",
        "A quick question about Ultra Space or Pokemon from light-years away. Necrozma is said to be from an alternative universe (I think) so what would he be considered as?",
        "It's crazy that the entire time when I saw Kartana V Naganadel I exclaimed \"BUT IT'S IMMUNE TO POISON\". this might be true, but it does not stop glue from being glue in this anime-esque combat",
        "Congrats on #1 on trending!!!",
        "The second I heard that kartana's lines were Sam I got hyped",
        "1:17 Don’t forget the Iron Giant reference when Xurkitree says “Hogarth?” and lumbers towards the power plant!",
        "The only thing that I didn't liked was that he didn't adapted blacefalon's moonwalk from the anime",
        "If Phil Swift were a trainer, I'm pretty aire His Partner would be Naganadel",
        "Being neganedel is like being the kid in Fortnite who won 1st place through sheer luck despite being awful at the game.",
        "why did you not add cosmog evolution line",
        "Irrelevant to the video but I remember he made a joke once about how gamefreak isn’t so lazy as to make a fire flamingo and call it FLAMEingo and like…they just did. They didn’t even change the color it just looks like a normal ass flamingo. Also a bunch of the new mons have name very similar to some of the lockemon names he’s made.",
        "During the whole video I thought that pheromosa was going to take a little hit and she was going to die.",
        "Is it just me or does the color of the video get really weird?",
        "I’m curious what your take will be on the leaked Paldean Terastal Legendary.",
        "Appreciate that you don't just explain what happens scene-by-scene, but also your reasoning for why certain pokemon did well overall in the fight. Another really fun Battle Royale!",
        "i always watch these first",
        "0:16 that's not how taxonomy would work but okay",
        "If you feel like nobody cares about you, go somewhere by yourself and kneel down to pray. Put your hands together and give your praise and prayer requests to Jesus! Jesus cares about you! He cares about mankind! Even though we as people can’t see Jesus with our eyes, we know for a fact that GOD sees us with his. For it is written, “The eyes of the LORD are in every place, beholding the evil and the good.” Proverbs 15:3 KJV ",
        "Explain more pokemon loreeee",
        "Was 5:13 a portal reference? From portal two",
        "I just dont know how Guzzlord didn't that  guy is a walking black hole",
        "And what about Portal and Undertale references? Or are they too obvious to be mentioned?"
    ],
    "comments_disabled": false
}