{"video_id": "d-P8yV2jQA4", "comments": ["I swear, Cory is one of the few YouTubers who make games more entertaining and energetic. Even the calmest games turn into hype sessions.", "I know y’all are happy and grateful for the videos he is trying hard to  make but at least talk about what happens in the video.  Love the gameplay Cory", "I love Cory’s addiction to scary games. It makes me feel like I’m not the only one who plays games that are scary. In general, Cory, thank you for making our lives better, especially with what’s going on in the world right now. Love ya’ like a brother 🫶", "I love when Cory plays a game and takes time out of his day to go do something else for us it’s so entertaining", "I know not many people like side quests, but i LOVE that you're doing them. Side quests let's us learn more of the world we are walking on, explore different sites, experience new things through the characters we play, see their interactions with other characters and watch as they change and grow through them. It feels SO MUCH richer and we actually get to grow EVEN MORE attached to each character as we play through the game. Absolutely LOVING it. Can't wait to see what happens next. ^^", "cory has changed so much over the years but watching his videos always feel the same :)", "Cory should seriously make a series where he just goes back to all the games he never finished to complete them.", "The bio shock references are amazing. Those games are some of my childhood favourites and cool to see Cory knows so much about them. Also nice to see a game inspired by bio shock, and a lot too some scenes i thought they he was playing bioshock lmao", "This man is funny, he is serious, really good at games (always the hardest difficulty man), and he is a legend", "Corys humor never fails to make me laugh. We love u cory And keep being a legend", "These 1 hour videos is kinda hittin Cory ", "Cory, I speak for your fan base when I say I am so grateful for what you have made of yourself in this world, I’ve been watching your videos for the last 6 years. You’ve become a certain part of my life that I will never forget, thank you.", "Cory is the only person who actually makes a long game look interesting. His commentating is out of this world and he’s makes it look so easy. Great video cory ", "any game you play cory is just entertaining", "Cory funny as hell bro, 26:05 had me dead ", "The way Audrey holds Bendy hand in reassurance is so calming and adorable ", "So glad to see you active again Cory! Can’t wait to see more horror games", "Cory is one of the only YouTubers I could watch for hours without getting bored", "it has become my routine to bless cory whenever he sneezes now", "I swear, Corey is one of the few YouTubers that makes videos that actually makes sense to people that like horror games and he is trying hard to make these videos but no one appreciates it", "Cory’s videos never disappoint. I can watch him and dashie all day", "Cory is an amazing Artist. There is nothing trash about it.", "The amount of hours and editing and time Cory’s putting into YouTube for us … we love you Cory ️", "Cory, coming back to this series in particular is an nice touch indeed.", "Me at night in my room just watchin cory's best bendy vids is such a vibe", "cory we love you and if your aunt was here right now she would be so proud to see all of this and how much you have accomplished we are always here for you", "Can we just take a moment to appreciate Cory’s hardworking and appreciate him uploading this frequently", "Love that Cory knows that a mirror in a video game 9 times out of 10 is just a flex", "You do not know how greatful I am to hear Cory say his appreciations to animators and artists. Makes me feel so special. ️", "this is why i love coryxkenshien hes the only one that keeps every game hype andenergetic and exciting", "I had no idea this guy made a sequel, dope that Cory is playing", "Cory is a youtuber who hasn't changed in years. I love it, never change Cory.", "Cory is like that fun uncle I never got to have (rip uncle Marcus) I feel we could relate a lot and he always brings me joy.", "I would love whoever just list all the jump scares in the video of any horror game he plays just so I’m prepared ", "Cory actually makes me laugh. I go through hard times then hangout on this channel ", "This man is truly built different, that Goku session nearly killed me", "Cory’s Impressions are honestly some of the best I’ve heard", "Cory always puts positivity in all games.", "Cory's sneezes are getting more and more unrecognizable each video", "bro Cory is one of the best YouTubers he always tries even when he is at his worst and he still provides for us he’s like a father we never head.. ", "Feels like Christmas came early with Cory’s upload schedule lately ", "05:35 Let's just appreciate how much effort and time he puts in these videos to make our day huge respect!\n\nIt's unbelievable, and I think they deserve a lot more than that", "How he stayed still from the scene  23:38\nCorys reaction 26:07 ", "Cory I'm going through a hard time and been having trouble sleeping lately. You and your content provides so much comfort I was able to sleep well. Thank you for existing ", "love the grind cory, keep it up", "Cory puts everything in his power to make videos. I'm proud and hope you are doing good.", "Even though cory is 30 years old now. He still knows the \" I AM THE CHOSEN. \"", "Bro this is why I love cory , bro drew that goku with confidence and when he takes the time to look at it he just instantly goes \"this is trash.\" Ima be real better than what I could ever make, amazing video man, thanks for putting the effort in giving us entertainment, we're with you all the way through  ", "Corey probably one of the best Youtubers that ever lived he inspired so many people thanks Cory for letting us entertained hope the best of luck to you", "Cory had me dead when he just froze ", "Cory, the guy who made a lot of people smile with his way of playing games.", "This is the hardest I've laughed in a while. This game takes the stick fight mayhem to an 11 and I love it.", "Can we take a moment to appreciate how much time and work he puts into these videos for us ", "Cory’s millirock song is always hilarious ", "Cory has his hands tied with GOWR, RE8 Village, and BTDR, so we probably not gonna have a new SSS for a bit, still he gives us quality content still so there is really nothing to be mad about. (Also, reminder to not be one of those people who were mad about Cory (almost) retiring)", "Cory is the legend, this has to be something I say even though I bet everyone knows.", "I don't know how, but Cory always makes horror games look so easy!", "I can’t wait to see a part2 I loved watching him play this", "The only 2 people I will watch play this game are Cory, and YuB, they both give off the same energy and it makes sense that they’re friends. Also YuB deserves more attention", "Cory you ain’t slick you owe us 2 double uploads buddy", "Can we just appreciate that Cory’s comments are always positive and supportive", "I would love daily episodes of this like you did with 12 minutes", "Cory never fails to make me smile he always has good energy and makes his videos entertaining and fun and he also has grew a lottt  I really do appreciate you Cory", "the game: press e to hide, stay low to avoid trouble\ncory: folds almost everyone in the game", "yesyesyesyes this is great. I'm sleep deprived and living off tootsie pops and now and laters ready to do a Cory binge and this is a great start ", "23:34 I almost pissed myself laughing  that acting hit at the PERFECT moment, oh my god", "Can we just appreciate how much effort Cory puts into his drawings ", "Cory uploading so much this month, thank you Cory", "That janitor’s voice is METAL AF!!", "Keep up your fantastic videos Cory, God bless you man", "Im glad the devs spent a long time on this, it looks very high quality.", "Cory is so good bro he’s like the best YouTuber and he’s really funny bro props this amazing man for making my life better everyday Cory is a legend", "I love Cory's commentary throughout the video, because whenever Cory sees something that's logical he always gives plot points about it which makes the playthrough a lot more entertaining. Honestly I am just glad Cory is still doing very well and is still having a great life.", "Cory can make anything hype. Keep it going Cory... you've been THAT GUY for too long", "It’s nice seeing Cory play Bendy again after 4 years, I can’t wait to see him finish Batim Chapter 5 as well", "You playing bioshock would make my year! the whole game series is so much fun, and introducing folks to it would be amazing :D", "Corey I want to just say thank you for getting me through the semester, I watch you literally as I’m doing my homework, and having your commentary in my background really helps!!", "Audrey’s voice actor is INSANELY good at her character!! Honestly gave me chills", "cory makes a 44 minute video feel like 10 with how enjoyable it is", "Honestly I feel like Cory would get a kick out of Jazzpunk!\n\nI would also love to see him play“what remains of Edith Finch” it’s such a gorgeous game", "I've been watching Cory since I was 5. I'll love him all day every day LITERALLY.", "Cory replying after I say bless you to him through the screen brings me joy", "That drawing isn’t that bad. It’s a masterpiece compared to how my art used to look you just have to practice", "Not playing Bendy And The Ink Machine chapter 5 before playing the next game is quite a questionable decision, but hey, what's done is done. I'm just ecstatic we were blessed with this incredible upload by the man himself", "I swear Cory's videos are somehow so relaxing to watch", "Cory you have no idea how excited I got to see you draw ", "Hey Cory, I love your videos, been watching them since last year. But I do recommend you to watch BizarreBub's Scary Comp. , they are entertaining and also scary at the same time.I'm also subbed to your channel so I cannot miss your uploads :)", "I really am happy that you played this game, and even acknowledged Chapter 5 of Batim. This stuff gives me hope!", "Cory's the only youtube that can play a game that i have already seen someone else do and it still be interesting", "I love this guy coryxkenshin is a god he makes the calmest and boring fun to watch", "Other YouTubers: “This game is absolutely horrifying.”\n\nCory: “Hey look at that guy who moves his neck like he is on crack.”", "Love watching your playthroughs and as someone who kinda draws anime alot i adored watching you draw goku such a lighthearted segment before the terror. Loved your goku and love your content im literally watching you play as I work on a drawing. The jump scares dont help though", "Love u Cory thank u for making my day hope thanksgiving goes good for u", "This DLC is literally like BioShock. I love it", "Cory is such an amazing role model. I can't wait for this series, the nostalgia is already kicking", "Professional player Professional gamer Professional ankle breaker AND Professional artist\n\n\nTHIS MAN GOT EVERYTHING", "It's funny how both Cory and Dashie made Human Resource and \"You wanna fight?\" jokes about Ol' Wilson in this game.", "Yo I just wanna say I appreciate the editing you put into the first like 2 minutes of this video every few seconds had me dying", "I think the worst part about the combat other then the fact you can't block is the fact that they don't budge after hitting them so your stuck getting hit while your hitting them smh.", "Cory always be making games funny, entertaining and exciting to watch."]}