{
    "video_id": "d-P8yV2jQA4",
    "comments": [
        "Bless u",
        "The way I thought my computer was glitching right here  23:34",
        "Now Coryxkenshin is posting so much i cant even keep up, before you had to watch it all over again.. Appreciate you man.",
        "Cory that was a good drawing",
        "Okay but that Goku was lowkey decent",
        "Nah bro why Audrey built like the artist from dead by daylight ",
        "3:43 alien guko",
        "Cory's sneezes are getting more and more unrecognizable each video",
        "He bak ",
        "Love how Cory revisits games in a new form",
        "WE NEED TO SEE MORE GOD OF WAR",
        "Lit gameplay cory",
        "Audrey find that gent pipe NOW! Cory:”Aight”",
        "As a animator myself, I respect you as well CoryxKenshin.",
        "Is 1973 an important year to you personally because it’s one of your parents bday or year they where born?",
        "Cory :no your not built different you’re built the same",
        "“You scared of the boogey man” well in this case there is a boogey man",
        "4:14 I’m sick and this part made me die laughing. Thanks, Cory! God bless you!",
        "It’s 1:00",
        "Bro gave us the light skin stare at the beginning",
        "Cory calling that goku drawing trash like someone won't buy that off him for 5$ at the VERY LEAST.",
        "Little bendy is so cute ",
        "I cant friken watch a scary Gameplay without Cory playing he makes it so friken amazing",
        "1973 R.I.P Bruce Lee the LEGEND ",
        "That was terrifying",
        "anyone else get Gman vibes from old willson",
        "Sorry your not built different your built the same",
        "Big big fan like I've been here since the skits keep doing what u do let no one stop u peace and love ️️",
        "CoryxKenshin won’t you do the upDown up down thingy",
        "Pt3 and pt4 and pt5",
        "3:21 lmaooooooo ‘your not that guy’",
        "I thought the girl that that just got in the ink world was Alice but no she's was different",
        "The camera saw the drawing and said\n\n\"Oh nah\"",
        "Play Slendytubbies 3 Campaign Its a Horror Game Bet you can’t beat it",
        "34:43 chris smoove referenceeee",
        "I don't know how, but Cory always makes horror games look so easy!",
        "I used to play bendy and the ink machine all the time so I was excited to see him play bendy and the dark revival hopefully he makes a pt2\nThis is one if the only channels I could watçh for hours without clicking off",
        "my dream like is literally to meet Cory. like just to have a conversation or a hug. he makes my life better by watching his videos",
        "When every I’m in a bad mood Cory always makes me laugh and smile",
        "Yeah CoryxKenshin you are built different you scream like a banshee it’s not gonna jump out of the screen and eat you!!!!!!!",
        "35:20 had me dying",
        "6:10 PERFECT TIMING LMAO",
        "34:44 This man was laughing like he was Harry Pinero ",
        "Can we just appreciate that Cory just uploads for us ",
        "Is it just me or did the ink demon kinda sound like Rick from Rick and morty at\n34:20",
        "His drawing is pretty good",
        "I’m glad I did not play this game cause bendy sucks",
        "Im so greatful for you... everything inm y life has going so so wrong I lost my Dog Lunaris... then my cat Clementine (Dont judge the names!) at least your year Cory ...",
        "Bro why is Bendy so freakin cute tho ",
        "This boy 30000000000000000000000000",
        "Oh this is going to be a wild gameplay! Wonder if \"kid\" Bendy is good or if it's a facade to trick Audrey.",
        "I legit thought his camera froze",
        "man is so old i cant even rember any videos about him since this days",
        "This is just what I needed for a depressing day like this. Thank you. Cory back at it ",
        "41:36 started glitching",
        "I swear cory’s scream scare me more than the game",
        "FNAF jr's part 2",
        "Bruh, Joey Drew Studios seriously just said with this game, \"Yeah let's make the ink machine just a couple of cameos.\" like bro, GIVE IT AN ACTUAL PURPOSE! Nah, but in all seriousness, it is basically just a cameo, I mean, yeah, it does technically act as a portal opener between the real world and the ink world, but other than that, nothing. Like I said, basically just a cameo.",
        "Watching you play Bendy made my day . I been very stress with like just growing up , let's be honest growing up ain't easy . Annyywwaaayyyssss ... thank you for playing , I'll keep watching .",
        "\"Body just took a screenshot\" got me dying on the floor",
        "24:42 ",
        "This man is funny, he is serious, really good at games (always the hardest difficulty man), and he is a legend",
        "4:14 ",
        "Watching Cory play a horror game while drinking tea is NOT a good idea.\nStill love it tho.",
        "We Want Drawing With Cory!",
        "R.I.P my ears. I paused the video at 0:01 and then plugged in my headphones. As SOON as I unpause it I got jump-scared and it was extremely loud.",
        "1973 I can guess why it’s so important to you it’s so important to you because mostly it’s because you had your childhood at that time did I guessed right?",
        "Two seconds in at all you notice something funny how is dude scream like it’s a dog bark",
        "My name is Audrey!!!!!!!!",
        "I think someone is simpping here",
        "I feel bad for bendy on that one scene but i also dont because, well, its bendy",
        "Bro bioshock have the creeps",
        "ww",
        "Bendy really said ",
        "already got me slicing with the delayed turn and never knew cory kenshin rhymed with built different🫶",
        "Wait why was the drawing not even bad though",
        "Reallycory",
        "Cory be like who's crying its your dad crying cos he never came back with da milk",
        "Why is kid bendy so wholesome and cute",
        "I can watch Cory for 999m years he's the legend and goat",
        "C9ry should record a playthrough of bioshock",
        "19",
        "0:20 bro got that lightskin stare",
        "whys it called a gent pipe",
        "24:59\nCareful Cory…you’re Elmer Fudd is showing.",
        "34:42 SHOUT OUT CHRIS SMOOVE",
        "19:03 bro said pause without saying pause",
        "I love Cory's commentary throughout the video, because whenever Cory sees something that's logical he always gives plot points about it which makes the playthrough a lot more entertaining. Honestly I am just glad Cory is still doing very well and is still having a great life.",
        "I tried to guess why the year 1973 was important to Cory, I believe it’s one of his parents birth years lol ",
        "I can hear the Smokies smoke",
        "I remember when he first played this game and how erie it was lol, like it's just something so strange and scary about this game even though it isn't extreme horror.",
        "Cory always makes my day ",
        "Audrey sweet Audrey so dark voice",
        "At 21:13 my soul left my body ",
        "Cory if possible can u make part 3 please",
        "i only new bendy in the ink machine guess that one is old now",
        "Corryyyy you should really playyy plaque of tales",
        "“You're not built different, you're built the same” ️️",
        "In 24:37, I Milly Rock. Hide it in my sock.",
        "那都是ngtb is actually和你一样不认识我感冒了你可以用",
        "42:48 :(",
        "I have too question bendy like ban 10 and he like ban to I ban you sorry that was joke ;-; be happy cory boy",
        "My only complaint is that almost every input you have in this world has a cutscene. It kinda makes it feels dragged out a bit.",
        "20:59 SHE LOOKIN KINDA FINEEEEEE",
        "After you dropped your phone or your camera why did you say what’s your name Bendy because you were jealous",
        "Hey Cory i hope your day is going well well my day worse",
        "Cooorrryyyy!!!",
        "Read my comment because you need to beat it",
        "AKA",
        "I'm was dying laughing when Cory did that face 7:47",
        "Cory: 1973, that year is very important to me.... y'all would never guess why.\n\nWell don't be shy, context is needed bcuz you weren't even around back then  ",
        "Press C to Crouch",
        "24:36 damn that's a throwback",
        "Yo the ink gobblin just like:is that u phill i told u im not ansewring u until i get my pictures\"XD",
        "i appreciate the blues clues drawing session",
        "you respect me being an artist",
        "Why did I think it said \"Press E to kill\"",
        "BRO JUNE 18 IS MY BIRTHDAY",
        "Okay that goku drawing was for real dope",
        "Day 3 of asking CoryxKenshin to shout-out me in one of his videos ",
        "No way I’m taking art tips from your goku art. Dawg you did that on a whim I can’t do that on a whim like that’s actually pretty good at least for me.",
        "Life is jus right when you post",
        "Bro 5:00 had me dead “this thunder is thunderin",
        "Cory is so authentic its so admirable even in that throwback vid wit da emo haircut u could tell folks didnt change  over the years. U are a hell of a role model gang folks a whole father figure to alot of ppl",
        "I can’t wait for part3 for bendy the dark revival",
        "i remember the minecraft goal he said for part 6 and it never happen:( love you tho cory",
        "LEWSHON THE KILLER THE KILLER BOY",
        "As soon  as I got my phone  got to watching him",
        "Bro why is his voice so crunchy ",
        "THE WAY I BURSTED OUT LAUGHING AT 41:34 \"DDAAAAAAANNNNGGGGGG\" HAHAHAHAHAHAHAHAHA \"STANKY LEG HORIZONTALLY\" STOP KAJHDKJHKDJHKSJFHKFJH",
        "watching cory playing bendy at 12 AM with snacks and drinks with nostalgia added couldn't get any better",
        "As an artist i was very interested when he said do you know how i draw?",
        "Cory i beg you to upload a bioshock playthrough one of my favorite games of all time",
        "Ay bro that drawing was pretty good imo",
        "Bro what are you talking about? That drawing is not bad \nit looks good\n\nKeep practicing and you'll get even better",
        "That's a trash I can't even draw him as good as you I could draw myself not my real self like cartoon self some people call me a game character cuz I am a game character so that does look really good though you draw my favorite character",
        "Hi Cory! Big fan! I know you probably won't see this but you are the king thanks for being a big part of my life ",
        "cory always fun to watch cuz he always has a joke to make, my face hurts evertime after his vids end ",
        "BENY AND THE INK MACHINE WAS MY GAMEEEEEEEE IM SO HAPPY THEY REDID IT",
        "He draws better than me",
        "\"How many cigarettes have you smoked in your life\"",
        "OMG YESS, Its so weird to be happy",
        "1:29 27k in 8 minutes ",
        "That drawing is good you should be a artist",
        "bro that goku gonna be selling for millions fr",
        "IM DYING, that camera fall was too dramatic I love to see it Cory!",
        "Corys humor never fails to make me laugh. We love u cory And keep being a legend",
        "Or you can just build different I don't even know that what starts with curry kitchen",
        "PLEASE REPLAY BIOSHOCK I LOVE THAT GAME SO MUCH",
        "Yo this is nothing like the last Bendy game holy shit the developers have really stepped up. Plus there’s much more voice acting and more npcs. And menu showing Audrey! Like this game is so different now I love it!",
        "this about to be another old game never to be seen again",
        "P",
        "Love the new series",
        "Cory pls make part 2. This game is entertaining, but you playing it makes it way better",
        "That goku you drew was actually fire ",
        "Can we just appreciate that Cory’s comments are always positive and supportive",
        "When is the gonna be a game where when you Up down up down it gives you an achievement",
        "Cory is so funny to the point I’m already just laughing at the beginning ",
        "It’s nice seeing Cory play Bendy again after 4 years, I can’t wait to see him finish Batim Chapter 5 as well",
        "Is it just me or is this game giving off bioshock vibes\n(Cory has to be reading me mind right after I commented this Cory mentioned it)",
        "30:47 What happened cory? Had to YAAAAAWWwwn? Maybe pick your nose? Ya diggin for GOLD CORY?",
        "Well got more than 10 K likes then an hour more like six minutes so I think we just have two more uploads tomorrow as well as another upload tonight",
        "this dude got scared over a cardboard cut out 5:35   And can I just say something (I love your videos Cory) why the freak does Wilson sound like salad fingers..you know that weird creepy green guy..",
        "23:39 thought my tablet froze",
        "That's what interest saying you be it bendy",
        "I JUST LOVE HOW HES ONLINE EVERYDAY AND HAPPY BIRTHDAY AGAIN AND IM SO HAPPY HES NOW GONNA POST ALOT",
        "451",
        "I think maybe you could actually teach me if you know to you're such an amazing artist Cory Kenshin I think yeah I was good so don't let your talent fool you",
        "05:35 Let's just appreciate how much effort and time he puts in these videos to make our day huge respect!\n\nIt's unbelievable, and I think they deserve a lot more than that",
        "Up DoWn Up DoWn",
        "yo how does one not get bioshock vibes",
        "I love this",
        "POOR KID BENDY",
        "Bro I was dying at 24:34 ",
        "the fact that i said bless u twice aswell is funny",
        "Thanks!",
        "These 1 hour videos is kinda hittin Cory ",
        "9:49 the nostalgia hit me like a bish",
        "this is a good one cory please play roblox with kew",
        "Legit I laughed at this part 4:20",
        "since my name is audrey, it makes this 10 times for entertaining",
        "When cory froze himself on the screen had me weak",
        "Can we just take a moment to appreciate Cory’s hardworking and appreciate him uploading this frequently",
        "1973....if ykyk",
        "Cory has been posting so much that I almost can't keep up I'm just now watching this",
        "You do not know how greatful I am to hear Cory say his appreciations to animators and artists. Makes me feel so special. ️",
        "16:11 He really said WhiteDudeGasping.mp3",
        "24:37 NAHH ",
        "I am so ecstatic for this series. It brings back so many memories. Since the king never disappoints, I'm going to watch this and reminisce to it to its fullest.",
        "I would LOVE to see Cory play the Bioshock games ",
        "Corey is the reason I come home from school and watch YouTube he makes long games interesting and funny",
        "poor little bendy :( give him a hug",
        "I always used to watch your old bendy videos, now im glad i have some new videos to watch from you :D",
        "“This thunder is thundering”",
        "My problem is that when he mispronounced 'contributed' and zoomed in...I didn't think anything was wrong...",
        "Someone is going to make a beat out of this  37:45",
        "when Cory did the “Audrey,sweet audrey…” I thought his voice was getting remixed irl",
        "Cory is one of the best and energetic yourtuber I know and also you have to understand,HE'S BUILT DIFFERENT",
        "Bro.when I tell you I wouldn’t even watch other people play this game I literally said the game is only good with Cory in it",
        "Bro said your not built different your built the same lol",
        "play modern warfare 2 please",
        "I'm 8 and I still draw Goku",
        "\"Your not built different, your built the sAme",
        "It’s so weird hearing Cory say my name",
        "Cory you should for real play bioshock bro I would love that series and I’ve been playing bioshock since I was 9 ",
        "42:34-42:51 He was so adorable omgg",
        "I was laughing soooo hard when he drew that anime character and said it sucked ",
        "cory makes a 44 minute video feel like 10 with how enjoyable it is",
        "whats that mouse pad cory",
        "i love yu bae",
        "35:19 scream was immaculate ",
        "I was dying when Cory was hating on his own drawing and on top of that his camera fell and then he's just going to dish it all out on bendy",
        "I'm sorry I messed some of ur video I had school to do but when u posted again I will be watching",
        "37:44 \nThose sneezes AAchUrrR.. AAchUrrR\n\n41:35",
        "34:42 was that chris smoove???",
        "Just play chapter 5 it's not hard like it's (ABOUT) 20 mins.",
        "Cory should seriously make a series where he just goes back to all the games he never finished to complete them.",
        "My dad is going to kill himself and im watching Cory body bendy",
        "Dear god the drawing was an entire different breed, Shogun Saiyan",
        "4:11 got me laughing so much xD",
        "Cory had me dead when he just froze ",
        "0:00 to 44:34 is the best part",
        "9:49 That caught me WAYYY off guard ",
        "YAY ANKLE BREAKER",
        "no it dont rhyme cory... no it dont",
        "Cory, I speak for your fan base when I say I am so grateful for what you have made of yourself in this world, I’ve been watching your videos for the last 6 years. You’ve become a certain part of my life that I will never forget, thank you.",
        "bring back cooking with kenshin",
        "When Dale starts talking:\nMe: is that Danny Devito???",
        "\"Pull that switch\" that part killed me",
        "Head on being in one of the notes\nMe: \"Head on apply directly to the forehead\"",
        "Da—- it feels good to be a gánster \n\n                 Thank you for your time ok",
        "7:52 honestly this is a catch 22 for women. If we say no it could provoke him. If we yes then we have endure the creep being in our space. Like these situations are why I think knowing self defense is important.\n\nSo this is the prequel to the Bendy...or...? I gotta look up the lore on this!",
        "Love how Cory is always being hyped and energetic in all of his uploads, I also greatly appreciate his consistent uploads",
        "6:02 :O",
        "Who missed scary Sunday?",
        "Cory I give your drawing a 100/100",
        "bendy was so cute why did she have to hurt him ",
        "I don't really understand the logic of the npcs cause Audrey says everything out loud and they have zero reaction",
        "I think because Rubberhose cartoons are a little bendy and I think that since bendy is a rubberhose",
        "You playing bioshock would make my year! the whole game series is so much fun, and introducing folks to it would be amazing :D",
        "That drawing is better than my drawings",
        "2:34 i know why 1973 is important to you because that's the year bruce lee died",
        "hes back..... bendeys back",
        "bro started off the vid with the lightskin stare",
        "BRO you just find a way to make me laugh. Keep it up ",
        "baby bendyyyyyyyy ",
        "24:35 best scene ever",
        "up down up down left right left right",
        "He is actually good at drawing",
        "I’m just still worried about the part when you first learned how to banish them the monsters like why did you have to banish him she literally wrote a note saying you don’t have to kill me and you did it anyways I feel bad for him but I know you kind of had to but still",
        "41:14 muy bien ",
        "I have a theroy Wilson is Henry from the first game because at the end he kills Bendy",
        "They copy and Bioshock so hard ain't no way they copying this hard",
        "I swear cory gets 1# on trending everyday",
        "YEAAAHH",
        "Ngl cory’s goku drawing was pretty good",
        "Under stand stand",
        "Man the this game is crazy (the Wilson expression THE BEST)",
        "I can’t wait to see a part2 I loved watching him play this",
        "I'm gonna report how fire this is Cory is the best of them all if I can't find anything interesting I watch him and I'm satisfied",
        "full body haki thats what happened",
        "NEXT PART PLS! You make me laugh everyday and cure my sadness",
        "I’d actually be glad if he replayed bioshock on the channel",
        "The drawing was actually good",
        "Coryxkenshin PLEASE READ THIS!!!!!! \n\nCory should seriously make a series where he just goes back to all the games he never finished to complete them. ",
        "“Your not built different, your built the same.”\nY’all don’t know how hard I laughed!!! ",
        "I’m sick rn with the I think noro virus, I can’t stop puking but watching cory makes me actually kinda happy",
        "That Goku sketch was pretty good, though.",
        "0:53 finally we hear from honest Corey",
        "34:43 my favorite  edit since little nightmares",
        "god is a pen\ncory is a highlighter",
        "We still need for that chapter 5 episode on the of game",
        "Bro if the devs that made this made fnaf the games would be insane and the lore would be so much more crazier",
        "D.A I put this on for me and my brother and he said “wow Cory finally returned with the milk” ",
        "pov when cory said put it in",
        "It feels good coming back to this series with Cory ",
        "I'm mad that my goofy tail laughed soo long&hard️️ 23:32 Is what I live for",
        "42:08 Huh",
        "Havin a bad day but cory videos always cheer me up",
        "Cory is such an amazing role model. I can't wait for this series, the nostalgia is already kicking",
        "I got scared when they said adri bc that’s my name ",
        "0:38 lol",
        "The way Cory says thank you after sneezing cause he just KNOWS I'm saying bless you",
        "Can we all take a moment to say that the drawing actually looks very good? Like good job",
        "“your built the same” ",
        "That Goku drawing actually wasn’t that bad",
        "The consistency and quality that Cory has been putting out towards us has been incredible,amazing and every word that describes over the top and we appreciate all of it and the time you put into the world Cory ️️️",
        "Finally a game character named after me. It's abt time audrey came back into style",
        "What was with that voice crack in the beginning",
        "Why did you hurt cut little bendy",
        "Goku aint that bad just keep trying",
        "what happend to the wellcommeeeee",
        "That goku was rlly good wtf ",
        "Understand(understand)*Stands* ",
        "That face  14:44",
        "That janitor’s voice is METAL AF!!",
        "Never thought that Cory would play bendy again. He is the reason why every game seems fun",
        "By the way my name is CJ",
        "He can draw better than me but he is my top 5 fav youtubers",
        "everytime cory says the iconic \"yes sir\" i think of \"pullin a number one on a chester\"",
        "i love the drawing",
        "the style of this game is amazing, really enjoy how the intent details went from realistic to the classic bendy ink themed map.",
        "The camera at 4:14 : YOU KNOW WHAT?! THIS SO TRASH IMA JUST FALL OFF AND DIE",
        "E",
        "This game really plays like Bioshock2 tho instead of Ryan being dead it's Drew and instead of Lamb it's the old man rising up .",
        "The bendy world, there is a cycle and it’s you can’t stop it but you can reset everything but you remember everything, as well as the people in the bendy world.",
        "I've been laughing so hard at the part where camera fell",
        "W",
        "Kid Bendy has my heart.Hes so cute and adorable",
        "Also don't forget about the camera it falls probably because it's in laughter why? Because he said his drawing is trash",
        "My comfort YouTuber is back with bendy LESSSSGOO",
        "Finally this game came out great video cory!!",
        "Bro are we not gonna talk about the goofy song",
        "Corys humor never fails to make me laugh. We love u cory       And keep being a legend",
        "If I can make a suggestion it would be for you to play Shadow Fight 2 or Stick it To The Stickman or something",
        "Honestly, I thought Cory was drawing Gohan",
        "ngl i forgot about bendy",
        "Never draw again",
        "2:32 I think it was your birthday cory",
        "I know not many people like side quests, but i LOVE that you're doing them. Side quests let's us learn more of the world we are walking on, explore different sites, experience new things through the characters we play, see their interactions with other characters and watch as they change and grow through them. It feels SO MUCH richer and we actually get to grow EVEN MORE attached to each character as we play through the game. Absolutely LOVING it. Can't wait to see what happens next. ^^",
        "I wanna see Cory reaction when he watch kandyland because it’s like fnaf",
        "am I the only one who saw ghost faces face in the reflection of the light in the hand in the thumb nail",
        "Bruh i thought my screen froze at 23:35 ",
        "Cory hopefully you can do spooky scary Sunday",
        "18:10 I mean that’s how we say that word in the UK",
        "Cory never fails to disappoint us",
        "Cory : \"im built different\"\n\nAlso Cory at 5:35 : gets jumpscared by an inanimate Bendy",
        "is it just me or is cory sneezing more often?",
        "I think our best pal is Boris maybe this takes place after chapter five and he remembers you doing all this ink stuff and is helping you by notes",
        "THE PART WHEN HE FROZE ",
        "0:17  yo is your wrist ok? it looks injured",
        "Good to know I'm not the only one who thought bendy and the ink machine was like bioshock",
        "How cory be drawing better than me",
        "Love that Cory knows that a mirror in a video game 9 times out of 10 is just a flex",
        "im here",
        "LMAOO AT 23:34 TS GOT ME DYINGG",
        "fire vid",
        "4:13 my favourite bit of the video",
        "Wait im confused what happened to the other bendy game doesnt it continue in that storyline",
        "Wait wait, let me finish chapter 5 before I watch this ",
        "10:14 ",
        "So glad to see you active again Cory! Can’t wait to see more horror games",
        "This comment section kinda cringe yall need to be more hype",
        "6:10 Bro ",
        "I guess it",
        "You don’t remember him",
        "it has become my routine to bless cory whenever he sneezes now",
        "4:58 \"This thunder is thundering\" \nWise words by the shogun",
        "17:49",
        "Y",
        "Was I the only one that saw Boris",
        "I remember watching al of the old episodes of him playing this and never finishing it",
        "🫶🧌🧌🧌🧌🧌🧌🧌🧌🧌🧌",
        "Cory gon cheer me up ",
        "Cory: “bendy start coming around the corner”. ",
        "BENDY CAME BACK?! thanks Cory for the info ",
        "Let’s all appreciate him playing this master piece after so many years ",
        "i love how he puts his sneezes in there to see if we actually say bless you",
        "Cory's humor is perfect for this game ngl.",
        "This man Cory said he built different and this is what you doing at part 00:32 4:11",
        "36:32 the mink mink never gets old",
        "I just came from his college orientation video and realised this man has done the impossible with this YouTube channel ",
        "corpse's voice 1 to 10 cory",
        "35:37 that's what she said...LOL",
        "Cory has grown from getting 10k likes in a hour to 100k",
        "Nice roof ",
        "the way cory just paused the frame and i literally started choking on my drink was funny lol",
        "bllre",
        "Ay yo cory I got the new mirch today it's mad comfy",
        "cory we love you and if your aunt was here right now she would be so proud to see all of this and how much you have accomplished we are always here for you",
        "cory im a life long fan, ive watched every video the moment they release so im telling you now youtube trying to shadow ban you, i didnt get any notification of either bendy videos but i got the god of war notifications",
        "Cory always makes my day 10x better",
        "Bro, Cory always has a point. i hate stealth games that MAKES you hide, if you get caught, it's game over. And metal gear solid 5:The Phantom Pain, and every other metal gear solid game is an PERFECT example of this!",
        "this is one of those times i wish that wasn’t my name ",
        "Not playing Bendy And The Ink Machine chapter 5 before playing the next game is quite a questionable decision, but hey, what's done is done. I'm just ecstatic we were blessed with this incredible upload by the man himself",
        "40:04 Man got sent back to the Shadow Realm",
        "Did you see how the bendy character jumped out at him  what a jump-scare 🫣!!",
        "In New York I Milly walk ",
        "You gotta appreciate, we gotta value cory’s efforts and work. My man’s eyes are red for working hard on those videos. I love you cory. Greetings from mexico ",
        "cory needs to do a series of drawing man... dude can make anything entertaining.",
        "This is the hardest I've laughed in a while. This game takes the stick fight mayhem to an 11 and I love it.",
        "WHY WAS HE STILL FROZEN FROM 23:35 to 23:53 !!!!!",
        "1973 was when his mom was born",
        "I feel Cory when he messes up with his grammar pronunciations ",
        "Hey Cory can I have that goku drawing? Don’t even sign it or nothing. I jus want a random drawing if goku in my room. I don’t even watch dragon ball. Idk i thought that would be funny",
        "Wilson be sounding like Starscream from Transformers Prime",
        "12:01",
        "Cory definitely made this observation about these ink people\nBeing the workers before— just saying, Cory. You been knew!!!!",
        "1973 is when the goat of martial arts himself sadly passed. Role model, legend…..Bruce Lee",
        "He couldn't be more entertaining, like really.",
        "23:34 I almost pissed myself laughing  that acting hit at the PERFECT moment, oh my god",
        "I laughed so hard when he froze for like 10 seconds for that little bit",
        "4:11 I was saying that shii hard  until Cory said that shit trash",
        "L brought the shirt",
        "Cory is like that fun uncle I never got to have (rip uncle Marcus) I feel we could relate a lot and he always brings me joy.",
        "CORY PLAY DOORS!",
        "0:39 LOL",
        "5:03 why that guy kinda look like Dr. Phil",
        "notice every game he plays he manages to turn it into a #1 on trending game play...he really is the goat",
        "42:30 I thought he had mickey mouse voice",
        "Audrey kinda looks like the mom from Stress Level Zero's Duck Season",
        "4:53 the thunder is thundering",
        "Need Cory's new video rn fr2",
        "\"This thunder is thundering\" had me dying. Keep up the good work, lookin forward to that double upload.",
        "the intro jumpscared me",
        "you are the bestttttttt!!!!!!!!!!!!!!!!",
        "Best intro ever",
        "MY NAME IS AUDREY SO WHEN WILSON KEPT SAYING MY NAME I WAS SO FREAKED OUT",
        "Hi",
        "XD the beginning got me HARD ",
        "Ngl that drawling is tuff should’ve kept going",
        "AWEEE BENDY WAS SO CUTEEEE",
        "You will always be built different but thank you for having respect for animators creators like you and most importantly artists",
        "Where is resident evil I'm waiting Cory devante",
        "Bro CORY YOURE A CHRISTIAN AND FROM MICHIGAN?!? Bro let’s link up. I live around petoskey!",
        "3:45 is giving me sneak theft vibes with the music",
        "I can't believe it batdr actually came out\nAND CORY PLAYED IT!!",
        "Cory got me cry laughing at 0:20-1:00 I had to come back to see it again. Can't believe I'm the only 1.",
        "Watching Cory while eating is the best",
        "wait... if wilson was the dude who killed bendy, does that mean you were wilson in bendy and the ink machine?",
        "0:20 Bro got that lightskin stare ",
        "Day 986 of asking to play Kindergarden 2",
        "i watched this 17 times again trying to see what happen",
        "props to the voice actor for audrey! she sounds incredible!!!",
        "Dog draw 's better than me tying to draw my life",
        "Cory the best youtuber",
        "Bro when u banished that searcher i thought of beerus's hakai",
        "The ink demon pause  23:24",
        "so i think in the first bendy game, you were playing as that creepy guy wilson but hew was younger and not as insane. and then a couple years later the profits keep going on and she goes donw and finds wilson that went insane when he defeated bendy and saw all the fricked up stuff. and now your playing as here. this is my theory.",
        "Cory",
        "Cory always be making games funny, entertaining and exciting to watch.",
        "Seeing this is bringing back lots of memories I’m going to cry thank you cory",
        "What happened to  Minecraft",
        "Cory where’s chapter 5 of the previous bendy game at",
        "bro the intro was hard asf. \"you know want rhymes wit coryxkenshin?\"",
        "Who else wants to see him finish sifu",
        "Thanks Cory!",
        "Lol, still waiting on chapter 5 brother! I see what you're doing....",
        "Bro's camera folded itself",
        "You do not know how greatful I am to hear Cory say his appreciations to animators and artists. Makes me feel so special.",
        "13:00 had me dyin",
        "Maybe the story is ok...I also like some of the characters.\n\nBut as a videogame I find it very mediocre.\n\n\n\nI finished the first one, but I couldn't even finish this one.",
        "26:06 the moment when he realizes he needed to turn around \n\n\nMe in that part: backs away and turns volume down ",
        "cory, where's at dead of night or wtv it's called",
        "Wow 1:50 was so funny",
        "I actually like the drawing",
        "3:35 OMG- I THOUGHT CORY DID THAT. I WAS LIKE DAMNNNNN. Cory a better artist than me ",
        "I think the worst part about the combat other then the fact you can't block is the fact that they don't budge after hitting them so your stuck getting hit while your hitting them smh.",
        "21:02 cory dirty minded puts mouse in a spot that’s sud",
        "no you made bendy CRY",
        "Oh five night at freddys",
        "Cory puts everything in his power to make videos. I'm proud and hope you are doing good.",
        "4:21 It wasn’t a bad drawing.",
        "Or Naruto ulitamte ninja storm",
        "That's aint goku that ukog",
        "this video brought back so much nostalgia. Especially watching Cory this time of year just brings me back to being in middle school and watching him after school without worrying about anything besides homework. thank you for always being my escape Cory!!",
        "I'm sorry but the beginning got me dying' you didn't beat chapter five, your not built different, your built [he same",
        "The fact that he says thank you after he sneezes is just so much feeling bro..",
        "Comment below your favorite part and put a timeline\n\n\nComment",
        "That’s a pip",
        "I feel bad for kid bendy because banish hurt him on accident",
        "CoryxKenshin = late on spooky scary Sundays...",
        "24:37 has to be a favorite in this video.",
        "Bro vented so that's kinda sus",
        "bro I love the gameplay cory bouta hit 15 mil!! If yall agree he should make a new cooking with kenshin",
        "Thank you for being a YouTuber I don’t know what we would do without you",
        "“sheeeeesss AGH!“",
        "Cory is now doing drawing classes,and cory i love your videos so muchand my cusen alos waches your videos everyday",
        "Bro, I knew people thought it felt like bioshock, a lot of it feels like it",
        "I love your video's",
        "take your happy pills !!",
        "Bro draws goku better than me",
        "9:49 look at all these chickens ",
        "Bro is gonna be so confused about the lore since he never played chapter 5 ",
        "cory yet to play chapter 5 of the first game lmaooo",
        "30:32 why he sound like a robot",
        "Love watching your playthroughs and as someone who kinda draws anime alot i adored watching you draw goku such a lighthearted segment before the terror. Loved your goku and love your content im literally watching you play as I work on a drawing. The jump scares dont help though",
        "Bro I hate that I know when horror games show you the running mechanic that means something is coming",
        "Cory stay making my day better",
        "44 mins damn! lmao\n\n“you wanna be slapped” love that ",
        "I’m so glad Cory’s playing this. I never thought I’d see another one of these!!",
        "Cort: Sneezes \nMe: .Utter silence\nCory: Thank ypu.\nCory: Sneezes",
        "WHAT KIND OF VOICE CRACK WAS THAT 1:03",
        "When cory froze I was laughing",
        "Love u Cory thank u for making my day hope thanksgiving goes good for u",
        "June 18, 1973 is your birthday",
        "I know this is off topic but   Cory love your videos, have you given any thought to doing anymore of your cooking with Kenshin videos?",
        "That little art wasn’t terrible! It was pretty decent! I was expecting something worst. ",
        "watching Cory after school with a bowl of cereal is such a vibe",
        "i have a very bad feeling about this game, Cory…  just like old times. I hated Horror Games, Horror Films, R-Rated films, and SVA Adult Cartoon Shows already. Joey Drew Studios is not in real life, I’m seriously scared at this game.",
        "cory why havent u been doing a spooky scary sunday video in a while? i really love them! can u do 1 soon?",
        "so excited for yhsi aa",
        "This nostalgic as hell, the items u needed to get for the machine, the ink machine sitting there, the cardboard cut out when you walked down the hallway, everything about it.",
        "I love your vids so cool I made sure to samurai slice that like button for you my legend",
        "Hey Cory I was curious to ask you this but I would find it very cool if you played bioshock again,it was my childhood after all even though it was very scary and violent but besides that I love your videos have a great day shogun.",
        "Watching Cory is gonna be a family tradition with my kids ",
        "I swear he had me for a minute when he was on a hair, but when he draw the body bro",
        "Cory really just randomly started drawing Goku  Thats why we love him",
        "1973-bruce Lee death year",
        "\"You're built the same\" "
    ],
    "comments_disabled": false
}