{"video_id": "D2aSSUjEd0A", "comments": ["There is nothing more intimidating than seeing how good jaiden’s content is already and then hearing “a new era of jaiden is coming”", "Jaiden’s evolved from a storytime animator that likes telling stories, to a gaming animator that likes games and it’s freaking incredible how far she’s come. Now, we’re getting a new era and whatever it’ll be, you know we’ll be here for it. Cheers, Jaiden!", "those animated eyes + \"a new era of jaiden is coming\" makes me think this might be a vtuber debut. It honestly wouldn't feel out of place. She's been transitioning to more video games-heavy content, and from listening to her pokemon platinum VOD I think she'd do really well!", "Guys, it's 8:46 am or so for Jaiden right now. Assuming she's even awake by now, she'll have to get tech stuff set up, and hopefully eat a decent breakfast, before getting this party started. I wouldn't expect the stream to start for another few hours, one more at the earliest.", "Those gorgeous-looking animated eyes at the end paired with \"A new era of Jaiden is coming\" has me really excited to see what's coming! Just take care not to burn yourself out! Your health (physical and mental) comes first!", "To answer the burning question on everyone's minds: We don't know when the stream is starting. Jaiden didn't specify a time in the video, nor on any of her social media. Keep in mind that this is her first time doing a subathon, so she may not know when stream is going to start herself. It's currently just past 9:00 am in her timezone, so it could start an hour from now, it could start 7 hours from now. It just depends on what all she has to set up and whatever else she needs to do  today before starting. We'll just have to keep watch.", "Prediction - Jaiden got all seven chaos emeralds", "It’s been 4 years of me watching Jaiden grow, maybe even 5! I gotta see where this is going! She has inspired me so much during all that time. I can’t wait!", "I’m scared for Jaiden’s sanity at this point..\nBUT GOSH DARN IT I CAN’T WAIT TO WATCH IT", "This is by far the best youtube community event out there so far, currently the timer being at 3 and a half days, AND IT CAN KEEP GOING UP BY DONATIONS, come on now, WEEKS OF CONTENT FOR IT TO KEEP GOING, COME ON NOW JAIDEN LETS GOOO", "We need people to archive this whole thing, it's gonna be amazing", "Nah I cant wait, you're really the most enjoyable animator ive ever watched and I really hope you and all others have fun jaiden!", "It’s time for us to keep Jaiden awake on the stream for an entire decade :)", "We've had some good times with Jaiden over the past couple of years, but now, those memories are relics of the past and it's time for a new Era of Jaiden.", "Gosh I remember when I started watching this channel years ago. It’s so crazy seeing one of my childhood favorites grow so much", "I'm terribly excited for this, and Jaiden being Jaiden will just make it way better!!", "I kind of miss her old life story videos, but people can change and pursue their interests! I will be happy to see her upload more gaming vids!", "\"A new era of Jaiden is coming\"\nShe's a show and we're simply getting a new season", "jaiden has truly become the gaming channel we all knew she could be.... it brings a teardrop to my eye", "Thinking on \"a new era\" I feel like we're already there. Rewatching the digimon video I noticed how much more animated (pun maybe intended?) you are. So much more outgoing and boisterous and expressive. I hope you can see how far you've come and be proud of it.", "Jaiden: Plans weeks of content\nTimer: Runs out immediately.", "since she prepared weeks of content, imagine if it just lasts a day", "GO JAIDEN!!! A NEW ERA! Your channel and community has grown so much \nWe love you!!! ", "I don't know why but I can't stop being drunk with these stories \nCheguei I give in, because I like this story, because it makes me happy every time I'm sad and it excites me so much that I admire the author of this wonderful animated story", "Jaiden is chaotic good like Markiplier - willing to hold the internet hostage for the good cause..", "\"a new era of jaiden is coming\" is an incredibly powerful sentence and reading that made me very excited!!", "I’m kinda worried what if you can’t stream as long as people make you to, I just want you to be okay, please be sand and eat, stay really hydrated, and do be afraid to ask for a break here and there", "oh MAN it has been such a treat watching you grow to this point - i was introduced to you through james and was one of the many who celebrated you finally hitting 10 million. Honestly can't wait, and please keep it up!", "Status update\n126 hours left at the moment, we're hitting day 3\nJaiden is resting while the chat is playing Pokemon Ruby in a very chaotic and overlevelled manner (bullying a little girl with an Azurill as we speak)", "'A new era of Jaiden is coming.'\nKnowing Jaiden's storytelling skills I feel like this will be much more than a subathon", "i honestly thought that what we already have is great, but holy crap, a new era is ahead of us?! Its such a suprise, and i hope it will be the best both for us and for you.", "Good to see classic animation YouTubers doing great stuff, cough odds1, cough cough", "This is going so well so far I’m absolutely loving the subathon!", "I love how Jaiden's channel is evolving. \nFrom being a storytime animated, to game reviews and summaries, to playing them live.\nHer channel, herself, and the viewers are all growing up and evolving with it. Its kind of amazing to watch happen-", "\"A New Era of Jaiden is Coming.\" That sentence made me smile. I cannot wait to see what Jaiden has in store for the future.", "Jaiden has grown a lot and I honestly kind of freaked out that the live stream could last for weeks. But when it’s over I’d like a animating lesson with her. She inspired me to make a channel although it’s kind of failing rn. All I have to say is GO JAIDEN!!", "Jaiden, it has been genuinely inspiring to see you grow as both a content creator and as a person, and I cannot wait to see what you do next.", "I’m pretty sure this will go on til’ christmas or even further. GL on the journey, jaiden!", "Jaiden really went from story time animator, to gaming animator, and it has been a fun transition to watch.\nReally hoping this subathon goes well for her, I can't wait to see what's planned.", "This either can go great or HORRIBLY WRONG, AND IM HERE FOR IT", "so excited for the terraria one!!! i’ve been super obsessed over it and will be glad to help you out on this chaotic journey, good luck jaiden!!!", "Imagine she starts the stream that she has been planning for weeks and it just ends in like the first day", "Be really funny if the viewers collaborated to not donate and end the stream immediately. Can’t wait for the marathon ", "I love this! I really like Jadein's content it makes me laugh and is good to watch after a tiring day the art is very SMOOTH and Idk how but it is really butefuill in my option (I can't spell I know)", "It's so crazy to have witnessed the jaiden animation story time era to her becoming a gaming youtuber that animates for her playthroughs. Not only that, but her content is still so goddamn cool. I'm excited", "This is just going to be amazing! I loved all of your old videos and you've just only gotten better. I love your content so much.", "I laughed so hard when she listed \"my parents\". Sounded like an awkward sleep-over !!!", "Imagine if somebody has enough storage to record all of this", "This is such a cool idea. I'll definitely be watching many hours of this", "i remember a few years ago when you just mainly did story time adn here you are now I first watched you're getting sick video and omg you're amazing keep up the good work can't wait to see what is to come! P.S see you today on stream!", "Jaiden has really come so far, I'm so glad one of my absolute favorite creators can have literally skyrocketed so far to be able to do something so amazing like this Subathon", "I can’t wait! Hope my timezone doesn’t mess this up for me, I’ll be there :)", "Jaiden AND RTgame? That's the kind of chaotic energy I'm looking forward to. That's gonna be a blast!", "YES MA’AM,IM PREPARING MY BOWL OF DORITOS AND MY COMFY BEAN SOFA THING FOR THIS. (I’m glad I’m having no classes for 4 days straight this weekend)", "I hope it goes very well for you Jaiden, you make amazing content, and if I had any money at all to offer I'd sub just to help.", "So excited to watch the live stream! :D", "Looking forward to it. Please have someone to tag you out when you need to take care of yourself. Your health is important ️", "seeing jaiden come so far makes me so happy and this is even better I cannot wait", "HERE WE FREAKIN GO LADS lovely to watch your favorite content creator go freakin insane during a sub-a-thon ive never participated in one so its a first", "This is probably gonna last forever counting how big her fanbase is.", "I'm going to clear my entire schedule, so I can crochet while watching this the whole day.", "I hope she notice’s how much more herself she is in recent videos than when she first started. She’s grown a lot and seems happier ", "Can't wait to see Jaiden playing Terraria with Chippy!", "Jaiden I hope you realize almost 3 and a half million people have now seen this and there’s still 2 days. You’re definitely not getting any sleep for a couple weeks since I feel the turnout will be massive", "i have a suggestion for when the chat controls the game when your sleeping, what if instead of everyone spamming random commands, you could  maybe make it so there is a poll every 10 or 20 sec to pick the next command, i think that way there would be a bit less chaos", "I’m ready to watch as Jaiden gets no sleep started Nov 17th ", "A livestream lasting for days sounds so intimidating", "I'm looking forward to it Jaiden ", "Nice, even though this is a short animation, this took a lot of time and dedication and I wish I could go to her streams but this next week I have my finals so wish you luck jaiden! Keep the good work.", "I am so hyped for this, I was annoyed after my boss pushed my vacation back (was suppose to have the week of Halloween off) but so far on my vacation scarlet and violet come out and there's going to be a subathon from one of my favorite youtubers, best week ever!", "this is going to be such a slay jaiden i cant wait!", "Imagine after all of that work and effort organizing this and when the stream starts no one donates to continue it.", "The year is 2088 and she's still streaming. This project was too much of a great success.", "Gosh to see jaiden be more confident ( atleast from what we're seeing and witnessing and that its not an act) and put herself out there and be a huge gamer brings joy to me and tears", "I’m so happy I found this YouTube content creator, easily top-tier. Normally I watch trash YouTube content and videos regarding music. Now all I need is Jaden to start doing Stardew valley and I’m all set for life", "Love the stream so far  ", "I’m so ready for it! Can’t wait to make it jaiden!!", "Oh my sweet, sweet Jaiden..you do realize that stream is never going to end right?", "This could easily be one of the most eventful subathons yet. The amount of connections Jaiden has is huge and right as the new pokemon games come out is super smart. This channel has just been exploding with content lately.", "We gotta see her playing terraria, the amount of frustration and pain that game has caused me makes me wanna see other people feel it!", "We all can’t wait we’re all so happy for you Jaiden", "I can see this going in a very bad way for Jaden and a fun way for us. Be careful what you wish for Jaden", "Oh boy let’s see how this goes! Hope people keep it up long enough I can catch it!", "This is amazing! I can’t wait to watch", "One of the most popular and best youtubers doing a subathon. Holy crap this is never going to end.  God help Jaiden's mental state and sleep schedule after this.", "This is going to be the biggest event anyone has ever seen in their lives. I will be there, Jaiden, I will be there.", "I remember when i started watching your videos i found from fredorator Saturday morning cartoons college struggle and I am so impressed with how youve come and grown. Jaiden we love to see you blossom and are excited for what you have in store.", "The eyes at the end are chef's kiss beautifully animated.", "I’ve never been so hyped for a stream in my life ", "Yup, it’s possibly gonna go for an entire year judging by how much people are donating ", "is it just me or is jaiden becoming a subathon channel?", "As someone that can and has missed entire subathons before, how much of this is going to end up ported somewhere as vods? Or is this going to be a \"if you miss it, it's gone forever\" type of deal?\n\nAm super excited for ya either way, and wish you all the best in your foolish quest to stream for entire weeks straight.", "Jaiden this subathon will go on for a whole month at best. Good luck I’ll tune in now and then. Wish you the best of everything", "Are you going to put your live streams in your videos list so that people who couldn't watch it live to be able to watch it later? I hope so.", "I CAN'T WAIT \nI hope you do not get tired of this stream :D", "finally more than one jaiden peice of content per year", "I love the controlled but chaotic vibe she has in this vid, like she's ready for anything. Excited and intrigued to see how long she can keep that energy lol", "This is absolutely insane, curious to see how it goes ", "This channel has been a big part of my childhood for years now so thanks jaiden and is this on twitch?", "Congrats! Your Jaiden has evolved into… The same Jaiden but now with a Subathon!"]}