{
    "video_id": "D2aSSUjEd0A",
    "comments": [
        "Wow, your channel sure has changed a lot.",
        "Can't wait for the stream!!\nAre you guys excited for it? It's gonna be a blast!",
        "Also prediction: jaiden beat pokemon scarlet/violet",
        "I like how she's still continuing the channel",
        "Why is there so much happening on the 17th?! I’m not joking, I have tons of stuff going on!!\n\nSounds fun though, might join the stream sometime.",
        "when a jaiden animation direct is better than a pokemon direct",
        "When does the stream start",
        "Stream is down",
        "It's crazy how much her channel has grown in the past 8 years! From someone drawing animations for another channel to animating her life to animating her gameplays and now a subathon? Its been an amazing journey watching how her channel has grown. Can't wait to see what this new era of Jaiden is gonna be!",
        "GUYS ALL OF THE STREAMS ARE GONE EXCEPT FOR DAY ONE. I HAVE THE LINKS BUT THE OTHER ONES DIDNT RECORD THE STREAM",
        "Thinking on \"a new era\" I feel like we're already there. Rewatching the digimon video I noticed how much more animated (pun maybe intended?) you are. So much more outgoing and boisterous and expressive. I hope you can see how far you've come and be proud of it.",
        "She´s gonna become a Vtuber I just know it...",
        "This channel has been a big part of my childhood for years now so thanks jaiden and is this on twitch?",
        "LET SEE WHAT GOSE ON NEXT WE’LL SEE YALL THERE AND STAY LEGENDARY",
        "Jaiden litterally just said :\n\"Pay to play games i choose with over a thousand people\".",
        "Bruh jaiden that was a bit unnecessary",
        "those animated eyes + \"a new era of jaiden is coming\" makes me think this might be a vtuber debut. It honestly wouldn't feel out of place. She's been transitioning to more video games-heavy content, and from listening to her pokemon platinum VOD I think she'd do really well!",
        "What timeeeeeeeeeeee????????!!!!!!!!!!!!!!!",
        "I wish you would stream on twitch. But I understand why you don't. I hope I can watch ur stream!",
        "You are going to be streaming for at least a month. Good luck anyways though.",
        "Cant wait never been part of a sabaton before. If anyone's reading this, the longest twitch livestream is still going on making this its 348th day of being live",
        "Где геометри Деш...\n(Where is geometry dash?!)",
        "Cool",
        "So much content recently, I'm honestly living it",
        "This is dope",
        "this is stupidly chaotic sounding...and i serve the Great Chaos so im in >:)",
        "tfw you are so excited that you're already online and ready by 7am",
        "Today’s the day. November 17",
        "Can you upload the vods to your channel?",
        "I was timed out in the live stream, is there a way you could tell me why so i don't do that in any future streams???? btw congrats on getting your Torchic back, I'm so sorry for what ever i said i didn't mean to say anything wrong I'm really sorry!!!!",
        "Am late",
        "No….",
        "We must have the stream go for 12 years  it will never end you've given us to much power",
        "It's november 17 and it's also 12 am\nwhere's dat livestream",
        "\"my parents\"",
        "Yea so um left right a b",
        "Just came from the stream it's so fast like chat calm down",
        "You should play Mario games",
        "XD",
        "When I saw the thumbnail, I was like \" Don't Tell Me She's A Satanist \" \nWhy was that the first thing I thought-",
        "Time to kill my wallet for that Terraria content.\nBut jokes aside, this'll be a great event, hope you'll do well.",
        "ITS TODAY",
        "The fact my baby brothers birthday is on Nov. 17th makes sense",
        "I've never been soo hype for a subathon",
        "POG I AM ON DA DATE",
        "oi, did u ever try a pokemon reborn nuzlocke? would make for quit the challange ^^",
        "PointCrow sub count: 1.3 million, lasted 24 days\nJaiden sub count: 11.7 million, i would love to see how long this lasts",
        "Imagine Jaiden just closing the stream before anyone was able to join saying that since the timer starts on 0 she has to close the stream \nI can already see it happening",
        "Status update\n126 hours left at the moment, we're hitting day 3\nJaiden is resting while the chat is playing Pokemon Ruby in a very chaotic and overlevelled manner (bullying a little girl with an Azurill as we speak)",
        "but does jaiden even need something like that?",
        "0:94 ok I don’t see none talkin bout those purple eyes at the end.",
        "This will prob end on after months",
        "Hmmmmm\nIt’s the 17th of November",
        "Your so beautiful I love the way you look ️",
        "can i join Ridley Rumble? <3",
        "Good video Jaiden is being herself like always she's always so happy I love her vibes everytime I watch her videos and maybe I will join",
        "Hows the song called?",
        "oh boy it's gonna be long.",
        "My guess is that this will go on 3 or 4 weeks? Maybe like 6, but idk man",
        "So I had a weird dream 2 nights ago and woke up and 5am randomly. Then my phone at 5:01am is like: hey Jaiden's streaming. I litetally caught the beginning of the subathon because of a weird dream.",
        "This is just going to be amazing! I loved all of your old videos and you've just only gotten better. I love your content so much.",
        "Excitement",
        "This is going so well so far I’m absolutely loving the subathon!",
        "i love how jaidens channel has rapidly being progressing more and more into a gaming channel",
        "I remember when u were a story time animator but now ur a gamer even better ",
        "\" a new era of Jaiden\" \n\nthis sent a chill down my spine",
        "You can watch with any style of animation, because you tell everything just perfectly. Make videos with which style you like best, they will come to us anyway.",
        "she is very funny, i love you jaiden",
        "Watch all her hard work and planning go to waste and it’s done in an hour",
        "I’m in the live rn",
        "For someone who has been watching Jaden ever since she started it just warms my heart to see how much she’s grown over the years\n\nHoly cow I got so many likes in just two days, also my name is kuenrab but you can call me Foxy",
        "Audio log #9 she as been steaming for a week now that's impressive",
        "This is going to be one heck of a collaboration with lots of creators! Can't wait to see how this goes!",
        "Bro if it’s Netflix I need to see an oddballs collab or smth",
        "I NOW SAW THIS",
        "I can't wait! This is gonna be fun. :D",
        "The question did she do it already? I have been waiting for so long",
        "Hey Jaiden, make a animation on ROBLOX DOORS, it’s a very good and famous game in 2022 :D",
        "Will the vods for the subathon be put up after you've ended? Missed the beginning of your subathon and wanted to catch up from the beginning but there is not past live streams section or vods :(\nIf not then will there be a compilation video?",
        "does this mean she'll be staying awake for days? I'm confused.",
        "Vtuber???",
        "Its starting today i guess",
        "It’s on my birthday. Thank you so much for making me feel important.",
        "Day 2 of asking Jaiden to play Minecraft",
        "What a glow up!",
        "yoooo",
        "Okay, but what time!?",
        "so proud of how far you’ve come jaden!!! can’t wait for the subathon",
        "Man",
        "I do NOT want to see a gravestone with \"RIP Jaiden. 1997-2022. Died of exhaustion after a 100-year-long livestream.\" on it.\nlet's hope she makes it out alive.",
        "Bruhi forg about live and me missed:(",
        "ITS NOV 17TH",
        "It's still going and I think 11 million has been raised?",
        "That explains why she didn’t stop",
        "you should play genshin! anyway looking forward to it :D",
        "I have watched jaiden for so long and just seeing how far she has come makes me so happy",
        "wut if we just dont stop subbing and adding time so she sleeps on stream and it just turns into a never ending blog",
        "I love her so much she’s so lovely lol",
        "Dude i saw minecraft and i'm in",
        "Jaiden you are an awesome YouTuber️",
        "I’m so ready for it! Can’t wait to make it jaiden!!",
        "TERRARIA :D",
        "WOO ITS HAPPENING SOON",
        "this'll be perfect to watch as i play the new pokemon game. Can't believe this is the first time I'll actually be present for a happening in a community I'm in. Just wish i could donate.",
        "Oh god the final shot with her eyes in darkness is definitely creepy what’s going on",
        "I'm hopeing that the streams will go on YouTube so if you missed a stream then you can watch it",
        "I know how this is gonna end out",
        "nah bro this is so fun thanks for this jaiden !",
        "This either can go great or HORRIBLY WRONG, AND IM HERE FOR IT",
        "IM SO EXITED AHHH",
        "waiting for it to happen ",
        "I want to see this so badly this is two days before my birthday!!!",
        "I never thought this will happen in a million years.",
        "YOU SHOULD LIVE STREAM WITH SAM O'NELLA  ACADEMY",
        "There isn't any commentary ",
        "play pokemon infinit fution",
        "Jaiden why are you not paying attention to me",
        "And it just HAPPENS to be happening right before Scarlet and Violet come out. I hope to see what you think of the new additions!",
        "now this. this is one of the greatest announcements I have ever heard. So many games listed, so many friends and what I care most about: her parents. I want to know more about the two people that brought us Jaiden. \nI am excited for this new era, let's make it even better than this one.",
        "Jaiden if you are reading this I'm really excited for this subathon today but I'm probably gonna miss it so if it is possible maybe sometime in the future do another subathon but not as big as this one",
        "Rn we’re at day 9 ",
        "Streaming era..",
        "Imagine this goes on for so long she runs out of ideas",
        "if you actually do stardew valley Im gonna explode with happiness",
        "You are so MID, lol",
        "WOOOOOOOOOOOOOOOOOOOOOOOOO",
        "I'm so excited!",
        "Update: jaiden just streamed for 24 hours, finished 9 mins ago, and is currently streaming again",
        "I saw that Hollow Knight Broken Vessel Fight, YOU CANT HIDE IT FROM MEEEEEEE!",
        "The eyes shown at the end were sort of Vtube like. I expect she's Vtubing.",
        "Pleaseeeee be an announcement about her making more music pleaseeeeeeeee",
        "Jaiden is now vtuber",
        "free mone glitch",
        "jaiden i've watched  you so long , i just wanna say i'm proud of you for coming this far in your journey.",
        "Will it be animated tho?",
        "`nov 17th 18:30 still no stream",
        "TODAYS THE DAY WHERE JAIDEN IS SLEEP DEPRIVED FOR WEEKS",
        "Oooooo this looks splendid I wonder what wacky zany YouTubers will be on this strem",
        "But… why? Is this a fundraiser?",
        "Hey hi",
        "I'm glad she's playing terraria; the game may be really popular but somehow, it's still underrated, it's just that good.",
        "is this stream gonna be on twitch or youtube?",
        "I see nothing but excitement here but does this not bug anyone? I've been a subscriber and fan of Jaiden for YEARS. But the whole \"pay $5 dollars for 20sec of content\" seems like cash grab Ive not seen charity mentioned at all..... like I could understand putting a big event behind a pay wall, but this seems excessive.... even the \"cheaper\" per second option of $15 for 60 seconds is still crazy..... like what?",
        "Jaiden animations season two",
        "SHES STILL LIVE ToT",
        "Your late",
        "Hold up Charlie slime circle is going to be there",
        "AAAAAAAH i cant wait anymore",
        "I know",
        "Woaahh I can't wait!!",
        "Another thing for you Jaiden, if you really enjoy the streaming concept and you don't manage to do all of your planned content (as I'm sure that there will be a lot!) then you might like twitch streaming! As you can also harness viewers outside of youtube plus bring your youtube subscribers as well (as long as you notify everyone) you can finish off those extra things that you put on your list and gain more popularity for your yt channel and simply have LOADS of fun! Can't wait to see your stream too, I'll make sure to be there :D <3 love you Jaiden",
        "Im happy she chose violet",
        "What time lol",
        "WAIT JAIDENS GONNA BE A VTUBER",
        "Prediction - Jaiden got all seven chaos emeralds",
        "THIS IS GANNA BE EPIC",
        "Imagine if the viewers don’t donate and it lasts for only 2 hours",
        "Please post the vods I've been to busy to spend my days with the sunbathing but I would love to watch all the chaos  when I get time",
        "TODAYS THE DAY!",
        "Jaiden slow down with all the content this month I’m gonna get a heart attack of joy",
        "It today",
        "We have to beat Ludwig's record",
        "yesh!",
        "Yeahhh",
        "At the end it’s like a movie “ a new era of jaiden is coming” I felt like I was in a movie",
        "I’m genuinely curious as to why she’s making a tournament dedicated to Ridley. Not that I have a problem with it because I really like this character in smash!!",
        "So that means you won't sleep until the timer runs out? With the games you showed you could stay awake for weeks",
        "imagine nobody donates so the live stream only becomes a 1 hr  and all the things shes prepared just splat",
        "It’s been so long since you have make a video and I have been waiting and waiting for you to do another one and it has been … i think 2 years or 2 months and my patients have come into handy so I thank you :) \nBtw I love your vids ",
        "This sounds epic!!! (Just please take care of yourself, though you’ve probably thought of that already)",
        "am i in time",
        "Are proceeds going to charity or something? If not this seems at first glance like the most weirdly hostile and abusive streaming platform I've ever seen.\n-Edit I've been informed that this sort of thing is common on Twitch and my take is pretty uncommon. I still think it's weird to do something like this and not have it be for a selfless cause.",
        "Someone needs to mod omori to be omari because its jaiden themed.",
        "someone's gonna donate like 3 hours worth when theirs like 10 seconds left.",
        "Me sees Jaiden!!! Yessss!!!\nSees Anthony Padilla Yessss!!\nSees RTGame!!!! Yesss!!!\nAND MORE YESSSSSS!!!",
        "Oh my god she NEVER DISAPPOINT",
        "Hey Jaiden. I work that day, the entire day. Would I be able to watch the video at any time?",
        "dear Jaiden i have watched ur content since around the beginning and rn im watching your live and ive always wanted to talk or tell you about this so that basically i remember in your hair video you said that no one can draw the swoopty tuffs that you draw in your hair however my bigest flex is that i can free hand on paper or online without tracing or practice so yea ive always wanted to tell you that so yea theres that and i hope you see this and this makes you happy bye jaiden -alix ",
        "Predicting That This Is A Rick Roll But Its Just Jaiden Animated Into It",
        "who thell are you",
        "This is such a crazy idea. You’re too popular, Jaiden! Your chat may never grant you the chance to sleep ever again!",
        "Are you done",
        "ITS POGGERS TIME :0000",
        "EYO VTUBER MODEL!!?! ",
        "Prediction:: she will be doing a 24 hour stream of Pokémon Scarlett and violet when it launches",
        "Everyone is waiting for the day Jaiden makes an anime",
        "bro i cant wait for slimecicle to play with Jaiden! Hypeeee",
        "november 17 - january 17",
        "Im excited and hoping she does pokemon emerald or ruby live",
        "todays the day",
        "Well, I'm looking at the whole thing and, being the sort of maths-obsessed nutjob I am, I crunched some numbers.\n24 hours is 1440 minutes is 86400 seconds.\n$5 earns an extra 20 seconds, so to earn a whole day requires a total donation amount of $21,600.",
        "I’m ready to watch as Jaiden gets no sleep started Nov 17th ",
        "YOO THIS LOOKS SO COOL IVE BEEN A FAN OF YOU SINCE 2018 IM SO PROUD YOU CAME THIS FAR ILY<33",
        "I'm gonna need alot of hot chocolate for this  good luck on the stream homie!",
        "TODAYS THE DAY MY CHILD HOOD EVOLVES",
        "Imagine it would have ended in the first hour (ofc it didn't happen but just imagine)",
        "Jaiden’s evolved from a storytime animator that likes telling stories, to a gaming animator that likes games and it’s freaking incredible how far she’s come. Now, we’re getting a new era and whatever it’ll be, you know we’ll be here for it. Cheers, Jaiden!",
        "Jaiden subathon: 00:2 secs long Jaiden: pure sadness",
        "I feel like this is a dangerous move. Be sure to have a practical way of limiting the time you stream. Something like the cost to keep going starts going up exponentially after a certain amount of hours.",
        "Oh yes hi jaiden",
        "Bro she def wouldnt have known that the subathon was gonna last more than 2 weeks",
        "Jaiden “animations” future prediction:\nSometime in the subathon she will show a Vtuber model and a little redesign\nThen in 2023 she will change her channel’s name to JAIDEN\nshe will become a gaming channel",
        "Your insane lol",
        "If we thought Ludwig’s sunbathing was a ton, imagine a months worth of planning to play games all meticulously planned to fit for however long she suspected for it to last. I am scared yet excited",
        "when does this start",
        "Sorry, I can’t go. I need to go somewhere else: The Bathroom. (This is a joke, and I might actually come to the thingy)",
        "Wut time does it start",
        "This’ll be the biggest Twitch landmark since Ludwig’s subathon, can’t wait to watch along",
        "Jaiden in YouTube too streaming",
        "A livestream to see how much money she can get",
        "Jaden animations are you playing fortnite",
        "Please make sure you are still keeping yourself healthy as long as this goes on. I'm excited!",
        "Can’t believe it’s already November 17th whooooooo!!””!",
        "Where is the livestream I can’t find it",
        "hi jaiden, I love ur videos, when is the subathon?",
        "TERRARIA? REALLY? GOD IM SO EXCITED.",
        "your absolutely killing it i cant wait for this stream!!",
        "I can’t talk in the live chat but I love your channel you’re my favorite YouTube channel I don’t know everyone or anyone will see it",
        "[Verse 1]\nI wanna be the very best\nLike no one ever was\nTo catch them is my real test",
        "Ive seen a few subathons, this one is probably gonna be the most eventful one of all, cant wait for it!",
        "I’ll bet Jaiden’s going to do a playthrough of a game of some kind. Perhaps some obscure Pokémon title no one talks about?",
        "I juste woke up and I am so happy to see that you are back! I am starting to watch so I can’t say much but thank u everyone for the nice comments! It’s a real pleasure to come back here with positive people",
        "Is that new era a VTuber?!?!?!?!?!",
        "Piccolo: you’ll die you know that. Jaiden : Ik but I’ll do it for the fans and the subs!",
        "Where stream",
        "jaiden has never terrified me this much in my life",
        "I can't wait",
        "Ah yes… I s I pose the new era of Jaiden is going well",
        "The fact that this is the fandom that reached a live stream goal in literal minutes once, this livestream could go on for years!",
        "what is a \"subothon\"?",
        "Soooooo excited",
        "\"ill probably not do it again\"\nsad, cuz it only stays for like 8 hours unless you record and reupload it",
        "And now it begins",
        "Jaiden I hope you realize almost 3 and a half million people have now seen this and there’s still 2 days. You’re definitely not getting any sleep for a couple weeks since I feel the turnout will be massive",
        "imagine that no one donates fast enough, and it ends instantly. but for real. This is an incredible and unique idea Jaiden, Kudos to you :)",
        "yo when are you starting",
        "I never thought jaiden would play omori tbh",
        "SHES GETTING ALL OF THE BIRDS",
        "We gotta see her playing terraria, the amount of frustration and pain that game has caused me makes me wanna see other people feel it!",
        "Song?",
        "jaiden has a face what the hell",
        "I love how YouTube tells me this, 6 days late, after it has already started yesterday….",
        "I’m so excited ",
        "we love u jaiden",
        "oh helllll yeah",
        "Can you please play  \nPokemon violet ",
        "Jaden is becoming a Vtuber. That's the \"New era\"",
        "And also is that a vtube eye??",
        "Everybody is going to start doing this and some people will be doing it for months XD",
        "Little did she know it was gonna take weeks",
        "My dumbass thinking this is gonna last a day",
        "Finally, the most anticipated livestream collaboration is coming.\nJaiden and her parents.",
        "I hope she plays gta",
        "she is giving us a location where to meet up so we can start a cult ritual",
        "I see this 3 days after broooo",
        "When she said weeks of content, I was concerned for her health but I’m sure she must’ve thought it through already. Will definitely drop by ",
        "ТЕРРАРИЯ",
        "'A new era of Jaiden is coming.'\nKnowing Jaiden's storytelling skills I feel like this will be much more than a subathon",
        "I've never been one for live streams, but I'm kinda excited.",
        "Nice scam live stream. Way to make all that money and troll chat for 50+ hrs straight.",
        "It’s great to see Jaiden's coming out of her shell a bit more, willing to do more things with other people and her viewers",
        "Today’s the day!!",
        "It said I’m on time out on your stream",
        "I can't wait to watch this tomorrow during school",
        "Imagine it will be 2\nyears\n\nDo you have food tho",
        "Its today!",
        "I have a fun game you should try, didn't see it on your channel so I thought I'd recommend it. SWTOR, or Star Wars the Old republic. It's available on steam and is free to play, you have 4 different stories for this you can start out on either the Republic or Empire side. I'd recommend for a fun start you either try Sith Warrior or Jedi Knight. You can also choose to be the good guy and save everyone or this complete badass who does whatever they want, and you can romance your companions along the way. It's super fun. XD",
        "Think she'll add some of her subathon content after it's done?",
        "Don't burn out Jaiden. Prepare yourself. I've heard \"new eras\" before and they have crushed people.",
        "Ayo jaidens parents coming",
        "One of my other channels which got deleted said if jaiden could play Mario oddysey and now she’s going to!\nYES",
        "Looking forward to it. Please have someone to tag you out when you need to take care of yourself. Your health is important ️",
        "when are you  starting?",
        "I'm so Hyped you've come such a long way, so happy for you Jaiden!  :)",
        "Thats great manter",
        "Jaiden: this is my biggest project yet…\nme:OMG SHE’S POSTING THE ANIME TO NETFLIX!!!\nJaiden: welcome, to the Jaiden animations subathon\nme: oh… oh……………What’s a subathon?",
        "* flashbacks to pointcrow's subathon *\nOH GOSH NOT AGAIN",
        "Ooo I’m very excited! I look forward to what’s coming.",
        "My predictions: Either it's a Netflix show, a webseries or she's gonna start doing animation streams\n\nEdit: Damn it it was a subathon",
        "I love this, but I'm wondering how Jaiden and her friends are going to stay awake for so long? Theyll definitely be up at least more than 48 hours, maybe more",
        "ITS NOVEMBER 17TH DO THE LIVESTRAM",
        "Shoulda been called the \"count-down calamity\"",
        "On day 13",
        "Sorry girl, we're never going to let you stop streaming ️",
        "Wat time",
        "when?? is it at 6 pm",
        "Jaiden joga Roblox",
        "Imagine people just make Jaden waste time by not donating anything\n.-.",
        "So exciting!! Can't wait to see everything you prepared!!",
        "Those eyes though man! Sick! Very excited!",
        "OK so when is it starting",
        "nintendo's next trailer be like",
        "I can't put to words the pure terror \"a new era of Jaiden is coming\" inspired me. I want to flee but there's no place to hide",
        "my guess for the new era of jaiden thing is maybe a dedicated gaming channel or switching over to mainly gaming and less animations? It does say a new era of jaiden, not a new era of jaiden animations. maybe she will even change the channel to just Jaiden instead of jaiden animations. No matter what she does I'm excited she can make anything funny.",
        "Русские фанаты джейден тихо плачат в сторонке",
        "trust me, a brazilian already made it, and this will NOT go well, but at least you got more cards on hand than him, so we'll see\nI just realized you made it start on my birthday lol (aka today)",
        "So far the subathon has been great",
        "I LOVE THE SUBATHON SERIES.",
        "Hey Jayden, how about the kids who want to watch but cant because of school? Maybe you should think about that too.",
        "no...those eyes...don't tell me she's becoming a Vtuber...",
        "I joined it and she turned on sub chat only",
        "Jaiden I hope I can get successful like you your one of my idols",
        "Jaiden\"ive prepared games just for this ecation\"\nMe\" she is ready for an anime fight ok\"",
        "Can i join?",
        "Can I join?",
        "what is the bg song used for this? Also I'LL BE THEREE!!",
        "It starts today booois (terraria is hype)",
        "I have now subbed to jaden animations",
        "Ok. It's the day.",
        "One thing I love about youtube is watching youtubers \"evolve\" throughout their career. Especially people like jaiden. Congrats on all you've overcome and here's to much more",
        "\"A new era of jaiden is coming\" \nLooking at those detailed and smooth eyes makes me know exactly what is coming",
        "this is so freaking awesome!!",
        "I think it will be 2023 before the stream ends",
        "The year is 2088 and she's still streaming. This project was too much of a great success.",
        "Sadly I hate joining big streams since its just an extended videos because you will never know what someone is trying to say because it will be swept away and you will never find it again",
        "I have a feeling that the new era of jaiden is going to turn her into a v tuber",
        "You just greatly underestimated chat, the longest subathon I saw lasted 3 months",
        "No hablo inglés pero se ve que estará genial uwu  saludos",
        "Bro I’m so hyped for this",
        "Greed.exe",
        "damnnnnnn",
        "Ah, so it's like Desert Bus for Hope, but for profit! :P\n\nGood luck, I hope it's a good money spinner for you, really enjoy your animations.",
        "what time",
        "i cant describe how much i love terraria",
        "Why was I expecting this?",
        "Jaiden has grown a lot and I honestly kind of freaked out that the live stream could last for weeks. But when it’s over I’d like a animating lesson with her. She inspired me to make a channel although it’s kind of failing rn. All I have to say is GO JAIDEN!!",
        "JAIDEN I LOVE THIS THING. I absolutely love looking back your videos and seeing how you have grown as a person and became better as an animator step by step. <3 Love your vids, thank you!",
        "jaiden has truly become the gaming channel we all knew she could be.... it brings a teardrop to my eye",
        "Crazy how over the course of a few years jaiden did a full pivot in to basically being a gaming creator",
        "This is gonna last forever, won't it?\nWell, I mean, this isn't Twitch, so I don't know how long this will be.\nProbably forever.",
        "That editing....... HOLY",
        "NAW MAN, HER PARENTS?????",
        "Bruh this means like 22 more speed runs !",
        "Just watched this today, the stream starts at 1 am and i have school tomorrow... ",
        "Bruh when does it start",
        "Oooo SUPER EXCITED FOR THIS  GOOD LUCK JAIDEN",
        "im definetly surprised. I came here only to wait 37mins rather than 5 weeks!",
        "I really will love to see jaiden play tomodachi life",
        "So she's gonna be a vtuber now?",
        "Jaiden animation i can join you",
        "Why is there two ands in the subathon on youtube disepriction i cant spell i know",
        "Is this going to be a charity thing or are you just doing a fun thing where you get big money?",
        "Did she get a v-tuber? If so, i hope the animation part of the channels name Will still be working",
        "She is Animations\nShe is Jaiden\nShe is Jaiden Animations\nShe IS",
        "I'm gonna re-sub when ur done with live cuz I don't like lives on my YouTube subscription page ️",
        "Jaiden, this sounds absolutely incredible.  I love watching your videos, and I think that this subathon will be so fun for you, your friends and your fans. I hope it goes wonderfully and I would love to watch it. ",
        "POV your watching this while she’s streaming",
        "its nice to see videos like this love your vids",
        "CALL @Tommyinnit TO JOIN",
        "Genuinely so hype for this, I’m still young but I aspire to be as good an animator as you (and many others!) have. You’ve inspired me to put my work out on different places to be one day among the leagues of the rest. CANT WAIT FOR THE STREAM!!!!",
        "What is the new era?!",
        "SPOON 3 (SPLATOON 3)",
        "who else was binge watching Jaiden's vid's to go to come page and see this!! YAY",
        "It's one 48 and jaden has not started",
        "From the look of those eyes in the end teaser message, one can speculate she's gonna be experimenting with a V-Tuber persona. Very interesting.",
        "WHAT TIME IS IT",
        "Whatever it is, this is such a wonderful thing to come home to after having my appendix removed",
        "What if for every subscriber you get during the stream you add a second",
        "Not the cross over I wanted with v tubers they are werid bruh and gay like owl house but this is just my opinion",
        "LETS GO TERRARIA",
        "the stream is still going",
        "Are kidding me?????! You gotta be joking! This is awesome and it’s gonna be absolutely AMAZING!! I love to see how your channel grow, and it’s great to see the different things you do! I really hope your mental health doesn’t get to bad, and that you’re able to hold on as good as you can️",
        "I love this channel couldn’t wait",
        "Uhh are you going to be okay?\nThis seems like this can burn you out.\n\nIf you need to stop or take a break, please do.",
        "I have some like general curiosity questions about the stream (like if she sleeping, does the timer pause for that, ect.) does anyone know if there is a place i can find that info?",
        "I wish Ludwig would be at the subathon",
        "Will this stream be archived or dose it go live then it disappears?",
        "Ooh paying for content, that’s something new :D",
        "Jaiden: “Let’s see how long you can keep me awake”\n\n Fans: you underestimate our power.",
        "does anyone know when it starts",
        "cant wait for terraria",
        "Twitch or YouTube?",
        "Congrats! Your Jaiden has evolved into… The same Jaiden but now with a Subathon!",
        "JAIDEN VTUBER INCOMING!!!!!",
        "I was watching the stream and I finally got to experience the Omori game and it was really awesome. Thank you Jaiden!",
        "Whens ari and your birthday",
        "What is this music? Very nice",
        "It is today...",
        "Bro vs bro with Ludwig ",
        "This is going to be REAL surprising! I can't wait! ",
        "It’s toDAY",
        "im so obsessed with this music\nwhat is this music name i need it",
        "Lol in her live chat, I got her to say can Ari  play call of duty by donating my life savings one dollar and I did it twice  percent worth it",
        "This is going to be absolutely amazing",
        "Im happy that there is an announcement from my favourite youtuber i hope it’s something good but i guess there is no bad(update definitely worth the wait im 100%joining into the streams)",
        "I honestly think that jaidens old content is better but still its good today",
        "So far 5 days in and the Omari vid kinda slapped ",
        "Is she doing it 24 7?",
        "I know you probably won’t see this but it would be amazing if you could make the live stream into a video so I can re live the awesome experience and still watch it if I can’t make it",
        "There’s so many games shown! You got this jaiden!!",
        "ive been watching her for 4 years and shes come so far",
        "new era of jaiden with these eyes, seems likea brand new animation style",
        "LETS GOOOOOOOOOO",
        "Hi jaiden can you play this \"pokemon\" similar game called monster racer you catch monster to race it, I think you would love it",
        "Mum I'm on YouTube",
        "I love how \"my parents\" is just casually thrown in with your friends.  That's so heccin CUTE, Jaiden.  And very wholesome.",
        "wow",
        "*1 month stream*",
        "Is this going to a charity?",
        "IT’S #1 ON TRENDING GUYS KEEP IT HERE MORE PEOPLE NEED TO SEE THIS MASTERPIECE also can we note how it’s so smooth? My eyes are BLESSED",
        "Soo question when and how does the subathon end. At The end of every day are you gonna say say hey guys should we end it??..?",
        "to day",
        "Jaiden, it’s been a minute-",
        "i have a suggestion for when the chat controls the game when your sleeping, what if instead of everyone spamming random commands, you could  maybe make it so there is a poll every 10 or 20 sec to pick the next command, i think that way there would be a bit less chaos",
        "I hope she rests at least",
        "name of music pls",
        "Ooh in really curious what a collab between jaiden and tierzoo will look like",
        "There is nothing more intimidating than seeing how good jaiden’s content is already and then hearing “a new era of jaiden is coming”",
        "",
        "It is tomorrow! i’m really looking forward to it!",
        "predictions: she started a war against other animators and needs to assemble a team to defend her, the last animator wins youtube",
        "Bro I audibly gasped.. So excited!",
        "Jaden i just wanted to say a new persone has the World record of coiking mama play whit friends!",
        "*jaiden*ok welcome to my stream which could possibly go for a week \n*viewers*DONATE DONATE DONATE DONATE DONATE\nalso jaiden processing all the donations she is getting \n*also viewers*My wallet is empty ",
        "It just ended  ",
        "30 to the 17th",
        "ITS TODAY!!!!!!!!",
        "did it end already?",
        "Who else gets very happy when Jaiden uploads a new video?",
        "IT'S TODAAAAYYYY",
        "what is this AMAZING SONG??great music taste by far,",
        "Hey Jaden I mean wondering but don't worry do you know Pokemon shield and sword I have the game and if you want to join me don't worry I'm not a new",
        "Yayy i can't see the show cuz im in europe",
        "Woah you're getting chuggaconroy! I remember watching his let's plays as a kid!",
        "WHERE IS THE SUBATHON????",
        "Watching how Jaiden started from 1000 subscribers gang to now is outstanding, I always knew you could do it! Thanks so much Jaiden for everything single stream/video you have made, I'm so glad to see how much you've come and I'm so excited to see what will come next! ",
        "Jaiden has really been doing Pokémon",
        "If Jaiden going almost 27 days she can bet a world record",
        "Its so cool to see your channel grow throughout the years and im really excited for what your planning to do next!!",
        "Jaiden really went from story time animator, to gaming animator, and it has been a fun transition to watch.\nReally hoping this subathon goes well for her, I can't wait to see what's planned.",
        "Dam, those anime eyes.",
        "Oh, boy, this is gonna be bigger than TON 618, and that things it the largest known object of mass in the known universe",
        "I'm pretty sure that the \"New Era\" for Jaiden might be more color and better animation in her videos.",
        "A movie time",
        "That's so....COOL!! I LOVE IT",
        "All those people trying to insist that the end of this wasn't a teaser for her VTuber model looking real silly right now, lol",
        "pls play kirb",
        "Im ready",
        "GOT IT JAIDEN  I CANT DONATE THOUGH IM BROKE",
        "Oh boy this is gonna be AMAZING",
        "THIS SOUNDS EPIC AS FUUUUUUUU-  OMG I HOPE THIS GOES FOR WEEKS",
        "Jaiden I feel like the subathon will go on forever",
        "OH MY GOD THE EDITING AND ANIMATION IN THIS VIDEO IS CRAZY! So excited for the subathon! Storytimes, gaming, or random rants, you gotta love this channel. Time for unlimited content",
        "this is going to be such a slay jaiden i cant wait!",
        "It’s crazy seeing how much you and your channel have changed over the years. I still remember watching your videos before I had an account lol. But it is great to see you doing so well! Excited for the Subathon!",
        "WIAT IT WAS NIVEMBER 17TH??? I JUST SAW THUS NOOO THAT WAS MY BIRTHDAY I WISH I WAS THEREEE",
        "Omg so excited!  I love your gaming videos Jayden!",
        "wait is she ever going to sleep or stop stream? how does this work",
        "it's been 4 days since it started and it's still going",
        "So happy to see how far you have come Jaiden!  Hope you have a blast!!",
        "the subathon is today! omg i cant wait , also say in the replies of this comment what are u the most hyped for out of the things that were shown (mario oddysey , terraria , nuzlockes , mario kart , pkmn gen 9)",
        "It’s happening rn!!!!!!!",
        "0:05 ngl cooking mama jaiden looks ADORABLE",
        "I hope the animations won't be performed live. That would be a terrible strain on Jaiden's wrist.",
        "The idea that this might be simultaneously a no-sleep challenge scares me, but it's definitely an awesome way for Jaiden to show of her gamut of talents!\n\nEdit: Made two typos. Eww... >w<",
        "Just subscribed! Waiting for the live stream!!! Starting in 14 mins!!!!!!!!!!!!!",
        "Hyped for this!",
        "Honestly it.was.c  a  h o a s",
        "I do miss you doing animations but i'm glad you're doing what you want to now. As long as you enjoy it I'll support you. Hope it goes well!",
        "What time dose it start?",
        "Both you and James have Gone Up for the best :D",
        "I'm so excited for this, Jaiden never ceases to amaze us!",
        "I'm as excited as everyone else, but it brings me great joy to see RT among the guests listed.",
        "She's gonna personally come to every single one of our houses, all 11.5 million of us, and give us pokemon plushies",
        "In a year of chaos and despair, Jaiden has single handedly made the year the best one in a while",
        "NOW?",
        "I JUST SAW THIS AND ITS NOV 17 TODAY CAN’T WAIT!!!!",
        "Used to watch jaiden in 2020, one of the worst years of my life. She cheered me up and made my illustrating much better because thats what ive been wanting to do since i was 7. Also she makes me so confident, she proves that you can become the person you wanted to be, even if you had the worst years of your life.",
        "OMG I’m so excited! When is this dream?",
        "It’s the 17th jaiden",
        "Gosh I remember when I started watching this channel years ago. It’s so crazy seeing one of my childhood favorites grow so much",
        "The eyes at the end are chef's kiss beautifully animated.",
        "No doubt this will be the longest video on YouTube ever",
        "I can speak for everyone when i say we are proud of you jaiden",
        "imagine all of this is prepared and then no one donates and it ends, not that thats a good thing it'd just be sad",
        "is any one sees this and the stream is still going after you see this if you have a problem of not being able to use the subscriber only chat even after you have been subscribed for over 20 minutes if you unsubscribe and then re sub and wait 20 minutes i did it three times and the third let me comment after the 20 minutes",
        "if you will get problems with spoking my nickname in the stream ''ulvespydet'' that is a norwegian name, you can just say my name on english: you-lve-spy-de, or just you-lve,",
        "hol up, did that just say TIERZOO?",
        "I'm literally so hyped!!! \"A new era of Jaiden is coming\"!?? Chills I got literal chills. It's great to see how far you've come and I can't wait to see how far you'll reach!!!",
        "Jaiden this subathon will go on for a whole month at best. Good luck I’ll tune in now and then. Wish you the best of everything",
        "It's today!!",
        "Bro I'm so hyped for this",
        "That’s today",
        "The growth of this channel over the years has been something to behold",
        "Not me going to this video during the stream",
        "What are the donations going towards?",
        "Hi Jaiden just Ik that I don’t think u know but u are in a called Friday night funkin",
        "I’d think It would be hilarious for all the people in chat to wait til the last second then crash the stream with like 100 million subs",
        "As a Ridley main in smash ultimate I can’t wait to go 0-2 in that tourney",
        "Hoooly!! Paterrzz is going to be there! Love him",
        "She’s the goddess of content we don’t deserve",
        "Nice.",
        "Poor girl's been streaming for eleven days now...",
        "WELL IT STARTED IF YOUR SEEING THIS",
        "I love this! I really like Jadein's content it makes me laugh and is good to watch after a tiring day the art is very SMOOTH and Idk how but it is really butefuill in my option (I can't spell I know)",
        "This is going to be amazing, I can't wait!!!",
        "Will this be on twitch or YouTube?",
        "I hope it goes very well for you Jaiden, you make amazing content, and if I had any money at all to offer I'd sub just to help.",
        "This is honestly great and I really hope I can join :>",
        "So it got about four live streams."
    ],
    "comments_disabled": false
}