{
    "video_id": "DGCSk7aCI-Y",
    "comments": [
        "",
        "Watch out for Buddy with the Glasses in the back with the Red coat. He  Blacboy Bezzle.",
        "Love hearing real street shit a nigga can relate too CRIP",
        "0:72  Lets just take a minute to appreciate how much time and work he put into these videos?\nIt's unbelievable, and I think they deserve a lot more than that",
        "This shit is hard as hell. Finesse is unstoppable. Big facts. ️ ",
        "Big homie one of my fav rappers",
        "🇮🇮🇮 🇳",
        " 🇷🇷🇷 ",
        "Mannnnne I was mad ASF 3 mins ago til heard finesse on da track again",
        "  🇪",
        "🇨🇨🇨  ",
        "This shit ",
        "That was Raw ah ijs",
        "#Finesse2Tymes got home has since gone straight in every verse   ",
        "Finesse2tymes hasn’t miss on no feature or song since he got home ️",
        "Them boys ",
        " Go Krazy ️",
        "G ate this mug bruh didn't no features !!",
        " 🇨🇨🇨 ",
        "They should do a whole album together!! ",
        " 🇹🇹🇹",
        " big homiie up next",
        " 🇷",
        "Naw this hard fasho ",
        "Well this is getting added to the playlist today.. and the slowed and reverb version of it as well..",
        "Damn finesse been having real motion numbers can't lie fosho ",
        "They gave it ️️️",
        "So hard ",
        "🇪🇪  ",
        "🇰🇰🇰 ",
        "G go so hard on this beat",
        "Finesse just different man. He too hard.",
        "Certified Classic.",
        "Shi too tuff ",
        " 🇹🇹",
        "🇪🇪",
        "I knew this was going to hit hard!! ",
        "This song",
        "This goes in far beyond run it up  good song herre",
        "This collab fire right here fashooo ",
        "Want no smoke made his ass cry",
        "Those Memph!s boys com!ng out \nw!th that \n Keep\n dropp!ng that ",
        "Turn Dis Shit Up ",
        "finesse really leveling up, we here for the come up lets go! these two got some great chemistry fr!",
        "This junt bump ",
        "FINESSE OF EM ",
        "Bruh snapped on this one.",
        "That hoodie makes Big Homie G look like a Azul bottlebut this collab tho",
        "TITAN UP ",
        "Finess back pack strikes again",
        "🇪 ",
        "🇰🇰 ",
        "This shit gas ",
        "BEEN WAITIN FOR DIS ONE ",
        "Never seen somebody come home and work this hard. This what Bobby smurda should have done.",
        " 🇮",
        "🇹🇹🇹  ",
        "\"Bumped down on buddy,He ain't want smoke,Made his ass Cry\" ",
        " 🇨🇨",
        "This shit hard ",
        "RESPECT FROM JERZ 🫡 THIS SHIT HARD!!!!!",
        "They baller blockin right quick lmao appreciate the love I’m from New Orleans",
        "Another hit fusho ",
        " 🇱🇱",
        "Both of them together ",
        "Soon as finesse hit that running shit dance it's fire ️",
        "Dracos voice acting for grandad is beautiful \nReminds me of my grandad when i was still not born",
        "Got yourself one ",
        "They both kilt that beat ",
        "  🇪🇪",
        "My boi Neva disappoint me…keep popping yo shit. Stay Gettin off",
        "Really great video. Whoever wrote the script is a genius",
        " Love from Baltimore Maryland ",
        "This joint dope",
        "this go hard AF!",
        "Dat Brotha Finesse got a hustlin energy that's good to see",
        "Who else waits until the red line stops at the of each of his songs because they are so unique and he's so talented",
        "  🇱🇱",
        "explain.\n\nKendrick goes so hard on this, never disappointed. he is not like other rappers who are going viral by using AUTHENTIC views to get the views up. Thumbs up who agree",
        "Finess slid on this one ",
        "Big Homiee G been snapping every since he stepped on the scene him n Big X da Plug my favorite Big niggaz frfr can't forget Joe Green",
        "Whoever’s reading this, I pray that whatever your going’s through gets better and whatever your struggling with or worrying bout is going to be fine and that everyone has a fantastic day!",
        "them folks bumping asf",
        "Shit tough",
        "We need finesse to finesse his way away from mob ties like this if I'm rite",
        "🇱 ",
        "Finesse killing everything he get on",
        "🇱🇱🇱 ",
        "🇪  ",
        "I love how they reppin that titans shit. Real Memphis shit",
        "🇳",
        "They never will stop playing this game",
        "🇪🇪🇪 🇨 ",
        "🇨",
        "homey was cool, but lets be str8, fynesse2tymes is what this track is about. Stole the show on a feature.",
        "Damn this sounds like tick ",
        "Big homie G should blow up soon. Dude got some banger songs",
        "🇱🇱  ",
        "Man we been waiting on this Nigga for a minute. Let’s Go!!!!",
        "Finesse has been On they necks since he touchdown!!!!!",
        "The lil dance finesse do neva gets old ",
        "🇳🇳",
        "This shit go crazy on bro ",
        "this beat raw asf #chitown",
        "🇮🇮🇮🇳🇳🇳",
        " 🇳🇳 ",
        " 🇨 ",
        "Here before it even drop",
        " 🇪🇪🇪",
        "that pub fights was honestly the most wholesome part of the game, even Mjolnir is battling Ingrid",
        "🇷🇷 ",
        "The power of smii7y is immense \nYou can never stop him on his path to victory.\nfalls :)",
        "We here mayne supporting you dawg ",
        "Finesse2Tymes never disappoints me I knew he was going to come super hard after he was released.",
        "Real talk",
        "🇷🇷🇷",
        "Gotti pen game they got it lol ",
        "WHO GOT IT???? ",
        "🇰🇰",
        "Big Stomach G need to lose some Weight",
        "I bet this be a banger ️",
        " 🇮🇮🇮",
        "First time hearing Big Homie  Got you a new Fan G ",
        " 🇳🇳🇳",
        "Shit just gave me the best idea ever for marketing.",
        "Dem boys titan down I fw dat ",
        "Making money is an action. Keeping money is a behavior,  but \"Growing money is wisdom\" I heard this from someone ",
        "\"u know I can't go out like buddy\" ight read thru the lines",
        " 🇳🇳",
        "🇹🇹  ",
        "Shit is so inspiring to me , My music is just as good as big homie and ima be on top like him one day ",
        "Banging this shit in the mitten. #Detroit",
        "When finesse start hitting dat lil runnin man it’s ova fr ",
        "  🇹",
        "Finesss is hottest shit hitting streets right now",
        "Who Got It ",
        "🇮🇱",
        " Bruh keep pushing",
        "🇮🇮  ",
        "Str8 Heat",
        "They boys iced up in Memphis. Y’all got it  this beat hard and flow crazy from both y’all.  Them titans jerseys go in  #whogotit",
        "The police were suffering from lag during this mission. The amount times they almost had him was absurd.",
        "New wave",
        "You know it a banger when finesse know all the words",
        "This song been on repeat last couple of days I’m ready for that tape big homiie g and finesse2tymes slid on this song",
        "This shii hitting ",
        "I knew this was going to hit hard!!",
        "🇫🇷",
        "@ deyfw ain't pose to  I'm gettin finesse a pool table or a dinner table for x-masto shoot on. Ain't No Other Way-Bet ",
        "🇳 ",
        "I needed a new song to bump on the freeway and get outta my feelings  here we go",
        "Speak up G ",
        " ",
        "You're a gift to those around you.",
        "Finesse slid tf outta his part fr this song slide tho fr str8 crank fr definitely on repeat ",
        "I poured the lean in the slushie from sonic. Safe to admit I’m a marijuana junkayeeeeee",
        "  🇨🇨",
        "Y’all got it ",
        " 🇹",
        "Them Titans jersey \n\nShowing love from Nashville ",
        "My anxiety was going through the roof the entire gameplay knowing how stressed he was lol :D",
        "Reupload back in no no nadi",
        "I’ve rewind Finesse verse back 100 times",
        "I been fucking wit 2tymes and Big homie G and I'm up n Jersey ",
        "Y'all Hard As F**k Came With The Baller Blockin Theme  Real Recognize Real If You Know You Know S/O Bread Gang , S/O Cash Money Millionaires ",
        "🇮🇮",
        "I love it. For me personally big homie hit or.miss but he slid on this loved the bars flow instrumental and finesse2tyme been my fav since he got released and he delivered again. So proud that man. One .  TMC ️",
        "They putting memphis on ",
        "🇪",
        "🇪🇪🇪  ",
        "Finesse been on a mission ",
        "I really like y'all y'all tight. ",
        "A spiritual man has got it and will always have it as long as they stay focused.",
        "Finesse2tymes the hottest rapper rn hands down ️",
        "🇪🇪 ",
        "🇪🇪🇪",
        "🇳🇳🇳  🇮",
        "This Hit",
        "🇰🇰🇰  ",
        "🇨🇨",
        "Been waiting on dis one Finesse n G u know it’s a hit ",
        "G Album Gonna B",
        "🇮",
        "This shit go hard. Memphis rappers is getting it in rn. I love it. RIP   , ",
        "Let's get it 9 more minutes till impact",
        "I love how both final contestants had changed their skins for camo. And techno revealing to Fundy how he was still a step ahead was great.",
        "Me nigga!  2Tymes!!️",
        "Finesse did this!",
        "At 1:03 I lost all respect for this man long live king flippa ",
        "🇹🇷🇷🇷",
        " 🇨",
        "Petition for mark to have his own podcast where he just reads stories. Literally anything. His voice is so soothing. :'(",
        "Def blessed bro with a feat lol I’ve never heard of big homie g. ️",
        "🇳🇳🇳 ",
        "Mannnnnnnnnn this shit hard",
        "Finesse ain't missed one time!!!!!!",
        "Finesse made this song so much better",
        "This shit to hard",
        "🇹",
        "🇱",
        "They need to drop a tape together connecting crazy",
        "'Again my boy finesse flow, his delivery #UNMATCHED best rapper right now then lil baby no capp.!",
        "ABOUT TIME I TOLD YOU TO DROP IT AND YA DID FIRE FIRE ",
        "Drop a fuccing album G ",
        "I love to listen to songs but this is the first album that gave me this vibe and makes me wanna hear this in a live concert, no song has pushed me to wanting to be in a live in performance. This just I dont know I just wanna hear this voice in my ears vibrating and coming directly out of his mouth live! going this way I may even actually come to hear this.  only rapper who went viral without using AUTHENTIC VIEWS",
        " 🇰",
        "Man #Finesse done started a ",
        "Put dodges on All platforms !",
        "🇨🇨 ",
        "Big Memphis shyt mane ️️ #901",
        "Two young Memphis legends",
        "LETS FUCKIN GO G!!! MY DAWG BE TALKIN ",
        " 🇮🇮",
        "Finesse 2tymes is on fire  keep on coming with your videos my dude big ups to ya bruh ",
        "Finesse Best Artist of 2022",
        "🇨🇨🇨",
        "Finesse Yu Make Me Proud  … Let Em Hate that’s how Yu know Yu Made it Now … Been Ah Fan some years Now ",
        "Ain't no searching no artist lol",
        "This shit hard",
        "Crack",
        "🇳 🇨",
        "🇳🇳 🇳🇳",
        "BigHG came off this lit right here",
        "  ",
        "🇹🇹 ",
        "They did that with the balla blocking line shouts out cashmoney and finesse 100 ",
        "workout don’t get too big you gotta do shows and travel ! wanna see you thrive cuz you so down to earth and still got motion",
        "Boi we Rock'in wit it this in Atlanta",
        "M Town got the rap game on ",
        "Y'all know it it be that go get the  music  for real keep it up big homie",
        " 🇨🇨🇨",
        "Bass pro shops 🫣",
        "JUS WAT BIG HOMIEE NEEDED TIME TO BLOW ️ ",
        "I love to listen to songs but this is the first album that gave me this vibe and makes me wanna hear this in a live concert, no song has pushed me to wanting to be in a live in performance. This just I don’t know I just wanna hear this voice in my ears vibrating and coming directly out of his mouth live!… going this way I may even actually come to hear this.  only rapper who went viral without using AUTHENTIC VIEWS",
        "This track  ️ OB ties",
        "🇮🇮 🇪🇪 ",
        "Memphis got heat every artist from that bitxh! Love there flow. Memphis and Detroit running the rap game right now new artist with heat.",
        "Big homiie G working 🫡",
        "^^ some Question, except for Buffing up with everything, did you change the Class or Spec in the run?\nany gear changes in the run?",
        "THIS COLLAB GOES CRAZYYYY",
        "Someone need to come out with the instrumental  so this can become the  who got it  challenge",
        "They just rocked that ho",
        "🇱🇱🇱",
        "🇨🇨🇨 ",
        "🇱🇱",
        "Hard ",
        "Whole bunch of Kitchens and some switches ",
        " 🇮 ",
        "I'm waiting for my income tax.....dam bruh",
        " 🇨🇨 ",
        "🇹🇹🇹 🇹",
        "No more features save it for the album. These cats not on finesse level js",
        "Killing em",
        "DOPE RESPECT",
        "This da one fasho ",
        "Slapper who got it",
        "They didnt disappoint  Our Music definitely has a place in the Music industry  One day Imma buy Momma the land she always wanted",
        "This about to hit half a million in the first 3 hours it drop",
        "Finesse 2 federal def snapped ",
        "Absolutely Prolific, F2T word play is next level.",
        "Big Homiiie G go in sooo hard on this, straight up BANGER! He aint like all them goofies and oppas who just be usin dat IGROCKET dawwwt cawwwm jawwwwn to go HAM ON THE GRAM smh seem like anyone can get mad followers on Insta these days",
        "SHOT BY WIKIDFILMS",
        " 🇪",
        "🇱🇱 ",
        "Finesse ate this beat ",
        "2 of em!!!!!!",
        " 🇪🇪",
        "Don’t Eva stop speaking up G",
        "Definitely Something I wanted to See Big HOMMIE G & Fynesee 2 tymes ..",
        "Big homie never miss omm",
        "️",
        " 🇹🇹 ",
        "Respect from Brazil 🇧🇷",
        "Finesse is the  ",
        "Protect your health bro you can’t have none of this without it. Other than that you got it bro ",
        "🇮🇮🇮",
        "Moneybagg yo made the right decision ️",
        "Love the way the payed homage to baller blockin with the lil movie scene",
        "Who got it ",
        "🇮🇮🇮 ",
        "🇪🇪🇪 ",
        "🇨 ",
        "🇷",
        "Finesse2 en feuu 🇫🇷",
        "Lit. Big homie did his thing. I didn't know finesse 2 times was that large on the scene, I thought he was a regular hood rich nigga.",
        "🇪🇪🇪 🇮🇮",
        "They kilt the Titans theme  fasho ",
        "Big Homiie G is a huge inspiration to me and I WILL produce a song for him one day.",
        "Produce By Me X Spennn #SpeakUpG",
        "Big Homie G coming strong all year 3️⃣",
        "They boys iced up in Memphis. Y’all got it this beat hard and flow crazy from both y’all. Them titans jerseys go in #whogotit",
        "Hard",
        "finesse wrote this whole song you can tell",
        "🇰🇰🇰",
        "They killed the beat with this flow! ",
        " 🇱🇱🇱",
        "Imagine dis was a low key diss to yo Gotti #WhoGOTTI? ️",
        "\"I been dealing with personal problems\"  #BigHomieG"
    ],
    "comments_disabled": false
}