{"video_id": "DGCSk7aCI-Y", "comments": ["Finesse2tymes hasn’t miss on no feature or song since he got home ️", "They didnt disappoint  Our Music definitely has a place in the Music industry  One day Imma buy Momma the land she always wanted", "Big homie G should blow up soon. Dude got some banger songs", "They should do a whole album together!! ", "They killed the beat with this flow! ", "THIS COLLAB GOES CRAZYYYY", "I love to listen to songs but this is the first album that gave me this vibe and makes me wanna hear this in a live concert, no song has pushed me to wanting to be in a live in performance. This just I don’t know I just wanna hear this voice in my ears vibrating and coming directly out of his mouth live!… going this way I may even actually come to hear this.  only rapper who went viral without using AUTHENTIC VIEWS", "No one can beat the swag of Big Homiie he is not like other trappers who are going viral by using authentic views to get  views up Thumbs up who agree", "Two young Memphis legends", "Big Homiee G go in sooo hard on this right here, finess2tymes dun went in HAM too! They aint like all these other trappers who just be blowin up on the gram by usin dat IGROCKET dawwwt cawwwm jawwwn to go HAM on the GRAM by getting dey followz up smh", "This shit is hard as hell. Finesse is unstoppable. Big facts. ️ ", "Finesse2Tymes never disappoints me I knew he was going to come super hard after he was released.", "They boys iced up in Memphis. Y’all got it  this beat hard and flow crazy from both y’all.  Them titans jerseys go in  #whogotit", "This shit go hard. Memphis rappers is getting it in rn. I love it. RIP   , ", "Really great video. Whoever wrote the script is a genius", "Someone need to come out with the instrumental  so this can become the  who got it  challenge", "You're a gift to those around you.", "This collab fire right here fashooo ", "A spiritual man has got it and will always have it as long as they stay focused.", "You know it a banger when finesse know all the words", "I love it. For me personally big homie hit or.miss but he slid on this loved the bars flow instrumental and finesse2tyme been my fav since he got released and he delivered again. So proud that man. One .  TMC ️", "First time hearing Big Homie  Got you a new Fan G ", "Been waiting on dis one Finesse n G u know it’s a hit ", "I love how both final contestants had changed their skins for camo. And techno revealing to Fundy how he was still a step ahead was great.", "ABOUT TIME I TOLD YOU TO DROP IT AND YA DID FIRE FIRE ", "Both of them together ", "This song been on repeat last couple of days I’m ready for that tape big homiie g and finesse2tymes slid on this song", "They need to drop a tape together connecting crazy", "Absolutely Prolific, F2T word play is next level.", "They gave it ️️️", "Hard ", "Finesse slid tf outta his part fr this song slide tho fr str8 crank fr definitely on repeat ", "Big Homie G coming strong all year 3️⃣", "this go hard AF!", "0:72  Lets just take a minute to appreciate how much time and work he put into these videos?\nIt's unbelievable, and I think they deserve a lot more than that", "#Finesse2Tymes got home has since gone straight in every verse   ", "Finesse Yu Make Me Proud  … Let Em Hate that’s how Yu know Yu Made it Now … Been Ah Fan some years Now ", "I needed a new song to bump on the freeway and get outta my feelings  here we go", "Damn finesse been having real motion numbers can't lie fosho ", "This shit hard ", "FINESSE2TYMES FLOW UNSTOPPABLE", "workout don’t get too big you gotta do shows and travel ! wanna see you thrive cuz you so down to earth and still got motion", "Y’all got it ", "They did that with the balla blocking line shouts out cashmoney and finesse 100 ", "They never will stop playing this game", "Soon as finesse hit that running shit dance it's fire ️", "Big Homiie G is a huge inspiration to me and I WILL produce a song for him one day.", "Finesse been on a mission ", "Mannnnnnnnnn this shit hard", "Finesse Best Artist of 2022", "Petition for mark to have his own podcast where he just reads stories. Literally anything. His voice is so soothing. :'(", " Bruh keep pushing", "DOPE RESPECT", "This shit to hard", "Finesse 2 federal def snapped ", "This goes in far beyond run it up  good song herre", "Protect your health bro you can’t have none of this without it. Other than that you got it bro ", "Who Got It ", "Another hit fusho ", "JUS WAT BIG HOMIEE NEEDED TIME TO BLOW ️ ", "Who else waits until the red line stops at the of each of his songs because they are so unique and he's so talented", "This shit go crazy on bro ", "WHO GOT IT ?? WHO GOT IT?? ", "Finesse killing everything he get on", "Yall did dat", "This shit hard", "This shit gas ", "IMAGINE what he's holding IN THE FUTURE", "So hard ", "This how it usually go these guys be loyal play the background pushin they homie or family im his case he been rappin and been hard this whole time we just gettin onto him i onew bout g guest vereses like 3 or 4 years ago", "LETS FUCKIN GO G!!! MY DAWG BE TALKIN ", " Love from Baltimore Maryland ", "This song is hitting", "Them Titans jersey \n\nShowing love from Nashville ", "Shit is so inspiring to me , My music is just as good as big homie and ima be on top like him one day ", "My boi Neva disappoint me…keep popping yo shit. Stay Gettin off", "Memphis got heat every artist from that bitxh! Love there flow. Memphis and Detroit running the rap game right now new artist with heat.", "ABOUT TIME I TOLD YOU TO DROP IT AND YA DID FIRE FIRE", "This junt bump ", "Junt hard Fashoo", "Big homie never miss omm", "Speak up G ", "Y'all Hard As F**k Came With The Baller Blockin Theme  Real Recognize Real If You Know You Know S/O Bread Gang , S/O Cash Money Millionaires ", "FINESSE OF EM ", "Hard ", "This shit ", "Them boys ", "Bruh snapped on this one.", "Man we been waiting on this Nigga for a minute. Let’s Go!!!!", "Drop a fuccing album G ", "Finesse did this!", "", "Banging this shit in the mitten. #Detroit", "Burner of the year ", "", "This song", "Big Homiie G! ️", "Dem boys titan down I fw dat ", "2tymes has been on fire", "They baller blockin right quick lmao appreciate the love I’m from New Orleans"]}