{"video_id": "DgdmX5F0KWE", "comments": ["Can we be honest here for a second? Deji couldn’t have beaten Floyd because Floyd is simply just levels about him. I respect the mindset ksi has but it’s just not realistic when it comes to boxing. Also of course Floyd got a black eye, he had his guard down the whole fight. FairPlay to deji for getting in the ring with him but I think the result would’ve been the same if he worked twice as hard. That’s all I’m saying.", "I think a big thing was, Deji could tell Floyd was levels above, and I think he held back because he was scared of overcomitting and being punished for it. Realistically I also think floyd held back, didn’t want to completely kill this guy and fair play to deji for getting in the ring, but he shouldn’t of got in if he was scared to get hit", "Ksi: “just knock out mayweather, that’s my mindset”\nCanelo, Maidana, De la Hoya, Mosley, and literally every other world class boxer that fought Floyd: “shit, why didn’t I think of that”", "This guy really said deji could beat Floyd lmfao, cmon man. Floyd has 20 times the amounts of fights and experience deji has, even if deji was twice as good as he is now he still wouldn’t beat Floyd", "The reality of life is to accept your limit , you can't get everything with the right mindset. There will always be someone who is better than you. So there's no way Deji could have won that fight.", "JJ: \"he did pads between rounds. that's borderline disrespectful\"\nAlso JJ: *doing push ups between rounds", "I love you JJ, more than any youtuber I’ve ever watched and i always feel like i can defend you and be on your side but this time can’t say i can, there is no way you’d ever beat Floyd, and it’s extremely vain to say you could.", "What’s more infuriating is jj thinking him and deji could beat mayweather, there’s some things in life you can’t do, and beating the greatest boxer of all time is one of those things", "JJ: Josh would do GTA, Harry would play FIFA, Tobi would be like Chunkz\"\nAlso JJ: \"Ethan has a good laugh\"", "JJ and Deji watched anime during their childhood. Floyd only boxed in his childhood. JJ was talking about his mindset, but Floyd's mindset is bulletproof", "Imagine calling someone lazy to save your own skin and the guy just dedicates the next two years to writing an entire book about how hes not lazy. The level of dedication is real. :-O", "Glad to see some of the ksi fans being real here and not just riding him off", "this stream changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can.  I have been able to unlock my true potential due to this stream and I owe my life life to you. I feel and see things no other being can sense. I am feeling things unimaginable to the human brain. Thanks to this stream I was awakened to many things previously considered unimaginable and my brain can comprehend things that others cannot. Thank you for this exquisite stream, I will never forget this experience.", "You not kicking off at the event really shows the level of respect", "JJ talking about all of the sidemen being able to do well on their own is so sick and wholesome", "I remember hearing a pro fighter once talking casually and laughed saying he could beat the most average adults you come across in life just by fainting and faking them until they gas out .. after seeing Flloyd do that to someone now makes me believe that statement.", "Bro this was one of the most informational, normal toned videos in a while lmao", "No way JJ said he'd beat Floyd Mayweather", "Regardless of if Deji ever had a real chance or not, its super wholesome to hear JJ use a dragonball analogy for how much he truely belives in his brother.", "Whoever voiced that Grandma boss needs a raise, the voice acting is spot on. I felt every emotion :", "its CRAZY how far this man has come. im 12 and have been been watching for 6 years now. hope you have fun in your life JJ, great video keep it up", "It's great to see more people recognize technoblade's amazing story telling and personality. Rest in Peace brother. :D", "The funniest moment was when Floyd was cheering deji during the fight and then immediately used him for speed punch practice", "JJs take on Deji vs Floyd is borderline delusional. Floyd could've literally stopped deji at any point in time, if Deji decided to be a hero and give it everything he had floyd would put him out cold. Deji had a reasonable approach to the fight with. It was a shame to see him clowned but twas not surprising.", "Big props to you jj your the only YouTube boxer who takes his craft very seriously glad your challenging tougher opponents to up your game and glad your being humble about the man’s talent the game of boxing is all about respect hope you get em in 2 rounds mate", "what a lot of people are missing in regards to the Deji fight is that there are rules in the contracts of Mayweather exhibitions. I believe Logan talked about it on a podcast, but basically he wasn’t allowed to knock out Floyd.", "Thank you for catering to older fans not just 13 year olds.", "can we just appreciate how much we appreciate while how much we appreciate into his appreciate content and appreciate how much effort we appreciate and while we appreciate how much good appreciative content he appreciatively gives us", "I can’t tell if ksi is being serious. He does know that Floyd maybe gave 1% effort", "Honestly Floyd easily had the upper hand with him being a veteran boxer and him with his great agility to trow punches and you can see Floyd holding his punches back, honestly Deji wasn't ready if floyd actually wanted to hurt deji he could have easily done it", "Love how Cory is always being hyped and energetic in all of his uploads, I also greatly appreciate his consistent uploads :", "JJ Keep up the great work man, your an idol", "\"never give up! you can do it if you try hard enough!\" mindset doesn't work in this scenario, you're not the main character, you're facing the MAIN CHARACTER", "Sometimes JJ can be the biggest casual on the planet. How tf are u expecting deji to do bits against mayweather, someone who’s boxed all his life, and retired undefeated against PROS. By all means, root for ur brother but u can’t actually have believed that deji was gonna hurt him even if he “went 110%”. The reason deji was so timid was because Floyd made him confused from the get go. He’s just too experienced. Floyd would do the exact same to JJ as well.", "Jj , before I was watching u I had bad mental health but now U make  my day thank you", "i really hope ksi would actually read his comments and see the feedback on what he says in his videos", "There will never be enough appreciated for the actions that KSI has taken. Such a good guy.", "Gryla is a perfect example of the saying \"hurt people hurt people\"", "Keep fighting no names and untrained people and you’ll be on top in no time ", "Never did I think Id get on YouTube and see a video like this again.  The thumbnail and the vibes.  Man has time just flown by.", "KC went full tsundere when she hit Zane and said \"Dummy!\" Those are the vibes I got from that situation.", "The reason why Deji didnt go all out on Floyd is because that was the game plan until round 6 to go all out.", "Bro Deji did good I know he lost in the end but he fought well and honestly we should all be proud of him", "Siglis reaction to SSundee being of the cause of his torment that entire round made my day priceless", "great job jj on keeping me locked in watching this vid i told my self i was only gonna watch the first 5 mins but ended up watcing the whole thing.", "JJ may be the one and only person in the YouTube space who has continuously slowly and steadily gotten bigger and bigger every year throughout his whole time here", "Not gonna lie, a little confused by this response from JJ. Deji literally got in the ring against arguably the greatest boxer of all time and he did his best. Sure he lost, but nobody could have actually expected him to win. And the fact that he gave Floyd a black eye too is a huge dub, how often do you see Floyd come out of an exhibition fight with a black eye?", "1:27:12 got me in tears, This got me so hyped up", "I agree with JJ. Yeah he's definitely awesome by himself and so are the other guys but them together in the sidemen videos is where the real magic happens. The sidemen together are what makes the world go round!", "Ok question because I knew that JJ was going to say that about Dejis loss, why does JJ every time Deji looses always be like 'oh well he wasn't mentally ready he wasn't training as hard as he should have been' but on the lead up he doesn't even mention the fact that he has these concerns?", "JJ’s confidence and ego sometimes can just make him delusional", "So glad Delirious, Terroriser and Vanoss plays with Velocity and Lui again. Nostalgia is kicking  :D", "\"just knock out floyd mayweather, thats my mindset\" I feel like theres a reason non of the 50 pro fighters he fought did that, its probably harder than you think", "I feel you man thanks great video ", "Deji got humbled for real. Winning one fight with non-boxer does not mean you can take the best fighter in the world. This kind of Youtubers get humbled and put on their place. He deserves to be Humbled. There is some thing really on life that you just can't do. Now his big brother will try to take on mayweather", "Deji beating floyd in boxing is like KSI beating Einstein in Physics.", "This man's physical movements seem very much in sync with both his size and mental prowess, yet when he gets going he's truly an unstoppable force of nature while being an immovable object. It's next level :-)", "It’s frustrating that there’s this stigmatism that if he got given an L it means he didn’t try his hardest. Bro was fighting Money Mayweather, odds were already against him.", "Here's the thing floyd knew deji wasn't a over confident cocky fighter so he wasn't gonna be overly aggressive with him. Now with someone like Jake or JJ he'd definitely really want to put them down because they talk so much shit lol. If JJ said \"I'm pretty sure I can beat floyd\" after only having fought bums to floyd, floyd would make sure to humble him very quickly", "so much knowledge in this video lol I've never seen JJ talk this much sense before", "Honestly, I have no idea how this fight happened in the first place and considering how poor Deji has been in every single fight he's had except one, why anyone genuinely thought he'd have a chance against Floyd. Fair play for getting in there with him but Floyd was playing with him, probably only working at 10-15%.", "I think the problem with the reddit too is jj he reacted to less than 10 post cause he spent most of the time explaining things than actually going through memes and fast paste video like he used to", "JJ makes me laugh everytime but this time for different reasons ", "we all know floyd was not taking that fight seriously, he was just playing around", "Anybody that was expecting Deji to win was out of the mind! Big W for Deji though! Great things ahead", "Y’all can box no disputing that but Mayweather is the goat. Anyone whom has ever set foot in the square circle knows that. At no point was he worried because he has all the years behind him and 50+ wins against some really avid opponents, big respect for always believing in your brother ️", "There is no way in life unless Deji trained for most of his life (which is what Mayweather did to become as good as he is) would he have won", "14:34 I 100% agree with this guy. They think they have to one up every video they post but in reality, it’s the OG stuff some of us miss ", "6 rounds for Deji against Floyd was a win in itself", "I sometimes really wished I had an elder brother like JJ who was always there to guide me when I make a mistake and encourage me, being a single child really sucks man", "Today's fact: In Tokyo, a bicycle is faster than a car for most trips of less than 50 minutes.", "As a UFC fan I'm happy to see Greg Hardy fighting again", "Fighting mayweather is a once in a life time opportunity for Deji so he really should’ve gone all out if he wanted to make the most of it.", "Kratos getting down to Brok's level to present the spear and Brok agreeing to the blessing is one of the greatest examples of character growth I've seen in a game. I thought the game couldn't top the Freya therapy session in Vanirheim and then it just keeps getting better. It's so well written.", "Finally made it into a JJ video   I can die in peace now. And he went on a minute long rant refuting my point  (it was supposed to be a controversial opinion which I think he missed)", "JJ hates that Floyd was disrespectful, but when he did push-ups between rounds everything was OK lol.", "I think deji did take it serious, I just think the pressure of fighting mayweather got to him and it did show", "The one thing I thought was how much his cardio improved, never thought I’d see him go six rounds tbh", "No matter how much training would have put in Floyd has years and years of experience", "Like what JackSepticeye said on Anthony Padillas show, most people don’t actually miss the videos from back then, they miss the way it makes them feel (nostalgia can be be a bitch) and maybe how easygoing their life was, considering most would’ve been under 18 and not had the responsibilities life has thrown at us as we’ve grown older.", "Bros acting like Floyd was trying ", "Deji genuinely in my eyes has the highest potential of all of the people that went into the youtube boxing scene, only one ive seen who has bled every opponent, its literally just a matter of training and putting in 110% at this point coz he seems like his fight iq is pretty good in the moment", "it’s crazy how everyone in the comments becomes boxing pros whenever someone on youtube starts bringing up boxing. There is absolutely no problem with JJ hyping himself up and his bro. Actually, I find it incredibly wholesome that JJ believes in Deji. Don’t listen to anyone in the comments, keep up the amazing vids and keep on killing it in everything JJ ", "WSI, this video changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe . I can never look at anything I know the same way again. This video represents emotions that most humans could never understand. But I can. Thanks to this video I was awakened to many things previously considered unimaginable. Thank you for this exquisite video, I will never forget this experience.", "In the last video JJ was saying how him and Jake are completely different but then this video he sounds the exact same as Jake after logan fought mayweather", "The thing is he's never lost so he doesn't know what it's like to lose ....I need someone to humble him", "Moral of the story he had no chance they just treat deja as a little kid lmao", "it was wholesome when jj was talking bout every sidemen at around 13:00. ️", "Now imagine if Hasbulla unleashed his wrath on Mayweather in that ring we would be mourning Mayweathers  funeral right now", "Be honest, you have too much faith in your little bro if you think he could've won that", "Deji did say he knew he wouldnt win but he woud give it his all", "Now I'm gonna be honest, the take on Floyd isn't the best, and I'm putting that lightly. If anything, obviously Deji wasn't on the same level as Floyd, his fighting style wasn't also the best either. Floyd on the other hand had his hands down the whole fight so it was kinda expected he'd get shot by some punches or so. Not to mention Floyd is legit a master of defense and patience, realistically, if Deji was on the same level of a pro-boxer, he might've been able to put up a much better fight instead of being hesitant, but that still wouldn't be good enough considering how Floyd fights, weeving, ducking and rolling the shoulder while punching enough to score the points, which is the cement of his fighting style, and looking his fights versus Canelo and even Pacquiao (despite me being a Filipino and a Pacquiao fan), they couldn't touch him enough because of his defense and patience (the latter I think is what makes Floyd an amazing boxer).", "As a few others have mentioned here, it's strangely painful to discover that for all his genuine talent and real contributions (Earthworm Jim, Cool Spot, and Advent Rising all have honestly beautiful soundtracks, and Video Games Live is legitimately a groundbreaking achievement in bridging video game music into broader culture) Tommy is determined to squander that legacy by turning every other area of his life into a massive trainwreck for no clear reason. Despite how much of the video he occupies Tommy isn't the point here, and I think it was a gutsy and valuable choice to keep as much focus as possible on the actual boots-on-the-ground human beings doing the legwork behind cultural giants like him.", "The fact deji gave mayweather a black eye in itself is a HUGEEE W considering some of the best fighters in the world weren’t able to do that!!! Big up Deji ", "Vik, Harry and JJ are the only Sidemen who would bang on YouTube without the Sidemen.", "They were laughing and having fun so im sure they just didnt wanna fight crazy", "I don’t think you could expect Deji to bear Floyd that would never happen and I think jj is underestimating how good Floyd is even at his age", "Deji vs Mayweather is like a 5 year old playing against his dad and the dad lets him have a few shots ", "They were both saying weeks ago that he didn’t matter if déji lost, the fact his versing mayweather was a W", "Alternate title: KSI being an Asian father for 19 minutes"]}