{
    "video_id": "DgdmX5F0KWE",
    "comments": [
        "Mayweather was emoting",
        "yo bro how does it feel you being one of the biggest memes and used audio \n\n\n\"I DONT KNOW WHAT IM DOING\"",
        "So that explains why JJ never activated windows it’s because he got dropped by Microsoft .",
        "Deji vs Mayweather is like a 5 year old playing against his dad and the dad lets him have a few shots ",
        "JJ has evolved he’s mellowed out he isn’t a ego maniac anymore",
        "You say deji wasn’t even at his best yet gave Floyd a black eye as if it’s credit when Floyd literally wasn’t even trying at all. He made it look like a walk in the park which I expected already but I expected deji to at least give it everything he’s got since he’s only got this opportunity one time.",
        "You’re like krillan hahaha quote of the year",
        "Please never stop making Reddit videos!!!!!",
        "Deji is just like gohan before fighting cell",
        "Thank god that ksi’s fans aren’t being dillusional and agreeing with everything Ksi says because he’s got an ego for him to think that him and his brother could beat floyd is a joke. Floyd was holding back and deji was scared of getting punished. The olatunji brothers needs a reality check.",
        "Nah deji worked hard he's now training with Daley there's no way deji could have won this fight but he did better than most YouTubers would have",
        "Jj , before I was watching u I had bad mental health but now U make  my day thank you",
        "could we back to reality that deji even he try he cannot simply beat floyd.",
        "️",
        "DEJIIIIII",
        "I really like U and deji but neither of U are touching Floyd in a fight if he tries hard ebough",
        "the difference between Floyd Mayweather and Deji is about the same difference between KSI and Pineda Swarmz",
        "Big props to you jj your the only YouTube boxer who takes his craft very seriously glad your challenging tougher opponents to up your game and glad your being humble about the man’s talent the game of boxing is all about respect hope you get em in 2 rounds mate",
        "JJ man...seriously? :(",
        "Why not fight another YouTube guy? Dillon is a ju jitsu guy, come on now. Stop throwing shade at jake when he's literally fighting former ufc champs",
        "Does KSI actually think he can beat floyd? lmao",
        "I was worried when I saw the thumbnail and title. I'm so glad that we're doing thanksmas, you have helped so many people. Let's help some more!",
        "It's a shame Deji didn't win against Mayweather but at least he had the courage to step into the ring! ",
        "Wait the fight happened already? Lmaoo that shit got 0 promotion ",
        "Base goku is a good comparison. Maybe Uub from GT…. No Deku vs All Might either form.",
        "Ksi talking about a madness but he was shook of tyron Jake Tommy floyd and even tate he didn’t want that and it showed",
        "3:35 I back you in everything you do but that’s just pure waffle man. You’ve fought a couple YouTubers and a bitchboy pro fighter that could barely stand up by himself, Mayweather is an unbeaten boxing hero. You don’t come close. I’m sorry but let’s be realistic. The only reason Deji even got a hit on Floyd is because he allowed Deji to. Deji is one of my favorite people on the earth and he’s one of my inspirations in life, but Mayweather could’ve won in the first 20 seconds if he wanted to. Let’s not get carried away here",
        "JJs production has improved man he's professional looking Vids are sick",
        "No way JJ said he'd beat Floyd Mayweather",
        "3:35 I’m sorry bro but no ",
        "Floyd didn’t try his hardest we don’t need to pretend that",
        "Mahsa_Amini\n\nWOMAN , LIFE , FREEDOM",
        "Just me or does jjs nose look broken",
        "jeyjeeeeeeeeeeeey",
        "Honestly Floyd has been boxing longer then most of these YouTube boxers have been alive. They don’t have a chance",
        "Ksi is delusional to think he can beat floyd, should have some self belief but man needs a reality check like he’s legit fought no one",
        "Basically the ability JJ was giving is that JJ has gokus potential and Deji has Cohan’s potential seen as hogan surpassed goku in the cell arc but then after that he slacked in his training similar to Deji so Deji has the potential but he doesent have the work ethic JJ has",
        "JJ is slowly getting more mature it’s scary",
        "lol these kids getting banned for hating woman ksi even did it and then he hates on the top g. well whatever, andrew cant be cancelled unlike these boys",
        "7:10 blur their faces and its a banger album cover",
        "I love you jj but you must be joking about beating Floyd",
        "Fire video ",
        "Not sure why people are ragging on the latest sidemen sunday, I loved it lol",
        "Love your videos, make me laugh every time I watch them. \n\nPs. You should do a collab with coryxkenshin. Would be the funniest video ever made.",
        "Ksi is barely on par with jake and Logan Paul how tf does he think he can take on mayweather",
        "Deji has no chance, The only reason he manged to bruse Mayweather is because Mayweather was playing around not being serous like he was asking Deji to hit him",
        "He bruised someone in a fight? Nothing at all surprising about that one mate ",
        "Ksi showing how delusional He can be sometimes he thinks he could beat floyd well he should actually fight him instead of saying Yh I could beat him\n\nNo hate to him but you can’t win everything by just having the mindset of oh I can do it",
        "Such a humble guy for allowing the event to be about deji lol",
        "I'm sorry to say this but I hope Jake Paul humbles you next year.",
        "Bro Ksi, if your are seeing this comment (which you probably wont) cut the shit with deji and boxing. As a brother it is to have faith in your brother but its also good to be real with him as well. Under no scenario would deji have beat mayweather.",
        "I think Deji couldn't beat Mayweather. He jumped from Fousey to Mayweather. If he had done 5-10 fights make use of his technique and work on it as much as possible until he perfects it, workout and have the best physique he can possibly have (including cardio) and construct experience from fights. After that level up the fighters and after 20-30 fights in his career then fight Floyd with realistic chances of winning",
        "This is an L take on your brother.. Floyd made him wear smaller gloves the night before the fight and your brother took a softer approach because he didn’t want to get knocked out which he would’ve gotten knocked out if he threw like. Your brother could not have done more if your brother did more he would’ve got knocked out and that’s what your pushing your brother into",
        "Lost all respect I had in you trolled Messi  as if he was the problem",
        "Im p sure Floyd couldve beat Deji in a wheelchair with a blindfold on",
        "Everyone in the comment section not liking this one are they god damn yous chronically live online let the guy have an opinion lmao",
        "I could understand ksi getting mad at Deji for losing to wassabi, but him getting upset for losing to mayweather is just ridiculous.",
        "i dont think krillin was the best analogy jj",
        "dejis lucky he didnt do what you think or he would be be in a coma",
        "Fight Tyron Woodley",
        "JJ: Floyd was disrespectful to deji\nAlso JJ: does pushups while fighting his second opponent last time",
        "Come on man. Deji could beat mayweather. Get a grip. It took all his effort to beat fouseytube ",
        "Come on JJ Deji was never winning that fight he’s a veteran the best arguably ever rate deji for the bag",
        "about Ethan its 100% true ",
        "Yo @KSI Can you hold my coffee quick?",
        "Imagine calling someone lazy to save your own skin and the guy just dedicates the next two years to writing an entire book about how hes not lazy. The level of dedication is real. :-O",
        "3:56 I think he meant gohan because everyone told gohan that he has this hidden potential that he needs to unlock",
        "Bro Deji did good I know he lost in the end but he fought well and honestly we should all be proud of him",
        "Honestly I only watched the highlights…. But for the like 7 minutes I saw maybe 2 decent combos… Deji barely through punches like he’ll throw some power shots or Atleast try some combos in the early rounds",
        "Deji did say he knew he wouldnt win but he woud give it his all",
        "I know it’s great to be confident in yourself. I’m not like that very much but I understand the mindset of telling yourself you’re better than everyone. But there comes a time where reality needs to be checked lol JJ, Deji did well in giving Mayweather a bruise to the eye & realistically that’s all he needed to do. He landed a good shot on one of the greatest. Yes he’s your brother, you & only you know him the best. But Deji went from Fousey to Mayweather, that is an unrealistic & unreasonable jump for someone who JUST gained some confidence barely 3 months ago. He’s an amateur & he needs years worth of training to be able to actually beat someone like that. Just because he gave him a bruise doesn’t mean that’s a knockout potential. Floyd’s been hit way harder & it’ll take a lot more than what you or Deji have combined. ",
        "JJ is simply wrong about Deji vs Floyd and his general take about beating Floyd. The jab is what Floyd used to stop him every time. JJ likely would get knocked out simple bc a counter punch is what Floyd need to end it.",
        "Honestly I feel like deji did way better than Logan. Floyd really worked him and was showboating to get in dejis head. The fact that he put in work against someone like Mayweather is just insane",
        "Deji beating floyd in boxing is like KSI beating Einstein in Physics.",
        "I think ksi is the guy who can win a fight against floyed",
        "Plz add prime to Australia",
        "1:25He's just glad reddit is not making fun of him",
        "Jj not beating floyd mayweather, actually no way shot he has a chance",
        "Base Goku solos universes ",
        "We need Ethan & Jj try not to laugh challenge series with forfeit of who ever smile or laugh..MO make it happen! ",
        "bro tbh floyd just played deji",
        "I respect his general mindset when it comes to overcoming hurdles in life, but come on. Now it just sounds bare disrespectful to the guys, who dedicated their whole life to the sport, went in there with Floyd, arguably the best to ever do it, and didn´t manage to beat him. It just is not realistic to get in the ring and beat Floyd, when you learnt how to throw a jab 6 years ago and fought a bunch of journeymen. Floyd would absolutely annihilate anyone on the ytb boxing scene with one arm behind his back and his legs taped together.",
        "I was gonna watch this till he kept going on about his spastic brother now I dint even wanna watch him get bashed his not goku ever",
        "Ksi saying he believes he could beat mayweather is one of the most delusional things I've ever heard.",
        "The people that are saying that the new videos that are high production are bad, are just living of nostalgia. I love the old videos that they made, but as JJ said, they can´t just make the same low quality videos.",
        "Deji did what he did at the end of the day he fought 1 of the best boxers in the world & that itself is a accomplishment but like I said Floyd is allot better than most ppl even at his age",
        "Let's just  appreciate how much work he puts in these videos to make our day huge respect! ",
        "JJ wtf are you talking about lmao you're not knocking out Floyd nor is Deji",
        "Can we be honest here for a second? Deji couldn’t have beaten Floyd because Floyd is simply just levels about him. I respect the mindset ksi has but it’s just not realistic when it comes to boxing. Also of course Floyd got a black eye, he had his guard down the whole fight. FairPlay to deji for getting in the ring with him but I think the result would’ve been the same if he worked twice as hard. That’s all I’m saying.",
        "JJ should just go back to rapping",
        "When deji loses ksi is always making excuses for him saying he didn’t give it 100% . Deji no matter how much training has no shot against mayweather",
        "You guys talking like Boxing Veterans but you all forget about to set specific mindset even if you know you  would lose, you should never give up and fight like you are on the top, that's why everyone in Boxing does this.",
        "Marshmello Family is Here watching your videos ",
        "Love how Cory is always being hyped and energetic in all of his uploads, I also greatly appreciate his consistent uploads :",
        "Anyone noticed that jj didnt laugh for a single time in this video",
        "KSI really needs to fight Floyd to get that humble pie",
        "JJ it's not always how it looks on the TV. You look at Deji vs Floyd and are like \"why tf isn't deji hitting him\" but you don't understand how tough it is the pressure that radiates from an amazing boxer like mayweather",
        "Peace love always...love u jj...love u youtube️",
        "No way he's that delusional",
        "Chances are 100% coz I've done it m8",
        "Npc",
        "JJ I feel you should have been the one to fight Mayweather instead of Deji. Just my opinion",
        "The reason jj feels deji could of done better is the fact floyd was not trying i thought jj would understand this is 5 percent floyd.",
        "The green on the right suggests that JJ is money minded, like floyd mayweather, has success within his grasps but also engrossed in his babatunde tribe, hunting down cheetahs. ",
        "6:08 lmao I thought I was the only person thinking this",
        "Should've said Gohan cause he's got the most potential of them all.",
        "Joke of the year 'deji can beat Mayweather'",
        "\"just knock out floyd mayweather, thats my mindset\" I feel like theres a reason non of the 50 pro fighters he fought did that, its probably harder than you think",
        "Speed just a modern early days KSI ",
        "jj is the best brother respect for being a w brother",
        "* KSI explaining every Sideman's qualities and what makes them unique *\n\nalso him on Ethan: “he laughs good...”",
        "Man said “I think I could beat Mayweather” ",
        "Yh the reddit videos got nerfed used to be way funnier back then",
        "16:40 u sure fam?",
        "First",
        "U get more delusional by the day if u actually think there's a chance deji could've beat mayweather",
        "In the last video JJ was saying how him and Jake are completely different but then this video he sounds the exact same as Jake after logan fought mayweather",
        "Is that why he doesn’t have windows activated?",
        "I don't agree with the 'one camera man over the studio crew' comment. It's hard for them to record and make content at the same time. You want to see everyone fully and them being comfortable not holding anything instead of them have to focus on the scene at the same time do the camera works. Remember the time Harry jumped on a car and fell, only Vikkstar had his camera on an angle and almost didn't capture that legendary moment. Even that footage was half-ed, we really didn't see Harry jumped on top of the car, we just saw him fell.",
        "alright i love you jj but neither deji or you have a chance against mayweather. This is the reason you get hated because your ego is insane. Think brother think he's the champion for a reason.",
        "bro i was about to watch this video then A sports shoe ad came up with KSI in it",
        "\"I can beat Mayweather\"  ",
        "my favourite videos have to be the ones in public but its hard for them to do it, a-z is my probably my favourite and the bingos etc were so nice, it was so good to switch things up doing that a-z last sidemen sunday",
        "If you take JJs determination and Dejis natural athleticism. You’ve got a damn good fighter.  Even JJ knows Deji could be better than him",
        "Deji is more like Gohan ngl, he has this crazy hidden potential but does nothing with it. same with gohan he was forced to study in his earlier years and now he's getting back into it (beast form) deji will get there hopefully!!!",
        "I'm sorry jj I know you need to back deji because that's what brother's do but deji sucks at boxing period. Lol",
        "bro stop slamming the table my speakers are blasting everytime you smash your table ",
        "There will never be enough appreciated for the actions that KSI has taken. Such a good guy.",
        "I love you JJ but you wouldn’t stand a chance against a fully determined to win Mayweather. You may be the complete opposite weight class, you may tower over him in height and you may have longer reach but this man has gone 50+ fights without a single loss. you cannot just step into the ring beat a man that is that good at what he does best just because you’re bigger than him. that’s not how that works.",
        "I don’t want to be that guy but JJ, I live in Texas and that b roll footage you showed before the poster ad for the fight was a view of Dallas, not Austin.",
        "I’ll be in Austin to see the event! I’m so excited broooo",
        "Too bad you’re ducking Jake",
        "JJ also cannot beat Floyd Mayweather. Honestly Youtube boxing scene is just big claim i can beat floyd i can beat ali i can beat tyson all the while really never boxing any professional boxers just out of shape nobodies.",
        "My boy said \" You're like Krillin\" (When speaking to Deji)... DYING!!!",
        "i think most boxing fans need to know is that nobody is invincible floyd could've been beat by deji .",
        "This video felt more like an life/YouTube update then a Reddit video, and I’m okay with it! ",
        "Can't really agree with JJ here, deji was trying his absolute best in that fight.\nYou can see him trying everything he could to try outbox Floyd but it was never going to happen.\nDeji did his best and he was in shape, you cant just say hes lazy every time he loses because in the sport of boxing it happens.",
        "LUV UR VIDS!",
        "Deji did so well in the fight we are all proud of him",
        "I wanna see Ksi fight a real boxer so he can be humbled",
        "Jj needs to lose a fight",
        "Be serious plz ain't no way deji is beating Floyd Mayweather but big props to him for fighting him",
        "15:04 who is this \"around\" guy?",
        "Bro you use to say the most outrageous JOKES, it’s a joke what speed said, defend him. Society changed so much people can’t be themselves anymore.",
        "JJ: \"he did pads between rounds. that's borderline disrespectful\"\nAlso JJ: *doing push ups between rounds",
        "Let's take the moment to appreciate how much effort and time he puts into his content for us, Keep it up! \n\n ",
        "I think deji got scared of the 10oz glove change last minute and he let mayweather get in his head",
        "Hes like krillin hidden potential ",
        "This \"i can beat\" Mayweather bollocks is coming from a guy who has been boxing for only 3 years and hasn't been hit with a proper punch in his career. U will get made fun of in the ring just like deji if u though him",
        "krillin didnt have any damn hidden potential he just couldnt keep up with the rest and fell off lol xd",
        "KSI being delusional again",
        "Ksi ,tate want that smoke where u @  poor boy called him out  and went silent mode.",
        "bro i feel like JJ is being wayyyy to hard on Deji. he  was fighting Floyd fucking Mayweather. JJ hasn't done that, for him to be saying he could've done more when he has no idea what its like to fight one of the best boxers in the world is a bit annoying. i get that you can be devils advocate here but honestly deji didn't even think he was  gonna win so what did you expect? he even said his goal was to \"hit Floyd\" not win against him",
        "cmon ksi aka Olapinga Olaculo after all the shit-talk on your vids and you are not going to fight tyron hoodley bruh...",
        "Moral of the story he had no chance they just treat deja as a little kid lmao",
        "Ksi could u please launch prime in india",
        "I feel like jj needs to lose atleast once against someone whose levels above him in boxing in order him to improve.",
        "You know JJ is being genuine in his speech when he starts drawing Dragon Ball parallels .",
        "Floyed and deji had a play fight, I say this because floyed was chanting dejis name while they were fighting but deji is an amazing boxer no disrespect",
        "No matter how mid a reddit video will be, it will still be better than a one question go",
        "I like how Harris calls Guinness a novelty book company, completely forgetting that they are, in fact, a beer brewing company.",
        "Vik got me dying, after that hug with Deji ",
        "3:29 c’mon at least be more realistic and humble, pride comes before fall.",
        "I think we all knew what the result was going to be. Experience beats talent.",
        "Bro since when have ksi comments been so toxic lmao",
        "How is JJ celebrating over a black eye on a taunting, hands-down Mayweather and also saying Deji should’ve one?",
        "I love you JJ, more than any youtuber I’ve ever watched and i always feel like i can defend you and be on your side but this time can’t say i can, there is no way you’d ever beat Floyd, and it’s extremely vain to say you could.",
        "ye very deluded thinking ksi or deji could beat Floyd",
        "Jj you not seriously shaming your brother again in another video because he didn’t beat Floyd mayweather? Lol ur top 5 best YouTubers but get real",
        "Deji did better than logan because logan was hugging Floyd the whole time",
        "If JJ's mentality and way of thinking of \"I can do everything as long as I put my mind to it\" gives such a bad precedent to his already young audience\nI mean, kids shouldn't believe that, because no, people can't do everything, not even KSI. And kids need to know, there's genetics and natural born talent when it comes to things, and although the message might be highly motivational, it'll surely gonna create a lot of frustrated kids with broken unrealistic dreams",
        "\"I decided it was about Deji\"\n\nNo brother you didn't. It WAS about Deji\n\n\"I chose to let it all about Deji\"",
        "At least deji gave floyd a red eye",
        "The delusion and fakeness is crazy",
        "Deji Tyson , deji can be the next iron Mike , if deji can train early on he could be iron Mike",
        "Man is really accusing Deji of not giving 100% after losing to FLOYD MAYWEATHER. Buddy is delusional \"I feel I could beat Mayweather\" KSI doesn't understand the difference between YouTube boxers and real boxers.",
        "JJ and Deji watched anime during their childhood. Floyd only boxed in his childhood. JJ was talking about his mindset, but Floyd's mindset is bulletproof",
        "KSI complimenting all of the sidemen made my day ",
        "I think a big thing was, Deji could tell Floyd was levels above, and I think he held back because he was scared of overcomitting and being punished for it. Realistically I also think floyd held back, didn’t want to completely kill this guy and fair play to deji for getting in the ring, but he shouldn’t of got in if he was scared to get hit",
        "Now come on",
        "he's slowly entering his delusion era",
        "Floyd wasn't even trying. He could have finished Deji in the first round if he wanted to.",
        "Floyd would beat ksi without hands",
        "Lets be honest…the fight was f***ing dead. It was super boring and basically nothing happened ",
        "JJ talking like deji fought prime mayweather ",
        "3:08 here's what y'all came for ",
        "How can you be disappointed at your own brother for not beating floyd mayweather? Like give the man a break. You would have lost altso. Im a fan of you but sometimes the stuff you say just doesnt make sense",
        "You can't beat Mayweather right now KSI. But, awesome confidence and much respect. \nMayweather has a legacy. And, its a genuinely legit boxing legacy. \nOne day it will be true, you will be able to beat Mayweather. \nHe will eventually succumb to age like everyone does...",
        "Loved what you said around the 15:30 mark. @8 years old and I watch the sidemen videos whenever I can. Great content and I like that there's catering to all ages",
        "JJ lad... You ain't ever beating Mayweather. Even though you'd box at heavyweight, even though you're younger and more powerful. He will tear you a new one cos the simple fact is you ain't a very good boxer and he's the best technical boxer that's ever lived... You're trolling if you think otherwise",
        "Deji such a nice guy letting Floyd have his moment ",
        "Let's be real, JJ Would be smoked by Jake paul. \nHe's not even in the mayweather discussion",
        "Not gonna lie, a little confused by this response from JJ. Deji literally got in the ring against arguably the greatest boxer of all time and he did his best. Sure he lost, but nobody could have actually expected him to win. And the fact that he gave Floyd a black eye too is a huge dub, how often do you see Floyd come out of an exhibition fight with a black eye?",
        "I actually believe he‘s going to be the one that beats Floyd by knocking him down/out. \nMaybe that’s the race Jake is Chasing. Would be a great finale for the whole YT boxing run and definite end for Floyd",
        "My company can honestly bring your prime brand to Nigeria and actually run a factory plant where it would be produced and sold here In Nigeria. This is just a business proposal that I have for you",
        "Deji got humbled for real. Winning one fight with non-boxer does not mean you can take the best fighter in the world. This kind of Youtubers get humbled and put on their place. He deserves to be Humbled. There is some thing really on life that you just can't do. Now his big brother will try to take on mayweather",
        "Yes there is no way Deji can beat an actual pro and neither of can you stop dreaming. Actual boxing is leagues above what you guys are doing.",
        "why you standing fam... sitdown ",
        "he really think deji could beat mayweather?",
        "Now I'm gonna be honest, the take on Floyd isn't the best, and I'm putting that lightly. If anything, obviously Deji wasn't on the same level as Floyd, his fighting style wasn't also the best either. Floyd on the other hand had his hands down the whole fight so it was kinda expected he'd get shot by some punches or so. Not to mention Floyd is legit a master of defense and patience, realistically, if Deji was on the same level of a pro-boxer, he might've been able to put up a much better fight instead of being hesitant, but that still wouldn't be good enough considering how Floyd fights, weeving, ducking and rolling the shoulder while punching enough to score the points, which is the cement of his fighting style, and looking his fights versus Canelo and even Pacquiao (despite me being a Filipino and a Pacquiao fan), they couldn't touch him enough because of his defense and patience (the latter I think is what makes Floyd an amazing boxer).",
        "U ain’t beating mayweather man humble yourself you’re fighting danis a guy with literally 0 boxing skill",
        "i love u jj but the only reason deji gave mayweather a black eye is because he was playing with him the whole match didnt have his guard up at all.",
        "He think he can beat mayweather the best boxer last 100 yrs in boxing .daym how this world's delusion",
        "Love the confidence JJ",
        "WHY IS THERE NEVER PRIME IN ASDA!!!",
        "fight foyd please",
        "Those fools in the comments thinking that Floyd can actually beat JJ. Lololol",
        "Feel sorry for deji here. He’s just got in the ring with one of the greatest boxers of all time, gave him a black eye and did his best and this is the reaction he gets from his brother saying he could of done better. I love jj but his ego and delusional outlooks are through the roof he needs to chill out as he’s not even really a good boxer himself. Put him in a ring with a half decent pro, never mind mayweather, and he gets finished, just my opinion.",
        "KSI should organize a boxing charity match ",
        "I honestly think with no offence that deji had a 2% chance of winning",
        "who the fuck is JJ Olatunji lol",
        "Sorry jj I am a fan but no he could not and neither could you mate, talking about mayweather the same one? Have you any idea how much experience he has he fought your brother as if he was sparing an amateur for a warm up through camp. You riding that horse a little to high bud sorry to say. Connor could not beat mayweather but you and bro could? That’s the kind of talk that just puts me off man you have fought a bunch of YouTubers and now suddenly you are a top fighter? Don’t be like jake stay humble buddy. Go full time boxing fight top contenders and aim for the belt then you get the right to talk smack.",
        "Did this man just say that Deji can beat Mayweather? yeah no ksi might actually be delusional rn ",
        "KSI vs Vidaal, lesssgo",
        "Deji wins one fight and all of a sudden he is ready to fight Floyd “runner” mayweather. Come on man",
        "KSI kinda crossed the line here, he really said he feels like he’s beating Floyd, and expected Deji to go in there and ko the GOAT. Idk what to say.",
        "He’s fighting joe Fournier",
        "Ksi should fight Mike tyson",
        "U know deji isn't training hard when a 40+ floyd has a better physique than deji",
        "Wait deji gave a guy that was past his prime, going 50% effort, a black eye. Wow",
        "All these comments literally don't understand the fact that you have to believe you are gunna beat anyone in the ring. Doesn't matter if it's right or wrong the second you have doubt in your ability to beat someone in the ring you've lost it already.",
        " EPIC news good look with your next fight.",
        "WSI, this video changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe . I can never look at anything I know the same way again. This video represents emotions that most humans could never understand. But I can. Thanks to this video I was awakened to many things previously considered unimaginable. Thank you for this exquisite video, I will never forget this experience.",
        "Let’s be real here JJ we all know Deji stands no chance again Floyd but Floyd was just toying with him for fun and not even putting 10% in  deji would have been knocked out first round if Floyd tried but he felt bad for deji and wanted to make him feel good since he’s had nothing but Ls",
        "@ksi wake up",
        "\"he was using pads during the 2-3 round which was a bit disrespectful\"\nAlso JJ: doing pressups in the ring against Pineda",
        "You aint beating a Floyd.",
        "Most honest and open talking to camera I think I have ever seen from you. \n\nThank you",
        "That fight made me cry and laughter so much I took a screenshot ",
        "I feel you man thanks great video ",
        "Deji vs jake Paul 2 would be a fight",
        "Konami music oh god  Cristiano",
        "Guy at 15:22 must’ve never seen what happens to cartoon network after 8:00pm SPOILER ALERT it turns into Adult Swim",
        "In all honesty, you reacting too boxing event, is a lot interesting. I even watch it too learn the stuff myself",
        "Honestly I knew exactly how this fight would go when you and Deji were watching back each others' fights and you said to him that all he needs to do is just survive Floyd Mayweather, and that even if he could get just one shot on him it would be insane. I could literally tell in that moment when you said that, it became his goal and I think if you never did say that he would've gone way more ham.",
        "",
        "JJ: Let's try to be more creative people on the Reddit.\n\nMe who tries to get 500 karma in order to post on it:",
        "y do u expect that your bother could beat  the best boxer",
        "Floyd got serious for 30 seconds and got the stop let’s be real Deji my guy but no chance any YouTube boxer can even come close jake Paul too",
        "sick album cover ngl",
        "idk it feels weird that JJ isn't looking at the camera, just slightly off uno dem oness derr  *edited felt like JJ is just in his own room in his own thoughts expressing his own thoughts to us, gives us that realism that we're connected but at the same time disconnected. i.e. we're living in an age where we're all connected, yet anti-social/yet disconnected. ",
        "Deji is literally Gohan  never at his true potential ",
        "Why y’all be sleeping on Floyd bruh  he’s actually the best fighter of our generation… no hate to Deji or KSI but mayweather is literally a living legend imo",
        "deji never had a chance, floyd was toying with him the entire fight",
        "My guy give it all he had to barely beat Logan on some lost penalty points and Floyd was toying with Logan, not as much as he was toying with Deji but still lol. Love the confidence but be serious......",
        "It’s just marketing guys relax. \nNone of them think they can really beat him. \nIt’s a business guys. Use your brains",
        "JJ makes me laugh everytime but this time for different reasons ",
        "JJ's character development has been showing, glad im here for it",
        "I respect the love JJ has for Deji and the confidence. I just think it is not a realistic statement at all to say that Deji can beat Mayweather. Everyone knew how the fight would end. If Logan couldn’t beat Mayweather, then idk how you can say Deji could.",
        "JJ destroy floyd Mayweather for deji i was mad also that deji lost do it for deji",
        "its CRAZY how far this man has come. im 12 and have been been watching for 6 years now. hope you have fun in your life JJ, great video keep it up",
        "Ksi should go against Floyd Mayweather and get justice for his brother that would be amazing since ksi beat Logan",
        "Love ur videos JJ! Keep it up! ",
        "Floyd was clearly toying with Deji, it is what it is lol",
        "I think if he did put more into things like training to be in better shape and have better technique he would win.he already has great timing with his punches and the power and knowing when to pull them back to guard",
        "Damm, after he announced the fight with dillan. Im really disapointed. Time to quit supporting jj. If you talk the talk walk the walk. Shit toks he can beat that he can beat that. But chose easiest opponent.",
        "It's great to see more people recognize technoblade's amazing story telling and personality. Rest in Peace brother. :D",
        "How can they say that ab the videos being better before? There top videos are all ones that needed a big production",
        "Abs show hard work  what logic is that",
        "Wait.. if he is going to Texas then could we be expecting a JRE Podcast?? That would be ace",
        "6:33",
        "Deji genuinely in my eyes has the highest potential of all of the people that went into the youtube boxing scene, only one ive seen who has bled every opponent, its literally just a matter of training and putting in 110% at this point coz he seems like his fight iq is pretty good in the moment",
        "JJ always comes in clutch ",
        "I also completely agree with jj with more effort deji could definitely defeat Mayweather of course",
        "4:04 jjs the only person who can say this without being cringe",
        "I think deji did take it serious, I just think the pressure of fighting mayweather got to him and it did show",
        "Ksi seems to have a super duper over confidence in his self that he thinks he can beat any body in the world, it's like no humbleness left inside him because of what he is now and how successful he is, he never loses in a fight that's why he thinks he can beat anybody in the world",
        "yo i can pop a quick one if you want to prove someone that someone has mastered to that pic ",
        "What did speed say?",
        "Would like to see viddal on a misfits card",
        "Honestly JJ you can’t say Deji has the wrong mindset when fighting one of the best ever. You fought swarmz in your last fight ",
        "Jj I think you are starting to become very delusional",
        "Deji never would’ve beaten Floyd but regardless big respect to both of them.",
        "lets be honest i dont hate deji but he fought fousey who's shit at boxing wasn't suprised that he won",
        "Floyd mayweather toyed with him and taunted him the whole fight. Deji sadly never stood a chance.",
        "\"It's borderline disrespectful\" You already forgot how you acted during your return fights? xD",
        "3:34 \"I feel like I could beat Mayweather if I just had the mindset\"   Yeah JJ,  you Feel like you could win the fight against Floyd but it just isn't the same as actually having professional boxing experience and good boxing skills to defeat Floyd in the ring, even if Deji gave his 110%, Deji would get clapped within seconds if Floyd tried to fight back, If we saw Floyd being serious for once in the YT boxing fights and not some boxing exhibitions, He would destroy everyone in the YT Boxing scene. Floyd had his fights against Canelo and Manny Pacquiao who both are better than Deji by a long shot and both have given it their all against Floyd, and both lost (even though Manny's L was kinda rigged, depends on the perspective). But overall Deji just had no chance since the announcement of the fight. Floyd was just fooling around.",
        "6:32 jj ayo",
        "JJ the fact you think you can beat Mayweather and not Tate is ridiculous",
        "Despite the fact I think Deji couldn't beat Floyd Mayweather, I know for a fact Deji could've done better. You could see Deji pulling most of his punches, or just not going full power or speed. He looked like he didn't want to hurt Mayweather.",
        "6:06 people like Floyd wont care if someone has abs. He will care about the preformance, not the show. And yes, he is in great shape. He is at the perfect weight to not get tired fast, and has cut down enough so that his opponent can feel his punches. So what I'm saying is that it does NOT matter if you have abs, it matters if you do good and abs won't provide that.",
        "13:20 Ethan post videos just laughing at stuff and it will do well, basically what JJ does every video",
        "4:23 JJ super shocked Deji bruised Mayweather.\nJJ also I know he can beat Mayweather.",
        "deji did well, it was obviously just a show but deji got to swing against one of the best.\n\nHe can proudly say he fought floyd mayweather regardless of what anyone says, i guarantee any one of your viewers would be happy to just meet the dude let alone get in the ring with him.",
        "Man played with Pineda and believes he can beat Floyd",
        "Hi \nAll I want to say is….. can I have unlimited prime.  please . And if you do \nI love you ",
        "Guys, if Deji did what you guys wanted him to, it would be like a 4th division team trying to play with city..",
        "did ppl really expect that much from deji AGAINST FLOYD? be real deji has talent for boxing BUT his experience and years of training are not there",
        "I like you better as a rapper then a singer, u are already super rich you dont need to sell out even more lol",
        "Floyd legit played with deji...the only reason he got bruised is because he was dancing around toying with him.  If floyd wanted to fight he would have KOd first round. Deji on ropes when floyd is playing around having fun...respect to him for getting in the ring with him tho. And in my opininion, ksi would lose to floyd even if floyd was 55 yr old",
        "even though it was not a funny video it was great to see him notice some minor problems",
        "I respect KSI’s opinion but of course Deji wasn’t gonna be 100% against Floyd… it’s fucking Floyd. He’s levels above Deji and other professional boxers. Anybody going up against him isn’t gonna be 100%, It doesn’t mean Deji didn’t give it his all in training, it’s easy to look bad when you’ve only had 3 fights and are going up against someone who’s 50-0 and considered by many to be the best of all time.",
        "JJ, it's all love bro, BUT HONESTLY, none of you lot, not even Jake Paul can beat Mayweather. Mayweather barely even tried against Deji bro. He's fought and beat the toughest boxers ever. He is one of the greats of the sports that HONESTLY none of you lot will EVER BE. That's right, you guys are killing it in your own ways in your own lanes, but you CAN'T \"BE THE BEST\" in everything.",
        "Wolfindior was speaking straight fax fr lol",
        "Hope jj is joking cuz if not too ego needs checking no chance in hell could he beat mayweather maybe in a other 20 years when mayweather is really old",
        "Look i agree with JJ on pretty much everything, but his take on Deji is kinda poor. I agree that he was a little too cautious and didnt throw that many punches, but you cant say he didnt train that well because he not only had to switch to 10oz gloves but he also had to wait a whole hour to enter the ring.  And also Mayweather not taking the fight seriously and dancing around deji like he won before they even started fighting, probably made deji feel like he wasnt good enough. And everyone saying Ksi and Deji are delusional for thinking they can beat mayweather, theyre not... Floyd is washed up and old, maybe back in his prime it would be acceptable but now? One clean shot and hes done for, you saw how easily deji bruised him, everyone just scared of him and think hes a goat cause he never lost. Which he still is a goat but i dont think he's as good as he used to be. In conclusion give Deji the respect he deserves and stop thinking Mayweather is a god.",
        "We always see jj and deji or jj and simon collabs but never a jj and ethan collab or jj and garry collab, id love to see jj and ethan sat in jjs new studio making a try not to laugh",
        "Can we actually just deep the fact that Deji fought Floyd Mayweather",
        "Are you trying and failing to speak like, The Rock",
        "Pointless fight, can't imagine why people would actually pay to see Mayweather essentially giving Deji lessons lmao",
        "Deji raging is hilarious. He’s so calm, but insulting\n\n“Your brain. It doesn’t seem to work. You’re honestly an idiot. An idiot. I can’t stand you”",
        "KSI: \"He was borderline disrespectful\"\nAlso KSI: does push ups in the middle of his fight against Swarmz.\n\nBruh",
        "Unban Anthony Taylor man",
        "It’s disrespectful jj even thinks him and Deji can beat floyd",
        "Deji is more like Gohan than Krillin.",
        "Today's video is very mediocre",
        "Yo JJ come back to naij for a meet and greet",
        "JJ thinks he can beat *Floyd Mayweather* but has been Intentionally delaying the fight between him and Jake for years ",
        "Whilst he was talking about his music, Talia’s song “Stay The Night” started playing in the gym I’m at",
        "BRING PRIME IN INDIA",
        "Nice",
        "The fact deji gave mayweather a black eye in itself is a HUGEEE W considering some of the best fighters in the world weren’t able to do that!!! Big up Deji ",
        "That Dragon Ball analogy was on point about Deji",
        "He just loves his brother lighten up ",
        "Huh? How can you criticize him for his match vs the greatest boxer ever when he legit gave him a blackeye? I honestly doubt you would be able to do the same.\nI never considered you delusional but you thinking you guys actually have a shot vs Floyd is crazy talk, like legit crazy person talk. We get it, you achieved most things you wanted in life, but there are certain things you cannot overcome and Floyd is one of them.",
        "Massive W for Deji  he proves that he never gives up in life",
        "KSI is mad if he thinks Deji 110% can beat Floyd ",
        "It’s funny how Floyd mocking deji was infuriating to jj but let’s not forget he did something similar in his fight with Pineda(the GOAT)",
        "How the fuck did he even get the fight ",
        "BRO U SAID THAT NAXT VID IS A TRY NOT TO LAGHUJ",
        "I mean certainly KSI didn’t expect Deji to beat Floyd Mayweather.",
        "Interesting response from JJ; delusional I would say. Nothing is impossible, but let's be honest, Deji had no chance of beating Floyd, even when Floyd was boxing at like 10% of his capacity. Sometimes this crossover boxing scene can be incredibly delusional.",
        "LEJI ",
        "He lost physically but mentally became a king ",
        "Sorry JJ but you’re more likely to be able to beat up a horse than Floyd ",
        "Deji fighting Floyd is like when you face the final boss at the start of the story and he's untouchable ",
        "“Deji, you’re like Krillin”",
        "For me, deji’s not goku, but a frieza. He has the genetics and talent yet hasn’t bloom yet, like frieza. Frieza only trained 4 months but can par goku’s ssjb. Now frieza have his new form, Like deji, if he trained like TRAINED like super hard, he’s gon be a scary lad in yt boxing, maybe with pro’s also",
        "In the row of bottles, it looks like there is one edited out. Now I cant stop looking for it",
        "9:20 ig we already know ",
        "Ksi just keeps getting worse ",
        "Lmao jj said the same thing he said to him self after break up and now redit",
        "You feel like you can beat mayweather ",
        "Meyweather disrespectful like jj didn’t do push ups on his opponents",
        "“I feel like I could beat mayweather” what?",
        "come to san antonio",
        "The fight was like beerus in the first episode he shows up in",
        "18:18 i just want to be last",
        "Man beat Pineda and thinks he could beat FLOYD MONEY MAYWEATHER ️ Delusional",
        "How can I get in contact with jj for an idea  that can potentially make millions",
        "For some reason when JJ said Deji could beat Tommy, I thought he meant Tommyinnit… I was like well duh ",
        "Come on JJ you are better then this, for a guy that mocked and did push ups between rounds was kinda weird seeing you talking about Floyd being disrespectful when he was actually very classy with Deji. Kinda of an L there ",
        "I know it’s unrealistic but get me a brother who believes in me like KSI does with Deji.",
        "Be honest, you have too much faith in your little bro if you think he could've won that",
        "Who else seeing this after JJ got slapped",
        "Floyd could’ve seriously hurt Deji if he wanted to.",
        "Honestly, I have no idea how this fight happened in the first place and considering how poor Deji has been in every single fight he's had except one, why anyone genuinely thought he'd have a chance against Floyd. Fair play for getting in there with him but Floyd was playing with him, probably only working at 10-15%.",
        "Ethan, Miniminter, VIK, Tobi would be washed without the sidemen.",
        "I’m 21 years old, been watching JJ, since I was 14. One of the first videos I remember was when he did his first Q&A question video from fans. I’ve been watching him ever since. From when moved into the sidemen house until he moved to LA and f’ed off. I actrually live in LA and was disappointed when he moved down here cause I considered him as one of those q*eers. But I’ve been watching him every since and totally agree he hits a bunch of different age marks ever since. Unlike every other YouTuber, Jj is the only one I’ve been watching his videos and keeping up with till this day.",
        "Finally made it into a JJ video   I can die in peace now. And he went on a minute long rant refuting my point  (it was supposed to be a controversial opinion which I think he missed)",
        "10:48 Don't worry jj I'll rub one out for you bro ",
        "JJ bro shave that stash cuz that aint it bruv",
        "Rare bad take from jj. Deji can work harder but he did pretty good for the shit he was given. Fighting one of the best boxers ever and then having an adrenaline dump from waiting an hour and having to change gloves is a big thing to go against. And even then he bruised maywether . He did decent with the context!",
        "made my day, massive W for deji :)",
        "Ego that should be this guys new name",
        "Floyd is one of the best fighters ever you aren’t beating him JJ and it’s obvious Deji wouldn’t",
        "Bros acting like Floyd was trying ",
        "Sidemen should make a video of:\nEach sidemen first finds a homeless person each (get permission to record them first)\nThen\nThey need to put each homeless person in a hotel for 2 weeks",
        "Krilin just foder like deji's skills",
        "If deji is in base form then his other forms will be much stronger than the average person",
        "the reason the reddit is not top tier cuz its not in ur bedroom",
        "The fight with deji and mayweather felt like he was coasting. It felt like he was there to be able to say that he’s fought mayweather.\n\nI don’t know him or JJ so it’s really not my place to say, but it’s a little frustrating because I was hoping to see an animal who’s finally tasted blood and wants some more, but he kinda was starstruck/trying to enjoy himself in the ring",
        "The thing is he's never lost so he doesn't know what it's like to lose ....I need someone to humble him",
        "No one gonna point out he said Krillin not Gohan for the potential?",
        "1:24 reddit is on its periods",
        "Bro Speed and Ksi have so many similarities. Swear it's like looking at a reflection of Ksi",
        "Lsi ",
        "Honestly JJ is straight up wrong about Deji vs floyd",
        "Lets be honest here. We can’t expect deli to go 110 percent for an exhibition bout. Him and Floyd got in that ring to put on a show. If u need any proof of that look at Floyd’s physique for this one and look at a his physique in any of his actual fights.",
        "He made a clown of your brother  love Australia",
        "Whoever voiced that Grandma boss needs a raise, the voice acting is spot on. I felt every emotion :",
        "JJ i love u but deji was never gonna beat floyd cmon now",
        "I think the problem with the reddit too is jj he reacted to less than 10 post cause he spent most of the time explaining things than actually going through memes and fast paste video like he used to",
        "Jj love the content, keep it up, I love what you do for us even though you don't really need to. You do this purely because you want to",
        "Deji did his best to be honest. Hey deji if you happen to come across this comment, just kow that you did your best and there's always room for improvement. Rome wasn't built in a day, so you can do this brother!!! Don't mind ksi he's always gonna say something Madd to push you out of your comfort zone just because he's your brother. On the other hand jj, you need to show more love to your brother. Having 2  easy fights in a night shouldn't boost your ego to this level. Love jj, love deji.",
        "can u pls go back to ur soccer vids.. especially since the world cup is back. we need a \"its coming home\" part 2 vid",
        "So glad Delirious, Terroriser and Vanoss plays with Velocity and Lui again. Nostalgia is kicking  :D",
        "JJ, love the content every time. You do not disappoint in these videos man. Deji did good in the fight. He kept up a good fight but it just wasn't enough. Next time all he gotta do it hit back harder.",
        "“All these mofos in one building, and I did fuck all, I mean I guess I did a little thing with Woodley",
        "Ksi in Texas I wet my self lol",
        "Ksi actually need to get in the ring with Mayweather just to get a reality check on the levels lol ",
        "JJ is delusional",
        "Please jj can you do an updated Boxing tier list",
        "You not kicking off at the event really shows the level of respect",
        "was you a boxer",
        "I WANT TO SEE JJ PLAY MORE VIDEO GAMES!",
        "It was a cringe fight even though we kew he would lose because he isn’t close to the level Floyd is on",
        "KSI was literally speed when he was his age lmao",
        "Get viddal on misfits",
        "JJ can be delusional sometimes. Deji or jj are not beating Mayweather ",
        "11:02 “KSI isn’t a rapper, he’s a popstar”\nYeah I can agree with that, I am pretty popular",
        "Deji was incredible, hes gone a long way!",
        "Fair play so deji for having the balls to get into that ring with mayweather",
        "Deji = Kid Gohan",
        "4:44 og fans remember Deji was athletic as a kid, he was built",
        "Used to love JJ as a creator even when he was a boxer around logan paul times but all he does now is put me off , you cannot say u will beat floyd he is 50-0 for a reason and you have no composure in the ring also haven’t had a fight with anyone good yet??",
        "great job jj on keeping me locked in watching this vid i told my self i was only gonna watch the first 5 mins but ended up watcing the whole thing.",
        "What kind of plant is that in the background",
        "I understand the positive work hard mindset by JJ but fucking hell, Deji is nowhere close to Floyd. You can't reach the top of a sport with an undefeated career and just lose to some pleb who has played video games for half his life.",
        "I like you JJ and your content. Respect where it’s due. I like what you’re doing for business as clearly it works. However, I have to say it but I hate what YouTubers and TilTokers have done to Boxing as a sport. Not saying g you’re not talented but will say you have made it more quicker in the sport due to your fame levels. Loads of boxers I know that train 5/6 times a week have still not been recognised. Your not you are their level. You can set these fights up with pros because of your chosen careers only. I feel sorry for the regular people who have trained like animals for most of their lives that have not got the chance yet. So when you say Deji or you can beat Floyd, I would say some of my friends would flatten you both but still lose to Floyd. He is the greatest today. Respect again to you for your business and content but sorry not for the sport. Stay well ",
        "denji is like the main character that keeps losing",
        "I thought ksi was delusional before about his boxing skills but saying he can beat mayweather is honestly worrying, floyd would beat the shit out of ksi and deji at the same time it wouldnt even be a contest. Floyd was taking the absolute piss out of deji he can finish these amateurs in seconds if he really wanted to but he makes a show out of it to give people there moneys worth.",
        "You have to respect Deji anyways for the work he put in... obviously Floyd Mayweather has way more experience than Deji in Boxing. However than doesn't determine who can or will win the fight. In other words, the posibility of deji winning was there but it was really low, anyways, you have to respect the fact that he took the fight.",
        "JJ...you can not beat Mayweather. Sincerely, everyone.",
        "Ksi is moving mad ‘ i know i can beat mayweather” is he on drugs ? Is he even serious ? He talks so much but he never has beaten a Pro fighter i begin to start he is being a mad man",
        "No matter how hard deji trains he can’t beat Floyd",
        "Just seen a video where a man had to take up for u in a fight ",
        "9:08 bring it back fr",
        "1:14 it’s possible if you train in time slow ship where Goku trained when he travel to piccolo planet",
        "I think JJ needs to realize that it isn't Dejis mindset. He's just not that good",
        "13:00 never heard a person cope harder",
        "My god KSI needs a serious ego check",
        "its lovely seeing him talk so maturely. this is the same guy who made \"am on a horse\" and it truly shows how much he's grown over the years. much love to u jj <3",
        "I know u lot are sayin it’s impossible for JJ to beat Floyd, but aye anything is possible and any lucky punch landed can change the whole event. I understand y’all are being real and not riding JJ but in my opinion, you just gotta try innit if there is a possibility and ya have the mindset to win",
        "Its not bad to be confident but you should know when its enough. Floyd would've smoked deji in 2 rounds if he were serious and same would happen to jj",
        "this kind of videos where jj voice more about his opinions on things is so nice to hear man, it shows how much sense, logic, and knowledge that he has even though he's doing a lot of things, and still make time to create contents for us, keep smashing it jj",
        "I’ve been here from day dot ",
        "Well done JJ we need to take a minute and realise how far you have came ",
        "Big ups for not making Deji fight about you!",
        "If Deji put in 100% Mayweather would of destroyed him too. What you on JJ!",
        "@123home",
        "Doesn’t matter how good of a boxer you are it takes one clean hit to put someone on they ass  if deji has the power and knowledge of using it he definitely could’ve hit mayweather with something that could’ve slumped him",
        "Sometimes JJ can be the biggest casual on the planet. How tf are u expecting deji to do bits against mayweather, someone who’s boxed all his life, and retired undefeated against PROS. By all means, root for ur brother but u can’t actually have believed that deji was gonna hurt him even if he “went 110%”. The reason deji was so timid was because Floyd made him confused from the get go. He’s just too experienced. Floyd would do the exact same to JJ as well.",
        "8:06 It's good Posture JJ HAHHAHAHHA",
        "Regardless of the boxing stuff, that's a pretty good mindset to have.  You are what you grow into.  Just gotta know what growth actually means.",
        "Nah, you've gotta have more of a realist mindset. Deji \"survived\" 6 rounds getting absolutely lit up by the greatest boxer to ever enter the ring, and probably got the biggest bag of his career from it, too. Deji might have lost on paper but he's won in what matters in the long-term. I feel like this fight, win or lose, was exactly what Deji needed to become an even better boxer going forward.",
        "Deji also did push ups the disrespect went both ways. Also you can’t expect Floyd to fight someone like Deji and not have fun with it",
        "Bro Deji was fighting Floyd Mayweather you acting like Deji is a veteran",
        "Great video jj keep it up man",
        "Ksi is scared of Woodley and it shows lmao ",
        "He managed to bruise mayweather? He had his guard down the whole fight",
        "This shows no matter how many odds you are against a true homie will always have your back️",
        "JJ is pushing me to like Jake Paul more than him with this kind of stuff lmao… think sometimes man…",
        "Lemme guess, this Saturday we will find out you’re not fighting Jake Paul lol",
        "can we just appreciate how much we appreciate while how much we appreciate into his appreciate content and appreciate how much effort we appreciate and while we appreciate how much good appreciative content he appreciatively gives us",
        "It’s frustrating that there’s this stigmatism that if he got given an L it means he didn’t try his hardest. Bro was fighting Money Mayweather, odds were already against him.",
        "Knowledge, Strenght, intelligence",
        "My man JJ actually thought he could F Floyd up ",
        "Speed was supposed to be 6´1 lmao nvm",
        "10:42 i got you bro",
        "KSI stop it man. There's a reason Mayweather's 50-0.",
        "Wasn’t you doing press ups during your fight? You can’t comment on Floyd doing pad work as you’re just as bad imo",
        "I think the Mayweather vs Deji fight was amazing! Even though I was rooting for Deji to demolish Floyd, I appreciate the humbleness and entertainment from both fighters. Also, I appreciate that you had all of your focus on Deji instead of entertaining Jake and Tyron’s childish games. Big ups to the Olatunji bros for life!",
        "3:48 i think deji's trainer isnt for him. daley perales or whoever, he trains losers.  deji only won during the periodical moment leon stepped in, even then, fousey was never too much of a hurdle.",
        "I like the idea of being in the mind set of being able to beat floyd but realistically it won’t happen Floyd was messing around the whole time and I’m sure deji noticed it so he didn’t wanna go too far since any second Floyd coulda flipped a switch and destroyed deji easily",
        "try a texas vlog on some 2017 logan paul shit",
        "Starting to realise there's a reason why boxers don't take YouTube boxing seriously after KSI says shit like this. JJ you are good yes, but you are not 50-0 good. Deji is not 50-0 good. no one expected him to win, its delusional for you to think he could. People didn't buy the tickets to see Deji win, they watched it for entertainment which was delivered.",
        "1:27:12 got me in tears, This got me so hyped up",
        "You honestly think you could beat Floyd Mayweather??? nah man the ego is out of control",
        "No way this brudda said he could beat Floyd ",
        "The gas station 2 mins away from me has 3 different prime flavors",
        "If Deji had JJ’s work ethic he’d be better than Jake Paul",
        "Floyd is great, amazing defender and a strategist. But everyone who is placing him on an unbeatable pedestal is delusional, we are all human and the fact that Deji gave him a black eye is more than enough proof. Deji doesn't work as hard as he could, no way near but he's improving and it's admirable, I personally don't think he is quite cut out yet to take on fights especially athletes like Mayweather. Ksi definitely has a better shot than any other youtuber, let him be confident there is no need to drag him down so keep a strong mindset and encourage yourself even when your most loyal fans don't.",
        "Respect to Deji for letting the Floyd guy win",
        "Jj compares himself to goku and it’s the most cringe thing",
        "KSI please beat andrew tate",
        "Floyd choose deji to make an example of a youtube boxer i am sure the likes of jj or maybe even logun the peek of youtube boxing could do more against folyed but we know he is the peek of boxing in our generation this is an expected result even if deji worked 5x times harder he wouldn't have won",
        "For the album cover, edit the faces to be younger sidemen",
        "If manny Manny Pacquiao couldn’t beat him and many other great legends what makes u think if any of you YouTubers , no hate I love deji and all of yah but theirs a difference between actual boxing pros who started when they were young teens or kids to you YouTube’s with less than 10 years of experience",
        "I wish I had someone in my life that believes in me like JJ believes in Deji",
        "Floyd Mayweather is the greatest boxer of all time. No debate. 50-0 and has never lost an exhibition either. Floyd is just on another level. He is the god of boxing. Unless someone else can show me a 50-0 boxer that was also a massive draw?",
        "I like how KSI says :\n\n“ I could have easily beef with Jake Paul, beef with Tommy Fury … “",
        "Nah man his response to Deji’s fight pissed me off man  love JJ but Jesus Christ allow Deji to not be on the level of arguably the goat of boxing without getting “infuriated” lmao",
        "Tbf I rather this reddit. Ppl would keep posting the same shit if boxing didn’t happen",
        "I don't care what JJ says, a dude that can give Floyd a black eye can destroy almost everyone I know",
        "this was an “exhibition” fight for a reason. it was just for show. and it makes sense when you think of it as such because neither fighter was giving it their all. honestly, did anybody think deji of all people was going to be the one to put an end to floyd mayweather’s undefeated career? the obvious answer is no. mayweather accepted the fight for publicity and essentially played around with deji because he is one of the greatest boxers of all time. his rank cannot be questioned and was definitely at no risk from a youtube boxer. idk saying you “know deji could beat him” sounds wrong because a. it’s not true and b. it’s sort of disrespectful to floyd. glad to see most of the comments agree that the outcome of the fight was not surprising at all ",
        "10:54 I already did",
        "5:45 bro you were doing pushups against pineda ",
        "JJ saying he could beat floyd mayweather is the worst possible take. Floyd would clap him even at his age. Jake Paul got a better chance at beating him then jj does",
        "i wont say \"you cant beat mayweather\" but i would love to see you two fight, even though he is like 40 or 50 he still has hands",
        "deji ur like krillin hahah ffs bro no XD ! u could of said gohan might of made him feel stronger XDDD",
        "jj stop with the mayweather thing jfc. youre starting to think your canelo shite getting cringe",
        "Y’all do know that this is a exhibition",
        "KSI is just super real . Speak facts",
        "JJ talks as if beating Floyd Mayweather is a walk in the park. Deji didn't have the physical advantages Logan had or KSI would have if he fought Mayweather. All things considered, Deji had done a madness.",
        "Watching techno obliterate antvenom and sparkles at the same time is terrifying =O:) =:-*",
        "Kratos getting down to Brok's level to present the spear and Brok agreeing to the blessing is one of the greatest examples of character growth I've seen in a game. I thought the game couldn't top the Freya therapy session in Vanirheim and then it just keeps getting better. It's so well written.",
        "I really hate saying this but I feel like JJ is only disappointed because Deji lost despite the fact that he trained very hard for this fight and took this fight super seriously.",
        "Keep fighting no names and untrained people and you’ll be on top in no time ",
        "JJ talking about Speed: \"The past doesn't define you.\"\nJJ talking about Manlikeisaac: \"Hopefully you don't steal.\"\nHypocrisy at its finest.",
        "Ksi: the Reddit’s been mid won’t lie\n\nthe Reddit after Dillon slapped ksi:",
        "Deji has had many chances he has no potential sorry but it’s true",
        "I think it’s funny jj thinks he could whoop Floyd’s ass",
        "He shouldn’t have been fighting in the first place with that dookie ass record he gets to fight the goat ?",
        "If Floyd tried he would have destroyed Deji within 1 round same goes for Ksi. Enough of the delusion man thinks he can beat mayweather",
        "That’s fucked up lol, krillin?!?! You could have said Gohan. At least he actually has hidden potential",
        "It was a W regardless! Dude fought the greatest boxer of our generation! Insane to comprehend",
        "SIT DOWN BRO",
        "i love ksi and deji but sooo many people underestimate floyd  there’s a reason why he’s never lost a fight his ring IQ is insane ",
        "Who agrees that in JJs next song/rap, he should collaborate with a famous artist like (my recommendation) the kid laroi if he can. Love the vids, beat up jake",
        "KSI went to Texas to get slimed by Denis",
        "bruh this match just sad, even when floyd faced logan he didnt toyed logan like that, tbh deji cant even beat logan or jake ",
        "lmao delusional, come on man.",
        "The one thing I thought was how much his cardio improved, never thought I’d see him go six rounds tbh",
        "we gotta get KSI to book fredo vs DDG hell make it happen",
        "12:17 so true. My gym plays \"not over yet\" at least once every day. Shit's crazy.",
        "Even if Deji somehow beat Mayweather they still would have given Mayweather the win.",
        "Im really disappointed you and the sidemen joined the threemasons",
        "THE UK WANTS PRIME BUT WE DONT HAVE IT",
        "Who knew if you had the right mindset like KSI, you could knock Mayweather out "
    ],
    "comments_disabled": false
}