{"video_id": "DjODCllZj4w", "comments": ["Who else is ready to watch Willem Dafoe go insane from isolation again?", "Ah, yes, another installment in the Willem DeFoe slowly going insane cinematic universe! My favorite cinematic universe", "Not many actors can maintain your attention by themselves for an entire film. Defoe is one of those rare actors.", "This movie looks brilliant and they got the perfect lead actor making it a must see", "We live in a world where William Dafoe does not have an Oscar. ", "The premise looks interesting and Willem Defoe is a legend.", "One of the best things is that he never takes credit for himself when he achieves something. He always respect us, the audience, and his team, and he is always polite in all of his videos. We congratulate ourselves on this achievement. More to come and everything to come >:(", "Another movie with Willem Defoe going insane? Perfect!", "I cant put into words how happy I am Mick stood up for himself. I remember reading the first Reddit post 2 years ago and being shocked at how many people bought in at an obvious smear attempt, Mick collecting receipts for 2 years was worth the wait in the end", "I love isolation movies and this looks like it’ll be an interesting one. William Defoe just makes it that much more encouraging to watch.", "I appreciate that every so often Harry goes down these insanely deep and specific rabbit holes and then passes the savings on to us.", "FFS how come he hasn't won an Oscar yet??? This is beyond belief. Dafoe is one of the worlds best and yet so underrated. Give him that bloody Oscar!!", "Willem Dafoe is a really underrated actor. For me one of the best of all time no doubt about it.", "Never seen Defoe in a bad movie.  Totally stoked for this!!", "When Dafoe is in it, then you know it's going to be a good movie.", "I love how this trailer is put together so I thought I'd try to take a crack at what this might possibly about:\n0:08 Here we get the setting which is this particular building in the center of the screen.\n0:11 The radio audio is to either be the outside police trying to get into the locked building to capture the intruder OR it's the earpiece audio the intruder (the main character) is receiving for instructions for this art theft heist probably additionally symbolizing communication between the outside world.", "I’m gonna try to predict the final twist: the fact that this guy is trapped inside is some kind of performance art show. It’s basically Panic Room meets The Game.", "This man is a treasure, he can act with his shadow & still blow your mind.", "Willem Dafoe never disappoints!!", "How does this man not have an Oscar yet?", "I actually want to see this movie. I love the trailer.", "Watching him again makes me feel so calm its like he was alive again with his cheerful content", "I appreciate the direct allusion to Defoe's character in Finding Nemo, another character trapped in a glass box that enlists the help of a friendly bird", "I just wanted to say thank you for how you have handled all the news, leaks, and spoilers. Great job!", "First a lighthouse, now a penthouse. Willem can’t catch a break.", "At some point in this movie we will be seeing the Green Goblin personality take full hold", "Un actorazo sus innumerables peliculas ,y buen trabajo hacer querer ver siempre...", "After seeing him play in The Lighthouse, i know he is gonna do sooooooo goooood", "IScamSpeed, this stream changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience", "Willem Dafoe is going crazy again!! He looks Soo funny!! Almost thought this was going to be the real Playback Time", "Whoa!  What a concept for a movie.  Perfectly casted!", "My god I love Willem Dafoe", "I'm ready for a Dafoe psychological thriller", "Love Willem Defoe .  Definitely has my interest", "Focus makes the best movies! Vanity Fair 2004 did it for me! ️", "I didn’t expect the sequel to Bo Burnhams film to star Willem Dafoe.", "The director of this movie is brilliant!", "You had me at Willem Dafoe", "Most anticipated film of the year!", "He must use all his cunning and Green Goblin instincts to survive.", "This actually looks really good", "One of the best actors.", "Let's just appreciate how much work and effort he put into these videos", "Dafoe is one of the greats.", "Man... Seeing Kratos in a vulnerable state like that together with Atreus just hits like a truck. You don't get that every day. :(", "Willem Dafoe is the greatest actor of all time", "Now this is epic.", "I didn't know green goblin was in it!!", "This guy always plays insane roles.", "Now, I truly understand what Dr. Norman Osborne goes through since testing the performance enhancers on himself.", "This looks outstanding", "Wow this looks incredible", "Wow, this looks so good!!", "I am so ready for this", "Super excited to hear Willem Dafoe’s rendition of White Woman’s Instagram", "Finally a movie I would be interested in seeing.", "You had me at Willem Dafoe.", "I'm calling it now. Number 3 is the artist and him trapping the burglar in a room while he goes crazy is his art piece. By the end the room is put on display as an art exhibit. Total shot in the dark.", "OHH MY GOD ... I LOVE WILLEM DAFOE !!! ", "I definitely want to see this film.  Love William’s work.  ", "Couldn't have named it anything else? Now I'm gonna have to specify which Inside is my favorite movie.", "The Master Willem Dafoe? YEAH!", "This actually looks interesting & good.", "Best movie in 2023 in my opinion it’s real physiological thriller ", "this video feels so nostalgic. lui and velocity and the thumbnail make it seem like one of his older videos", "Looks incredible", "He going for an Oscar i see.", "I love Willem so much", "Ah, yes, another \"Willem Dafoe goes insane\" movie.", "He's probably trapped in there for like 3 hours or something but goes all Willem Defoe very quickly. Gobbles up the fish after 10 mins.", "theres some people that genuinely have nothing to lose if they get a criminal record or go to jail.", "IT WILL BE GREAT!\nI hope.", "Well, I feel like I just saw the whole movie. And Willem Dafoe was amazing.", "I am all for it", "I imagine this how an accountant feels like in their cubicle for the duration of their shift at work.", "The most overlooked aspect of Mick's response was how clearly evident it is that Marty had it preplanned to exploit Mick. Put him on a tight deadline, rejected his ideas that were on time, made him redo his sounds, then used both the new sounds and rejected sounds while he was only paid for the \"Redone\" score. This was a scam from the very beginning and Marty is just another shit manager that had it planned out it seems.", "Willem Dafoe will always be my DaFriend.", "this looks fucking fantastic", "Are they gonna show us the whole movie in the trailer?", "Hope he finally gets his due and wins and Oscar. From Platoon to Mississippi Burning to Spiderman. The Academy has to be a bunch of idiots! Even Tom Cruise, should of won one for Jerry Mcquire", "Okay Focus, looks like a winner.", "\"Things work out best for those who make the best of how things work out.\" ---John Wooden", "Art is a wonderful thing to behold.", "At the end of the movie, he finally gets out and a random passerby asks him what he's wearing.", "You know, I'm something of an art thief myself.", "Willem DeFoe. I saw Willem DeFoe on Saturday Night Live. He made many references to his own looks.  I was reminded of \"He was a funny looking guy.\" in Fargo \"You know, a funny looking guy.\" Comments refer to the looks of the Steve Buscemi.  Characters that Steve Buscemi inhabits step off the screen and into your life. Boardwalk Empire was America.", "Quarantine hit some of us harder than others", "So they finally made a full length movie of what @boburnham went through while creating INSIDE. I can't wait to see Willem Dafoe play the keyboard and sing!", "The cashier girl one is true. I saw probably the prettiest girl ever working as a subway worker.", "Damn this looks  great", "When Goblin said \"Norman's on sabbatical, honey\"  this is where Norman be at ", "how crazy. I want to see!", "This is actually the result of a pre-Goblin Norman getting stuck in one of his penthouses and having a bad day.", "Always an all seeing eye somewhere in these movies", "Amazing performance ", "Writer: you'll be trapped in a penthouse ok?\n\nDafoe: you can't do this to me...", "Williams Defoe you  are awesome!! I have watched all your movies, sometimes more than once \nYou are on the top list of best actors  .. I read all reviews and comments \nMarch 10th…I will be there in the theater front row \nLove you lots.  To meet you is a dream of mine", "interesting. hopefully they didn't leave any plot holes or obvious ways he could get the maid or maintenance or emergency services to check on the place. which matters more, not getting caught or surviving? he did have fire at some point.", "Jesus, MARCH.  Feels like a long time to wait…", "I believe the condo owner wanted to trap Nemo in there to watch him suffer."]}