{
    "video_id": "DjODCllZj4w",
    "comments": [
        "Looks like a real pepper upper.",
        "Dont alarm systems always alert the police when anything happens?",
        "WOW, talk about poetic justice. Trapped inside of the very things you wanted to steal. Im sold.",
        "Is this the William Defoe movie from Mr Bean's Holiday?",
        "The Lighthouse 2: Tokyo Grift",
        "Carson Clay presents, Carson Clay, in a Carson Clay production, of a Carson Clay film",
        "This reminds of a film were a car thief gets trapped inside a booby trapped car, I wonder if the owner of the apartment purposely trapped the thief in the apartment with no food.",
        "The plot twist is that he’s the art piece.",
        "I though this trailer was of that movie of Williem Defoe's in Mr. Bean",
        "You guys should watch \"Trapped\" by Vikramaditya Motwane.",
        "A master at work",
        "Playback Time - a Carson Clay film.",
        "Willem Dafoe is up there with who I believe to be some of the best actors ever in Javier Bardem, Christopher Waltz, Joaquin Phoenix and Daniel Day Lewis so I’ve high hopes for this",
        "I’m gonna try to predict the final twist: the fact that this guy is trapped inside is some kind of performance art show. It’s basically Panic Room meets The Game.",
        "Casting director: \"Mr Defoe, you have played VanGogh. We have something similar in mind!\"",
        "Damn didn't know bo Burnham makes these kind of movies",
        "In other words don't steal from people, and second ",
        "\"Things work out best for those who make the best of how things work out.\" ---John Wooden",
        "This is clearly inspired by Bo Burnham's Inside. Even the thumbnail resembles it. Don't you try and deny it, you know it's the truth.",
        "MIDSOMMAR reference at 2:03",
        "isnt this on Mr. Bean ?",
        "Another Carson Clay cinematic masterpiece.",
        "You know i'm something of an artist myself...",
        "Where's Bo Burnham?",
        "Mini trailer before trailer lol",
        "I really hope he has the best support from the people around him during these roles. I can just imagine the mental scaring from the process of acting this way especially coming from The Lighthouse. We love you Dafoe.",
        "Norman Ozborune on a saturday... lol",
        "I thought it was playback time by Carson clay",
        "Alright so if the first thing he tries ISN’T smashing something heavy against the glass, then this movie is dumb.",
        "Open water",
        "I genuinely fear for this man’s life.",
        "I am so excited for this. lol it looks like a sequel to his movie in Mr Beans holiday",
        "Willem DaFoe in The oscars 2023 ?",
        "At the end of the movie, he finally gets out and a random passerby asks him what he's wearing.",
        "Finally the Joker arc we needed.",
        "They're currently 4.5 hours into the stream and have reached 88% of the goal amount.  Good on Charlie for caring and doing this for Lance and his family.  Looks like they'll make the goal easily. :'(",
        "Woooooooo let's gooooo",
        "Me hizo acordar a la película que él mismo promociona, dentro de la pelicula de mr bean jaja",
        "Little soon for an edgy Bo Burnham reboot, but it looks cool.",
        "Daffoenitely part of the WDCU",
        "I like this Trailer ",
        "Willem Dafoe will always be my DaFriend.",
        "DO YOU KNOW HOW MUCH IVE SACRIFICED?!? ...",
        "Now that he’s said it. Willem Dafoe does give off pigeon energy",
        "DRIP!",
        "good",
        "So this is what Osborn was dealing with while Green Goblin took over in Spiderman No Way Home",
        "this movie is very pandemic",
        "So..Scissors (Frank De Felitta, 1991) with Dafoe in the Sharon Stone role?",
        "I miss the free roam videos of yall doing random stuff",
        "FFS how come he hasn't won an Oscar yet??? This is beyond belief. Dafoe is one of the worlds best and yet so underrated. Give him that bloody Oscar!!",
        "The \"Green Goblin\" movie looking good",
        "Bo Burnham looks different",
        "The great actor Dafoe. Etern Sgt Elias.",
        "Most anticipated film of the year!",
        "Now this is epic.",
        "Bro I tought this was the William Dafoe movie on the Mr. Bean Movie ",
        "Another installement in the WDCCU: William Dafoe Crazy Cinematic Universe",
        "I appreciate the direct allusion to Defoe's character in Finding Nemo, another character trapped in a glass box that enlists the help of a friendly bird",
        "A 1 to 1 direct Hollywood remake of the Bo Burnham special is exactly what the world needed right now",
        "Interesting. Doesn't seem like the studio had faith in the film so they just revealed the who thing.",
        "I am all for it",
        "A little bit of everything all the time...",
        "all I see is green goblin without costume",
        "This movie looks brilliant and they got the perfect lead actor making it a must see",
        "You want to make it out on your own steam... I respect that...",
        "Dang",
        "Getting antichrist movie vibes, Willem Dafoe understood the assignment",
        "Inside the mind of the Green Goblin",
        "Amazing! l hope i get a chance to watch it..",
        "I am so ready for this",
        "I am sure this is how the \"Green Goblin\" started ",
        "Playback time",
        "Okay Focus, looks like a winner.",
        "This looks amazing",
        "lowkey reminds me of an indian movie I saw a review on called \"trapped\" but ngl this looks so much better",
        "Excellent! But is this a remake of ‘Trapped (2016)’ by any chance?",
        "William “Drip” Defoe",
        "The director of this movie is brilliant!",
        "Looks like it's back to formula for will",
        "Normal day in the life of dafoe",
        "This movie trailer is very similar to TRAPPED Indian movie",
        "With a title like that…….,",
        "1408 without ghost",
        "0:35 - Is that an Easter egg? Looks like the Moorish Idol (Gill) that Willem Dafoe voiced in Finding Nemo.",
        "\"Nothing, nothing....... nothing \"",
        "Wow! This looks amazing!! ",
        "On the way ahhh️️️",
        "I thought this was a followup to the Bo Burnham special.",
        "nothing nothing nothing......",
        "This must be what happened to Norman when he came to his own universe",
        "1:31 no pude evitar recordar un shitpost xd",
        "I don't get it. Where's Bo?",
        "bo burnham looks different here",
        "The cashier girl one is true. I saw probably the prettiest girl ever working as a subway worker.",
        "This is exciting",
        "0:03 \"Peter, let me outta here\"",
        "So what Bo did but without musical satire?",
        "This is like trapped by RAJKUMAR RAO but love this .",
        "Carson Clay Pictures presents Carson Clay in a Carson Clay Production of a Carson Clay film",
        "Dripfoe",
        "Cheap Hollywood snatched Willem now. Situational thriller. Let's put a guy in a...in this one situation and let's see what goes. Creative.",
        "Liked Trailer",
        "What’s the budget on this indie",
        "wow, trailer just gave us the whole story.  great, congrats",
        "Camman : sees the top of bamboo green.\nAlso camman:Thats a sign",
        "Looks amazing! Can’t wait to see this movie!",
        "I appreciate that every so often Harry goes down these insanely deep and specific rabbit holes and then passes the savings on to us.",
        "Now don't misunderstand me here. Willem Defoe is brilliant, and part of his brilliance, I think, was honed early on by his in-depth work with the Wooster Group. He allows huge theatricality in his performances without losing an iota of believability or tension. Few actors can achieve that level of performance. It draws you in to his incredibly complex psyche. The Lighthouse, for example. Asking another lesser actor to go those physical extremes would probably look just ridiculous, but not with Willem Defoe.",
        "Then he realized it was all just a dream\nIts....playback time\n\nA carson clay film",
        "So he is on sabbatical, I guess?",
        "?",
        "He must use all his cunning and Green Goblin instincts to survive.",
        "Not sure if this is a psychology or art film",
        "Ready to watch another Carson Clay Movie in a Carson Clay production of a Carson Clay film",
        "The Fish in aquarium foreshadowing WD as Gill in Finding Nemo and Finding Dory...hoping for the 3rd installmnt to show how the f@#$ they escape from the plastic bag",
        "Willem DeFoe. I saw Willem DeFoe on Saturday Night Live. He made many references to his own looks.  I was reminded of \"He was a funny looking guy.\" in Fargo \"You know, a funny looking guy.\" Comments refer to the looks of the Steve Buscemi.  Characters that Steve Buscemi inhabits step off the screen and into your life. Boardwalk Empire was America.",
        "Damn Bo Burnham’s looking old! but glad he’s still doing his thing…",
        "Is he dafiend or dafoe?",
        "Finally,the movie from Mr bean holiday",
        "I'm ready for a Dafoe psychological thriller",
        "Green Goblin!",
        "Im gonna try to predict the final twist: the fact that this guy is trapped inside is some kind of performance art show. Its basically Panic Room meets The Game.",
        "this is from mr bean right??",
        "Oh this is good",
        "Willem Dafoe is a really underrated actor. For me one of the best of all time no doubt about it.",
        "But why not break the window or burn the door. Feels like a loose premise",
        "Man Bo has really changed, excited for Welcome to the internet 2.0 though!",
        "Lol, I thought it was the movie from him in Mr. Bean movie ",
        "Is this a prequel for Playback Time?",
        "One of the best things is that he never takes credit for himself when he achieves something. He always respect us, the audience, and his team, and he is always polite in all of his videos. We congratulate ourselves on this achievement. More to come and everything to come >:(",
        "Islam has the answers to life's biggest questions .  I invite everyone to do some objective studying on Islam and it's sound beliefs.\n\nI also invite everyone to listen to the Quran on YouTube and read its translation. ",
        "This looks outstanding",
        "Whoa!  What a concept for a movie.  Perfectly casted!",
        "so Bo Burnhams Inside with a budget...",
        "At some point in this movie we will be seeing the Green Goblin personality take full hold",
        "Trapped in a million dollar space with your mind. Cool",
        "I thought this is Mr. Bean movie, you know which one",
        "this is the Joker film i wanna watch",
        "why does the thumbnail look like the movie inside of mr bean movie",
        "The premise looks interesting and Willem Defoe is a legend.",
        "The thumbnail reminds me of PLAYBACK TIME HAHAHAHAHA",
        "This man is a treasure, he can act with his shadow & still blow your mind.",
        "Maybe dont steal art",
        "You had me at Willem Dafoe.",
        "It's like a movie TRAPPED",
        "GUAU??!! impactante y interesante\n\nObra maestra",
        "Story copied from Bollywood Movie TRAPPED",
        "so william defoe continued his movie in Mr -Bean universe ...",
        "Ooooo looks interesting ",
        "this looks fucking fantastic",
        "Ah, yes, another installment in the Willem DeFoe slowly going insane cinematic universe! My favorite cinematic universe",
        "Whatever, way it is is lost and trapped is the worst combo.",
        "Where’s Wilson",
        "Might as well show the rest of the movie at this point.",
        "Serenity now, insanity later. This looks deliciously crazy. Can’t wait.",
        "Finding Nemo",
        "The story seems very similar to the Hindi movie TRAPPED!!",
        "Is it the continuation from The Mr Bean’s movie?",
        "This and The Lighthouse had me thinking: \"Clever solutions for a Director if their star is currently under \"house arrest.\"\"",
        "imagine how expensive it must be to own a penthouse big enough to house Willem Dafoe's chin",
        "They will literally make a movie about anything these days",
        "Back to formula!",
        "wait....his name is Nemo. and he eats a fish that looks like Gill.\n\nthis whole thing is one big Finding Nemo reference",
        "this Bo Burnham sequel looks like it gets a bit crazier",
        "Bruh, I thought this was that fake festival movie from Mr bean holiday movie lmao.",
        "I think this is the trailer from the movie he's in  from Mr. Bean's Holiday",
        "Is that the villain from the speed movie????\nomg i love his eels.",
        "Trailer started out looking like a pretty standard heist thriller, then just got steadily weirder and darker until it dipped into full-on surreal, visually stunning mindfuck. I really can't wait to see this one.",
        "Huh Bo Burnham looks a bit different here.",
        "Bo Burnham didn't age well",
        "I really clicked on this video thinking that they were taking Boburnams inside ",
        "So, this is what happened to the Green Goblin…",
        "Disturbing. I need to see it.",
        "when i see thumbnail for first time, i thought they were made \"Playback Time\" from Mr.Bean Holiday",
        "Reminds me of \"The Lighthouse.\" I love Dafoe but I don't enjoy these kinds of psychological torment movies. I want more of a story.",
        "I didn't know green goblin was in it!!",
        "This looks fantastic and quite original . I had to stop watching the trailer midway though, I don't want to know too much",
        "He's probably trapped in there for like 3 hours or something but goes all Willem Defoe very quickly. Gobbles up the fish after 10 mins.",
        "Can't believe Willem Dafoe is playing Bo Burnham!!!",
        "Willem Defoe's \"Welcome to the Internet\" was such a redefining song in this current era.",
        "My mind after watching the thumbnail : \"nothing, nothing.... nothing, nothing....\"",
        "Dafoe is one of the greats.",
        "Willem Dafoe is getting older the more good films he has been in.",
        "So they realeased the movie screened in the mr. Bean' holiday.",
        "Watching him again makes me feel so calm its like he was alive again with his cheerful content",
        "It is definitely the Cast Away of today. Omg this looks crazy I'm there for this!!",
        "Looking at the thumbnail I thought this was a parody trailer from that Mr. bean movie.",
        "I love isolation movies and this looks like it’ll be an interesting one. William Defoe just makes it that much more encouraging to watch.",
        "Looking at the thumbnail, I thought that the Mr bean parody movie of william dafoe got real.",
        "Van go steals art",
        "Let me guess the end of the movie you find out The Whole time he was the art for the rich ppl watching him",
        "The twist is: this is an experimental art piece by the individual whomst owns the house. Calling it.",
        "Finally a movie I would be interested in seeing.",
        "Spoiler: Dafoe's character, imprisoned in that apartment, is the art some super rich dude wants to keep on display.",
        "Reminds me of \"Oldboy\".",
        "Thought for a second that Robert would make a sudden appearance, \"Thomas, you dog!\"",
        "The Master Willem Dafoe? YEAH!",
        "Put Ephraim Winslow on this movie too",
        "Why did I think this was going to be something Bo burnham related ",
        "Thumbnail looks like an old Liam",
        "Bro did he just eat the type of Fish he played in Finding nemo??? If he did thats freakishly meta",
        "This looks horrifying",
        "this looks absolutely incredible and terrifying. I love that they've managed to create a sense of isolation in such a large apartment",
        "Willem Dafoe when he goes clinically insane IRL and nobody believes him",
        "Life is depressing enough.",
        "This movie look good as hell . I’m excited !",
        "This art is mine Winslow",
        "I actually want to see this movie. I love the trailer.",
        "Amazing can't wait to watch this.",
        "I saw holiday on it",
        "That doesn't look like every other movie I've seen.",
        "I like the competition between Focus and A24",
        "Why hasn't this man played The Joker yet??",
        "how crazy. I want to see!",
        "misery",
        "Is Willem Defoe the ultimate crazy person or what?\nWhy he isn’t the Joker yet is mind boggling!?",
        "Man, Bo Burnham has aged in the past year.",
        "I see no reason to support Hollywood.",
        "Jerma origin history",
        "I can already tell this movie is gonna make me puke from waves of anxiety.\n\nCan't wait.",
        "Damn Van Gogh wanting to steal art that's something new",
        "Ah, yes, another \"Willem Dafoe goes insane\" movie.",
        "Well, well\nLook who's inside again\nWent out to look for a reason to hide again\nWell, well",
        "amazing!",
        "Who's feeding the fish?",
        "Jesus, lockdown really had an impact on Bo. I heard it was bad but man he looks completely different wtf?",
        "From the shot of the cityscape and the tone set right off the bat, this looks like it'll be great to see on the big screen on opening night.",
        "Person in pandemic : i learned new language, fixed my car, meditated and reinvented myself. \n\nWhat they have actually done:",
        "I hope there's a giant piece of rolling flesh at the end of the movie.",
        "Nice so it's the green goblin but without spiderman",
        "this would be nice during period of covid",
        "Is this an inter dimensional version of the “Man vs Bee” series?",
        "Why does Willem always da foe, but not da friend? :(",
        "I just watched the whole movie in the trailer",
        "This is a weird Bo Burnham special",
        "This and Bo Burnham's Inside is easily the weirdest duology I've seen.",
        "This needs to be a series. Every Episode With Pewdiepie = EEWP&Gordon Nightmares",
        "This Isn't Bo Burnham, WTF?",
        "Carson Clay ",
        "Thumbnail reminds me of playback time from mr bean",
        "Shoutout to the people in chat who said Polo after everytime Smallant said Marco the Skarmorys name",
        "Focus makes the best movies! Vanity Fair 2004 did it for me! ️",
        "My goodness",
        "People like willem defoe and nicolas cage are their own cinematic universes",
        "This actually looks really good",
        "I didn’t expect the sequel to Bo Burnhams film to star Willem Dafoe.",
        "If I had told you a year ago I would be William DeFoe I would have told you thank you now leave me alone",
        "I’ve developed claustrophobia after watching this trailer ",
        "Plot twist: the door was unlocked the whole time",
        "I was really hoping this would be a parody of the Pixar movie",
        "Is this the sequel to Eternity's Gate?",
        "Does anyone remember (To Live and Die in LA).....early 80's",
        "1:22:30 I JUST LOVE KRATOS' \"WHAT?!\" \nIT'S HILARIOUS LMFAO :-(",
        "I didn't realise Bo Burnham changed So much ",
        "My god I love Willem Dafoe",
        "I currently do not have the stomach for this.",
        "I'm going to guess at the end of the movie it shows the art he makes in captivity being sold",
        "I tought it was that movie from Mr Bean",
        "Seems similar to Indian movie Trapped",
        "Funny Willem.",
        "So he's a cat?",
        "AVENGE ME!",
        "Does he has food in there, thats my only question tbh?",
        "it probably end by him evolving into another art collection of the host of that house who was watching him become that masterpiece that he collected",
        "The poster feels like the movie from mr. Beans Holiday",
        "“If you’d have told me a year ago that I’d be locked inside of my home”- Willem Dafoe, 2022",
        "One of the top 3 best actors of all time. On or off stage.",
        "Un actorazo sus innumerables peliculas ,y buen trabajo hacer querer ver siempre...",
        "Sounds like some screenwriter really wanted to justify his art major ",
        "This is the film equivalent of those art protests on climate crisis.",
        "I imagine this how an accountant feels like in their cubicle for the duration of their shift at work.",
        "Always an all seeing eye somewhere in these movies",
        "Bo Burnham taking some weird turns",
        "mr bean?",
        "0:03 when I SS Willem on my lockscreen",
        "He rocks it again! A genious!",
        "A perfect joker cast",
        "Viejo sabroso",
        "Wow",
        "i legit thought this was his film in Mr Bean's Holiday",
        "Amazing performance ",
        "Bo Burnham really let himself go",
        "Hey focus features I have an idea for a movie you can make. I hope i don't get hate on this comment. But can you make a autobiographical movie for Kevin Conroy A.K.A. the man who voiced Batman. And for some reason I think Michael C. Hall should play him. Because he sorta kinda sounds like him. And Michael C. Hall voiced Batman from an alternate universe. But yeah I think it would be cool to see a autobiographical film about how Kevin Conroy became/ voiced Batman. Again I hope I don't get hate on this comment.",
        "This with him is a must watch!",
        "I think this is inspired from trapped an Indian movie",
        "128 Hours",
        "Super excited to hear Willem Dafoe’s rendition of White Woman’s Instagram",
        "Drip lord got caught",
        "I want him to be my grandpa",
        "Willem Burnham: INSIDE",
        "I’ve noticed movies with trailers that tell the whole story tend to be very bad. I’ll wait till this is on for free somewhere.",
        "Isn't music art?",
        "Love Willem Defoe .  Definitely has my interest",
        "Intrigued.",
        "OMG!!!!!",
        "In fact! This is the Goblin movie!!!",
        "His name being Nemo and the fact that there's a scene in the trailer where he eats a tropical fish has to be intentional",
        "my boy CARSON CLAY is back since his debut in PLAYBACK TIME....   ",
        "God daaamn William Dahoe already drippin hard in the trailer,in the movie the drip gona be major",
        "Green Goblin's Origin",
        "looks like bo burnham will go crazy inside his own room again",
        "Looks like something Chuck Palahniuk would write.",
        "Willem Dafoe certainly knows how to portray every single one of his onscreen characters with gripping and escalating tension. Seems like there's no end to his acting. He just nails it without much difficulty on his part.",
        "Is this that movie that Mr.Bean watched on the last scene?",
        "It’s simple, I see Willem Dafoe, I watch",
        "this isnt bo burnham",
        "You know how much he sacrificed??",
        "Are they gonna show us the whole movie in the trailer?",
        "Wow - Bo Burnham's comedy special is getting a gritty Hollywood reboot!",
        "Mr. Bean approved ",
        "Looks good, but I feel like they’re giving too much away in this trailer.",
        "IScamSpeed, this stream changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience",
        "HELLLLPPPPP MEEEEEE! \nGET ME OUT OF HEEEERRREEEE! \nARRRRRGGUUUHGGHHH!",
        "IT WILL BE GREAT!\nI hope.",
        "Live-Action, Bo Burnham!",
        "Spiderman!!",
        "damn",
        "GODSPEED SPIDERMAN",
        "Why not just destroy all the art from the very start in order to force the owner to stop the punishment? Maybe he did. We'll see....",
        "It’s a shame this trailer is made in the way we can foresee the movie final\n\nFor me it looks like main character is not able to escape the place because it’s some kinda intrigue of the crazy owner (some rich artist or art collector) because he wants protagonist to accidentally create art in such unhealthy conditions. In the end owner probably frees protagonist and we get some nice shots of art he created ",
        "bo burnham’s career took an interesting left turn",
        "\"You know how much i'd sacrifice?\"",
        "Williams Defoe you  are awesome!! I have watched all your movies, sometimes more than once \nYou are on the top list of best actors  .. I read all reviews and comments \nMarch 10th…I will be there in the theater front row \nLove you lots.  To meet you is a dream of mine",
        "Stop with this actor, it's in too many movies!!",
        "DC needs to let William Defoe play Joker",
        "A Carson Clay Film.  Directed by Carson Clay.  Starring Carson Clay.  Executive Producer Carson Clay.",
        "Couldn't have named it anything else? Now I'm gonna have to specify which Inside is my favorite movie.",
        "and this is how you make a trailer.......",
        "This is actually the result of a pre-Goblin Norman getting stuck in one of his penthouses and having a bad day.",
        "Claustrophobic much??",
        "Fucked around and found out: the movie",
        "Is this part of the ICU? (Inside cinematic universe)",
        "I cant put into words how happy I am Mick stood up for himself. I remember reading the first Reddit post 2 years ago and being shocked at how many people bought in at an obvious smear attempt, Mick collecting receipts for 2 years was worth the wait in the end",
        "I though this one from Mr.Bean Movie..",
        "Well, this is a yes.",
        "So it’s like Castaway in a big house",
        "Willem Dafoe chooses to be in the most unique and interesting movies, and he ALWAYS delivers. Incredible actor, definitely giving this a watch",
        "William DeFoe didn't make the movie, The movie plot  is made for one and only William DeFoe.",
        "i will watch this just to see incredible acting of Willem Dripfoe",
        "I definitely wanna see more intimate movies.",
        "Damn Bo Burnham was right, there would be an Inside Cinematic Universe",
        "I am surprised to find out that A24 is not one of the producers of this movie!",
        "OHH MY GOD ... I LOVE WILLEM DAFOE !!! ",
        "This looks great, but honestly, Dafoe could read the phone book to me and I'd watch it.",
        "Looks intersting can't wait! But the thumbnail reminds me of Playback Time a Carson Clay fim staring Carson Clay",
        "is this a sequel or a remake to the netflix one?",
        "Ah yes, Jerma when he's not online",
        "Out am I?\nNo he isn't.",
        "Don't eat inocent  fish  , don't be a human animal.",
        "Playback Time A Carson Clay Film",
        "when does he start singing about being depressed",
        "is this a green goblin prequel or something",
        "Carson Clay back at it",
        "Give this man he's godamm Oscar already",
        "Welcome to another episode of \"YOU CAN'T DO THIS TO ME\"",
        "No one is mentioning the fish though. It’s his character in Finding Nemo.",
        "For a second I thought they made a full movie from Mr Bean where Willem Dafoe rides the escalator for 5 mins",
        "I thought this was a meme for a sec reposting that movie from mr. bean",
        "The first scene reminds me of Mr Bean's holiday",
        "I love how this trailer is put together so I thought I'd try to take a crack at what this might possibly about:\n0:08 Here we get the setting which is this particular building in the center of the screen.\n0:11 The radio audio is to either be the outside police trying to get into the locked building to capture the intruder OR it's the earpiece audio the intruder (the main character) is receiving for instructions for this art theft heist probably additionally symbolizing communication between the outside world.",
        "Boy this escalated.",
        "You know, I'm something of an art thief myself.",
        "But he is the art… oops, spoilers",
        "Someone is going to say this was life in the Pandemic and I'm going to live in fear knowing people really went insane for staying inside.",
        "Art is a wonderful thing to behold.",
        "Remake of 2016 Hindi Film 'Trapped' starring Rajkumar Rao",
        "This is inside out but without the out",
        "Remake of Trapped",
        "Omg this trailer is so anxiety Inducing ",
        "I believe the condo owner wanted to trap Nemo in there to watch him suffer.",
        "Answering the question of what is Cast Away in the upside down.",
        "A somewhat similar (locked in a soundproof safe room) theme to the foreign movie “The Hidden Face” (La cara oculta).",
        "I thought this was a parody of Bo Burnham",
        "Woah, Bo Burnham got old!",
        "I thought this was that Willem DeFoe movie at Mr. Bean movie ",
        "calling it, the guy who owns the penthouse locked him in there as an art project",
        "is this the movie from Mr Beans Holiday? Carson Clay, my idol.",
        "Dripfo back at it again",
        "The batman",
        "Willem Dafoe IS….. Bo Burnham",
        "How does this man not have an Oscar yet?",
        "Remember Mr Beans holiday, where Willem dafoe had a movie made on him?",
        "Looks like from mr. Bean movie",
        "This man looks trapped for months lol",
        "A Carson Clay Film, Directed by Carson Clay.",
        "Another movie with Willem Defoe going insane? Perfect!",
        "Not the goofy ahh sound effects",
        "Yeah, nobody goes to theaters anymore. Whose THIS chick? Never heard of her",
        "At first i thought this was from BEAN Movie",
        "We live in a world where William Dafoe does not have an Oscar. ",
        "Damn, Bo Burnham got old.",
        "What a terrible looking movie. William must be going broke",
        "Another actor who has never acted in anything worth watching .....",
        "Bo Burnham was INSANE in this, that decapitation scene?. Just wow, I heard it was improvised and the actor didn't even know they were gonna be decapitated which makes it even more amazing!",
        "Finally a movie that isn’t marvel garbage.",
        "Is this a dark twist on fucking Finding Nemo? Lmao",
        "This is the deleted scene from Mr Bean Holiday",
        "Probably what started Green Goblin's insanity",
        "Dafoe ",
        "When are we gonna get a Playback Time movie with Carson Clay!? I'VE BEEN WAITING 15 YEARS MAN!?!?",
        "Willem Dafoe lost my respect when he did that Van Gogh movie.  I really thought he would do a wonderful job,  I'm telling you, I did.  No serious actor would ever play the role he did with that script... it was an insult to Van Gogh, they made him look ignorant about his own faith.  Van Gogh was a Christian, and a minister, and in the film they just had lies and lies come out of Van Gogh's mouth about Jesus Christ... having Willem saying \"no one even knew Jesus existed until He died, and not one word was said about Him\".. that isn't true at all.  Jesus had people following Him by the thousands... There's literally testimony after testimony about it all over the New Testament.  Willem Dafoe should be ashamed, if he really cared about a character he played he would study what that person believed and who they were.. and dig deep, especially for an artist that impactful.  People didn't even know how famous an artist could be until Vincent Van Gogh... the most famous and influential artist who ever lived, and Willem didn't even bother studying what Van Gogh actually believed in.  Imagine being an actor who can put out any movie and it will be worth millions of dollars and you don't even bother studying someone like Van Gogh... let alone study Jesus Christ, the most influential person who ever lived! The person Van Gogh believed in!  How can you be that big of an actor and make that big of a mistake.. Just pure Hollywood pride and arrogance.  I don't care what you believe, if you were in a movie about Justin Bieber or Chance The Rapper would you have him say \"I don't know anything about Jesus\"? Of course not!  If you wanted it to be a good movie you'd open up a bible and find out what that influential artist believes in, especially if you're going to talk about it in the movie!",
        "music doesnt fade and music is art.. but nonetheless the movie looks interesting, specially because of willem dafoe",
        "When Goblin said \"Norman's on sabbatical, honey\"  this is where Norman be at ",
        "Inside the Goblin’s head.",
        "the little fishes",
        "I wanna watching him laugh... very insanely.",
        "Wow Bo Burnham has really aged",
        "the \"Willem DaFoe Masterclass\" continues!!!!!",
        "Daddy Dafoe has done it again ",
        "now where the hell is mr bean",
        "You've seen him stuck In a lighthouse now watch him stuck in a House house",
        "the cover reminds me Mr. bean's holiday",
        "Who's the director, man? You didn't mention him/her at all.",
        "I felt terrified for Willem Dafoe's character was trapped in the building of New York City with no way eles to escape.",
        "There was a fire fight!",
        "This is my type of movie!",
        "ayo\nits William da Foe",
        "Well well. Look who’s inside again.",
        "Willem Dafoe > Daniel Day Lewis",
        "Willem Dafoe is going crazy again!! He looks Soo funny!! Almost thought this was going to be the real Playback Time",
        "Goblin: Origins!",
        "carson clay in a carson clay production",
        "Willem DaFoe makes it an instant must watch. Can't wait for its release",
        "This is gonna stress me out.",
        "The thumbnail made me think they were making the Carson Clay movie something real lmao",
        "ready ",
        "Damn, whoever wrote this was clearly inspired by the pandemic. I know the movie's not out yet, but that's the vibe I'm getting. Looks great!",
        "Trough they turned the fake movie from mr bean holiday into a real movie",
        "I've been wanting the Willem Dafoe movie from the Wecond Mr.Bean film for soooo long. I'm glad it's finally coming.",
        "Plot twist: It was the Goblin all along",
        "Well well, look who's inside again",
        "Ya know, I’m something of an artist myself.",
        "So they finally made a full length movie of what @boburnham went through while creating INSIDE. I can't wait to see Willem Dafoe play the keyboard and sing!",
        "This was the same movie Mr. Bean watched",
        "Payback Time sequel?",
        "First a lighthouse, now a penthouse. Willem can’t catch a break.",
        "wow bo burnham aged well ngl",
        "Loved Williams performance in 12 minutes",
        "Love movies based on video games",
        "This massive apartment with no food…. Damn",
        "Green Goblin",
        "Literally me",
        "This guy always plays insane roles.",
        "Ok, I'm in",
        "I legit thought this was Defoe's movie from Mr Bean Holiday lolll",
        "Carson Clay in a Carson Clay film starring Carson Clay.\nWritten and directed by Carson Clay.\nExecutive Producer: Carson Clay",
        "Unrealistic.",
        "So glad Stephanie Wier is back making films as Willem again.",
        "Genre: Dafoe.",
        "Love the Finding Nemo Easter egg; the fish.",
        "I really really want to watch this",
        "This march! Jesus it doesn’t look that good to get all hyped about",
        "Went from making art as Van Gogh to stealing art",
        "Art is for kept . Peiole mind so bad",
        "IT'S A METAPHOR",
        "Damn, Bo Burnham was stuck inside for so long that he became Willem Dafoe",
        "Developer at Microsoft: wakes up one day\nHuh, the top and sides are different colours. This doesnt blend well. JACOOOOB!! Make the bamboo texture all the same color!\nJacob: Ok. No need to yell, just text me.",
        "His name is Nemo and the fish at 0:35 almost looks like his character in Finding Nemo. Nice.",
        "It's the INSIDE that matters :P HAHAHAHA OOPS",
        "There's a Hindi (Indian) film also made on some theme ; Trapped.",
        "Gotta say, Willem Dafoe is a bit of an odd choice to lead a Home Alone sequel.",
        "gee bo burnham looks different",
        "bo burnham looks older here...",
        "why is there always a stupid little trailer before the actual trailer\nplease\nstop",
        "In the order of Van Gogh perhaps?",
        "Lol I think if that were my house I'd feel for the guy",
        "I thought Mr. Bean destroyed this film.",
        "Its this the movie that appears in the mr bean movie",
        "Goblin.",
        "Willem Dafoe IS Bo Burnham",
        "Willem The Foe",
        "This could be a perfect Green Goblin: Origin with a twist",
        "This is just the prequel to Playback Time by Carson Clay, which was directed, produced, written, and acted by Carson Clay. A Masterpiece.",
        "He is soo good in the Florida project",
        "Rajkummar Rao and the entire team of Trapped would be happy seeing this",
        "interesting. hopefully they didn't leave any plot holes or obvious ways he could get the maid or maintenance or emergency services to check on the place. which matters more, not getting caught or surviving? he did have fire at some point.",
        "This movie seems inspired from a bollywood movie, Trapped 2016. Thats quite a watch.",
        "Welp. Huge brain broner.",
        "The thumbnail looks like it would be from that one movie in the Mr Bean movie where he's the director",
        "I thought this is new Mr.bean trailer during his travel to France",
        "Maybe I'm going mad but it seems like all these generic-sounding comments could have been written by bots? Even the witty ones.",
        "Looks fking amazing!  Love Willem!",
        "For a second i thought they were releasing the movie william was in in ' beans holiday '",
        "Willem Defoe in a Willem Defoe role",
        "You had me at Willem Dafoe",
        "The legend himself a hell yeah we going to see this ",
        "I still want to see the movie from Mr Bean's holiday",
        "He going for an Oscar i see.",
        "Home alone: extreme version",
        "It's the actor of green goblin Willem dafoe",
        "Art is for keeps",
        "Well, I feel like I just saw the whole movie. And Willem Dafoe was amazing.",
        "is this carson clay sequel?",
        "119th",
        "Damn this looks  great",
        "When Dafoe is in it, then you know it's going to be a good movie.",
        "Willem Dafoe vs covid 19.\n\nNice!",
        "Gill : Fish aren't meant to be in a box, kid. It does things to them.",
        "So many great movie projects nowadays are being ruined by being named stupid one word titles"
    ],
    "comments_disabled": false
}