{"video_id": "DVBdXXhQB3s", "comments": ["The irony that McDonald's was built by a milkshake machine salesman yet their milkshake machines are always broken is almost poetic.", "This was such an underrated movie, and I'm surprised it didn't win any awards.", "The Fillet-O-Fish wasn't created by Ray Croc, it was created by Louis Groen the Cincinnati McDonald's operator, Ray Croc wanted the \"Hula Burger\" which replaced the burger with pineapple there was a competition at the store who sold more and the fish won", "For a company that was all about speed and efficiency, it’s kinda weird that they dived into making pizza in the 80’s. Pizza can be made faster today, but back then it took a lot more time.", "I find it amazing how In 'N' Out has kept it simple to just hamburgers, fries, and milkshakes. It is what Mcdonald's would probably be if it had never changed anything about itself from its first restaurants.", "My father, Carl Eriksen, was Ray Kroc's personal assistant from 1966 to 1970. He is briefly mentioned in Kroc's book. I knew Ray Kroc and his wife Jane. (there was a short-lived experiment called \"Jane Dobbin's Pie Restaurant\") I was around when Ray divorced her for Joan (not Joanne as you say in this video). In 1970, my parents and I went to Hamburger University in Elk Grove, Illinois (west of Chicago). I was the youngest graduate at age 14! I still have the diploma. Kroc was supposed to help my parents start up their own franchise but somehow that deal did not materialize. I can personally vouch for the portrayal of Kroc in the film. He was a ruthless and angry man with a huge ego. When he bought the San Diego Padres baseball team, he got into trouble with the Commissioner of Baseball because he used the PA system to apologize to the fans for his team's poor performance in 1977. He was a control freak and everything had to go his way. He would often visit a McDonald's in his Rolls Royce and if there was trash in the parking lot he would personally pick it up and then berate the manager.", "“It’s better to have one great restaurant than 50 mediocre ones.” It’s so weird to hear that in a story about McDonald’s.", "Learning about the history of fast food restaurants is always fascinating, such a huge part of most of the lives in America and most people dont look deeper.", "I had to do a paper on this movie once. My favorite part has always been Ray Croc in his car, staring menacingly at a McDonald's from afar like a stalker.", "It seemed to gloss over the fact Kroc had exponentially more financial resources the brothers did. Knowing a CEO of Tasty Freeze  for one ... I'm sure the \" country club \" guys had names too.\nMore a\" rich taking from hard working folks and getting richer\" story, than a \"pulled up by boot straps\" story.", "I remembered watching this movie with my dad. When they did the montage of new restaurants opening up in the Midwest, he was surprised to see his hometown as the home of the first Mc D’s in the state.", "A point you didn't bring up but I love (I believe it's both in the movie and has been corroborated in real life): who Kroc franchised to. It's true, he started by getting some of his wealthy friends to open their own McDonald's, but those locations did suffer. The franchisees were in it to sit back and make money, nothing more and the quality suffered because of that. ", "Does anyone else get unreasonably excited whenever there’s another History Buffs video out? ", "Before they owned a restaurant, the McDonald brothers had a theater and a hot dog stand. In 1930, with whatever money they had scraped together, they purchased a 750-seat movie theater 20 miles outside Los Angeles in Glendora, calling it the Beacon Theatre. But this being the Great Depression, it did poorly. They noticed that kids seemed to always have enough money for food like burgers and soda. So with a $5,000 loan, the McDonald brothers started the Airdrome hot dog stand in 1937 by an airfield in Monrovia, calling it The Airdome, and they targeted spectators who were watching the planes. This was a success, but they predicted that in the future, they'd need to appeal to cars. So they moved to San Bernardino, changed the name to McDonald's, and the rest is history.", "This is one of my most favorite films. It may be \"off the beaten path\" unlike the super-popular films that everyone knows, but it's written well and tells a great story.", "Ray Kroc was a SOB and that’s why he was so successful. One thing you can be sure about in life; shit always floats to the top. I loved your review. I always look forward to a new episode of History Buffs.", "Nick, you knocked another one out of the park. This was excellent.", "When you get your first acting job after working at McDonalds for 5 years and then you play a McDonalds worker ", "When I was in rehab for addiction they played us this movie as an example that no matter where we were in life we could always recover and build great success. The next day they played 'What about Bob?' ", "This is insane. Wanted to watch this movie for a long time. Finally did just a week ago! Love new History Buff videos and especially since I am prepared for this one! Thank you so much for your work", "I really enjoyed that movie, the story was just heartbreaking so I'm happy that you're making an episode about it. I also love mid 20th century Americana and something about retro McDonald's is so cool", "This is easily my favourite channel on youtube. I wish there were more videos coming out, but I understand the amount of work that goes into each one.", "I am glad you are covering different movies (such as this one) and not just the most known historical ones.", "1:34 I’d argue that he revolutionized restaurants on a global scale considering how big a lot of these franchises are globally", "He actually did a handshake deal like in the movie with an ice cream supplier, who later sued McD and I think settled out of court for millions, so he was known to make deals like that and to break them.", "I love this movie a lot. Whenever I bring home some McDonalds, always watch some clips of it and pay my respects to the great man who gave us our blessed gifts.", "This movie makes me hungry for Wendy’s. I also love how the running joke now is that the milkshake machine never works at a McDonald’s restaurant.", "The casting was incredible. I had no idea how close the Brothers looked like that. 3:50", "Excellent work, as always, Nick! ", "This is actually a great movie, and it really shows Ray Kroc as the slime ball he really was", "My dad disputed with me that McDonalds first restaurant was in Des Plaines Illinois I told him that’s a lie created by Ray Kroc and the real one was in Cali….needless to say he said “That’s a load of Kroc”", "I really appreciate the efforts you put in your videos", "I love when a video like this comes out because it means I don't have to waste my time watching what is essentially a mcdonalds propoganda piece but I still get to hear and learn about the real history!", "I grew up in Devon in the 1970s. My mum was from London, my dad was Irish. My mum's mum, my grandmother used to come and visit us in the summer and I remember her telling me about McDonalds and how it was like INSTANT cooked food that was really tasty. I think I first tried one when I was ten. She said \"Its all the new thing. Fast food.\" I kind of imagined chefs on roller skates hahahaha", "16:11 \"...wanted to create food of consistently high quality\" I remember going to McDonald's in 1968 with my family and no one expected high quality anything", "Always impressive work! Eventually you should do one for JFK (1991) and Thriteen Days (2000)", "Great flick. Thanks for covering this.  Always loved your channel. Never change.", "Good to see you're not just doing historical war films but it looks any kind of history film with this channel, keep it up.", "Ray Kroc also knew Walt Disney the creator of Disney and was close friends with him as they both served in the same ambulance corps as ambulance drivers during ww1 which was when they met.", "I was born and raised in San Bernardino. My aunt worked at the first Mc Donald's as a car hop and my mom worked at the one across the street years later. Fun fact: The site of the original is a parking lot and the one across the street is a Mc Donald's museum.", "This is a surprise but a welcome one nonetheless. The Founder is one of my favorite movies honestly.", "It’s always a good day when a new History Buffs drops!", "Joyeux noel would be a great one. So much there that really is incredible. Like a British soldier meeting his german barber in no mans land", "I liked \"The Founder\".  It was directed by the same guy who did \"Saving Mr. Banks\", another period piece that's a look behind the curtain of a beloved product, in that case, the film \"Mary Poppins\".  Interestingly, both movies had BJ Novak, playing Harry Sonneborn and Robert Sherman, respectively.", "More videos!\n\n\nI would literally watch anything you put up. I don't care if it's a movie review of chick flicks. Actually that would be kind of funny.", "As always great work, Nick. For your next video I recommend you review Cromwell (1970).", "Neil Jordan's 1996 Biopic of Michael Collins starring Liam Neeson would be a great video topic. So much context to go over, not to mention how he died 100 years ago this past August", "An impressive examination of a piece of history I didn’t know about until I saw the movie.  I tip my hat to History Buffs and I am looking forward to what’s next.  I am hoping “Elvis” or “Black Hawk Down”.", "Underrated movie. 'McDonalds: The Movie' was excellent and overall, for a Hollywood movie, they did good job balancing this where Crok is no hero but he's not a bad guy either. Neither were the McDonald brothers heroes or villains. It was legit fascinating to see what became a massive cultural phenom, the quirky things, the biggest moves dared and the whole thing was very very well done", "Seeing this come up on my feed made me smile.  Always ready for a new History Buffs vid.  One of my favorite channels", "Nick drops a fresh episode and my attention is locked. Keep it up, homie!", "Wasn't expecting a video on this movie but I'm glad he made it.", "Half in the Bag and History Buffs in the same day?? Must be heaven", "Another awesome review!!! Can’t wait for the next one \nMy choices would be either Lincoln, or 1917. Both excellent movies set in fascinating times in history.", "Wow, what a good episode! I enjoyed the movie, as an American born in 1982, McDonald’s is something very important to me.", "Mark Knopfler wrote a song about Ray Krok and McDonalds called Boom, Like That which is basically the entire story of the Founder, I always thought it odd that it didn't play in the end credits of the movie.", "Awesome stuff! Always wondered how true this account of Ray Kroc was.\n\nI would humbly request you do Chernobyl (HBO) next!", "This was such a great movie. Keaton’s performance was superb, as were Nick Offerman and John Caroll Lynch as the brothers. Heart breaking scenes near the end.", "Great content like always!! Hey Nick...Have you ever thought about an International History Buffs movie reviews? There are lots of historical movies out there which aren't necessarly made in Hollywood and have lots of efforts and love in their making. It could help people extend their knowledge and their attention towards a wider selection of historical movies.", "actually cried a tear at this one. cinematic masterpiece papa", "To be honest this is one of my favorite films of all time and for sure shows the dimmer side of McDonald's aside from being a mega corporation.", "History Buffs is my happy place.  I get as giddy as a school kid on Christmas when a new episode drops.", "You forgot to mention the scene where the brothers put a voodoo curse on every restaurant so their ice cream machines are always broken", "Nick you pop back into my life when i least expect it, and i LOVE IT!", "Haven't watched the video yet but I'm really thrilled. I really liked Michael Keaton in this so I hope it will hold up at least somewhat.", "Since I LOVE BigMacs, I'm siding with Ray Kroc on this one. But nonetheless, it's truly an amazing story for a brand like this; growing up as some 'common' burger restaurant to becoming global recognizeable brand - it's no easy feat.", "\"Life is not about finding yourself. Life is about creating yourself.\" -Lolly Daskal", "Always a delight when history buffs uploads", "History Buffs understands that it’s better to have one great video than 50 mediocre ones.", "I would like to see a movie about Dave Thomas, the founder of Wendy’s. I read his biography. Great story.", "I'm glad you can still make shorter but still detailed videos", "I can't help but notice a pattern in these stories. It starts out with a pair of partners/co-founders: one does the business and the other is the creative mind. The idea takes off and becomes a booming success. However, one of the partners eventually betrays the other and seizes full control of the company. More often than not, it's the buisnessman screwing over the creative mind/s. For example: Jobs and Woz, and here with Kroc and the McDonalds brothers. I think one of the only times it was the other way around was when Mark Zuckerberg cut Eduardo Saverin from Facebook.", "The founding of McDonald's is a uniquely American story, it's the story of one man's ambition and the people he has to step on to get to the top", "I met a couple of McDonald's Franchise owners on vacation and they told me that McDonald's required them to work every station until they were relatively skilled then they had to meet the other local franchisee's and be approved.", "So happy to see another video! Keep up the quality work Nick. I was wondering if you could do a historical analysis of the movie “The lost city of Z” the story of Percy Fawcett’s expedition is fascinating, would love to see if you could check it out!", "This one of those movies that I could watch and watch again. Most people I know found it boring but I found it very interesting.", "Ive been to the mcdonalds in peru and i can tell you it tastes identical, its insane how controlled the taste is, i love it!", "I love how wonderful all of these videos are :)", "Can we just appreciate the effort he puts into us like seriously i can feel him coming inside me", "I remember watching this film during my Government Civics class in high school, the acting was amazing.", "We missed you, Nick!\nAlways a good day when you release a new video.", "It is a testament to his ego that most if not all McDonald's have a plaque with Ray's version of the story on display.", "Ray Croc is the definition of, \"Let the strong survive\"\nIt's funny how no matter how developed we become the laws of nature still rule the human domain of business", "I loved the video, and I'm happy to see you upload! I hope you're doing well and I'm looking forward to the next video!", "Just sharing a fact: McDonald's is not all about the fast food business. It's main focus is real estate through the franchising model. The fast food chain provides the location, and franchisees will develop the location of the area through the use of marketing (billboards, etc). It is even in the film itself, that's just pure genius.", "The game really did pull a massive callback to the first jumpscare in the first chapter with the same exact line of dialogue as well", "After a long day - we had the first snow of the season and no one remembers how to drive - to come home and find there's a new History Buffs video months before I expected the next one? Thank you Nick, thank you. ", "Ray Kroc reminds of something a business man once said, \"You can make friends and you can make money, but you can't at the same time.\" I don't agree with that but others do.", "In my walk of life I have known a few business men and women most of whom were a bit “shrewd” for lack of a better term. I do believe that money is the root of all evil and has the tendency to “change” people. Granted this is not always the case I understand that. This would be an interesting movie to watch as a couple of my favorite actors are in it and it has the advantage of having some history in it. My best to y’all and thanks for another video Mr. Hodges!", "Fantastic video! I always love watching your content.", "I enjoyed this movie.  love to see history buffs covering it", "Great review as always. I liked the movie but it bombed at the box office. I've requested this before and I guess I'll keep doing it , lol. I would love to see a review of \"Boardwalk Empire \"! It shows the beginning of organized crime and the American mafia. Thanks Nick!", "you should tell the whole story of how the filet o fish came to be - very interesting", "I remember when McDonalds opened in Red Square.  Possibly the most striking symbol of Glasnost ever.", "Great job Nick!  You should review Black Hawk Down next.  I'd love to learn more about the Battle of Mogadishu. It's a great film as well in its depiction of urban combat.", "I’m so glad you made this video, I saw the founder awhile ago and I still crave more knowledge about it! ", "There is a documentary called “The real Founders” that came out after this movie and tells the story from the brothers point of view.\n\nI highly recommend watching it after this, it was free on Amazon prime when I saw it", "hi nick, ive been a subscriber since 2019, you have been with me through thick & thin. i really appreciate your hard work & the dedication that you put into your videos. thank you for what you do. i hope you get to read this, i would appreciated if you reply back. much respect.", "This channel is so good I find myself watching movies just to be able to follow the videos!!!", "I am still hoping that you'll consider doing a video on Fear and Loathing in Las Vegas , as despite its oddball exterior, both HST's book and Gilliam's film make for a solid period piece about the 1970s counter-culture - both its joys and its ills - and how it contrasted with Las Vegas' mix of Hollywood Glamour and Middle American wish fulfillment."]}