{
    "video_id": "DVBdXXhQB3s",
    "comments": [
        "  Ready for the next one!",
        "I simply love this channel",
        " promosm",
        "Ray Crook",
        "Great job, Nick. I thoroughly enjoyed The Founder and how it told the McDonald's story. I realize you don't usually cover this in your presentation, but the casting in this movie was, in my opinion, the aspect that pushed it over the top. Thanks for all you do...",
        "Listen…I grew up in San Diego and absolutely love the Padres.  I am grateful for him rescuing the Pads…but he was a despicable person and a liar.  I have to admit that when the McDonalds opened in my town I interviewed with the.  Turns out I wasn’t McDonald’s material.  Not that I’m bitter…",
        "He is Not the Real McDonald's franchise he stole the recipe from the Real McDonald's brothers and they went to court saw the Movie ",
        "So glad to see a new one! I do prefer the older kind of videos (and especially theme music) but you're not one who's so departed from what I came for that I want to leave yet.",
        "Funny enough out of country McDonald's don't have exactly the same standards as American McDonald's, for instance some McDonald's in Europe gave you the option of having a gluten free bun for people with sceleack disease. Surprisingly enough the bun was actually good.",
        "Watching this film I was thinking how the Ferengi, uber-capitalist aliens from Star Trek, would love it.",
        "I was just about to go and watch this movie and low and behold, history buffs!",
        "Having wrkd at a McDonald's for over 4yrs I can say Crocks touch is very much alive. Built into the culture of McDonald's",
        "Omg, love it when you post your videos. Always a pleasant suprize",
        "happy to have another video, and so soon. It'll take me a while to get used to the new theme music though XD",
        "review Munich",
        "Ray Kroc's wife was not Jo Anne. It was Joan, and she was a huge public figure in San Diego after Ray's death, particularly because of her philanthropy. C'mon man, I expect better research from you. Get the names right!",
        "Even with him being an incredible monster, not wanting your x wife to be involved in the company he was and will be a part of indefinitely. He gave things like hard assets with real value and by giving her the house, allowed her to not be uprooted. This is not at all “morally dubious”. Only in The last 50 years, and in the Western Hemisphere could a man say “I earned all this money, and it has allowed you to live very very comfortably. That is a perk of being married to someone constantly working. I understand you don’t like this, and would like to divorce. Essentially you are saying you like the money but hate how much I have to work to get it. Id like to make sure you are comfortable so you keep the house I bought, the car I bought, retirement package…etc etc.Since you are leaving me I assume you will be seeking someone very different than me, so you can be happy.”",
        "great episode as usual. thank you.",
        "Can we please get the pacific please, you already did Band of Brothers and the pacific has some amazing storylines to follow including John Basilone.",
        "Leasing the land sucks so bad for the consumer, so many remodels that make the restaurant uglier! Franchisee owners should have more power. My McDonalds only has one set of public doors now!",
        "The best way to describe Ray Kroc, pure effing hubris.",
        "Another great video Nick, but question: Who are these \"McDonalds\" brothers you keep referring to? Are they somehow  related to the McDonald brothers you briefly mentioned at the beginning of the video?",
        "The McDonald brothers founded the McDonald's restaurant and the McDonald's franchise.\nRay Kroc founded the McDonald's real estate.",
        "We missed you, Nick!\nAlways a good day when you release a new video.",
        "I grew up 2 blocks up from the location of the first McDonald's in San bernardino.  It's now a little McDonald's museum with all kinds of cool memorabilia.",
        "Please review 1917 when you have time, thank you.",
        "Please please please a video on Oliver Stone’s JFK! That would be incredible!",
        "Thanks Nick... Keepem coming",
        "Excellent entry, as always.",
        "As someone who was raised off baseline, I do have an immense pride for San Bernardino and San Bernardino county. It's crazy, the origins of Mcdonald's and Taco Bell are in San Bernardino and both franchises became what they are today by essentially appropriating hard-working SB restaurants; in Taco Bell's case a restaurant called Mitla Cafe that's still open. Even though Dino is a dump I'm glad my city/county is getting some love and recognition",
        "Dick Mac sounds about right",
        "A point you didn't bring up but I love (I believe it's both in the movie and has been corroborated in real life): who Kroc franchised to. It's true, he started by getting some of his wealthy friends to open their own McDonald's, but those locations did suffer. The franchisees were in it to sit back and make money, nothing more and the quality suffered because of that. So what did he do? Instead of franchising to rich yuppies who couldn't give a rats ass if the location flourished or not and could move on to their next project, he franchised to middle class people. Blue collar people. People who didn't have a ton of money who could care about their restaurants because they were their babies.",
        "The recent make of All Quite on the Western Front on Netflix was amazing and bleak and might be worth looking at for your next piece. There are some inaccuracies that some have pointed out, but it doesn't take away from the experience.",
        "Great as always,i actualy only came across the movie afew months ago and watched it for the first time.",
        "I really would have loved to try them fast food burgers that the two brothers engineered before it became a franchise.",
        "I’m so hyped History Buffs",
        "Muh dude nick hodges is back. YAH BOI.",
        "Didnt ray get rid of that speedy system?",
        "Thumbs up",
        "I had to do a paper on this movie once. My favorite part has always been Ray Croc in his car, staring menacingly at a McDonald's from afar like a stalker.",
        "Ray Crock was a crook.",
        "awesome vid like always but I like the old intro. bring it back.",
        "DO 13 hours",
        "Glad to see this movie getting a review. It’s a pretty good movie",
        "I have a suggestion...\n'Into The Wild'?",
        "It's interesting you bring up the meaning behind the title, because it was originally titled FOUNDER, not THE FOUNDER.  And the reason for this original title was that it was also supposed to represent the idea of a ship or some large object \"foundering,\" as in unsteady, and ready to tip over.  I don't know why they switch the name.  Maybe that original idea was too cerebral and confusing.",
        "YouTube: History buffs posted 23hrs ago..\nMe: HOLY FUCKING SHIT!!!!!!!\nHOLY FUCKING SHIT!!!!!!! HOLY FUCKING SHIT!!!!!!! HOLY FUCKING SHIT!!!!!!!",
        "Inconsistent quality is the biggest problem with McDonald’s for the past twenty years. Visiting one in Canada or Hawaii will ruin you for the ones back home. The quality is night and day.",
        "I’m from San Bernardino, it went very down hill. A lot of gang violence and drug/homeless problems",
        "I have missed your videos Nick! Love your show!",
        "Nick have you heard of The Spy with Sacha Baron Cohen I think you'll like it upon doing research",
        "I assume that the first burgers was better. I feel like most hamburgers I eat at MacDonald's today make me a little sick consistently.",
        "Sad to see the McDonald's brothers cheated out of their money by Ray, they could have hired a better lawyer or a hitman to take him out. When you give someone your word and a handshake and then don't follow thru that shows what a sorry human being you are. Lost all my respect for the Croc's.",
        "HISTORY BUFFS IS BACK!",
        "The Fouader?",
        "Yaaaay",
        "Would love for you to review the movie Nuremberg(2000) to see how quickly how annoyed you will be with the inaccuracies",
        "People forget that Kroc saw Californians as wanting customization and therefore an inconsistent menu would happen. But by opening the Midwest, you get employees from a culture that does not like to rock the boat. And he even said so. Illinois also had Route 66 and was a popular gateway when the US Highway System built that took people out west.",
        "I was born in San Bernardino. One of the oldest Restaurants of McDonald's is still standing even though not operational. Just there for the sight.",
        "Can you please do Black Hawk Down or 55 days at Peking?",
        "HES BACK LETS GOOOO",
        "Now mcdonalds no longer sells shakes cause its alawys broken",
        "Babe wake up, new History Buffs video dropped",
        "The irony that McDonald's was built by a milkshake machine salesman yet their milkshake machines are always broken is almost poetic.",
        "I couldn't get over how similar one of the brothers looked to the Zodiac killer",
        "McDonald’s should’ve sponsored this video ",
        "Be cool do video of 1917 , war horse  and 9ther ww1 movies plz",
        "So thay really happened that man stole their business damn",
        "Do the Alamo movie next, from 2004",
        "Everytime he said neonarches, I heard neo-nazis.",
        "He’s basically Steve Jobs of burgers",
        "History Buff should do 'one video one topic'\nOr it gets less interesting with each video.",
        "I've always thought that movie was a bit underappreciated, Keaton did great in it and it was very informative even if there were some minor inaccuracies.",
        "And now, most of the new McDonald’s are being built with the original design elements back in, with the neon arches on either side of the building. And a lot of of the old ones are getting remodeled.",
        "Having worked in a middling status fast food restaurant I'm mortally terrified of what it would be like to work in a fully engaged one. Those procedures we never followed... all in place. Gross.\nThe average one of these places runs entirely differently, 3 to 5 fewer staff, hopping around doing other people's jobs when it's useful, odd tasks that need to be completed. ",
        "Please do Chernobyl",
        "“Then tell them to go some where that offers fried chicken”\nMcDonalds: well actually…",
        "McDonald's is the nastiest fast \"food\" on the planet. Why people still eat it is beyond me. My guess is population control. \n\nIt was decent before the 2000's, then the food quality was abysmal. Ick.",
        "Can we focus on history that's not so related to reconstituted human waste in burger form please?",
        "Your back you ledge",
        "Fun fact: my old boss in Detroit had a father who he was 100% sure was in the mafia. His mob dad BOUGHT one of these first ever McDonald's. His wife told him, \"Americans will always eat hotdogs over hamburgers.\" He sold it, and regularly reminded her that it was her idea.",
        "How about the next video you should make be Hotel Rwanda.",
        "\"people want burgers fries and soda\" \n\nme who pauses and looks at my quarter pounder, large fries and sprite ",
        "I still find it crazy that the second McDonald's to have opened was in my state of Arizona, but all the way in Phoenix.",
        "i've been to both the monrovia and san bernardino locations, it's surreal seeing a story about my own southern california being discussed here",
        "He was as much the founder of McDonalds as Elon Musk is the \"founder\" of PayPal or Tesla",
        "Wasn't expecting a video on this movie but I'm glad he made it.",
        "Been watching history buff since the Zulu episode which every body must watch now I’m 18 an I plan to become a history teacher after military service and my want to do this came from this channel history buff  thank you man",
        "Now I feel like having McDonald's",
        "Lol I live in Dayton ohio and we have the \"Kroc center\" here.",
        "They gave a company to people who worked the drive thru for 7 years. Imagine if that happened now",
        "1000",
        "Please make a video analysis on Pentagon Wars.",
        "I'm actually kind of glad that their wasn't as much animosity between the brothers and Ray as the movie implied.",
        "Oh wow I suggested this to the history buff channel!!!! Lol! Yes you are listening to the comments",
        "Love the video. Wonder if you can review the historical accuracy of The Woman King",
        "Thanks for for putting the sponsor break at the end. You're the real MVGOAT",
        "Always a delight when history buffs uploads",
        "hey how about doing a video on the Sex Pistols mini series PISTOL??",
        "Could you do the Outlaw King",
        "This channel is so good that I enjoy the videos on topics that I feel I am not interested in. Turns out I just am a sucker for well presented history",
        "What do you think about Rush as a candidate for a video? Great movie with a lot of potential. :)",
        "TIL the so called founder of McDonalds is as much a founder of McDonalds as Musk founded Tesla.",
        "I smash the like button before the video even starts. Damn I love this channel.",
        "This is one of my most favorite films. It may be \"off the beaten path\" unlike the super-popular films that everyone knows, but it's written well and tells a great story.",
        "Babe wake up, new History Buffs!",
        "We need Chernobyl episode! ",
        "You Begin To See how People With the Name Ray Are A Cut Above The Rest.",
        "Please do an episode on 'The Woman King' and the Agoji Warriors of Dahomey.",
        "Got a suggestion here Pancho villa 1972",
        "It seemed to gloss over the fact Kroc had exponentially more financial resources the brothers did. Knowing a CEO of Tasty Freeze  for one ... I'm sure the \" country club \" guys had names too.\nMore a\" rich taking from hard working folks and getting richer\" story, than a \"pulled up by boot straps\" story.",
        "In an alternate universe, McDonald’s called their Big Mac the Big Dick",
        "Well, this was a good movie. The main takeaway: \"persistence\".",
        "OMG its a video that isnt about Narcos! Fuck ya!",
        "I am still hoping that you'll consider doing a video on Fear and Loathing in Las Vegas , as despite its oddball exterior, both HST's book and Gilliam's film make for a solid period piece about the 1970s counter-culture - both its joys and its ills - and how it contrasted with Las Vegas' mix of Hollywood Glamour and Middle American wish fulfillment.",
        "My god he was an awful man who had an eye for business. Kroc looks and thinks like a croc",
        "I love this movie a lot. Whenever I bring home some McDonalds, always watch some clips of it and pay my respects to the great man who gave us our blessed gifts.",
        "Most boring title ever",
        "Could you do The King starring Timothee Chalomet? Also The New World starring Colin Ferrell?",
        "Ray Croc is the definition of, \"Let the strong survive\"\nIt's funny how no matter how developed we become the laws of nature still rule the human domain of business",
        "Please do Joyeux Noel. I legit want to learn as much as possible about the real life Christmas Truce.",
        "Eat at a McDonald's in Italy or France and you quickly realize that the food quality is NOT the same across McDonald's.  EVERYTHING tastes better in Italy and France and the food is most definetely better quality.",
        "I kinda think the original neon arches looks better than the current double arches.",
        "The Report from 2019 is a video I know he’s working on or at least I hope.",
        "Hi Nick, love every episode of the show! Could you review 'Alive'?",
        "Does this new upload mean that History Buffs will be uploading new videos monthly or so? Because I love this channel’s work ",
        "Great job.",
        "There's actually an arch building McDonald's location that was built in the early 2000s in mississauga Ontario Canada",
        "This movie makes me hungry for Wendy’s. I also love how the running joke now is that the milkshake machine never works at a McDonald’s restaurant.",
        "Lol I work in Des Plaines and the original McDonald's is still there but empty.  There's another next to it though.",
        "They must still be using this decades old milkshake machine. No wonder it's always broken.",
        "Unfortunately most fast food places are so bloated nowadays that your waiting 5 min or more in a drive though, smaller menus would help a ton with moving people though them",
        "Good vid",
        "You should make a video about the Elvis movie!",
        "This was quite a surprise! I usually associate HB with more (ahem!) \"prestigious\" topics - never expected to see this film and its topic covered!",
        "Go in McDonalds now and how many milkshakes can they make at once?  They need to go back to 5 spindle machines.",
        "You should do a vid about Greyhound with Tom hanks. The battle of the Atlantic is a super interesting subject",
        "you should do an analysis of For All Mankind, not history but good alt history",
        "I drove past the McDonald's in Des Plaines every day for 10 years. I never ate there. Like all McDonald's. Why does anyone eat that food. Stop that, it's gross and you know it.",
        "Today's Mcdonald's are an absolute abomination. The meat is almost a millimeter thick and their service is slow af.",
        "He has returned !!!!!!! ",
        "wtf",
        "More videos!\n\n\nI would literally watch anything you put up. I don't care if it's a movie review of chick flicks. Actually that would be kind of funny.",
        "And yet still no one realizes that McD's is one of the largest real estate companies in the world.....",
        "I think this has been taken off prime now, I completely forgot to finish it...",
        "I was born and raised in San Bernardino. My aunt worked at the first Mc Donald's as a car hop and my mom worked at the one across the street years later. Fun fact: The site of the original is a parking lot and the one across the street is a Mc Donald's museum.",
        "I really appreciate the efforts you put in your videos",
        "nice",
        "This one was great. Excellent work man.",
        "McDonalds, a fancy name for cardboard with cheese ",
        "What a coincidence, I just rewatched this last night!",
        "I gave a thumbs up, but this story is completely uninteresting. Make war movies, historical movies.",
        "Man watch this video and then Bohemian Rhapsody two parter is like night and day in terms of historical accuracy.",
        "How about  A Knights Tale",
        "Fantastic video! I always love watching your content.",
        "hey nick. What about all quiet in the west for the next ;)",
        "Please please PLEASE correct the audio. You mispronounced \"debuted\" SO HARD",
        "Glad you did one of my favorite movies.",
        "Hold up\n\nDick and Mac owned the first McDonald's, so when people say McDicks, they are correct???",
        "I'm not gonna lie this story made me kinda hate McDonald's he basically takes everything the brothers worked for stole it got rich and is now praised for it...it highlights some of the most sociopathic things about our culture maybe that was the point but left a really bad taste in my mouth...this movie is everything wrong with American society distilled.",
        "so shady ice cream machine",
        "Fun fact the Downy McDonald’s has a McDonald’s museum next to it.",
        "MCdonalds used to have this certain smell....  a hint of cleaning product, but their french fries and burgers smell that let you know that you were at a mcdonalds....  the dsounds of the beeping fryers, the 12 cashiers with thoose flat silver register's. Yellow plastic straws, the big breakfast, hot caskes and saussage. IT tasted good and was real food. Unlike the frankenfood we eat today.",
        "I live by san bernadino its crazy to think McDonald's came out of there considering how mfs gutter it is but it was a different time back then",
        "this is a story of the beginning of the obesity epidemic here in the united states",
        "\"only gave her the car, the house and the insurance policy\"\n\nThat's a lot, it's not Amazon or windows divorce level, but a house isn't a small thing",
        "Personally I prefer the old intro, the new one is alright but doesn’t hold a candle to the old one ️",
        "All the McDonald's in my area are owned by the same family and they profit .06 cents on every dollar they bring in.",
        "I gotta say tho... Hearing Ron Swanson's voice and not seeing the moustache on the face it's coming out of is... Unsettling.",
        "16:48  Ah yes, the same.... \"quality.\" ",
        "I wish someone would make a restaurant chain that is McDonald's original menu, with fresh cut fries, milk and ice cream shakes, and raw beef patties. I guess it wouldn't be economical and most people wouldn't be willing to pay what it would cost.",
        "He actually did a handshake deal like in the movie with an ice cream supplier, who later sued McD and I think settled out of court for millions, so he was known to make deals like that and to break them.",
        "I always think it's funny how pissed people get when this dude gets brought up. \"HE STOLE IT\" lmao",
        "just think about how many people have had heart attacks thanks to this man alone. His death count has to be up there with Hitler and Stalin at this point.",
        "The man, the myth, the legend. The history buff had returned.",
        "Erm..i just watched this on netflix?",
        "Happy Thanks-killing",
        "That's not what \"begs the question\" means.",
        "Too much of a story to be a movie.  This should be a series.  10   1 hour series",
        "he did not make \"morally dubious\" choices im pretty sure he was just straight up evil and selfish",
        "What's a McDonalds?",
        "Please please do the revenant... I would love to see your research on that part of history. I read the novel and I was obsessed",
        "How about Schindler’s list",
        "Hey, Nick! Great video as always, but why change the intro & outro music? They were just as fun to listen to as your videos are interesting to watch.",
        "Both the brothers denied they had a handshake deal for 1% of all revenue from McDonalds.",
        "Can we just appreciate the effort he puts into us like seriously i can feel him coming inside me",
        "Wait... new intro after all these years?",
        "Great video as always Nick! Your quality and consistency rivals McDonalds itself.",
        "= No royalties for the family.\n\nThough they got a cool mill, It would a great tragedy if their children's children end up poor. Because some Business man took over their grandparents billion dollar franchise. I certain find that heart breaking if my children and their children didn't get a piece of something hard I worked for...",
        "Nick drops a fresh episode and my attention is locked. Keep it up, homie!",
        "The next History Buffs segments I would love to see are Peter Berg’s films. Such as Lone Survivor, Deepwater Horizon, and Patriots Day",
        "You should do the green book.",
        "\"Dick'n'Mac\"\n\nThese secret menu items are getting out of hand",
        "you should do the DAHMER tv series on Netflix.",
        "SAS rogue heroes next please",
        "I still take issue with any establishment that calls itself a restaurant and does not have cutlery.",
        "The Right Stuff\nSeven Years in Tibet\nThe Messenger the Story of Joan of Arc\nImitation Game",
        "In Australia,  there's a saying \" What a Kroc of Shit\". I wonder if Ray is responsible or if it's after a Crocodile. I don't mind thinking it's because of Ray. Lol",
        "If wife doesn't support her husband she doesn't deserve a shred of her husband's success.",
        "21:10 Oooh so McDonald‘s Food was actually of good quality once? \nIf I ever meet the Doctor in the TARDIS, I want to travel to some of the first restaurants to taste whether the quality was indeed better.",
        "Great video! Just a heads up, you pronounced \"debuted\" as \"deb-you-ted\" , but it's generally pronounced \"day-bued\".",
        "Harry sonneborn is my great uncle, never saw a penny after the split between himself and McDonald’s",
        "I find it amazing how In 'N' Out has kept it simple to just hamburgers, fries, and milkshakes. It is what Mcdonald's would probably be if it had never changed anything about itself from its first restaurants.",
        "the original hamburgler",
        "What would be interesting is exploring Ray's relationship with Prince Castle.  I believe they developed the multi-mixer, that Ray was selling, for their own resturants. They were a series of successful burger/ice cream restaurants in the Chicago area.  They eventually changed their name to Cock Robin. They no longer exist but I wonder why Ray did not try to convert Prince Castle to the Speedy System.",
        "You might be my favorite youtube channel. Honestly, it's neck and neck between you,hbomberguy, and emplemon.",
        "Please do a video on THE LAST KINGDOM!!!",
        "Could you do American Gangster?",
        "Super enjoyable!",
        "...Nothing in this world can take the place of good old persistence. Talent won't. Nothing's more common than unsuccessful men with talent. Genius won't. Unrecognized genius is practically a cliche. Education won't. Why the world is full of educated fools. Persistence and determination alone are all powerful.",
        "Always a good day when Nick is back with another history buffs video. just curious if you had any plans to Cover Netflix's \"All Quiet on the Western Front\" remake. i thought it was a phenomenal movie that really did a good job in showcasing just how AWFUL war really is. even if you don't, ill still be looking forward to your next video, All the best!",
        "In 2019 the FDA redefined Pink Slime to be legally called \"Ground Beef\" so 21:12 isn't some wild conspiracy.",
        "In and Out Burgers is a So California tradition.  Same menu: burgers-fries-shakes-sodas. Wildly popular to this day. Everything made fresh. Employees paid well.",
        "I worked at McDonald’s 3 years. We had cockroaches that lived in our frape/smoothie machine. I’m now an exterminator…",
        "Is that Ron Swanson? Lol he looks so weird without any facial hair",
        "You should keep with these types of videos instead of the shows",
        "Do blood diamond please",
        "There are actually two \"neon arches\" style restaurants around where I live, I think they're pretty cute.",
        "I learned all of this from Mark Knophler's \"Boom Like That\" Great tune!",
        "I literally just watch this movie on Prime so I can review.",
        "you should do \"all quiet on the western front\" I know it's not a real story but its inspired by at least one.",
        "Made it a point to make sure I ate before this video gives me the \"Mac Attack\"",
        "ah yes finally! the FOUADER",
        "Can you make a video about all quiet on the western front? (The new one or the two old ones)",
        "And now Mcdonald's can take like 20 minutes just to give you a couple burgers and some fries.",
        "Michael Keaton “nailed” that role down! A master piece on acting!",
        "Yeah that McDonalds Sprite just hits different",
        "Please do Valkyrie",
        "You kinda glossed over the fact that it's not really food anymore.",
        "Do you think there will be a remake of Waterloo?",
        "Awesome stuff! Always wondered how true this account of Ray Kroc was.\n\nI would humbly request you do Chernobyl (HBO) next!",
        "Erm, that's not the director, I think you'll find that's Harry Enfield.",
        "There are stores here in Columbus that still use the McDonald brothers design. I kinda like that design better.",
        "I’m always excited to watch when I see history buffs uploaded",
        "Don’t mind me! Just boosting the algorithm ",
        "FYI locals call it San Bernarghetto",
        "If you think that McDonald's hamburgers is 100% ground beef you're delusional many things that are 100% beef are not 100% ground beef all beef bologna I'll beef hot dog",
        "Hey History Buffs, you should do “Catch me if you can” starting Tom Hanks and Leonardo DiCaprio.",
        "You're alive!!!!",
        "Also, it's pronounced \"Deh-Plainze\" not Des Plaines. You don't pronounce Des Moines as \"DeSS Moynees.\" but \"Deh- Moyne\"",
        "High quality? Not hardly. As with all American industry, mediocrity rules. What Mickey Dee's has is consistency, but Wendy's beats it out in both quality and speed of service.",
        "Do Gangs of New York and Schindler’s List",
        "Krokstyle, boom like that...",
        "So... Maurice \"Mac\" McDonald got a \"Big Mac\" named after him. Richard \"Dick\" McDonald never did. I wonder why....",
        "My Irish immigrant grandpa lived one county over and wanted to invest in McDonald's. My grandma talked him out of it : \".... this hamburger thing is a fad.....\" She never had a job either",
        "Yeah! you're back!",
        "I love this movie so much, thrilled to get more context and clarity on the story! Fascinating that basically nothing about Hamburger University made it into the picture.\n\nAs for a potential future video, would love to see you cover the new Weird: The Al Yankovic Story, perhaps on April 1st next year?",
        "Good thing they didn't name the big mac after the other brother.",
        "Can you do Ford v Ferrari?",
        "I love how wonderful all of these videos are :)",
        "great movie u should do the people vs larry flynt next and got a few others that should be good like highway men the guys who killed bonnie and clyde, will bill was a good movie, kill the irishman cuz im from cleveland, and the irishman dude who claims he killed hoffa. great channel i watch all the time",
        "The Big Mac had nothing to do with Ray Kroc, it was a franchisee in Uniontown, PA who added it to the menu. It sold well and became a permanent part of the menu in 1967.",
        "The guy who stole.mcdonslds is not a founder",
        "Please, im BEGGING you to make an episode on The Imitation Game. The story of Alan Turing is one of my favorites and would love to see it done justice.",
        "I was hoping he did this movie awesome video like always, hope you do the social network at some point",
        "Film changed my life, thank you Ray Kroc.",
        "Yes",
        "Yay! You're back! Thank you - this movie was great",
        "Still waiting for you to do a video on Ned Kelly!!!",
        "Megckdonalds",
        "Amazing video. I think you should do a video on Moneyball, rocketman, or The zodiac",
        "I really love this channel.",
        "The return of the King.",
        "I guess we can blame Ray for the obesity epidemic",
        "I saw this in my economics class senior year, loved it. Keaton plays a damn good bastard businessman. Great video!",
        "You can say a whole lot of shit about Kroc and it'll all be true... but that man was serious about Loyalty & it still permeates McDonald's corporate culture. A dude who was a fry cook took over as CEO when Kroc retired & the secretary in the scene with Sonneborn ended up being the first woman to open the New York Stock Exchange as a Vice President of McDonald's Corporation. McDonald's almost always hires/promotes from within itself & its one of the last places that has lifelong employment. There's plenty of District Managers, Regional Managers, Vice Presidents, etc that have never worked for anyone else besides McDonald's since they were 16 years old. McDonald's will end send you to their own college and you get an accredited Hospitality Degree... what other corporations send their own employees to college???",
        "Who invented the amazing McRib?  I really want the almost but not quite meat by product to be sold in cans in supermarkets......",
        "Do hacksaw ridge please",
        "So basically Ray Croc was a business genius and a real \"Richard\".",
        "I literally said \"Ohhhh!\" when I saw this pop up. I'm not a big fan of drug lords and don't care to learn about their day to day struggles. This was much more my speed.",
        "Now I want a milkshake",
        "They should do a sequel because McDonald's has went thru so many changes since the ending of this movie so they should definitely continue it...",
        "I watched the founder and it was an amazing movie, dude was ruthless... the mcdonald brothers should have franchised on their own... but there is a discrepancy from what i heard, because they got alot more in royalties than the movie suggested...",
        "Before they owned a restaurant, the McDonald brothers had a theater and a hot dog stand. In 1930, with whatever money they had scraped together, they purchased a 750-seat movie theater 20 miles outside Los Angeles in Glendora, calling it the Beacon Theatre. But this being the Great Depression, it did poorly. They noticed that kids seemed to always have enough money for food like burgers and soda. So with a $5,000 loan, the McDonald brothers started the Airdrome hot dog stand in 1937 by an airfield in Monrovia, calling it The Airdome, and they targeted spectators who were watching the planes. This was a success, but they predicted that in the future, they'd need to appeal to cars. So they moved to San Bernardino, changed the name to McDonald's, and the rest is history.",
        "Love your videos, always good to see a new one",
        "I wish I was a McDonald’s cheese burger ",
        "",
        "Elon Musk is the Founder of Tesla even though someone else started it. He made it what it is today.",
        "Read \" behind the Golden arches\" the story of McDonald's and Kroc...  it has the coldest burn EVER",
        "I always wanted to eat at a McDonald’s but could never find a location.",
        "@History Buffs  Can you please do a video on Amazing Grace (2006)!!!???",
        "Love a good ol fashioned dad movie",
        "Great Vid… AS ALWAYS!!! ",
        "Nice one.",
        "so it was the Zodiac killer who was one of the founders?",
        "Ray croc didn't event the fish sandwich Paul Grouwen did. I used to work for the Grouwen McDonald's as a kid. Ray wanted to make a pineapple burger but lost a sales contest.",
        "In my walk of life I have known a few business men and women most of whom were a bit “shrewd” for lack of a better term. I do believe that money is the root of all evil and has the tendency to “change” people. Granted this is not always the case I understand that. This would be an interesting movie to watch as a couple of my favorite actors are in it and it has the advantage of having some history in it. My best to y’all and thanks for another video Mr. Hodges!",
        "Really good movie quite enjoyed it",
        "Keep em rolling mr history buff ️",
        "Seeing this come up on my feed made me smile.  Always ready for a new History Buffs vid.  One of my favorite channels",
        "....or a Flavored Ice Coffee. I've had them all over the country and they always taste different.",
        "Somehow never heard of this film yet really enjoyed this video.",
        "to be fair to copy even then, he would have gone to court and cost much needed resource.",
        "Ray Kroc wanted to buy out The McDonald brothers? Well he better start making some sandals cos the companies called McDonald's not \"Krocs\"",
        "I liked the old intro music more.",
        "Hey Nick\n\nDo you think in the future you could do reviews for \"Cromwell\" or \"To Kill A King\"? I'm very interested in the events of the English Civil Wars and those are the very few films that attempt to portray the War between Charles I's Royalist Cavaliers and the Parliamentarian Roundheads.",
        "Loved the movie, loved the book. Inspiring!",
        "Please do an episode on the new Weird Al biopic.",
        "Bro just tells us if you need more help or something making these videos!!! 7 months is way to long ",
        "3:13\nWell, the makers of this movie kept it real.\n 2 hour movie, 1 black, 4 seconds.",
        "I live near the #1 store in Des Plaines, IL. It’s fascinating that the biggest fast food chain in the world had some of its origins in the Chicagoland area.",
        "Please do a video on the new All Quiet On The Western Front. It’s an amazing movie that i’d love for you to cover",
        "So glad your back",
        "Half in the Bag and History Buffs in the same day?? Must be heaven",
        "Next should be 2001 A Space Odyssey. 2001 is technically historical.\nOr Full Metal Jacket if you haven’t done it already.",
        "He seems cool. Money Over B’s. ",
        "Thanks again for a great video, Nick.",
        "I'm ceo of the mccaffe.. no arguing.. I'm just sayin.",
        "Ray’s third wife’s name is Joan (long o) not Joanne",
        "Is this where we get the phrase \"What a Crock\"?",
        "I really want to see him review gods and generals just to see his reaction",
        "Good story but you are just narrating the movie.",
        "Wait...McDonald's has a commitment to....quality?",
        "Loving the new music for the intro!",
        "You should do the movie Glory.",
        "Yooo my truck is in this movie",
        "I have to say I had no real idea how McDonald's came to be, very I threshing to say the least but less dramatic and greedy then I thought, amazing work as always man keep it up",
        "I've always found it fascinating how the USA holds individualism is its highest virtue, yet their arguably most well known culinary creation is based on the principle that they're all basically cattle, and should be lined up, all be fed the same thing as cheaply as possible, as quickly as possible, and then herded out. Going to McDonalds as an adult feels like being back in school.",
        "For your next film review, I’d recommend 1970’s “Cromwell”\n\nIt’s my understanding that it’s extremely inaccurate, but a closer look at why and where it was inaccurate would be welcome",
        "Every gonna talk about The First King, an Italian movie about the founding of Rome performed entirely in a reconstructed \"proto-latin\"?",
        "Ugh!  The devastating cruelty and ego it must take to debase a woman like his second “wife”.\n“Marrying” her as a placeholder, while angling for another man’s wife, then divorcing her and discarding her when the plans arrived.\nUgh…I need a shower.",
        "If this is indeed true and greed and money corrupted him so, then shame on him,",
        "You should do one on my other favorite biopic, Jobs (2013).",
        "Something that's not Narcos thank GOD",
        "Cynical historian made a video about this movie a while ago but I like Nick's style better",
        "He’s the Dana white of McDonald’s then basically took something that was a great idea expanded and marketed it",
        "You should do a video on Battle Of Britain 1969. It’s one of my favourite war films, I’d love to hear what you think",
        "My favorite thing about this movie is when I realized they called it the Big Mac because using the other brothers name wouldn't quite work lol",
        "In MREs, we used to have (maybe still do) powdered milkshakes and they were SOOO not even close to a real milkshake so I'm glad to know the milkshake mix bit was completely exaggerated.",
        "Underrated movie. 'McDonalds: The Movie' was excellent and overall, for a Hollywood movie, they did good job balancing this where Crok is no hero but he's not a bad guy either. Neither were the McDonald brothers heroes or villains. It was legit fascinating to see what became a massive cultural phenom, the quirky things, the biggest moves dared and the whole thing was very very well done",
        "I need to watch this again.",
        "Dear Nick, please review the movie Heneral Luna. Thanks in advance!",
        "You need to do a battle of britain episode ️ 🇬🇧",
        "I remember watching this film during my Government Civics class in high school, the acting was amazing.",
        "I bet the burgers back then were gourmet compared to now smh , hell even back in the 90s I'm sure the burgers were better than now . Their shit is so bad it's depressing, they're only known for poor quality food and poor standards these days. The creators are rolling over in their graves everyday I bet",
        "\"Life is not about finding yourself. Life is about creating yourself.\" -Lolly Daskal",
        "Totally engrossing video as always. \n\nI'm itching for you to do \"All Quiet On The Western Front\". Have you done it already? I know the story has been adapted from a book many years ago.",
        "Would love to hear from someone who ate one of the earliest McD hamburgers or their other menu items. I’m curious if they remember much of a difference in taste/quality compared to McDonald’s modern menu. My first McD was late 70s or early 80s and it’s been pretty standard fare since then.",
        "I grew up in Devon in the 1970s. My mum was from London, my dad was Irish. My mum's mum, my grandmother used to come and visit us in the summer and I remember her telling me about McDonalds and how it was like INSTANT cooked food that was really tasty. I think I first tried one when I was ten. She said \"Its all the new thing. Fast food.\" I kind of imagined chefs on roller skates hahahaha",
        "14:18 “you’re not in the burger business. you’re in the paper business…”\n“What?” \n“What?”",
        "I love that litte run Michael Keaton had in the mid 2010s that consisted of Birdman, Spotlight, and The Founder that's showed how great of an actor he really was. Too bad he's back to being Batman now.",
        "\"if there were no mcdonalds brothers he'd still be selling milkshake machines\" is such a moral high ground move. just absolutely destroying the man in the eyes of god, despite his station as \"founder\" of mcdonalds. id have liked to get a beer with the mcdonalds brothers",
        "How much do these cost to make, very interested in helping produce one on the film JFK.",
        "The fact Michael Keaton is in this film , is amazing , he played Batman in the 1989 film Batman",
        "Love this channel! Do The Woman King next!",
        "I am glad you are covering different movies (such as this one) and not just the most known historical ones.",
        "Boy this movie still gives me goosebumps",
        "There is no proof that royalties were offered at all.  Even the brothers disputed this.  I hate that it was included in the film.",
        "Ray Crock didn't create the McDonald's name, but he made the name known",
        "Can you do sas rogue heros from what I’ve looked into it looks very accurate",
        "Ray Kroc reminds of something a business man once said, \"You can make friends and you can make money, but you can't at the same time.\" I don't agree with that but others do.",
        "It's McDaniels, not McDonalds. These rhymes are Daryl's. The burgers are RONALDS!!!",
        "This channel is probably the only reason I ever end up watching movies. After I watch the founder I'll be back to see this. Micheal Keaton is an amazing actor. His work in dopesick felt genuine and leading me to getting and staying clean. Anyways I see he's in it and it's about history? I'm sold see y'all in a few days.",
        "Imagine if the BigMac had been named after the OTHER brother.....",
        "I absolutely loved this as a mcd manager",
        "Like how the founder screwed over the brothers and forced them out..",
        "It’s funny to see so many cooks in the kitchen when now it’s just 2 or 3, 17 year olds",
        "Best video since Denny Crane retired thank you ",
        "Hey, I know what will make this channel better: FRANCHISE IT! Franchise, franchise….FRANCHISE!!",
        "Great content like always!! Hey Nick...Have you ever thought about an International History Buffs movie reviews? There are lots of historical movies out there which aren't necessarly made in Hollywood and have lots of efforts and love in their making. It could help people extend their knowledge and their attention towards a wider selection of historical movies.",
        "Underrated fact about McDonald's (& a source of irony for The Founder): It killed the Michael Keaton / Tim Burton involvement with the Batman franchise by cutting partnering ties with Warner Brothers because it felt the dark and violent tone of Batman Returns made it hard for them to sell Batman happy meal toys. So Warner Brothers released Burton, and Michael Keaton didn't want to go a different direction without Burton's involvement. Hence, McDonald's killed Michael Keaton's Batman ",
        "This is easily my favourite channel on youtube. I wish there were more videos coming out, but I understand the amount of work that goes into each one.",
        "one of the worst things that happend to humanity, right there with tabaco and teflon...",
        "Nick is the best. Period.",
        "9:49 shout-out to Del-Taco, is who they're referring to",
        "Ray Crock was actually from my hometown, his picture is even hung up in the police station for influence figures.",
        "7:13 deb-you-ted? never heard debuted pronounced that way.",
        "Always impressive work! Eventually you should do one for JFK (1991) and Thriteen Days (2000)",
        "*sees a new History Buffs drop*\n\n\"It's been 87 years...\"",
        "next video suggestion : \"Lamborghini: The Man Behind the Legend\"  movie",
        "Kind of a weird gripe but, in this film the San Bernardino location is like some east coast rustbelt town that looks NOTHING like Southern California. I mean, they might as well have filmed that location on the Moon. Another offender is the movie Den of Thieves where Atlanta stands in for Los Angeles; they don't look a like at all. Not even close. LA is an ocean of concrete and Atlanta is a forest. I don't know if this is laziness or what, but holy shit. They don't even try to approximate the asthetic of individual locations. I can sorta understand the assumption that nobody knows or cares what San Bernardino looks like (I don't blame them) but LA? that is arguably the most photographed and filmed city on earth, even somebody from Timbuktu could pick it out of a line up.  At this point why not just film in front of some rural gas station and call it Times Square?",
        "You said he suffered from a personality disorder that did not exist at the time. I thought this channel was about accuracy.",
        "Ironically now you gotta wait 30 mins just to get a 4pc nugget lmao",
        "I’m so glad you made this video, I saw the founder awhile ago and I still crave more knowledge about it! ",
        "JF-FUCKING-K",
        "Please do one on Ford v Ferrari",
        "So basically In N Out burger is what McDonalds would have been if it never had sold to Ray? Got it. This is why I support In N Out.",
        "Great analysis I wished this movie got more recongition",
        "Michael Keaton was such a great casting choice for Ray Kroc",
        "Aaaah... American family values :)",
        "So nice to see Stephen Spatula in this video. His vids are oddly addicting!",
        "That uniform quality was a godsend when I was on the road. Here was a place where I wouldn't get sick.",
        "One thing the movie doesn't show is when McDonald's switched from walk up to dine in.",
        "Thank you for using the correct pronunciation of \"Dess Planes\".",
        "It sounds like Ray Kroc was less of a \"founder\" and more of a \"quarter founder\".",
        "i'm of the belief that they got really lucky, times where changing, more and more people where being driven by a very busy life style, long travel times to and from work, high stress jobs, less time and a society hell bent on faster, easier, cheaper please, the franchise happened at the right time. there was tons of fast food shops/ chip shops,  they where selling burgers that out classed and matched the big mac, they are still around, if you look at society in general, who would have believed you could get people in ireland to buy bottled water, it pisses rain here 80% of the year, or charge 5 euro for a cup of coffee, there is fast food stores of all kinds/restaurants everywhere in the modern city,  in my own local village i can say there is at least 200 stores/companies operating and since the pandemic you can now order from every single one of them online and have it delivered. humans are a lazy bunch that would rather trade/pay someone else to do the work for them. it's comical when you think about it, people willing to pay the same price as a cheese burger to have it brought to them so really are willing to pay twice the price ;) sends a real interesting message to the marketing people i'm sure. any hooooo,,, the world is mad! hahahahaha rant over.",
        "Dp the so called founder is the one who I have the curse for my frosty.  Demand is never met csuse it's always broken",
        "It looks like an OK movie, it just raises the question of why should this guy get a movie made about him? I've always been somewhat nauseated by how American culture lionizes businessmen so much...",
        "If it weren't for Ray Kroc McDonald's would be like In-N-Out.",
        "Ok. Now do Super Size Me.",
        "i’m sure you’ve been watching SAS Rouge hero’s and I’d love to see a history buffs on it at some point",
        "Rock n' roll McDonalds...Rock n' roll McDonalds...",
        "Can you do Zero Dark 30",
        "I'd love to go up to the window and say: \"give me all the bacon and eggs you have!\"",
        "The word \"Quality\" is overused here.",
        "Great choice, Love your reviews.",
        "Ray is to McDonalds as Michael Jordan, Magic Johnson, and Larry Bird are to the NBA. They didn’t start it, but they ARE the reason it’s all over the world.",
        "He is the founder of the company it is today. The original brothers founded one hamburger shop. They happen to share the same name. You cannot compare one hamburger shop in nowhereville USA to the biggest restaurant franchise in the world.",
        "I hope you make alright money on posting these videos. You post like one a year now if that.",
        "Interesting new opening music",
        "I want the old intro back",
        "its nice to think that atsome point in time mc donalds actually served burgers made out of real meat.",
        "STILL no cleopatra video??",
        "I've had Macca's in different countries around the world. The quality is different everywhere. For example, in Australia and New Zealand it's good, in the UK it's crap, in Poland it was crazy good.",
        "Love the movie and love your video! \n\nScott",
        "One thing that has always bothered me was the presentation of McDonald brothers as someone who were kinda left broke. First things first. I totally see Kroc as a power-hungry egomaniac who always wanted more money and power. Also, I believe that there was a handshake agreement, and he simply scammed them in the end on that part. One thing to understand - Kroc didn't have that kind of money, and it was thanks to Sonneborn who found investors (that's where the whole problem of the investor's opinion was found). But when you think about it, they got a million each in the end (after taxes), which after taxation in current days would be around 8 million dollars, which is not chump change. Furthermore, their FIRST McDonald's (not in Des Plaines...) was successful. You also have to take into account their income from franchises. So not bad for retairment plan. Yes, they came up with the concept of their restaurant and also the golden arches, and that is important! But Croc was the one who created this large franchise of restaurants in so many countries and then later all over the world. Also, he created a concept where he could maintain quality in (almost) every restaurant—that awesome university... When you think about these two brothers, who basically wanted to retire in peace, they didn't get the worst deal. BUT THEY definitely shouldn't have been erased from the company's history, and I think that hurt them more than money.",
        "Please i'm begging you  , do All quiet on the western front 2022 next !",
        "Need a HB on SAS Rogue Heroes asap",
        "I've read the Ray Kroc autobiography and there was a line in the book that makes total sense. One of the people that worked with him said that he (Kroc)  really \"french fried\" the world. McDonald's french fries are part of their success. They even had to come up with ways to actually process and cook the french  fries in different types of humidity and weather.",
        "Why no Gods and Generals?",
        "So that explains how Bruce Wayne got so stinkin rich, that he could do his Batman-thing...",
        "I hope you'll be covering the remake of All Quiet on the Western Front next.",
        "Oh I know very well about hamburger university my best friends late dad used to be a franchise owner for McDonald’s it does take up a lot of your time because I always notice he was always on the phone every time I visited my buddies house",
        "One thing that irked me and maybe I missed it, why did the McDonald’s brothers think a handshake deal was a good idea after Ray consistently snaky behavior ( the whole “Contracts like hearts” speech) wouldn’t at that point they would have rather put it on paper. There were lawyers involved, didn’t someone at least say that handshakes wasn’t a good idea.",
        "Franchise the whole thing!",
        "This was such a great movie. Keaton’s performance was superb, as were Nick Offerman and John Caroll Lynch as the brothers. Heart breaking scenes near the end.",
        "Is the backround footage from “The Food that built America”?",
        "Funny that nowadays nobody but in and out runs their bisness model like this and thats why whenever I want a burger  thats where I go cause Im def not loving it at McDonald's these days, it's a shame I was born and raised in San Bernardino too. Best burger spot to ever exist in San Bernardino was definitely Phill's Charbroiled burgers on 3rd and lena though IMHO! RIP Phill.",
        "I love when a video like this comes out because it means I don't have to waste my time watching what is essentially a mcdonalds propoganda piece but I still get to hear and learn about the real history!",
        "\"He won, so he has to have done something right\" is really yankee of you",
        "and now the McDonalds you pay high prices and need to wait 30 minutes to get it, Oh the irony.",
        "Do the 2004 The Alamo starring Billy Bob Thornton and Dennis Quaid",
        "I’ve been to the hamburger university up in northern Illinois and hot damn is that campus small but cool. It’s got a pond separating the three buildings with a bridge from each meeting in the middle of the pond. Also great food there too",
        "I think you would be surprised by the movie Hacksaw Ridge! Even though I know Mel Gibson doesn’t have a good record ",
        "All in favor of a Black Hawk Down video?",
        "Woah, its a bird,  it's a plane, it's new content from history buffs!! I swear when ppl who produce good content rarely upload you appreciate it so much more..... ok imma stfu now I'm trying to type n watch n listen at the same time. Don't judge me... I'm a nerd. I half flaws, I'm 31 black, single  and I cried when the actor who played the green ranger died yesterday....",
        "Hey, Nick. What about \"Charlie Wilson's War\"? I would LOVE to know how closely the fascinating story depicted in that film adheres to historical fact.",
        "never had a McDonald's in my life, never will, but I do appreciate their clean toilets",
        "Now it's takes ages to get served in McDonald's! ",
        "Ive been to the mcdonalds in peru and i can tell you it tastes identical, its insane how controlled the taste is, i love it!",
        "Gg.",
        "not sure if u have done the hurricane with denzel washington. its about a boxer who was wrongful accused of murder and was later freed. would love to know how much of it was real or just for movie purposes. love what u do!",
        "love the movie  seen it a few times, ray is the founder he built it into what it is, the brothers just hang back milking rays work but in the end lost it all",
        "5 minutes in and this is still just a recap of what happens in the movie, albeit very drawn out",
        "Ever since I found that he stole their business we haven't eaten there once.",
        "This was such an underrated movie, and I'm surprised it didn't win any awards.",
        "McDonalds is disgusting. Good video though",
        "Joyeux noel would be a great one. So much there that really is incredible. Like a British soldier meeting his german barber in no mans land",
        "Also listen to the Dire Straits song “Boom Like That” on the same subject.",
        "Mcdonald's is the grossest place on earth\n\nI will never understand why people eat there",
        "I think it’s funny, with all the shady things he did, the joke now is that McDonald’s ice cream machines are always down.",
        "Nearly 1 in every third person in the U.S.A is now considered obese, and the quality of food from McDonals chain of restaurants (using soy beans for burger meat, fries which doesn't rot and coca cola made from powder)is was always dubius like the Owner makes me belive that a simple milkshake salesman has been the founder of death for fast food industries.",
        "Finally , He uploaded this movie review  - Was looking for it before and found none.. So excitedd",
        "I do remember just some 15-20 years ago i really did expect consistency from Mc.D's, but nowadays, well, let's just say 2 places 50Km apart can be vastly different in terms of quality.",
        "Then came In-And-Out.",
        "Haven't watched the video yet but I'm really thrilled. I really liked Michael Keaton in this so I hope it will hold up at least somewhat.",
        "McDonalds and quality should not be in the same sentence. Also when McDonalds goes to other countries everything changes really. The food, the quality standards (which from what I see is actually usually higher outside the US). Knowing all this the entire story loses credibility for me.",
        "Good to see this. I enjoyed the movie and was always curious about how accurate it was. The movie seems to have been made with the approval and support of the Corporation. It initially comes across as a promotional film, although it takes a harder turn in the later stages when it addresses the disagreements.",
        "Awesome vid! Could you do one about Mississippi Burning?",
        "Oh man Michael Keaton just slays this role. I wouldn't say this was one of my favorite movies, though I did enjoy it and it was well made, but Michael Keaton as Ray Croc just really nailed it.",
        "A bit of a twist on a lot of that information. Do what ya gotta do tho.",
        "Did you really pronounce \"debuted\" as deb-you-ted?",
        "My father, Carl Eriksen, was Ray Kroc's personal assistant from 1966 to 1970. He is briefly mentioned in Kroc's book. I knew Ray Kroc and his wife Jane. (there was a short-lived experiment called \"Jane Dobbin's Pie Restaurant\") I was around when Ray divorced her for Joan (not Joanne as you say in this video). In 1970, my parents and I went to Hamburger University in Elk Grove, Illinois (west of Chicago). I was the youngest graduate at age 14! I still have the diploma. Kroc was supposed to help my parents start up their own franchise but somehow that deal did not materialize. I can personally vouch for the portrayal of Kroc in the film. He was a ruthless and angry man with a huge ego. When he bought the San Diego Padres baseball team, he got into trouble with the Commissioner of Baseball because he used the PA system to apologize to the fans for his team's poor performance in 1977. He was a control freak and everything had to go his way. He would often visit a McDonald's in his Rolls Royce and if there was trash in the parking lot he would personally pick it up and then berate the manager.",
        "After a long day - we had the first snow of the season and no one remembers how to drive - to come home and find there's a new History Buffs video months before I expected the next one? Thank you Nick, thank you. ",
        "imaging planning to apply for Hamburg university and accidentally enrolling at the Hamburger university.",
        "*venturing, into cry'pto. now should be the first thought in every wise lndividuals list. in some months time you'll be euphoric with the decision you took today..*",
        "6:45 holy shit it's Mister Chief",
        "I'm glad you're back",
        "Since I have no Facebook, or Twitter, or the money to help the Channel Grow on Patreon. I'd LOVE to see a break-down of the scene from Joyeux Noel of the \"Christmas Truce\". How much is true and how much is fiction!",
        "McDonalds is disgusting, and easily the lowest restaurant of anywhere I have ever eaten. That said I always look forward to your videos!",
        "Hadn't realised that boom like that by dire straits is about McDonald's ",
        "Ray Kroc must be Elon Musk's big idol. \nHe copied him exactly, swooping into Tesla, stealing it from the two guys who founded it and now pretending he's the founder.",
        "A new video! I feel lucky and see you next year.",
        "Please do \"worlds fastest indian\"",
        "Would love to see your take on \"sas rogue heroes\"",
        "There's an alternate universe where there's a burger at Mcdonalds called the \"Big Dick\"",
        "bring back the first intro",
        "Review The Woman king next!!!! I'd love to hear your opinion of this accurate film.",
        "Another inconsistency - if anyone's ever been to San Bernardino, they know there isn't much lush greenery around like in the film. It's in the desert. Minor thing, but stuck out to me! \nGreat History Buffs video!!!",
        "6:50 \"it's better to have one great restaurant than fifty mediocre ones\"\nAmusingly, this is basically the opposite of McDonalds modern strategy.",
        "we must all become a bit like ray and not the brothers else in life as the saying goes a fool and his money are soon parted.",
        "Dess Moyens ",
        "Really stretching the word \"quality\"",
        "Do for mindhunter and post more videos man",
        "No McDowells restaurants. \"I'm McDowell's. They got the Golden Arches, mine is the Golden Arcs. They got the Big Mac, I got the Big Mick. We both got two all-beef patties, special sauce, lettuce, cheese, pickles and onions, but their buns have sesame seeds.\" ",
        "I hate going to McDonald's these days because speedy they are not. My fastest recent wait was ten minutes and that was only a coke. The last time I ordered a quarter pounder with cheese meal I waited for 21 minutes, Kroc would probably be terminating the franchise.",
        "Huh, imagine actually getting a fast food order served in 30 seconds in this day and age.",
        "To be fair, why should his ex-wife get anything to do with McDonald's? She constantly criticized him for working at it.",
        "great video",
        "In the Seattle area, we have a chain called Dick's drive-in. I feel that if the McDonald's brothers didn't franchise, Dick's certainly would be a perfect example of how McDonald's would have been.",
        "You should review 7 Years In Tibet",
        "McDonalds.... only burger that ever made me puke.....\n\nso yea.. never been a fan of their burgers..\ntheir chicken wraps ( ironic.. Ray hated the idea of McD's selling fried chicken, and yet, they sell it in abundance) are good",
        "Do a history buff episode on the Elvis movie. I'm very curious to see what events actually happened.",
        "Could you do a video on fury",
        "He screws ron swanson over that's unforgivable",
        "Oooooooohphuuuuuuuk yeah a new one!",
        "Good to see you're not just doing historical war films but it looks any kind of history film with this channel, keep it up.",
        "History repeats  itself… McDonald’s and Ray Kroc then and Tesla and Elon musk today.",
        "Another great one, thanks!\n\nAs far as suggestions go, I'd love to see a show on Doctor Zhivago. It's the very definition of 'sweeping Oscar epic,' and even the story of how the novel was fist published (smuggled out of the USSR, translated and published in Italy, became popular in the West, RE-translated back into Russian and >allegedly< smuggled back INTO the USSR by the CIA) is fascinating!",
        "I like the new intro but for some reason I’ve been getting nostalgic for the OG intro.",
        "more like: the horrible person responsible for soooo much animal abuse and world hunger but okay",
        "Ya and then it would become the most disgusting burgers I've ever had\nLike their quality has gotten so far down it's crazy",
        "Finally a history buffs episode that not about Narcos",
        "I live in Australia and they have products they definitely don't have in America.",
        "When the world needed him the most... he returned.",
        "Please do a history buffs about each season of Turn. Washington Spies.",
        "My dad disputed with me that McDonalds first restaurant was in Des Plaines Illinois I told him that’s a lie created by Ray Kroc and the real one was in Cali….needless to say he said “That’s a load of Kroc”",
        "Mark Knopfler has a great song about Ray Kroc called, Boom Like That. Definitely check it out. It’s based on the autobiography about Kroc, Grinding It Out.",
        "Ray Kroc is the hero of this story. The mcdonald brothers were smallminded and callous to the situation Kroc was in, in which he had mortgaged his house and put everything he owned on the line. He had no choice but to be cutthroat about it. I'm glad he left his wife too, she was berating him for taking this risk, she couldn't believe in his dream so it was fitting she didn't get to be a part of it.",
        "The irony is he turned the McDonald's  brothers into a ."
    ],
    "comments_disabled": false
}