{"video_id": "dZJIUQvUaSQ", "comments": ["There’s no way Carson Wentz starts over Taylor Heinicke after these past few weeks. 4-1 in with Heinicke and now a statement win against an 8-0 Philadelphia team", "Don’t think I’ve ever seen such a great kicking effort by a Washington kicker in many a year. 58 and 55 yards in a single game is amazing", "Heinicke makes EVERYONE around him better and charged. The offense and defense. Gotta love the guy’s heart", "Watching Robinson Jr drag defenders on a literally shot leg is just insane to me guy is a workhorse", "I am not a Commanders fan but their  sideline energy is amazing", "The greatest take a knee play ever.", "For Washington to nail kicks from 55 yds\n and 58 yds boy was the kicker doing an awesome job. Montez Sweat may just be their best defensive linemen too. I really enjoy watching Washington because they didnt let\n Eagles finish this game with a home victory.", "I am so proud of Washington.They have been my team since I was 5 and now am going on 50.", "Heinicke is such a baller, a playmaker and a gamer. He does not have the greatest or even an average arm, but he just keeps winning games for some reason", "As a cowboys fan , the commanders did what we couldn’t.  respect", "Heinike celebrating that hit when he took the knee was absolutely hilarious.", "That Knee by Heineke was the most big brain play I've ever seen.", "Let's not forget about Slye, our kicker, he made some important field goals especially that long 55 yd field goal to hold eagles off until the very last play. All in all, they did and excellent job last night and never gave up until it was over and it showed. Congrats Commanders!!!", "No one talking about those kicks, 58 and 55 yards in the same game is absolutely bonkers!!", "Congratulations Commanders fans. That was a great win!", "Brian Robinson is super human. This kid was shot several times last month and to see him so dominant is awesome.", "The Washington kicker had the game of his life for sure! A career long 58 yarder plus 100% on all the others. Great job from the whole team!", "I love how much time they take off the clock with these long drives, like the one drive that took 16 plays, but was successful. Go Commanders!!", "As a Giant fan,  i must admit i was impressed by Washingtons' road victory in Philly....   Heinicki really stepped up his game....", "Love Heinicke. He doesn’t have the best arm or anything but goddamn does he play with heart. He gives 100% and just makes plays.", "Can we show some love for Joey Slye for his amazing performance?", "Always nice to wake up to a Philly loss.", "Washington plays with heart when Heineke is out there. It’s great to see", "Great game by the commanders their d-line did amazing and their defense really showed off their true potential to the crowd and they played with heart and that offense toasted the Eagles defense. I would say GREAT game to Washington a 4-5 team end a 8-0 teams streak. As a cowboys fan I will say that’s the best they have played! Congrats!", "THAT FINAL PLAY TOUCHDOWN WON ME MY FANTASY GAME ", "Heinicke has Tom Brady vibes man.  He doesn’t seem to care about anything other than leading his team to victory.  Doesn’t get bogged down or distracted, just determined and focused.  Knows who he is and what he can do", "Those Commanders are a tough match for any team in the league don't let them get that wildcard spot ", "That was the most tactical knee I've ever seen. Well done Commanders.", "Love how Cory is always being hyped and energetic in all of his uploads, I also greatly appreciate his consistent uploads", "Wow what a game so many opportunities for both teams and such a close finish.\nBoth teams left it all on the field just one team made a lot less mistakes.", "Love how the eagles crowd is silent when the commanders win", "As a Giants fan that was an entertaining game. NFC East baby. Its on !!!", "Soo good to see Washington rallying and not tanking. Love their heart!", "Heinicke played his heart out tonight! You could tell the Commanders came in for the win and nothing less. What a game! ", "Heinicke's heart and love for the game, the best no elite QB in the League.", "as a cowboys fan nice win Washington at least your QB stayed in a fought for this win and didn't disappear like ours", "Unbelievable...every now and then, the little guys come through...wow, wow,  and wow!!", "Washington playing to the fullest till last minute and beating undefeated teams Eagles...Just shows when an underdog team plays with it's full potential! Fantastic win !", "every second of this game was awesome! go commanders!", "I couldn’t be more proud of Washington. Heinicke is the answer for this Franchise. He deserves to start and stay the starter. Great road victory.", "12:22 such a smart play by Heinicke, way to understand the position you and your team is in and not try to keep the play alive for a big play.", "That Knee by Heineke was the most big brain play I've ever seen.INCREDIBLE...! ", "If you were to ask me who would beat the eagles, i probably wouldn’t say the commanders. This game was insane", "Вот так Вашингтон! Вот так красавцы!  Терри просто супер отыграл матч. Браво!", "That kneel-down that Heinicke took when he was scrambling at the end of the game was a 9000 IQ play. Most players wouldn't even think to do that 3+ yards deep. They'd likely slide or fall forward just trying to make up some lost ground. Very underrated play.", "Robinson Jr being able to run through & carry defenders after being shot twice in the leg earlier this year is amazing man! God is great ", "There is so much wonder and pain this episode. The trauma from losing a child is heart breaking and the voice actors have done a phenomenal job portraying the anger, hurt, and pain. Freya, choosing restraint despite her own grief is powerful. The grandmother rejecting her granddaughter because shes scared to love anyone else because they might be taken away from her again ?", "What a performance by the Washington O-line! #HTTR", "I watch this at least 3-5x a day Hail to them boyz", "Good for Washington, the team has heart. ", "Those eggles fans were very confident. Nice to see them put in their place.", "Looking at the Philadelphia fan's faces in the crowd was priceless", "The whole team plays with intensity when Heinicke is out there. 4-1. This is his team.", "That was a great job by Washington.Awesome defense and they came thru when needed to.", "Seeing Heinicke Cheering and aggressively celebrating as Robinson Jr. is fighting the entire Eagles front to cross the plane was inspiring!! I'm no W.C fan but that was a good football moment! A fired up QB and a never give up never surrender RB? Good Luck opposing team. 8-0? Try 8-1 son!", "WONDERFUL GAME HONESTLY THIS IS WHAT DESERVES TO BE PLAYED ON A MONDAY NIGHT!!!!!!!", "The Commanders played great tonight! The kicker Slye did great! Taylor Heinicke played awesome! I hope the Commanders continue to win!", "I've always said, Washington is one of those unpredictable teams just like the lions, u never what kind of team ur gonna face, great win for them", "Congrats Washington..you played like a champion.", "That was a good game. Good defense by Washington to get 3 turnovers and some third down conversions on the road. That 58 yarder was an omen. Then he kicks a 55 yarder! Wow. ", "As a cowboys fan , the commanders did what we couldn’t. respect", "A must win for Washington to go to a rival Philly on a MNF game to face an 8-0 team and defeating them was miraculous and amazing.", "That touchdown by Robinson tho……… ", "Seahawks fan here watching these highlights. That's a hell of a win for the Commanders. (I have to get use to calling them that still) \nYour kicker was in the zone though damn. lol He's out there making damn near 60 yard field goals like it was a chip shot. Great win for the Commanders. You guys looked good out there. Had no clue the Commanders have a pretty good looking team being on the West Coast.", "Congratulations, Commanders!! You played the better game today!!", "This makes me feel better as a Vikings fan because we lost pretty big to the Eagles but came back and beat the Commanders.  This shows that the Commanders are not a team to over look.", "This is the greatest thing a Giant's fan has seen in a decade", "Heinicke isn’t the best, but damn he’s got heart, guts, courage and his team loves him.  He’s a baller and I’m so happy the country is enjoying him. He makes the right plays at the right time.", "That must be a record last second touchdown! Congratulations Commanders! Your feeling Victory", "Will always be the Redskins for me ,great game!", "Got to give full credit to the Commanders.. They EXPOSED the Eagles weaknesses and gave them a serious REALITY CHECK!!", "I was so pleased to see Heinicke having enough time to throw the ball! Our O-Line stepped up to protect him. Our defense stepped up even more! Our kicker made FGs and extra points. The whole team stepped up and it was such an amazing game to watch! #HTTR #HTTC", "as a dolphins fan, this is very refreshing to see.", "Heinicke taking a knee is one of the coolest things that ever happened in a while. Mad respect!!!", "As a Dallas fan my week has been revived by the commanders, but good job by both teams ", "What a wonderful game for the commanders. I give you that one", "McLaurin has to be in the conversation for the most underrated wide receiver in the NFL.", "Commanders showed up and played their hearts out! What a game!", "From a Giant's fan I give much respect to Washington... It just got interesting indeed..", "Glad to have Lui back to the crew, this was such a great and remarkable moment for everyone.\n\nAnd that damn High and Squeaky voice. Just ah. Very Nostalgic.", "Good game, the commanders played very well which is more than I expected, and something else surprising was all of the mental errors the eagles made eventually costing them the game in the long run", "Well done Commanders I wish the saints and rams can win games like this", "As a Giants fan, I’m happy for the commanders for getting this W! VERY WELL PLAYED !!!! ", "My brother's a quadriplegic and to anybody who donated, I can say you did a lot and even though you didn't donate to us or anything I want to say thank you. It's a very hard life to live and support like this isn't just about money. It gives you inspiration and makes you feel like more than just the family cares and it hits deep so thank you for doing your part for your community :-/", "Meowscarada is definitely the pick Im going for. A guaranteed crit move that never misses is a huge deal I can just restart the game to get it with a nature that gives it better speed\n\nEdit: also it has great defense coverage. Weak against ice, fire, flying and bug types but it can learn Power Gem which can counter those problems", "I have been crying for the past few hours. This is legitimately heartbreaking. I cannot imagine how his family is doing right now.\nTechno (Alex) was my favorite youtuber. He always made me happy when I was having a crappy day. His videos made me smile even in the darkest moments. And now I can't stop watching his videos, but every time I watch them I am reminded he is no longer with us.", "What a great win Washington. That Was one heck of a Performance. Im a Bills fan , but you all just might make me a fan of commanders! Great Job enjoy .", "Can the Commanders overcome the off-field problems with ownership and make a playoff run?  They looked good against their NFC East rivals, the Eagles, dropping them out of the ranks of the undefeated, with good defensive play and moving the ball offensively.  Well done.  In a way, I'm rooting for them to make the post season.  I like the play of Heinicke at QB.  He can spread the ball around and is pretty mobile.", "Hats off to Washington.  What a terrific game.", "The second best game in this week, wow!", "Congratulations to the Washington commanders and Thank you. I am not fan of either team but was rooting for Washington.", "That kicker ", "Thank you Commanders for that W from a Giants fan ", "As a seahawks fan, this was fun to watch  im baffled", "Heinecke deserved this win, such a humble guy. Plays with all his heart every game", "This game and the Vikings game were the two most entertaining games I've seen in a while. What a great weekend for football. Too bad ESPN has a monopoly on MNF.", "Scary Terry is so underrated dude has never had a elite qb still gets 1,000 yards every year. And I’ve been saying Washington is scary they aren’t a bad team", "Thank you speed. This comeback is truly inspiring. I have never witnessed so,etching as powerful and good as this message. To celebrate this I will visit your house and give you roses. ^_^", "I'm 16 and still watching this shows how entertaining he is <3", "I-finally-came-back, this stream changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience =3:)"]}