{
    "video_id": "dZJIUQvUaSQ",
    "comments": [
        "Heinike celebrating that hit when he took the knee was absolutely hilarious.",
        "As a Giants fan, I enjoyed this. That is all. ",
        "They’re still named the commanders.",
        "Who else said “Commanders are gonna be the team that beats the eagles”?",
        "Good for Washington, the team has heart. ",
        "Just Amazing Washington, Congrats on your win & keep pushing",
        "Congratulations to the Washington commanders and Thank you. I am not fan of either team but was rooting for Washington.",
        "Winning all those games and losing against the Commanders... Seriously ?!!!!",
        "The WC really take the W back home",
        "What was that",
        "A game to humble the Eagles and they fans. \n\n\nScary Terry in black and purple would be crazy",
        "The second best game in this week, wow!",
        "robinson really wants to win... love that",
        "Nice job Washington Dems..",
        "This win over the Eagles, Packers over Dallas made it an OK weekend. Hell, it made a tremendous weekend.",
        "I’m happy. We lost",
        "Great job by the REDSKINS!!!",
        "Eagles are not as good as their record is.",
        "I called it! I knees Philly was guna lost this game before it even started.. Philly is good but everybody thinks their so great because of their record. But go back and look at the teams they’ve beat their all weaker teams. Ya they beat us but we were the only solid team they’ve played",
        "Philly got exposed lol",
        "Well done Redskins.",
        "Walk in ya trap take ova ya Trap",
        "It's so funny how eagles celebrating early LOL but who won#CongratsCommanders",
        "Thank you Washington!  No perfect season for the Eagles. \n\nSincerely, A Dolphins Fan ",
        "#HAIL #TAKECOMMAND",
        "Tres Way handling all those bad snaps on all of those awesome field goals goes HIGHLY unnoticed!",
        "You made the Saints ️ fans happy Washington 🥹",
        "Thank you Commanders for not letting Philadelphia get a better record then my 85 Chicago Bears",
        "Philadelphia Eagleeeessssuh Whaaaaaattt happeeeennnddduh",
        "We should change the name of the Commanders to the Washington War Hogs",
        "Stop sleeping on Taylor!!!",
        "That was the most tactical knee I've ever seen. Well done Commanders.",
        "The philly frauds finally lose ",
        "Seeing Heinicke Cheering and aggressively celebrating as Robinson Jr. is fighting the entire Eagles front to cross the plane was inspiring!! I'm no W.C fan but that was a good football moment! A fired up QB and a never give up never surrender RB? Good Luck opposing team. 8-0? Try 8-1 son!",
        "That was a good game. Good defense by Washington to get 3 turnovers and some third down conversions on the road. That 58 yarder was an omen. Then he kicks a 55 yarder! Wow. ",
        "Quick question yall\nNFC east  ~or~  AFC East\nWhich is the best division in football???",
        "Giants could win this div baby!",
        "They run into 49ers or TB eagles will be put out playoff only how they win if the defense do it and they run the ball I don't believe in hurts",
        "",
        "Eagle fans.. hold that L ",
        "AJ brown had an off day ",
        "Taylor > > > > > Carson. They need to kick Wentz out of the league.",
        "Dancing on the eagles field at the end? Was nice to watch..",
        "Mclaurin is my last name to",
        "The greatest take a knee play ever.",
        "Thank you for your service, Washington.",
        "How about the kicker for the Commanders. 2 50 plus yard field goals! God damn! Give that man a game ball",
        "Se calzonearon",
        "cringe",
        "I'm an Eagles fan and I didn't like that last call where Heinicke took a knee, It looked like the defender couldn't stop in mid air but what do I know lol. But otherwise Washington played better in every category, they deserved that win. I just hope Philly learns from that loss!",
        "Cry Eagles Cry",
        "Fun fact this the second time we beat a undefeated team the first was the steelers now the eagles very happy for Heineke fr he's really helping turn things around fr I'm glad we playing him Wentz wasnt doing anything compared to heineke congrats Washington ",
        "So nice to see almost no one crying ab the refs in the comments",
        "eagles fans punching the air ",
        "Who could’ve predicted that the NFC East and AFC East would be the most unpredictable and most entertaining divisions in the NFL this year?",
        "HOW BOUT THOSE SKINS!!!\n#HTTR",
        "divisional games are the toughest to bet. Thanks for the Win Commanders $$$",
        "This makes me feel better as a Vikings fan because we lost pretty big to the Eagles but came back and beat the Commanders.  This shows that the Commanders are not a team to over look.",
        "My Washington football team....and they play à poor game....",
        "Heinicke looked great at times last year and I was surprised he wasn't the starter this year.  Great job REDSKINS.",
        "Well, dang. I was hopping the Woke Commanders would win this one. They still played a solid game.",
        "The fact that they called 12:25 roughing the passer and not the facemask on goedert?",
        "GO SKINS!!!",
        "Well done Washington,  great win",
        "Any given Monday. A nearly perfect first half by the Redskins. Almost everything was working. What a game! Heineke really gives this team so e fire. Hopefully they keep playing this good. Hat's off to the Eagles also. They're  tough to beat.",
        "Let's all just pray. That Wentz won't start next week. Please!",
        "Heinicke > All of Philadelphia sports",
        "I watch this at least 3-5x a day Hail to them boyz",
        "Heinicke was out here looking like Brady in the first half.  What a game!",
        "This whole game was bushleague.",
        "I love how the commanders won this, when the commanders made a 58 yard field goal the Philly fans started booing very unsportsmanlike. Karma at its best ",
        "Dang me personally…",
        "As a cowboys fan, Dak may just be the 3rd best qb in the division now... at best",
        "Hats off to Washington.  What a terrific game.",
        "Super impressed by Thomas. Very dependable. And Robinson is something else, hulk smash.",
        "Lol at 4:35 or so right after the pick you can see how salty number 14 on the eagles was about it he tried batting the ball out of the guys hand",
        "Thanks Commanders for the Win, Cowboy Fans needed this to happen",
        "As a jets fan I love seeing the underdog take the win",
        "AJ Brown was shut down!!",
        "*redskins",
        "Congratulations Commanders fans. That was a great win!",
        "Like I said, Eagles don’t play anyone good!! Way to go Commanders, from a Dolphins Fan.",
        "Boo eagles",
        "All I can say is you can only throw it up to your best wr so many times",
        "Washington getting a TD off that goofy lateral at the end was hilarious lmao",
        "Talk about ending a winning streak ugly.",
        "*Warriors",
        "The Washington kicker had the game of his life for sure! A career long 58 yarder plus 100% on all the others. Great job from the whole team!",
        "Philly can’t stop the run",
        "All eagle fans are  silent",
        "I used to be undefeated like you, but then I took a quarterback to the knee.",
        "The worst thing that happened to me on Monday",
        "I was pissed when they lost lmao",
        "Mllll",
        "Heinke kneeling, instead of flopping down.  Perfect set up to draw that penalty.  High IQ play.",
        "Congrats on the flukey win by the WFT with a lot of help from the refs. Games ending on bs penalties is a bad look for the NFL. Good for Vegas though. ",
        "From every Giants fan, thank you Redskins.",
        "Proud of young Jalen Hurts, this loss wasn't on him, though he will tell you different. He tried and had no idea the rest of his squad would cough up chances to actually win this game. From the INT that hit AJ in the hands and AJ handed it to the DB, Goedert coughing up the ball despite the face mask, Watkins coughing up the ball instead of either staying down or just run under the ball and not dive and get back up, Refs tacking on more yards for a \"late hit out of bounds\" or Brandon Graham sliding into Heineke at the end of the kneel down. Eagles did everything to hand the game to the Commanders and young Jalen Hurts still fought. Oh well. You play stupid games and win stupid prizes. Hot L served to Philly. Congratulations Commanders. Yall bet not let Wentz back as the starter, where so many fans made excuses on why Wentz was getting sacked and not doing so well meanwhile Heineke is playing way better than Wentz. But he makes all the money so, what will the front office do now?",
        "Smii7y's editor is cultured, in a whole lot of ways B-)",
        "Tremendous upset by the Commanders. Giant's fans thank you.",
        "Eagles fan here. Very sad loss but it was a hard fought game. Those fumbles from Quez & Godert rlly hurt. Hurts played his ass off and so did Heinicke. Excited for both teams futures... Still very upsetting tho.",
        "Eagles had plenty chances to take the lead before that penalty. Hell of a division road win by the commanders.",
        "Great win for the Commanders! They put a licking on the Eagles!",
        "Personal foul = Bullsh t call. Eagles were robbed. Refs had $ on the commanders fo sho!!",
        "Pov you came here to see who would be the first team to beat the eagles",
        "The comedic cut from him screaming to him suddenly on his last lifeline seemed very Lixian esque and I cant stop laughing  :-)",
        "How about that",
        "Eagles gotta hold on to that ball. Great job W",
        "What a great win Washington.  That Was one  heck  of a Performance.  Im a Bills fan , but you all just might make me a fan of commanders!  Great Job enjoy .",
        "Glad to have Lui back to the crew, this was such a great and remarkable moment for everyone.\n\nAnd that damn High and Squeaky voice. Just ah. Very Nostalgic.",
        "Lolz y’all got beat by wentz sorry ass\n\nEagle down ",
        "A 15 yard penalty because the qb decides to sit down is BOGUS!!! #FLYeaglesFLY",
        "I love her videos that she makes with her friends and family. Lets get her to 15M.",
        "Without a dought The game of the Year",
        "From a Giant's fan I give much respect to Washington... It just got interesting indeed..",
        "Again you spoiled the winner in the thumbnails. Who the hell is doing this every single video? I could do a better job",
        "Ref are blind .",
        "can our receivers not fumble on our last two possessions",
        "From Cowboys fan:  Great game Commanders the  NFC East Division is fun to watch again",
        "Is it me or were there a ton of bad spots by the refs on the commanders",
        "nice game",
        "I've always said, Washington is one of those unpredictable teams just like the lions, u never what kind of team ur gonna face, great win for them",
        "Smith's lateral attempt won me my fantasy matchup...",
        "I love how much time they take off the clock with these long drives, like the one drive that took 16 plays, but was successful. Go Commanders!!",
        "SPECIAL TEAMS",
        "Like I tell someone on fifa online wen I win na na hi hi good bye",
        "Heinicke should be their QB. The way the team rallies around him when he plays should show that the commanders are his team. Wentz just doesn’t seem to get that kind of energy from his team.  Ron Rivera even said the issues were with QB when Wentz was playing, only to “back out” of that statement when realizing he basically calling out Wentz their big money acquisition. ",
        "Unfortunately it seems that the Washington Redskins have the magic formula when it comes to beating undefeated teams from Pennsylvania as they ended the Steeler's 11-0 streak a few years ago also!!!",
        "After an impressive win tonight, Washington has a pretty good shot to make the playiffs",
        "Hurst just showing he is not an elite QB that's all",
        "Alot of people including myself are happy that the Eagles are no longer undefeated. Way to go Commanders",
        "That was honestly probably the biggest upset of the season so far omg the commanders played some great football and defeated the undefeated wow good run for the eagles still a great team especially Hurts",
        "Heineke is almost what Tim Tebow should have been in the NFL. Able to make plays and go get that win when your team needs you.",
        "I hate the Eagles DBs play so far off the ball. #firegannon",
        "Goedart was NOT down, wtf? Should’ve been fumble recovery TD. I Guess ball doesn’t lie",
        "awesome win",
        "Was not expecting the L, definitely not from the commanders",
        "Washington really entered the blind ref cheat code.",
        "Ravens fan here. Good win commanders.",
        "I am not a Commanders fan but their  sideline energy is amazing",
        "Yes",
        "Washington is not going anywhere.",
        "That was a big brain play by Heinicke at the end.  He knew they were pumped up and ready to hit him so he took an early knee when he saw them coming knowing they would still try to hit him down because most people in the moment forget the rules.  I can respect that!",
        "As an Eagle's fan i still love my team!!  FlyeaglesFly!!!!!",
        "such a great win for the Commanders offense, defense stepped up hella… Heinike the GOAT",
        "Such a great win for The Commanders!",
        "Joey Sly was in the zone!",
        "steelers can sleep peacefully now",
        "The Eagles are the great pretenders, of the NFC EAST!",
        "Great job commies as an eagles fan, but some plays was us v refs",
        "I still call them the Redskins in public. No one seems to notice.",
        "et that up commaders",
        "An eos iusto solet, id mel dico habemus.",
        "Great Football play to seal it.",
        "That Knee by Heineke was the most big brain play I've ever seen.INCREDIBLE...! ",
        "How embarrassing a team who is not been paying well beats a team that was undefeated lol its coming back to them",
        "LMFAO Philly gonna get greased by the Giants in the divisional round. Giants vs Vikings in the NFC championship game & Justin Fields will run for 150+ yards & the 9ers will lose by 1 point.",
        "That was no flag at the end. 2 seconds is not enough time to hold off on a hit.",
        "When I watched the end I was in shock when Washington was gonna win, and when the Eagles got the ball, one of them threw a interception and a easy touchdown 32-21, and hitting the GRIDDY",
        "It is the second time in three years that Washington go on the road and beat an undefeated Pennsylvania team after Election Day on Monday Night Football.",
        "that'll put a spark to your season",
        "Washington won but they also broke them boys too ",
        "Men working! This Washington team is amazing.",
        "Overrated eagles lost to Washington ",
        "That was a great win!",
        "Folks, I became a Commanders fan tonight.",
        "I am so proud of Washington.They have been my team since I was 5 and now am going on 50.",
        "week 10 was full of upsets but as a cowboys fan i’m glad the eagles lost!!!",
        "Wheres that effort and play been? Actually looked like a really good team.",
        "The 'W' on their helmet stands for 'woke'.",
        "Really impressive by the commanders",
        "Объясните что это было в конце за игра ?",
        "As a supporter of any  team other than the Eagles my heart felt Congratulations to Washington.",
        "After multiple eagles fans were clowning the cowboys for losing to the packers, this was exactly what I needed",
        "I have to say commanders have really had a game plan against the eagles great game guys",
        "This is insane. Eagles got comfortable and the mistakes just kept piling up. Embarrassing loss.",
        "Wow",
        "i think he’s a loved guy people wanna play with him...carson has more skills but something there and maybe team gelling together and eagles are overrated this proves that nfc east has the easiest schedule in NFL",
        "NFC East, the ONLY division in football where records doesn't matter. EVERY team will give each other a headache trying to beat the other",
        "Hahahahahahahahhahahahahahahaha Flop Eagles Flop!",
        "Dem! CO! MAN! DA's !!!!!!",
        "Washington playing to the fullest till last minute and beating undefeated teams Eagles...Just shows when an underdog team plays with it's full potential! Fantastic win !",
        "Heinicke is such a baller, a playmaker and a gamer. He does not have the greatest or even an average arm, but he just keeps winning games for some reason",
        "The Miami Dolphins undefeated season will remain",
        "This is probably the greatest game I’ve ever seen from a terrible NFC team. \n\nThat kneel at the end was F’ing genius!!!! ",
        "After so many people thought Washington had no chance, Washington pulled through!! Awesome man!! So happy",
        "Commanders are the best team in the NFL only against undefeated teams lol",
        "cool18",
        "So glad we lost. \n\nThis literally made us stronger, Pushed howie to pick up two major players ",
        "Heinickie is HIM. These games he’s playing and winning are insane. That knee play was so incredibly smart to do which is all football is about. Georgia boy ",
        "Too many turnovers in crucial situations & too many penalties did the Eagles in.",
        "How about them Redskins!!!!",
        "Miami Dolphins will remain the only undefeated team in NFL. Thanks Commanders .",
        "We still the best team tho. #GoBirds",
        "Y’all ask like you won the SB.  Eagles played a crappy game and we deserved to loss.",
        "Not Jalen's fault.",
        "Eagles you were who we thought you were and we didn't let you off the hook ",
        "Eagles fan here, GG washington, yeah that face mask no call was disgusting, but you guys just wanted it more this week and it showed",
        "11:40 Watkins should’ve just stayed down",
        "Thanks you Washington, Congrats to the 1972 Miami Dolphins ",
        "Can't remember the last time they scored 30+ points without getting a passing TD. Great road win guys!",
        "i hate the washington commanders (known as the washington commies on social media) for many reasons but i still cheer for heinicki.",
        "This looked like a high school football game.",
        "You don't know how fast my adrenalin is when I saw the cammanders intercept those and fumble the ball from if it was the super ball then ",
        "As a huge Eagles fan, as much as this loss sucks for us, kudos to the game the Commanders played tonight. Enjoy this one, you earned it! ",
        "@0:48...yap that's the pain that is about to happen lol",
        "Hats off to those Washington fans in the video who attended the game.  This Monday Night  game was in Phily",
        "I never bet on football but was like fck it. Eagles are looking good and are 11.5 point favorites at home! What could go wrong!!!!!",
        "2 MANY PASS PLAYS FROM THE EAGLES.    COACHES LOST THIS GAME ALONG WITH EAGLES WR WHO FUMBLED",
        "After my team lost, this was sweet to watch. Thank you Washington\n\n\nSincerely,",
        "A little advice.... if he kneels down, DONT HIT HIM!!!!",
        "Washington plays with heart when Heineke is out there. It’s great to see",
        "I almost didn't bother to watch this game. But I had the feeling that the Swamp Hawgs were gonna pull off an epic win over an undefeated team. I was right !",
        "That is a upset",
        "Nothing lasts forever. Great run by the birds.",
        "I didn't get to watch the game. Glad the eagles lost. Does the NFL not make teams finish? Weren't they allowed a field goal?",
        "Another Rigged Thursday night ",
        "As a Pittsburgh fan heinicke should’ve pointed at the eagles",
        "That Heinicke knee at the end was genius holy hell.",
        "Levi",
        "Good win by the Commanders, better to have a loss in the regular season than in play offs. On to the next game, go Eagles =}",
        "yesirrrrrrrr",
        "Wow, did not expect 8-0 team will lose; then again, any given day any team can lose or win but Commanders have good QB, good defense so Commanders earn sweat and much need victory! Well done indeed commanders and enjoy!",
        "LMAO! I can't believe Eagles went out like that.\nAlso can't believe the Philly fans didn't start throwing stuff after the loss. ",
        "I never wanted Washington to win so badly. \n\nSincerly \nOne real Giants fan",
        "Not sure if Taylor Heineke balled out or Washington's defense flexed their muscles. Perhaps both?\n\nRegardless, congrats to the Commanders on the MNF win!",
        "“We need to stick to short 2nd and 3rd downs” nfl highlight cuts to 3rd and 8",
        "Is actually a good thing the Eagles lost the game before going undefeated the whole season and losing game in the playoffs",
        "Really great win by Washington, but not about sit here and pretend like these NFL refs are getting worse by the minute. Literally handed Washington points.",
        "Damn, I was actually looking forward to the prospect of Jeff Saturday potentially ending Philly's undefeated season",
        "as a football fan i prefer to see the players determine the outcome of the game. not the refs. when the game is fixed it reflects very poorly on the refs & the commissioner. i find myself watching less and less football every season for this reason. bias/ corrupt refs have severely diminished the quality of the game. why is every profession held accountable except for sports officials? will the NFL ever attempt to fix this?",
        "LETS GO WASHINGTONNN",
        "Alex may have died but Technoblade will never, thank you Techno for having an impact on everyone, in the gaming community, you will always be remembered as the first pig to fly\n\nStay strong Dave -_-",
        "Taylor heinicke is playing really good and the energy from them with him as quarterback is amazing",
        "Bad call on st juste",
        "Jalen Hurts shows his true colors Bumb not going to the super bowl",
        "It trips me out Eagles lose one game and all of the sudden they suck.",
        "Great job Commanders! Only thing that makes that Packers loss for my Cowboys better is the Eagles losing their winning streak ",
        "Skeppy, you have been avenged just shows the close relationship they share and how wholesome they are to each other hurt because of other videos and how close they seem and u can see the pure joy and happiness in their voices and actions",
        "I'm 16 and still watching this shows how entertaining he is",
        "miracle hinacky",
        "I-finally-came-back, this stream changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience =3:)",
        "DLaw says he's playing this week? He couldn't play if his foot was really fractured.",
        "Missed face mask was crazy man. But only the first lost game we can come back!",
        "W",
        "What a Great win by the Commanders!",
        "Is it finally safe to be a Washington fan",
        "The thing about playing a .500 team is you're not really sure what they can really do. With a 1000 team, you've pretty much figured out most of their tricks. Fly Eagles fly anyway.",
        "NFL = The Big Fix",
        "Let's all agree on one thing if wentz would of started they wouldn't even had a chance.  And I'm not even a Washington fan but Heineken has proven he is more than just a backup.",
        "Missing that facemask on Goedart is horrendous.",
        "Great victory for the Redskins!!! Never heard a crowd so silent!!!",
        "I love how sundee manages to keep his old viewers entertained along with bringing new young viewers into the sundee gang 3:-)",
        "From a Cowboys fan, thank you Commanders.",
        "Love how the eagles crowd is silent when the commanders win",
        "Вот так Вашингтон! Вот так красавцы!  Терри просто супер отыграл матч. Браво!",
        "the eagles took a big L",
        "Congratulations to all the\nW's out there ",
        "A lot of people here didn’t watch the game lol. Horrible officiating",
        "12:26 What a stupid penalty. The whistle was blown as these dudes were in motion just inches away from making contact with the QB",
        "So who had money on the Commanders beating the unbeaten Eagles on their home turf?!",
        "commanders put one heck of a show out there. now we’re 8-1",
        "As a Cowboys fan this helps my sadness of our loss",
        "Best game all season haha",
        "Scott Turner might have finally woken up that the strength of our team is running the ball not throwing the ball 40 times a game. Especially with heineke abdthat o line.  St juste and forest  And Davis coming into their own.",
        "This game tells me that philly is a total fugazy!!",
        "That was the first time I ever rooted for Washington and I'm so happy they won. I needed a pick me up after we lost to Green Bay. ",
        "Yo... when did Washington start getting good?",
        "Amazing game! Washington restored my faith in football! Football has changed so much and it's refreshing to see old skool play again! From a Packers fan...congrats Washington!!",
        "Washington's kicker was the real MVP",
        "Everyone forgets heinkei went toe to toe with time Brady in 2020 play offs",
        "Name Jacob a year",
        "but that face mask tho",
        "really surprising a sub .500 last place team goes into the house of an unbeaten team and wins by 10+. Nice job Redskins",
        "This is something the eagles needed to happen. Bringing them back down to earth for a bit will ultimately be good for them, especially in the postseason",
        "Never in my 67 years have I seen a NFL so freaking close in talent that fortunes can turn on a dime. I'm still stubborn and think that especially K.C. and Buffalo got the edge on anyone and that Philly is still the best in the NFC - but in 2022, who really knows. CONGRATS WASHINGTON!",
        "Can't believe I didn't watch this game live because i thought philly would blow out Washington. I'm so pissed.",
        "I dont understand how the refs expect the defense to simple back off when Heinicke took that knee.",
        "Filthadelphia loses!!!!!!!!",
        "joe buck was electric for that robinson touchdown",
        "Congratulations, Commanders!! You played the better game today!!",
        "unbiased eagles fan h8 sayin this but refs no calls rly rzn we lose. ridiculous. getting players hurt",
        "Cowboy fan that needed this after we got robbed in Green Bay by the refs on 3rd in OT. Defense played lights out.",
        "Eagles have had a cupcake schedule all year and for sure overlooked the commanders. Rivera had his guys ready to play. Incredibly impressed with the Commanders’ efforts in all three phases of the game.",
        "As a dolphins fan, thank you for stopping them",
        "Devonta scores a touchdown on his birthday. Now that’s a good way to start your birthday",
        "Brian Robinson is super human. This kid was shot several times last month and to see him so dominant is awesome.",
        "The Eagles have landed  Wentz is trash ️ keep Tyler H. As the starter. The Eagles really killed them selves in this game ",
        "ima cowboy fan but this make me happy",
        "Eagles 0-1 since fetterman just saying",
        "Somebody lost a lot of money that's for sure but I feel the Eagles needed to lose now to keep their fire",
        "everyone thought i was playing when i predicted a commanders win.",
        "We got a good ass game this Monday night. Hopefully greenbay continues to play well. So we get another great prime time match",
        "Even though the score was close it was philly's game to win the fumble cost us our last chance to win but the the refs helped don't see how you don't call an obvious flagrant foul. Goedert literally  almost had his neck broke and they don't call it. That was a game changer. The refs can make or break a game depending on how they feel. Just like when the falcons lost to the bucs on a bogus call. Some of these refs is trash",
        "That was cool for the lineman ",
        "As a Giant fan,  i must admit i was impressed by Washingtons' road victory in Philly....   Heinicki really stepped up his game....",
        "the Eagles defense. I would say GREAT game to Washington a 4-5 team end a 8-0 teams streak. As a cowboys fan I will say that’s the best they have played! Congrats!",
        "Unbelievable!️",
        "Philly has some issues defending the run, this has been seen all season as well. Teams are going to take notice to this while filling the box on defense and playing man more against them....we'll really see if the Eagles are legit or not when that happens.",
        "What a CRAZY game!",
        "AJ Brown was in his BAG in this one! 1 reception. 7 yards! ",
        "What a game from the commanders!",
        "What a game…congrats to the Commanders for bringing their A game tonight on MNF…. it’s gotta be the most watched game this week besides that Bills and Vikings game :)",
        "When you penalize the Eagles for their dirty plays they won't even beat a sub .500 team at home.",
        "wtf Wentz aint play maneee",
        "Don’t be in undefeated and play Washington they will beat you anybody remember when Steelers where 11-0 but played Washington AND LOST LIKE dOnT pLaY wAsHiNgToN iF YoU aRe UnDeFeAtEd",
        "Redskins commanded that win.",
        "That last play definitely show the weakest lost that was deserve",
        "He sold that knee penalty better that CR7 sells his calls ",
        "12:22 such a smart play by Heinicke, way to understand the position you and your team is in and not try to keep the play alive for a big play.",
        "that ref sold the game bruh",
        "Always those divisional games. \n\nThe Commanders are apparently the bane of undefeated teams at the moment...",
        "Them offensive turnovers are what killed us. If Quez didn't drop that ball... Man I'm so mad",
        "Where is all the annoying eagles fans at now? Yeah..the wooped you..with a backup...in your own house...",
        "As a giants fan thanks Washington",
        "The legend of Taylor Heinicke continues.",
        "You missed your chance Dallas….NYG’s, it’s up to you!",
        "Hahaha ! Eagles about time, tell you the truth you guys haven't really played any games against top teams, you guys aren't going to a Superbowl! Sorry, but you aren't , bottom line, homes!!!",
        "I just came to see the eagles fans cry",
        "This could be a turning point for Washington.",
        "This eagles loss is gonna make them so much more terrifying",
        "Cowboys fan here. Was definitely an interesting turnout for this one. Good job Washington. Respect.",
        "Good game but Philly got a few calls that didn't go there way",
        "The facemask on Goedert???",
        "Giants fan here just wanting to say thanks to Washington for ruining the Eagles perfect season",
        "Feels good to be proud of Washington!!",
        "Not an Eagles fan or Commanders fan but in my book the Eagles didn't blow it THEY GOT BEAT by the better team.",
        "Give my boy Heinicke the starting position ,",
        "That last lateral by devonta Smith that went into the end zone at the end of the game counted as a fumble in fantasy and the -2 points my opponent got was enough for me to win my game. Wow",
        "the fact i really want to play with them some time makes me so happy",
        "I have never seen a QB just take a knee like that. Strange looking play.",
        "As a Giants fan that was an entertaining game. NFC East baby. Its on !!!",
        "I think the refs mismanaged this game towards the end. The commanders should not have been given that fumble recovery possession. The Eagles player had his entire face mask grabbed at a full speed pivot and then yanked downward while another commanders player grabbed on to his back and forced his weight on. With that type of violent face mask hold… no single player could still keep possession of a football… it should have been ruled as so with the penalties attached.",
        "NFL shame on you for wanting people pay to watch football that what commercial pay for lots couldn't watch this year",
        "It’s so nice not having to listen to these two commentators on Sunday anymore !",
        "I'm not a hater or anything, but it's good to see a good but not superhuman eagles team finally run out of luck. I think they were a bit overrated. Definitely a good team though. I'm happy for Washington. They haven't had a good season since RG3...",
        "Hahahaha",
        "1972 Miami Dolphins is still Gold. Good effort by the Eagles and should be congratulated. No one expected them to be 8-0!",
        "I can't  believe that the commanders won",
        "The Commanders should stop searching for a franchise QB. Their QB is Heineke; he looks so much better than Wentz.",
        "I’m happy for the Commanders  they won as a team not just the players but the coaching staff as well",
        "Wow what a game tonight by the Washington Commanders",
        "Commanders came to play tonight.  Great effort by Brian Robinson.",
        "Heinicke did a high IQ thing to ice the game, i am genuinely shocked",
        "Officially the best division in the nfl hands down",
        "Damn",
        "Rip to my uncle Tony Torres huge redskins/ commanders fan my uncle died from cancer about a year ago and I know he is smiling rn in heaven and ima raiders fan might start rooting for the commanders just for my uncle feels right congrats guys ",
        "The Commanders played my Vikings tough last week. I knew they were going to give the Eagles a good fight. Their defense is pretty freaking good. Also, Henicke is a baller. They would be idiots to give the QB job back to Wentz",
        "Heinicke with the 1000 IQ play to seal the deal. The TD by Toohill was the cherry on top. Philly was an 10 1/2 point favorite, and managed to lose by 11.",
        "EagLes",
        "Good job Washington, this sparks joy.",
        "Philly will be in the playoffs,Washington will not.These games happen like the Colts beating the Chiefs earlier this year,it's the NFL.",
        "imagine  going  undefeated for 8 games straight just to lose to the commanders",
        "I slap your mind",
        "another undefeated team Washington has beat ",
        "Fake games",
        "Good job  COMANDERS",
        "Youd think if theyre gonna get rid of such an iconic name like \"the redskins\" theyd think of something better than \"the commanders\"",
        "Loved seeing the rushing QB’s take the L this week",
        "Congrats Washington Redskins",
        "THE KICKER AND THE DEFENSE WON THAT GAME.",
        "Can the Commanders overcome the off-field problems with ownership and make a playoff run?  They looked good against their NFC East rivals, the Eagles, dropping them out of the ranks of the undefeated, with good defensive play and moving the ball offensively.  Well done.  In a way, I'm rooting for them to make the post season.  I like the play of Heinicke at QB.  He can spread the ball around and is pretty mobile.",
        "This game showed the importance of having a good steady reliable kicker.",
        "WOW WASHINGTON props to you! From a Cowboys fan 11:35 the game really changed with that eagles fumble. Then the ENDING TD Never heard an eagles game so quiet! ",
        "i be damned. good for the REDSKINS!",
        "There is so much wonder and pain this episode. The trauma from losing a child is heart breaking and the voice actors have done a phenomenal job portraying the anger, hurt, and pain. Freya, choosing restraint despite her own grief is powerful. The grandmother rejecting her granddaughter because shes scared to love anyone else because they might be taken away from her again ?",
        "As a cowboys fan I love watching the eagles lose! But at the same time, Washington is really starting to heat up! Our division is looking scary..",
        "Nooo",
        "Vegeta what does scouter say about his football IQ?\nIts over 9,000!!!!!!!!!\nHeinicke WHAT!?",
        "12:23 watch the big man OL # 53 try and ram one of the defenders and just fly in-between them straight to the floor ",
        "Was good game to watch in person",
        "Httc!!!! Cry eagles cry",
        "The redskins look like a completely different team since the start of the season",
        "Hahaha the Philly crowd went so quiet after the last td",
        "eagles made big mistakes yesterday, costed them the game. The odds were +500 for washington to win full game btw",
        "Definitely unnecessary roughness on graham he on a knee n quez got all that speed just to cough ",
        "Thanks NFL for giving the eagles an easy schedule",
        "Heinecke is a baller… brought them to the playoffs just to get replaced after 1 full season of play. Comes in and now the  commanders are 4-1 . He’s really like tht ",
        "Terrible PI call ️",
        "Federer",
        "Are the Vikings now the best team in the nfc",
        "Never pass interference from St. Just",
        "Redskins kicked our ass, ouch.",
        "That’s why you don’t bet on sports. Crap like that happens at the end and a sure thing turns into a nightmare.",
        "the guardians played well",
        "Wow what a game so many opportunities for both teams and such a close finish.\nBoth teams left it all on the field just one team made a lot less mistakes.",
        "That was a wild game ngl, eagles looked horrible tbh",
        "That kneel was a 200 IQ play lol.  Don't hate the player hate the rules.  That was a legit call.",
        " I’m a giants fan and taylor heineki is soo much better then especially with Terry Mclaurin",
        "Talk about “going commando “",
        "Heinicke was great, but nobody is talking about the Washington defense.",
        "In Week 7, the Panthers stunned the Bucs and the Bears stunned the Pats. This week in OT, the Vikings stunned the Bills and the Packers stunned the Cowboys snapping their 5 game losing streak. Now the Commanders stunned the no more undefeated Eagles. Point being any team can win any game in any week. This is what makes the NFL so interesting and exciting!",
        "Wow what a game….. Washington came ready!…..never realized their kicker is pretty friggen good….53, 58 yard field goals…dude was good under pressure",
        "Great Game!!!",
        "Chase Young has been activated!",
        "Not sure why Taylor wasn’t starting all along",
        "Washington Loves to End Undefeated Seasons ",
        "I havent been following the NFL for that long, but to me this season seems crazy.  Everbody is getting beat multiple times, usually there are a few teams with a lot better records than this",
        "HTTR️...London N15🇲🇺",
        "Wow! To be brought down by a team of 5/5 is outstanding.",
        "Everybody gets lucky sometime..",
        "There is know way the Eagles allowing these guys to be wide open something isn’t rite.",
        "“fLy eAgLeS fLy” HA HA GLAD THEY LOST!!",
        "Maybe I'm the only one in the world who noticed how clutch the holder was on the field goals. Yes, the holder. He saved Washington from a few botched field goals. ",
        "That blatant missed face mask call threw the whole game",
        "It’s a whole different feel with Heinicke in the game… Never feel that you’re out of it ,he’s such a gamer such a good player! Wentz is a 2nd stringer..(maybe).",
        "Fly eagle fly haha watch real close for now on is downhill ️",
        "@ 5:05 “Don’t put a safety on me!” ",
        "Heinicke might not be the greatest QB but the kid has some football smarts.  Taking a knee and drawing that foul was genius.",
        "Nice win Redskins Eagles are overrated",
        "This is one of the more aggravating games I have seen as a fan of Philly",
        "nice",
        "And the '72 Dolphins pop the cork again. Thank you Redskins!",
        "I love this game clearly shows how to humble a team and it also shows that no matter what your record is as long as you can make it through your division you can make it to the super bowl not saying Washington is a super bowl team they could be all I'm saying is make it through your division make it to the playoffs you have a chance even at 5-5",
        "Not them hittin the griddy at the end ",
        "Y'all can thank the REFS for y'all SB win Washington! You'll see Philly on y'all couch during the Playoffs ",
        "The Eagles are decent this year but their easy schedule could wind up being the downfall of this squad. 2nd whoever put this schedule together for them, I believe,  did them a true dis-service.  Most teams that coast through regular season without being battle tested like my parents use to go",
        "Wathcing all the Eagles fans cry over every penalty is glorious lmao.",
        "How difficult the game is mentally is over looked. That rougher the passer penalty at the end was a matter of a half second maybe less.",
        "Wow, didn't think the Eagles could be beat by anyone much less Washington; great win.",
        "BOOM!!! Eagles suck! SKOL VIKINGS.",
        "Eagles should focus on playing better  instead of sending first down notifications on every play.",
        "This is the greatest thing a Giant's fan has seen in a decade",
        "Second quarter 2:22 man got trucked",
        "these receivers for the eagles let the team down man. two extremely costly turnovers...",
        "To people who said \"first\" I really wish that it wasn't a word",
        "Penalizing the Eagles for knocking the downed Heinicke is wrong.  The lawyers are killing the spirit of football.  You've got to allow effort beyond the play, otherwise the players will start turning it off too early.",
        "That Commanders defender who scooped up the ball at the end of the game and scored was thinking \"That was the easiest TD of my career!\"",
        "Vegas Calling",
        "Scary terry is worth every single cent!!",
        "I can’t express my gratitude for the commanders enough. Sincerely, every single Vikings fan.\nYes I know Vikings lost the head to head but now they only have half a game lead",
        "Ron Rivera managed this game like a boss!",
        "Big W #Hail",
        "Zebras were pathetic, but Philly should have done better",
        "As a Giants fan, I’m happy for the commanders for getting this W! VERY WELL PLAYED !!!! ",
        "I just came back to watch this highlight for the 3rd time ",
        "Washington REDSKINS.",
        "The refs blew that fumble touchdown call BIGTIME!!!",
        "Man, defense really wins games. Great game!",
        "From a Viking fan.  Thank you Washington for giving us a better chance to get the #1 seed!  Skol",
        "Fake  flags",
        "Commanders played very well. That knee,",
        "I probably watched this as much as I watched the victory over Tampa last season GO SKINS.",
        "Taylor isn't the biggest player, but he's got a big football brain. Another W for Washington, very happy fan in Australia.",
        "Not a fan of either team, but that was a good game. The Washington kicker deserves the game ball. 2 powerful kicks 50 yards + !! Those two kicks is what gave the Commies the game. Good job.",
        "Birds played sloppy but lets outline the 3 blown calls for everyone in the back:\n\n1) Gardner Johnson's hit was not late\n2) Goedert's face mask was obscene (game changer)",
        "Good game by both Teams. If I'm the Eagles, I'm kinda glad the pressure of a Perfect Season is over.",
        "My teacher and a student were “beefing” since my teachers favorite team was the commanders and the students was the eagles, I think this settled the beef",
        "washington sure doesn’t like undefeated teams.",
        "The crowd was insanely silent",
        "17-0 ",
        "HTTR. I have no delusions of a playoff berth, but a heck of a game and glad to come out of Philly with the W. Fly turkeys, fly.",
        "I didn't even watch this game because I thought the eagles would win hands down. Good job commanders, didn't expect you to win.",
        "Lets Go Commanders.!!",
        "This game was not fair to me,One of the commanders grabbed the eagles helmet and threw them down",
        "the fact that the commanders were playing their best football and the eagles playing their worst and still had the commanders on their toes says a lot",
        "Kina reminds me of me when have ta go down there and shodem Redskins up and sendum packin back to DC.",
        "The best part of the modern NFL is the players now letting us know when they get a first down.  It's the biggest improvement since the TV broadcasts started putting the score at the bottom of the screen. \n\nHonorable mention: The double 14 inch bicep pose after making a play.",
        "Did Watkins even need to dive on that catch he fumbled? Looks like he should have just caught it in stride and right into the end zone.",
        "Its a disappointing way for the eagles to lose their record but I mean it's self inflicted. Gotta know better than that, even if your intention was to make sure he's down, should've just used a hand to touch the guy.",
        "WHO DEYYYYY  ",
        "Im just realising that Im early! Yay! But really interesting like always!",
        "Best believe you are going to see QBs start taking knees like that...that was not an accident and there will have to be a rule change. He set them up lol",
        "All I can say is, WAY TO GO Washington! Stop doing the griddy cuz it dumb",
        "The commanders delivering that Philly special.",
        "Let’s go Redskins (OG)",
        " he’s getting his legs back",
        "eagles fans right now: the game is rigged ",
        "Pleasing",
        "Philly can you hold this L for me?",
        "999 iq lvl on the knee",
        "As a Eagle fan, the refs missing that Facemask call was crucial….but anyways Quez is gonna have to not let that fumble bother him into the next week for sure.",
        "Washington Commanders the Undefeated Killers. Ended Steelers 11-0 run two years ago, Now the 8-0 Eagles. Divisional Games are wild.",
        "Taylor heinike is him",
        "Inspiring game, both teams played outstanding football, but W won this game. What a MNF game it was. This week had some wild games, and some upsets. What a week! TY NFL lot of entertainment, to be had. Thanks!",
        "The fore skins",
        "Washington should’ve beat the Vikings last week low key & they just beat the best team in football tonight… Now at 5-5 & a half game out of the 7th seed in the NFC… the Commanders can definitely sneak into the playoffs, they’re better than people think",
        "such a humble guy. Plays with all his heart every game",
        "The griddy at the end was priceless ",
        "A huevo mis comanders así deben de jugar siempre🇲🇽",
        "Philly ain't played nobody yet",
        "Redskins got lucky with that blind ref",
        "Vikes fan here.  Thank you Washington, we now have a real chance at the #1 seed!!!",
        "Good game, the commanders played very well which is more than I expected, and something else surprising was all of the mental errors the eagles made eventually costing them the game in the long run",
        "As a giants fan - thank you commanders  🫡",
        "HUGE UPSET!!!!!!!",
        "Bad penalty from a great player, move on and win next week",
        "You win some and you lose some but you live to see another great W by Commanders.",
        "No way that's a roughing.  No intent.  Simply carry over.",
        "GO REDSKINS ️️️️️️",
        "LET'S GO COMMANDERS ",
        "HTTC!!",
        "Going undefeated is not realistic, especially with a 17 game season, but big respect to the Eagles for getting this far without losing.",
        "The Eagles are a good team but knew that they would not finish the season undefeated and that their first lose would be by a team no one expected. Congrats Washington",
        "As a Washington fan let me be honest I didn’t think we were going to win but seeing the way we played against the Vikings gave me a little hope but honestly thought we would loose in like a last second field goal also did we get rid of Dan yet us fans still waiting",
        "Bro eagles are frauds losing to the commanders really  I can tell eagles losing in the divisional round of the playoffs",
        "Are we ignoring the fact that in the first meme bro had 5000 unread messages",
        "The only thing the Commanders need is a new owner, front office and name",
        "Well done Commanders I wish the saints and rams can win games like this",
        "That's a better non bigoted name Washington I don't watch football but saw new name wanted to comment"
    ],
    "comments_disabled": false
}