{"video_id": "eNccmTr9ZC8", "comments": ["this shit hit different when you been listening to Herb since welcome to fazoland... to see his progress is major inspiration first heard of him when I was 14 I'm 23 now shit crazy", "He has really been on a historic run even after being counted out .", "G Herbo is goes so hard on this, never disappointed. he is not like other rappers who are going viral by using*authentic views* to get the views up. Thumbs up who agrees", "G GHerbo go in soo hard on this, he da real GOAT! He aint like all these other trappers who just be going HAM ON THE GRAM by usin dat IGROCKET dawwwt cawwwm jawwwn to get they followz up nn shiieeet... SMH", "This guy has enormous talent", "After all these years  G herbo never let us down ", "G Herbo nunca decepciona mano. ", "thank you g herbo for always giving us quality music, one of the last great artists", "thank you for the album and thank you for making videos for the bangers <3", "Run my boy up to #1 trending he deserves it!! ", "Ethan and Simon sniggering and laughing together like two naughty kids at the back of the class is my favourite part of this video. I love how you can put any two of the Sidemen together and theyre just instantly hilarious because theyre all genuinely such good friends. 8-) :P :[", "G herbo dropped like 4 videos and all of them are under 40 mill he really underrated but fuck it I see\n\n40 mill on all his videos and he doing this from the muscle", "Keep killin'em!!! Greatness can't be stopped!! ", "Shouts out to GHerbo for continuing to grind and progressing in music and in life.", "Been Him , Still Him ", "His entire album is lit  \nBeen playing it for the past two weeks. G Herbo is one hell of a lyricist ", "Bro should be on the top charts with this shit", "One of my favorites rappers and I’ll keep saying it!", "G herbo never disappoint us", "Herbo never disappoint ️", "It’s crazy seeing how far bro came only og fans know", "Herbo done got so much better & has been consistent dropping heat ", "This stays on repeat  until my blunt is gone ", "Keep the videos coming GOAT ", "I’m super proud of herb !! ", "Herbo makes me feel good with his music here in Africa", "Love the way herbo rode the beat...........god bless g herbo", "Gangsta rap resurrected in the form of gherbo straight ", "I literally never watched this guy but after his tragic passing I just watched almost all his videos, rip dude. :-(", "Damn after 10 years of listening to Herbo he still releasing slaps that honestly change muisc", "He never misses ", "No cap this song hit home, I remember I was in 2 period sophomore year 2015-2016 and after yrs of promoting BLK (Ball Like I’m Kobe) he dropped it, that was all we talked abt that week. N I’m from Sacramento Ca my guy really came a far way REAL LIL HERB FANS KNOE ", "Play this song on the radio and send this song to the billboard charts", "️️  Only that person can go ahead in life, who has the habit of moving forward even when he is alone", "Herbo done got so much better & has been consistent dropping heat", "I could be having the worst day ever and herb will drop a video and everything will change ️", "This shit go hard ", "May god always protect this man ", "Herbo is one of the last authentic Gs left in the game", "Most slept on but he still put bangers out ", " this man has been consistent", "Every video smacking just keep dropping ", "You know it’s fire when you hear that whistle early ", "We all know there will be rage and we love it.", "Still top 3 in Chicago rappers he don't miss  pressure all the time", "G Herbo didnt disappoint\nOurMusic Will Definitely Have A Place In The Music industry fam  One day Imma buy Momma the house she always wanted fr", "14:35\nThe amount of times I've replayed this moment is astronomical", "Album of the year… No Bap", "G Herbo is a huge inspiration to me and I WILL produce a song for him one day.", "“ why they act like this shit new ? I been had smoke with GD’s “ omgggg ", "Herb never disappoints ", "thanks to Him for this hit ", "Mad flow", "Its all about Him. Its all about us and what we choose to do with our developmental opportunities.", "Jus remember there was a time this shit woulda hit a million views within hours. Hope my boy could get back to that", "This man can’t do no wrong in my eyes", "This guy is so special", "I love his lyrics  ion think y’all be hearing him fr ! Let’s gooo ", "Somehow Herb still underrated, imo he is one of the most consistent rappers rn when it comes to only spittin heat!", "Came home in 2014 ever I been listening to Herb. He ain’t never miss", "THE GOAT DROPS AGAIN️️", "I see you gherbo going in on the NY beats hard lately", "All-time Legend on my roster fasho ", "Dude, seeing shady hit me right in the feels for some reason. His content was my childhood. ^_^", "Top 3 songs on both survivors albums", "Where the real Herb fans at? ", "From Rainbow to Stoney️too proud! Keep going!!!", " Onee Of  My Favv Tracks On Survivor’s Remorse", " luv it", "The best rapper alive ", "g herbo droppin straight bangers", "Suddenly this day just got a lot better", "Comeback better than the setback ", "Looking back on these videos 2 years later after techno has passed it puts a smile on my face on how he truly entertained us all.\n\nWe miss you Techno. Rest in peace. We wish your family is recovering well", "always fire of course ", "straight flames herb one of the goats of the rap game", "Gherbo legend in making ", "This song fire!! ", "He ain't even gotta say it, we know he forreal ", "You doing yo shit. Consistent asf these days. Remember bro use to be like “finna drop a album ” and the album ain’t come out til months- years later ", "Remember him from being Lil Herb to being one of the hottest rappers out!", "Damn watching greatness rn 10 years", "Waited on this ", "Can’t mention chiraq without saying G Herbo  Top 3 for sure", "G Herbo is a GOAT. ", "Even when he's shouting at us he's being wholesome, this man is a walking inspiration", "Always dropping  u really HIM Fr ", "Love you herbbb my boi never miss ", "Shit is so inspiring to me , My music is just as good as g Herbo  and ima be on top like him one day ", "My favorite song ", "You did yo shit on this one", "Yeah a classic already ", "Herb visuals been BRAZY ", "They counting me out, I just stuck on that business, now I'm independent for real #Gherbo", "album of the year no cap", "*swervo whistle*", "ISHOWVIRUS, this stream changed my life. My entire view of everything that exist in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience.", "herb never miss", "I be trapping with the Album… My neighbors mad everyday", "45:24* Lets just take a minute to appreciate how much time and work she put into these videos?* It's unbelievable, and I think they deserve a lot more than that"]}