{
    "video_id": "eNccmTr9ZC8",
    "comments": [
        "",
        "I see you gherbo going in on the NY beats hard lately",
        "That shyne beat tho!! More or less!",
        "This the one herb ",
        "🇮🇪",
        "He finally dropping videos to his song he gotta make one more for changes tho last one",
        "Remember him from being Lil Herb to being one of the hottest rappers out!",
        "Best song on album",
        "Keep the videos coming GOAT ",
        "G herbo the goat ",
        "Most underrated rapper. Top 3 Not 3 for sure",
        "Keep Goin  Cuz ️",
        "Love this remake of the legendary shyne song!!",
        "🇷🇷🇷 ",
        "snapped like usual",
        "Storytelling ",
        "He has really been on a historic run even after being counted out .",
        "🇨🇪",
        "CRASH DUMMY MUSIC!!!",
        "That Shyne More Or Less sample ",
        "After all these years  G herbo never let us down",
        "I remember when people was saying he had no flow back then but he really worked on it and he's better than he's ever been ",
        "45:24* Lets just take a minute to appreciate how much time and work she put into these videos?* It's unbelievable, and I think they deserve a lot more than that",
        "Go crazy",
        "No cap this song hit home, I remember I was in 2 period sophomore year 2015-2016 and after yrs of promoting BLK (Ball Like I’m Kobe) he dropped it, that was all we talked abt that week. N I’m from Sacramento Ca my guy really came a far way REAL LIL HERB FANS KNOE ",
        "I think he that nigga Forreal",
        "More or less sample ",
        "🇨",
        "We need that Song Cry 95’ & Hood Cycle vibes ️ it’s that time of the year Herb",
        "We all know there will be rage and we love it.",
        "🇳🇳",
        "Love the way herbo rode the beat...........god bless g herbo",
        "Feel like I grew up with bro ",
        " 🇪🇪 ",
        "Chicago checking in",
        "This tough  that shyne beat tho #pressure",
        "Neva stop Winnin ",
        "G Herbo nunca decepciona mano. ",
        "Aphmau never ceases to amaze us",
        "This mans actually himothy herbo, buhl has been blessing my ears all year",
        "My favorite rapper ️‍️‍️‍",
        "Even when he's shouting at us he's being wholesome, this man is a walking inspiration",
        "This beat is from “shyne more or less “this is a bad ass beat god bless stay up good vibes only 🫡️️",
        "G herbo dropped like 4 videos and all of them are under 40 mill he really underrated but fuck it I see\n\n40 mill on all his videos and he doing this from the muscle",
        "G Herbo didnt disappoint\nOurMusic Will Definitely Have A Place In The Music industry fam  One day Imma buy Momma the house she always wanted fr",
        "We need that Outside Looking In video asap!",
        "🇳🇨🇨",
        " herb popping his shit",
        "Ethan and Simon sniggering and laughing together like two naughty kids at the back of the class is my favourite part of this video. I love how you can put any two of the Sidemen together and theyre just instantly hilarious because theyre all genuinely such good friends. 8-) :P :[",
        " 🇮🇮 ",
        "an appearance by Bibby never hurts if it was in her videos",
        "“ why they act like this shit new ? I been had smoke with GD’s “ omgggg ",
        "🇹🇹🇹 ",
        " 🇰",
        " 🇱",
        "Where the real Herb fans at? ",
        "No cap this song hit home, I remember I was in 2 period sophomore year 2015-2016 and after yrs of promoting BLK (Ball Like Im Kobe) he dropped it, that was all we talked abt that week. N Im from Sacramento Ca my guy really came a far way REAL LIL HERB FANS KNOE",
        "Day ones ... GHerbo+Seasick",
        "straight flames herb one of the goats of the rap game",
        "Gas ",
        "Big Goat GANG SHIIIT MAN NOW  too",
        "He ain't even gotta say it, we know he forreal ",
        "I could be having the worst day ever and herb will drop a video and everything will change ️",
        "Use to pop up on my block when I had smoke soon the smoke was gone I was like a ghost  lmao j rockx g herbo we them niggas foreal",
        "He never misses ",
        "this shit hit different when you been listening to Herb since welcome to fazoland... to see his progress is major inspiration first heard of him when I was 14 I'm 23 now shit crazy",
        "More or less sample is ",
        "Got the whole world saying they need a fresh pair of G Fazos ",
        "G GHerbo go in soo hard on this, he da real GOAT! He aint like all these other trappers who just be going HAM ON THE GRAM by usin dat IGROCKET dawwwt cawwwm jawwwn to get they followz up nn shiieeet... SMH",
        "ONE OF THE RAPPERS WHO BUILD THEMS SELF UP AND STILL AROUND AFTER 8 years",
        "This shit raw Asf  an something in me best song on the album ",
        "🇨🇨🇨 ",
        "Fitted Cap Swerve don’t miss ",
        "the beat the only hard thing about this song. \nas a since fazoland fan. ",
        "fye herb",
        "Top 3 songs on both survivors albums",
        "Ian fw it herb nd you my fav rap yk i wanna hear some of that real deal shi",
        "🇮🇮🇮 ",
        "This the the ️ right here ",
        "He never misses",
        "🇷",
        "🇨 ",
        "Herb visuals been BRAZY ",
        "GOATED SONG!",
        "The Shyne sample hits perfectly",
        "Gotta like before watching this my fav off the album",
        "Most slept on but he still put bangers out ",
        "Herbo makes me feel good with his music here in Africa",
        "fye ",
        "Sheesh ",
        "Herbo done got so much better & has been consistent dropping heat",
        "Jimmy is a real hero for having balls of steel to do eye tracker challenge & get laughed at for sus moments",
        "Herb videos been fire lately",
        "🇱🇱🇱  ",
        "Gherbo flow is just fire ",
        "That beat fire asf yea herbo go crazy bro",
        "No one will ever see this thanks to you tuube algorithm but I hope to make it big one day ",
        "I forgot how hard he went.",
        "🇪🇪",
        "G Herbo is a huge inspiration to me and I WILL produce a song for him one day.",
        "🇮 ",
        "The beat dope",
        "Waited on this ",
        "thank you for the album and thank you for making videos for the bangers <3",
        "You a hip hop guru if know this original beat  Shout out to Shyne",
        "Every video smacking just keep dropping ",
        "🇪 ",
        "I don’t understand the beat but he snapped",
        "Chi town stand up! Lil homie holdin us down",
        " 🇨🇨",
        "You did yo shit on this one",
        "This shit it ",
        "Love it Herb. But this is Shyne beat he murdered this 1st. They sleep on Shyne Po he was a beast. Just shows Herb know bout that real hardcore rap",
        "Thats big herb ",
        "Dopest track I've heard so far like such a banger!! #GHerbo",
        "️️️️️️",
        "G herbo ️",
        "  🇰🇰🇰",
        " 🇨 ",
        "🇷🇷  🇨",
        "Swerbooo don't miss we need an album Asap",
        "Suddenly this day just got a lot better",
        "the vibes from bro be ",
        "🇰🇰",
        "Herbo always working hard",
        "I love his lyrics  ion think y’all be hearing him fr ! Let’s gooo ",
        "Sheeeesh ",
        "G Herbo is goes so hard on this, never disappointed. he is not like other rappers who are going viral by using*authentic views* to get the views up. Thumbs up who agrees",
        "Before call of duty ",
        " 🇷🇷",
        " 🇳",
        "FYEEE",
        "Herb came a long way I remember his flow use to be off lol",
        "From Rainbow to Stoney️too proud! Keep going!!!",
        "  🇨🇨",
        "Finally someone re did this song. Shyne  ",
        " 🇱 ",
        "Yeah a classic already ",
        "Kyro lit dat light herbo ",
        "The best rapper alive ",
        "Damn watching greatness rn 10 years",
        "flows like no other Gherbo da goatttt",
        "  🇳",
        "🇪🇪🇪",
        "Outta this one and After That  both too toughhh",
        "🇨🇨",
        "Jus remember there was a time this shit woulda hit a million views within hours. Hope my boy could get back to that",
        "🇹",
        "If ur a real music buff u know this is the more less beat by shyne! Herbo did his shit on it tho fasho",
        "fabolous and herbo need to make an album. 3 jadakiss features",
        "🇳🇳🇳",
        "Herbo done got so much better & has been consistent dropping heat ",
        "thank you g herbo for always giving us quality music, one of the last great artists",
        "G HERBO UNDERRATED AS HELL SMH",
        "Album of the year… No Bap",
        "🇹🇹 ",
        "This shit go hard ",
        "herb never miss",
        "It’s crazy seeing how far bro came only og fans know",
        "Herb you gotta come harder manmnm",
        "Always dropping  u really HIM Fr ",
        "This guy has enormous talent",
        "🇱🇱🇱",
        "We need a Demands music video OG ️️️",
        "Herbo never disappoint ️",
        "g herbo droppin straight bangers",
        "On what u being consistent shorty",
        " 🇨🇨 ",
        "Oms he rapping on beat tho ",
        "Always knew who he was and I just really started listening to his music and I said okay let me see why his baby mother Ari would still e tripping on him when Moneybaggyo is buying her everything  :but after hearing this song he sound good got lyrics  great beats and concepts creativity  good",
        "This stays on repeat  until my blunt is gone ",
        "This that real rap",
        "🇮🇮🇮",
        "Shyne -More or less ",
        "GHERBO , KEEF , DURK , AND JU THE BEST FROM CHICAGO",
        "Ian gon lie I had a night like that one part he said I damn near felt that part nobap ",
        "klassik SHYNE sample  #MoreLess",
        "One of my favorites rappers and I’ll keep saying it!",
        "I go where Herb go ",
        "G did it again ",
        "That Shine More a Less Track tho",
        "Shouts out to GHerbo for continuing to grind and progressing in music and in life.",
        "They got the movements and the physics down much better w this new game it's pretty impressive :[",
        "C-Sick forever killing it on the production tip.",
        "  🇪",
        "G herbo is raw and realest in the game fo real",
        "That's Fn sweet I love this channel, the new game is awesome so far, can't wait for a new zombies to come out, I was ready for this game like a year ago honestly lol :-o",
        " 🇹🇹🇹",
        " 🇷",
        "🇪🇪  ",
        "🇰🇰🇰 ",
        "This beat so fire",
        "I like how he got Gillie in the intro ️",
        "This was made I n Chicago",
        "Shine- more or less beat he snapped",
        "Still top 3 in Chicago rappers he don't miss  pressure all the time",
        "So fuckn  and my son said he only been rapping since 2010 .. you ninjas better catch up...",
        "From thug Nigga pac lyrics, just watching,  GH never disappoints ",
        "Gangsta rap resurrected in the form of gherbo straight ",
        "He’s back , n ima real fan ",
        "Perfect beat",
        "Somehow Herb still underrated, imo he is one of the most consistent rappers rn when it comes to only spittin heat!",
        "My favorite artist!! This nigga always consistent! He that nigga 4real",
        "🇰",
        "I respect herbo self made frfr ",
        "🇱🇱🇱 ",
        "12:16 onwards is comedic gold. How did he even think of that word?",
        "They counting me out, I just stuck on that business, now I'm independent for real #Gherbo",
        "🇱🇱  ",
        "Best lyricist in chiraq",
        "Shyne Po more or less sample ",
        "G herbo neva miss !",
        "Dude, seeing shady hit me right in the feels for some reason. His content was my childhood. ^_^",
        "Kyro and Juvie said you wasn't in the field Herbie Hankcock!! But I don't care, your music ",
        "my favorite song/ glad he told yall cause i was getting tired frfr",
        " 🇪🇪🇪",
        "1 of the best rappers !",
        " 🇮🇮🇮",
        "Kendrick, Cole, Herb, JID, Duck. Top 5 eva",
        " 🇰🇰🇰",
        " 🇳🇳🇳",
        "Keep killin'em!!! Greatness can't be stopped!! ",
        "The game really did pull a massive callback to the first jumpscare in the first chapter with the same exact line of dialogue as well",
        "album of the year no cap",
        " 🇳🇳",
        "Mad flow",
        "Tough Swervo!",
        "Oh he did the shyne more or less remix ",
        "Gherbo legend in making ",
        "Hardest song off the album",
        "🇳 ",
        " ",
        "Swerv always gonna be in my top rappers. Been listening since he was lil herb and you see the evolution and he always gonna let you know he don’t like the G’s ",
        "This man can’t do no wrong in my eyes",
        "G Herbo nunca decepciona mano.",
        "Comeback better than the setback ",
        "  🇷🇷",
        "Before call of duty we been countin kills ",
        " herbo really underrated",
        "Please God protect herb at all costs Amen",
        "🇮🇮",
        "️️  Only that person can go ahead in life, who has the habit of moving forward even when he is alone",
        "My boy G herbo ️‍️‍️‍",
        "🇪🇪 ",
        "Its crazy seeing how far bro came only og fans know",
        "🇮",
        " 🇹🇹🇹 ",
        "Herb finally came to the realizations of his decisions",
        "Go off herb ! ",
        "together and theyre just instantly hilarious because theyre all genuinely such good friends. 8-) :P :[",
        "DJ L and C-Sick bring out the best in G-Herbo.",
        "Fireeee g herbo go stupid king",
        " 🇨",
        "You know it’s fire when you hear that whistle early ",
        "Visuals",
        "I think this might’ve been my favorite song on the album as a whole no bap 🫰🫰",
        "🇨🇨🇨",
        "Found this while watching the video of the song “Gandi- 3 Telefona “ ",
        "This song fire!! ",
        "  ",
        "Super duper dope!",
        "Run my boy up to #1 trending he deserves it!! ",
        "🇹🇹🇹",
        "I swear this dude drop nun but heat",
        "Herbo your a legend gang. ",
        "🇪 🇨🇨🇨 ",
        "🇮🇮 ",
        "Flames ",
        "Hard ",
        "G herbo never disappoint us",
        "swerve still underrated",
        "🇪🇪 🇨🇨 ",
        "Herbo neva disappoints ",
        "Lyrics:\n[Intro]\n\nHad rope\n\nMe and myself, I never had rope",
        "I remember when you was rapping offbeat look at you now",
        " 🇪",
        "Keep dropping that Shit  ",
        " 🇹🇹 ",
        "Been that nigga Fr️️ Lil Herb to BIG SWERVE, I watched the whole evolution. Your music helped me through some of my darkest hours  Love",
        "this fire",
        "I started listening to herbo late after he dropped BLIK haven’t looked back since always drops that ",
        "He really dug this sample up old shyne po - more or less",
        "Love this guy he for the trenches foreal",
        "All-time Legend on my roster fasho ",
        "Herb please make a video to PAID that shit to pressure to not have one dawg do it for the libras gang frfr !",
        "Been Him , Still Him ",
        "🇮🇮 🇮🇮🇮",
        "🇰🇰🇰",
        "Herb never disappoints ",
        "It’s the Sanrio leather jacket for me ",
        "🇰  🇪🇪🇪",
        "This is it..G Herbo gat a hit here, and with this , I can say, he is that nigga for real...",
        "His entire album is lit  \nBeen playing it for the past two weeks. G Herbo is one hell of a lyricist ",
        " luv it",
        "🇷🇷",
        "Herbo is one of the last authentic Gs left in the game",
        "🇮  🇪🇪🇪",
        "4MOH, History, Machines, Paid, Sleepless Nights all need videos man",
        "Bro Swerv hasn’t been missing since and lately. He really is HIM! He’s making this shit look easy",
        "After all these years  G herbo never let us down ",
        "Classic fool",
        " 🇹🇹",
        " Onee Of  My Favv Tracks On Survivor’s Remorse",
        "999 cash OUTs PLeaseeeee herbooooooooooo shit fireeeeeeeeeeeeeeeeeeeeeeeeee",
        "Fire much love to g herbo or lil herb love bro ",
        "Bro even when I know it's been looted I still check it ,it's like looking in the fridge every five minutes hoping food spawns",
        "🇰🇰 ",
        "g herbo went on another level bro",
        " 🇮 🇰",
        "Damn after 10 years of listening to Herbo he still releasing slaps that honestly change muisc",
        "  🇷",
        "straight fire boss man i still remember computers freestyle straight flame we gon change the game",
        "Its amazing the number of mods theyve made so far I dont know how they come up with them there is so many i cant even imagine",
        "He's that niqqa fr ",
        "Csick pops out again w Gherbo ",
        "I like how he got computers in the back ground... herb grew since 2011 but this shit show his talent frfr and he got them killaz wit em fr",
        "Who else waits until the red line stops at the of each of his songs because they are so unique and he's so talented",
        "GHerbo You Came A Longgg Way",
        "Herb da goat no bots ️‍",
        "ISHOWVIRUS, this stream changed my life. My entire view of everything that exist in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience.",
        "Can’t mention chiraq without saying G Herbo  Top 3 for sure",
        "Banging",
        "🇳",
        "Herbo need to make a song with Chief keef",
        "This that herbo I miss fr , take me back to 2010 gang",
        "G herbo dropped like 4 videos and all of them are under 40 mill he really underrated but fuck it I see\n40 mill on all his videos and he doing this from the muscle \n\n*been a fan since",
        "Best song on the album most relatable ",
        "SR is a classic fr ",
        "🇰 ",
        "🇷🇷 ",
        "Herbo dropped ",
        "Survivors remorse is  looking forward to the visuals for paid.after that.flashbacks.outside looking in.",
        "the dynamic between lachlan and simon is amazing",
        "THE GOAT DROPS AGAIN️️",
        "too hard",
        "Lil herb flow ️",
        "Bro should be on the top charts with this shit",
        "Love you herbbb my boi never miss ",
        "God bless you Herbo stg ima meet you and tell you how much your music changed my life and give me motivation",
        "Herb got real flow",
        "1:17 is that a t pain chain wtf",
        "Fire",
        "Herbo ",
        "Much Love My Guy #StreetsListening",
        "🇪",
        "  🇮",
        "Keep killin'em!!! Greatness can't be stopped!!",
        "Looking back on these videos 2 years later after techno has passed it puts a smile on my face on how he truly entertained us all.\n\nWe miss you Techno. Rest in peace. We wish your family is recovering well",
        "🇷🇷🇰",
        "That beat is legendary.. speed up a little but still ",
        "I literally never watched this guy but after his tragic passing I just watched almost all his videos, rip dude. :-(",
        "  🇨",
        "Came home in 2014 ever I been listening to Herb. He ain’t never miss",
        "Fa Real! All heat #Swerv!!",
        "*swervo whistle*",
        "🇱",
        "Swervo got his own lane Frfr !!!",
        "🇨🇨 ",
        "We got g herbo dropping normally? And youngboy? Now I need toosi to drop more, thug and gunna to get out, and future to drop more fr",
        " 🇮🇮",
        "old herbo was so much better in my opinion\n4 mins of hell pt 2 ",
        "🇹🇹",
        "vik hearing Harry and Ethans plan then Josh hearing vikk, Harry and Ethans plan right after was so funny and elite",
        "G Herbo is a GOAT. ",
        "G herbo got the crown of the city and he know it",
        "Been HIM since 08 keep runnin the game ku",
        "14:35\nThe amount of times I've replayed this moment is astronomical",
        "Play this song on the radio and send this song to the billboard charts",
        "My favorite song ",
        "Its all about Him. Its all about us and what we choose to do with our developmental opportunities.",
        "Till this day  BIG SWERV",
        "It's all love 🇬🇭",
        "I’m super proud of herb !! ",
        "Omfg ",
        "GG HERBO RESPECT",
        "You doing yo shit. Consistent asf these days. Remember bro use to be like “finna drop a album ” and the album ain’t come out til months- years later ",
        "Fye️️",
        "🇰🇰  ",
        "Herbo with that Shyne sample triple OG move",
        "thanks to Him for this hit ",
        "Herb went nutz ",
        "This guy is so special",
        " this man has been consistent",
        "🇷🇷  ",
        "shyne beat keep spitting over 90s beats",
        "Swervo eating this beat",
        "May god always protect this man ",
        "Man it’s crazy, Majority of the rappers nowadays don’t bring positive and inspire us to in a purpose in life, but if you really listen to G Herbo’s music you can feel how inspiring he is. Just listen."
    ],
    "comments_disabled": false
}