{
    "video_id": "EPwugTRTscg",
    "comments": [
        "Wow, that's a big litter!  So sorry for the one that was stillborn.  No matter how many she had, having one not make it is still very sad :(  I hope mama and babies are doing well ",
        "I'm so sorry for the loss of snowball but you have 11 adorable puppies! Monty did an amazing job giving birth and she's so lucky to have you and Joey! Much  from 🇨🇦",
        "I'm so sorry Daniel ",
        "Good job Monty, made such beautiful babies! Those last two were most definitely angel babies after losing little miss snowball. I'm happy you guys got a little happy ending even if there's still some heart break.️",
        "You should name the 11th one eleven (stranger things)",
        "Daniel, I can't believe your dog, Monty gave birth to her puppies for the first time at Joey's house in L.A. on this video, they're so cute and I wanna say I'm proud of you for that!! #goldentriever #puppies #puppy",
        "Omg the puppies are soooooooooooo adorable shes gonna be such a good mother ️ love your videos",
        "Congrats on the little ones, and so sorry for the lost the precious angel, Snowball. She/He will be missed on this journey. May you have strength for Monty and puppies !!!",
        "Sweet thoughts for Snowball ️ \nWhat a whirlwind, congratulations to all! Monty is a labor goddess! Those puppy squeals are so stinking cute!",
        "Congratulations ",
        "I feel bad they don't know how to give the dog privacy when she has puppies instead of being there, that can cause birth giving problems, causes stress and keeps her from doing her job as she would alone. Sad, one puppy was lost.",
        "You could name them all after nick cannons kids",
        "congratulations so sorry for snowball may she rest in peace you did everything you could",
        "OMG YES!! IVE BEEN WAITING!! ",
        "I'm so sorry for your loss but you have done what you can",
        "Aww I'm so sorry about the baby that didn't make it...I had a rescue kitty that had kittens with me on mother's day, I left for a few hrs to visit my mom and when I came home one had passed. I felt so guilty, like if I hadn't left I could have stopped it (even tho I have no idea what happened) it's always hard. Monty did amazing, so did u and Joey",
        "Congratulations  Montana!!!!!! ️️️️so beautiful  baby girl!!!",
        "So sorry about lil Snowball. You did the best you could and that's all that matters. I understand it's hard to lose a lil pup. You're such a great dog dad and I wish you the best.",
        "Woww she did so well I can't believe she really had 11 pups  well done Monty Daniel and Joey and congratulations.  I'm so sorry for the puppy that was lost you did absolutely everything that you could sometimes there's always 1 that just unfortunately doesn't make it and it's heartbreaking especially with her having had so many in there,  I'm glad all the other pups made it and are nice and healthy! Xxxx",
        "Congratulations beautiful Ms. Montey. I'm so proud of you.",
        "“That Puppy I meant (SnowBall",
        "I thought it was only 11 puppies according to Joey? But it was a calm and relax delivery of Monte. Nice one.️",
        "My heart breaks for Snowball, and all my love to you and to Joey.  Much love to Monty.",
        "Hugs, I had a snowball. Sending love",
        "Sorry about snowball. ️‍",
        "I am so sorry for your loss. As someone who fosters this ALWAYS sucks and hurts your heart.  Make sure you do make help supplement the runt with extra feeding.",
        "Oh no Danial i am so sorry",
        "omg yay been annoying everyone in my house waiting and talking about this post today lol",
        "Aww, sweetheart, you guys did the best you could. You guys are amazing dads! Monty is so lucky to have a dad like you!",
        "Awww...sending you love and light. I am so sorry you lost one, but I know all those babies and Monty feel so so loved!!!!!",
        "You need to do a video with “that’s enough slices!”",
        "GOD BLESS THEM SORRY YOU LOST ONE",
        "Hi Daniel, I’m soo sorry you lost a precious puppy, your such a good dog dad and monty did amazingly 12 puppies wow I’m tired just hearing that let alone having them, well done monty beautiful beautiful puppies r,I,p snowball xxxx",
        "Oh Daniel, I am so sorry for the loss of little Snowball. ",
        "️️️️️️️️️",
        "I admire your strength, Daniel. I’m so sorry about Snowball. You deserve some time and relaxation after this. Congrats on the other pups!",
        "Rip Snowball, I’m glad she went out easy instead of with pain. May her and dashie be at peace.",
        "She did so well and you have 11 healthy pups.  So cute.  I can't with their tongues though.  I must have them all.",
        "So sorry about Snowball but happy for the other 10 babies. As I was typing this, just heard about the 10th one. Congratulations 10 times . Oops, I mean 11. ",
        "Poor little sweetheart.  You did the best you could and she did not suffer.  Congrats!",
        "Congratulations to monty to the beautiful babies. RIP little angel Snowball you sweet angel",
        "You are such an amazing dog dad.  The puppies look like chubby, healthy bundles. I’m so sad the little one didn’t make it. The runts always have a special place in my heart. One of my current dogs is a runt and he is so special. I hope you guys are doing ok. It’s gut wrenching to lose an animal. I know when my ferret had babies and two of them didn’t make it I agonized for days and I still think about it 20 years later.",
        "what an emotional roller coaster. so glad that monty is OK.she has done you proud and she never even made a sound.look forward to seeing the puppies as they grow.X",
        "Well done Monty-girl on delivering all those babies! I am so sorry to hear about the loss of Snowball, I cried with you Daniel, thank you for making sure to include the truth of how these things do happen, and how sad and painful that is. I am so glad that the other 11 are ok, and can't wait to see what it will look like when there's 11 goldens running in the garden.",
        "RIP snowball ",
        "I don’t mind that she is having puppies. And I know it’s ok for a big dog with 2 years to start breeding. But she seems so young and having so many little ones. I feel a bit sorry for her - but I know you and Joey are taking good care.",
        "Omg!!!!! Yay 🥹 that’s so precious you go mama",
        "I’m just kind of confused cause on joeys video it said 11 puppies",
        "Congratulations to Monty!! Aww all those sweet precious babies ",
        "YESSSS I kept checking you guys channels!, CANT wait to see the puppies grow and the names you guys pick out for them!.️️️",
        "Wow",
        "Wow I'm still wondering how she was holding 12 whole puppies inside and looking like a skinny legend",
        "So much joy ️️ welcome to the world babies!! Enjoy every moment of it Daniel, you deserve all these good energy coming into your way. ",
        "Aww so beautiful congratulations",
        "I am so sorry for your loss. But thanks so much for sharing. I’ve loss dogs before and it’s never easy. Virtual hugs from Kentucky",
        "Wow! I was going to say Joey called it with 12! But I’m so sad that one of them didn’t make it",
        "Awww R.i.p little angel snowball ️ we'll always remember you ️Monty did so good! Congrats ️",
        "Absolutley devo for lil snowball! You did the best you could! Super proud of Monty!",
        "Im so sorry you lost one. Our dog lost 3 puppies and it was devastating. Love on all the rest of them and know it was meant to be. Hugs and love! ️",
        "You can REALLY tell how much she loves you!!! \nIt definitely shows when she sees you!! You have the most precious little mama! Congrats on the huge liter!!! ",
        "Ahhhh!!!! Congratulations! So magical ",
        "So beautiful Daniel. 2 angel babies really took their time coming into the world! Congratulations Papa! Let the journey and pup fun begin!   ",
        "R I.P. SNOWBALL \nBig love to you guys, be kind to yourselves x\nI haven't lost a newborn puppy, but as a Mum I have lost my own baby and nothing is worse but I thought I'd bring this little bit of comfort to you-",
        "Mister Preda I know your pain my girl Smokie had 4 puppies we lost one to she was born with her organs on the outside but she was breathing I took her to the vet right away and they said they couldn’t save her so we did the humane thing I got her back I named her Quinn and yes it’s because I’m a big Harley Quinn fan I cried not only because we lost her but because she’s a part of my two dogs I bought her a wooden box and have a little memorial for her outside my bedroom window it’s hard but  we have three healthy growing six month old puppies I kept her first born I named him Harley and then we have Sophia and we have Tyson",
        "That last scene of Joey holding the puppy up, he’s got blood on his face  thinking of you both and Monty and all the babies! Congrats and my condolences for little snowball. :( sending my love.",
        "I'm so sorry to hear about the baby girl!",
        "\"Sooo  adorable  cute\" (sorry  \"Monty  loss  one of  her  fur  babies) all the  best  momma  and  babies ",
        "I am so sorry you lost Snowball. Sending you hugs and the hope that the 11 other puppies all go to amazing homes. Thank you for everything, Daniel and Joey <3",
        "She did so good. ",
        "101 Dalmatians who ? Congratulations",
        "Congratulations Monty mama!! ",
        "Why was she never spayed? This seems irresponsible to me. Don't get me wrong I know you love your fur babies, but there are so many animals in shelters that need adopting.",
        "YES!!!!",
        "I really wanna hug Monty for her hardwork with the delivery....",
        "Wait I'm so confused. On Joey's video there were 11 puppies, none passed away. So im super confused. Edit, wow! 2 little miracles!  That was so tense",
        "Hi Daniel ! Are all your puppies spoken for?",
        "So sorry about Snowball rest in peace little one ",
        "Pls name them after the zodiac signs :((((",
        "THE ANGELS HAVE FINALLY ARRIVED Thank you guys for being here and following along the journey!  I appreciate concern, EDUCATED opinions and KIND advice, if you are here to threaten, verbally abuse, or spread your uneducated agenda while bullying others, you will be BLOCKED AND REPORTED. If you don't like it, don't watch, I will not stand for disgusting behavior here on MY page.",
        "Love the puppy nursery",
        "Congratulations I so wish I wasn’t in uk there the most beautiful babies ",
        "I’m soo sorry  but now we have a new friend for lavender",
        "Gratulations to eleven puppies! My condolences for loosing Snowball. You did what you could but this is sometimes the rule of life, and you did right to share it to show that. Monty was very good and so was both you and Joey. Looking forward to this journey with you!",
        "At the end ... Joey \"nope she's going again\"",
        "Now it’s time to wait for Laura to gift a puppy to Tyler!!!",
        "I am so sorry for the loss of one of the puppies, at least there are eleven more beautiful souls still remaining on Earth for you and Joey to nurture until they find their forever homes. <3",
        "Im so sorry for your loss. Breeding (or whatever you are doing) is so hard for this exact reason. Nothing is ever promised and things can and do go wrong. If you are really serious about breeding (or whatever) and being responsible and ethical then PLEASE, get all the pups and mama OFA tested and make sure futured studs are as well and everything checks out good. I have watched and loved you guys for so long but id never be able to support anyone backyard breeding, especially those who have such reach. Doing OFA is so important as it can tell you how healthy your dog is health and body condition wise. PLEASE look at the OFA recommendations for Goldens and OFA these pups and any you may have in the future. Holding people responsible for having responisble breeding practices and breeding only healthy dogs is how we are going to end the overcrowding and overflow of shelters.",
        "Awww sorry for loss Daniel. The puppies are cute. Congrats",
        "13:49 congratulations they are so cute I love them sorry for loss snowbell",
        "Awwww  they are sooooooo cute & tiny. I can't wait to see them grow.",
        "You guys are so good at this!! Thank you for sharing this special moments ",
        "all puppies are so beautiful and cute️️. I'm so sorry you lost snowball. I hope the other 11 get big and healthy️️.",
        "I think I might've missed it, but what breed is the daddy-o of the babies?",
        "Awwwwwwww omg cuteness overload!!!!!!!",
        "️",
        "Sorry for your loss. There was nothing you could have done to prevent it and you did the best you could. It's always a possibility, especially with a litter this big.",
        "For the little runt, I would recommend you weigh it every 3 hours and if he isn’t gaining weight you will need to feed with a syringe and a Miracle nipple every 2 hours. Don’t feed the babies with cows milk, use goat  milk instead. Before you try to hand feed the little runt, I would remove some puppies and make sure she or he is latching on mom and gets her milk",
        "Thanks for sharing this experience with us love it",
        "Oh Daniel. I’m crying with you. I. So sorry for the one you lost ",
        "I love watching you together <3 Those puppies are so lucky to have you guys!",
        "Naww congratulations! Monty did so well ️ You must be such a proud dog dad xx Sorry about the loss. Sweet baby girl. Lil baby Snowball  rip x",
        "Congrats!",
        "The little air thingy to help the puppies breathe actually gives me a little bit of a flashback to when we are trying to help our cat and he didn't make it I never get emotional whenever I talk about it but now I am I don't know what's wrong cuz luckily we have a new kitten named Mort you know what I feel like you should name one of the boys if she has a boy Mort if you're okay with that I'm just giving a name suggestion right when they're born and I feel like gingy would be a good name for another or Ginger if it's a girl I'm sorry I'm just giving you guys names way too early you guys should at least just get the gender all set and then we can give them names but on a good note I'm very happy that your dog Monty had puppies I was demanding to see a video the next day from Joey but a few days later he gave us the video and yes it is very good to see you guys still getting along after you broke up",
        "Breaking my heart. I'm sorry you had to go through that. I 've lost puppies myself. Take a pic of her. You've got this.",
        "That was pretty sad, you took good care of her during pregnancy, and still one diden't survive? Joey had dogs with bad pregnancy care, and all puppies survived still...so sad...but anyway still congratulation all 3 of you, I hope you two guys will update us often!!",
        "So sorry about Snowball. Hugs and love to you, Monty, Joey, and the rest of the puppies.",
        "Who is the dad of the babies?",
        "Awww congratulations to you all what a lovely sound puppy cries are they look stinking cute , can’t wait to see them grow and develop there own characters, monty got this what an amazing mum , am so so so sorry about snowball and all of the haters on here , keep doing you and also I wanted to give you a massive hug",
        "Monty did such a good job, congrats guys on 11 beautiful puppies, and im sorry for your loss",
        "hoping you’re doing well Daniel, Rest in Peace Snowball ",
        "So sorry   poor sweet angel",
        "Yay for Mama Monty. I'm so sorry for losing Snowball, but she is still very loved and I'm sure will watch over her mama and siblings. ",
        "so proud of you all <3",
        "Monty did so well. Congrats MammaRIP little Snowball.",
        "Awww there adorable I had a Pekegese n she lost one as well But like you said snowball didn’t feel anything Rip",
        "Rip baby snowball! So many puppies omg! Congrats on all the beautiful babies",
        "Several years ago our golden had 11 pups as well she had 11 nipples too. It was such a fun experience! What a happy time for you",
        "Joey can almost name them the Zodiac signs like he wanted lol. Congrats on the puppies ",
        "Omg Dan I’m glad she’s not in pain anymore",
        "Beautiful \nOhhhh little snowball  you have little wings now angel ",
        "awe",
        "CONGRATS!!!",
        "Why does the titles say 12 if she had 11?",
        "I’m so sorry about the loss of the puppy Daniel, when my dog was born, his brother was born with a cleft palate and he struggled so so hard once he was born, so I feel your pain so deeply. It’s hard, but it’s what was meant to be, that little one was mean to keep dashy company ",
        "Who was/is the daddy? So sorry she lost one.",
        "Congratulations mister preda!!!!!!!!",
        "Daniel you have such a huge heart and sense of compassion. Never lose that ",
        "Why didn't Joey mention lil Snowball??",
        "Congrats Daniel! Watching you love monty and your other doggos is like a breath of fresh air. I always get told that I am a bit OTT when it comes to my dog, so its nice to see someone who affirms this rather than get ridiculed.",
        "Congratulations, sorry about the lost soul. Monty did so well.",
        "Why didn’t Joey tell us this?????",
        "I'm so sorry Daniel, I really am. It's absolutely heartbreaking. Sending you, Joey and of course Monty lots of hugs from the UK. Rest in peace Snowball ️",
        "im so sorry snowball didn't make it, from someone who works in the vet industry loosing one is always hard no matter if its the first time you've ever lost one or if you've lost multiple that day, even just hearing that someone whose care you were involved in can be heartbreaking. you've just got to focus on the fast that there's still 11 healthy pups with amazing lives ahead of them. sending all the love to you and your little angel",
        "I’m so sorry about losing a baby.  My heart goes out to you! Hugs and lots of love ",
        "My heart is broken for snowball I love u snowball, so so much. God is going to take such good care of you ",
        "It sucks that those kind of things happen. I had miniature pincher who had 2 litters the first one was 2 girls perfectly healthy and the second was 2 girls, 1 boy but sadly 1 of the girls in the second litter didn't make it. That was years ago, our mama dog died on April 3rd, 2017, and one of her daughters from the first litter that we kept died last year on May 4th, 2021.",
        "I'm so sorry for your loss, it's so sad when one of them doesn't make it \nAll the puppies are so cute and Monty is such a great momma, can't wait to see those little doggies grow up",
        "OMG!  Congratulations, 11 Puppies. You guys did so well in guiding Monty on how to handle this pregnancy. Poor Monty she really looked tired. All your nutrition kicked it well for Monty. Her birth was easier than expected. Thanks for bringing in the humor with the banter you and Joey have it broke up the tension because let me tell you I was feeling it. Again, you did so well supporting Monty! Take the weekend off what's left of it and enjoy yourselves you guys did good!",
        "Were sorry for Snowball. You did amazing Daniel. All of you, Monty and Joey <3",
        "I'm so sorry about snowball\nCongratulations to Momma Montana and Grandpa Daniel and Grandpa Joey",
        "SPAY AND NEUTER YOUR PETS!",
        "People die, animals die, that’s the way it’s been man. Always has always will be. Sorry for Snowball ",
        "I hate to be that person but seeing those puppies... this was definitely planned. I'm glad they are all healthy (Save for the little one that passed, sorry for your loss) But I do hope this brings some sense into you guys to stop \"accidentally letting your dogs get pregnant\" or at least be upfront about breeding them with purebred dogs. First it was Lark with a husky and now Monty with a golden. You guys have all the resources to do so much good in the animal world and educate people about rescuing and responsible pet owning. Best wishes to all of you but especially Monty.",
        "Daniel you’re such an amazing soul. Watching how much you love Monty and those babies makes me so happy and inspired. I can’t imagine how hard it is losing a puppy but you are incredible for everything you do and it’s so easy to see how loved they are already. Rest in peace snowball",
        "you guys did the absolute best for Monty and her puppies ! \nso sad for the loss of snowball, these things happen unfortunately, but you guys have so much to be grateful for!",
        "Brings back memories of Lark.  You guys have come a long way since then.  Both of you are wonderful sweet men with giant hearts.",
        "Should name the last one SURPRISE!",
        "I feel you it is ok",
        "Congratulations monty bless her she was so tired towards the end I felt that way after 1 hats off to her for having 12",
        "OMG!!! IM SO EXCITED",
        "Oh no poor baby!! Our dachshund had gotten pregnant without us knowing back when I was in middle school. She hid away in the laundry room and when I passed by I noticed some blood and she was whimpering. She had one little boy and he was stillborn. My mom tried to help him but there wasn't anything we could do. About two years later she got pregnant again and birthed 6 healthy babies. We thought she was done at 5 and we all went to bed at about 2am....I got up for school at 6am and checked her, hello number 6! Funniest part was her first in the litter grossed my oldest brother out. I mean he is a father of 3 now...he was there for his sons c-section. But he couldnt handle seeing a dog give birth ",
        "Congratulations Daddies and Mama Monte. ️ I’m so sorry about precious Snowball, that’s so hard go through. ",
        "Though my heart breaks for the loss of Snowball , the sweet blessed one will never be forgotten and forever in  our hearts. A huge congratulations to amazing Monty and to you and Joey for being there for her and her adorable babies. I look forward to the journey of your dynamic loving family and supportive friends. You all did amazingly well. All the best to you all . ",
        "I’m a huge fan of golden retriever. I have one right now and his name is Gus. I also have a mix breed pup and name caramel. I did have some golden retriever dog in the past ,NAME CERSAR, AND HUNTER. I ALSO USE TO HAVE A CHOCOLATE LAB, AND NAME MOCHA. I ALSO USE TO HAVE A MIX BREED, AND NAME MOJO.I’m also a huge fan of puppy.",
        "You take such good care of Montey! That's so sweet. I could do without all the insults to Joey though.",
        "Wait were these puppies planned or on accident like what happened to one of their old dogs?",
        "Whose the father",
        "Oh sweety :( I want to hug you so badly. *virtual hugs*.",
        "What an amazing mother, Monty, and her two hooman granddads!  Twelve -1 puppers!  I think Monty just had her first TWO litters, at once.  Quite a journey ahead for the next 4 months!  Blessings and best wishes to all!  I hope Monty gets back on her feedings sooner than later.  She's going to need so much nutrition for all those thirsty little ones!  I know she'll be eating like the royalty she is!",
        "My cat had kittens and none had sacks so that’s not the reason..",
        "So sorry for your loss guys but she's a little angel in heaven I know how it feels we lost one of our puppies when she had babies but I'm so glad to see that the mama is doing well and the babies brothers and sisters are doing great take care and God bless",
        "Who is the father????????",
        "Joey is an angel",
        "I'm so sorry for your loss. It's good that you're there with Joey. I'm sure it was hard for him to watch you have that experience for the first time but I can't think of anybody better to help you through it.",
        "Aww congratulations on the puppies your Amazing and it’s not your fault unfortunately these things happen and there ain’t anything we can do ….. ",
        "I know you said you don’t think you’ll keep one, but I think you should think about it. To have the next puppy generation or Monty? Pretty cool, I think",
        "Oh Daniel. Hugs.",
        "Congratulations on 11 gorgeous puppies so so cute I'm so sorry you lost one I literally cried I love animals so much and my nan used to have a golden retriever so I love them so much I grow up with her and she was my best friend love you guys can't wait to see the puppies grow",
        "Holy Cow wow well congratulations on Monty",
        "Is this a rescue or your golden you got as a puppy?",
        "Hey Daniel, dont worry about Snowball. You know its a good thing she didnt feel anything:) Ily Daniel, hugs to you and snowball",
        "Spay and neuter. Enough unwanted pets.",
        "Your dog did a good job lovely little sweetheart a little cutie puppies",
        "Awe, I’m sorry one precious baby was lost. Thank goodness 11 healthy babes were born!",
        "Im sorry snowball the puppy I hope you go to dog heven and He did not have any pain so thats good hope you are okay Mister Preda",
        "Oh I’m so sorry u lost one xxx",
        "How can a dog feed so many puppies?? She'll be exhausted x",
        "I'm sorry for your loss of the little one. I can't imagine going through something like this\n\nI'm glad the rest of the pups are doing well. I'm glad Monty is doing okay. She did very good giving birth. You and Joey did what you could do to help. That's all that matters",
        "I would be giving the puppies colostrum just because she had so many and you want to make sure they all get enough so they don't get sick.",
        "Okay now I'm really confused, why didn't Joey say anything?",
        "Monty is going to be the sweetest momma",
        "Omg admit it you 2 love each other.",
        "Oh, Daniel... I'm so incredibly sorry for the loss of Snowball. You and Joey did so great. She will live on forever in our hearts, and will never be forgotten. I'm sending you both my love. You're wonderful people, and Monty is such a fabulous mama. ♡♡♡",
        "Great. More dogs to crap on my lawn",
        "i love these vlogs thank you sooo much for sharing this beautiful journey, keep the vlogs coming ",
        "Congratulations Monty!!!  you did so good girl!!! ",
        "Can’t wait to see them all running around with their big puppy bellies! Congrats!",
        "Poor Monty that was so much work. This is why irresponsible breeding is well… irresponsible. Congrats on the puppies but let’s do better for them all in the future!",
        "Big hugs ",
        "Ohhhh I'm so sorry about Snowball!  Having a puppy not survive is what I'm most afraid of!  Thanks for making these videos.  I am to breed my Golden so I am learning from you guys.",
        "i am so extremely sorry:( sending nothing but positive thoughts and prayers your guys way <3",
        "Rip Snowball , sending hugs ,ik how hard it is",
        "So sorry that y’all lost one of the babies. But like you said, it’s out of anyones control and there are 11 more that you’re gonna have a lot of fun with until they leave",
        "Welcome to the world little babies ️\nGreat job mama Monty ",
        "Hello, Humans ",
        "I am so sorry you lost Snowball. Sending you hugs and the hopes that the 11 other puppies all go to amazing homes. Thank you for everything, Daniel and Joey <3",
        "Hugs for snowball soo sorry for the babies loss. all the other pups will be strong and healthy",
        "Sending you the biggest hug. Snowball will watch over her brothers and sisters. Give Monty and all the puppies little kisses for me. Take care!!",
        "Congrats Monty! All that good nutrition etc seemed to help with the birth being a bit easier! Such a great mama! \nSorry for the loss of Snowball!  \nHugs and love to you both, Daniel and Joey! ️",
        "Well Joey got his wish for 12 after all.",
        "Congrats on being a grandpa again Daniel! Enjoy em while they’re wittle🥹️",
        "That's so sad  I'm so sorry Dan xxx",
        "Rip snowball",
        "Was it 12 or 11 puppies",
        "I'm so sorry about the lil pup that pasted but look a the bright side you tried and she is in a batter place now you helped the rest of the pups you and joey and monty are really good dog dads and mom love you videos",
        "Its not your fault Daniel.. i know loosing a puppy is so hard and I’m so sorry… sending you a big hug and positive thoughts and vibes",
        "Hugs for Snowball.  I am so sorry that happened and you did everything you could. She made her mark and will always be remembered ",
        "Somehow was brought a little peace back into my world",
        "I'm so sorry for your loss for snow ball u make me wanna cry",
        "Snowball will the angel to her other siblings.  She'll watch over them. Hope you got rest after this. Hugs to you and all those babies.",
        "Congratulations   They are so beautiful. My deepest sympathies for the loss of the little white Angel.  ",
        "Thank you for sharing this miraculous moment with us, I cried the entire time!",
        "you guys are awesome!!!!!",
        "Why didn’t Joey tell us that one passed??? He said he resuscitated her",
        "So sorry for your loss. You three did a great job ",
        "Wow that was fast, just started this series....hihi",
        "You did everything you could and you didn’t give up on her️she will be remembered, little angel Snowballcongratulations with the other puppies, Monty is the best momma",
        "That last one was a little rainbow baby🥹",
        "daniel and joey the backyard breeders of youtube!!!",
        "Congratulations! I'm so glad Monty's ok. Puppies are good",
        "So very sorry for your loss. Daniel, you are the best dog dula ever. Joey is awesome too. A beautiful tribute to your Angel.\n\nMonty’s so sweet and so happy - and has the nicest and calmest disposition.",
        "Sending love  You did absolutely everything you could for Monty and all of the little puppies, especially the angel Snowball. I hope you have peace that you did everything and there was nothing more you could’ve done. I know that doesn’t make things less painful though.",
        "Felt so good to see joey and Daniel doing a video together again ",
        "You guys did amazing Daniel, when you came in the room to see monty and came over to her you could see such a deep connection between you two, you’ve been on so many amazing adventures together. So beautiful to see. Can’t wait for you guys Christmas together with all the animals this year. Love to you all x",
        "Puppies  galore  So magical  Thank you for sharing this journey with us",
        "That was Just so great I really felt for Daniel over white puppy. good to see Joey and Daniel sharing the important moments .",
        "Sending you so many hugs for snowball I’m so sorry love you did everything you could  ️ 11 beautiful puppies",
        "So sorry you lost ! Little one. They are all so cute",
        "CONGRATULATIONS to all of you for job well done! ",
        "Aww, Daniel, hugs to you, Monty and Joey. Nature sucks sometimes, but it has its reasons ",
        "Daniel sending love to you…I know it’s hard to lose a furry baby…you are a trooper and so is Monty…nothing but good vibes to you both",
        "so sorry daniel :( but yeah sometimes that happens even on humans happens when u loose a newborn baby but im sure snowball is sleeping in a calm space and for the one u gave the lavender collar im sure lavy girl( dash) will be so proud of you of keeping his memory with you . at least u guys have other beautiful pups who will be in this new chapter with monty  , you daniel and joey . much of love  for you all guys ",
        "I’m so sorry to hear about Snowball! You gave it your all. She will always be remembered  sending big hugs and so much love your way. You and Joey are truly inspiring and I can’t wait to follow you both on this journey! Way to go Monty!!",
        "What a beautiful family you guys create!",
        "The boys are like MONTY YOU SMELL FUNNY",
        "That must have been really hard losing a puppy like that :’(",
        "This hits different because its from a doggo we are all VERY familiar with here and on Joey's channel. Thank you 3 for all the hours and work you put in to help M, and her puppies!\nI teared up at the end with the music and just seeing what a great mom M is gonna be.\nSnowball is and will always be family. Thanks for giving her a collar. <3",
        "CONGRATULATIONS  Rest In Peace to Snowball ️️",
        "Rest In Peace snowball ",
        "Joey just loves recording on an Iphone ",
        "Hugs and kisses for snowball. I’m so proud of you and Joey for working together to help Monty give birth to the puppies ",
        "that's one of the biggest litters i've seen yet! cant wait for this new journey. in loving memory of Snowball. And Monty was such a brave girl! no crying one bit! and congrats for the 11 newly born puppies!",
        "So disgusting.",
        "Can you stop being a backyard breeder......",
        "I'm sorry !!",
        "I'm so sorry a puppy passed away! The puppies look so cute and i feel relieved for monty that she doesnt have to carry around that weight anymore!! \nMaybe it would be good to at least get dna/health testing done on the parents just incase it was something genetic that caused this? I know even good breeders lose their dogs sometimes and you did so much to keep Monty healthy during pregnancy but there are things one needs to test for to know what's being passed on to a future generation.",
        "As a breeder my self ( Rottweilers ) these things happen. I have had a litter of 8 and only 2 born alive. It’s never easy. You can do everything possible and still not all will make it.",
        "Awww poor little one that didn’t make it  all dogs go to heaven ",
        "So sorry, about snowball.  Congratulations on the remaining pups.  \nCan’t wait, for this journey.  ",
        "Since Christmas is right around the corner you all should have named them after the 12 days of Christmas",
        "She did so good!! The perfect little mama! Can’t wait to see these little angels grow up! Snowball will be their guardian Angel!! ",
        "Now THAT was a full Monty!  So adorable and so happy to see what a great job mama did.  Very healthy looking puppies.",
        "Sweet mommy Monty is adorable  but, the level of sass throughout the video had me in stitches. You're both terrible... Muriels",
        "Sorry to hear that",
        "Girls we all know y'all are back together its true tbh the chemistry is still alive",
        "Mr Preda “I think she might be a girl, or a boy” Joey “Oh” as in wtf  Sorry, wrote this before I knew about Snowball . two Angel babiesdoes that mean two died and she has 11 living or what, so confused. Monty, you are bloody amazing, such a good mummy. ",
        "For anyone reading this who is ever in these situations, make sure the mother always has access to water! You have to give it to her yourself while she’s having babies but that’s pretty obvious.",
        "Oh my goodness...this is the sweetest thing I've ever seen. Monty is so loved...truly a cherished girl. What a great moma too. I'm so sorry about Snowball but you tried everything possible..you really did. She got her little wings....️",
        "To Monty,\nCongrats Monty. YOU did well mama, I'm so proud of you. Although sadly one of your angels passed, they will be in the stars watching you and their siblings grow into beautiful dogs.",
        "Congratulations to Monty! I'm so sorry about Snowball, though. You did everything you could for her.",
        "I am sure it's way too early to think about names,  but States ot Cities would be really cute from mommy Montana!!",
        "I am sorry for what happened to Snowball darling.  In any case, both of you did such a good job!",
        "Aww Daniel I'm so sorry for the puppy that didn't make it! I was crying there with you!",
        "It’s like that one of joeys that he thought she was done and she was outside and one was coming out!",
        "Rest in peace snowball! You will always be loved and missed by everyone! ",
        "Littt",
        "Monty did great! You all did as well in supporting her and making her comfortable. I’m sorry about Snowball. I can imagine that was hard. Cannot wait to watch the sweet little puppies grow!",
        "I've been waiting!!",
        "Omg is there anything sweeter?! Not a chance! Daniel, please don't be hard on yourself about the puppy. A litter that size has very little room and anything can go wrong. You gave those babies the healthiest environment possible. Hell, Monty eats better and you keep her healthier than 75% of us humans! Lets just be thankful for 11 little miracles of life! Cherubs they are, and Monty is such an amazing mommy already. Now for the cutest content ever on 2 channels!",
        "I'm so sorry for your lost Daniel ",
        "Congratulations dad!!! You have done such a great job!  Much love Daniel",
        "I'm so sorry to hear about snowball. Also congrats to Monty u did great job girl",
        "Daniel don't freak out but when your ex-boyfriend was handling dogs one of them had a baby and one of them died. He was afraid of it having again with one of her babies. That's why he was rubbing that puppies back like crazy.",
        "The last 2 puppy’s really said extra delivery for mr. preda but really congrats and I can’t wait for the journey that waits ahead.",
        "so sorry you lost snowball  but praying for you in this time of greif",
        "As soon as I saw you sitting outside my heart felt so heavy  ugh it breaks my heart",
        "joey said there was just 11 of them?",
        "You’re amazing Daniel  My fellow Bostonian- bred Brotha   Hearing about Snowball broke my heart but I know she was in the best hands and you’ll keep her memory w you 🥹",
        "R.I.P Snowball<3 congrats monty on your beautiful puppys",
        "Wow beautiful colors",
        "Wow so many puppies. I'm sorry you lost snowball. Sending you hugs. The last two are like miracle puppies I feel like you should keep one and Joey should keep the other. You guys are such great dog dads!",
        "Rest peacefully Sweet Snowball ️\nCongrats Mama Montana and your beautiful little peanuts.\n11:00 I’m already in love with this little one ",
        "I watched joeys blog first and I was wondering what happened to the little puppy born without a sac, I’m actually so glad that he let you have this moment to yourself to talk about it, it will help with your mental recovery  I knew something happened when his said 11 puppies and yours said 12 ️ I’m so sorry for the loss of baby snowball she’s an angel",
        "What a good girl she is! Hugs for Snowball ",
        "Congratulations, they are such little cutie pies. Momma was a rockstar also. \nI am so sorry about angel Snowball. May she Rest In Peace I’m doggy heaven. ️️",
        "I’m sorry",
        "So beautiful <3 <3 So happy for her and all of the 12, even tho we lost one :( but it happens sadly but everyone else is with you <3 Love you <3 and can't wait to follow the journey from now and to the new families :D <3 Wish I was a bit closer cus Norway is a bit too far :(  But I'm so happy for you all <3",
        "All of them are so sweet",
        "️️️",
        "Oh my gosh I watched Joey's video and had no idea that one of them passed away",
        "So cute",
        "Omg the last puppy was so vocal! my goodness",
        "Sorry to hear about the pup I'm sure she's running around with lavie girl in heaven. You guys did everything you could, you are amazing",
        "So sorry for your loss.  But congratulations on all the wonderful sweet angel babies!! Can't wait to watch them grow. ",
        "Congratulations Daddy-O ! ",
        "Rest in Peace little snowball. Glad the rest of the pups and Monty are doing okay.",
        "I think there are too many dogs in shelters. These puppies will take opportunity for the ones waiting in shelters to be adopted.",
        "Hugs Daniel!   It's never easy losing a fur baby. Especially so young!   Just HUGS!!!",
        "So very sorry for the loss of Snowball!",
        "Will you put Snowball in the garden with the flower girls who sadly passed after birth?",
        "Snowball will have wings of an angel across the rainbow bridge and be cared for by Lavender and the pups from daisy's litter.",
        "Congratulations Daniel you’re an amazing dog dad!",
        "Snowball will be saving you all a spot on the other side  ",
        "So much love you did amazing , Joey as usual haha ",
        "12!!?? OMG! What a girl. ",
        "I thought there was 11",
        "Losing one in a litter happens sometimes. You guys did an awesome job. All the babies are adorable. Mine are at 3.5 weeks now. Supplemented with the breeder’s edge milk replacer. Liked it the best.",
        "I’m so sorry Daniel. I’m so sorry for snowball ️",
        "Awe daddy I’m so sorry about sweet snowball precious baby girl  and congratulations on all the sweet baby’s you have now love you all both very much",
        "you guys always do such a wonderful job ️ and I'm so sorry for the loss of one them I cried as was listening to u. rip lil one️",
        "RIP snowball  I wish you were still here so we can watch her grow but there’s so many adventures that we have to look when these puppies grow and get adopted",
        "retriever naturally have very large litters",
        "I am so sorry for your loss but you did all you could and that's what you have to remember it's hard to loose a dog no matter there stay of life they are in but I am so proud of Monty and you and Joey you all did amazingly can't wait to see the puppies updates on both your channels sending love to you all xx",
        "You and Joey are literal angels  thank you for all that you do with animals. ️️",
        "I’m confused are there 11 or 12-",
        "It'll be 9k, I'm sorry about that one. I'm very upset for you.",
        "I love you  for doing that may she run in heaven, God  has a place for all of them. I lost Mt 25 year old cat to fucking coyote",
        "Congats (-:",
        "So sorry  for the loss of the puppy it's so sad  for mommy  we have a golden  to but she got spayed so never had any  babies",
        "Omg Monty having babies ! ",
        "Oh hun I'm so sorry! She's with the angels now and is being looked over! I send big hugs!",
        "Congrats Daniel and Monte on the arrival of 11 healthy babies. So sorry to hear about Snowball. ",
        "Monty just made me & thousands of others smile & happy cry . Thank you, Daniel & Joey for sharing this Doggy Daddy Series  with us.",
        "Aww, I'm SO sorry Daniel. You have such a huge heart, and I know that this part must have been brutal  Glad you didn't hide it. Monty is such a trooper!! This was so beautiful to see, thank you for sharing it ",
        "Welcome Monty's babies and I'm so sorry for the lost sadly those things happens but thankfully everybody is doing well.. even Snowball too, she rest in peace ",
        "Omg there gorgeous!",
        "That’s so beautiful. New life is amazing. Congratulations ",
        "They are beautiful should defo be a Xmas themed pups xxx",
        "Congratulations to Monty!  I am so glad for a healthy mom and babies ️. Monty did a wonderful job",
        "R I p baby girlxx️️",
        "I'm so sorry you lost one of the puppies  RIP little one",
        "I’m so confused.. you said there was 12 - 1 is 11 how is that 9…. Joeys video says 11 -1 is 10 not 9 .. so what is it",
        "Oh my gosh!!! Monty looked rightfully exhaaaaaaausted after that! Can you imagine giving birth to that many bebes?? Such a good girl!!  sorry for your loss, too, but sooooo much puppy love to be had! ",
        "Rest in peace snowball ️",
        "R.I.P. Snowball ",
        "Rip snowball you will be remembered with all the other lost puppies and kittens️️️️",
        "So sorry Montana lost one of her puppies. \nBut, she has birthed and blessed this world with 11 healthy and beautiful puppies. So excited to see them grow under the careful eyes of you and Joey.",
        "Joey’s such a helper! ",
        "Rip Snowball  thank you for letting us follow Monty’s pregnancy ️ Congrats on those beautiful pups !",
        "Big hugs for the new Dog Dad.",
        "Well done beautiful Monti  love from Bonnie Scotland 󠁧󠁢󠁳󠁣󠁴󠁿",
        "snowball 🥹 that sweet angel is watching over forever and knows how lucky her mommy and brothers and sisters are to have you on this journey.",
        "Congrats to the mommy. She did such a good job! Those little babies are so precious. I’m sorry about Snowball . I just lost my little buddy that I had for 14 years a couple weeks ago. It’s really hard to see an innocent animal pass . Good luck on this journey. I can’t wait to watch!",
        "Monty did such a good job! But I hope you get her spayed after this. There are a lot of rescue dogs and puppies who need homes. Especially since the worst of the pandemic is over and people have started returning dogs to shelters as they go back to work, or people who can’t afford their dogs anymore because of inflation. And if you don’t have a surplus of dogs in your area, there are rescues from other areas or even other countries that will arrange for a dog from an area with kill shelters to come to you!",
        "I'm confused is it 11 or 12",
        "Wow monty is a mama! Congrats!",
        "Could I have one of the puppies",
        "Are you going to keep one of the puppies?",
        "For those more familiar with golden retrievers, I didn’t realize purebreds has markings. Does that mean they’re mixed with something else?",
        "I’m so sorry for your loss!!!! Very sad.",
        "thank you for sharing this. rip to the one pup, I'm glad that pup didn't suffer but I'm happy all the rest are doing okay and monty recovers quickly. I hope you and Joey are proud for taking care of monty and that babies. excited to see the next video! <3",
        "Watching Joey's vlog I was wondering what happened with that one! It's heartbreaking that little snowball didn't make it. I hope you and Joey are ok I know it's always hard losing a puppy ",
        "What a good job, Momma Monty!! I'm so sad to hear that you lost sweet little Snowball :( I'm sending lots of love and well wishes for these pups! You and Joey did a great job throughout the birthing process and it was so interesting to see how the little puppies come out and Monty licks them out of their sacks and cleans them up.",
        "",
        "Congratulations! Your babies are beautiful.",
        "When I saw the green on Monty's tail, I was worried, that looked like meconium, which is from poo in utero and can mean a still born puppy. I'm so sorry.",
        "Congratulations Monty!!! Congrats Daniel! Can’t wait to see the 11 puppies grow up ",
        "I get dibbs on orange!!!! 🥹🥹🥹🥹",
        "Congrats  Monty. Big hug to you for losing Snowball. Can’t wait to see the babies grow up. Best wishes for you and Monty. Thanks for showing.",
        "I'm so sorry about snowball. You did an amazing job delivering the puppies. Rest in peace snowball.",
        "Nothing like a golden.  It keeps home warm and happy.",
        "so sorry for the loss of snowball, you did everything in your power to try to save her. thanks for sharing the entire journey with us, sending you guys lots of love and the puppies are precious!",
        "Daniel and Joey I am so sorry!",
        "Sorry you lost one. But she will not be for gotten.  Love",
        "Congrats omg 11 angel puppies. Rip to snowball may she rest with the angels now. I teared up watching you tear up. And Monty girl did such a good job so proud of her. My depression is really bad right now and seeing these puppies just brightened my night all the way up. I watched Joeys video before this one and i laughed because every time you left the room monty was like alright it's time to push out another one. Monty is so lucky to have you and joey. You guys are the best dog dads ever. Give monty and the puppies a hug for me",
        "I can’t believe you. My respect for you is gone. ",
        "Rest in Peace LIttle Snowball",
        "Great job momma! ( and dad and step dad) this is going to be an amazing journey!!",
        "thank you",
        "OMFG YAAAAAAAAAAAY",
        "Thousands of people on earth should start treating each other the way you treat animals",
        "CONGRATS GRANDPA",
        "It would be amazing to own one of these pups!",
        "Congrats on the 11 pups. My condolences on the one who went to be with the angels  ",
        "Awe sweet cute little babies! I’m sorry for the one loss I know how heartbreaking that can be, but I like to always think of the positives and we have 11 cute little “singing” puppers. They are so cute! Why are all baby animals so cute or really baby anything so cute like baby humans are cute but then we get old and then…. Ew lol ",
        "You handle everything very well sorry to hear about Snowball that is heartbreaking the rest all look healthy and Monty is such a good mom get some rest ",
        "Awwww I’m so sorry you lost one it’s so unfortunate, yet congratulations on the rest of them you and joey will be kept busy in the weeks to come. Love you millions ",
        "So happy to see this...wonderful puppies and you guys have been such a great support for Monty . So sorry for Snowball. Danny Buoy..I admire you alot..",
        "Awww I'm watching this literally after I just finish grooming a dog called Monty. Awwwww",
        "Yeah....the puppies are here. Sorry for losing one",
        "I can tell that you are such a great person with a beautiful soul seeing your reaction to the death",
        "R.I.H Snowball Last two were definitely miracle babies  Monty and her babies are so gorgeous!!!  Congratulations dads ",
        "12??? Wow! I am so sorry you lost Snowball though  I’m glad the other puppies made it ",
        "So exciting!!! RIP Snowball mama Monty did so good and you and Joey made the best team again. Love to you all ",
        "I have never seen a dog have puppies! What an experience!!! And y’all were so sweet and comforting to Monty…perfect lil doulas 🫶",
        "Well done Montana and her Midhusbands (like midwives). Sorry for the loss of one of them but I'm glad the others are doing well so far. Can't wait to see them grow up.",
        "Aw sweet man sorry about your baby snow \nLavy girl will sure keep her company    ",
        "That is indeed a journey!  Just wow. That is a lot of puppies.",
        "Huge congrats to you Daniel. So glad you have Joey there to support you during the process. Really felt your emotions and admire your strength and thank you for sharing that with us even though it was sad… you are such a good dog dad and they’re all so very lucky to have you! Enjoy this time and can’t wait to see them grow!",
        "Awwwwwww, what gorgeous babies and what an amazing mama Montana is. This process is just so beautiful!! I’m really sorry about your loss of that little angel. So hard, while also celebrating so much new life. ️",
        "rest in PARADISE little baby Snowball ",
        "Why didn’t Joey talk about the lost dog at all??",
        "I am so sorry for your loss. It’s hard caring for animals and their babies some times. I own doves and I recently hatched an orphaned egg. They were doing great for the first four days, chirping and eventually opened its eyes. They got their first look at me who was caring for them and I was excited! But suddenly the next day they passed away. I say they because it’s impossible to know the gender a dove is until they are at least a month old. ",
        "Awww Congrats for the babies and RIP to sweet Snowball. Daniel you are an awesome fur daddy and take such good care of Monty. Get ready for the adventure of being a fur grandpa ️️ Glad you have Joey with you. Monty definitely keeps you on your toes! ",
        "I’m so sorry for your loss of Snowball. Thank you for doing everything you can for her and for honoring her by telling us her brief, but impactful, story. I’m so glad Joey was there with you to help deliver the babies, especially the last two. His experience with puppy loss proved invaluable. I’m so excited to see the 11 babies grow up!  Congratulations!  Much love to you all.",
        "Sorry for the loss of Snowball️ But know that you did the best you could️      \nHoʻomaikaʻi~ Congratulations on the rest of the 11 BEAUTIFUL  puppies & HEALTHY Monty️  ALOHA FROM HAWAI'I  LYSSA ",
        "Congratulations!!!",
        "I am so so sorry x fly high Snowball. Watch over your daddy hooman he’s gonna need those cuddles xx snowball sent more angels to you xx",
        "SPAY and NEUTER please so many in the streets abandon",
        "I’m so sorry about Snowball. Sending hugs to you and Joey",
        "Yay Monty!!! What a good girl!! I’m so sorry about Snowball, she’s in a better place now atleast. Monty did so well!",
        "Awe!  I swear you just told us she was pregnant and they’re all here!  Congratulations to you all!  Good job Momma!  RIP baby Snowball.  How exciting and sweet, baby puppies are such a blessing.",
        "I’m so sorry Daniel. This makes me so sad for you. I love how much passion and love you have for your babies. I can’t begin to imagine what you went through. Thank you for sharing. Congrats on all those beautiful puppies.",
        "Rest in peace snowball ",
        "I don’t want to be a Donna Downer but I am so frustrated that you brought 12 puppies into this world while THOUSANDS of dogs a day are being killed in Southern California specifically! As a dog lover it just isn’t making sense. I saw 4 dogs under the age of 3 who have been in shelters for many months get euthanized yesterday because no one came to foster or adopt. Not because they had issues or were unadoptable…. Please foster or adopt ESPECIALLY in California or South!!!! ",
        "God Bless Monty's Dear Heart ! ",
        "Aww Daniel, I’m so sorry for the puppy that didn’t make it ",
        "Poor mama, I couldn't imagine pushing that many babies out.",
        "Yay!!!! God bless JOeY!!!! Daniel and Joey make the BeST team and Joey was amazing!!!! He’s the best dog midwife.",
        "Absolutely broke my heart watching you breakdown with the loss of your lil girl. You are wonderful, gentle man, and did everything in your power to save her. These 11 puppies are very lucky to have you! Congratulations!",
        "They are all so pretty ",
        "Just amazing! Well done all of you, especially Monty \nSo sorry little Snowball didn’t make it ",
        "Proud of you and Joey Daniel! Congrats to Monty and you guys! Sending lots of love!️\n\nAlso wanted to add RIP Snowball, May she rest up with little Dashie",
        "Hugs for Snowball I am so sorry for your loss!! Omg so many beautiful puppies just like there mom. ️️",
        "Joey is much better at this.",
        "You might have to hand feed some of those babies so get the bottles out",
        "Congratulations on 11 beautiful babies and I'm so so so sorry about angel baby.  I'm sure she's running and playing together with the 3 baby girls Joey lost. But you both have so much to look forward to, Have fun ",
        "You did everything you could for snowball, she’s gonna be watching over you, monty and all her siblings from above. Sending love to you and Monty",
        "Omg so beautiful, the journey is so amazing, thank you so much for sharing it with us. And so sorry for the loss of the little angel that did't make it   Still congrats momma monty and the grandpa's",
        "That's Alot of babies for one momma.\nHope momma takes care of every single one including the runt.\nEvery baby pup is important.",
        "I loveeeeeee Golden retrievers ️️️",
        "Damn this happened so damn fast lol! I feel like I just watched the video of you saying that she might’ve been pregnant! Congrats to Momma Monty!",
        " ",
        "I'm sorry Daniel! Losing a dog, even a baby is so hard! Poor Monty! She must be so exhausted after giving birth to 11 puppies!",
        "Congrats on the pups man, I am SO sorry about snowball, sending prayers and love to you Daniel hope they grow up to be little rascals. Love ya all! ",
        "Runts will not always be present in a litter. Even if a litter has dogs of different sizes, the smallest one does not necessarily become a runt. Even if smaller, it may be as healthy as and strong as the rest of the litter.",
        "What a wild ride of emotions for you all. I felt the excitement, happiness, sadness and joy right along with you. You and Joey were amazing through it all! Thank you for sharing this journey! Love you both!! ",
        "I'm confused are there 11 puppies or 10? Because Joey said the one that they thought wasn't going to make it, do to being out of the sak was resuscitated, and Daniel says that one was cold and they tried to resuscitate but the puppy died. I also heard in one of the previous videos that the vet said Monty was going to have between 9 and 11 puppies and she did have 11. So are all the puppies alive and well?",
        "I’m so sorry Daniel about “That Puppy” that died",
        "God,i remember those days!! \n\"Mamaaaaa,,here comes another oooone!\"\" as my hubs calls from the other room\n.....such a harrowing and emotional time for everyone involved. Also a priceless bonding experience,transcending race,gender and species.♡ Love and Light to the proud Papas ,squishes for Mamadog,and a prayerful goodbye to Snowball as she crosses the Rainbow Bridge.",
        "Congratulations she must have been further along than I thought.",
        "When did you and joey become dog breeders?  Crazy how many dogs have gotten pregnant “accidentally” under the both of your care ",
        "My Malinois had 11 total and 3 passed. I think she sat on them . I know the pain. I cried so much.",
        "Congratulations to Monty, she's the perfect mum.",
        "yay... congrats .\nhope and prayer for the mom nd kids",
        "Monte has her hands full!",
        "Awwww Daniel! I love seeing all the new babies, but also cried hearing about your experience with Snowball! Although she didn’t get to live her full puppy life, she is still totally so incredibly loved! Sweet angel baby! ",
        "Wow, that's a lot of pups! Monty is already such a good mom. Can't wait to see them grow up and go to good homes. That said, I'm so sorry for your loss of Snowball. ",
        "Well done monty they are beautiful  so sorry one of them didn’t make it x",
        "Congratulations  papa!  I’m glad Monty is doing well.",
        "Sending love!!! ",
        "Believe me I can relate as far as the Snowball situation. My dog had puppies at the vet. One of them was put down immediately because of some deformities. One of the four remaining puppies was a merel (not sure how to spell that) and he was the runt of the litter. I tube fed him and put him on a heating pad. He started to look better. But on day 2 I came downstairs to my dad crying and… the puppy had passed. He tried for an hour to resuscitate it but it just wouldn’t work. We buried him next to our old dog in the backyard. My deepest regards and condolences to Snowball and may she Rest In Peace.",
        "Virtual hug. I’m so so sorry. Crying with you babe. RIP Snowball ",
        "Amazingly awesome and beautiful job Momma Monty!!!!!! RIP sweet lil angel  Snowball <3",
        "Then you started to cry it made me cry  I know it’s hard to loose a puppy I’m so sorry for your loss, just know she’s not in pain and you did EVERYTHING you could to save her. Rest in Paradise little Snowball ",
        "Omgggg I can’t wait to see the growwww golden retriever is my dream doggg️ I want one",
        "BABUUUUUS",
        "Oh Daniel I'm so sorry snowball didn't make it. I know you heart hurts but it was completely out of your control. It sadly sometimes just happens. Monty did an amazing job and both her and pups look very healthy. Congratulations and well done. ",
        "When women have baby that dies the next one is called a rainbow  baby",
        "Omgggg I want green ",
        "Awe, bless you heart, poor puppy she made her mark and will forever be with you and all of your subscribers and supporters hearts ",
        "R.i.p beautiful snowball.",
        "Monty is such a good mommy  and you’re an incredible dog dad",
        "Daniel I’m so sorry. I know you and Joey did everything you could.",
        "I about died hearing the puppies wanting there milk  ",
        "So sad Daniel as a breeder we go through this sadly sometimes nature is so cruel! ",
        "So happy to see the angels arrive! I’m sorry one couldn’t stay, but she’ll be remembered and lovedhope you spend a lovely time with them and momma, with the great support from Joey. Love you guys and best of wishes️",
        "RIP Snowball!       Joey said Monty “ Wasn’t that attentive” Its not her fault she still is young!! That is so difficult for any animal! Sweet Monty did the best she could at her age! It’s your job, Daniel your protect this from happening again!!!! ️ That puts way to much stress and for their health going through pregnancy and putting them  at risk for delivery of all there puppies! I pray  you will get her spayed after this!!!! ️",
        "So sweet!  Thank you for sharing the video and congratulations on your new arrivals.",
        "Oh Daniel I’m so incredibly sorry  I hope you nothing but the best for all of your wonderful puppies",
        "I am confused though on the title of your video and also the title of Joey’s video you’re saying there’s nine puppies there were supposed to be 10 but unfortunately you lost one so you’re saying there’s nine puppies but your title says 12 puppies and Joeys title says 11 puppies how many puppies in Monty actually have?",
        "I’m sending all my hugs nd love to you Daniel I’m so sorry about snowball she was so cute ️️ and I cried so much with you I’m so sorry ️",
        "It's hard losing puppies before their birth my little girl Marley had four babies and the boy was born stillborn and we had to revive him it took 15 minutes to revive him he's 3 years old now. I am sorry for the loss that little girl it happens though life is not fair sometimes",
        "Congrats! But PLEASE SPAY HER :( we dont need more backyard-bred puppies in this world.",
        "Beautiful, sorry for loss,",
        "Awww I'm so sorry hun...\nhugs \nSending love from 🇨🇦",
        "My baby girl Mia ( husky) had 7 of them almost a year ago. Dec 13 to be exact! It is by far the best thing to watch, however the hardest to watch if one does not make it. I’m so sorry for you and the Mommy. Snowball is playing with   all the other fur babies in dog heaven! Looking forward to the videos",
        "omg Mister Preda can you be there for my childbirth?? haha you helped make that so easy on her",
        "Sorry to say we don’t need any more puppies! Are shelters are full and being euthanized!",
        " CONGRATULATIONS DADDY ",
        "Omg 12 !\n\nGo strong mama",
        "So sorry for the loss of snowball  you did all you could",
        "️️️️",
        "Rip snow ball and it will be so weird if the purple one is a boy",
        "Congratulations!!! They are such gifts.",
        "That was absolutely beautiful, Snowball will watch over her siblings and give them strength for sure, hope the babies keep growing healthy ️",
        "Wow. I just came across this video. I've never seen so many puppy births before. You were all incredible. Very sorry for the loss of your little Snowball. Thank you for sharing your beautiful video.",
        "Oh fuck. Snowball  I’m so so so so sorry for your loss! I just wanted to give you a hug!!",
        "Love you Danny! You’re such a good man! Thank you for sharing this journey with us welcome all 11 mini Monty’s ",
        "IT COULD HAVE BEEN ZODIAC NAMES NOOOOO!!! :(",
        "I’m so sorry about the loss of Snowball - I watched Joey’s version of this video, but I don’t think he mentioned losing a puppy. I hope the rest of the puppies live a happy, healthy, and long life. Rest In Peace Snowball!",
        "I don't have the proper words-. Just so much love and respect for you for sharing the sad news of Snowball and so sorry you had to go through that, but knowing she experienced no pain will hopefully bring some solace. You and Joey are angels for your love of animals and it shows, I know how well prepared you were and how much you tried. Blessings to you guys and the new pups that arrived. I'm looking forward to rest ",
        "Congratulations  …. So precious  RIP to Snowball  you did the best you can do ….",
        "Hugs for the new baby angel Snowball ",
        "Oh wow so beautiful well done girl and dads well done for giving her the best and helping her along your both Angels",
        "This so awesome....Congratulations!! ( so sorry that Snowball didn't make it  )",
        "What a surprising happy ending Omg! They’re so cuteee",
        "Totally sucks... rip young snowball </3 I also had a cat named snowball as well back in 2013 but had to give her up to my best friend cause I was moving to another home. May she rip and enter puppy heaven",
        "I love you snowball!",
        "Congratulations Monty",
        "I’m sorry that you guys lost one",
        "Congratulations",
        " so sorry to hear I hope no others pass & they thrive well ! ️ Monty mama did I great job! It could of been a still born even I bet that happens to but we should still kinda include the angel of the litter to …Don’t blame you taking close care of the babies I would to !…Good Luck  everyone !",
        "CONGRATS",
        "I love how fast the updates are happening! Thanks babes, I hope you also have some plans for christmas I just love your takes on decoration",
        "Am breeding my French bull dog next year",
        "How did she get pregnant",
        "It’s so hard. You’re such a wonderful doggy dad and always do good. Hugs.",
        "This was the best day ever.! Daniel you have the biggest heart, I too cried for snowball, but you’re right,,she. Is an an Angel. God bless you for being so good.",
        "So much love for little Snowball <3 ! The other 11 little angels are so precious! Love form Italy!"
    ],
    "comments_disabled": false
}