{"video_id": "EPwugTRTscg", "comments": ["THE ANGELS HAVE FINALLY ARRIVED Thank you guys for being here and following along the journey!  I appreciate concern, EDUCATED opinions and KIND advice, if you are here to threaten, verbally abuse, or spread your uneducated agenda while bullying others, you will be BLOCKED AND REPORTED. If you don't like it, don't watch, I will not stand for disgusting behavior here on MY page.", "I am so sorry you lost Snowball. Sending you hugs and the hopes that the 11 other puppies all go to amazing homes. Thank you for everything, Daniel and Joey <3", "Hugs for Snowball.  I am so sorry that happened and you did everything you could. She made her mark and will always be remembered ", "Huge congrats to you Daniel. So glad you have Joey there to support you during the process. Really felt your emotions and admire your strength and thank you for sharing that with us even though it was sad… you are such a good dog dad and they’re all so very lucky to have you! Enjoy this time and can’t wait to see them grow!", "i’m so sorry for the little one that didn’t able to see the world, my baby girl gave birth to 4 puppies but one too passed away because there was no protection sack  i just want to think that the puppy left something in heaven so they went back for a little bit before finding a new body to born into ", "I’m so sorry about the loss of Snowball - I watched Joey’s version of this video, but I don’t think he mentioned losing a puppy. I hope the rest of the puppies live a happy, healthy, and long life. Rest In Peace Snowball!", "I’m so sorry for your loss of Snowball. Thank you for doing everything you can for her and for honoring her by telling us her brief, but impactful, story. I’m so glad Joey was there with you to help deliver the babies, especially the last two. His experience with puppy loss proved invaluable. I’m so excited to see the 11 babies grow up!  Congratulations!  Much love to you all.", "Wow so many puppies. I'm sorry you lost snowball. Sending you hugs. The last two are like miracle puppies I feel like you should keep one and Joey should keep the other. You guys are such great dog dads!", "This hits different because its from a doggo we are all VERY familiar with here and on Joey's channel. Thank you 3 for all the hours and work you put in to help M, and her puppies!\nI teared up at the end with the music and just seeing what a great mom M is gonna be.\nSnowball is and will always be family. Thanks for giving her a collar. <3", "You did everything you could for snowball, she’s gonna be watching over you, monty and all her siblings from above. Sending love to you and Monty", "Congratulations to Monty!  I am so glad for a healthy mom and babies ️. Monty did a wonderful job", "Sending love  You did absolutely everything you could for Monty and all of the little puppies, especially the angel Snowball. I hope you have peace that you did everything and there was nothing more you could’ve done. I know that doesn’t make things less painful though.", "So much love for little Snowball <3 ! The other 11 little angels are so precious! Love form Italy!", "Congrats on the little ones, and so sorry for the lost the precious angel, Snowball. She/He will be missed on this journey. May you have strength for Monty and puppies !!!", "Its not your fault Daniel.. i know loosing a puppy is so hard and I’m so sorry… sending you a big hug and positive thoughts and vibes", "She did so good!! The perfect little mama! Can’t wait to see these little angels grow up! Snowball will be their guardian Angel!! ", "so sorry for the loss of snowball, you did everything in your power to try to save her. thanks for sharing the entire journey with us, sending you guys lots of love and the puppies are precious!", "So beautiful Daniel. 2 angel babies really took their time coming into the world! Congratulations Papa! Let the journey and pup fun begin!   ", "Daniel you have such a huge heart and sense of compassion. Never lose that ", "I think it's so funny how Monty has her proud mom face all the time. Even after pushing 12 babies and going through so much pain. My heart shattered a little with snow ball. Hard to move on but it's the only option available", "I’m so sorry to hear about Snowball! You gave it your all. She will always be remembered  sending big hugs and so much love your way. You and Joey are truly inspiring and I can’t wait to follow you both on this journey! Way to go Monty!!", "Monty is such a good mommy  and you’re an incredible dog dad", "We love you snowball she did so well and so did you  it’s hard losing one but your angels came to help!", "I watched joeys blog first and I was wondering what happened to the little puppy born without a sac, I’m actually so glad that he let you have this moment to yourself to talk about it, it will help with your mental recovery  I knew something happened when his said 11 puppies and yours said 12 ️ I’m so sorry for the loss of baby snowball she’s an angel", "Thank you for sharing this miraculous moment with us, I cried the entire time!", "You’re amazing Daniel  My fellow Bostonian- bred Brotha   Hearing about Snowball broke my heart but I know she was in the best hands and you’ll keep her memory w you 🥹", "Aww precious Snowball️RIP  You're such a good puppy dad Congrats on your beautiful fur babies!", "Congrats omg 11 angel puppies. Rip to snowball may she rest with the angels now. I teared up watching you tear up. And Monty girl did such a good job so proud of her. My depression is really bad right now and seeing these puppies just brightened my night all the way up. I watched Joeys video before this one and i laughed because every time you left the room monty was like alright it's time to push out another one. Monty is so lucky to have you and joey. You guys are the best dog dads ever. Give monty and the puppies a hug for me", "I don't have the proper words-. Just so much love and respect for you for sharing the sad news of Snowball and so sorry you had to go through that, but knowing she experienced no pain will hopefully bring some solace. You and Joey are angels for your love of animals and it shows, I know how well prepared you were and how much you tried. Blessings to you guys and the new pups that arrived. I'm looking forward to rest ", "Aww, I'm SO sorry Daniel. You have such a huge heart, and I know that this part must have been brutal  Glad you didn't hide it. Monty is such a trooper!! This was so beautiful to see, thank you for sharing it ", "Oh, Daniel... I'm so incredibly sorry for the loss of Snowball. You and Joey did so great. She will live on forever in our hearts, and will never be forgotten. I'm sending you both my love. You're wonderful people, and Monty is such a fabulous mama. ♡♡♡", "So much joy ️️ welcome to the world babies!! Enjoy every moment of it Daniel, you deserve all these good energy coming into your way. ", "So sorry about lil Snowball. You did the best you could and that's all that matters. I understand it's hard to lose a lil pup. You're such a great dog dad and I wish you the best.", "Congrats Daniel and Monte on the arrival of 11 healthy babies. So sorry to hear about Snowball. ", "So sorry Montana lost one of her puppies. \nBut, she has birthed and blessed this world with 11 healthy and beautiful puppies. So excited to see them grow under the careful eyes of you and Joey.", "Oh my goodness...this is the sweetest thing I've ever seen. Monty is so loved...truly a cherished girl. What a great moma too. I'm so sorry about Snowball but you tried everything possible..you really did. She got her little wings....️", "Well done Montana and her Midhusbands (like midwives). Sorry for the loss of one of them but I'm glad the others are doing well so far. Can't wait to see them grow up.", "So happy to see the angels arrive! I’m sorry one couldn’t stay, but she’ll be remembered and lovedhope you spend a lovely time with them and momma, with the great support from Joey. Love you guys and best of wishes️", "Joey can almost name them the Zodiac signs like he wanted lol. Congrats on the puppies ", "you guys did the absolute best for Monty and her puppies ! \nso sad for the loss of snowball, these things happen unfortunately, but you guys have so much to be grateful for!", "I really wanna hug Monty for her hardwork with the delivery....", "I love how fast the updates are happening! Thanks babes, I hope you also have some plans for christmas I just love your takes on decoration", "Rest peacefully Sweet Snowball ️\nCongrats Mama Montana and your beautiful little peanuts.\n11:00 I’m already in love with this little one ", "You did everything you could and you didn’t give up on her️she will be remembered, little angel Snowballcongratulations with the other puppies, Monty is the best momma", "Felt so good to see joey and Daniel doing a video together again ", "Hugs and kisses for snowball. I’m so proud of you and Joey for working together to help Monty give birth to the puppies ", "I am so sorry you lost Snowball. Sending you hugs and the hope that the 11 other puppies all go to amazing homes. Thank you for everything, Daniel and Joey <3", "I am so deeply sorry for the loss of little snowball. Thank you for being so open with us even during those bumps. Congrats to Monty I know she will make a fantastic momma. Bless both you and Joey for being thr wonderful souls that you are and helping not only Monty but other animals.", "YESSSS I kept checking you guys channels!, CANT wait to see the puppies grow and the names you guys pick out for them!.️️️", "Congratulations   They are so beautiful. My deepest sympathies for the loss of the little white Angel.  ", "That was absolutely beautiful, Snowball will watch over her siblings and give them strength for sure, hope the babies keep growing healthy ️", "Congrats Monty! All that good nutrition etc seemed to help with the birth being a bit easier! Such a great mama! \nSorry for the loss of Snowball!  \nHugs and love to you both, Daniel and Joey! ️", "So sorry about Snowball. Hugs and love to you, Monty, Joey, and the rest of the puppies.", "I'm sorry for your loss of the little one. I can't imagine going through something like this\n\nI'm glad the rest of the pups are doing well. I'm glad Monty is doing okay. She did very good giving birth. You and Joey did what you could do to help. That's all that matters", "OMG!  Congratulations, 11 Puppies. You guys did so well in guiding Monty on how to handle this pregnancy. Poor Monty she really looked tired. All your nutrition kicked it well for Monty. Her birth was easier than expected. Thanks for bringing in the humor with the banter you and Joey have it broke up the tension because let me tell you I was feeling it. Again, you did so well supporting Monty! Take the weekend off what's left of it and enjoy yourselves you guys did good!", "Well done Monty-girl on delivering all those babies! I am so sorry to hear about the loss of Snowball, I cried with you Daniel, thank you for making sure to include the truth of how these things do happen, and how sad and painful that is. I am so glad that the other 11 are ok, and can't wait to see what it will look like when there's 11 goldens running in the garden.", "Awwww  they are sooooooo cute & tiny. I can't wait to see them grow.", "What a good girl she is! Hugs for Snowball ", "Proud of you and Joey Daniel! Congrats to Monty and you guys! Sending lots of love!️\n\nAlso wanted to add RIP Snowball, May she rest up with little Dashie", "You guys did amazing Daniel, when you came in the room to see monty and came over to her you could see such a deep connection between you two, you’ve been on so many amazing adventures together. So beautiful to see. Can’t wait for you guys Christmas together with all the animals this year. Love to you all x", "Though my heart breaks for the loss of Snowball , the sweet blessed one will never be forgotten and forever in  our hearts. A huge congratulations to amazing Monty and to you and Joey for being there for her and her adorable babies. I look forward to the journey of your dynamic loving family and supportive friends. You all did amazingly well. All the best to you all . ", "I’m so sorry Daniel. This makes me so sad for you. I love how much passion and love you have for your babies. I can’t begin to imagine what you went through. Thank you for sharing. Congrats on all those beautiful puppies.", "Sweet thoughts for Snowball ️ \nWhat a whirlwind, congratulations to all! Monty is a labor goddess! Those puppy squeals are so stinking cute!", "So sorry for your loss.  But congratulations on all the wonderful sweet angel babies!! Can't wait to watch them grow. ", "what an emotional roller coaster. so glad that monty is OK.she has done you proud and she never even made a sound.look forward to seeing the puppies as they grow.X", "I'm glad that Monty is doing great and that the birth went well! She did amazing! I love the ode to Lavygirl with the purple collar too ", "Joey’s such a helper! ", "I have never seen a dog have puppies! What an experience!!! And y’all were so sweet and comforting to Monty…perfect lil doulas 🫶", "Brings back memories of Lark.  You guys have come a long way since then.  Both of you are wonderful sweet men with giant hearts.", "thank you for sharing this. rip to the one pup, I'm glad that pup didn't suffer but I'm happy all the rest are doing okay and monty recovers quickly. I hope you and Joey are proud for taking care of monty and that babies. excited to see the next video! <3", "What an amazing mother, Monty, and her two hooman granddads!  Twelve -1 puppers!  I think Monty just had her first TWO litters, at once.  Quite a journey ahead for the next 4 months!  Blessings and best wishes to all!  I hope Monty gets back on her feedings sooner than later.  She's going to need so much nutrition for all those thirsty little ones!  I know she'll be eating like the royalty she is!", "What a surprising happy ending Omg! They’re so cuteee", "Oh Daniel I'm so sorry snowball didn't make it. I know you heart hurts but it was completely out of your control. It sadly sometimes just happens. Monty did an amazing job and both her and pups look very healthy. Congratulations and well done. ", "What a good job, Momma Monty!! I'm so sad to hear that you lost sweet little Snowball :( I'm sending lots of love and well wishes for these pups! You and Joey did a great job throughout the birthing process and it was so interesting to see how the little puppies come out and Monty licks them out of their sacks and cleans them up.", "Yay for Mama Monty. I'm so sorry for losing Snowball, but she is still very loved and I'm sure will watch over her mama and siblings. ", "Now THAT was a full Monty!  So adorable and so happy to see what a great job mama did.  Very healthy looking puppies.", "12??? Wow! I am so sorry you lost Snowball though  I’m glad the other puppies made it ", "Now it’s time to wait for Laura to gift a puppy to Tyler!!!", "Rip snowball you will be remembered with all the other lost puppies and kittens️️️️", "What a beautiful family you guys create!", "I'm so sorry Daniel, I really am. It's absolutely heartbreaking. Sending you, Joey and of course Monty lots of hugs from the UK. Rest in peace Snowball ️", "Oh Daniel I’m so incredibly sorry  I hope you nothing but the best for all of your wonderful puppies", "You and Joey are literal angels  thank you for all that you do with animals. ️️", "Great job momma! ( and dad and step dad) this is going to be an amazing journey!!", "God,i remember those days!! \n\"Mamaaaaa,,here comes another oooone!\"\" as my hubs calls from the other room\n.....such a harrowing and emotional time for everyone involved. Also a priceless bonding experience,transcending race,gender and species. Love and Light to the proud Papas ,squishes for Mamadog,and a prayerful goodbye to Snowball as she crosses the Rainbow Bridge.", "That was Just so great I really felt for Daniel over white puppy. good to see Joey and Daniel sharing the important moments .", "I about died hearing the puppies wanting there milk  ", "You are such an amazing dog dad.  The puppies look like chubby, healthy bundles. I’m so sad the little one didn’t make it. The runts always have a special place in my heart. One of my current dogs is a runt and he is so special. I hope you guys are doing ok. It’s gut wrenching to lose an animal. I know when my ferret had babies and two of them didn’t make it I agonized for days and I still think about it 20 years later.", "Sending you the biggest hug. Snowball will watch over her brothers and sisters. Give Monty and all the puppies little kisses for me. Take care!!", "I admire your strength, Daniel. I’m so sorry about Snowball. You deserve some time and relaxation after this. Congrats on the other pups!", "So beautiful <3 <3 So happy for her and all of the 12, even tho we lost one :( but it happens sadly but everyone else is with you <3 Love you <3 and can't wait to follow the journey from now and to the new families :D <3 Wish I was a bit closer cus Norway is a bit too far :(  But I'm so happy for you all <3", "Monty just made me & thousands of others smile & happy cry . Thank you, Daniel & Joey for sharing this Doggy Daddy Series  with us.", "R.I.H Snowball Last two were definitely miracle babies  Monty and her babies are so gorgeous!!!  Congratulations dads ", "Awww Congrats for the babies and RIP to sweet Snowball. Daniel you are an awesome fur daddy and take such good care of Monty. Get ready for the adventure of being a fur grandpa ️️ Glad you have Joey with you. Monty definitely keeps you on your toes! ", "I am so sorry for your loss but you did all you could and that's what you have to remember it's hard to loose a dog no matter there stay of life they are in but I am so proud of Monty and you and Joey you all did amazingly can't wait to see the puppies updates on both your channels sending love to you all xx", "She’s doing incredible for a teen mom ", "Rest in peace little angel you could’ve made a family extremely happy, but now you’re in a better place, my god is this heart breaking, I’m so so sorry for your loss", "Im so sorry for your loss. Breeding (or whatever you are doing) is so hard for this exact reason. Nothing is ever promised and things can and do go wrong. If you are really serious about breeding (or whatever) and being responsible and ethical then PLEASE, get all the pups and mama OFA tested and make sure futured studs are as well and everything checks out good. I have watched and loved you guys for so long but id never be able to support anyone backyard breeding, especially those who have such reach. Doing OFA is so important as it can tell you how healthy your dog is health and body condition wise. PLEASE look at the OFA recommendations for Goldens and OFA these pups and any you may have in the future. Holding people responsible for having responisble breeding practices and breeding only healthy dogs is how we are going to end the overcrowding and overflow of shelters.", "That last scene of Joey holding the puppy up, he’s got blood on his face  thinking of you both and Monty and all the babies! Congrats and my condolences for little snowball. :( sending my love.", "Wow. I just came across this video. I've never seen so many puppy births before. You were all incredible. Very sorry for the loss of your little Snowball. Thank you for sharing your beautiful video."]}