{
    "video_id": "evUfG3lrk5U",
    "comments": [
        "Спасибо вам за просвещение!",
        "So essentially what you're saying is I am a star.",
        "as always a wonderful video!",
        "5 mins in and my mind is already so blown",
        "big questions",
        "I can tell you! I'd finally be free of a system that forces me into indentured servitude by holding my family hostage. Every time I glance up to the night sky during my working hours, and I'm lucky enough, if but for a moment, to see through all the cancerous pollutants of industry that shield this wretched little ball of misery we call Earth from the stars, I wish and pray that the heavens save me from this blighted existence, from all of you. Goodnight!/morning",
        "ive seen a dying star it when i was kid it was interesting it happened at night",
        "What an amazing video! Im studying bology, but now im not sure if physics would have bin the better choice",
        "That sentence, about the hydrogen bomb and the Sun, I legit had to rewind like three times to understand wtf did I just hear",
        "I have always wondered why a supernova wasn't even more powerful than they already are.\nSo, let say IF a massive supernova and GRB would happen at the same time nearby each other. Which of the 2 would overpower the other? Or would they instead of counteracting each other, rather reacting on one another and become something even more crazy powerful? I'm curious to what would happen when extreme cosmic events meet. I hope you can do a video about that.",
        "Short answer: We die\nLong answer: W go extinct",
        "Thank You, Really  enjoyed and learned -:)",
        "We are way overdue for a supernova in the Milky Way. I have a feeling that one of these days, the sky is going to light up like there's another Sun and people are going to go crazy because it's going to be the coolest thing anyone's ever seen.",
        "IRRESPONSIBLE! The cartoon of the guy exploding a hydrogen bomb in front of his eyeball should include a \"Don't try this at home\" disclaimer.",
        "One time I followed a Youtube recipe for a chicken vindaloo. It said to use 4 red chillies, but all I had were Carolina Reapers. I put four in, and hoped for the best. 6 hours later, I felt the need to go to the bathroom. The resulting explosing turned supernova. My Vinda-neutrinos are currently traversing their way across the universe, at 250x the speed of light.",
        "Did anyone else notice how Odins and Atreus eyes match colors perfectly?",
        "2 days and only 1.8 mil views? For content like this, you deserve a lot more!",
        "Your videos makes sense and rises more questions than answers.",
        "We r so lucky and humble to see this channel is still going on as ut was before.",
        "I love, and hate these videos. Makes me wonder about reality :/ But I love it.",
        "IIRC the simulations still fail to reliably reproduce how exactly the energy of collapsed core transmits into the rest of the star to cause it to expand. The shock wave is generated, yes, but it is not strong enough, and gets \"swamped\" by the infalling stellar matter. We assume that neutrinos \"somehow\" manage to pass a fraction of their energy to the stellar matter, but it does not exactly work when we simulate it quantitatively.",
        "What like a fusion reactor in space ?",
        "Another awe inspiring, informative and visually stunning video by Derek.\nIt was possibly the greatest thing you have done is drop the graveyard shift at the neutrino detector and come to Youtube!\nAfter all, at least on the science topics on youtube, you are a supernova light source here! Many stars have faded away but you kept us in light!",
        "This video is absolutely fabulous. Keep up the good work.",
        "Thank you for linking your sources. I‘m currently searching for subject for my scientific work for school (Germany) and I‘m fascinated by your videos and would like to be inspired by some of them. If there wasn‘t the catch, that your older videos have no sources….so thank u xD",
        "Nothing would happen since the nearest star is proxima centauri 4.2421 light years away if your not takling about the Sun of course a burst of radio waves and maybe emp interference but doubtful I'm sure it would provide some great views for several years.",
        "This guy and Anton, some of the best independent content.",
        "Great stuff",
        "Dat's nuttin'!\nA black hole explodes on the planet every time I go to the toilet.",
        "The fact I (as someone who loves Math and Science) can watch any Veritasium video and come out of each one appreciating the small quirks of our universe, speaks volumes to how amazing this channel is.",
        "This was awesome! So well presented.",
        "What blows my mind is that we are here because another star died. We are a child of a Star.",
        "Hi,\nAt 8:20 you mentioned the not all massive stars, specfically stars that end up as black holes, go supernova. I did some research and I cannot find anything to support it. Can you, or anyone, point me to a source that explains this? Because I was under the impression that all massive stars <8 solar masses go supernova and either form a neutron star or black hole.",
        "Yet yall say this is all by chance smh",
        "Veritasium never disappoints. He always tells you true stuff unlike comparison YouTube Chanel’s",
        "If you're going to add a film grain to the animated sections for the love of science would you please increase the speed, I tried wiping it away because I thought it was cat hair or carpet fibers 4 or 5 times before I realised it was just a poorly implemented filter.",
        "So evrything a common man will ever sees is formed due to the butterfly effect of start burst",
        "Great video! I did a degree in physics and astronomy and can say this was a great, easy to understand review of some of our favourite cosmological objects and I really enjoyed you linking some of the supernova events in the past with extinction events on earth :) I didn't know about some of those connections, thanks as always for sharing!",
        "It makes me to laugh loudly when I'm listening to this marvellous explanation about star's life way, and  remembering what muslim's book \"quran\" says about star existing ! \nThat stars are working as \"Windows Firewall\" function by stoning satans and restrict them to go up in skies and spy to angels conversations ... !",
        "Superb video Derek, you never disappoint.",
        "what would happen if you did an episode on punching and knockouts, the physics thereof? You can also get '\"down as close to the copper\" as you can in terms of granularity, of why testicle tribulation so titillates our funny bone? How cruel are we, and how well built are for it(especially in a prehistoric context)?",
        "This guy continues to fire out detailed scientific video's that I have found fascinating over the years.  Some are a bit beyond my comprehension; most others not, in large part due to his mastery in both knowledge & presentation of the subject matter !",
        "Detonate a tsar bomb to the eyeball x 1 000 000 000 that is a bit bright i guess",
        "I’ve never thought how bright something can get, is there a limit to brightness? Also the supernova was observed nearly a thousand years ago, that isn’t when it happened though, right?",
        "Well, this is undoubtedly one of the best explanations about how stars and supernovas work I've ever seen. Great job!",
        "GREAT Vid. I could not have explain this better ",
        "I can't get enough videos about supernovas. They are just too damn interesting and are some of the most gorgeous events we can witness",
        "Is it just me, or did Kurzgesagt just copy this video?",
        "Love how Veritasium took this topic and really went in depth with different scenarios.\nUnlike other clickbait \"Scientific\" youtube channels out there",
        "I can't say it in other way than I friking love this channel. Thanks for what you do guys.",
        "I want to see a quasar near the Earth.",
        "Very fascinating video!",
        "how can all these thing come into being without some intelligent creator",
        "The surreal part of this is the scale of distances and damages in this video. Like scientists were able to detect a Gamma burst affecting the atmosphere noticeably and it came from 2.6 BILLION LIGHT YEARS!?\n\nIf you can travel at half the speed of light (which is impossible to generate by humans for anything more than a particle ), and if you had started around when earth was made, you wouldn't have still reached the place where that supernova happened",
        "This is a top notch video. Well done.",
        "How lucky the medieval people to witness such events without a telescope..",
        "A magnificent presentation!",
        "Amazing video! One of the best explanations of a Supernova that I was looking for a while now and you happend to make one today! That's why I love this channel. Has an amazing narrative in telling a scientific story and we all love a good story. Unfortunately I was also hoping for a quantum explanation to what happens when a star decides to go the other way and become a black hole. That would have been amazing! Maybe in the near future, I really hooe.",
        "What if people like you and the media would stop making their fortunes off of doing their best to scare the crap out of people to get their attention. Drama is the biggest seller of good ever imagined. If the media would focus on good things they would be afraid of losing their audience and their fortunes.",
        "the detail and research that goes into these videos is truly next level!! keep up the amazing work ",
        "thank you for breaking it down!!With everything going on right now, the best decision to be on any creative man's heart is having a profitable investment strategy.",
        "It's Arab astronomers not Arabic astronomers. Arabic is a language not a people. Also, many 'Arab' astronomers and scientists were actually Persians, so it's safer to say Middle eastern or Islamic.",
        "E",
        "my mind just went supernova after this .... ",
        "Me before watchin: I guess we die lol",
        "this is a brilliant video ;)",
        "With the intro I am reminded of the place on One Piece Luffy and Katakuri squared off, and the place where our elastic friend showed off his Gear 4 Snakeman form. As for those mirror colored versions of Zane and KC, least I think thats them, at the end of the intro reminds me of the show Hero 108 when Penguin King used light shards from the Aurora borealis to create mirror clones.",
        "Lovely fantasy...",
        "Hello! Nice video and great explanations, so thank you!\n\nHowever, at 3:11 and in the following scenes, there are a few discrepancies regarding a star's mass and its life span... For instance, the R136 star cluster in the Tarantula Nebula, LMC, contains a number of stars that are well over 100 solar masses. Yet the cluster (hence the stars contained in it) is estimated to be 1-2 millions of years old. So how can Var 83, at 60 solar masses have a (total) life span of only 400k years?",
        "Iron is not the most stable element, its nucleus is actually the most stable amoung the other naturally occurring nuclei...",
        "That is going to be a very bad day.",
        "\"A hydrogen bomb explodes right on your eyeball\". Cringest analogy.",
        "Just the Derek way, I am saving this for further research and study … Incredible Work Sir ",
        "Were you paid to say the sun will not explode? You of all the people should be more infomed. Disappointed. You do a great job but should look into stars going into micronova and other explosive \"events\" and have been categorized with titles of almost anything but the correct title. So before you state \"never explode\" you should do more homework. Even Isaiah says the sun will be 7 times brighter in one day.  See chapter 30:26 \"Moreover the light of the moon shall be as the light of the sun, and the light of the sun shall be sevenfold, as the light of seven days, in the day that the Lord bindeth up the breach of his people, and healeth the stroke of their wound\".",
        "This is the first time I've seen an in depth explanation of what causes a star to go supernova. I've realized I know nothing.",
        "Would the heliosphere not also protect us? Not just our atmosphere.",
        "don't phontos have no mass tho how do they prop it up",
        "I never heard about the connection between supernovae and neutrinos, but always found both fascinating.",
        "ty all!",
        "tl;dr - We Die.",
        "The galaxy is in constant change, all the crazy reactions between particles, merging of starts, explosions… and there is still no proof of life outside the Earth:(",
        "Space is mind boggling. The more you think about it the less significant you feel. the mnore think about it, the more you realize we were just coincident, and not put here for a reason. We just happened to exist or come about. Universe has a different much grander purpose than to sustain or entertain us. That is kind of sad but true.",
        "how u uses the animation please tell man",
        "The next video you should make it 40 hours long and talk about it something that will never happen no wonder I didn't watch it...",
        "So a few days ago, a random light popped out of nowhere and it was the brightest thing I've ever seen in the sky, i took some pictures and I was thinking to myself \"have i witnessed a supernova explosion with my own eyes?\" It was so bright but it slowly started to fade away, the next day I couldn't see the light anymore, so I'm wondering if it's a supernova explosion.",
        "Very good and totally fascinating, thanks your a 'STAR' ;)",
        "I’m thinking  a SPF 20 sunscreen will suffice for a supernova",
        "Mark V\" ofcourse removed his comments cause he couldnt keep up. Try harder next time.kid.",
        "Thanks, Derek, that was awesome!",
        "I've seen so many videos on this topic, but this was fun too!",
        "If you put your eyeball right on a nuke as it goes off, I doubt you're going to be around long enough to even worry about the brightness of a supernova.",
        "Thanks for reinforcing what I really already knew - I’m dumb as a box of rocks.",
        "I don't believe any of this, we deep down don't even truely know what is a the center of our own planet. But it's a good 'theory' explained in the video.",
        "I want the 4 hour extended edition of this video",
        "Gravity always wins.",
        "What I mostly want to learn is, if the sun went supernova (setting everything else aside) how much of the light would be reflected by the moon, and how bright would it be on the night part of the earth (again setting everything else aside).",
        "0:43 is there footage of something more astounding in life, or am i mistaken?",
        "How many muons did this supernova send out to earth to create a partial extinction? As far as I know muons are REALLY REALLY non-interactive, you even said it yourself in another video, so if muons were to come in contact with these particles they would just not interact with them. Interactions with muons are super rare... so either there were a true buttload of them or that was not the case of the extinction.",
        "You should also make a video on the creation of photon",
        "Unsettling.",
        "Thank you Veritasium, almost every video you create manages to renew my love of science. Week after week, month after month.",
        "Dude, when Atreus said he wanted to go hunting sounding like he was seconds away from bursting into tears my heart just dropped.",
        "I wonder how this effect doesn't apply to Etir? Shouldn't they get iron from their machine?",
        "2 minor corrections in the video\n1. At 3:51 Oxygen  (Z=8) fuses into Neon (Z=10) and not the other way round (since 10 > 8).\n2. At 4:15 All Uranium in this universe has been created with Fusion. So, fusion does not really stop at Iron. It is endothermic (energy-consuming) nuclear fusion reactions that created every atom of Thorium, Uranium, Plutonium etc. that we witness on Earth (and else where) today.",
        "What happens if a war breaks out on between nations and what can we do to stop it? Isn't that a more useful question? Or what can we do to save our money in the current inflation and still having something to eat and being able to survive?",
        "I remember reading that XKCD What-if blog about lethal dose of neutrinos that talked about the hydrogen bomb in your eyeball analogy. I laughed my lungs out at the time and am so happy it was mentioned here.",
        "What do u mean it was \"bright enough to cast a shadow\"??? How does a star cast a shadow?",
        "Kepler's three laws of gravitation",
        "Wait you said some massive stars don't go supernova instead they become blackholes; but I thought these massive stars would go boom like supernova before going blackholes right or do they just disappear suddenly and become blackholes ?",
        "Pee pee \nCa Ca",
        "Neutrinos are so meta in supernovae that they are the lightning while the light became the thunder",
        "Us, mercury, Venus, earth and maybe Mars is reduced to ashes. Saved you 19 minutes.",
        "im a space nerd",
        "That bubble around our sun any system is from our sun micro nova",
        "Oh, don't worry, we could sort out an ozone deficiency. We've done it before, just using hair spray.",
        "9:18 why that dog have 5 legs",
        "Awesome video. But you missed one incredible connection at the end. We don’t owe a debt to supernovae just because mathematical models show they probably triggered our star’s formation. No, the existence of elements heavier than iron shows that we ARE the remnants of supernovae; those elements aren’t made anywhere else. ",
        "Well it is so bright thay safety squint wouldn't help you .",
        "Man this is great. \nCan you make something like this on BlackHole  toipc.",
        "nothing. if a star tried to explode near earth i would simply stop it.",
        "Neon fuses into Oxygen??? Isin't oxygen no. 8 and neon no. 10? How can that be? If it is the case, what's the mechanism?",
        "hypotheticaly if the supernova whent off on the oposite side of the sun we might be safe.",
        "Funny the video gets the history a bit wrong and fails to mention the first observation of a supernova was actually by Tycho Brahe who in 1573 documented the observation in his \"De Nova Stella\".",
        "So at the end of the star's life when nickel has decayed into iron, what would happen if one could add energy to the star?- what would the iron turn into?\nGreat video!",
        "Nothing like a new veritasium video with my morning cup of coffee to start the day off! Especially an astronomy one :)",
        "We die. That's what",
        "In the words of Neil deGrasse Tyson, \"we're all just Stardust!\"",
        "i’m extremely proud of the way my dad explained supernovae to me when i was about 5. he told me to put my hands out, facing each other, and then he put his hands on mine. he then told me to push outwards, as hard as i can, while he pushed inwards, which made my hands collapse. he said that when a star wasn’t strong enough anymore then gravity won.",
        "This was a great video, one of your better ones. You are a master at delivering your scripts too, well done.",
        "That was freaking awesome! Sooo well explained! Masterful! Hats off to Veritasium. You out-did yourself this time!",
        "Well here a 1 month lession covered in 20 min",
        "/\"Andrew Prahlow - End Times\" starts to play/",
        "This is crazy!! Always in you channel, if I read the title of your videos, I'm not that excited to go watch it. But when I do, it's so awesomely fascinating every time!",
        "Answer: we all die.\nNext question?",
        "If it would be 8x mass then sun would go explode supernova at the end of its life even though it will end its life by supernova without 8x mass please correct me if I'm wrong.",
        "Loved the information you provide , interested in more such content",
        "This is a related, but somewhat unrelated question. Is it possible that the removal of Coulombic forces could force the Earth's Core to form into a Hypernova? I ask because there is this one anime (No Game No Life, would recommend, BTW) that claimed that it forced temps to nearly 50 billion degrees celsius, which was also stated to be rivalling the Big Bang. Just curious here",
        "I adore the fact that since Kratos broke that barrier for himself and realized a hand on the shoulder is a good way to show affection, he started doing it ALL THE TIME. It shows that Kratos has a lot of love to give and just didnt know how to convey it before. Really subtle but clever storytelling ^_^",
        "I've seen countless videos and understood partially, but this is the first time I actually understand how and why of a supernova. The amount of simplicity it went to explain this, my salute to Derek for making space and science fun and simpler.",
        "Question: if Gravity is not a force but a resulting effect of space time curvature how does it \"work\" in this case? How Gravitiy is pulling Star into its center?",
        "Another brilliant video Derek. You deserve a Netflix series.",
        "He visto al menos 3 super novas en mi vida y una por ejemplo tenia una camara web en la ventana y no la capturo, si miraba la veia pero miraba la pc y nada. la ultima fue un punto rojo que resulto ser una nova en centauris",
        "I had an abdominal and pelvic CT and 8 chest x-rays over the course of 6 months, of which 6 x-rays and one in the last 3 months, what is the risk for my body?  the total is 9",
        "My favorite part is where events occurring 2-4 million years ago are described as \"recent\"",
        "Veritasium kurzgesagt collab confirmed? xd",
        "Hypothetical thought experiment.\nIf there was a solar system sized earth like atmosphere. and our star was capable of supernova. what would it be like if out star went supernova?",
        "Two things. It's amazing to think how much we know about something that we can only observe from afar. I'd like to see the process of how scientists came to know so much about our sun. Second, I couldn't help but notice the scientific plug that Marvel did in Avengers: Infinity War when Thor went to forge Stormbreaker with the heart of a dying star. Awesome video!",
        "What I don't understand is, why don't we see supernovae more frequently?  I would think that they would be a fairly common occurrence.",
        "Neon can't fuse into oxygen. That would be fission, not fusion.",
        "The connection between astronomy, historic man, and palaeontology as a whole was absolutely mind opening. It is this reason this channel is one of the best channels on YouTube",
        "Messier 42",
        "Can this thought experiment be replicated?",
        "How can the bounce add more energy than it atarted with?",
        "what are we suffering?? nothing. God help us! Just kidding...",
        "I assume you have seen the article about butterfly wings pinned in the way they are on your wall?",
        "Great & fascinating video. Very well explained by Derek , cosmic nuclear power is another level to that created by ourselves......that's probably a good thing !! Also the historic and environmental  effects of the supernovae very well covered.",
        "Thank you for click baiting me to learn science",
        "Short answer we’re screwed",
        "this is one of the best vids you have ever made.  Very technical, yet easy to understand by even most of my classmates who never even HEARD of a super-nova.\nI'll be pushing this one on friends and family.",
        "Spoiler alert,  the sun does it too, every 12k years",
        "I've seen a supernova, it was very cool.",
        "Wow, a supernova would be 1 billion times brighter than a nuclear bomb to the eyeball.  The experience would transcend brightness, heat, and pain.  If it were even survivable, we don't have a term to describe the sensations one would experience.  How do you describe something brighter than brightness?  Hotter than heat?  More painful than pain?  It would all be so off the charts that it'd be like asking someone to first try to lift the Empire State Building, and then trying to lift the Burj Kalifa, and asking them which one feels heavier.  They would both feel infinitely, impossibly heavy, so there would be no way to discern their weight.",
        "I believe he is the only one who never disappoint us with his content️",
        "I’ve never been a genius but you just make these videos very simple and easy to understand, I love it ",
        "I wonder if there are civilizations who actually harvest that immense energy.",
        "I think this is the first youtube video I've seen with an extensive references/bibliography of scientific papers in the description :)",
        "dude just watched kurzegezact and came here a great vid brother",
        "That Crab Nebula... it's shockwave going to hit us?",
        "You make it sound like we know. But why do you use computer graphics as evidence?",
        "You guys need to watch the Suspicious Observers channel to get the real news.",
        "Live by the exploding star, die by the exploding star",
        "Nice and informative video. Thanks 🫶",
        "3:50 Why would Neon fuse into Oxygen when Neon is the heavier element?",
        "I’m waiting for the “God created the universe”comments lol",
        "Keplar was so smart he wrote in Latin",
        "Missed the Betelgeuse case a bit...",
        "Showing Supernova as a Villain in whole video and then telling He is actually a Antihero is Awesome",
        "I thought Suzuki A Star exploded somewhere, OMG such relief.",
        "My guess? We would die.",
        "Thanks for anxiety! xD",
        "You do such a fantastic job of going in-depth, explaining well and keeping it simple and fun! Loved it, thank you!",
        "Actually, the fact that the area surrounding our galaxy has a density the equivalent of 1/1000 of normal hydrogen density could possibly be another Fermi Paradox theory. Think about it, if the environment surrounding our galaxy has a density that is 1000 times lighter than normal then that would also suggest that it would be an environment that is also less energetic and therefore more stable and thus potentially more conducive to life in general. If true then it might also make it easier to find life out in the cosmos by searching for galaxies in areas of relatively low hydrogen density.",
        "What happens if there's a moon in the sky, like a big pizza pie? That's amore!",
        "I love these astronomy videos!\nPlease keep making more",
        "I don’t know how but you were basically in sync with Kurtzgesagt. Why was it?",
        "I love that in astrology people call a 10 million year old evemt \"recent\"",
        "Please, make vedio on Twin paradox",
        "6:32 sorry can we just take a moment to appreciate just how massive this number is...? 10^58 -- the number of ATOMS in the universe is 10^82!!!\n(Remember atoms are made up of particles) So PER STAR in this state, it is emitting over half as many neutrinos as there are ATOMS IN THE UNIVERSE. Just think about that for a second. Holy crap.",
        "simple, we die",
        "ha ha funny theory to explore",
        "Beings are creating these solar systems and galaxies no other logical reason exists for so many stars? We are meant to understand this process, once our minds unblock negative thinking, I believe.",
        "Since Neutrinos arrive before the light, assuming they are an exact speed from one another, could you calculate the exact distance of that star \nby such?",
        "Thank you ️",
        "17:38\nThe Universe Giveth and the Universe Taketh!!",
        "how did iron 60 end up on earth if the supernova explosion was quite far away?",
        "where is a star's fuel exactly",
        "Its really cool to think about:\n\nIron is made inside stars, specifically red super-giants. The elements form together inside a star during fusion. When the supernova occurs, the iron fragments are blasted into the space. This is how Iron came to Earth millions of years ago. All the iron we use and mine today were once part of a star.",
        "you meen the SUN ? thats a star....has happend before ....but we are still here",
        "200,000,000° I wonder why that is such a even number our degrees based on that?",
        "So.. stars are like giant balloons that eventually pop",
        "First time somebody told me that black holes don't create supernova.",
        "I love when he says :\" Well this might not be the case\".",
        "The fact that we as stardust have evolved to figure this stuff out is completely mind boggling",
        "12:47 Actinobacteria were here at that time.",
        "Love how your mod creators are so talented",
        "Some of this is true.",
        "I think one of my favorite stats from xkcd is that supernovae are so absurdly massive that even the neutrinos from one could kill you.",
        "We frigging die",
        "What about a major solar flare?",
        "That was cool! And a bit scary. Great work, enjoyed this!",
        "The short version: we all die.\nThe long version: we all die.",
        "Then we watch less movies. Sunglasses might serve well for such an event",
        "The level of detail makes Supernovae far more horrifying than a garden variety space rock. Time for some new Sci-fi supernova based genre. The last one I remember seeing with a dying star problem was Starblazers. it's been a minute.",
        "We know a lot more about space than we do our own waters on earth.",
        "It goes boom.",
        "Kepler's supernova couldn't be 'about as bright as Jupiter' if it cast a shadow. That's closer to the Moon in brightness.",
        "7:36 wait so neutrinos travels faster than light????? (I am not very scientifically fluent so please don’t yell at me )",
        "Man! This one solved all my curiosities about supernovae.Straight to the point and I can clearly understand what you want to explain in this content.Thanks mate!",
        "Kelvin is not measured in degrees. 200 million K is just that; 200 million Kelvin. NOT degrees.",
        "Iron:  The Star-Killer <3",
        "Guys its chandra shake her, not chandra she car!",
        "Cool story bro.",
        "Carl Sagan would be proud.",
        "Electro magnetic radiation is 1/10000 of total energy, amazing!!!",
        "Krass... ",
        "Wait why does Fe 60 go to Co 60 also it’s more massive?",
        "17:45 don't we owe most precious metals to supernovae too? silver, gold, lead, mercury, uranium, zinc, tin. These are so important in our culture, technology and civilization. It's a good reminder that Earth is not a closed system, which highlights the importance of space science.",
        "Congrats Regis!!! You did so well this tournament! :-O",
        "The earth has a magnetic field that fluctuates and protects us from incoming radiation, does your model of effects here take that into account?",
        "I think we would just die",
        "That picture of tha abomb in front of a human was terrifying",
        "i'm not sure anything really would, that is assuming that space and stars are real. not sure that we are not living in a simulation where deja vu and Mandela effect are a glitch in the code.",
        "All these ways life could get wiped out really just show that life existing in the first place was the anomaly",
        "Zoom Zoom Zoom\nYou make my  go Boom Boom \nMy SuPeRnOvA  girl",
        "Recent nearby supernova explosion hmmmm. The words don't make sense to my brain( recent for literally 2.4 mil. Yrs and recent for 150 light years)",
        "I still think that, star explosion is not as bright as discord light theme",
        "Goddamn dude that was so informative. Would have been awesome to have your night shift at that observatory!",
        "\"lemme melon my way down\"\nDirty mind has joined your and my brain",
        "Well I'm thinking it's not going to be a good day........",
        "With all these extinction events it sort of makes me think we could actually be alone in the universe",
        "9:38 that drawing looked nothing like an 11th Century Chinese astronomer!  That looked like an enlisted man of the 101st Airborne!",
        "Summed up two entire chapters of my Astronomy class in 20 minutes",
        "0:37 still not as bright as discord light mode",
        "The Neutrino Bomb is a powerful bomb invented by Rick Sanchez that could potentially wipe out all life on Earth and other planets....shum-shum-schlippety-dop!",
        "And here i thought this was going to be some kind of Short.. boy was I wrong ::)",
        "\"If you held up a hydrogen bomb right to your eyeball and detonated it, that explosion would still be a billion times less bright than watching the Sun go supernova from Earth.\" - LET THAT SINK IN!!!",
        "Next video. What happens when a supernova explodes next to a black hole?",
        "We die. Video over.",
        "Very interesting, thank you.",
        "the supernova of the chinese saw, was not just 1000 years ago it exploded, but 7500, since the star was 6500 lightyears away, it must mean that it blew up 6500 years before they could see it ;)",
        "If neutrinos arrive at earth before the photons, have they traveled faster than the speed of light? And as they give you advanced notice, they have also transferred information faster than the speed of light no?",
        "INTERNET PSEUDO SCIENCE NONSENSE ???\nWhat star(s) close to the Earth, there are NONE but our own. The supposed next nearest star is actually a group of 3 stars around 2-3 light years away. The problem of Super Novae, is also a highly controversial problem relating to what actually causes this to happen, and what in many cases actually happens !!!",
        "are you sure the sun is not gonna explode?",
        "Neutrinos sounds like a healthy snack",
        "I’m just gonna pretend like I understood everything.",
        "Just amazing",
        "So... The Fermy Paradox is no longer a Paradox...",
        "Well, it may not happen in my lifetime, but I will come to peace if a world ending scenario will happen to earth. With this knowledge in hand, every day is a blessing and I won't take anything for granted any longer.",
        "Where is the evidence of photons ?i have never seen a photon in real life .And have scientists been inside a star to know what’s going on ?No they haven’t it’s pure baseless hypothesis .",
        "Stars are electric, they have a filamentary web of Birkeland currents interconnecting them.",
        "I thought that the creation of a black hole does happen along with a supernova? Am I mistaken? I am legitimately curious.",
        "Hi mate, you mentioned that you used to work to detect neutrinos. But how do they get detected if they barely interact with any matter? A bit confused and curious about the engineering being the detector",
        "amazing stuff serious;y cool",
        "My theory about why a supernova is so bright... Many may not be aware that the vast majority of photons in a star are trapped there by all the mass there. It can take years before these photons can escape. Now imagine that suddenly all this mass is ejected; the photons that were being trapped by this mass also escapes. Years of photons being released all at once.",
        "bunk!",
        "I like how his smiling face looks like against an exploding star ",
        "The neutrino doesn’t bother anybody but if you mess with it. SUPERNOVA!!",
        "What does \"near\" mean? What kind if star are we talking about and where are we located regarding its rotational axis. \nThe difference is between \"we won't notice it\" and the end of all life on earth.",
        "We die, next question",
        "This could be a leap in the wrong direction, I wonder if during that unique radioactive bombardment of 60Fe the DNA of Australopithecus was mutated which caused the evolution to Homo Erectus?  Anthropology as a history is not my area of expertise. Though I am a healthcare professional, genetic medicine is not my area either.",
        "Epic Video, thank you sir",
        "How do we know this? Baffles me how far we've come as a species ",
        "Great Video, As a fellow scientist thanks you for explaining difficult concepts in a way the common person can understand. You never disappoint Veritasium keep up the great",
        "short answer, we ded",
        "Now I’m about to look for a video on who discovered neutrinos and how? ",
        "Small mistake Derek at 5:07 you talk about protons in the iron nucleus absorbs electrons. But in the video you show Helium. But its extremely well explained nevertheless.",
        "Anyone who sticks their big grinning face in the pic.............for me it's a sign of low quality.",
        "hey Proxima Centauri, how you been doing lately?   ",
        "Hey you didn't describe how an exploding star would destroy the modern world. I feel cheated.",
        "14:56 maybe just maybe we evolved from mutations that supernova with its radiation produced.",
        "Thanks, i can't sleep now.",
        "Kurzgesaght",
        "Dope",
        "if a star suddenly appeared 10 light minutes from earth (opposite the sun) we and every other planet located between them would burst into flames and start sharing the orbit of the NEW SUN. every other planet would burst into flames when they pass between the stars as well. No explosion necessary !",
        "So...I've always heard the moment a star begins making iron it dies (or at least starts to die) and I've wondered where the denser heavier elements come from.  This video at least partially explained that, though I would have liked to have had a bit more in-depth explanation.  As a corollary to that, I've also wondered if all the heavier elements on or near the surface of Terra come from star matter deposited after Terra's formation.  It seems like if they were present during the \"hot\" phase, they would have sunk through the magma down to the core.  ",
        "The existential crisis I had after hearing all these numbers ",
        "What Happens If A Star Explodes Near The Earth?\nDOES  NOT  MATTER ...\nbecause you're already dead when that happens.",
        "How do the elements accrete I wonder....Like youre always finding \"nuggets\", or \"veins\" of certain elements...did they form into chunks during the Super Nova explosions, then rained down on us as lumps?...Or do they have a magnetic attraction to themselves on a molecular level and kinda \"found\" each other here?",
        "Alpharad: Alright Nuzlocke might be starting to go well\nBianca: I AM THE STORM THAT IS APPRROOOOACHING",
        "Let's get Krew and KF to 10M! They deserve that diamond play button!",
        "Last year, I almost joined the Brian fields research group after listening to his presentation on this topic. He talked about how they had to look through sediment samples to find traces of Fe-60. I thought it was so cool that we could learn so much about the history of our cosmic neighbourhood just by observing earth. It's amazing to see this topic explained so well.",
        "kurzgesagt did it a bit better",
        "I explode near earth 5 times a week:]",
        "New Fear Unlocked",
        "I wonder how many generations it will take before astronomers can confidently say what was the cause of the local bubble. Meaning, what was the source or sources.",
        "9:10 Stupid birds. \nTime for a UFO report.",
        "I like to speculate that stars are filled with charged particles, the charged particles produce electric fields that hold the star rigidly. The equalization of the charged particles reduces the electric field (that's maintaining the star's structure), and the star erupts and rips itself apart.",
        "It blinds all of the boomers",
        "Very nice video, just one small thing - neon can't fuse into oxygen, as it is heavier. Rather both oxygen and neon are products of carbon fusion.",
        "Fake",
        "Black holes aren't made when a giant star explodes ?   Pretty sure type A supernova leave behind black holes",
        "It's been quite a while since I was out what the hell happened to his boldy head",
        "14:11 muon catalyzed fusion power plants are a topic of research. Imagine if we came to rely on them for space travel andstray muons from a supernova could cause your spaceship to breakdown in deep space.",
        "How can neutrinos move faster than light? That doesn't make sense. Does that mean that Einstein's Theory of Relativity needs to change or is there something else to it?",
        "sir make an interesting video on 1st generation star out of which our solar system was born, may be it was a supernova",
        "omgosh I enjoyed this tube.  My Chemistry/Physics/Astronomy genes just tingled.  ThankYou!",
        "How do Fe60 from 150 light year supernova ended up getting on earth in just 2.5 M years..???",
        "Brilliant Derek, as usual! ",
        "TL:DW - we're royally fucked?",
        "\"We are made of star stuff\" - Neil deGrasse Tyson",
        "So nutron is type of student in class who always quite but the most amazing guy  i try to relate",
        "So our live existence is the same Motto as the \"Chicken  or the egg \" Motto! ",
        "I have no idea. Neither do you. Big words are just that. Big. Like your imagination of what would happen.",
        "Imagine the amount of effort they put to publish this amazing video ",
        "It will take a \"light year\" of led? Are you high?",
        "How do they know animals at more shallow waters were more likely to become extinct than ones in deep water?\n\nJust based off the fact that we know how they muons react? Or based onthe fossil record.....? I'm sure it's much easier to find fossils in shallow water since the fact that we haven't done much of any study (comparatively) in really deep waters.",
        "Once again, a brilliant video that takes a VERY complex topic and simplifies it to the point of being eminently understandable. There is, however, one aspect I've never quite understood--and that is how we KNOW how much a particular sample of a radioactive material has actually decayed into its next level of radioactivity. Obviously, not every radioactive bit of material started decaying at the same exact time (or did it?), so what reference point is used for determining how much a particular sample has decayed? I know this is an important part of determining the \"age\" of many things (such as an ancient papyri found in an Egyptian tomb or coal formed by decaying trees or even when a clay pot was made that was found near a skeleton believed to be X years old). I think a video explaining that whole process would be quite informative.",
        "Uh... What do you think happens?! Jesus...",
        "I don't understand why it stops at iron just because going further requires energy. There'es PLENTY OF ENERGY!!!",
        "Can someone send this to stopoil and let them know that If It's going to happen there's no point In sitting on the M25 stopping me getting home to my bunker",
        "How would they know the sun won't explode anytime..?",
        "We're not that old ",
        "Cool fact about the crab nebula: there's a timelapse from the 50's where you can see it expand.",
        "Deep fried everything",
        "Without watching the video I bet something really bad would happen.",
        "we are all star dust. the iron in our blood cells comes from stars. this is no metaphoric fairey tale, this is science.",
        "17:55 so you're saying that supernova could possibly be our god?",
        "Him trying to jump on Charlie and his girlfriend is such a low blow. Its the equivalent of physically biting someones ankle while theyre teasing your friend. Way to go Sneako, Im sure you feel like a very important man right now.",
        "I think it would be a great follow up video to explain how these explosions would have helped the creation of the solar system.",
        "This might be your best one yet. I did great in all my physics classes and it's still tough to comprehend these amounts of energy.",
        "As if I could imagine an H-bomb blowing in front of my eye",
        "Do they have a light year of lead at neutrino observatories?",
        " obviously everything would anihilate.... Fb",
        "Twinkle twinkle little star",
        "I've watched various videos here on YouTube on this topic but I must say this one is probably the best, due to its clear explanation, good graphics and pleasant narration.",
        "I love this channel",
        "Whenever I watch an almost 20 minute long Veritasium video, I never lose interest throughout the video and it's consistently gets my attention. The pacing of him talking quickly and pausing to make a transition makes it easier to retain the information. Also his voice is very clear and comprehensible. As always amazing stuff Veritasium, you never fail to get my attention.",
        "Is it a star or a (class) A star :]]",
        "Small addendum regarding the name Supernova that you mention (1:20):\nKepler's teacher and mentor, Tycho Brahe, was the first to publish a book concerning a new star (stella nova), namely SN1572 or \"Tycho's Supernova\", which appeared 32 years earlier (TWO visible supernovae in a lifetime and NONE since!)",
        "What is Chef GIno doing in a science video?",
        "Ok, but when the sun goes supernova will the earth even be here anymore?  Will the expansion during the red giant phase make it large enough to engulf Earth's orbit?  \n\nAnd there are also Coronal Mass ejections and the polar inversion of the sun coming up in 2025 which has the potential to wipe out all EM on earth with a direct hit.",
        "i wish i was smart enough to keep up... awesome video regardless",
        "I have a flat tire. Can I still drive as if I have no flat tire?  Is it safe?   When I loose control of my car and plow into a family of eight killing four of them\" what would that look like?\" Assinine.",
        "Crazy how puny humans think they know wtf is in a star",
        "I was familiar with most of the topics you've covered, but you did a fantastic job of making everything clear and concise. Re-subbing. Just don't go down those same ideological extremist paths you went down in the past and I'll stick with your channel.",
        "Please explain how carbon comes before neon.. I’m sure it makes sense but it’s counter intuitive if you’re not a gravity/nuclear physicist. I understand how nuclear reactions work but not how pressure can turn carbon into neon. That woosh.",
        "I have always liked this channels content, but... Who else is creeped out by them eyes!",
        "5.08 proton becomes neutrons, will absorbed electrons also become neutrons?",
        "Wait wait wait. Iron is the most stable element in the star? Stable in what sense? Stable in that it doesn’t fuse? Is it actually the most stable in general?",
        "The sun does a micronova every 12,000 years. Have fun with that :D",
        "The nearest star is Alpha Centari, 25 thousand light years away! We're never going to get there, first we would have to get past the firmament!",
        "Is not God's mastery of the universe amazing? how he created all the science that you guys are studying and being amazed by..... makes you wonder why he chose to create us in the first place.",
        "I have a question- What is going to decide whether a dying star will become a neutron star or a black hole?",
        "You know, in basic terms, if a star exploded close to Earth we'd all be fooked.",
        "We die.\nNext question?",
        "Gentleman, what a masterpiece.\nI'm surprised I've never seen information about stars like this before, especially considering a watch a whole bunch of astronomy videos. I'm really surprised and amazed. Thanks ",
        "If it's white, it's white, so how can anything be brighter than bright?  If a nuclear bomb exploded, how can it be less brighter than the explosion of the sun? Surely on numbers it probably detects brightness highly, but for a human eye there's nothing brighter than a white screen.",
        "Very little. Probably about the equivalent of a minor solar flare. The closest star is too far away to matter given the distance from the star determines the concentration of expulsion that would come into contact with Earth. Granted, there's some chance it could send some rather large objects our way, but they probably wouldn't reach us for quite a long time after we were able to visually identify the supernova from Earth. So like 500 years +",
        "New anxiety incoming...",
        "I would be happy.",
        "Thumbnail dude just smiling in the face of destruction ",
        "How could u possibly know the sun will burn for another 5 billion years. What rubbish.",
        "Thank you for your hard work it was clear !",
        "I've seen plenty of stars explode! I live in California! Exploding stars are a common occurrence here. Some of them just keep on exploding over & over. Just look at Lindsay Lohan!   (Sorry Lindsay!  Because you know she might read this...)",
        "I don’t wanna sound dumb but iron as in the kind that’s in our blood? You said it ends and begins with iron so one could say it begins with blood ends with blood far stretch but sounded cool in my head",
        "Derek, truly and sincerely thank you for this content. I really appreciate having so much scientific knowledge delivered in such a comprehensible way.",
        "So hate to be \"that guy\" but talking about gravity being a \"force\" contradicts your other video you put out almost 3 years ago stating that gravity is not a force. So which one is it?",
        "So we are basically star dust ",
        "so very good ty",
        "What Happens If A Star Explodes Near The Earth? Instant death",
        "Looking at this title, regardless of the details, there is one inescapable fact. What happens if a star explodes near the earth? Well we're completely screwed",
        "This whole video be like :- you're going to die by a trillion stars but I don't know when \nBtw it's amazing",
        "Elon's new mission should be to get us to several planets all many light years apart so all life is not destroyed in one super nova.",
        "Seeing what happened with Brok hit me hard, but seeing Sindri's grief hit me harder. Poor guy. All he had and wanted was to be with his brother and now he won't even be able to do that in an afterlife. I can't stop crying, I feel so bad for him.",
        "Best explanation of supernova formation I've ever seen, that was super cool!",
        "A minor error : at 8:21.  While some very massive stars can theoretically go straight to being a black hole when they collapse most Black holes are thought to be the result of core collapse supernovae in stars that are too massive for the remnant to be a neutron star.  This is when the remnant is so massive that neutron degeneracy pressure (and even quark degeneracy pressure) are overcome.",
        "It would of been good if you explained what would happen if Earth's second closest star went supernova",
        "I would be fine with you being wrong on many fronts. I do appreciate your videos though. I normally learn a lot",
        "Isn't it so weird that the humble explosion is the creator and destroyer of all things including the universe itself",
        "The amount of ads this video had approached the Chandrasekhar Limit :/",
        "Really nice video. Thanks",
        "Superman would get really really juiced up and go kick some Darkside butt cause he’s mad cause Lois died when the sun blew up and all. He doesn’t like it when Lois dies.",
        "It's fun to think that without neutrinos the universe would definitely be void of life since the elements inside the stars would have not exploded out in the super nova and made the planets etc.",
        "How come you and kurzgesagt make a video about the same topic at the same time? Not hating just curious if there is some logical explanation or mere chance :)",
        "I wonder the efficiency of supernovae when it comes to converting matter into energy. Different classifications for different types, but interesting data nonetheless.",
        "Could neutrinos explain dark matter?",
        "So the explosions are the gods!?!?",
        "As ussual, your videos and info are mindblowing. Never stop amaze us!",
        "By the numbers presented in the video, it means that a supernova happens every second in the observable unviverse?",
        "Short answer: we die",
        "Question: Do \"genius\" flat earthers, in the likes of Grand Orion Master Kyrie Erving believe also that the moon and the Sun are flat?\nI would love to ask one of these \"specimen\" of people myself out of curiosity and for personal entertainment but as far as I know, I know nobody \"that smart\".",
        "No one will be alive to observe such situations.",
        "who cares?",
        "As usual incredibly interesting. Veritasium is by far my favorite foreign channel",
        "What if we go into an interesting little hole   at the  antarctica there most likely an avabded city there inside the earth",
        "this is all speculative.",
        "So basically we all become the hulk?",
        "i jump out of the tree and karate kick the star in the name of jesus",
        "Cool. I had a dream a while ago about two stars colliding and the solar system being destroyed from the explosion so this is extra interesting.",
        "As usual another amazing video. Thanks for making me feel smart while learning about this cool content",
        "amazing video",
        "Forget dope duper nova ,i know casanova",
        "interesting that this video is made right while we're in the beginning of a micronova event",
        "Spoiler: we die",
        "So I have a question. You talk about things destroying or damaging the ozone layer but nobody ever talks about where it comes from... WHAT PRODUCES THE OZONE IN THE FIRST PLACE?\nedit: Second question: Wouldn't the hypernovae be most dangerous only in the direction of the beam of energy off the rotational poles and not nearly so noticeable if it was pointed away from us. If the beam was pointed at a 90 degree angle to the direction of Earth, would we even detect it, that one that was 2.5 billion light years away?",
        "Short answer? Earth is no more.",
        "You just had to click bait us.",
        "this is a nonsense question isn't it  ?\nstraight off he says  \"if the sun was 8 times larger\"......... er, well, its not",
        "I'm just curious if Dr. Becky Smethurst was consulted in developing the background material for this episode.  Really good stuff!  Huge \"thumbs up\" to Veritasium for this one.",
        "Within a week!",
        "Thank for a video that made me think 'how many unbelievable things are going on in this universe and around us ' \nBy the way which college did you study and where you did supernova monitoring?",
        "Finally! My hours of watching @kurzgesagt videos were useful to understand 1 Veritasium video!",
        "I love the way scientists use the word \"recent\". Seriously though this explanation was so engaging. I wish science at school was this inspiring.",
        "The illustrations in this video are amazing. Very very well done job on this video.",
        "The Arabic record shown says a supernova occurred in 397 Hijri, around 1007AD. it started dark then increased in intensity and the shine varied between bright and dark until it eventually faded",
        "So dying stars begets…dying stars? If supernovas create nebulas, which are the birth place of stars.",
        "This was tremendously well done - a great return after some very click-bait videos in the last year.",
        "nice! does the old video of ways humanity could be destroyed need to be updated with supernovae?",
        ":Our star has \"nova level outbursts\" every 12 000 or so years.\n:We are about to have another one.\n:That's why everyone is starting act more and more crazy.\n:As the magnetic field continues to collapse, the combination of cosmic rays and violet light are well, for a lack of a better word, overwhelming.",
        "Why the heck treat theories like truth?",
        "We would all die",
        "Really appreciate excellent videos like this one which explain for us laymen in terms we can understand the immense complexity of the universe which so many great minds have toiled for centuries to uncover. In this era of insane disinformation, this shines a brilliant light on truth. A million thanks!",
        "18:04 its ironic to hear Veritasium say without explosions of stars we wouldn't exist today, outstanding work on the video",
        "Facinating video as always, Derek. \nCould you please make a video in the future explaining the creation of heavier elements (r- process, s- process and p- process)?\nIt blows my mind to think of the extreme conditions required to create them. Makes me appreciate them that much more.",
        "I would love to see this happening right before my eyes. Crazy but it's fascinating!",
        "Good to know that!  Lol!",
        "We're all gonna die",
        "ρ尺ｏΜ𝐎ᔕᗰ ",
        "I knew all of this... I played Outer Wilds.",
        "The nutrinos would kill everything before the star blew up",
        "Ive had this vivid dream a few weeks ago about this!!  It put an agonizing dread within me. Something much more aweful than my own death. I was running through the halls of this grand school with window to ceiling windows to my right. 3 floor tall windows. It was night time, i was in the city wouldnt be able to see stars, but the beauty that was in slo mo ripple of blues and whites high abouv the sky against black nothing. My heart hurt so much when i woke up.",
        "I see you bested Kurzgesagt of about a week :)",
        "Sorry but this one was boring.",
        "Ur videos just... makes me so comfortable. They give me peace. Theyre so good",
        "lol how not hate war if  humans  only grow if we compete and now the only thing on earth to compete is ourselves",
        "4:08 why does not carbon nake diamond if their us Nessary amount of pressure and heat",
        "kurzgesagt made a similar video lol",
        "SuperNovas gave us life and it takeith away...",
        "do neutrinos bombs exist?",
        "You're amazing!",
        "Isn’t this the most straight forward and obvious question ever? I’m pretty sure that most people who heard this question would just assume it was rhetorical ️",
        "It happens every 12068 years like clockwork apparently to our own host star/",
        "I love how you stole this idea from gerzagaght or however you spell its YouTube video the other day",
        "YouTube has been trying to make me watch this for over a week now",
        "If you wanted click bait it should be titled \"Live  supernova explosion event eminent\"",
        "  Interesting. But when the US becomes a theocracy ruled by the Orange Jesus, we go back to thinking God created the universe a few thousand years ago.",
        "17:54 \"I brought you into existence and I can take you out of existence!\" ~daddy star explosion",
        "Nunca había visto una animación tan intuitiva y detallada de lo que sucede en las estrellas al momento de su explosión. ¡Fue grandioso! Gracias. ",
        "You guys are going to see a demonstration in half an hour!",
        "So are all the elements heavier than iron created in supernova explosions?  Do these supernova sometime rip apart heavier atoms like iron, into lighter elements?  Is there any rhyme or reason to how much of each element exists in our universe?",
        "hate the title, loved the video :)",
        "Chandrashekar limit.... Indian science text books will never teach about it... Or the Raman effect!",
        "What will happen? People will take selfies with supernova!  ",
        "you're terrible in clickbait ....",
        "i  cant even watch... what a dumb question.  like duh it doesnt take a genius to figure this one out",
        "Crazy. Why do supernovas happen in such a short time? 6 months? Don't you think there is a time dilation in there somewhere? It makes no time sense.",
        "Isn't the speed of light in constant deceleration? How can we use it for dating or as a reference for anything?",
        "I really like the artwork and new-ish animation style you’ve added to the channel.",
        "I always asked why we were in a place called the local bubble and Derek just answered my life long question",
        "Don't care",
        "I'm taking 90% of the credit for this video. You're welcome.",
        "The Universe gives, The Universe takes away.",
        "All I can say we still alive is just a miracle.",
        "I hope you pay someone to do the animations in your videos.  I would like to read the request emails.  \n\"Hello Mike.  How are the kids?  Could you animate a man putting his eye on a hydrogen bomb this week for me?\"",
        "We die?",
        "Incredible video. Very clearly explained and easy to follow for quite a complex subject. Great job!",
        "15:15 - I've been trying to explain this to people for so long....",
        "It's crazy to think something so astronomically far away can literally burn our skin on earth during hot days.",
        "Geez, this was a great video!",
        "Great video! Your videos always inspire me to explore our universe. Keep up the great work!",
        "How the F do these nerds DARE say what the lifespan of the sun is…",
        "So something that's only made up of .01% light is a billion times brighter than a point blank hydrogen bomb?? That's wild!",
        "I just discovered this channel. What an amazing video. (And I thought I knew all about supernovas and how elements are made inside of stars!)",
        "Thank you everyone who donated, so glad to be apart of this community, so glad I was able to see the stream and donate what money I had",
        "Absolutely epic video Derek! Anything cosmological is always gonna hit the soft spot for an astrophysicist like me ;)",
        "Hey Kurzgesagt is one supposed to be causing existential crises, haha, great video, thanks for all the work you do!",
        "Missed opportunity for collab with Kurzgesagt!",
        "I never really understood what actually causes the explosion. No one else who explains supernova talks about neutrinos. They simply say when iron accumulates in the core the star explodes. Thank you for the extremely clear explanation.",
        "The Crab Nebula story was amazing. It's so easy to look up think of the night sky as static, but the entire universe is all moving faster than I can even comprehend.",
        "What proof do they have, A star is billions of miles away so how can they know what makes up a star and how it works ???",
        "That is really insanely powerful but there is only so much light our eyes can take",
        "Notch took inspiration from stars for his creepers",
        "So bright that it would cast a shadow at night?! All the humans on earth must have truly wondered, what the heck that was.",
        "imagine living on a planet around Betelgeuse, and then you hear physicists speculating about your Sun going to explode soon.",
        "Gamma ray bursts are basically life remover at galaxies range... Hardcore...",
        "Well, this is undoubtedly one of the best explanations about how stars and supernovas work I've ever seen. Science is one of those areas of life in which, just as soon as we think we understand a thing, we find out more about it--or in some cases relearn what we thought we knew. Thank goodness for the guide who takes us along on that journey and is just as fascinated along the way as we are (I'm talking about you, Comrade Derek).",
        "Dear Veritasium \nAt 8;22 you say that stars big enough to constrict to black holes do not produce a supernova explosion.\nand  at   16;08 - 16;25 you say that powerful  hypernova explosions in stars with more than 30 sm, produces black holes.",
        "You have a very bad day...",
        "I didn't know light can exert pressure if bright enough. That's insane.",
        "Kepler (c. 1600) was not listening to Vivaldi's 4 seasons (c. 1720).\n\nGo ahead and call me a pedant, but ffs, it's like saying Hitler was a fan of Beyonce.",
        "7:48 That's considerate of stars to give us time to see them die",
        "Given the vastness of spacetime in our universe, it is so amazing to have such a violent type of event that occurs in a short enough time scale comparable to a human lifetime, yet frequent enough that we actually observe a number of them within our short history.",
        "I had no idea that the Crab Nebula was that young. 1000 years is nothing in the grand scheme of things.",
        "I still remember this games beta days of dragging the npcs around the map and blowing up the gas station",
        "There could be time to run\nIt would be fun \nComputer sensation of the millennium",
        "Iron60?  Is that used to make grade 60 rebar?\nIs there Iron40 to make grade 40 rebar?\nGood video I nova lot  more about stars than I did just moments ago!",
        "TLDR: WE ALL DIE",
        "You mean besides being overcooked?",
        "Normal day in ohio",
        "So humanity is a lucky winner against all odds. Do we realise our hasard ?"
    ],
    "comments_disabled": false
}