{"video_id": "evUfG3lrk5U", "comments": ["I've already seen dozens of videos on Youtube about how a Supernova works, but this is another level. A complete and very well illustrated lesson in under 20 minutes. Veritasium never disappoints.", "The connection between astronomy, historic man, and palaeontology as a whole was absolutely mind opening. It is this reason this channel is one of the best channels on YouTube", "I would love to see their storyboard when they were planning to produce this video! The storytelling is superb and the simplification (without compromising) of a complicated topic is impeccable.", "Gentleman, what a masterpiece.\nI'm surprised I've never seen information about stars like this before, especially considering a watch a whole bunch of astronomy videos. I'm really surprised and amazed. Thanks ", "A truly fascinating chain of events clearly explained. I’m sitting here going, “ Wow, I never knew that!” Thanks, Derek.", "Veritasium is one of my favourite channels on YouTube. The explanations are lucid and give the intuitive feel to understand complex ideas. Thanks Derek!", "i’m extremely proud of the way my dad explained supernovae to me when i was about 5. he told me to put my hands out, facing each other, and then he put his hands on mine. he then told me to push outwards, as hard as i can, while he pushed inwards, which made my hands collapse. he said that when a star wasn’t strong enough anymore then gravity won.", "I've seen countless videos and understood partially, but this is the first time I actually understand how and why of a supernova. The amount of simplicity it went to explain this, my salute to Derek for making space and science fun and simpler.", "These videos are great! animations, music, and Derek the narrator, all top-notch quality! thanks for this Derek and the team! I think you have the best quality educational videos on earth!", "I knew most of this stuff because I studied the creation of black holes pretty extensively but it's a joy to watch it explained so well and with such great animations.", "This might be your best one yet. I did great in all my physics classes and it's still tough to comprehend these amounts of energy.", "Clarification: There are stars that go supernova AND form black holes as well. The formation of a black hole doesn't mean that there is no supernova, which is clarified quite late in the video and might lead to quite some misunderstanding in the first place. Still this is another perfect video!", "Whenever I watch an almost 20 minute long Veritasium video, I never lose interest throughout the video and it's consistently gets my attention. The pacing of him talking quickly and pausing to make a transition makes it easier to retain the information. Also his voice is very clear and comprehensible. As always amazing stuff Veritasium, you never fail to get my attention.", "this is one of the best vids you have ever made.  Very technical, yet easy to understand by even most of my classmates who never even HEARD of a super-nova.\nI'll be pushing this one on friends and family.", "Nunca había visto una animación tan intuitiva y detallada de lo que sucede en las estrellas al momento de su explosión. ¡Fue grandioso! Gracias. ", "Very humbling, scary, and fascinating video. I always look forward to what you're going to make next and you never disappoint. Thank you for everything that you do in chewing out knowledge for us normies to be able to understand, truly.", "I can't get enough videos about supernovas. They are just too damn interesting and are some of the most gorgeous events we can witness", "I have always admired your ability to elegantly describe the beauty of the universe. Amazing. You are one of the reasons I'm pursuing a degree in physics.", "This guy has that enthusiasm it’s like he is as amazed as his viewers. Like he’s not teaching or lecturing he is shearing information. I adore everything he does!", "I watch an obscene amount of science youtube, and love supernova videos. I learned a ton from this video. You have done something wonderful here Derek.", "Thank you Veritasium, almost every video you create manages to renew my love of science. Week after week, month after month.", "Well, this is undoubtedly one of the best explanations about how stars and supernovas work I've ever seen. Great job!", "What a wonderful video. So very informative with superb visualisations. Derek, this is really a triumph of explanation about a fascinating topic.", "Great video! Your videos always inspire me to explore our universe. Keep up the great work!", "This is far better than a complete sponsored documentary. This is very inspirational and underrated content!", "Amazing video! One of the best explanations of a Supernova that I was looking for a while now and you happend to make one today! That's why I love this channel. Has an amazing narrative in telling a scientific story and we all love a good story. Unfortunately I was also hoping for a quantum explanation to what happens when a star decides to go the other way and become a black hole. That would have been amazing! Maybe in the near future, I really hooe.", "Derek, truly and sincerely thank you for this content. I really appreciate having so much scientific knowledge delivered in such a comprehensible way.", "I always watch your videos 3x longer then they actually last because I am so amazed by the type and amount of information that I have to pause video every minute and explain to my wife what is happening around us!\nAmazing approach to any theme and superb pot of bouillabaisse of various science fields merged into one fluent one hour video... As I said, it lasts 3 times longer in my universe ;)", "I've watched various videos here on YouTube on this topic but I must say this one is probably the best, due to its clear explanation, good graphics and pleasant narration.", "Im in pure awe  the way you connect different fields to one video is amazing ", "Last year, I almost joined the Brian fields research group after listening to his presentation on this topic. He talked about how they had to look through sediment samples to find traces of Fe-60. I thought it was so cool that we could learn so much about the history of our cosmic neighbourhood just by observing earth. It's amazing to see this topic explained so well.", "This was probably one of the most informative things that I've ever watched on YouTube!  Well done!", "Great video, great content, as always. Keep it flowing ", "Excellent! Cleared up some questions I've always had about supernovae. Thank you so much. The Fe-60 story is absolutely fascinating as well.", "I just discovered this channel. What an amazing video. (And I thought I knew all about supernovas and how elements are made inside of stars!)", "I think one of my favorite stats from xkcd is that supernovae are so absurdly massive that even the neutrinos from one could kill you.", "Ive always found it so incredible that the instant 1 single iron atom is fused....the star becomes dead and cascades into decay. Such a crazy thing to realize that all stars last incredibly long periods of time, yet create just a few elements over their whole lives, right up until they reach Iron, and then create even more elements that are heavier during the explosion", "Thank for a video that made me think 'how many unbelievable things are going on in this universe and around us ' \nBy the way which college did you study and where you did supernova monitoring?", "I just love you videos, sir. I watch them as often as possible and have suggested many friends and friends children to watch your videos.  I really appreciate the way you explain things. Thank you ", "What a fantastic video. Thank you so much for being such a great communicator.", "Small addendum regarding the name Supernova that you mention (1:20):\nKepler's teacher and mentor, Tycho Brahe, was the first to publish a book concerning a new star (stella nova), namely SN1572 or \"Tycho's Supernova\", which appeared 32 years earlier (TWO visible supernovae in a lifetime and NONE since!)", "Brilliant, as always!!   Thanks Derek for crushing it once again. ", "Wow. This is one of your best videos EVER.\n\nYou demystify so much in one video. A video for which the world has been waiting.", "Great video. I remember reading about dying stars many years ago in a nasa article and being fascinated by it.", "This was a great video, one of your better ones. You are a master at delivering your scripts too, well done.", "So far, you've explained the best how a supernova is \"made\" and finally I understood it", "The fact that we as stardust have evolved to figure this stuff out is completely mind boggling", "Two things. It's amazing to think how much we know about something that we can only observe from afar. I'd like to see the process of how scientists came to know so much about our sun. Second, I couldn't help but notice the scientific plug that Marvel did in Avengers: Infinity War when Thor went to forge Stormbreaker with the heart of a dying star. Awesome video!", "I wish all of school had been like this. Now I left wondering how anyone could've ever figured all of this out. Amazing.", "This video is absolutely fabulous. Keep up the good work.", "Astronomy was one of my favorite subjects outside of my major. That was an easy ‘A’ for me, so I know a lot of this information already.", "Great video. Clear, concise and really enjoyable.", "It's crazy to think something so astronomically far away can literally burn our skin on earth during hot days.", "The best explanation of these complex events I have ever seen!!  Wonderful presentation!!!", "If veratasium made weekly videos id pay to watch. THEY ARE SO AWESOME. One of the very best content creators on yt", "It always BLOWS MY MIND to think that we have figured so much of this space stuff out (so much so that we know what kind of supernova that Kepler saw that night)!! Truly boggles my mind every time…", "This is crazy!! Always in you channel, if I read the title of your videos, I'm not that excited to go watch it. But when I do, it's so awesomely fascinating every time!", "I really appreciate the quality of your content. I watch it with my granddaughter and discuss the items you bring up. Thank you", "Watching Veritasium, Vsauce since 2015. What a marvellous side of youtube ..!\nThank you guys for explaining such critical topics in simplified version.", "2 days and only 1.8 mil views? For content like this, you deserve a lot more!", "You have the incredible gift of explaining science. ", "Just the Derek way, I am saving this for further research and study … Incredible Work Sir ", "I didn't know about the neutrino bit acting as an \"early warning\" system for detecting supernovas! That's fascinating!", "love it. on almost every books supernova mechanics are always explained like \"the outer layers fall , hit the neutron star and rebounds\", and I knew in my guts that there had to be another way for the star outer layers to receive that enourmous kinetik energy from somewhere other than just a simple rebound. that didnt feel right in my brain.", "Love your videos man. I'm a regular joe with no notable math or science skills whatsoever but for some reason your explanations makes sense to me. You should get a Nobel prize for educating the masses in all sorts of subjects. Thank you for the various topics over the years and I hope it will be so many more lessons to listen to in the future. ", "Thank you for linking your sources. I‘m currently searching for subject for my scientific work for school (Germany) and I‘m fascinated by your videos and would like to be inspired by some of them. If there wasn‘t the catch, that your older videos have no sources….so thank u xD", "Superb video Derek, you never disappoint.", "I loved learning more about this stuff!! I never knew the details of supernovae! Thank you!!!!", "I've watched hundreds of videos about space, supernovae and etc, but everytime i do, i always learn something new. I don't remember seeing anyone explain that with so much detal like you did!! \nAnd to be honest, you're the first one to explain what is the Sun's core and what happens with it. I always thought that the sun's core would always collapse directly into a tiny ball and become a black hole or a neutron star. But here i see that's not the case everytime it happens. And that's an information that i cannot find easily on internet. I tried to find something similar with some more detail and i couldn't. Thank you once again. ", "Good video, not quite cutting edge (slightly dated), but provides a decent layman's explanation of the processes involved.  Now, please make a video about micronovae and the galactic current sheet, including where we are at in the process right now.", "Love how Veritasium took this topic and really went in depth with different scenarios.\nUnlike other clickbait \"Scientific\" youtube channels out there", "Excellently explained in every way. Bravo! Thank you!", "That was impressive on many levels, thank you Sir.", "This was awesome! So well presented.", "the most mind blowing thing I ever heard as a kid in the 1970s was that we are made of star stuff.  There are particles inside our bodies that once existed in the core of a burning sun.", "I always asked why we were in a place called the local bubble and Derek just answered my life long question", "Great video! I did a degree in physics and astronomy and can say this was a great, easy to understand review of some of our favourite cosmological objects and I really enjoyed you linking some of the supernova events in the past with extinction events on earth :) I didn't know about some of those connections, thanks as always for sharing!", "I was involved in the construction of SNOLAB (having been a Sudbury born and raised, Waterloo educated Engineer) in the mid 1990's, (specifically alignment and fixing of the vessel panels - one of my first post-university jobs). Though I wasn't involved in the subsequent operation or science of the lab, I did follow it through contacts I had made there, as I was then (and now) a real \"Physics Hobbyist\". As an aside, the cleanliness of even the construction environment 7000 ft underground deep inside a dirty mineshaft was quite an incredibly eye opening experience! Keep up the good work!", "This was the best explanation of a supernova. Excellent work", "Does the formation of higher elements inside a star happen only after all the lower elements get fused (due to not enough of heat and pressure present) or both happens simultaneously?", "Do you think that elements as heavy as Moscovium and Oganesson are possible to be made from other very high fusing and decaying supernovas? Just a thought.", "Veritasium is consistently better-written, better-edited, and better-explained than any other YouTube channel I've found yet. I wish more science-oriented channels had standards as high as Veritasium.", "I would like to know more details how people figured this out. With that much space and time they are working on many assumptions like veritasium says we’re not even sure the speed of light is a constant. I still think this is cool!", "I've seen so many documentaries and videos on supernovae ... and I mean a lot. And unsurprisingly, while watching this, I thought to myself... huh... this is explained so much better than ever before.", "With all these extinction events it sort of makes me think we could actually be alone in the universe", "This is very inspirational and underrated content!", "As ussual, your videos and info are mindblowing. Never stop amaze us!", "Derek, this video was simply MONUMENTAL. :) Well done!! Seriously, wow. I've watched your channel for *YEARS*, and I personally believe that this is one of your most profound and awesomely constructed videos yet. I have no idea how you do it. Kudos, and... I certainly wish I could comprehend as much as I've ENJOYED over the years! Almost a decade now, I think, TBH...", "One of your best! Thank you for again explaining how the microcosm and macrocosm concertedly affect Earth from such vast distances.", "I am just impressed, your videos are sooooo gooood.\nI am just in love especially those topics️\nPlease keep up that good work", "The ending with a positive approach makes this video 100 times more satisfying to watch and bind everything together. Thanks Derek", "As a PhD student in a very related field (solar flares), this was a very well informed and thorough video on the subject! Glad I watched it! I've always enjoyed your videos.", "I never really understood what actually causes the explosion. No one else who explains supernova talks about neutrinos. They simply say when iron accumulates in the core the star explodes. Thank you for the extremely clear explanation.", "Given the vastness of spacetime in our universe, it is so amazing to have such a violent type of event that occurs in a short enough time scale comparable to a human lifetime, yet frequent enough that we actually observe a number of them within our short history.", "Probably one of your best videos in my book. Hats off", "We r so lucky and humble to see this channel is still going on as ut was before.", "For those of you wondering, at 1 minute in, where Johannes Keppler (1571-1630) is watching at the night sky, the music that is playing is by Boccherini (1743-1805). That couldn't have been playing in the background - for various other reasons other than it wasn't written yet! Something by John Dowland, who just had \"an album\" out (in print) in that year would have been more appropriate. ", "This has become one of my favorite videos from your channel!", "Its really cool to think about:\n\nIron is made inside stars, specifically red super-giants. The elements form together inside a star during fusion. When the supernova occurs, the iron fragments are blasted into the space. This is how Iron came to Earth millions of years ago. All the iron we use and mine today were once part of a star.", "You do such a fantastic job of going in-depth, explaining well and keeping it simple and fun! Loved it, thank you!"]}