{"video_id": "Fg8T_xuOvPA", "comments": ["The fact that Diggs' one handed catch was the second best catch of the day is insane.", "As a vikings fan this game was the biggest emotional roller coaster ive had in so long. Ive watched that fumble 20 times and my heart still skips a beat.", "This is by the far the game of the year. I don't  think the superbowl would be as exciting as this game. I'm a Seahawks fan but love to see cousins having a great game.", "Throughout this video I was wondering how in the world did the Vikings win this game. That 4th quarter and overtime was insane. Hats off to both teams.", "the fact that patrick peterson has been this good for this long… man he doesn’t get enough praise", "Jefferson had a monster game! What an amazing player.", "The fact that that crazy 4 & 18 catch by Jefferson only marked the BEGINNING of the insanity is incredible.", "Most amazing & exciting game I have EVER seen in my life!  Bills: finesse, execution & speed.  Vikings: all guts and determination. The fact that the Vikings seemed the underdog throughout... makes them them my \"never-say-die\" champs so far this year... and I'm a Patriot's fan. You go Minnesota! You go!", "The final part about it being a heavyweight bout and Minnesota delivering the knockout blow damn near moves me to tears. Such a crazy game. I’m not used to seeing the defense play like this. Not since 2017", "I don't watch too much live football but I was watching this live; absolutely insane, this was definitely the best NFL game I've ever seen.", "I'm a Vikings fan, and the only words to describe this game is \"One hell of a roller coaster.\" I remember in OT when bills were in the redzone and we were up 3 points, I was so pissed. I thought we did all that work for nothing, but as soon as I thought that, Patrick Peterson made the game winning pick. I could not describe how happy I felt. GG Bills fans, very close game.", "I'm no fan of the Vikings, or the Bills for that matter, but seeing Jefferson, Peterson, and even Hunter out there doing what they do best puts a huge smile on my face. Geaux Tigers.", "That commentator was brilliant with this game. His excitement and his calls gave me chills multiple times.", "There is something special about this Vikings team. They don’t blow anyone out and they make every game overly-interesting! But they just keep winning. Credit to the new head coach, Kevin O’Connell. I love this guy! Will they win the Super Bowl? I’d be surprised. But this team has done a LOT of surprising things already.", "As a vikings fan, I'm confused.  The vikings have previously set an expectation for snatching defeat from the jaws of victory, and I just don't know how to process this reversal.  However, I hope it continues.", "Justin Jefferson had the game of his life. What a game man", "One of the best games I’ve seen this year. Jefferson is becoming one of my favorite wrs in the league. I hope to see them in the SB.", "The energy from Joe Davis’ commentary makes this game feel even more epic than it already is.", "I am not a fan of either of these teams but I'll always root for the other team playing buffalo. Lately I've viewed buffalo as basically the golden state warriors of the NFL, previously Kansas city. I was literally shivering my timbers the whole game. Way to go vikings!", "This is by far the best NFL regular season game I’ve seen in the last 3 yrs.", "unbelievable match, brilliant spectacle, it was worth seeing, another great match with bills, just like last season with chefis, unfortunately they lost again, greetings from Poland", "This game was more than just a statement game for the Vikings. It was an instant classic game for football fans everywhere.", "Thank you everyone who donated, so glad to be apart of this community, so glad I was able to see the stream and donate what money I had", "Heartbreaking to say the least  luckily there’s a lot of football left. Still have hope for the Bills", "This is one of best football games I have ever seen. Highly entertaining throughout with an insane finish!", "When there’s 1 minute left in the game, but 5 minutes left in the highlights video, you know it’s about to get bananas", "When Jefferson caught that one-handed 4th & 18 I thought it was the most memorable moment of this season so far, not even 2 minutes later so much chaos had ensued I forgot it even happened. This is probably the single most insane game of football I’ve witnessed live.", "Each team had a season’s worth of highlights in one game.", "wow what a crazy game !! As a Dolphin fan...thank you Vikings !", "Happy for Jefferson he balled-out and answered the call time and time again on the biggest stage he definitely woke the league up with his play keep it up and continue to be great that’s coming from a Brady / bucs fanatic", "game of the year and catch of the year", "A fantastic, neverending battle fought till the last second! Jefferson's catch is the play of the year! Unbelievable...", "와......정말 대단한 경기였습니다. 올해의 경기후보에 손색없습니다. 세상에 바이킹스가 이렇게 잘 하다니...믿어지지가 않지만 현실입니다.", "Diggs' one handed catch was amazing too.  Then there was the touchback that should have been but never called.  This game had everything.", "im 23 years old and I have been a vikes fan the whole time, Ive never had fun like this. Cousins and Jefferson just cant be stopped. And despite being doubtful all seaon after this game I can finally see the VIKES being a superbowl team for the first time in my life. lets get a win for my grandfather who never got to see a win,", "I've been a Viking's for over 40 years. There have been many nail biters and Minnesota usually comes out on the short end of the stick. I have never been more proud of them than I am today!!! I actually had tears in my eyes when they won. The last time that happened was during the Vikings vs. Falcons game, when they LOST!!!!!!!", "After this game I have to say the Vikings are indeed SB contenders. Coming down from 17 and beating the Bills in overtime is insane", "Can’t stop watching replays. Jefferson was unbelievable. Cousins and Kelly, incredible.  Both teams were amazing to watch. Enjoyed every minute of this game.", "Respect both teams can't wait to see them in the playoffs", "Goosebumps !! The commentator made it even more exciting !!", "Damn I'm a twenty year Cowboys fan and this game gave me the chills and made me a Bill's and Vikings fan boy. Haha.", "I could honestly say that this was the best game in the NFL history, I definitely thought I was watching the Super Bowl!!!", "This is why the Vikings are 8-1. They never give up. Hats off to both teams for a great played game.", "Damn, never ever have i had to write a comment here before, cuz I actually don't know much about American football, but this game is probably the next best thing to a world cup final between Messi (Argentina) and Ronaldo (Portugal). I used to think Allen was the next in line after Mahommes, but after this Tug of war, Cousins definitely left a lasting impression to alter the narrative. PS: Ama Chiefs fan, Mahommes is my fav", "Game of the year for sure. Can't see how anything will top this. That was wild.", "Justin Jefferson MVP.  Holy cow.  I cannot believe we won this game.  I am so happy to see Kirk Cousins throwing some incredible darts, Dalvin Cook break out like Adrian Peterson used to do and Justin Jefferson is like Randy Moss 2.0.  Our new tight end Hockinson may have been that last key piece we needed.  I really hope to see Vikings make it to the Superbowl once in my lifetime.  So many tragic losses in NFC Championship games and bad playoff runs.  Now that Packers, Lions and Bears are wayy out of the race and we beat all 3 of them.. This is Vikings year.. Eagles no longer undefeated so we are right up there with them although they are the only team to blow us out all year in game 2.  SKOL Vikings! ", "Not a fan of either team. But that was the best game I’ve seen in years. And I mean that", "When it’s 20 minutes of highlights, you know it’s a thriller ", "What a bloody blast from the past having Lui on, we definitely need to see more of him again!! :[", "Probably the best comeback in history", "The final 15 seconds of this video got me so freaking hyped. I could run through a wall.", "They went to war out there. Respect to both team's ", "By far the game of the year. Jefferson's catches were insane. I swear my heart dropped on that last Vikings TD.", "That was probably the greatest regular season game I’ve ever seen. As a Vikings fan I went through so many emotions watching this game.\n\nThe Jefferson catch and the fumble touchdown with 50 seconds left had me shaking.", "This was a fun game to watch just as a football fan. You kinda felt the game getting away from the Bills at the end. From Diggs nice 1 handed  catch in the air catch to Jefferson’s 1 handed catch in the air with a defender on him was insane. Vikings were some dawgs in this game.", "this game had everything a close score a comeback a interception a W Catch a Sack a Touchdown this was a insane nail biting game", "Cannot wait to see a NFL throwback or Turning Point episode on this game with all its sideline and insights. (if they still do any of that).", "This game is not just a “statement” game. It's an instant classic for football fans everywhere.", "Best game in recent memory. Insanely entertaining.", "As a Vikings fan I can’t tell you how good this feels. I’ve watched us lose so many games like this before.", "どちらのチームも最後まで諦めない気持ちがすごく伝わってきました。\n最高のゲームをありがとう！", "Wow! This is a classic game \nThey both showed up to play\nThe game felt like the NFL again.", "I think Jefferson proves time and time again that he's open even when he's covered. That man is unreal!", "Great game with so many big plays. Epic NFL action. Hope the Vikings can continue this momentum the rest of the season.", "I'm a Patriots fan.  I can't believe what I just saw.  That game was insane.", "As a Bills fan, all I have to say is congratulations and well played, Vikings. You guys deserved this.", "this game was insane on to many levels", "Insane game, been a lifelong vikes fan. That cubs QB risking it in OT was intense though, not sliding like every other QB seems to do. Much respect.", "I cant think of a better game that i've seen. So many ups and downs. So many back and forths. What an insane 4th quarter and overtime", "You always give me new surprises. Im honestly impressed by the time and effort you put into these videos", "When two of the most hard lucked franchises give us an unforgettable game. As a Vikings fan, all I can say is…\n\nYOU LIKE THAT?!?", "All jokes aside this was one hell of a game Justin Jefferson  and Diggs both played their hearts out and both fanbases should not be ashamed of what they saw today. GGs Vikings fans y'all are for real!", "Just imagine if we could get a SuperBowl game this exciting ", "I don't watch too much live football but I was watching this live; absolutely insane, this was definitely the best NFL game I've ever seen.", "Throughout this video I was wondering how in the world did the Vikings win this game. That 4th quarter and overtime was insane. Hats off to both teams.", "As a vikings fan this game was the biggest emotional roller coaster ive had in so long. Ive watched that fumble 20 times and my heart still skips a beat.", "The fact that that crazy 4 & 18 catch by Jefferson only marked the BEGINNING of the insanity is incredible.", "This game was more than just a statement game for the Vikings. It was an instant classic game for football fans everywhere.", "As a vikings fan this game was the biggest emotional roller coaster ive had in so long. Ive watched that fumble 20 times and my heart still skips a beat.", "Throughout this video I was wondering how in the world did the Vikings win this game. That 4th quarter and overtime was insane. Hats off to both teams.", "Fantastic team ,great play calling.", "I’ve been a Vikings fan my entire life. So needless to say, I was on cloud nine! But was that an AWESOME game or what??!! I love a good competitive game!… THAT’S what football is all about!! ", "This game will be talked about for generations. Incredible game!!", "Both teams played hard and fought to the end.  I'm happy the vikings won and Buffalo should hold their heads up high for playing such an intense game.", "It don’t get no better than this I swear I thought it was over for the Vikings that’s absolutely insane how they stopped the bills for that forced fumble in the end zone unbelievable.", "That was one of the greatest football games I’ve ever watched", "I'm a 52 yrs old eagle fan but man , after this Game i don't Even care my eagles lost , i witnessed problably the best game of My life so far !! ️️ LUV'S Y'ALL !!", "My two favorite teams, faced off and it was LEGENDARY, cant wait to watch this video  years later", "As a Vikings fan my heart cant take this anymore, but a win is a win! Amazing game by both teams. 100% Game of the year", "One of the best things I’ve seen as a Vikings fan since the Minneapolis miracle", "What a heart breaker for Buffalo. But proof that you never give up", "My day is always made whenever these vids are posted. Great job, keep up the good work!", "Well the Bills fans faces at the end of the game was priceless", "Justin Jefferson & cook were so clutch that game  gave that team the confidence to make that come back. Can’t forget about Patrick Peterson also that man is a different breed", "It's so much easier not being a fan of either team. Being able to sit back and appreciate an amazing back and forth game is great. Seeing those Buffalo fans after that INT to end the game felt like a second hand gut punch, and I'm a Patriots fan.", "Dalvin Cook’s run gotta be the most underrated play this game.  There is no way the Vikings have any momentum if not for him.", "Man I saw some crazy passes and catches in this game. What a game!", "It's insane that they didn't review the Gabe Davis play. I'm glad the Vikings won, that would have been horrible otherwise.", "Amazing game… JJ is also the best WR in the league right now!", "After JJ’s crazy catches it felt like the Vikings were meant to win with a TD on that last drive but they came up short on 4th & goal but the football Gods made it right with that fumble - Touchdown at the goal line to give them the lead  nutty stuff ,, absolutely insane game."]}