{
    "video_id": "Fg8T_xuOvPA",
    "comments": [
        ":50 jj was doing a tiktok dance and the commentators thought he hurt his hammy ",
        "YOU SEE! YOU SEE THIS GAME!! THIS IS WHY I WATCH FOOTBALL! WHAT GAME AND WHAT A RIDE! (I just lost my voice...)",
        "What was the play caller thinking for buffalo",
        "Smells funny to me",
        "Heartbreaking to say the least  luckily there’s a lot of football left. Still have hope for the Bills",
        "That 4th and 18 catch by Jefferson will go on my tombstone. Bruh ..",
        "i genuinely havent seen a game this good since bills vs chiefs last year in the divisional round",
        "Fantastic game. Great effort on both sides. What come back by the Vikings. Sad the Bills came up a touch short.",
        "30:48 Lets just take a minute to appreciate how much time and work she put into these videos?\nIt's unbelievable, and I think they deserve a lot more than that 8) =(",
        "I don't know about yall but I enjoyed the commentators.",
        "This game was more exciting than the previous super bowls",
        "Imagine finishing up your game, the broadcast switches to this one and the first play you see is the 4th and 18 catch of the century lol",
        "What a wild game this was this is definitely the game of the year, I don't think it's gonna be another game that was wild like this for the remaining of the season......",
        "MINNESOTA'S BACK AND BETTER THAN EVER, BABY!",
        "どちらのチームも最後まで諦めない気持ちがすごく伝わってきました。\n最高のゲームをありがとう！",
        "Nobody talking about the notifications",
        "15:32 \"they slam the door\" \nLittle did he know...",
        "Damn !\nGreat Game !\n\nFalcons not ready yet...",
        "the big names made plays when their teams needed it, what a game",
        "Imagine Diggs and Jetta on the same team",
        "Wow! That was crazy! Unbelievable comeback there! And to do it against the Bills, just makes it even more impressive! GG   ",
        "Best game I have ever seen!!!",
        "Fantastic team ,great play calling.",
        "Bills were DESTROYED",
        "Vikings defense won The game #period",
        "I don't watch too much live football but I was watching this live; absolutely insane, this was definitely the best NFL game I've ever seen.",
        "Something I like about Jacksepticeyes Lets Plays of this game is that there arent any click bait titles that spoil whats going to happen. You just get to enjoy the journey with him",
        "If this was the Super Bowl, it would have been among the best Super Bowl games of all time.",
        "Maybe we collab one day bro. Imma glitchy dribbler ",
        "This honestly is the greatest game I've ever watched. This is peak football. This is why it's the greatest sport in the world. Cause of games like this.",
        "Probably the best ending to a game I’ve ever seen in my 18 years of living. Btw JJ is the best receiver in the league",
        "holy crap im not sure how the Vikings even got back in the game",
        "Diggs had that amazing one handed catch and JJ managed to top it.",
        "No one will remember Diggs great one hand catch like no one remembers Julios amazing sideline grab in the superbowl. I have no idea how Jeffersons catch is humanly possible. How does he maintain control through the ground? How?",
        "Definitely gane of the year, 4th quarter of the year, catch of the year, ... and game comment of the year",
        "Two catches of the year in this one. Diggs made an unbelievable catch as well as Jefferson’s. Still upset the Bills lost this one.",
        "Game of year you ask?  Me, nah that’s the Soupbowl.",
        "Can’t have a game of the year without the bills",
        "This was the best game ever",
        "No doubt, A Great commentary for the best game of the season!",
        "You have to love all these NFL fans that believe this game is still real. From the magnetic gloves to the scripted fumbles. This money is the dirtiest around.",
        "That was a great game bruh jus like my commanders beating Philly ",
        "This is my 4th time watching this game highlight. So Intense watching it !! Gotta love football",
        "As a Vikings fan, I think I aged ten years watching this game today, but what a spectacle! Great football",
        "One of the best games I’ve ever watched and I’ve been watching for nearly 50 years",
        "Commentator need to chill too much yelling",
        "“7-1 looking to get their 7th straight victory”….\n\n71 yard touchdown run",
        "the fact that the commentator doesn't know that justin jefferson was dancing pissed me off a little ngl ",
        "Justin Jefferson with the GREATEST CATCH OF ALL TIME AND IT AINT CLOSE! ",
        "Unreal game. Not even a Vikings fan but I was cheering and shouting for them. They fought so hard despite all the crap thrown at em. Best game I have ever seen. And I’m a Broncos fan so it tops even Super Bowl caliber.\nFantabulous game! Amazing job Vikings! What a game. WOW",
        "By far game of the year so far.",
        "The superbowl?",
        "I feel so bad for the bills defense",
        "Game of the year",
        "Josh Allen blew that game , he took the BRIBE , he stabbed his team mates in the back ....he will never be Superbowl material.or an MVP for any team....  and I'm a fan of Bill's",
        "Wow!!!",
        "SKOL Vikings",
        "My day is always made whenever these vids are posted. Great job, keep up the good work!",
        "As a Vikings fan my heart cant take this anymore, but a win is a win! Amazing game by both teams. 100% Game of the year",
        "game of the year or decade if that exist, definately catch of the decade",
        "This is like 10x the energy and excitement of the average Super Bowl. Incredible!",
        "Happy for Jefferson he balled-out and answered the call time and time again on the biggest stage he definitely woke the league up with his play keep it up and continue to be great that’s coming from a Brady / bucs fanatic",
        "I’m very concerned about the Bills\nBlowing leads, average defense and offense. Josh Allen mental mistakes",
        "The greatest game ever, which of course was axed during overtime to bring us the opening freaking kick off in Green Bay… cause that couldn’t wait. Nice work NFL.",
        "Mickey: break a damn jab!!! Protect that eye!!!",
        "What a stupid idea to sneak in the end zone. Loss earned",
        "Odell Beckham has nothing on Jefferson, his catch was way more spectacular! 4th and 18 with a guy draped all over him and he makes a one handed grab and takes it back in mid air. Holy Jesus he’s impressive to watch. Next randy moss or Calvin Johnson.",
        "Incredible, un-believable game, almost miracle game and Vikings QB is stand still throwing QB and let the receivers do job and they have the man Jefferson much like Ram's number 10. NFL is team-game but Viking’s QB K. Cousins and Jefferson is Offensive player of the year and Vikings Defense allowed Vikings QB  and receiver Jefferson to finish off, with final interception, my my what a job. I rarely comment on any NFL game, but this is a very special game and yes indeed I fully agree it is game of the year indeed! Bill's QB is not Superbowl quality QB and every time clutch time he blows more ways than one. Any wonder why he was NEVER recruited by SEC Conference, but clearly second-class WAC or now Mountain West Conference. JUST look at Tua, SEC, Eagles QB, SEC, Bangle's QB, SEC, not matured yet but still good enough Patriots QB, SEC, Jagua, not mature enough, but SEC. and ****LOOKING forward to watch Cleveland Brown QB Dushane Watson, *we know Huston Texas women's false allegations to KEEP Watson in Huston and I really think that *penalty is TOOO harsh should have been at the least *HALF game season like 8-game total, considering vast majority women **confessed they were suing Watson to keep him in Huston, but Watson to overcome *politics, he had confess something he did not do and paid lots of money he did NOT have to indeed; yet, women in western society is TOOOO dam spoiled and finger point anyone to get famous, ruin man's life, reputation, back breaking money extraction with question, some clearly bogus like Watson's case according to Watson's lawyers! Overall, smart Watson, compelled to admit something he did not do what the accusers alleged, pay JUST SO HE CAN PLAY FOOTBALL AND MONEY he can recover easily. IN closing, having watched his SEC Championship Game, yes indeed Watson has potential to be Super Bowl QB quality if he gets quality receivers like Dolphin’s QB and his, Tua, top receiver Waddle and Vikings Jefferson are so far I know in addition to Buc's two receivers, *without Gronk and AB, Buccaneer are doomed to win SB this year, also you guess right, Watson came from SEC, Clemson! Any compelling *refutation in regard to my underpinning points? Case closed indeed!",
        "This was the Vikings superbowl lol",
        "Pazzesco",
        "It's funny to see Allan towering of Singletary.",
        "What a game that's a preview of this years super bowl",
        "end of the day - bills blew it.\n\nbeat themselves with their own mistakes. this game is more about bills losing it than vikings winning it",
        "Man are these bills cursed !? Play so damn good then lose these stupid close games. Unfortunate they lost this at home. Allen is good as he is as a gun slinger may want to sometimes go for the short yard throws and maybe take a slide or 2 when running.",
        "Refs cheated in every way possible. No PI call on the jersey being held in the end zone, not calling offside on the QB sneak, not calling for a replay on the no catch and not calling the 12 men on the field. Vikes beat both the Bills and the Refs",
        "Just imagine if we could get a SuperBowl game this exciting ",
        "Reading so many comments.  No hate at all for Josh Allen.  What I saw in this game is pretty much all of his completions are to wide open guys.  Any sort of tight window he misses badly.  The fact Diggs had to leap 11 feet in the air to make catch shows how much a very average QB is bailed our by his pass catchers.  Meanwhile GOD FORBID Lamar has even 1 incompletion them he the worst QB, most over rated QB ever.  Lamar hasn't had anyone even remotely close to throw to as good as Diggs. Lamars WRs are NEVER this wide open.",
        "Reminds me Of Ali Frazier.Amazing game!!!",
        "Amazing game! I wonder if the Bills would’ve took the field goal on that 4th & 2 instead of going for it, I wonder if they would’ve won the game",
        "allen and billz are the epitome of being overrated",
        "They're so relatable, it's quite funny too",
        "Most amazing & exciting game I have EVER seen in my life!  Bills: finesse, execution & speed.  Vikings: all guts and determination. The fact that the Vikings seemed the underdog throughout... makes them them my \"never-say-die\" champs so far this year... and I'm a Patriot's fan. You go Minnesota! You go!",
        "16:21 \"The ball is loose! Do the Vikings have it?!?\"\n#55 Ze'Darius Smith looking directly into the camera: \"YES!\"",
        "And Joe Davis calling this game was sensational \nThis was indeed: The Greatest Game",
        "This is a Super Bowl preview! sorry KC",
        "Josh Allen choked. Lmao",
        "Repent to Jesus Christ “Nations will come to your light, and kings to the brightness of your dawn.”\n‭‭Isaiah‬ ‭60‬:‭3‬ ‭NIV‬‬\nU",
        "Had to watch this again without the threat of heart attack or aneurysm.",
        "INSANE",
        "Game of the century",
        "I think Jefferson proves time and time again that he's open even when he's covered. That man is unreal!",
        "What a beautiful game that was! The referees let them play and it was a game of the century!!",
        "rare example of referee wrong calls making a game more exciting without ruining the end result.",
        "Such an awesome game!",
        "Wow. That was a hell of a game.",
        "your content never seems to disappoint me,keep it up! >:-O",
        "that JJ catch is up there with the all time great ones, who cares if it wasnt a TD. that will be replayed forever.",
        "I don't think the bears played the best game but it would have been going into overtime possibly if Santos didn't miss that field goal he had 40 straight coming into the game well a couple less than that but 40 straight and then he missed one but they're a fairly new put together team hopefully next years even better",
        "Justin Jefferson is the best WR I have ever seen in my life. I've never seen that time of clutch performance before ever. He deserved to have won",
        "What a great game from both teams. I can clearly see growth in The Vikings since they made a lot of off season changes. They’ve developed a fight in them I haven’t seen before, go Vikings.",
        "My lions injured oline and Viqueens need missed field goals. Stop smoking please.",
        "JEFFERSONNNNNNNNNNNN IS HIMMMMMMMM OH MY GOODNESS ️️️️️️️️",
        "I saw the title and said, \"yeah right\". Boy was I wrong. This entire game was a highlight reel, my goodness lol",
        "i remember watching you when i was 8 and i came back and im happy yall are still working hard",
        "Game of the year for sure. Can't see how anything will top this. That was wild.",
        "Imagine if these two teams had a rematch but it would be at the super bowl",
        "This may be our Superbowl preview",
        "Love the ending...\n\"I told you!! I told you!! I told my mama, told my papa, told my first teacher... I'm guna be a star!\" ",
        "An insane and memorable game, but man the officiating in this game was AWFUL. 2 HUGE things refs missed that allowed the Bills to get the game to overtime. They were in Buffalos pockets 100%",
        "Every year I cheer for the underdog. By memory my list is Detroit Lions Buffalo Bills, Texas, Tennessee, Falcons, Bengals, Cardinals, Vikings, Browns, Chargers and yes the Browns franchise did win 2 Superbowls, after they moved to Baltimore. I even root for the Jets, because it's been so long.",
        "WOW!! What a hard fought back and forth game with exceptional plays by amazing talent! Congratulations  to our Division rivals the Vikings \nFrom a Green  Bay  Packers  fan",
        "Shoutout to that boy from New Orleans #JJ",
        "An exceptional game and the Vikings have shown unbelievable resilience through this season. Give JJ a blank check- Minnesota drafts GOAT wide receivers and this whole team is special. Bills, we’ll see you in the Superbowl.",
        "I think it’s funny how right now a lot of people are talking smack about Justin Hebert having bad games and throwing interceptions when he doesn’t have any of his starting receivers or O-line. But with Josh Allen everyone is trying hard to not talk about his interceptions and blown games even with his entire team being healthy.",
        "What a game! Diggs’ catch: CRAZY\nJefferson’s catch: CRAZIER\n\nVikings deserved the win though since Davis didn’t actually catch the ball therefore there shouldn’t have even been an OT",
        "Dang. Who is this Jefferson character? This game was killing me inside. Epic",
        "Diggs: Unbelievable one handed catch\nJettas: Hold my beer",
        "this is crazy, Jefferson is the best wr in the league",
        "What an amazing game!",
        "Late in the game one of those announcers said “Kirk Cousins is putting these balls in unbelievable locations!” ",
        "That no call on 1st & Goal in OT for 12 men on the field is crazy.",
        "This was a super bowl caliber game.. every player was on his game in game",
        "This has got to be the best game of the season thus far! Both Justin Jefferson and Stefon Diggs showed some extraordinary talents. Vikings defense also showed true heart in not giving up on the game. Go Vikings!!!",
        "As a Vikings fan I had so many heart attacks this game insane comeback skol",
        "Worked 12 hours on Sunday. Didn’t get to watch any football. My buddy was like “you gotta watch this game back.” Did not disappoint. Wow, game of the year 100%.",
        "As a Vikings fan, I want a superbowl win so badly!! But if we don't make it, I hope the Bills do! Just an UNBELIEVABLE game!!",
        "Hold us down but don't count us out",
        "SKOL!",
        "what a game",
        "Sorry Odell but Jefferson catch was greatest catch",
        "This has to be the game of the year.",
        "Red zones becoming nightmare for Allen. I love that guy. but god sake, reduce turnovers and start smart plays.",
        "Buffalo you throw the ball and after that you throw the ball more and more you have no running game because you don't commit to it",
        "Why is no one talking about this amazing sports commentator?!? He made the game 1000 times more exciting!! What’s his name?",
        "WHAT A GAME!!! I LIKE BOTH TEAMS BUT STILL GO VIKINGSSSSS!! SKOL",
        "Sheeesh...THAT was a game.",
        "Waiting for the announcers to start screaming like death metal when they broadcast.",
        "I'm not even a vikings fan,  but I actually found myself rooting for them.  \"The catch.\" That catch was easily the best catch I've EVER SEEN!! as long as I've been watching the NFL (50 years).",
        "18:33 Buffalo has 12 men on the field",
        "Right when you think the Bills and Chiefs games are the game of the year, Minnesota challenged that. One thing for sure, Buffalo plays exciting games win or lose",
        "You know it’s an insane game when cook runs a 81 yd touchdown and no ones talking about it!",
        "I've been watching the NFL since the mid 1960's and that was the most amazing game I've ever seen. How in the heck did Jefferson keep the ball in his hand and off the ground on that 4th & 18?",
        "Why no one talking about the 3rd and 10 that Jeffson caught in OT. lol put them in field goal range",
        "I bet the atmosphere in the stadium was electric, what a game!!",
        "L ratio ronaldo better",
        "its hilarious how kirk cousins kirk cousins is",
        "Respect both teams can't wait to see them in the playoffs",
        "This game had it all.  Superstars everywhere, stars making big plays, stars making mistakes, missed calls by the officials, 4th down conversions, crucial missed PAT, goal line stands, QBs putting their bodies on the line, a catch for the ages, a fumble for the ages, and 2 franchises who have been snake bitten throughout their history battling for respect.  As a Vikings fan since the mid-80s, I expected we'd lose but would have been happy for Buffalo if they won.  Buffalo has earned my respect.  I am now rooting for Buffalo the rest of the way, unless we have a rematch in February :)",
        "most exciting and best game since pats/falcons",
        "What a wild game",
        "Wow  Jefferson is the beast",
        "It's insane that they didn't review the Gabe Davis play. I'm glad the Vikings won, that would have been horrible otherwise.",
        "This game was so crazy! The moment Cousins got sacked for 4th n 18, i thought game over. When i saw the catch, i screamed so loud i dont think i heard myself. GG's Bills fans, heck of a game.",
        "The Bills had it all the needed to do was get out of the end zone.  Things like this end a coaching career and send someone like Sean McDermott to their natural acclimated station.  I picture Sean on really wanting the William and Mary job.  He’s checked out, cashed out, and tube sour to his own messages.  Great teams over coke adversity I don’t see McDermott as anything more or less then a nepotistic hire.",
        "diggs laughing thinking his team won at the end is pure gold",
        "Everyone had a highlight that game!",
        "Justin Jefferson is the real baller.",
        "I don't understand. About that field goal in overtime? Why Vikings didn't win at that moment?",
        "Overcame a 17 pt deficit, a non review on a clear incomplete pass, and 12 man on the field no call on the goal line. Skol",
        "Someone please explain this to me.\n\n(15:10) When it was 4&Goal for the Vikings at the 1 yard line.",
        "Very glad I have Jefferson on my fantasy ",
        "Definitely game of the year !",
        "Wow  that was a great game I wish I would've saw it on TV frfr",
        "This game was absolutely exhilarating!!!! ",
        "Bills fans: Holy $hit check out that one handed catch by Diggs! Vikings fans: HAHAHA Riiiiiight! How about we do you one three better and have Jefferson go higher, with coverage all over him, and the game on the line?",
        "One of the greatest game in history",
        "Nope there will be better",
        "Definitely the game of the year.",
        "Yooo!! thats gotta be top 5 game of the late decade! ha unreal football!",
        "Smii7y's videos are just plain hilarious",
        "That there kids, was this years superbowl. No need to watch anymore foosball. Skol.",
        "Kirk Cusimano for MVP!!!!",
        "Purple P3nis Eaters have a great record, but so many post season holes. Worst stats for any red zone Defense. Jefferson will be doubled maybe tripled in post season schemes.",
        "All jokes aside this was one hell of a game Justin Jefferson  and Diggs both played their hearts out and both fanbases should not be ashamed of what they saw today. GGs Vikings fans y'all are for real!",
        "Minnesota Vikings",
        "Possible Super Bowl preview?",
        "Another cardiac win for the Vikings !!! Unbelievable and definitely the game of the year !!! Both teams played amazing football - first the amazing one-hand catch by Diggs for the Bills and then that insane one -hander by Jefferson when he had so much pressure and harassment on him - CRAZY!!! For the most part Allen played some good football considering he was questionable before the game , but he's got to stop throwing those interceptions and that fumble at the end of the game was totally shocking whoever you're cheering for - the Bills actually had the game won , and had some damn good defense to keep the Vikings from moving up the field for most of the game. I'm a fan of both teams and thought that the Vikings were a bit fortunate , but they still have a damn good team and could win the Super Bowl !!! Cook and Jefferson are doing a lot to carry this team - I'm totally thrilled to have seen this game in person - first NFL game !!! Lots of beer , dogs , and pretzel twists , and a steak dinner after the game - oh yeah baby !!!",
        "While watching the last quarter of that game I found about three new emotions that i didn't even know i had. As a life-long Vikings fan... that's sayin' something. Just.... WOW!\n#SKOL LFG!",
        "GAME  of the YEAR?  ALLen is Hurt plus it is PAINFUL to Watch Cousins throwing the BaLL,  Lets HOPE THIS is Not the Game of the Year .",
        "Bro this game was insane , the bills were most definitely supposed to win this game they gave it away ️, Josh Allen has not looked like himself these past two or so weeks ik they won today but u can tell that injury is bothering him especially since he's throw 2 Interceptions in back to back game",
        "Those last two overtime connections between cousins/jefferson were elite’r",
        "The Bills always put up one of the best games in the last 3 years. Last year, they went against the Chiefs, and it's one of the best games in 2021.",
        "As a Bears fan, it’s hurts me to see the Vikings win, but anything to keep anyone but GB out of first place. If they end up winning the chip this year, I won’t be surprised. Justin Jefferson is just on another level.",
        "what a wonderful game",
        "0aapaappas ulp",
        "Wow! I didn't want the game to end.",
        "Vanossgaming and the crew is my childhood and I am still having fun watching them doing some funny shits, even today and probably watch more in the future :3",
        "Josh Allen is going to be the mvp for sure. Dude is a damn tank",
        "Yeah this felt like a playoff game for sure, #Billsmafia are cursed from the Jim Kelly/Thurman Thomas 90s. They are going to shoot themselves like this game, how n so rare you stopped them yet you fumble TD during hike sessions. Josh Allen got them there yet gave it away with the fumble n Peterson INTs. Can't believe these Viks lost once, Rodgers division is over.",
        "Uh No. Game of the Year is God of War Ragnarok.",
        "game of the year indeed ",
        "My jaw hurts from that catch ",
        "This was indeed a very interesting game to watch. Especially the final minutes of regulation.",
        "Game of the year? Didn't anyone watch the Miami/Baltimore game in week 2?",
        "Easily one of the best games I've ever watched.",
        "We literally witnessed one of the best performances by a receiver in the history of the NFL today… Dude was 1 hand snagging like they was lay ups  … for a second I thought I was watching madden ",
        "Justin’s making a steady pace to Legendary Status",
        "Crazy the Bills had the GOTY last season; now this. Sucks they lost both, but damn those were two crazy entertaining games.",
        "The fact that the bills thought they were going to win is soooo funny",
        "game of the year!",
        "A classic",
        "If both teams make it to the super bowl this game would be the storyline hyping it up.  If I was the NFL I would replay it the week before.\n\nGreat energy from the guy in the booth too.  He added to the drama.",
        "Best game I've seen since Detroit/Stafford beat Cleveland back in 2009 to end the season in 1-15",
        "Best game I’ve ever watched! Justin Jefferson=Best catch ever made!",
        "Please let him call the superbowl ..love the commentary he made the whole game just feel crazy",
        "This comment is for all the people watching this after the season ends",
        "This is by the far the game of the year. I don't  think the superbowl would be as exciting as this game. I'm a Seahawks fan but love to see cousins having a great game.",
        "The final part about it being a heavyweight bout and Minnesota delivering the knockout blow damn near moves me to tears. Such a crazy game. I’m not used to seeing the defense play like this. Not since 2017",
        "This by far the most insane ending to game you will ever see.",
        "Awesome work at 5:45 when the Viking recovered the fumble and his teammates ensured he wasn't touched while down. These guys are pros and think of everything. Amazing.",
        "Wordle win 39:00 COD win 10:39:00 Love Doc after hours stream! Awesome stream! Firmhandshakes to Doc & Z! Love u Doc! Yayaya",
        "\"Are you not entertained?\" This game was amazing! Jefferson is the best receiver in the game no question",
        "You can't see a better catch with one hand then that ever. From the top to bottom with one hand and squeezing the ball rolling on his back having the player pulling on it and it doesn't hit the ground and the game on the line forth down play",
        "Purple People Eaters",
        "This is one of the greatest games I've ever seen. I thought nothing could top last year's Bills vs Chiefs throw down. But here we are.",
        "Yeah, game of the year so far...",
        "The fact that Diggs' one handed catch was the second best catch of the day is insane.",
        "kirk cousin is unstoppable in the afternoons",
        "Both teams played hard and fought to the end.  I'm happy the vikings won and Buffalo should hold their heads up high for playing such an intense game.",
        "Hello pass interference on Allens touchdown throw second last play clearly.",
        "I can't believe I almost turned this game off in the 3rd quarter. As a Vikings fan, I was sure this was going to be another ONE of those games where we deuce the bed. This was one of the most entertaining games I've seen in a very long time.",
        "Josh Alan needs to learn from his dumb turn overs. He got picked twice from the Green Bay games, and being lucky not getting punished. Could have taken 3s twice instead of surrender picks in red zone twice.",
        "I thought that they were professional football players not professional dancers.",
        "This was literally one of the greatest games I’ve ever seen",
        "WOW! INSANE 4Q & OT! WHAT A SUNDAY",
        "That catch. Wow.",
        "This game was crazy, both teams played their hearts out and this hands up should win game of the year",
        "I felt/feel so bad for Evelin. If I remember RE7s story correctly she was just a girl who had her life taken away by an evil corporation. She rapidly aged due to their experiments and couldn't get that life back. It was so cruel to her, so I can see the resentment and anger, although unjustly aimed at Rose, I understand why she's so mad.",
        "Get peterson a contract. He’s still closing games, its insane.",
        "Loved the game but it honestly just shows how rigged the NFL is",
        "Bills 12 men on the field @18:33",
        "you can literally see some of these passes zip through the air. Its crazy to see",
        "Jefferson hurt himself in the celebration. ",
        "This game was what you imagine happening when you’re a kid playing football in your back yard with your friends, except it was real.",
        "Bills got away from Singletary which hurt them Josh Allen great but let your teammates help.",
        "Exactly 20:00 in. \nTurn your sound up for the hype of a lifetime. ",
        "Aren't the two teams colors a bit mixed each other? Usually I see more contrast in colors to differentiate them more, I hope the quarterbacks don't get the same problems I do.",
        "GO BILLS!!!",
        "This game was so crazy lmao I turned this game on towards the end of 4th quarter and I kept telling my bf “omg bills are gonna win it!” Then a few mins later “NO the Vikings are gonna win!” Back and forth and my bf was like “wtf??” ",
        "3:49 „Boy 7 Dudes had a Chance“ great ",
        "As a lifelong Vikings fan. This team always give me heart attacks. Always come down to the last plays. Stefan Diggs game winning catch against the Saints. Brett Farve game winning pass against the Niners. And a few this season.",
        "I haven't seen bed sh**ing like that (Bills) since my daughter was a baby.",
        "That was holding on the Vikings should of been a penalty, bad call by refs",
        "Game of the decade ",
        "I’m so proud to be a Vikings fan when I watch JJ. \nSKOL FROM MINNEAPOLIS",
        "AY AY A Y",
        "@6:00 that was not a fumble, ball came out after he hit the ground and rolled",
        "And that ending is what Buffalo gets!! Minnesota gave you this game but you decided to pass pass pass pass",
        "wait until flight see this",
        "A pretty dull affair in the end.  A lack of any real excitement.",
        "One of the best games I’ve ever seen, so many chances for both teams to win. Huge shoutout to Kirk Cousins for leading his team to a huge W, also Jefferson with some clutch clutch catches and plays",
        "Definitely not game of the year tho honestly",
        "at 15:06 you can see the bills defender jump way offsides",
        "This was just horrible defense on both teams plus last week Vikings got exposed anyways",
        "Okay ngl, the voice actors in this game genuinely did a good job with their performances. Porter sounds insane and comedic, Audrey genuinely sounds scared and a fish out of water, and the ink demon sounds spooky af. They did an amazing job with this game overall!",
        "It was pretty much all buffalo until the late third quarter. Really crazy turn of events to put the vikings in a position to win.",
        "Wowwww !!!",
        "They went to war out there. Respect to both team's ",
        "Unbelievable game! A massive 17 point comeback, catch of the year, miracle plays, and much more. Both teams balled out all game long! This is truly gonna be a NFL game looked back at for years!",
        "Don't remember ever seeing a game like this before. The catches, drama with the fumble TD and overtime comeback win.  .\nDiggs one handed catch oh hang on Jefferson went one bigger with 2 monster receptions. Game of the Year hands down. AMAZING.",
        "Hey Anthony Barr ....miss wearing 55 in purple yet?",
        "I’m a giants fan and this game gave me anxiety",
        "What a game!!",
        "This entire game was a highlight reel.  I was screaming like crazy and I could have cared less which team won.  It was the best game!!!",
        "That catch tho in fumble at the goal Line lol  I think I’m starting to watch WwE ",
        "Up by 17 3rd......",
        "Im hella weak...JJ grabbed that hamstring like he was hurt ",
        "Craziest game ever",
        "Vikings offense is still too inconsistent and the defensive scheme is terrible. Looks like they're always playing \"prevent\". I feel like we are a very lucky 8-1.",
        "Maaaaaaaaaaaaaaaaaaaaaaaaaan I wished I watched this game LIVE ",
        "Justin Jefferson is outta his goddamn mind!",
        "Damn josh",
        "As a chiefs fan, all I gotta say is...ha",
        "This game was amazing both teams would have deserved to win. Imagine if they meet again at the superbowl!",
        "Let's see all the people who LOST money on this game who thinks this was the game of the year  foh",
        "@3:15 why does it seem like it started snowing once he made the interception? ",
        "Yeah viks from Utah",
        "If there is any game that would help revitalize the NFL, it's definitely this one! Great Job by both teams and of course the awesome commentating!",
        "Oh my.  Like - 1/2 of that would be a game for the ages.  Thanks for this 20 min recap.  Really captures the drama.",
        "That catch was better than Odell’s",
        "Commentator : oh Diggs ! Oh what a catch.\nJustin Jefferson: Hold my beer  \nLol. Great match ",
        "as  Lions Fan...Congrats Vikings 100%..I wish you guys luck the rest of the way ..make NFC North proud ",
        "okay this literally was the greatest game of the year. same reaction I had watching chiefs rams",
        "What a game! Too bad they don’t edit and upload every single game like this. I’d actually watch football again. Raiders were actually good the last time I watched football.  This was just randomly in my YouTube feed and I watched since it was only 20 minutes and said it was fake of the year. I’d probably actually watch tons of games if they did this for all of them.",
        "Nothing makes me happier then seeing bandwagon Bills fans cry like little school girls :)",
        "Boogie Basham is a hell of a name tho",
        "In 50 something years, I have never seen the vikes lose a game 3 times,, only to end up winning it. One of the great games. Ya got a great team Buffalo!",
        "Yea This Was Game Of The Year So Far What Excitement From Both Squads Frfr ",
        "my mouth is dry from how many times my jaw DROPPED",
        "These two teams being 0-4 on Super Bowls makes a matchup in this super bowl as tantalizing as one could ever be. One team would feel as though they’re forever cursed and the other would break their curse.",
        "Mad action",
        "Crazy thing is how this game is a result of one of the best Win- Win trades in the NFL. Diggs for the pick that got the Vikings Jefferson and parties are extremely happy with the result",
        "Of course the Bills choke again. ",
        "Cousins > Allen",
        "Lol yeah game of the year lol wow",
        "This is an incredible game that could have gone either way.  From a Vikes’ fan, good luck Bills & see you in the playoff!",
        "Same Buffalo as always...what team fumbles a snap in their own end zone as they seemingly have the game won outright? Buffalo,  that's the team!! Lol. This loss eclipses, if not passes, the oiler comeback game in the early 90s. Rename the franchise,  that might help the inept cloud hovering above this organization dissipate!!! Kmsl...",
        "Josh Allen should lose his mvp consideration after that performance  2 dropped Ints away from having 5 turnovers on the night",
        "Crazy work! #Skol",
        "This is definitely hands down GAME OF THE YEAR!!! \n\nJustin Jefferson showed us why he is one of the best wide receivers today",
        "13:42 - Jefferson’s one-handed catch\n\n16:16 - Bills fumble in end zone and Vikings recover to score",
        "The second guy in the booth sounds like Daniel tosh. You’ll never unhear it",
        "watching vanoss make  play the \"cheap\" horror games is amazing.",
        "This is like, the most insane game I've watched since the AFC Divisional game between the Bills and the Chiefs.\n\nBuffalo sure knows how to put on an exciting show. And Justin Jefferson of the Vikings catches absolutely everything thrown his side of the hash marks.",
        "Funny how the NFL cropped out the 12th man in the 4th quarter.",
        "W video",
        "Vikings we’re playing two teams tonight and still won",
        "This game had it all.  Superstars everywhere, stars making big plays, stars making mistakes, missed calls by the officials, 4th down conversions, crucial missed PAT, goal line stands, QBs putting their bodies on the line, a catch for the ages, a fumble for the ages, and 2 franchises who have been snake bitten throughout their history battling for respect.  As a Vikings fan since the mid-80s, I expected we'd lose but would have been happy for Buffalo if they won.  Buffalo has earned my respect.  I am now rooting for Buffalo the rest of the way, unless we have a rematch in February :) yes!",
        "Been a vikings fans since 89's.. this squad is special! This is a different team.",
        "That Justin Jefferson clutch conversion catch on 4th and 18 was just unbelievable!",
        "this is wild",
        "One of the best games I’ve ever seen. Overcame bad officiating and a big deficit! Incredible! I love this team! Skol Vikes!",
        "Ludicrous from thi Vikes",
        "Nice",
        "Commentator at the end said IMPOSSIBLLLEE",
        "Imagine a Super Bowl with these two teams and the storyline would be amazing!!! ",
        "Kirk Cousins the best worst QB in the NFL",
        "As a Packers fan, I’m not even mad at this one. Best regular season game I’ve ever seen. And catch too",
        "This game had more highlight plays than my Titans have had all year long. What a game!!",
        "The best match, the teams showed a very beautiful game!",
        "Two of the all time great true NFL franchises and fanbases. Each with 4 Super Bowl losses. You still have to be one helluva franchise to get to four of them. Here's to one of these teams getting to the bowl and breaking their duck. #skol",
        "I have chills my mind is racing this was really the game of the year I can’t wait for what’s to come in these next coming years how amazing these football players have become throughout the years they’re getting stronger thru time better gear this is only gonna get better ",
        "This game will be talked about now and later a game that will last forever",
        "What a freaken MONSTER game by Jefferson!!!  This man caught every single ball in multiple big moments.",
        "This game proved that the  Diggs trade and Justin Jefferson pick up was perfect for both teams. Diggs had a great game with an awesome catch, but Jetta had an unreal game. Best game I've ever watched.",
        "This game could possibly be the preview of the Super Bowl matchup this year.",
        "This was an amazing game to watch... awesome effort by Cousins and the Vikings...they never quit.",
        "Not a good game. Refs screwed the pooch so often",
        "Only if you’re a Viking fan was this the game of the year. For the Bills, it was another throw away of a big game",
        "That was one of the greatest football games I’ve ever watched",
        "Two great teams.thanks.",
        "Jefferson's catch on 4th and 18 far outstrips most of the \"top plays\" that get recycled into \"best of\" compilations. It's not even close. Probably best catch in the history of the league.",
        "Have to watch this in real time again! Highlights don’t even do it enough justice! There’s a highlight reel play every other play ",
        "Cousins seems like a great QB. I wish the Commanders could get someone like him.",
        "Gotta say dam Justin and the defense carry this game not gonna lie holy sh!!t like I was stunded by this game no cap best game ever!!",
        "I’m a niner guy but this game was incredible!!!!",
        "There is something special about this Vikings team. They don’t blow anyone out and they make every game overly-interesting! But they just keep winning. Credit to the new head coach, Kevin O’Connell. I love this guy! Will they win the Super Bowl? I’d be surprised. But this team has done a LOT of surprising things already.",
        "That was just a joy to watch.",
        "20:01 TOLD YOU!!!!",
        "Justin Jefferson with the backpack ",
        "That was the greatest last 2 minutes of any gave I'm ever seen. Being 38 almost 39 I think that's saying something. I thought for sure my Vikings were finished way early in the game and those last 2 minutes oh my!",
        "I’m a Viking fan and this was insane",
        "GAME OF THE YEAR, GAME OF THE DECADE, GAME OF THE CENTURY!!",
        "Wow! What an exciting game.",
        "This felt like an actual Super Bowl game!",
        "I wouldn’t be surprise if these 2 teams play eachother in the super bowl ️",
        "This game is the # 1 game of the week, and Washington upsetting an undefeated Philly team is at #2. Vikings managed pull off another one at the last minute just like they did my Washington team",
        "Went from game of the year to blowout of the year. Vikings will never be a super bowl contestant or probably never gonna be a danger in the play offs",
        "Bills throw away the game too much turn overs cost them",
        "Game of the year and fix of the year. Allen fumbling on the 1yd line, my ass LMAO",
        "️efferson",
        "I hope these 2 meet in the playoffs. In Arizona. For the Lombardi trophy. Both teams 0-4 in the superbowl. Couldn't write it any better.",
        "Nice to see plenty of purple in the crowd",
        "wow what a crazy game !! As a Dolphin fan...thank you Vikings !",
        "fortnite",
        "Great game by both sides felt like a Super Bowl game",
        "Super Bowl caliber game",
        "bro this was the game of the last 5 years. jesus it was so damn good",
        "It's so much easier not being a fan of either team. Being able to sit back and appreciate an amazing back and forth game is great. Seeing those Buffalo fans after that INT to end the game felt like a second hand gut punch, and I'm a Patriots fan.",
        "Jefferson looking a lot like Randy Moss.",
        "5:01 the 2 blitzers on the Vikings run into each other chasing after Allen .",
        "As an eagles fan, I’m so mad we didn’t draft Jefferson, he’s most certainly got that dog in him. Ggs to the Vikings, see you in the playoffs ",
        "This game will be talked about for generations. Incredible game!!",
        "This game is the equivalent of drinking five bang energy drinks and having a panic attack",
        "Goosebumps !! The commentator made it even more exciting !!",
        "They actually thought he hurt himself The JJets fans know that’s a classic",
        "Not the announcer actually thinking he was injured...",
        "I think the Bills (generally) played a better game and seemed stronger, yet somehow fumbled the bag at every crucial moment in the 2nd half. Literally the perfect storm",
        "Jefferson great player LSU all day ",
        "Epic moments. Most of all. I'm happy for Pat Pete, at that age. 2 clutch ints on a superstar In prob his prime. In a highly touted game. Shout out to Duke Johnson, as well. Nice to see him back out there. That catch by Jefferson though.... WTF lol",
        "This is literally one of the best games I have ever seen in 30+ years of football.  One for the ages.\n   Lions/Bears was such a great game too. All on the same day.  What a day for pro football.",
        "This is superbowl game ",
        "We need a super bowl game like this!",
        "… I am blow away by this game. Wow. \n- New York giants",
        "As a Dolphins fan and on behalf of Phins up nation I would like to thank the Minnesota Vikings ",
        "this is what we seesaw!",
        "couple big misses by the refs in this game. they really wanted Buffalo to pull this one out",
        "Jefferson with 10 receptions 193 yards(career high) 1 TD, Best Catch of the Year",
        "Great game with so many big plays. Epic NFL action. Hope the Vikings can continue this momentum the rest of the season.",
        "Go vikings!!!",
        "Cant forget ab diggs catch",
        "Justin  in insane",
        "The turn of events in the last 3 minutes of this game is mind blowing \nOT was nuts too! \nBest NFL game I’ve seen!!!  WOW!!!!!!",
        "This just reminds me of 2 things. 1 just how terrible the officiating is and that rules definitely need to be changed and 2. That I don't want to ever hear another Mahomes V Allen comparison. Dude has had 4 years of a terrible division, great HB production, has a top3 WR, a great 2nd WR, really good TE and a smothering defense and still can't get it done. It's just embarrassing to even remotely try to compare the 2. Even worse ppl try to put Herbert in there like half his offense isn't predicated on Ekeler. Stop making excuses it's Mahomes and about 2 tiers down is every other QB. It's been that way for a while now.",
        "15:00  I never knew Brett Favre was officiating now?!  That guy just can't retire.",
        "These commentators had so much energy lol loved watching this game live",
        "Omg. Game of the year forsure. One of the best games I’ve ever seen in my God given 30 years. Made me wish I was a Vikings fan for a few. But I’m a die hard Dallas guy.",
        "3:48 when he said \"about 7 dudes had a chance\" I had flashbacks about being in a bar with my cheating ex-girlfriend from years passed",
        "This (or any) game could be summarized in under five minutes, there is no need for this bloated highlight reel.",
        "I just watched the rerun highlights of this game and it is is not the game of the year.  The game of the year is a game in which both teams, the coach and quarterback play their best, set new  records and do not hand the game to the opponent like Josh Allen did in his own end zone or other misplays, fumbles, interceptions and other  missteps  by the Buffalo offense and defense. It may be the game of the year for the Vikings team, who had not received the respect it deserved for its record. Was it a fun game to watch if you are a neutral fan? Yes. Game of the year? No.",
        "This game perfectly describes my life as a vikings fan. Complete ups and downs filled with nonstop heart attacks... surprisingly we came out on top though which isn't usually the norm lol\nI love this team, I've had so many thoughts after so many different years like damn maybe I should just root for another team... But I never can and never will. I will probably die of a heart attack from a missed game winning field goal in the Super Bowl some year",
        "Man , they got to do something about Joseph ?",
        "Of course it is no matter what",
        "Billls are still chapions no matter what",
        "You know Gabriel Davis didn't catch that",
        "I cant think of a better game that i've seen. So many ups and downs. So many back and forths. What an insane 4th quarter and overtime",
        "You can't see it's fake football \n\nWake up.",
        "WORST refs of the year!",
        "I don’t like this announcer, he just yells obnoxiously",
        "That was probably the greatest regular season game I’ve ever seen. As a Vikings fan I went through so many emotions watching this game.\n\nThe Jefferson catch and the fumble touchdown with 50 seconds left had me shaking.",
        "I've been a Viking's for over 40 years. There have been many nail biters and Minnesota usually comes out on the short end of the stick. I have never been more proud of them than I am today!!! I actually had tears in my eyes when they won. The last time that happened was during the Vikings vs. Falcons game, when they LOST!!!!!!!",
        "Bills should of just taken a safety when they were on the goal line",
        "i was going for the Bills \nthis game was amazing a real battle the Bills met there match ",
        "put this game somewhere in a trophy cabinet. it needs preserved",
        "Literally a madden game",
        "This is making me remember the old times where chase use to be younger playing with us =(",
        "that 81 yard TD run by Cook was the turning point of the game. after the TD, i knew Vikings was going to make a comeback.",
        "What a massive game!!!!",
        "You know it's gonna be a wild ending when the start of the 4th qtr is the halfway point of the highlights video ",
        "PAT PETERSON HAS BEN RESURRECTED",
        "Im not sure how a game this embarrassing could be game of the year.. besides the fact it was an emotional roller coaster.",
        "When Jefferson caught that one-handed 4th & 18 I thought it was the most memorable moment of this season so far, not even 2 minutes later so much chaos had ensued I forgot it even happened. This is probably the single most insane game of football I’ve witnessed live.",
        "W",
        "One of the best games I've seen. Wow.",
        "WHAT A GAME!!  ",
        "JJ has the catch of the year! Patrick Peterson is back on top. Vikings are on a 7 game win steak and are not to be trifled with!",
        "Great games this weekend.  The bigger shock was Washington upsetting Eagles last night. The NFL is up for grabs makes for a great season. Giants fan ️",
        "Allen choked the snap and lost the game. They led by 4 with :45 on the clock! They should've won in regulation.",
        "thats the most crazy thing ever seen, wooowwwww",
        "I'm no fan of the Vikings, or the Bills for that matter, but seeing Jefferson, Peterson, and even Hunter out there doing what they do best puts a huge smile on my face. Geaux Tigers.",
        "That last pass Allen threw...wow. Absolute bullet.",
        "As a vikings fan, I'm confused.  The vikings have previously set an expectation for snatching defeat from the jaws of victory, and I just don't know how to process this reversal.  However, I hope it continues.",
        ":O",
        "This is by far the greatest football game I've ever watched. Is it the best game ever? Probably not. But I've never been more excited watching a game. If I wanted to get someone into football, this is the game I would show them. The chaos, the fight for every yard. It's the essence of what makes the sport great to watch.",
        "You know it was a good game when the highlights are 20 minutes long. Damn I have been excited for this game!",
        "Bills being the Bills... Stupid coaching decision not to take the 3 points. They would have won...",
        "Pretty sure I saw O'Connell sitting down with Kirk after a horrible interception. I just thought to myself, Zimmer would never do that. I love seeing this positive environment that's being created by the coaching staff.",
        "Better then OBJs catch",
        "Anyone else count 12 players on the Bills side @ the 18:33 minute mark??",
        "this game was insane on to many levels",
        "insane",
        "Wow one of the most crazy 4 quarter ending",
        "one of those games where it sucks one team had to lose, what a game. Also, nice to see that Diggs is flourishing in Buffalo while MN is doin the same with JJ. Worked out for everyone",
        "Best game hands down",
        "Game of the Century",
        "just think what happens when your playing the creeper sound using a noteblock and then a actual creeper comes behind you but you don't realise it.. :(",
        "Wow",
        "Talk about snatching defeat from the jaws of victory!!!!",
        "i think the vikes have a good chance at going to the super bowl and that's coming from a lifelong LIONS fan also GO GREEN kirk cousins!!!",
        "재밌다",
        "Been a bit of a Vikings skeptic these past few weeks but holy cow what a performance! Consider myself proven wrong. Amazing game! And thank you to Minnesota for helping to put the Dolphins in first place in the AFC East!",
        "Sorry, the game of the year was last night. The Eagles are now 8 and 1. Go Miami!!!!!!!",
        "Diggs: Makes an incredible 1 handed catch\nJefferson: \"And I took that personally\"",
        "“Do Y’all Like That” The Game Of The Year. What A Great Game By Two Great Teams!",
        "Imagine if Brady had receivers that could catch, they would be 8-0",
        "Great game ",
        "Game of the year requires both teams doing well. Bills literally gave it up at the end, that fumble was the dumbest thing I've ever seen",
        "Damn that’s the catch of the year ",
        "MedMen stock Moving up! Mike Tyson coming to Las Vegas MedMen in November.  Most Recognized name in the Marijuana Industry. Buy MMNFF stock!",
        "The run play was crispy and nice. Cool is nice !",
        "와......정말 대단한 경기였습니다. 올해의 경기후보에 손색없습니다. 세상에 바이킹스가 이렇게 잘 하다니...믿어지지가 않지만 현실입니다.",
        "Jefferson had a monster game! What an amazing player.",
        "15:04 - turkey calls.",
        "Seeing the last few seconds of Pat Peterson and the coach that’s what the games about",
        "As a Bills fan, all I have to say is congratulations and well played, Vikings. You guys deserved this.",
        "Dang, what a game",
        "Felt like a Super Bowl thriller!!!\nHelluva Game!!!",
        "This NFL game brought tears to my eyes incredible .its not over on till the Vikings say soo.",
        "@18:30 the bills had 12 guys on defense",
        "It's so nice to see a good defensive game for once. All of the stars shined on both sides of the ball instead one side. For the most part the referees keep there finger prints off the game and let the players decide the outcome.",
        "Hi all I just wanted to share something very important. If you don't have a relationship with Jesus Christ as your Lord, here is your sign to turn to Him!   This is the most important thing you'll ever hear in your life. Jesus is coming back soon! God sent His only Begotten Son into the world, that whosoever shall believe on Him shall not perish but have eternal life. Those who do not believe will be condemned. (John 3:16-18). Jesus died for our sins, and to set us free from our sins and condemnation (John 8:36, Acts 13:39). Jesus rose from the the grave 3 days later after His death, defeating death. He now lives forevermore, and seeing we have saving faith in Him,  we too will live eternally with Him! Jesus is the only way to Heaven (John 14:6). Following Him is the best decision to make in life. Though the Christian life isn't a life absent of difficulty, despite any circumstance Jesus gives true peace and fulfillment, a peace and fulfillment this world cannot give (John 14, John 16).",
        "Seeing jev this happy makes me wonder if we would be this happy if jev brought back Jevs cafe :(",
        "Absolutely incredible football.",
        "This might actually top the 2014 NFC Championship game ",
        "Best season to be a Vikings fans, instant chills with this game, s/o Josh Allen and the Bills!",
        "JJ catch > Beckham catch",
        "Game of the year 100%.\n\nAnother GREAT story to tell, Never give up from any chance.",
        "Probably the best game in the last 10 years",
        "This is going to be the game of the year. I don't see another one being better than this in 2022.\nThe best comment on this game came at the beginning of overtime from Vikings announcer Paul Allen.\n\"These men did their job today. They entertained us! No matter which team wins this day, they accomplished the ultimate goal of the NFL, to entertain you\"",
        "Vikings have lost to Dallas and Philly by a combined score of 64-10\nPretenders is an understatement",
        " hands down game of the year",
        "Thanks Vikings fans \n\nOne more like this and everyone’s gotta come back through here to get somewhere in January. Great game to watch  ",
        "I'm reminded of the BASEketball celebrations",
        "13:47 was jefferson’s one handed catch",
        "The fact i watche the whole 1h video says alot about this man he is so funny and entertaining big W",
        "Can we give a shout out to the commentators for this game. The absolute emotional put into this matches how everyone was reacting to the game. Props to them",
        "yes game of the year",
        "Justin Jefferson MVP.  Holy cow.  I cannot believe we won this game.  I am so happy to see Kirk Cousins throwing some incredible darts, Dalvin Cook break out like Adrian Peterson used to do and Justin Jefferson is like Randy Moss 2.0.  Our new tight end Hockinson may have been that last key piece we needed.  I really hope to see Vikings make it to the Superbowl once in my lifetime.  So many tragic losses in NFC Championship games and bad playoff runs.  Now that Packers, Lions and Bears are wayy out of the race and we beat all 3 of them.. This is Vikings year.. Eagles no longer undefeated so we are right up there with them although they are the only team to blow us out all year in game 2.  SKOL Vikings! ",
        "i need your help",
        "That catch by Jefferson on 4&18 and the fumble touchdown save the Vikings",
        "Josh Allen made 3 HUGE mistakes at the end of regulation and overtime.",
        "I've never watched a game and have it bring tears to my eyes by just how spectacular the effort and fight between both teams were. This..This... this was special.",
        "Wow!!",
        "One of the best games I’ve seen this year. Jefferson is becoming one of my favorite wrs in the league. I hope to see them in the SB.",
        "Just when I thought Diggs’ catch was crazy, then came JJ .. what a beast",
        "You can say that again",
        "im telling my son this was the super bowl gg",
        "As a Bills fan, nothing surprises me anymore when it comes to winning clutch games! Four straight Super Bowl losses, Music City Miracle, Chiefs playoff game, and now this, someone in the universe does not like us!",
        "Allen threw the game away TWICE. Insane",
        "How did JJ make that catch I am so happy that I got him in fantasy football",
        "Announcer says:. \"Seven dudes had a chance\", on a missed interception.\nJust sayin.",
        "I can't stop watching this! It's giving me similar vibes to the Minneapolis Miracle.",
        "The game would have been considered one of the greats of all time had it been the Super Bowl.",
        "cannot be game of the year still half the year to go..do better",
        "Justin Jefferson beast mode game",
        "6:07 peyton manning would have NOT tackled him... hes soft",
        "\"Game of the year\" = the team that should have won in regular time...but had to win in OT b/c the refs screwed up.\nI want my 20 minutes of my life back.",
        "I said silence!!!!!Bwahahahahahaha bwahahahahahaha ",
        "Justin Jefferson a damn monster. 1000 yards already only halfway through the season.",
        "It be like people be scared to hit people in the nfl they be trying to arm tackle"
    ],
    "comments_disabled": false
}