{"video_id": "fGLbWp0hHV8", "comments": ["The Thin line between love and hate ", "I love how Wayne tried to blame his cousin for bringing his assistant around   LOL", "Wayne's cousin thinking she could push the car out of the way had me cracking up!   ", "“I’m about to call me an Uber” “No you ain’t, you ain’t finna leave me here by myself” ", "I died every time Amber rolled up the window She must have a tracker on his car or phone.", "This is a new level and I'm loving it! Totally unexpected.  Waynes shaking is hilarious", "Wayne better change the locks at his house, up the security, change the code to the gate,  and tell the kids not to open the door for Amber no more.  I could see the fear in Wayne's eyes.", "Ambers sticking to her Promise, that smile tho!  Lynn Whitfield, Academy award", "Amber didn't even speak a word in this episode and I FELT EVERYTHING!!! Just chills up and down my spine! Felt like I was watching a horror flick!!!! LOL!!!!! I am so here for this Thin Line Between Love and Hate storyline!", "This whole skit is hilarious!!! \nKOUNTRY WAYNE PLEASE GIVE US A FEW RO & ANTHONY SKITS WITH DNA UPDATES", "Amber is such a GREAT actress she deliverers in every scene ", "The new version of, “ A thin line between love and hate” ", "Amber’s role is hilarious. She’s pretty, stylish, and she can play multiple emotions. Great cast, Wayne ", "Amber looking Crazy for real For Real! We thought Libby was bad, but nah. Amber wins the award for the most crazy character on this \nSkitcom ", "Amber's blank eye stares and Mona Lisa smile sending chills up the spine. With opening and closing the car window it is hilariously frightening. The Horror is about to begin!  ", "At this point, Wayne needs to call the cops  because he just made Amber his stalker", "When Wayne lost his temper I bout dropped my phone laughing he said \"that voice not really me\"", "Awe man, Wayne ain't never had one to cut up on him like this before after a break up. You see how Amber was slaying wardrobe, face beat for the Gods, hair done, nails done, everything done and didn't even say a word! The silence and eyes said it all. Well Wayne, you might want to hire some security now. She is really scorned and don't give a damn who knows how she feel about it! ", "Pure comedy  Amber out here with the Victorian blouse on looking like a crazy doll. Love it", "This was hilarious      . Amber put something on KWs mind.  It's a thin line between love and hate.  Wayne blaming the cousin for bringing Sarah around. Lol", "I like how he's showing what can happen when you play with people's emotions. ", "That  siren going off when Amber pulled up was perfect timing  Ring the alarm!", "This is a perfect example of why we shouldn’t ignore red flags!!! Great acting as always!", "Amber said she’s going to make sure that he won’t “EVER” do this to another woman again and she meant that with her soul. This was funny asf  Watch your back Wayne!!!", "The way Amber drove off in the end\nWayne said: why was she there? ", " This is the funniest skit yet. Amber played that part...she got Wayne concerned about his safety. Lol", "Amber ain’t “acting crazy” she is crazy! She is just showing her true colors", "The way Wayne through his cousin under the bus was hilarious. LOL", "Amber is ready for Hollywood with that performance ", "I Guess Aubrey Ain't The Only One Who Ain't Got A Hold On His Situation No More", "The way Amber kept putting the window up and down ", "AMBER acting like she doing a new  version of Snapped Wayne got terrified for a moment, bro you got to leave these fatal attraction women alone.", "\"I told you good luck in the beginning. I told you I know my cousin\"  Whitney is a trip ", "I love to see how Kountry Wayne got Amber acting in a different demeanor in this skit! She's quiet and she's not saying anything period! Kountry don't stop this yet in the upcoming skits Bruh! Amber is now playing another role in the skit MARVELOUS! Kountry looking forward for the next one! Remembered what Amber told Big K. the last time?", "It's a thin line between love & hate  Now Amber in crazy mode, great skit!", "I was damn near on the floor when Whitney said that she was about to call an Uber and Wayne snatched that phone from her real quick and said no the hell you ain't you ain't about to leave me out here by myself!\nIt sounds like he's scared of Amber!!\nL. M. A. O. ", "Amber rolled up the window a few times had me ", "Rolling up and blocking him in. Then looking crazy and not say a word while smiling. The silence is what had Wayne shook. Lmao", "Skit had me dying from beginning to end. Amber crazy asl ", "Mike hinted to us that Amber has a crazy past. I love how the cousin said to Amber I told you good luck.", "Why I gotta watch this skit EVERYDAY! LITERALLY BE LAUGHING MY BUTT OFF", "Wayne has waken Amber from Detroit up  I love it", "A thin line between love and hate. Wayne’s in trouble now ", "That yell.. all men can relate  that patience being tested ", "I started laughing when Wayne cousin tried to push the car like it was going to move.", "Wayne's vulnerability came through on this episode.  Good to finally see a bit more depth to Wayne bought the table  . Not forgetting this is comedy.", "The skit was great- They had Wayne showing his acting skills Amber on one for real", "Ha ha ha....Amber played that perfectly!!!  Didn't say a word but scared the heck out of them.  Whitney trying to push the car out of the way.   It ain't over, Wayne.", "I’m loving this Amber acting is on point…. It’s a thin line between love and hate…. Sing along Wayne…", "Man Wayne blaming Whitney choked me ", "It’s how Kountry Wayne’s hand shaking in fear as he put on his seat belt ", "Amber done went a thin line between love and hate crazy!!!", "Thin line between love and hate!!! ", "\"Amber...Amber stop playing!\" Amber is serious as HELL! ", "Ro is the only woman who broke Wayne’s heart for dealing with Mike. Amber did use Wayne for Mike. Wayne did tell Amber that he is not ready to be in relationship. Wayne didn’t say anything to Amber for her business with Mike and her new business partner. Now, she is in her feeling about Wayne is having business with his assistant Sarah. I can’t wait to see next skit.", "Wayne’s face of fear at towards the end ", "This has got to be one of the best skitz ever produced by Wayne and company loving it Plus the sirens in the background perfect ", "“Cuz you stuck out here in the wilderness with me!”  bruh Wayne is going to go through some hell in the next few episodes.", "Wayne said “ Why she wasn’t blinking?” ", "Amber is an awesome actress. Her versatility alone deserves an award.", "I need way more videos a day from this storyline  welcome to hell Wayne cause u just bought yourself a one way ticket messing with Amber ", "Wayne breathing like he just got done running a marathon….OMG", "I bust out laughing when cuz started pushing the car", "THIS is what I’ve been waiting for! ", "This was hilarious . Amber put something on KWs mind. It's a thin line between love and hate. Wayne blaming the cousin for bringing Sarah around. Lol", "Wayne is killing me with that labored breathing ", "I knew she was crazy I'm laughing so hard right now man she started it off crazy I knew the ending would have been crazy you better stay with Sarah", "Loved the fire engine symbolism too. Amber is on fire, she didn't want to recognize that she was the only one in the relationship...but when it was over, all she wanted to know if Sarah was the reason, catching the kiss took her over....Most people have another side and the right situation might take ya there...Amber it ain't worth it girl..but I have to admit KW'S reaction to this is just too funny!", "A Thin Line Between Love and Hate. We're going to see a future episode where Amber is wearing Wayne's face. ", "Now this one was funny.  I have not laughed at a skit in FOREVER but I laughed at this one.  Amber did that and Wayne was actually funny.  This was good.  I think this series with Amber and Wayne is gonna be a winner.", "Thought she was about to brick his windshield when she pulled up ", "The way she kept rolling the window up and down", "Wayne cousin tried to push the car had me weak", "Amber did great acting.  Got Wayne shook!!", "That hard pull off by Amber  she got Wayne worried", "I can’t wait for Mike to hear about this ", "This was hilarious. They way KW yelled then apologize for it then him with hard breathing at the end too funny", "That fire truck was perfectly timed. That’s some warning symbolism right there.", "I find myself not watching tv anymore just watching these skits lmao", "When the camera got up close to Wayne,  the line from \"A Thin Line Between Love And Hate\" :\n\"I gets no respect up in the precinct\"\npopped into my head ", "Can't wait to see how the story unfolds ", " I watched this like 5 times crying laughing", "Here she go playing CRAZY AS HELL!!! MIKE!! said they call her KRAZY! She is trying to have WAYNE lose his mind. The hell you ani’t leaving me out here by myself", "The word that Wayne should use is “SECURITY!!!!!!!!”", "2:54 and 3:02 Wayne is hilarious ", "I love the back and forth with Wayne and his cousin. They really played of each other well.", "The BEST EPISODE EVER!!!ROLLING IN LAUGHTER!!!", "LMAOOOOthis shit was GREAT  Amber got Wayne shook ", "THIS IS THE NEW VERSION OF A THIN LINE BETWEEN LOVE AND HATE ", "Wayne scared scared lol. Thin line between love and hate ", "Amber beeen crazy. All the flags were there. The way she delusionally latched onto Wayne no matter what he did or said.. I’ve been waiting on this version to show up lol", "I wasn't feeling well today n this sh!t had me in tears!!...funniest skit out...laughter good for the soul...lmao", "Before finishing watching this episode, 20 secs in, my guess is Wayne's house is on fire! LOL", "Damn Wayne, you done turned Amber into Lynn Whitfield in, “Thin Line Between Love & Hate”. Bwhaaaa ", "Oh my goodness lmao! I laughed as hard as I did when ole girl let out the crazy in a thin line,  Amber nailed this scene and so did b Wayne! ", "This skit was EVERYTHING!!!!!   Wayne might want to be careful, it's fixing to get real ugly , LMAO ", "Thin line between love and hate ", "Amber.... Thin line between love and hate. She did so good", "THIS IS GIVING ME \"IT'S A THIN LINE BETWEEN LOVE AND HATE\" VIBES . AMBER ALERT!! Amber have lost her mind y'all ", "Oh shit Amber crazy crazy I died when Wayne started yelling then going say I’m sorry I didn’t mean to talk like that "]}