{
    "video_id": "g5JSVxP2bHM",
    "comments": [
        "You should try Warren Buffett’s diet lol",
        "Says it ain't tough while he has sweat down dripping down him",
        "You wont do the carolina reaper tho",
        "What do you expect?? Matt is the King!",
        "How have you not drinking milk yet I would be dying",
        "Should sprinkle some extra pure capsaicin extract on top of it (16 mil SHU)",
        "Yeah after a few minutes it mellows out so the one hour isn’t even that bad",
        "I'm more surprised the chip actually came whole and not in pieces. XD",
        "How the hell do you have 16 MILLION Subs and this is the first time I am seeing you @ MattStonie Youtube ain't doing you right!",
        "Matt,\nBro.  YOU'RE A BEAST!!! ",
        "2:07 tears rolling down his face, snot inevitably running down his nose. but he's still going strong. Damn 16m let's goooo, honesty forgot how many it was last time i paid attention but it couldn't have been more than 5m lol. hopefully that means the views are exponentially higher these days too let's get that bag",
        "He can handle the one chip challenge impressive! Congrats for 16 million you deserve it",
        "Rec lol I'd do it wit you lmk real James a good",
        "Ngl bit sus eating something called creamies and is white",
        "Gigachad activate!",
        "love the shirt",
        "I knew this had to be clickbait. I have a very high tolerance for super hot spicy pepper products and even I thought it was kind of spicy. It was obvious that it was spicy to you, you just happen to handle it very well, a lot better than the average person would have:-) most average people would fail the challenge very quickly, and the minority of average people would have just suffered a bit more than you did in this video. I do have to be honest and say that I am shocked that for someone who doesn't claim to consume super hot spicy pepper products everyday, I am very impressed by how easily and well you handle this. Good job bro:-) ",
        "2 hours after eating the chip i threw up twice and my body literally started oversweating",
        "At the end is the first time I’ve seen you eat something slow.",
        "matt can eat 100pcs paqui,\ni support him, he is GOAT!\nmy idol ️\nhe has 10 different stomach inside",
        "Chad Stonie is a legend",
        "I used to watch all your videos. Not sure why I stopped. But I’m back watching now!",
        "Make nachos out of one chip challenge if it’s so easy.",
        "you the goat bro",
        "Congrats on 16 mil Matt!",
        "THE ONE CHIP. THE ONE CHIP IS REEAALL!",
        "You should try and eat an entire pone/cast iron skillet of cornbread. Or maybe see how fast you can eat a sleeve of saltine crackers",
        "I need food",
        "0:12 you have different eye colour , just an observation.",
        "Do the covid-19 challenge, just to show all the little sheep",
        "For me after 30 minutes I got bored and drank a beer, smoked a cig and put a pizza in the oven (all bad choices for how the gut reacts the next day) I told a short story among excess snot and saliva. Going 1 hour would of been empty space BS. I did have reactions that I quantified and stupid hiccups interrupting.\nWould do it again if I could with friends.",
        "Mane I tried it nd did not make it",
        "Don't do it!! THAT'S STRONG!!!",
        "Hot ones, when?",
        "Matt Stonie should try another spicy challenge",
        "I’ve done the one chip challenge before and can confirm that it’s hotter on the way out then going in",
        "The bad part is it going through and coming out.",
        "How are you doing man? Are you sleeping well? You look tired with your eyebags and all.",
        "Ballz of stonie!!!",
        "i did this in economics class and threw up for 15 mins in the bathroom and almost missed my 3rd period",
        "I done it it was painful",
        "Aw man! Look at his shirt. Matt is also a One Piece fan ",
        "Matt your  sweating",
        "His mom is so sweet. Love her.",
        "Bro I only took a small little corner off of it and I was crying",
        "This is chip is way overrated try the Caroline reaper jerky here in my town looooooool shit on the chip",
        "The spice wasn’t that bad. It was the waves of nausea that followed. I wanted to see that part lmao",
        "I did this challenge and the only thing was my mouth watered. Someone else in my family did it and choked and started sweating.",
        "Siuuuuuuuuuuuuuuuuuuuu",
        "Isn’t there a dude who ate like 20 of these?? ",
        "Bruh didn’t even Ben tell his mom he loved her",
        "Matt your  gum are turning  blue and  your tongue are  also blue",
        "This guy is insane ",
        "yeah that was it",
        "Ive always watch your videos no complain :)",
        "I did it too and was kinda dissapointed",
        "Props to matt took it like a champ. I only lasted 3 minutes without milk or anything",
        "I love your shirt",
        "This is how you Marinate your Stomach guys.",
        "Eat 2 now",
        "Out of all the shit you do, the one chip challenge had your mum scared!? ",
        "Man you destroyed that one chip challenge like if was nothing. Keep it up ️ you the best ",
        "I don’t know how you do that. It’s so fucking hot. ",
        "I went 3 hours and 30 minutes before I drank anything. The stomach pain afterwards was the worst part of the challenge.",
        "Bro I want to do that with you one day",
        "So easy for him that his accent turns into the southern accent 4:04",
        "Congrats Matt stonie for hitting 16million",
        "Someone did that in my class. He ran out lol.",
        "I can see Matt Stonie in a Jackass movie",
        "Matt Stonie!!!!! That's what's up bro.  No complaining etc wahoooooo",
        "since when did matt have a blue and a brown eye",
        "Lol.. his pride saying it's not hot.. but I promise his hand shaking means it's doing something to his body",
        "It's easy for an Asian to say that...",
        "He gained 16 years in 16 minutes.",
        "I like mom's little \"YAY!\" ",
        "I just did this and it really wasnt that bad. I had someone pay me to eat this hot sauce once and that shit burned for way way longer. this is was pretty intense but didnt last long. I could probably eat 4 or 5 of them",
        "Anounce your tournaments and put them on live for us to watch your tournaments you go to prepare us on what date so we will know",
        "Matt needs to do Hot Ones.",
        "The struggle is real",
        "Apparently under 2 million Scoville units isn’t spicy according to the title. Guys a madman ",
        "dude wat the hel to not complain u dont need to talk.its about the reaction",
        "Great ! No problem! Easy peasey",
        "Out of all the challenges Matt has done, his mom is worried about the one chip challenge",
        "I am gonna support you nkw",
        "Said it was not spicy when he litrally has runny nose and crying nearly",
        "Se estaba quejando desde el primer segundo!",
        "it wasn't really that bad tears and buggers coming out his nose",
        "I one time did the one chip challenge drunk and survived it just for me to throw up and feel it all over again ",
        "He put a fake chip in there",
        "ive had this before and he is just good at spicy stuff, i fricking died",
        "He sweating to much",
        "The one piece t-shirt ",
        "Fame done made you lazy G",
        "Me and my friends did this in school",
        "Hey matt do nepali momo challenge",
        "Did this challenge as well. The worst part was literally the bathroom afterwards. That’s a whole different type of pain ",
        "Mans wearing red haired pirates merch fellow nakama da",
        "the chip hurts for the first 3 minutes, then it does nothing till it hits and starts doing shit in ur stomach, then itll settle down and itll hurt again when it comes out. Thats it. OVer hyped chip lmao",
        "I ate 2 one chip challenges in 1 serving one time right when the edibles I took were kicking in. Not a big deal, just some endorphins and a spicy shit the next day",
        "FINALLY HAHAHAHAAHAH",
        "I ate a third of a chip and almost died…",
        "Damn wtf when did he get to 16 mil  I thought he just hit 10 mil recently",
        "Congratulations on 16millon! BTW thanks for 134 subs! We gained 14 subs today!!you are crazy btw",
        "You eat food for a living bro of course it’s not hot any body with a brain  understands that ",
        "“I feel pretty good” bags under his eyes",
        "Congrats on the 16 million Matt , and way to go on winning the one chip challenge keep it up love your channel",
        "The bst part of the video was Matt's mother's \"Yaaayyyyy\"",
        "Matt no offense but u have a low tolerance to spice n we all kno this ",
        "My God 16 million people lol",
        "️ =  Have a nice day buddy!!",
        "Matt Stonie is a true fire dragon ",
        "I ate one and threw up twice",
        "You’re eyes are so beautiful ",
        "Chilis/peppers: our spice defense is unbreakable.\nUs: yummy",
        "This shit is spicy af my auntie ate the whole and started crying and shaking",
        "A lie ? I was on the shitter for two days",
        "true it’s not that spicy first it’s a little burn and then nothing but i do like how it turns my tongue blue",
        "I think whining is the same as complaining",
        "When he realized he just f#ck#d up",
        "I have a friend who did the Ghost Pepper Wing Challenge at Buffalo Wild Wings. He told me about how he went to the bathroom but forgot to rinse his hands off before peeing, and...  well, I'll let you fill in the blanks there. We all had a good laugh about it though.",
        "Matt stonie is a one piece fan! \nRed haired pirates",
        "His mom should have spanked him for being disobedient ",
        "Just because its not hot to you doesn't mean it's not hot for others",
        "Its not spicy but you're sweating, shaking and breathing like it's hot, just because you aren't screaming doesn't mean it ain't hot.",
        "There's a video of a guy who ate 26 of them like it was nothing.",
        "Stonie callin out Chesnut!! haha  i love it",
        "Bro just went for it without any sponsors or shout outs  ",
        "matt is like a stone but dayyuumm hewas about to lose his cool xD",
        "16M",
        "lovely",
        "Try the bomb beyond insanity hot sauce",
        "Salty popcorn",
        "It really it’s my bad at all the other one was worst then this new one I didn’t drink anything or eat anything for like an hour and I was still fine",
        "do with the saudi arabia sauce",
        "Deserved, congrats!",
        "Matt, can you do the 8 pop tarts in under a minute challenge?",
        "congo brother i watch your videos form 1M",
        "I ate the whole chip and I almost died I was standing over a trash can for 40 minutes spewing mucus & saliva. Then later I had horrible horrible stomach pain",
        "Now just eat 2",
        "I think a lifetime of eating spicy food has made these type of gimmicks boring to me ️ I tried it and I agree that it’s not bad at all.",
        "Random question brotha but what headband do you wear? Lol",
        "That's the fastest intro of matt stonie damn..",
        "I'm lactose intolerant I don't even have the option to soothe the pain",
        "Is it hot though?",
        "Being a competitive eater, I think Matt can related to his mom when she was pregnant with him",
        "My entire team did it and it was not an issue at all sadly",
        "Been here for 3 years? Dude I remember being at least 12 on a school night watching you down a happy meal now I’m 20 lmao",
        "fighting an opponent and saying you weren't as strong as i expected, what a let down. \nthis is not complaining, this a victory belch. gg stonie",
        "keep it real mane",
        "My mans calmly dying from the inside out from that devil chip ",
        "Congrats on 16 million subscribers! I never knew you would hit this goal. Congrats!",
        "Wasn't even that hot....*proceeds to eat ice cream*",
        "Tube of terror challenge!!!!!",
        "just wanna say nice red hair pirates shirt",
        "He is holding back his tears",
        "Matt’s eyes would beg to differ ",
        "OMGRespekt",
        "The problem is not when comes in...\nIs when comes out...",
        "No it's not a kid brang it to my school and kids almost died, one threw up, 2 got it in there eye, and everybody was asking for an extra milk",
        "jackass intro",
        "For some reason your face looks a little deepfake like in this vid",
        "How Nice",
        " you’re welcome",
        "Imagine he forgot turn on the camera",
        "One chip challenge but an entire bowl of chips and 3 minuet afterburn",
        "It's a survival challenge",
        "im on my brother account but ive been watchin you for a while ike your so cool",
        "ive got a complaint about that backsplash tile",
        "Just say you mad because you ain’t get the views from the chip ",
        "You can eat Carolina reaper???",
        "Gangster",
        "You should try plutonium nine it’s like 16 million scoville units",
        "Just because it's easy for you don't mean it wont SERIOUSLY hurt someone else!",
        "That tasted disquisting….. that complaining",
        "clickbait",
        "Korean fried chicken next",
        "try one wheel of parmesan challange",
        "Matt proves why he deserves 16 million subscribers respect u bro ️",
        "I wanna challenge someone",
        "I love how matt ages from the beginning of the video to the end of the spicy challenges. lol",
        "do a challenge of eating every spicy food from takeaways and restraunts",
        "next challenge will be 20 one chips",
        "Good job on the challenge matt keep the good work on the videos",
        "You need to do the Death Nut Challenge, Matt. 5 stages, you can't drink anything between stages, stage 5 is 16,000,000 scoville units, pure suffering.",
        "Nice One Piece shirt!!",
        "unhuman",
        "Patiently waiting for Matt to start uploading good videos again.",
        "Go to beat a world record Nic'Nacs",
        "My mouth writes checks my stomach can't cash anymore. I didn't think the chip was that hot, it does make you uncomfortable and numbs your tongue, but I didn't think it was the hottest thing I've ever had. You can taste the capsaicin crystals, artificially hot not natural. Couldn't taste the reaper. Anywho, I puked like 30 mins later my stomach started to burn, felt like I had the runs and puked in the restroom.",
        "Better then a giggachad",
        "that chip is no joke man, i lasted just about from the time i put the chip in my mouth until i made it to the fridge instantly after before losing ",
        "You should've challenged Beard Meets Food and Randy Santel to eat the chip.",
        "This man is  Beast master",
        "It going into your body was less painful than it coming out lol",
        "MATT WATCHES ONE PIECE",
        "I like tha confidence, n he even wearing red haired pirates shirt. He def got conqueror’s haki",
        "Red Haired Shanks tee !! One Piece Supremacy !!",
        "Challenge idea: How many pounds of beef cheeks can you eat in one sitting?",
        "Heard it tastes bad and isn't all that spicy, just tears up your gut and intestines.",
        "Eating something that is 2 million scoville units isn’t gonna be that spicy but will be extremely painful in the bathroom",
        "This guys the best at speedeating and eating spicy foods what a guy",
        "I just love Matt introduced himself like Johnny Knoxville lmao",
        "Never noticed your eyes were different colors",
        "The tongue isn't as blue as I normally see it",
        "The jackass noise made it ",
        "This is crazy! I almost started crying when I ate an 8th of the chip ",
        "O cara virou o zóio",
        "Pyro pit bull is a monster!",
        "Does Matt have 2 diffrent eye colors?",
        "The segment where you’re talking to your mom. ️. Wholesome ",
        "Congratulations man you are a true food champion ",
        "I did it it’s hot  I colder mine off in the freezer though lol",
        "if it's a lie and not spicy then why was there milk, ice cream and ice cream sandwiches off to the side and if it wasn't spicy why not eat 20-30 of them instead of just one",
        "longest 6 minutes of hs life",
        "Is this the same kitchen? I havent been here for years man glad youre so big now!",
        "im with matt...it was no biggie, of course i've also been challenged to eat a habanero pepper alone, reaper by itself, but in reality this chip is not really that bad. what you need to try is a hot wing made with Blairs 3am. my normal hot sauce is blairs ultra death and no one in my family dares to even try it, esp after my cousin barely survived eating a burger with blairs afterdeath, which is 2 grades lower than ultra death. still...good job Matt",
        "Our school offered us to do the 1 chip challenge",
        "We all know damn well he cappin",
        "These Youtubers buy fake ones on Ebay that are NOT that spicy",
        "why would you split the clip literaly the second before you eat it lol makes it seem fake",
        "I knew this title was gonna be click bait.",
        "If aliens come to earth and ask for our leader I’ll just show them Matt stonie videos",
        "Mom's are smart. Don't do the Paqui one chip challenge. At least don't encourage or embolden children to do it. It is intensely painful to the majority of people Matt.",
        "There’s a guy on YouTube who ate 25 of these in one sitting",
        "HE GOT THE STOMACH OF THE GAADDDDDSSSSSS",
        "16M Subs let's go Matt!!",
        "it seems like not spicy enough for you man. your the man.",
        "I watched another YouTuber eat 25 of these in one sitting…..",
        "Congrats on 16m",
        "Bathroom be like: not again",
        "jo its great that u directly started with the challenge",
        "I love you Matttttt!!!",
        "Shoutout to matt wearing the one piece x uniqlo collection.",
        "Good on you Matt",
        "Matt is still so fun to watch even after all those years of eating lol",
        "sighing is a form of complaining so you failed",
        "That Jackass intro is preparing us that he's about to do something stupid.. Brave but stupid.. Good work Matt.",
        "Congratulations on 16M! My mom warned me about the cinnamon challenge.. ",
        "Madres xd esto no es nada comparado a lo que sufrieron los de chidee tv",
        "Do 10!",
        "Bro didn’t even have a long intro he just got into it ",
        "Let’s  just appreciate that he went through that to entertain us",
        "I did the chip. And I felt that head swelling thing he talked about. I almost felt a euphoric high from the chip. But the mouth pain went away after like 30 minutes. The worst part when it first hit my stomach. It was the worst pain of my entire life. It lasted maybe an hour and a half. Either he’s leaving that part out. Or… hes just a tank.",
        "Dude was dead the whole time",
        "My friend brought it to school I ate like half of it and it wasn’t even bad the pain stopped after 5 minutes",
        " mom always happies for me",
        "i feel powerful \n\nliterally crying ",
        "Okay but literally tho if you want the one chip to be almost nothing to you just build your tolerance and it’s actually pretty cool how you can turn a one chip into sum that taste like a hot Cheeto",
        "Matt you are a samsung fan 🥹",
        "Try Jolo chip",
        "The Japanese noodles black pack is painful and worse than this",
        "Happy 16 idolo",
        "No Brewstew would disagree it destroyed his intestines. It’s the aftermath that’s the worst!",
        "and he stood their UNFAZED !!!",
        "I had the one chip from 2020, that chip was crazy hot, I had the 2022 that you had, it really wasn't that bad. I mean it was spicy. but nothing like the 2020 I had.",
        "Bro u crazy.",
        "This Chánel bro",
        "The single tear was priceless.",
        "Let’s go to 20M  let’s goooo guys",
        "Leaving Ethan and Randy alive, guarantees an imposter win.",
        "Challenge = Desafio\nMúsica do zóio no início\n\nHmmmmmmmmmm... Hardicore garaio?",
        "You should collaborate with Erictheelectric",
        "Stonies mum so cute",
        "Are his eyes different colors?",
        "The absolute worst part for me was the aftermath after you've already ate the chip my stomach was on nd off in pain nd the plus side for the burn was probably bcz I didn't really have anything in my stomach.",
        "Should do new segment of \"what happens after\" whenever u do one of these CRAZY challenges hahah",
        "Like a boss! ",
        "if You could Ask Jane Goodall Any Question What would it Be?",
        "The ONE CHIP IS REAL!!!",
        "No you have to eat the red one the red one is spicy!!",
        "I tried it bro and the was so spicy bro what he’ll",
        "If it wasn't spicy then why were you crying and if it wasn't spicy eat another one",
        "I've tried it. Its hot as hell",
        "ISHOWLEAKED, this stream changed my life. My entire view of everything that exist in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience. :-O 8-)",
        "The discipline Matt has",
        "Not tough?\nyou eyes were supperrr red\nyou lips was swollen \nand you started to cry ",
        "Brah was crying within",
        "Good job ",
        "As a competitive eater I want to see you chow down 10 chips lol.",
        "\" Hi... What do you want?\"\nMe: Finally someone really cold calls their mother without telling her first. Thats a real reaction lmao",
        "That was a tough vid. Good job my dude",
        "Congrats on 16 million Matt. Hope you get 16 million more. I could never do this. My mouth would burn like a MF. And so would the rest of me. You’re a lot stronger than I am.",
        "Try malaysian Mamee deabak coraline reaper next Mat Stonie",
        "Matt Stonie could probably say \"I could eat a whole bag of these\" but this time actually do it",
        "THIS CHALLENGE WAS SPICY!!!!!!!!!!!!!!!",
        "Congrats on 16mill!!",
        "Well that was Good, But is it possible to do the hot one's wing challenge.",
        "Your mom is golden! :D",
        "Always impressive! ",
        "I was thinking about it ️️ the bathroom",
        "Should have done 6 chips for 16 million ",
        "You should’ve done 16 chip challenge",
        "I did my first ever challenge this week! It was 12 wings at 1 million scoville units. Finished in under 4:40, got them for free but it wasn’t worth it! ",
        "Give away bro on your 16m \n🇳🇵",
        "dang, that's impressive. I have occ, I still haven't done it yet, i'm trying to build tolerance first. Thai chili's it is for me for now",
        "eat a huge tub of pepperoncinis next!",
        "Jolo chip",
        "When he said his head is swelling is actually considered complaining to me!!!",
        "Oh yeah. I ate like really hot habanero tortilla chips 2 days ago and i was like wow thats not so spicy? But than at the night, oh boy xD",
        "Clearly it’s spicy to you I can see",
        "Or cook adobo with 5 bowl of rice challenge eat a whole pot of adobo you can choose what you like bro pork or chicken and the rice in just 30 minutes",
        "Unlike this I cried like grass in the morning and drank half and half until the taste went away. Twas a dirt flavored chip.",
        "Doesn’t say I love you to mum?",
        "i literally just did this challenge bro this man is a god",
        "Bro is chewing ice cream like bubble gum",
        "Had a friend eat this 0 reaction and then asked if it was blueberry flavor. Meanwhile the other 4 that did it with him all were down for the whole weekend!",
        "Eat cheese",
        "I've been asking for him to finish the pocky challenge since forever ",
        "One of my most favorite channels. Always get excited when I see a new video",
        "It will be too me I can’t handle the least bit of spice allergic to pepper, barbecue chips anything spicy",
        "I did it and some of the powder got in my eye and I was blind for like 10 minutes",
        "\"This is easy\" as snot is runnimg down your nostril ",
        "1:38 was most definitely complaining",
        "Now you just have to do the Death Nut challenge 3.0, only like 16 million Scoville units ;)",
        "ideryouto\nEt1000",
        "Aw I was hoping you were gonna eat like 16 paqui chips…\n\n\nLol congrats on the 16 mil Matt",
        "He should have did more than 1",
        "Soo haat ",
        "It really wasn’t too spicy honestly. For it to be a viral challenge I was underwhelmed",
        "You handled it better than Shawn evans",
        "W SHANKS CREW SHIRT",
        "Bathroom later is like when you robber the bank with color bombs",
        "I tried it today it stings n is hot by people where being dramatic about it",
        "You can tell he was struggling lol",
        "Love your dedication. Dunno why TF I wasn't yet subscribed, but I sure am after this badass video! ",
        "My friend today tried the one chip challenge and started dying after eating the chip like after a few seconds.",
        "Matt)on the phone with his mom telling her he just did the one chip challenge.\nHer) you survived🫤 He’s on the phone with you duhh",
        "can you do 10 chip challenge???",
        "Matt Stonie: Removes Jacket\n\nMe: I'm not gonna bang you.",
        "I've been a fan since the days when Morgan was your cameraman and would encourage you throughout the videos. Congrats!",
        "Only Matt can go 16 mins without complaining after eating the spieciest chip in the world, man u are so brave ",
        "For a guy who doesn't like spicy foods, you handle spicy foods far greater than the average human.",
        "I want that shirt, though. Where do you get it? ",
        "The music in the beginning",
        "Broo it IS tough.. you are just more of a Chad",
        "His mom saying yay is so wholesome ",
        "he started crying   man",
        "Bro he is All ready dead",
        "no gloves matt?",
        "Nice work! Believe in Jesus God to be saved",
        "bro him eating that chip is fuckin childs play compared to the bottle of da bomb he ate. i still cant believe he did that. he didnt know the evils in that bottle that innocent poor soul ",
        "Wasn't the my head feels like this comment a complaint?",
        "As someone who ate one of those just to try the flavor, it's definitely spicy as all heck, but it tastes like stale carpet and smells like gummy worms with lots of added chemicals.",
        "It’s not too bad tbh I ate a few of them they’ll kick for a few minutes then it just fades away",
        "Congrats! Matt Stonie for reaching 16M. I'm still your subscriber since 2016.  You never let your fans disappointed, you always makes us HAPPY ALL THE TIME BY WATCHING YOUR COOL VIDEOS ",
        "Congrats on 16 million Subs ",
        "“Not spicy” \n\n“DONT DO THIS CHALLENGE”",
        "Please don't ruin yourself like that..",
        "You really are a Chad! ",
        "Please do a hot wing wit H hot sauce\nChallenge",
        "Brave Man",
        "This is actually insane. I've done the last two years of the challange and been eating hot shit my whole life but this year the chip was actually insane. I tried the chip and couldn't even chew it, spit it out and was in pain for at least 10 minutes. You are a beast",
        "Your mom is great.",
        "Try plutonium nine it’s hot",
        "red haired piratesssbro watches one piece",
        "Daam he is really starting to look old",
        "Wholesome",
        "This man lying he know it's spicy.",
        "bro is built diffrent i ate the ghost reaper once i nearly died and it was 1.4m scoville\nbig respect from me bruv",
        "Try another chip after 6 minutes",
        "One? do atleast 16 to celebrate 16m subs wtf.",
        "I drank a whole gallon of milk after the 1 chip challenge  it burned when I breathed and drank...(I'll do the one chip challenge at 1k subs )",
        "Him forcing me to try everything he tries",
        "2:48 I Be with ya and Congrats on the 16,000",
        "Title: The chip was a lie\nMe: watching the video and him struggling to not burst.",
        "I like the red-haired pirates shirt",
        "I did the one chip challenge on stream myself.  Biggest mistkae I made was taking a piss without washing my hands.  Now THAT was a challenge.",
        "Matt Stonie’s face tho after that chip!",
        "Nah Matt you're really a beast for that",
        "When ghost pepper became a thing way back, someone at my high school brought a massive bag of them in. Naturally, I bought a couple and my friend and I tried it in art class. I ate nearly the whole thing and my friend only took a nibble out of it, we were both in pain, but she copped out",
        "I have one laying around and you inspired me to do it. I am ten minutes in and it is not nearly as spicy as I thought.",
        "Love the intro music + Title",
        "Congrats on 16 million subs matt! ️\nMEGA TOAD THE G.O.A.T",
        "Most people suffer in agony from eating this chip but the chip suffers in agony  when Matt eats it \n#TheChuckNorrisofFood",
        "Dmc nero voice :no chit-chat or monolog just getting straight to the point\nDude just started the vid then just fuck it i will just eat it and done with it xD",
        "I just noticed that he’s a one piece fan  \n(From his shirt if you’re wondering)",
        "\"Wasn't that tough of a challenge\" tear rolls down his face LOL jk congrats on the 16milly lets gooo",
        "Didn't even tell his mom he loved her when he hung up smh...\n\nUNSUBSCRIBED",
        "This was nothing compared to those chicken tenders",
        "What is the goal of your videos ?",
        "i did push the like button just for the Red-Haired Pirates shirt :D",
        "You nailed it matt you're the strongest one who surpassed more this challenge.",
        "The mini celebration from Mom made the whole video for me ",
        "You're awesome",
        "dude ate 61 of these for a wr…",
        "At my school I heard that a kid did the one chip challenge and had to go to the Nurse and I also heard that he was crying so yeah",
        "I tried  that shit I feel the blu 1 is hotter the the 1st 1",
        "Well done",
        "Broooooooooo u got me with the JACKASS intro so niceee",
        "Now do 16 chips in 1 minute",
        "The lies I did this challenge with my son and I only did a piece of the chip and almost died  and my son start throwing up nope  lol the tears in your eyes and snot is telling me something different ",
        "This is not a lie someone gave one to a kid with Down syndrome and he was flipping out all day",
        "Hi Matt, can you do a durian challenge?",
        "I did this challenge last and I was drinking milk with 15 seconds ",
        "bro vented instead of complained",
        "do DA BOMB hot sauce",
        "The one chip challange isnt spicy its just too tasty i cry",
        "Aa Chuck McGill said: \"You're not complaining, you're observing.\"",
        "May Bobes rest in peace . Thank you for your lineup guides, they have really helped me in clutch situations keep up the amazing content!! You will soon reach a new significant milestone of 100k and 1M subs :o <3",
        "Are you the person who eat a lot of spicy stuff",
        "i'm afraid matt is indestructible....the pure look of dead in his eyes just standing there pushing through is insane.\nthere is actually nothing he can't do",
        "Haha your mum is adorable! Smashed it as always Stonie!",
        "The one chip!!!",
        "Mom's always thinks we gonna die from something that's not serious or less of a threat",
        "When he said “The pain is there, I’m just too much of a Chad” i lost it ",
        "How old is Matt? I always thought he was like. 28 but those close ups on his face tell me he’s older than I thought.",
        "Ayyy mah boii Matt with the 16 million subs! Congrats!",
        "Try 10 of them big boy  ",
        "Calling your mom was so sweet of you, Matt! Congrats on 16M, been a fan way before that and im so proud of what you've accomplished!",
        "16m :o",
        "“Not spicy”\n\nAlso him: crying",
        "Loved the Jackass into music.. such memories.. ",
        "i've tried it before, super spicy. i was feeling like i was dying bro",
        "That One Piece shirt is fire tho ",
        "Haiiyaa walaaweyy.... So spicy ",
        "bro, this is rad, but where did you get the shirt? <3",
        "We tried it at work, it was horrible.",
        "now eat a whole bag worth",
        "Bro probably got the expired one",
        "Dude, I did this challenge yesterday; my stomach still hurting and I found out that it hurts when it comes out the other side . I lasted 10 secs before I needed water/milk/toothpaste/eggnog etc .",
        "I would have stopped the timer a soon as he took of his sweater. That's complaining imo",
        "Matt lucked his fingers and said it was disgusting, does that count as complaining or not I just found it funny ",
        "get the guinness world record of eating the most \"once chip challenge\" chips !!!",
        "I did it, it was hot, but not too bad until the punch in the gut.",
        "Popcorn challenge when",
        "hello Matt watching from the Philippines",
        "Why would people say not to do the one chip challenge?? It's like... been around forever already?",
        "With the upper echelon of spicy food, I find there's a limit to the mouth burn. The stomach burn however......",
        "I regularly eat spicey food but that 1 chip almost killed me lol",
        "you licked your finger and said its disgusting! thats complaining lol.. challenge failed;-) but props anyway brov! i couldn’t do it!! nicely done,, seen people cry going nuts drinking milk and died giggle.. keep up the good work! 100%",
        "Crazy how much you've aged since I first started watching you lol",
        "your mom are so supporting",
        "I seen this dude eat twenty one of those things",
        "Bro your a giga chad i love you",
        "You should be on Hot Ones!!",
        "Does he have different colored eyes?",
        "I did this recently and it was pretty brutal. I made it a little over 10 minutes. ",
        "Matt \"Im feeling good\" nose and eyes drip, face red",
        "happy 16mil subs Matt ",
        "They gotta get you on Hot Ones my guyy",
        "That Jackass intro was based",
        "No complaints???\n\nI lost the challenge already and I wasn't even playing.",
        "Nice Shirt Matt THE ONE PIECE IS REALLLLL",
        "Yessssss I've been waiting on this!",
        "lie? EXPLAIN HOW IT IS A LIE?\ngreat no complain challenge bro",
        "I did the challenge and I was not really complaining about the spice, it was the taste and it made me throw uo",
        "Wow good. Job",
        "Ahh say hut Tay uhh = start the timer.",
        "Yay",
        "Eat 2 1KG jars of peanut butter, that would be crazy!",
        "My guy is wearing shanks flag on shirt  \nWhat a g!!",
        "Matt in the title:  Not spicy!\nMatt’s face:",
        "Did you have a drooling problem from it like I did?",
        "Next challenge: How many “one chip” chips can Matt eat in 16 minutes?",
        "You got the weak sauce one.  Not the one from year 1. They don't want to get sued",
        "Matt, Is a great eater of spicy foods. And when I tried the budac noddles it was hot as heck.",
        "love you stonie",
        "Congratulations Matt! You made it to 16MIL!!!",
        "Kinda sad how overhyped the one-chip challenge is considering packs of ramen hit you harder than this",
        "I only just noticed how cool Matt’s eyes are :0",
        "He said the numbers are whatever.  so we’re just numbers now ",
        "Thank you Jesus . $ 14,000 weekly profit Our lord Jesus have lifted up my Life !!!",
        "someone call the plumber cause his toilet gonna need fixing",
        "i did it in school like a month ago and it kept the spice for like 20 minutes, also before it gets spicy it tastes like a stale, expired tortilla chip with stale expired dark chocolate syrup. it tasted bad trust me",
        "Man, you are tough",
        "amazing that he has more than speed",
        "\"more than whatever i couldve thoughten\"",
        "I’m a young kid and I did it and ate it all",
        "the true spice no reaction king. lukedidthat should take some notes",
        "Now tube of terror!!!!!!!",
        "Building up that spice tolerance",
        "The views and engagement will never be the same but aye we day ones here shout me out to start my growth’s",
        "",
        "This is boring sounds like a compliant for me lol",
        "I split half with a buddy and it wasn't too too bad. You handled it way better than me bud",
        "Wow that one chip looks so dark and spicy ",
        "yeah it might be a lie to u but ik my mouth was on 10",
        "love the shirt :)",
        "Spicy is 1:41 This that complaining? Lol",
        "Cool video, I also just did the challenge about two weeks ago. The heat was nice, I went about 30 mins. It tore my stomach to shreds I was in intense pain for about 3 hours throwing up till I cleared my stomach. Was really fuckin' awful. Glad it didn't happen to you.",
        "Ohh mann look at his eyes... Dudee!",
        "I love how when Mat looks at H0027 he shows how it stole files yet completly glosses over how it killed 11 employees in the same paragraph.",
        "Eat Indian aalo ka paratha very tasty and heavy",
        "I ate it to raise money for a mission trip, I was curling up on the floor in my churches lobby with people just staring at me, that was an awful night",
        "you need the original not the blue one.",
        "I need a 1 hour video of you eating it with no drink.",
        "sheesh u gonna feel that burn for 10 days",
        "I ate it with my friends and we are under the age of 13",
        "He’s different",
        "Finally",
        "️️",
        "His plumber must be rolling in dough from his house.",
        "Love your videos on day ima be famous and we're gonna do a video together. Congrats on 16 mill too",
        "His Toilet:",
        "Damn! 16 million. \nYou need to re-visit the michael phelps challenge.",
        "This puts all spice \"kings\" on notice.",
        "Damn Stonie you the BOMB!",
        "BROOO HIS JHAWLINE WTFFFF",
        "I got one im gonna eat tomorrow. I already ate one. It was alright.",
        "Boooooooo he said IT TASTED DISGUSTING that IS complaining wtffff"
    ],
    "comments_disabled": false
}