{"video_id": "g5JSVxP2bHM", "comments": ["The bathroom later was more of a challenge... ", "If anything Matt has eaten so many foods that were spicy on such high levels that I'm already convinced that he is strong enough to beat this challenge", "Imagine if PAQUI decided to make an entire bag filled with these chips.", "Matt's mom saying \"YAAAAY! :D\" was the cutest thing ever.", "Matt had no life in his eyes during that entire challenge until he called his mom ", "Love how his mom was sounding “cool” when Matt told her he ate the one chip and didn’t seem frustrated or sad for him ", "When he said “The pain is there, I’m just too much of a Chad” i lost it ", "When Matt’s mom said “yayyyyy” that was so adorable is mom sounds so nice ️", "Best to tell mom you love her while you're doing a challenge like that... Or just always before you say goodbye on the phone.  You're a beast man!", "This is the real challenge, not just eat and swallow it then act tough, like \"no reaction\". Love you Matt <3", "Matt has such a pure personality on camera, you know he’s fun at the parties", "The chip coming out whole and the way he ate it was so satisfying", "Handled like a champ! Congrats on 16 mil dude!", "you’re mouth is saying one thing but your face says another MattI loved this! lol", "Matt proves why he deserves 16 million subscribers respect u bro ️", "Every time I get full and there’s food on the table, I say, “For Matt Stonie” and I finish it, despite how full I am.", "Props to Matt for keeping that OG Megatoad profile pic after all these years!", "One of the best things is that he never takes credit for himself when he achieves something. He always respect us, the audience, and his team, and he is always polite in all of his videos. We congratulate ourselves on this achievement. More to come and everything to come :-O", "His mom “I’m going to be on the recording?” That was absolutely adorable ️", "\"You good?\" \nMatt: \"Yeah I'm good\"\n\nAlso Matt: Visibly in pain", "The one chip is definitely the most spicy thing I've ever eaten, expected it to be more spicy though, BUT it hurts your stomach like a bench afterwards. I was struggling, but now my spice tolerance is on another level, stuff that used to be pretty spicy now I can eat like they're just mild spice like thai chili papaya salad, etc.", "His mom saying yay is so wholesome ", "Calling your mom was so sweet of you, Matt! Congrats on 16M, been a fan way before that and im so proud of what you've accomplished!", "That one chip hits hard.. Imagine if paqui decided to make a whole bag of those chips", "I regularly eat spicey food but that 1 chip almost killed me lol", "I was expecting the pain when I did this but I didn’t expect it to taste so awful when I did it! Mad props to you man", "The chip was definitely hot, but it was my gut 4 hours later that really regretted eating it. worst cramps for a couple of hours. LOL I typically don't have problems eating spicy stuff, but that chip tasted horrible.", "I've STILL never seen anything more impressive than when Matt ate Michael Phelps' ENTIRE training days worth of food, in one sitting. 16M subs is what he deserves. I subscribe to other eater channels (all Matt's friends) but none are as entertaining.", "who knew Matt was secretly a spice king", "the stomach pain after a couple hours later is unbearable", "I've tried a bit of this chip before, and for me it wasn't the spice that was the worst part. It was the taste. Like holy hell it was actually revolting. If I ate more of it though it would probably be way too spicy.", "I did the chip. And I felt that head swelling thing he talked about. I almost felt a euphoric high from the chip. But the mouth pain went away after like 30 minutes. The worst part when it first hit my stomach. It was the worst pain of my entire life. It lasted maybe an hour and a half. Either he’s leaving that part out. Or… hes just a tank.", "I want to thank you for not changing at all I love your authenticity plus your always happy in your videos. You and a couple other big time eaters I watch are the inspiration to go try food challenges with my friends when I get to a place in life to enjoy life", "I still remember how the jello bowl challenge went, lol. This one tho can be dangerous and only works out with those who can handle the spiciest foods. Honestly not suprised that you passed this, but there's a reason they say only 1 chip.", "This is the most relaxed one chip challenge I've seen", "There Are Times I'm Thinking... Is Mat REALLY HUMAN!! YOU'RE INSANE!! Huge Hugs, Erica!!", "The single tear was priceless.", "3 years and he got 16 million, bro congrats its absolutly insane!!!", "Should do new segment of \"what happens after\" whenever u do one of these CRAZY challenges hahah", "Only Matt can go 16 mins without complaining after eating the spieciest chip in the world, man u are so brave ", "Mukbangers: literally crying after eating this chip\nMatt: wait, this is hot?", "Ok Matt, I'll be waiting for when they release this chip as a small 6oz bag. You'll tank through it no easy I'm sure.", "Just the pain in my stomach after the challenge wouldn't make me wanna try this again ", "Matt,\nBro.  YOU'RE A BEAST!!! ", "Congratulations on 16M! My mom warned me about the cinnamon challenge.. ", "There will never be enough appreciated for the actions that Matt has taken. Such a good guy.", "That’s insane. Nice job. Congratulations too!!", "I'm still having nightmares about that thing. I took the tiniest bite and felt my soul leaving my body for 20 minutes. I still have the chip too.", "wow he handled that like a champ, incredible.", "Finally you have an actual good timer and not a phone stuck on a banana ", "Also I wish you would do more actual restaurant challenges or even collabs with people like Beard Meats Food. That would be awesome.", "I just did it last week and can confidently say that this man did much better than I did. I'll tell you, it's a 24 hour challenge too.", "I don't know whether or not I should admit it here, but there is no one who can beat the 'HOT DANG SHOW'", "One of my most favorite channels. Always get excited when I see a new video", "Ok this man just ate that chip like a boss man.", "May Bobes rest in peace . Thank you for your lineup guides, they have really helped me in clutch situations keep up the amazing content!! You will soon reach a new significant milestone of 100k and 1M subs :o <3", "Matt Stonie's vids are always so good keep it up bro", "Congrats on the 16 million Matt , and way to go on winning the one chip challenge keep it up love your channel", "Haha your mum is adorable! Smashed it as always Stonie!", "Not gonna lie Matt took this waaay better then everyone I seen.", "I did the challenge and was expecting way worse. The worst part is about 2 hours after when your stomach feels like total shit", "Your mum is AMAZING, so supportive", "This chip was pretty intense and I love spicy food. Stomach pain was the worst part", "Congrats on 16 million Matt. Hope you get 16 million more. I could never do this. My mouth would burn like a MF. And so would the rest of me. You’re a lot stronger than I am.", "I’ve done this challenge the past three years, I love spicy stuff and make my own hot sauce with peppers i grow. Last summer I grew reapers and peach scorpions. I can deal with the mouth part, but always with the chip about an hour later stomach pains hit me, and I know it’s supposed to be part of it. It’s the gut punch, right on the box lol. It sucks. Idk how in the world the guy from hot dang show ate 61 one of these but he did. He also ate a whole bottle of plutonium in a bowl of noodles, ", "I have a friend who did the Ghost Pepper Wing Challenge at Buffalo Wild Wings. He told me about how he went to the bathroom but forgot to rinse his hands off before peeing, and...  well, I'll let you fill in the blanks there. We all had a good laugh about it though.", "Matt’s jaw line developed well over the years.", "The minute I swallowed it, I knew my stomach was in for it. The cramps I got was awful", "I did this challenge and I'm not gonna lie I did pretty good I lasted 40 mins without any water until I accidentally chewed on gum but omg did I not realize that wasn't the worst part when it reached my intestines and it felt like simon was stabbing me back and fourth. Props to Matt standing so strong ", "1 min had me dying only because it got stuck on the back of my throat. \nAside from that it would have been simple and this is just amazing lasting that long, congrats!", "You’re a savage for this, also your mom is so sweet lolol", "Congrats on 16 million subs. You handled the Chip like a Boss. So called you called your mom. She sounds awesome. Did you get the cap craps at all? That thing is hot and caused me severe stomach cramps that night. It was rough for about 14 hours. Would be cool if you checked my video out. Was fun to watch. Great video", "Matt proudly being on shanks crew  and flexing his jolly roger with that heat resistance haki", "you rock matt i love all your videos :D", "Congrats to Matt. Dude is a saint in this world to be breaking food challenge. Much respect!", "It was spicy as hell to me but that’s what’s expected when coming to Hellfire stuff. \n\n\nThe stomach pain on the other hand, I felt like I needed to go to the emergency room.", "Building up that spice tolerance", "I tried this challenge and the burning was terrible but I could live. Then the stomach pain kicked in. I was on my friend's kitchen floor lying there. It hurt soooooo bad, he threw up (but I didn't). It hurt so bad, the chip itself is terrible but the pain after is worse. The stomach pain is so bad it almost paralyzes you.", "Love your dedication. Dunno why TF I wasn't yet subscribed, but I sure am after this badass video! ", "Your mom is just the sweetest! She sounds so loving and supportive.", "Matt Stonie could probably say \"I could eat a whole bag of these\" but this time actually do it", "I'm impressed ,outstanding poker face. That was too cute you called your mom to tell her you survived, I love how you told her really quick before she had anything to say but YEA Haha.  Thank you for sharing this with us. Keep up the great work. Keep safe and take care", "I did the challenge about a month ago. Yes it's hot. I was able to be handle the heat pretty well. About a hour later......my stomach disagreed with me. Worst stomach cramps I've ever had.", "To some people, taking a direct bite of that popsicle was the REAL challenge", "16 Million! That’s Crazy! Shout out to you and Joey. San Jo in the House! ", "What an absolute unit this guy is", "I did ok for the first hour, then it hit me..worst feeling ever after this challenge lol congrats stonie", "Aawe that call to mom was so heart warming :) More than that chip I bet ", "The heartburn was what got me. I think I drank five bottles of water to get rid of it.", "For me, it was when my stomach was trying to digest the chip. My stomach hurt for like over 1 hour. The stupid part was that I did it at work and was unable to repair a truck for over 1 hour, my boss wasn't happy when he found out what I did lol", "Man I'm sure he is high on the spicy chip  but from me you are ", "You handled this like a champ! And congrats on 16,000,000 subscribers.", "All competitive eaters should thank you Matt for making competitive eating something they can make a nice living at", "THIS IS THE REAL SPICE KING!", "I'm more surprised the chip actually came whole and not in pieces. XD", "Props to matt took it like a champ. I only lasted 3 minutes without milk or anything", "For me it wasn't bad for the first 30 seconds after swallowing other than the disgusting flavor,  but then it got bad and I was walking back and forth chewing on ice cubes for 30 minutes straight", "16 million,  bro! Nice work! That just goes to show you put out great content and you have our support", "Cool video, I also just did the challenge about two weeks ago. The heat was nice, I went about 30 mins. It tore my stomach to shreds I was in intense pain for about 3 hours throwing up till I cleared my stomach. Was really fuckin' awful. Glad it didn't happen to you.", "Great job Matt. Your mom is sweet."]}