{"video_id": "gcFEopRQiys", "comments": ["Virgin calling other virgins, virgins.", "I’ve never disagreed more with someone while still being extremely entertained keep it up ", "This whole video proves that King needs to branch out his interests more.   A lot of the stuff he got would have been more worth it to him if he wasn’t just a Mario and Apple person.", "I can't believe I sat through his whole video. Dude has apparently never played any games and hates everything besides mario lmao.", "85% of the items are followed by “I’ve heard good things about this but I won’t play it”", "Plainrock: Refuses to buy things at conventions\n\nAlso Plainrock: Buys a $200+ Chibi Robo game from a convention.", "Who knew watching someone unbox something for 40 minutes would've been so funny and interesting. Good Job King.", "He always finds a way to amaze us.", "I missed the money wasting videos, they are definitely my favorite", "That PS3 haul was actually incredibly good! All of those games are pretty fun, some of my favorites.", "The fact that king always finds a way to offend so many people with little jokes", "Is there anything better than a fresh new episode of plainrocktoyz", "it's been a long time since we didn't saw one of these kind of videos from plainrock and it being 40 minutes long feels like a gift", "This video has made me question what plainrock did his whole childhood", "I have no idea how King spends so much, does so much, and has so little cultural and media literacy", "I remember when literally every YouTuber was doing mystery bags and getting scammed, so this was pretty funny to watch", "I bought a mystery box at a convention once. It was $10 and I only bought it mainly for the box cause I knew I wouldn’t get anything good.", "well, that was pretty interesting. Mystery boxes actually having high value is just really rare and not worth it at all. also some of those anime stickers are actually pretty good though", "I have mad respect for you because you edit your own videos. Keep it up!", "Imagine if DKoldies did something like this!", "LOL, literally anything that's not mario showing up: \"I HATE IT, IT'S ANNOYING, IIT'S WEIRD\" lmfao", "King needs to expand his interests into anything lol", "I remember seeing you go to conventions and seeing people in line waiting to get these bags of trash, God bless your soul King. I cannot believe they did not give you a discount and the Apple Pay did not  work! I am praying for your health.", "I didn’t want this video to end.", "The Chibi Robo clip had me DYING, I thought he was being legit too. ", "I feel old for a person whos still a teen because of this man", "29:15 | I would always play that on my 360 when I came home from school every day. I enjoyed it, and I enjoyed playing it with my friend. Thanks for the nostalgia, King.", "I don't know why I find him wasting money so entertaining", "0:02 You think a video of a grown ass man destroying, screeming, and freaking out about toys for 45 minuets is forever awaited??? You're absolutely correct.", "I love how he got alot of things wrong here, like reading “Mansions” as Masions and calling that M16 gun in that burger guy’s hand an ak47", "King's content never gets old.", "Not gonna lie, there are at least a couple of those bags that I personally would have liked.", "ah yes plainrock124's toy review. absolutely exquisite", "the arcade pass was sick as hell", "6:42 I love how King gives respect to Paul Walker there,I did not expect to see something like that.", "Charlie is an actual saint. So glad we have people like him helping others out when they need it. :( >:-O :D :", "I’m so glad your back making this series", "Ah, man, I wish someday in the future I want those video game mystery bags/boxes just like you are having.", "i’ve been watching this guy for so long and i forgot about him and found him again", "POV: you hate something so much you're willing to buy tons of it", "Was waiting for a Yakuza game to be in the mystery bags but remembered that it's a good franchise and not a crappy one", "This is also happening with sneakers, There’s sneaker mystery boxes that cost $300 and I saw a video of some kid opening one and the shoe he got was worth $100 lmao. They’re a scam", "I love all of ur work, you always put a smile on my face whenever I feel down, thank you for being a great person and I wish you the best life ️️", "Chris Chan’s life would need more than one game…", "This video had me dead laughing ", "40:46 that reaction is gold", "i love how he hates everything that i love but i still love his videos", "Plainrocktoyz is back... after 20 months of wasting more money for new contect we will never forget on the vlog channel.", "everybody gangsta till someone gets a key for Hunt Down the Freeman", "that chibirobo thing actually got me, well played king.", "This was one of the funniest videos ive watched in a long time. Much love Plainrock", "I love Lego so much and getting the two games from the company is amazing", "26:10 This actually is the whole shelf. It just is really cheap and small. Maybe nice for light stuff.", "Bro my man really said “masons” instead of mansions ", "Love your videos keep up the great work", "Our local pawn shop gives you 5 games for 6 dollars and it has the name of the console it's for written on the bag.\nThe games are actually pretty good too!", "5:02 a digital copy puts the downloaded version of the movie on your dvd player (as if you got it by a code, idk how DVD players work so i’m guessing it works like a console would) so if something happens to the disc, you can still access it.", "It’s funny that he’s a major Nintendo and Apple nerd yet looks down on Anime and Marvel fans ", "the sounds of the bags makes me want to go to McDonald's", "26:30 satisfaction 100% ", "Here in Germany we have some stores that sell really cheap but crappy Switch games. 3-5€ for a brand new game. They aren't worth playing but are nice for testing Switches in unknown condition where I wouldn't want a good game to be destroyed if it has a short.", "This “mans” knowledge about dvds and movies made me feel old and i just turned 26", "Imagine the people there just wanted to get rid of the bags and you came in and took them all(seriously they didn't even bother asking you why) so they purposely \"scammed\" you", "\"I don't play Digimon\" best quote yet", "At this point, man-child isn't even the best way to describe him.", "He kinda got me when he pulled Chibi robo", "\"The starting point of all achievement is desire.\" ---Napoleon Hill", "watch the GD community go wild after he mentioned its existence", "Another great video! Keep up the great work", "This never gets old.", "I luv ur videos mate, your jokes are hillarious, they make me laugh when I'm sad.", "27:16 bruh,this reaction \n45:51 and this reaction ", "We love you Plainrock rock keep up the good work", "I never knew you would get MW3!\n\nAnd yes, even though the game is from 2011, I still wanted to play it, as I played the first MW, and the second one, I just haven’t played the third one.", "I think the movies probably had more value then most of those games", "Looking forward to Black Friday video this year!", "Oh, Fable is a great game! It's one of my favorite games of all time. If you like Skyrim you might like it.", "I’m ready for the Black Friday video . I bet king is for sure buying a SD card and maybe a new tv and MacBook ", "Yes! A long awaited plainrocktoyz video finally!", "I liked it when King got the movie Maraduke (idk if I spelled it right) because he did some recreations on the main channel.", "Watch out all, Plainrock has a house alarm! 26:19", "43:13 As a destiny 2 player who has over 5,000 hours put into it, it’s a good game with moments where it can be bad it’s just free to play now. Thats why they didn’t take it. I’d recommend it to everyone but if you want to try it it’s like getting married where it an investment and a commitment which why I have 5,000 hours on it.", "Make this a series plainrock!!!!!!", "I liked how he kept the Darwin sticker", "King either really likes something or really doesn’t like something ", "2:29 didn’t expect the worker there to wear a Chiaki Nanami shirt", "When he said the death note movie was decent I broke", "King has reached now a new level of virgin I didn't think was possible.", "I pressed on the video through a noti and i was so happy when i saw the 45 minute length… this probably means no more painrocktoyz for another 2 years", "i juss thought bout how good it is that he bought all of the bags so other people didnt get scammed", "Him setting off the glass break alarm is soooooo relatable its not even funny. The amount of times I’ve had to run to the phone is unbelievable", "Only channel i can watch continuously for 40 mins", "Puyo Puyo Tetris 2 is a great puzzle game btw! I would at least give it a chance and learn a bit about Puyo!", "24:16 killed me lol", "4:40 The Fable games are actually pretty good. That's not a bad game for a random mystery bag, but still a high price to pay for it.", "The way those digital copies on disks worked is you would put them into your computer and iTunes or Windows media player would automatically download the movie after you entered the code in the case", "27:14 I genuinely lost it", "“It’s the booger guy and he’s armed with a aka 47” ", "They should try to get you to gamble for an N64 game.", "Around this time will be my 4th year of plain rock being my favourite youtuber!"]}