{
    "video_id": "gcFEopRQiys",
    "comments": [
        "The store is a big scam",
        "Metal gear 4 is amazing",
        "Ah, man, I wish someday in the future I want those video game mystery bags/boxes just like you are having.",
        "This guy always makes me cringe",
        "congrats on a million subscribers!!ive been watching you for 5 years",
        "“i hate lego and i hate marvel”\n and i took that personally",
        "I cant believe he used up 40 minutes for us!",
        "oh you traded it in forget about the last thing i said",
        "10:33 vegeta:why am i still here",
        "King, what games do you play? ",
        "\"Freaking out about toys meant for children\"\n\nYeah you really seem to love the toys you unlock",
        "06:05 valid point",
        "I can see someone disliking marvel, but LEGO? Smh",
        "Alternative Title: I HATE EVERYTHING THAT ISN’T MARIO OR APPLE\nJust kidding, keep up the good work King!\nSeriously though, you have an, objectively speaking, short list of interests & the interests you do have are basically your personality.",
        "Hu tao simps saw king liang throw the hu tao key chain away ",
        "Nice",
        "I didn’t want this video to end.",
        "Why do yall hate anime so much ? Is it because thats whats on regular tv for yall because we gotta have cruchyroll to see stuff",
        "Been so long since ive seen plainrock toys",
        "Chris Chan’s life would need more than one game…",
        "6:09 6:10 are my favorites they have weird content",
        "Bro just said the DeathNote Netflix adaptation was decent  6:49",
        "This guy is aggravating, he hates literally everything",
        "YOOOOO IT TRENDING!!! HELL F*CKING YAHHHHHHHHHH",
        "Hey king, where’s the old mobile home tour video…",
        "Yes!! New plainrock toyz video!",
        "Have you watched a marvel movie before?",
        "Kakashi and tanjiro and zoro",
        "They didn’t take destiny 2 because it’s free to play now",
        "36:51 An Error",
        "Just burn the anime stickers",
        "When he say Digimon in instead of Pokemon my heart borke",
        "I'm glad you didn't give that game store any free advertising. They were straight up scammers. Getting rid of used DVDs and old games under the guise of a \"mystery box\".",
        "37:42 that shits bouta be Sued by 3 different companies",
        "When I was 7 or 8 I saw Superman/batman apocalypse And superman doomsday And they were good movies so do not hate on them",
        "These mystery bags were even more scummy then i expected, especially the ps5 ones, i own a ps5 and have never even seen the tetris game",
        "Are you gonna smash the stuff the video game didn't take,it would be so satisfying seeing everything being stacked smashed with sledgehammer",
        "I’m so glad your back making this series",
        "strokin it to this video rn dawg",
        "when is black friday 2022 coming out",
        "tbh this guy seems incredibly picky with his interests like a spoiled kid. Hopefully its ironic",
        "We love you Plainrock rock keep up the good work",
        "Yes! A long awaited plainrocktoyz video finally!",
        "Can I have the Bakugan Champions",
        "You mean «The screen is cracked»",
        "I miss when plainrock used to say “It’s plainrockin time” and plainrocked all of the place ",
        "I love how he got alot of things wrong here, like reading “Mansions” as Masions and calling that M16 gun in that burger guy’s hand an ak47",
        "6:06 same",
        "Where the 2022 black Friday video ",
        "Bro lived under a rock for past 20 years ",
        "You never watched the Teenage Mutant Ninja Turtles? You're offically 1% less of a nerd.",
        "Today’s my birthday",
        "Angry poyo",
        "For a man that only and I mean ONLY play Nintendo games has no room to talk about any thing",
        "That GameCube game is actually exploitable for homebrew iirc! Same with Lego Batman!",
        "I think the whole schtick is to hate what people love and love what people hate.",
        "Send me some games please I want Wii U Lego marvel super heroes and uncharted",
        "5:02 a digital copy puts the downloaded version of the movie on your dvd player (as if you got it by a code, idk how DVD players work so i’m guessing it works like a console would) so if something happens to the disc, you can still access it.",
        "Is there anything this man likes besides Mario",
        "18:12 I mean, I guess.",
        "7:37 those are pokemons lol",
        "25:21. Even though this anime character you got was my favourite character from that franchise and saying it's disgusting, I respect your opinion. I was hurt a little but I understand your hate towards anime",
        "I saw jojo and I freaked out",
        "everybody gangsta till someone gets a key for Hunt Down the Freeman",
        "PLEASE PLAY WOLFENSTEIN 2 IT IS SO GOOD!",
        "Imagine the people there just wanted to get rid of the bags and you came in and took them all(seriously they didn't even bother asking you why) so they purposely \"scammed\" you",
        "\"I don't play Digimon\" best quote yet",
        "Adventure time the first two seasons of dog water but after that it is really amazing",
        "27:15 I fucking lost it  my man went from sounding like he had a stuffy nose to Spongebob real quick",
        "i’ve been watching this guy for so long and i forgot about him and found him again",
        "7:35 THOSE ARE POKEMON NOT DIGIMON",
        "Bro hates marvel for no reason",
        "The 007 agent under fire is used for homebrew purposes, hoping you kept it.",
        "21:33 he pointed at a angry beaver sticker, the angery beavers was a show on nick in the '90s to the 2000's . i watch the angry beavers even tho I'm not from the '90s OR the 2000's. IN NEED THAT STICKER",
        "Can I have all your Pokémon stickers and Pokémon toys plz and I love you videos",
        "you should watch the blindside its a really good movie",
        "Congrats on one million subscribers!!!!!",
        "Minecraft+Ark=Pixark?",
        "Horrible judgement and choice of liked games, but still love plainrock.",
        "i love how he hates everything that i love but i still love his videos",
        "14:53 Agreed",
        "Ah yes, fortnite burger guy armed with an AK-47",
        "Did he just call a m16 a AK 47",
        "Can someone tell me the background music?",
        "This store is the gaming zone in tempe, AZ",
        "",
        "the \"ass ass ins creed\" \nalso, this guy's pain is sincere.",
        "Plain rock toys",
        "Assassin's creed Community will be mad",
        "If you weren't an absolute Mario fan, you would also know that the Assassin's Creed series, Lego series and the ESO series are the most popular games of the last 10 years. I used to be a Nintendo nerd too, but the other games like Assassin's Creed and Skyrim gave me more freedom and a nicer game result than all the Mario games together because you're always doing the same thing. First of all, the best games for ps4, xbox are cheaper instead of always spending 60 € for a game in the Nintendo E Shop. why he kept the games? Quite simply because they are licensed games.",
        "Cars 2 and rio are my favorite movies.",
        "Leaves of the vine drifting so slow like tiny shells",
        "33:02 jojos referencne!!!",
        "Who is waiting for plainrock black friday vlog",
        "Dang I almost forgot about this series",
        "did he just call Kirby “Pokémon”? ",
        "Ass Ass in creed",
        "what do you like? seem to not like a lot.",
        "1:42 This is why you're my favorite youtuber lol",
        "0",
        "finaly plainroctoz 1234 haas become released aftr 2 yers\n\nNo im not a child",
        "yo rocker i live in phx ill take the coupons",
        "i cream every time you upload",
        "You did not just call the Colossal Titan gross \n\nAlso, there’s nothing wrong with Hajime Isayama ",
        "You should do bored smashing new ipad",
        "21:10 That's my favorite Christmas movie of all time!",
        "His voice when he saw the chibi robo game ",
        "M not appropriate for him he'll be getting bad ideas from them",
        "Bruh dissing on all the stuff but Nintendo for no reason",
        "an m16 is now a ak 47",
        "You called Pokemon digimon",
        "KING SAID WHAT?!?!?\nContext: 10:26",
        "Fun fact: Destiny 2 is Free To Play. That’s already pointless.",
        "Early!! Can the king reply or heart the comment? It’ll brighten my whole month!",
        "Are you gonna wait in line for the new pokemon game as they are doing the releases like they used to before covid?",
        "Desteny 2 is free on xbox",
        "Better make that Black Friday vlog",
        "Make this a series plainrock!!!!!!",
        "Should've kept a copy of Puyo Puyo Tetris 2. It's actually pretty fun.",
        "Holy shit i scamed a game store 38:12 i got it for 10 dollers",
        "the reason the trade-in store refused to take the copies of Destiny 2 is because Destiny 2 is free to play now  ",
        "33:03 King (An idiot) : \"Two Pokémon\"\n\nMe (An intellectual) : Poliwag is not a Pokémon.",
        "Just to know thats not a ak47 its a m16",
        "No destiny 2 is not bad it’s free",
        "8:58 where's god, I'm scared because of that movie",
        "bro hates everything",
        "King eats the wendys chili. It all makes sense now",
        "8:43 You mean Geometry Dash?",
        "“I hate x” “I’ve never played”\nI’m so happy I’m not you",
        "I forgot what rated T ment and I thought it ment it was rated for Toddlers- ",
        "44:59 And also don't forget flea markets and swapmeets",
        "wtf does this guy like",
        "I managed to get Super Smash Brothers in one of those Nintendo Bags",
        "sometimes i get really mad at you because of your opinions but ill accept them",
        "can’t wait for black friday 2022",
        "A little bit sus, because he paid at the shop with the iphone 13 mini, not with the 14 pro. In rest,  really awesome video!!!",
        "How do I find it",
        "Dam bro My guy hated on Assassins creed ",
        "AYO  20:15",
        "Vegeta:thats my bulma!!!!!!!\nI knew if its bulma on the sticker",
        "They should call them mystery trash bag’s because you basically take their trash out and pay them for it",
        "now i feel sorry for having ad block",
        "I will take that ssjb vegeta sticker",
        "this was actually really fun to watch lol",
        "Gun lovers when he says burger man is armed with a ak47 \n:It’s a Ar-15",
        "Darwin!",
        "well, that was pretty interesting. Mystery boxes actually having high value is just really rare and not worth it at all. also some of those anime stickers are actually pretty good though",
        "I watched as much of this as I could (20m) but it’s 45 mins u weren’t gonna get a lot of pple watching this whole thing anyway",
        "Why is he giving away the toys?! And also Nintendo toys",
        "Does he like anything?",
        "I really liked this video but everytime he threw away the anime stickers my soul hurt a bit. There were some cool designs there. Btw that Panda at 17:02 was from Jujutsu Kaisen.",
        "I have no idea how King spends so much, does so much, and has so little cultural and media literacy",
        "I subscribed to a retro game mystery box thing for like 4 months and I kept on getting the Spanish version for my games",
        "I like these type of videos",
        "I have mad respect for you because you edit your own videos. Keep it up!",
        "Can i have the anime  things  if you don’t like it king  and the alarm is very attentive",
        "that fortnite dude did not have ak47 it was m16 im little offend jk\n but loved the you make my day when you upload",
        "Me to because I’m just basically wasting my money :(",
        "I grew up playing the first game lol",
        "The Pokémon toy is a fully green floatzel I think?",
        "Jojo is no mid",
        "Kings hobbies seem to only include apple products and Tesla",
        "29:18\nNFS HP is a good game, just not any wii port...",
        "It’s funny that he’s a major Nintendo and Apple nerd yet looks down on Anime and Marvel fans ",
        "I can’t believe he called Pixark a minecraft clone",
        "umm plainrock.. do you collect hotwheels cars? (because when you changed from a model 3 to a model Y i saw some)",
        "Put the anime stickers in a blender",
        "Destiny 2 is free to play at the moment...",
        "The Lorax movie made it all worth it i dont care what you say",
        "I just wanna say that he set off the glass breaking alarm in this video, and he probably does that literally every video.",
        "The return of a great series",
        "Chi bi robot fan boi 27:15",
        "Meh, its your opinion on which companies are you most/least excited about.",
        "Is it just me or at 27:17 King’s voice got high pitched?",
        "Hope Black Friday 2022 is coming ",
        "Pls pls pls break the new Pokémon oled switch it sucks",
        "Geometry war more like Geometry Dash",
        "that chibirobo thing actually got me, well played king.",
        "so many red flags in this video",
        "Wow ryans toysreview really fell off",
        "something that I really hate is that King judges and says he doesn’t like a game before even playing",
        "At least he said Rest In Peace to Paul walker ",
        "Not Ass Assins Cre ed III This Assassin Creed  III",
        "what the hell do you like? it seems like the only thing you enjoy is mario...",
        "Plainrocktoyz is back... after 20 months of wasting more money for new contect we will never forget on the vlog channel.",
        "IM SO HYPED FOR BLACK FRIDAY 2022",
        "I really just spent 45 minutes of my life watching this",
        "24:52 your supposed to put that on your knees its for sports/game",
        "Fact is plainrock but I think you for me you had not a Bad Video because you trade all of the good games i Mein you had 6 worst games that was Marvels avengers For Ps5 and Ps4 For honor For xbox one Lego Chima Laval,s Journey For 3ds Acquad Frenzy For Ds Adventure Time For Ps4 and troll and i For switch so i hope you do I dort know like 4 or 5 mystery box Videos of plainrocktoys and a Mystery box Livestream on your Vlog channel i am Really excited WhatsApp you Trade in und What you Keep in next",
        "if you didnt already get rid of it, you should watch man on fire. denzel is really good in it",
        "So you hate videogame mystery boxes SO YOU DECIDE TO BUY MYSTERY BOXES :D",
        "It’s so hard watching this. He just complained about things the viewers like. Might as well be Phoenix resale.",
        "Bro my man really said “masons” instead of mansions ",
        "Says anime looks and sounds annoying but plays Mario games ",
        "\"I don't watch Anime\"\nRespect ",
        "Cool vid",
        "The fact he called an m16a1 an ak47 ",
        "Keep up the grind ",
        "Can I have the Harry potter movie?? ",
        "Preparing for the black Friday video now",
        "Man I love plain rock toys",
        "The first PS3 game the bakc did not have mold, it was his hair.",
        "hey",
        "Why is he armed with an AK-47",
        "Xbox is the best Plainrock124 But I know you are a Nintendo fan",
        "20:25 I got the game for the xbox",
        "When I try to get a iPhone 6 I got a iPhone 4s",
        "You are so cringe in the cutest way I've ever seen. This is the first video I've seen of yours, but I'm definitely subscribing.",
        "Ong i wouldnt mind the Wolfenstein 2 mystery bag. That game is fire",
        "M-16 nah AK-47   10:20",
        "45 Minutes of Plainrock? This is a dream.",
        "You got a Fennekin!",
        "the reason why you got a lot of destiny 2's is because its free now",
        "You managed to get the most useless games to own a physical copy of, AKA Destiny 2. Considering 90% of the contents of that disc has been removed from the current version of the game, buying a copy is completely worthless nowadays.",
        "10:26 that was an m16 lolol",
        "King doesn’t like anything if it’s not Mario or apple and it kinda pisses me off",
        "8:28 i had to rewatch to release the sticker at the bottom is not anime, its a screenshot of a gameplay lol",
        "Mystery boxes are loot boxes in real life. Change my mind.",
        "Just sneak the movies in the Walmart bin, they’ll want them",
        "pixark isnt bad",
        "27:15 plainrocks first cringe moment",
        "Did you call Kirby a pokemon",
        "Zootopia+(the furry movie) is on Disney+",
        "Bro just doesnt like anything",
        "After watching this, I would rather watch Nostalgia Critic and actually enjoy myself",
        "JOJO's Bizarre Adventure is actually a good anime with a memed fanbase",
        "16:10 as someone ho talks Spanish I can conform that’s what it says",
        "Am I the only who got triggered at 6:40 when he said brick masons instead of brick mansions.",
        "So much disappointment from this video... it gave me so much stress...\nReason: plainrock hates things that everyone loves..... mostly sonic...",
        "this man doesnt know what a damn shoulder strap is, i thought snobs were above holding things with their hands",
        "17:00 EWW ANIME than YAYY PANDA\n\n22:59 \"At least its not anime\"",
        "7:07 It's funny since Destiny 2 is free now ",
        "I luv ur videos mate, your jokes are hillarious, they make me laugh when I'm sad.",
        "Sick",
        "Does anyone know the music at 26:56",
        "These games were actually pretty good but since you never play any games other than Mario I understand why you hate them so much",
        "6:38 The engrish",
        "Says anime is annoying, likes the fred movies, lol good vid.",
        "boyen on Samsung Blu ray player ntsc 1 on HS7MC on 3d",
        "good",
        "Listen I know you don't like anime but watch death Note if you thought that abomination of a movie was good you'll love the actual thing",
        "a video games you ask",
        "7:34\nKabutops and Electabuzz fans stay mad",
        "for honor is elite",
        "how much for the lego games from my childhood?",
        "I love you ",
        "King either really likes something or really doesn’t like something ",
        "You know starving kids in Africa could eat those games",
        "Only channel i can watch continuously for 40 mins",
        "What was the thing he used was it Google trends?",
        "The tesla model y is coming out you can preorder it now",
        "I dont give a crap bc u can like nitendo and not like playstaison but u cant like xbox",
        "the reason why they didn't take destiny 2 is because the base game is free but it also is bad game",
        "The thumbnail is lit ",
        "It's funny seeing all the Destiny 2 copies, probably from people realizing the game is free now lol",
        "King: Brick MAIN-SUNS, it’s mansion (Man-Chin)",
        "33:04 Josuke: Atleast it wasn't my hair",
        "I m play geometry dash right now",
        "Plainrock124 I hate anime\nMe I hate anime cuz it’s in japanese and it looks like drawings but it moves\nEveryone who is 27: I OIKE ANIME YEEEEE",
        "29:22 | I would always say a 10 minute preview of it in my art class back in elementary but I never saw the whole thing. Until last year. The movie was okay.",
        "24:16 killed me lol",
        "I just realized this video is ４５　ｍｉｎｕｔｅｓ　ｌｏｎｇ",
        "I’m unsubscribing you never watched adventure time is like the best cartoon in the world",
        "That PS3 haul was actually incredibly good! All of those games are pretty fun, some of my favorites.",
        "does he even like video games",
        "does king actually like anything other than mario games",
        "GOODDDDDDDDDD",
        "I wonder why he hated anime. great video regardless!",
        "The only good 2 games wher mw2 and assassins creed",
        "I live in germany and where is the next location  to eu vidcon ? And im 11",
        "can't wait for the black friday 2022 video lmao",
        "Did he say brick mason for mansion",
        "I love how the video lagged on the first frame so I could just see your blank stare",
        "I am a good fan of the Lorax",
        "I can’t believe no one bought this lol",
        "the most disagreeable and entertaining thing at the same time",
        "The fact that he threw the hu tao sticker",
        "29:15\nWow cool my childhood racing game getting called trash",
        "PANIC is so good I reccamend watching it",
        "\"probably anime\" -plainrock124\noffened-some weeb",
        "Its a m16",
        "Be a true Chad",
        "If I was there I would take all that anime sticker he doesn't want",
        "Lol scammed",
        "pff digimon its totally poketron",
        "PLAINROCK TOYS YEEAAAAAAAAAHHHHH!!!!!!!!",
        "3:17 Plainrock124 Giveaway",
        "SOOOO THAT'S WHY ALL THE VIDEO GAME MYSTERY BOXES ARE GONE.",
        "longest video ever plainrock 124 has uploaded",
        "What's the video game store",
        "Alternate title: ”King explores various childhoods he never got to enjoy”",
        "Zenitsu too and naruto",
        "1:08 S U S .",
        "His version of The Blind Side sounds so much better then then original.",
        "the best series is back, yoooooooo!",
        "Stop gambling plainrock",
        "26:10 This actually is the whole shelf. It just is really cheap and small. Maybe nice for light stuff.",
        "Hates Lego. Booooooooo",
        "Give us the tour",
        "(1/2) Edit: Plainrock124 you actual madman you got one of my favorite movies with actual good BD-Live Support at: 29:22\n(i did have a blu ray for this, but i lost the blu ray so... i can't wait to see the look on your face when you get a brand new high score on truffula run. (on blu ray and dvd)",
        "Video game investments are troublesome. There was one time I spent $300 in Mario Kart Tour and didn't even get the driver I wanted!",
        "3:13",
        "King can I get the assassin's creed nintendo game or buy it",
        "69 mins of retro games be like",
        "therye mistery bags",
        "mans the new scott the woz",
        "Who thought that he was gonna get sponsored",
        "Plainrockvlogs is at 1,000,000 subscribers, I’m scared for what he will do",
        "2:16 3:31 4:23 ooohhh 8:00  8:56 10:20 11:32 something for everyone  12:14 14:57 15:53 16:28  16:50 19:34 like a lot of anime 24:02 25:59 27:14 29:42 29:50 30:18 31:29 33:02 that's not even an official anime sticker, it's JoJo fan art 35:11 35:22 lol 37:52 38:13 40:26  41:55 43:10",
        "10:27 that ain’t no Ak-47",
        "10:26 plainrock:he is armed with an ak 47\ninsert M16 image with a bassdrop that says ak 47",
        "Him: lts the burger guy with an ak47\nMe: THATS NOT AN AK47 ITS AN M16 DUMBO",
        "until the end of the video i though he was saying \"T for T\".",
        "It's funny how he dislikes everything he gets lol even the good stuff",
        "38:13 wut",
        "Please",
        "9:18\nYea that's anime. His name is All Might from My Hero Academia (which I have some on my crappy computer).",
        "Ahh man I’ve been to that gaming store before lol",
        "destiny 2 is now f2p lmao",
        "Around this time will be my 4th year of plain rock being my favourite youtuber!",
        "Lol",
        "That guy had a Danganronpa shirt",
        "The Chibi Robo clip had me DYING, I thought he was being legit too. ",
        "38:53 Same I love Gumball too!\nand that's Darwin one of my favourite characters from that show",
        "At 33:31 you missed that it was the Club Nintendo Version",
        "I think the best part was the stickers",
        "how dare you sat that sonic is bad",
        "I watch Popeye on VHS with danish speech. Ah, childhood ",
        "Rated M for Mario\n(Since some of the M's on the bags were red)",
        "One of us one of us anime god",
        "I will do you a favor can I buy the all the anime stickers",
        "Ducking hell first half of this video thought he’d never played any franchise of fucking game",
        "40:04",
        "Bro hates everything but Mario ",
        "This man hates most things",
        "wii  gams  ken  i  haev  it",
        "6:04 6:49 19:30 20:29 21:30 how to get ratioed",
        "should’ve burned the anime stickers",
        "Cristales is a good game I enjoyed it but yea idk why the price is so low in terms of resale",
        "So whens bored smashing pokemon scarlet and violet oleded switch coming",
        "Man on fire is actually a great movie, I recommend",
        "Hotel for Dogs was a nostalgia trip ",
        "8:51 ayy, my aussie mate is recognised, fun fact, he owns a Fiat 126p Niki, aka Tony or Tiny Tim",
        "I’m ready for the Black Friday video . I bet king is for sure buying a SD card and maybe a new tv and MacBook ",
        "hope you recouperate some money from this video haha",
        "Aaaaaaaa ya when is the Black friday vlog coming out",
        "I’d legit scream “no” from a Amazon mystery box.(anime)",
        "Lol he threw it so hard that the alarm though that the glass was broken",
        "For the \"Fitbit\" break it.",
        "give demon slaer stickr",
        "you mean geomerty dash",
        "Black Friday 2022",
        "its funny how the assassins creed one was limited edition... but you searched up the non limited edition one :|",
        "This was one of the funniest videos ive watched in a long time. Much love Plainrock",
        "For some reason this actually kinda takes me back to 2012-2014 toy reviews and I love it. Also my copy of bugs life is 2 sided like material girls, and I usually choose full screen so it looks super stretched",
        "Go watch deathnote the anime, I hate anime but that one was really good. Take it from a stranger on the internet.",
        "you sound different 🫤",
        "8:43 its on steam too",
        "1 MILLION SUBS",
        "I remember seeing you go to conventions and seeing people in line waiting to get these bags of trash, God bless your soul King. I cannot believe they did not give you a discount and the Apple Pay did not  work! I am praying for your health.",
        "Ooooooh 3d mario bros",
        "A long explanation to Plainrock so buckle up, digital copy was a type of disk that came with most DVD and Blu-ray copies of movies, and what it allowed you to do was to bring your movies everywhere you go and the disc contains a file of the movie itself that can be downloaded on, or downloaded to a portable media device, or an iPod and you can do this process by Windows Media Player, or iTunes (Well to do it by iTunes, you’d need an older MacBook or iMac that has a disk drive since today’s sexy looking MacBooks and iMacs don’t have disk drives), in which, before you do the downloading process of the digital file of the movie, most DVDs and Blu-rays that contains a digital copy had a code where you can enter it in order to do the process, in which it existed in the late 2000s, til the early 2010s when digital streaming services were on the rise. (P.S, I hope you understand it now, if not, Google it). ",
        "Good job on one million ",
        "Not chibi robo :(",
        "idk why i like this guy",
        "First video that is 20< Minutes Video",
        "10:27 thats an m-16 lmao",
        "This never gets old.",
        "I was waiting for a long episode of plainrock toyz",
        "The fred movies are good",
        "Planroktoyz!!1!!!!!",
        "10:26 with all due respect,did you just call the m4a1 the AK-47. what the fuck",
        "6:06 can agree",
        "how has  he never heard of fable lmao imagine",
        "I am A Big Fan Of The Vlog Channel And The Main Channel Not So Much But It’s Fine And Decent For Me Hope U Won’t Get Mad",
        "The dislikes and hate comments are cancer",
        "30:05 bro is calling that virgin when it’s the least virgin thing ever",
        "Bro talks about virginity yet only plays Mario.",
        "I know exactly which store this is, I bought a mystery gamecube bag and recieved Chicken Little The Game and Blood Diamond  all the other trash i threw away. Totally worth the $25 price tag lmao.",
        "NO U UGH",
        "Kirby is a pokemon???",
        "The panda from the ps 4 is from anime",
        "I demmand you set you're videos to 4p so I can watch your videos on my samsung fridge.",
        "LOL, literally anything that's not mario showing up: \"I HATE IT, IT'S ANNOYING, IIT'S WEIRD\" lmfao",
        "I was trying to sort timed comments to see any other idiot jojos fans at 33:03 but YouTube didn’t have the option",
        "I dare you to destotroy jadoo tv",
        "Anime hot take as a weeb, Attack on Titan is mid. The 2013-2016 fandom made the show more interesting despite how cringy and trash it was.",
        "At this point i don't think king likes anything",
        "next video",
        "I haven't watched this guy in years",
        "Don’t call me a nerd, but, Chima is actually pronounced ch-ee-ma",
        "Oh nO AlL mIgHt iS bLuShInG",
        "It wasnt a aka 47 it was a AR",
        "I like assassins creed",
        "Hey king what's the wallpaper called the one you have on your phone. I want the wallpaper.",
        "I’ve never been so bewildered by someone, I can’t tell if this is a parody or not.",
        "40:04 The fuc",
        "Do you actually hate lego",
        "niedługo będzie black friday 2022",
        "11:25 the \"toy\" is a car for a really weird nerf mini car launcher",
        "Can I Have The Wii Game",
        "Almost stopped watching when he said he didn't no what Fable 3 was.",
        "Good vedio I am kinda surprised that there were so many demon slayer stickers it's my favorite anime",
        "This might be his longest video non other than his live streams",
        "I was clickbaited with the chibi robo",
        "NEZUKO-CHAN",
        "38:17 if you think a case tastes bad imagine how a crow bar tastes like. Tasted like a beer can. Nearly puked",
        "i cant tell if him calling the pokemon stickers digimon was ironic or not lmao",
        "Why Xbox last for opening? :(",
        "Its called bag not box (plainrock im just kidding)",
        "GOD bless u man",
        "SOMEONES BEEN IN HERE",
        "10:27 that's an ar 15 ,not an ak️",
        "Bro called Pokemon Digimon.",
        "the arcade pass was sick as hell",
        "I don't know why I find him wasting money so entertaining",
        "Thanks for keeping me company at 2AM on a Thursday morning.\nI agree with you on anime cuz idk what so special about it it’s just some sort of annoying cartoon",
        "I want to 5 below today and  they have that game 4 $5",
        "38:13 ",
        "How can you get pokemon mixed up with digimon!? Those were pokemon",
        "Not gonna lie, there are at least a couple of those bags that I personally would have liked.",
        "ive heard of for honor before, its basically just this online combat game, cant remember much about it because ive only seen my brother play it",
        "15:23 the blind side is so good i watched it in school",
        "Fable 3 is a pretty good game i played it",
        "Here in Germany we have some stores that sell really cheap but crappy Switch games. 3-5€ for a brand new game. They aren't worth playing but are nice for testing Switches in unknown condition where I wouldn't want a good game to be destroyed if it has a short.",
        "33:02\nGuys Kirby Is Now In Pokemon Now",
        "If someone calls you insane for buying their junk. Stop going there",
        "about the looks and sounds annoying anime thing.not one of the ppl that yell at ppl for it buut some animes like one piece and dbz are pretty good, maybe possibly try them?",
        "Hey do you have any more ps3 games if you don’t lok. them of course can I have them nach just joking but keep it up",
        "Games in this video that I have \nLego marvel:\nFable 3:\nDestiny 2:",
        "The way those digital copies on disks worked is you would put them into your computer and iTunes or Windows media player would automatically download the movie after you entered the code in the case",
        "26:17 unistall a alwrm plss",
        "7:36 - 7:38 I agree I play Pokémon",
        "I pressed on the video through a noti and i was so happy when i saw the 45 minute length… this probably means no more painrocktoyz for another 2 years",
        "I hate lego games too. They seem so childish and so stupid and low quality.",
        "i have the biggest crush on him",
        "M16A1 actually my friend the quiet kid told me.",
        "Please come to Utah cause I will pay you 100 dollars for scary movie 3 because CiNDy, ThE tEeVeeS lEaKiNg",
        "Imagine calling Genshin Impact an anime ",
        "woah",
        "Bro my brother loves assassins creeds and never stops playing and it’s so annoying it’s all he talks about and it sucks lol.",
        "The fortnite man was holding a m16 not an ak 47",
        "he called an ar an ak47",
        "Holy fuck he mentioned geometry dash",
        "Cars 2 sucks do a board smashing of the worst movies yet",
        "Can’t believe you reach 1 million subs king I been watching you like 5 years now",
        "“It’s the booger guy and he’s armed with a aka 47” ",
        "That red bar on the bottom really made me think I already watched it.",
        "He always finds a way to amaze us.",
        "9:17\nall might x mario i guess",
        "You haven't ever seen a double sided dvd",
        "you should watch the blind side its a nice movie",
        "Did he just call Pixark a minecraft clone and then lick it?? What am I watching",
        "27:15 lmao the voice",
        "can I get one for free",
        "i was so deep into the video i didnt notice it was 45 minutes long",
        "Father, It's been 10 years..I'm starving",
        "Do BLACK FRIDAY 2022",
        "1:49 oblblogged ",
        "If you feel like nobody cares about you, go somewhere by yourself and kneel down to pray. Put your hands together and give your praise and prayer requests to Jesus! Jesus cares about you! He cares about mankind! Even though we as people can’t see Jesus with our eyes, we know for a fact that GOD sees us with his. For it is written, “The eyes of the LORD are in every place, beholding the evil and the good.” Proverbs 15:3 KJV PRAY TO JESUS AND TAKE YOUR PETITIONS AND GIVE THIS TO JESUS! JESUS WILL TAKE CARE OF YOU! HOW DO I KNOW THIS? It is my belief that John 3:16 is real, and it says,” John 3:16 KJV “For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.” ",
        "how could you disrespect lego batman like that, I though you had taste",
        "planrock ius it call pokemon not dijimon",
        "Can you please do more videos because I love them",
        "Saw that you uploaded and immediately started crying god bless you",
        "The adventure time game is shit I know this cause I played it once",
        "No Xbox minecraft...",
        "Finally a plainrocktoyz episode",
        "At least keep the wolfiesten one.",
        "burn all the anime stickers",
        "Fuck yeah another Fred movie appreciator. Those movies are masterpieces",
        "You should do a ”idiot spends __ on chips AGAIN” as doritos made an xbox gamepass contest. (Youtube, this is not an ad. Please dont give me another warning)",
        "He really call an M16 an AK 47 10:26",
        "Ok I Know something in this video he hates sonic",
        "“I don’t watch anime because it looks annoying and sounds annoying.” Finally a man of culture.",
        "I liked how he kept the Darwin sticker",
        "Fred is a great movies",
        "Dawg you need to expand your interest ",
        "Only game worth while in them imo was for honor play the game with a passion.",
        "I used to watch you a lot and I am kind of glad you wasted your money on a so called “SCAM” because now you will learn your lesson and not buy anything like this again.",
        "I think the movies probably had more value then most of those games",
        "Audience: Man\nPlainrock: Man\nAudience: Shi\nPlainrock: Shi",
        "damn, they really put xbox on the same tier as the Wii-U",
        "9:16 Professor Almight from MHA",
        "lol i kinda expected king to know what dbz is as its so iconic if you look at the eyes u can tell its dbz.",
        "Nice \nBest you tuber",
        "Lmao wolfenstein 2 with evil within 2's book 6:25\nWait, is that intentional? Both games from bethesda",
        "it's been a long time since we didn't saw one of these kind of videos from plainrock and it being 40 minutes long feels like a gift",
        "I did not watch this I'm just assuming he got attacked with the .89 cent bin smh, also fk gamestop",
        "you called kirby a pokemon",
        "Give some of those games to someorndarygamers. You know he would play them all.",
        "When I see this with a plain rock video, I just have to click it",
        "Ngl, when u pulled out chibi robo, that was really good acting.",
        "YAY FINALY ANOTHER VIDEO!!!!",
        "The sigma is back",
        "you said pokemon stickers are digimon\n why man",
        "7:06 what a scam a free to play game in one of the mystery bags Lmao",
        "i juss thought bout how good it is that he bought all of the bags so other people didnt get scammed",
        "Capitalism fanfiction",
        "Hey before you sell that wolfenstein too I'll take it I got $20",
        "Can I have the lego batman"
    ],
    "comments_disabled": false
}