{
    "video_id": "Gzs60iBgd3E",
    "comments": [
        "Me pongo contento como si fuera mí hermano el que cuenta su historia , no te conozco en persona ni se toda tu vida pero estoy contento de que hayas triunfando, una canción que vale cada segundo , con una historia detras , te deseo muchos éxitos a vos y tu gente , mucho amor y paz duki y Biza ️.",
        "Esta session es B-R-U-T-A-L con todas la letras felicidades",
        "3 Millones de 1 hora... El mejor trapero de argentina, y el mejor dj de argentina... Creciste mucho biza, SOS un grandeee ",
        "el beat de\" a veces vuelvo\" al final ,muy argentinnnnn",
        "es buenardo quinto escalon quinto escalon quinto escalon",
        "los 13 dias escuchandola, los 13 dias cantandola hasta en clase",
        "soy una madre que canta canciones de Duki desde 5to escalon para cantar con mi hijo que tenia 12 años en ese momento y ahora 19!!! jajaaj , te felicito, felicito a tu madre y tu familia que te acompaña.",
        "Rre buena esta session les salio piola",
        "Tanta espera mereció la pena ",
        "Está sesión está increíble Bizarrap  sin duda se irá mundial  aunque me falte mucho seguiré trabajando duro para algún día colaborar contigo y con Duki  de corazón ️ Dios bendiga a todos aquí  Esperó y me puedan apoyar recuerda que en la unión está la fuerza ",
        "Posiblemente la mejor sesión de todas y tiene súper pocas visualizaciones no lo entiendo",
        "Está de rompe y raja ... BENDICIONES  A TODOS LOS ARTISTAS ... HOY SE REVIENTA PARLANTE CON ESTE HIT ",
        "Momento historico  recuerdo hace años cuándo veía el quinto escalón  esto me da mucha nostalgia yo les enseñaba batallas alas personas de mi círculo y me ignoraban jajaja quien diría que subirían como la espuma grande duki y biza",
        "BZRP desde BHAVI hasta DUKI !!!",
        "Porque todavía no tiene 50 millones de vistas esta JOYITA??¡¡",
        "Colmó expectativas, very nice",
        "Dejo mi comentario aqui para que cuando alguien le de like a mi comentario me llegue una notificación y vuelva a escuchar esta joya de canción",
        "Solo a Los reales nos sacó lagrimas de saber que alguien humano como Duki venido de un espacio logró sacar a flote su barco en su propio mundo",
        "Mucho se habla de duko pero el beat de bizaaa GOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOD",
        "esta BZRP es un regalo para todos los que seguimos a biza y a duki desde hace tiempoooo, es una obra de arte, no tiene ningun fallo, me habeis hecho llorar de la emocion",
        "Cumplí mi misión de rapero, le compré a mamá la casa que quería!! Concepts!!!",
        "Los únicos que sienten en el corazón este tema son los fans del Duko q lo siguen desde un principio. Desde Puerto Rico 🇵🇷 supe quien era Duki por Bad Bunny y Eladio Carrión. Desde ese entonces me gustaron tanto sus canciones que lo escucho más a él, entre otros traperos Argentinos. Este tema me pone los pelos de punta, pues busque a Duki desde su comienzo en el quinto escalón y su trayectoria. Que viva Argentina 🇦🇷 y su trap que estaba otro nivel. ",
        "Aggggg de sección v:",
        "La mejor cancion vamos biza y duki",
        "ESTO NO LO VOY A SUPERAR EN TODAS MIS VIDAS",
        "Esa hermosa sensación que se siente esperarla por tantos años y que al final no te terminé decepcionando️",
        "LETRA\n\nSi yo digo Quinto, ustedes dicen Escalón\n¡Quinto!, ¡Escalón!",
        "Mucho Respeto JAMAS renuncies a algo que realmente te gusta, Enfócate en ti, en tus proyectos y en tu paz mental. 🇩🇴 desde Dominicana seguiré trabajando duro para algún día colaborar contigo de corazón Dios bendiga a todos",
        "Bizaa hice la reacción al tema, son unos genios! Like para que Biza y Duko la vean️",
        "Esto es claramente un temazo de aca a la china , solo hizo falta escucharlo 1 vez para emocionarme y terminar a las lagrimas.\nla rompieron toda",
        "En esta session se nota el sentimiento de MAURO, que hasta la piel se me puso de gallina locooooo!! Eres grande por tu talento y tu persona Duko. Y gracias a Bizzarrap por esta session tan especial!!!! ️️️",
        "Felicitaciones Chicos .!!!🇦🇷",
        "Con santa fe klan.️",
        "Siempre q escucho a duki me parece increible pensar q hace 5 o 6 años el chabon rapeaba ni por plata, por amor y ahora me pone la piel de gallina, t amo kbron",
        "Me encanta como despues de tantos años no pierde el toque",
        "DIGANMÉ QUE SE DIERON CUENTA DEL DETALLE DE LOS TATUAJES ",
        "Mi novia me dejó por mi ex mejor amigo y está canción me ha hecho estar un poco más feliz",
        "Llegué temprano a este pedazo de session ",
        "SONIDO DE SÓNICO RECOGIENDO MONEDAS 2:43 F L I P O",
        "dukiii",
        "Noooooo\nWey está sesión dan ganas de llorar\nY volver al pasado cuando empezó y donde llegó \nGRANDE DUKO️️",
        "GOLAZO DE ARGENTINA PAPAAAA!!!",
        "SE VIENE UNA PARTE 2 OJOOOOOO",
        "sale una session con wos",
        "2:31 esta parte la mejor lejos amigo, nunca fui muy fan de duki ni tampoco lo conozco desde hace mucho pero igualmente la canción es un temon y sin dudas cada vez que la escucho me gusta más y me motiva más,1 en tendencias más que merecido ",
        "cuando la session con myke towers",
        "No soy partidario del rap ni muchos menos del trap, escucho rock nacional, amo los redondos, lfdaa, la renga, divididos, charly y más pero esta sesión de Bzrp con Duki me encantó, flaco ahora entiendo por qué sos el uno en argentina, mi hermano escucha esta música y lo juzgue, ya no más, sos un fenómeno y el orgullo más grande es que seamos compatriotas, desde hoy, me dedico solo a escuchar y ya no a juzgar, gracias por hacerme comprender. Biza y Duki me hicieron abrir los ojos y mis oído ojalá vean mi comentario para que sepan lo que provocan en la gente y sigan por éste camino. Les deso lo mejor. Saludos y vamos por éste mundial carajo!!!! Los Argentinos más unidos que nunca!!!!",
        "Dónde está la referencia de la próxima sessión ?",
        "cada segundo cada milisegundos esto es música de otro planeta bzrap eres un Dios en la tierra duki se te fue la mano  mucha superación y mucho sacrificio en esta letra",
        "CUMPLIERON CON LO QUE PROMETIERON. LA SACARON ANTES DEL MUNDIAL. Mucho flow ",
        "Es duki o duko ?",
        "Es obligatorio escuchar este tema por lo menos 20 veces al dia",
        "Que locura, pudiendo sacar algo pegadizo y mainstream, se la jugo por sacar algo homenajeando a sus origenes y raices. Los que amamos el freestyle nos emocionamos escuchando esto ",
        "La mejor sin dudas",
        "Un Grande el Duko  de los mejores en la música",
        "La exploto está session",
        "5to SCALONIII 5to. SCALONIIII",
        "1 millon en 12 minutos que locura y sigue aumenta, cada 10 minutos 1 millon de vistas ",
        "Para cuándo el próximo session",
        "Duki se te espero tanto y no decepcionaste, emocionante sesión!",
        "UFFF TREMENDA SESSION DUKO,INCREIBLE QUE TENGA 6 MILLONES EN TAN SOLO 3 HORAS ",
        "TRELADOOOO 10 DE  NO ESTA REPIOLA ",
        "La ley del más fuerte habla de mí",
        "ESTA OBRA MAESTRA VA A SONAR EN EL MUNDIAL FUAAA DUKOOOO",
        "Nuevooooo himno PAAAAAA",
        "La escuché 3 veces y se me re pego ",
        "Cada barra me eriza la piel, grande el duko",
        "1位は歌が上手すぎる",
        "Quá tuyệt vời. From Vietnam with love <3",
        "Cualquiera que no esta desde sus inicios dirá que es un tema sobrevalorado, los diablos de verdad lloramos con este himno! ",
        "DALE CHEEE TIENE QUE LLEGAR A 100M ANTES DE FIN DE AÑO",
        "biza y duko los mejores",
        "A pesar de tanta presión, no abandono su esencia, ROMPISTE DUKO",
        "Esque realmente ya la escuché muchas veces y cada que la escucho lloro, por qué me enorgullece saber que a crecido bastante, que a logrado todo lo que a querido y se que no me conoce pero yo a él si y me emociona ver lo que a alcanzado simplemente lo amoooooo️",
        "Cuando la sesión con amar azul/ke personaje",
        "la primera parte de lo mejor que he escuchado del duki",
        "MUCHOS COMENTARIOS DICIÉNDO ESPERABA MAS! O QUERIA ESCUCHAR UN HIT, AMIGOS EL DUKI TRATO Y LOGRO DAR UN MENSAJE Y QUE LA SESION TUVIERA UNA HISTORIA,  QUE ESO ES MAS IMPORTANTE, SI ESO NO LES BASTA ES MUY SU PROBLEMA, GRANDE BIZZA Y DUKI LA ROMPIERON ",
        "Estamos acá rumbo al millón en menos de media hora ️‍",
        "Es igual a la cancion de jbalvin\n1985, 7 de mayo\nUn barrio medio de Medallo, salió este gallo\nCon el sudor en la frente, en las manos callos",
        "QUIEN MÁS ESPERA LA PARTE 2!!!!!!🇦🇷",
        "EY BIZARRAP LA SESSION ES DEMASIADA BUENA",
        "Esta canción me recordó que nunca te debes de rendir  GG la esta rompiendo",
        "𝔸𝔾𝕌𝔸ℕ𝕋𝔼 𝔻𝕌𝕂𝕆",
        "Cómo biografía me gusta más la session con Paulo Londra, pero esta con Duky está genial.",
        "DUUUUKI TE AMO VIEJO SOS DE LAS MEJORAS COSAS DEL MUNDO",
        "ESTA ES MI SESSION FAVORITA GRACIAS BIZA Y DUKI",
        "Para los que los seguimos desde el quinto esto es una obra de arte️ GRACIAS LOCOOO",
        "Esta cancion tiene tanta historia y sentimientos que no caben en el pecho  gracias Duko y biza por ser la inspiracion para tantos raperos que aun seguimos luchando por ganar un lugar en la musica ",
        "Grande Biza",
        "tarde o temprano regresan a el bzrp,, el dijo que preferia hacer una cancion e incluir a el bzrp pero termino haciendo otra session con el astro de eterno fulgor",
        "SOLO LOS VERDADEROS AMANTES DEL FREESTYLE Y LOS QUE LLEVAN AÑOS EN LA MOVIDA ENTENDERÁN LAS PRIMERAS LÍNEAS  \"LA PIEL SE TE ERIZA WACHOOOO\"",
        "Duki podía hacer cualquier género en esta session pero como el biza dijo ellos no olvidan sus raíces y a quienes lo seguimos desde el principio ",
        "Biza en el minuto 2:43 se escucha el aro de Sonic cuando el Duko dice lentos sólo lo escuchas con audífonos o el volumen al máximo",
        "Parte 1?????\nPrepárense por qué se viene ",
        "Me hicieron llorar. Gracias por no hacer lo que todos esperaban y romperla de esta manera, los amo tanto ️",
        "Todos los que estuvimos aquí desde bhavi bzrp #1 todos los que estuvimos haya con \"no vendo trap\" saben y sienten hasta en los huesos este tema, hablo por todos al decir que sentimos un escalofrío inmenso al oírlo y ver todo lo que ha pasado con estos exponentes. Gracias bizarrap gracias duko ",
        "Por mas que no sea una session comercial la cual entiendan todos, es sin duda una session que te pone la piel de gallina al igual que la de Paulo, increíble la trayectoria de Duki Gracias por ser Argentino.",
        "Dios no espero que nadie vea este comentario. Pero la verdad llore escuchando al Duko. La primera vez que te escuche DuKo estaba en una casa de rehabilitación en 2012 luchando contra mis demonios internos siendo casi un niño y sen ver a mi familia. Ahora al igual que vos salí adelante y poco a poco estoy cumpliendo mi sueños.. Te amoo Duko",
        "Porque si es la #50 ha salido tan tarde y después de la #51 y #52 ?",
        "Solo digo que en esta canción lloré y salté.\nLa espera mereció la pena \nIncreíble trabajo bzrp y Duki",
        "ESPECTACULAR ESTO!! MI SUEÑO SIEMPRE FUE CONOCER A DUKI Y BIZA :(",
        "Tod@s esperábamos este bzrrp  arriba duki, biza y Argentina 🇦🇷 que acá desde 🇵🇪 los apoyamos en el mundial ",
        "Inspirationlove your flow",
        "estupenda cancion !! :)\nalguien notó que al principio del vídeo los tatuajes faciales de duki a penas se apreciaban? ",
        "El duko está rodeado de personas tan increíbles y que lo admiran como persona y como artista, ejemplo de eso C.r.o, siempre orgulloso de cada logro del duko, eso habla mucho de la gran persona que es mi mauro\nLo lograste mi dukooo",
        "La canción de duki. Me bencanto",
        "Lo escucho más veces y me gusta cada vez más. Biza y Duki estáis haciendo historia ",
        "100% Argentino este pibe",
        "Uyyy esta buenisiiiimaaaa me vuelvo loco",
        "Merecidisimo 1 en tendencias!",
        "Sin duda el mejor duo de Argentina 🇦🇷 Ha superado mis expectativas por completo",
        "Después de la 3 vez le agarras el gusto... Es tan Flow raíces esta canción, Duko es el mejor ",
        "Cada vez que la escuchas cada vez te motiva más... Xq no salió un mes antes esto y no abandonaba mí emprendimiento  \nAh no bajar nunca los brazos gente ...el duko si que sabe de motivación!!!!!",
        "Song language?",
        "Me qued atnita toda la secin, al final llore. \nNo esperaba menos de el",
        "ESTA CANCIÓN QUEDARÁ PARA LA HISTORIA",
        "esta cancion >la de quevedo",
        "Joder, no paro de oírlo",
        "0:03 increíble lo lejos que han llegado los dos, saliendo de una competencia de plaza, simplemente hermoso :,)",
        "La rompieronnnn ️️",
        "\"Los buenos gestos no se echan en cara pero en el fondo cada uno se acuerda\" ",
        "muy buena  la  tronaron   chido",
        "Brutal",
        "321 DUKI SI YO DIJO 5 USTEDES DICEN ESCALON 5 ESCALON",
        "\"Sharau para modo diablo..\nal Ysy y al Neo sepan que los quiero \npienso en ustedes a diario\"",
        "QUE LOCURA, NO DECEPCIONA JAMÁS EL DUKO. LOCURA DE BEAT, LOCURA DE JUNTE️🇦🇷",
        "mucha razón",
        "No se dan una idea de lo importante que son en mi vida sin que sepan de mi existencia. Los amo infinitamente, son mi fuente de inspiracion y de superacion, dejaron a argentina en lo mas alto siempre.🇦🇷",
        "Ooh... Dios Mioo... Cuantos Esperamos Esta Sesion... Hasta Llore... Duko Eres Grande... Esta Sesion Va Para Top 1.",
        "La epicidad de este tema está fuera de serie",
        "gotas dentro de mi vaso siento que todos me juzgan cuando doy un pasoooooooo hablan como si no conocieran el fracaaaaaaaaaaaasooooooooooooooooooooooooooooooooo",
        "Bizarrap quiero una sesión de kyotto",
        "SIN DUKO LA ESCENA ARGENTINA NO EXISTIRIA",
        "Duko y Paulo, 2 capos que no necesitan tener canciones las cuales tienen que ser discotequeras para destacar, después de escuchar la #50 me recordó a la #23 por el sentimiento que traen ambas, y el como cuentan su trayectoria y algunos problemas. Y para quienes critican a estas 2 por no cumplir \"espectativas\" entiendan que no son canciones que escucharias en una fiesta ya que bizarrap les da su espacio para que se explayen y decidan que tipo de musica hacer, y bien se sabe que quevedo dejo la vaya alta, no significa que esta session esta por debajo de esa. los que seguimos a Duko desde el 2015 sabemos cuan importante es esto.",
        "Al minuto 0:34enpiezan a salirle los tatuajes a duki y al principio de la canción no tiene tatuajes",
        "Bizarrap, de verdad, COMO PUEDES SER TAN BUENO",
        "TE AMOOO DUKO ERES GENIAL EL MEJOOR PERFECTA TU BZRP CASI 3 AÑOS DESEANDOLAAAA, LA ROMPES EN TODAS TUS CANCIONES, ESPERO \"APOLO 13\" CON ANCIAS",
        "ufffffffff🇦🇷🇦🇷🇦🇷🇦🇷🇦🇷🇦🇷",
        "ROMPISTE ",
        "Modo diablo ... el duko",
        "Bien merecido ese #1EnTendenciasDeMusica",
        "Wow valió la pena cada maldito segundo ",
        "todo el flow tiene este tema,esta muy buena,llego muy lejos con la carrera DUKI",
        "La verdad que yo sigo a biza desde que subio la freestyle session de Lit Killah y a el Duko lo sigo desde el quinto escalon y es un orgullo para mí poder escuchar este himno. Hace como 2 años que estoy esperando este momento todos los míercoles vengo aca a twich a instagram y a todos lados a ver si biza subia esta session... tenia las espectativas MUY MUY altas y siendote sincero... esta session supero todo lo que esperaba y la verdad que me sorprendio una banda. Aca esperando la parte 2",
        "+6 millones de reproducciones en 3h️ Enhorabuena Biza y Duki  \nLO CONSEGUISTEIS ",
        "La letra no es para cualquier mono \nPero biza la verdad que te pasaste con la instrumental, se puede sentir desde el principio como se va erizando la piel a medida que avanza la canción. Sentimiento puro la verdad es la primera canción que me genera eso",
        "Valió la pena? valió cada maldito segundo ",
        "Todos los días escucho esta session antes de irme a trabajar y es imposible no llorar sabiendo cuanto la luche!",
        "Duki nunca decepciona, un genio total junto al Biza",
        "Larga vida a DUKO, la combi perfecta \"BIZA & DUKO\", increiblemente creible su humildad",
        "Llego a 1M en menos de 10 minutos \nmerecido chicos lo están haciendo genial ",
        "Uff amigo el detalle de los tatuajes apareciendo a medida que contaba su historia, detallazos. ",
        "el comienzo de todo , de sus tatuajes , hasta el ecualizador de su voz en todos sus temas ufff  Bizaaa te pasastee!! exitoos",
        "Después de largos años Finalmente el Duko esta aquí ",
        "Vamos por más bizarrap ",
        "QUE ORGULLOSO SER ARGENTINO Y QUE TAMBIÉN LO SEA ️🇦🇷!! ROMPIERON TODO",
        "soy el unico que se dio cuenta que cuando dice \"si quieren ver a dios yo se los presento\" metieron un sample de dorime?",
        "Es una barbaridad que buena letra y beat la puta madre",
        "Muy buena chaval",
        "Aqui estamos desde que no había ni para unas zapas nuevas... Y ahora tenemos a las tres rayas y a muchos patrocinio más que un equipo de fútbol ️lo logramos carajooo.",
        "2:04 la mejor parte",
        "GOOOOOOOD",
        "Vamos Duko 3 M por día no esta nada mal  teniendo en cuenta que no es una Sessions comercial",
        "Como hay tanta gente si solo han pasado 2 min  nunca llegare temprano ️",
        "\"La vida me pegó de frente igual me levanté y la dejé contra las cuerdas\" El mayor orgullo de la escena ¡¡ARGENTINA!! 🇦🇷🇦🇷🇦🇷",
        "Like si amas a biza",
        "TE AMO DUKOOOOOO",
        "Esta de locos está canción , hasta llore de felicidad  , luche admirando a Duki desde sus inicios  hoy solo digo que ya somos más ️saludos de México  #MODODIABLO️ #ARGENTINAESTAENLACASA",
        "Que buena la canción ",
        "Si yo digo «Quinto», ustedes dicen «Escalón»\n¡Quinto!, ¡Escalón!\n¡Quinto!, ¡Escalón!\n¡Quinto!, ¡Escalón!",
        "Que buen bit la verdad!!",
        "No soy de comentar, pero esta sesión me ha conmovido gracias Biza y Duki por hacerlo una vez más. No cualquier tema te eriza la piel y está si fue la ocasión. Sigan así los mismísimo de siempre!!! Felicitaciones!!",
        "Para cuando la sessions con Kronno Zomber??\nLa sigo esperando desde el tema God Zilla,de Kronno Zomber,pero tu nunca lo llamaste pa la sessions ):",
        "Si esta parte está dura, no me imagino la parte 2 ",
        "Like : Duki \nComenta: Messi",
        "lo mejor solo no deberías usar mucho autotone eres muy bueno",
        "Esto era lo que necesitábamos todos ",
        "“Empezamos tocando para 30 personas y ahora llenamos el estadio” ️‍️‍",
        "Te amo Duki, Gracias por este himno, DE ARGENTINA PA LA CASA 🇦🇷",
        "Cuantos se dieron cuenta del momento en que empiezan aparecen los tatuajes en la cara de duki haciendo referencia de su evolucionn en la musica, un crack️‍",
        "Ver a duki después de verle en plazas con su vida sin lujos y sus problemas a estar aquí,me llena de orgullo ️",
        "Tremenda canción Ya tiene 27 de millones de vistas",
        "APRENDERSE ESTE TEMON Y CANTARLO FULL VOLUMEN ES LO MEJOR DEL MUNDOOOOO",
        "leer todos esos comentarios en este video dan ganas de llorar, hace años leías muchos comentarios con criticas y hoy en día lees comentarios hablando sobre la esencia de la canción, Biza, Duko, han logrado que todos entiendan lo que es hacer MÚSICA ",
        "23.000.000 en 3 dias esooo la esta rompiendo va contando como fue su vida y cada vez q sigue la cancion van apareciendo los tatuajes de su cara x si no lo notaron",
        "The best Duki",
        "La mejor",
        "0:50 y 0:54 me encanta como biza clava a la perfección los tambores del beat",
        "Crei que iba a superar mis expectativas... Pero las destrozo, esto va para la historia!! \n\n¡Grande Duki!",
        "Rompieron",
        "Genios️",
        "Señores salió a jugar dios ",
        "Y salimos pa hacer historiaaaaaa \nValió la pena la espera ️",
        "Eu alguien se dio cuenta que a duki le iba apereciendo tatuajes en la cara",
        "MUY MUY SUAVE, ESPERABA 562565 MAS ",
        "Ya le agarre el sabor a esta sesión ",
        "Si esta ya es una locura, imaginate lo que va a ser la parte 2 con el modo diablo ",
        "¿Soy al único que se le erizo la piel cuando el Bizza levanto la bandera?",
        "El parecer boxeador, 5%de verso y 5% de combinación de golpe",
        "Epic cómo se le van dibujando los tatuajes",
        "Amigo va a sonar muy loco pero cuantos fans del duko habrán fallecido y lamentablemente se perdieron este momento, me parte el corazón, me siento privilegiado de estar vivo para escucharla. Te amo duko y Rest in peace para todos aquellos que no estan ",
        "CADA AMANECIDO ESCHANDO AL DUKOO",
        "Pues nada ni una hora y más de DOS MILLONES DE REPRODUCCIONES esto lo va a romper bien fuerte VIVA EL BIZA Y EL DUKOOOOOOO ",
        "\"Despues de tantos años yo no le diría suerte\"\nDuki no era una moda, gracias por tanto Mauro, te mereces mucho más de lo que tienes.🇦🇷",
        "Creo que podemos resumir esta canción y su carrera con “CADA VEZ MÁS FUERTE CADA VEZ MÁS FUERTE, DESPUÉS DE TANTOS AÑOS YO NO LE DIRÍA SUERTE”",
        "El video, cada que DUKI va contando ssu vida aparecen sus tatuajes, como si representaran sus vivencias y experiencias, vaya QUE EXCELENTE SESSION...",
        "Muy duro ese pana ",
        "Bro reencarne 67894 veces para escuchar esta tremenda joya",
        "La mejor de largoooo!!!!",
        "Pasaron 4 días desde que salió la sesión y ya esta en el puesto *1 en tendencia de música",
        "Colaboración con Ghetto para cuando. Esperaría esa colaboración",
        "Es increíble la evolución de Duki todo a puro esfuerzo y dedicación, todos los que lean esto luchen por sus sueños ",
        "Falta la de wolty",
        "Biza te pásaste con duko porque era la session más esperada",
        "Te juro que está Session se la voy a hacer escuchar a mis futuros nietos. \nDuki representando como siempre! 🇦🇷",
        "esta session demuestro que el duko ya no puede sacar temas como antes",
        "escucho este tema 5 veces al dia desde que salio ... hablame de estar manija a tope!!!  cada vez mas fuerte!",
        "LA MEJOR SESSION DEL MUNDO",
        "escuchándolo cuando tiene 24 M de vistas 2.4 M de likes y la música menciona el 24",
        "LA MEJOR SESSION DE TODAS,  la que mas emociona y la que te inspira a cumplir tus sueños",
        "Falta redimi2. ",
        "Primeira musica de Duki com sucesso aqui no Brasil . Não conhecíamos, baita som. Parabéns",
        "Un distinto ",
        "Esperemos la parte 2 \nUna de las más esperadas",
        "La mejor session, en la primera parte lloras y en la otra te cebas de una manera impresionante. LO QUE GENERAS CON TU MUSICA DUKOOO. Gracias biza por convercerlo de hacer esta obra de arte, ARGENTINA ESTA EN LA CASAAAA 🇦🇷️",
        "Este chico simplemente es el número uno de la escena Argentina. Felicidades duko, cada vez más fuerte .",
        "Cada like reproduce otra vez el temazo \n\n0:003:51",
        "MOTIVACION TOTAL!!!",
        "Que locura",
        "Me pone triste que el duko hay olvidado sus raices y que no recuerde las promesas que hizo. Nunca me voy a olvidar cuando el jugaba tranquilamente al lol y sandra lo mandaba a comprar pan , en ese momente el juro no comprarle ninguna casa cuando sea millonario. No cumplio. Lamentable.",
        "Ese duko soy tu fan y bizarras 🇦🇷🇦🇷🇦🇷🇦🇷🇦🇷",
        "DOKI Bizarro ",
        "Falta segunda  parte ",
        "El mejor de la historia",
        "esta buenisima",
        "Duki grande lo extrañaba mucho",
        "La rompiste todaaaas hnoooooooooooo",
        "Épico Biza. Le diste durooo",
        "2:45",
        "Lo volvamos a ver todo el tiempo así llegamos a los 100 millones a las 20 horas!!!!!!!",
        "Aposté a que: si ganaba México la mundial hoy, yo iría al estudio de Bizarrap a hacer una Music Session por 2024. Entonces, que en 4 años más se decida! ",
        "DUKI (BZRP Music Sessions #50",
        "No escucho duki pero  WTF es un mounstro ",
        "YO ESPERANDO LA 2 PARTE",
        "La rompió el dukoo mejor que snow Tha product y Quevedo  y Tiago pzk es la mejor bzrp",
        "la escucho a cada rato es muy god el tema",
        "Bueno ahora necesito YA LA PARTE 2!!!",
        "Esto es demasiado bueno",
        "Dios que bueno que es Duki, no puede ser que todo le quede bien",
        "Todos aquellos que luchamos por nuestros sueños desde abajo nos sentimos identificados con este tema ️",
        "Es increible ver como llegan demasiadas vistas \n:3  en tan poco tiempo, ESTO VA A SER MUY RECORDADO ",
        "Duki, el que marco un antes y un después en la escena Argentina, jamás ha dejado de ser la persona de sus inicios, merece todo lo que tiene y mucho más, será reconocido internacionalmente, se lo va ganando poco a poco, es asombroso el poder apreciar su evolución desde el Quinto Escalón, simplemente épico. ️🇦🇷",
        "Increíble historia pura y dura  me siento orgulloso de aver visto y escuchado desde el principio  la escena argentina  y ver todas las evoluciones de estos fenómenos  increíble el duki (tema pa romperlo todo)",
        "esta cancion y lA DE QUEVEDO  son mis favoritaaaaaaaaasssssssss",
        "La mejor bzrp ",
        "Después de tantos años, yo no le llamaría suerte... A huevo!!!",
        "El tipo con la presión encima que tenía no defraudó en ninguna barra, es impresionante, gracias duki por nacer en esta tierra",
        "Cómo es verdad lo de \" no te van a negar un plato de comida\" mira que sin tener para comer, mí vieja dice \"dónde comen 4 comen 5\"",
        "MIS RESPETOS DUK",
        "Por fin salió. Cumplieron con las expectativas sin duda los mejores artistas argentinos que representan su bandera en alto orgulloso de ellos y.... A disfrutar este temazo y ver si sale una 2da parte (porque el final hace que parezca que habrá una segunda session 50)🇦🇷🇲🇽\nPd:Que buen detalle que a lo largo del tema aparezcan los tatuajes de Duki como si pasara el tiempo",
        "Duko  respeto absoluto , las raíces y todo lo que paso lo transmite de una forma sensacional , hace que todo se sienta como si lo vivieramos junto con el... mucha nostalgia",
        "Soy cubana y hace relativamente poco que conozco a estos artistas, y me enterece por conocer un poco más de ellos, y me emocionó mucho la canción. Me alegro de haberlos conocido y poder disfrutar de esta obra maestra",
        "Duko, Muchas gracias por este tema, desde que tengo 15 años te sigo, hoy en dia tengo 20 años y te sigo desde el quinto. Me representa mucho esto, Sos una leyenda, sos un distinto me hiciste llorar, te sigo desde que ganaste tu primer quinto y ver esta evolucion de madurez musical y mental es algo que me hace sentir orgulloso de todo esto, tu esfuerzo, no me arrepiento de haberte seguido, Skal! Para vos duko Te amo con mi alma",
        "alguien sabe cuando es la 2da parte??",
        "la primera parte fue el duki la segunda será el duko",
        "Jamás pensé que llegaría este día, bien merecido ese #1 en tendencia, grande Duko y el Biza ",
        "Felicidades a Duki x todo la fama que está teniendo le De mis todo nuestro apoyo y al biza x esta colaboración es una estrella \nArgentina esta en la casa",
        "Ese intro, ese flow, ese duko, maldita sea, marca un antes y un despues en tan solo unos minutos, que nostalgia maldita seaaaaaaaaaaaaaaaaa que buena que es!!!!!!!!!!!!!!",
        "Duki eres lo máximo, Gracias por esta sesión biza.\nDesde las batallas hasta ahora, todos vimos como crecieron a nivel musical, personas que tuviste y ahora no están, todos los momentos de tu vida los fuiste reflejando en tu música. Simplemente eres el número 1 ",
        "Me encanta la es cuchara  1000 veces ️️️️️",
        "TEMOOONNN\nLa verdad que no me imaginaba que iba  a ser tan buena",
        "This Rap music is beautiful melody!!!!!",
        "Oye bizarap \nme gusto la de trueno y la de Daniel y de morad y de quevedo y duki la nueva gracias por lo videos de música",
        "yo te sigo desde el remix de amorfoda",
        "te di tu like meresido dios",
        "La mejor session  ",
        "Esta música no se hizo para tik tok, se hizo para la historiaaa, TREMENDOO DUKOO",
        "Tengo 40 años y esto me emociona\nOjalá te escuchen más los pibes, Duki\nMis respetos para dos campeones",
        "Viéndolo para que cuando Messi meta gol quede con la música ",
        "Tremendo tema",
        "La primera vez que la escuché se me hizo extraña... Y la segunda vez, se me hizo increíble.\nSiento que va a ser muy criticada por tanta expectativa, y con el tiempo se van a dar cuenta de que la expectativa la superaron por mucho.",
        "como diria mi compañero dani paso la que nadie pensaba que pasaria",
        "Te amo duki",
        "Valió la pena? \nValió la pena cada maldito segundo ",
        "Se dieron cuenta que empieza sin tattoos y se le van dibujando?",
        "QUINTO ESCALON QUINTO ESCALON QUINTO ESCALON",
        "Yo conozco a Duki desde el quinto escalón y no me arrepiento de nada, la felicidad y orgullo que me da oírlo, no se me da mucho orgullo como un pibe como todos llegó a ser esto sigue siendo y será para mucho tiempo más",
        "GRACIAS Duko por tu rap, por tu música, por tus batallas, por tus inicios y tu presente. Sos el 1 hermano. Temazo que se hicieron con el Bizarrap.",
        "#1 en tendencias auuun ️️",
        "Na na na, INCREIBLE GUACHO",
        "Grande duko siempre represantando a Argentina",
        "No soy fan de Duki pero este tema está bueno, estas personas trabajan bien duro a diario para cada día ser mejores profesionalmente, espero que algún día mis canciones sean tan escuchadas, Biza es un monstruo️",
        "El goat🇦🇷",
        "CADA VEZ MÁS FUERTE!",
        "Soy el único que sintió que por fin tanta espera valió la pena? Ojalá hubiera Sido así con esa fuerza la de Paulo :c",
        "Te amo duki soy tu fan nº1",
        "Muchos llegan solo por su música, otros llegamos por la historia que transmite en cada video, nada mejor que la aparición de tatuajes de duki mientras avanza la letra!",
        "Cuando la parte 2?",
        "#1 En tendencias En México 🇲🇽 una locura",
        "Me encantó la session porque representaron bien a Argentina y el duko y el biza la rompieron con esta yo creo q va a ser el hit del verano en Argentina. Saludos a todos los q están viendo el comentario.:)",
        "parte 1 :0",
        "El inicio me pegó directo en la nostalgia, que hermoso que artistas tan grandes no dejen de lado sus raíces, esto es lo que los hace trascender",
        "Barras, talento, emoción, y manija en un solo video. No puede ser tan grande este hijo de yuta, y no podemos amarlo tanto por haber elevado la escena argentina del trap. Mauro gracias por nunca perder la esencia.",
        "Vine de la parodia de Messi xd",
        "Necesito  que vendan  más de este grandioso  producto",
        "Bo alta sesión rre epica",
        "La rompió 🇦🇷🇲🇽 dejó mi comentario acá para cuando alguien comenté y dejé su like me recuerde escuchar esta rola una  bzrp sesión con ckan,babo, Natanael Cano, Dharius, zimple, millonario,Gera mx,MC davo, Santa fe klan,tiro Loko, santa grifa y Carlos slim,",
        "Vamos duki vamos Argentina 🇦🇷",
        "Que buena música haces biza eres un dios",
        "QUE FLOW EL DE DUKO, DE ARGENTINA PARA EL MUNDO. 🇦🇷🇲🇽",
        "Esta session va para todos pero especialmente a los que nos siguen desde el principio, nunca vamos a olvidar nuestras races",
        "Bueno, 11 días en tendencias #1 de México, ya bajen a duki por favor jsjsjs",
        "18 o 19 años tenía cuando vi batallar a Duki por primera vez,(ahora tengo 24)y unos meses después conocí los Combo locos del biza(se llamaban así si no mal recuerdo),y la verdad les tenía fe,sabia que llegarían lejos,son de esos pibes que los vez y sabes que tienen algo especial,y se lo dije a un amigo que llegarían lejos,(Rodri si de casualidad te encontrás con este comentario te lo dije jaja)la verdad wuachos que temazo,gracias por tanto y ojalá siempre vayan por más!",
        "La verdad es que duki me sorprendió, los felicito excelente sesión con biza !!!!",
        "Un anillo de Sonic en esta parte 2:42",
        "alguien mas se fijo que cuando nombra a sonic biza pone el sonido de los anillos de Sonic??? increible los detalles, lo piensan en TODO",
        "esperando la parte 2",
        "Vellos de punta, siguiendolo desde el quinto escalon.",
        "Que tal y haces una sesión con Sebastián yatra",
        "0:38",
        "2:44 dorime",
        "Pero esperen.. Siempre cocino.",
        "Primeros 30 minutos y 2M millones en la casa, GRANDE DUKO, sacando una de las mejores sessions!!!!",
        "\"Después de tantos años yo no le diría suerte\"\nQue lindo que bb duko este cumpliendo sus sueños, realmente se lo merece♡",
        "\"cada vez mas fuerte después de tantos años yo no le diría suerte\"",
        "me encanta el hecho de que no sea comercial. No conozco la historia de duki pero esto hace que los que no lo conocemos desde hace tiempo sepamos todo lo que a pasado para llegar donde esta. \nPd: biza una sesión con Karen Méndez, gracias :)",
        "No hiciste una session, nos hiciste el año entero, gracias duki, ya eres un grande hermano.",
        "El quinto escalón, duki, paulo,dani,lit killah klan,wos,sony, trueno, replik, mks... Cuanto talento en un grupo de gente tan chico.... Es asombroso",
        "Es un temazo",
        "EL GUIÑO AL QUINTO ESCALÓN LO MEJOR ",
        "Sois unos cracks que pieza 🇻🇪🇻🇪",
        "Inevitable llorar para los que a pesar de haber caído tan bajo, no se rinden!",
        "Está bueno , igual que la sesión de Paulo Londra . En el sentido de que se superaron pero no es música como la de Quevedo para bailar , sino más que nad para pensar así lo veo yo . Espero q el próximo sea para bailar",
        "6 millones de vistas y 1.5 millones de likes en menos de 4 horas, una bestia Duki",
        "Me gustó , buena canción biza",
        "Tuve suerte de haberlos conocido cuando no eran nadie y verlos ahora con su vida toda exitosa es algo bastante placentero y me alegra que hayan logrado todo lo que se propusieron",
        "La gente que todavía no la ha escuchado no sabe una mrd fuera de joda, literalmente es la canción que te hace sentir que te querés comer el mundo  por qué vos tambien podés",
        "temon",
        "Cada vez más fuerte, después de tantos años yo no le diría suerte. 🇦🇷",
        "El detalle de los tatuajes revelandose poco a poco en las primeras lines es god, es brutal ",
        "Ta re bueno",
        "LO QUE HACEN NO ES MUSICA, ES HISTORIA!!! LA ROMPEN TODA SIEMPREEEEEEEE ️",
        "Los pibes de barrio que llevaron el trap Argentina al mundo, siempre con humildad ",
        "VAMOS POR ESOS 10M EN UNA HORA SIGAMOS REPRODUCIENDO",
        "Doy pasos gigantes y la huella es tan grande que nada la borra y nadie las olvida",
        "1 Millon de vistas en menos de 10 minutos ",
        "Un grande, sin dudaaa",
        "Es una buena muestra para los que todavía no entienden lo que está pasando , a los que desde el desconocimiento critican o miran de reojo a esta generación de artistas.\n\nEsta generación viene hace tiempo creciendo, no solo en números , apoyo del público, capacidad de emocionar e inspirar a la gente (como si eso solo no fuera ya suficiente) sino también desde el profesionalismo , lo musical , la lírica y muchísimas otras cosas que justifican porque esta generación viene a paso firme y hace tiempo escribiendo la historia!",
        "Como puedo ver el partido De Brasil 🇷🇸 serbia XD",
        "Ha superado mis expectativas, pensaba que nadie iba a superar la sesión de Eladio y Frijo...pero llegó",
        "Te juro q la escucho todos los dias,y escucho la letra y la melodia y lloro pero cuando entra en modo diablo uffff",
        "Os habéis dado cuenta que, por cada parte que pasa, le salen más de sus tattus en la cara? ",
        "Otra vez aquí uu",
        "Las mejores músicas",
        "\"Empezamos cantando pa 30\" 2022 +30 millones de views en una semana",
        "Lo que fue el quinto, mágico.",
        "Lo que todos hemos esperado por mucho tiempo y ahora la rompio.",
        "Biza para cuando una session con grupo 5 porfavor, estamos esperando",
        "24 de junio nacio una persona que me convirto en una persona franca y escuchando sus rimas tan claras.  Gracias duko , gracias biza , los sigo desde mucho por aca lamentablemente . Me hubiera encantado estar en conciertos pero bueno no se puede . Agradecerles sus temas y sigan asi",
        "NOS ESPERABAMOS UNA COSA Y ESTO ES MEJOR PERO MUCHOOO",
        "Una de las mejores sesion para mi",
        "0:43 esta parte me pone la piel de gallina cada vez que la escucho",
        "LA ROMPIERON GUACHO DUKI Y BIZZARRP EN LA CASA  UN ORGULLO POR SU TRABAJO DE AMBOS  BENCIONES SALUDOS",
        "tremendo tema la rompiste duko saludo grande y saludo grande a bizzarp  ",
        "me hace falta una con akapella",
        "Dorime",
        "Esperaba algo comercial y genérico , pero esto es ... Simplemente arte",
        "Este chico es imposible que falle una session.",
        "BZRP!",
        "Es brutal como no tiene ningun tatuaje.. y  mientras crece el tema se van viendo",
        "VALIO TOTALMENTE LA ESPERA DE ESTA SESSION HDP!!! DUKO LA ROMPE BZRP LA ROMPE, JUNTOS LA ROMPEN!\nDespues de esto que hay? Que puede ser mejor que ver estos 2 cracks juntos? NADA.\nFelicitaciones por romper todos los records (si ya se me adelanto un poco, pero hay alguna duda de esto?)",
        "Tengo un amigo que falleció en diciembre del año pasado por un accidente de auto, él estaba muy emocionado por la bzrp de duki y no llegó a oírla al final. Leo, este tema va inmortalizado para ti, voy a venir a oírlo a diario hasta que se me olvide lo que ocurrió, gracias biza, gracias duko, le recontra pusieron al tema. ",
        "me parecen muy poca views por lo que es esta pedazo de cancion. se nota que la gente si no es comercial no le sabe a la musica",
        "Que alegría saber que el pibito que inició rapeando ahora es reconocido mundial mente grande el duko ",
        "3;52 de puro arte!!!",
        "todos estabamos esperando esta session y esta god .   psdt : si se dan cuenta en el inicio el duko no tiene tatuajes en la cara",
        "Esta sesión es legendaria, siento que está sesión transmite un mensaje de  superación, encerio me parece algo increíble ️️️️",
        "la piel de gallina, la mejor session para siempre.",
        "Fue realmente un placer escuchar a Mauro despues de tantos años, es genial, solo Bizza lo puede lograr :)",
        "1 millón de vistas en 12 minutos todo el mundo estaba esperando esta BZRP session, buenisimaaaa",
        "Grande biza y gran temazo con duki. Biza llegaras muy alto tienes un talento de otro planeta.",
        "Chicos hagamos que esta joya llegue por lo menos a 50 Millones antes del mes",
        "Increíble canción, cumpliendo expectativas como siempre",
        "la mejor session de todas",
        "Muy duros hermanos",
        "Alguien más lo espero con tantas ansias ?? \nValió la pena la espera",
        "Esto es mucho mejor que la de Quevedo y eso que Duki no es  el mejor rapero.\nLa gente no sabe apreciar el rap.\nEspero un tema con  Cosculluela, con Kendo, Ñengo Flow y Nach.",
        "Deberia duki neo ysy hacer un album de modo diablo porfavor",
        "Orgullosa de ser argentina. Gracias por representarnos tan bien. Los amo duko y bizaaaaaaaaaaa",
        "esoo",
        "biza cuando un tema con wos",
        "momento 2:39 cuando dice sonic se escucha el sonido de sonic y en el momento 2:44 cuando dice Dios yo se lo presento se escucha do ri me",
        "Dia 1 pidiendo que hagas una session con @3AM.oficial",
        "5:29tremendo",
        "ESTA MAÑANA NO TENIA GANAS DE LEVANTARME PUSE ESTA ROLA Y AHORA ESTOY HACIENDO EJERCICIO",
        "OJALA ESTA SESION TENGA MAS REPRODUCCIONES ES BUENISIMA ES MI FAVORITA HASTA AHORA",
        "Que aun no los conozco pero que sepan que los quiero mucho Gonzalo y Mauro",
        "Mega canción enorabuena",
        "Para cuándo la bizarrap music session de Neo Pistea?",
        "1:50",
        "Cansionasa",
        "La carrera de duki da orgullo,hizo conocer a su persona y después de tantos tropiezos se levantó y se quedó firme para siempre hizo historia siempre",
        "Todos los que sintieron las líneas saben lo que esta canción significa, fiel a lo que estuvo ahí desde el inicio, Grande Duko.",
        "obra de arte",
        "Tengo 193 años, fui tripulante en el Titánic y amo la música. Éstos pibes no paran de sorprenderme. Csm",
        "Es increible como en solo cinco horas ya tiene más de 8 millones de vistas. Esto solo lo puede lograr el genio de Bizarrap y el rey de Duki.",
        "Va gente a por los 27 millones de visitas",
        "esto es un super Hit en unas horas y ya esta en el puesto 1 y tiene 1,7 M",
        "nache ta bueno me motiva",
        "La mejor bzrp session ya tiene 13 días en el top 1 de tendencias en México, TODO ESTÁ BASTANTE BIEEEENNN",
        "Quien mas noto el efecto tipo khea\nPero sin duda la 1 parte es una bomba ",
        "Que joya, soltando cositas, lo hizo para él y para los que les gusta lo que hace el duko, no está forzada la session, hizo lo que quiso y eso es lo mejor",
        "Like Si Te Gusta La Session 50#  :)",
        "Dos leyendas un temazo, esto hará historia",
        "Terribleee broooooooo, no paro de escucharlo",
        "Esta es una sesión histórica y dentro de nada la vamos vamos tener sonando por ahí en todos los lados soy de España pero deseo que la pongan en la mundial ya que Argentina merece ganar  mucho animo Bizarrap ojalá algún día pueda trabajar contigo me encantaría gracias por esta sesión de puro Trap ️",
        "Cuando lo prometieron había quedado en escuchar por primera vez la sesión de dukl con mi en ese entonces pareja estábamos súper emocionados esperándolo, terminamos hace 2 meses, pero eso no impide escuchar y disfrutar este temon, escucharlo hace recordarla y ahora q se q ella se encuentra bien hace q me guste más está canción por lo mucho q nos gustaba duki",
        "LA ROMPEEEEE COMO SIEMPREE  EL DUKOOOO MODO DIABLO",
        "La mejor bizarap secion junto a Quevedo y a trueno y Nicky Jam",
        "Amigo, q tema con tanto sentimiento, es tan bueno q lo transmite, la piel de gallina es poco, los q saben por todo lo q paso el duko, el chabón cantaba en los boliches y se quedaba a dormir en casa de desconocidos, Dios siempre premia a los q nunca bajan los brazos y no ponen excusas!! Todo un toro, un warrior  Duk ",
        "Esta session la estábamos esperando hace mucho y ahora que llegó superó las expectativas, QUE GRANDE EL DUKI ️",
        "yo pensaba q en el segundo 0:06  decia  Quito Ecuador",
        "Soy el único forro que mientras la escucha mas se emociona?? La llevo escuchandl unas 478 veces desde que salio",
        "hermasa la cancion te a mo",
        "Otra canción de este CRACK,GRANDE!!!",
        "TE AMO, y como siempre digo, GRACIAS por tu música ",
        "cada vez que lo escuchas te das cuenta de los detalles > < JAJA, En el 2:42 el anillo de Sonicccc aaaaa. GENIOSSSSSS",
        "0:44 Imposible no emocionarse con esa barra para los que los seguimos desde el principio",
        "la #1ra Vez que la escuche, SE ME ERIZO TODA LA PIEL ",
        "Es el DUKO!!!",
        "en esta session no vimos a duki vimos a mauro",
        "Que linda manera de contar la historia del duko desde el 2015 hasta ahora ",
        "Dia numero 11 comentando ",
        "Quedé impresionada por los 2 bizarrap te pasantes incluye al duko otro palo pa la historia, yo estoy con ustedes hace 2 años",
        "Una con kronno zomber porfavor vamos esperando mucho por una sesion con el #kronno Zomber",
        "Duki es recontra serio a al firme",
        "\"Cumplí mi misión de rapero, le compré a mamá la casa que quería\"\nCuántos desearíamos eso, te felicito duko.",
        "la vida es dura pero duki demuestra que no hay que rendirse",
        "Amamos cuando dice \"al ysy y al neo sepan q los quiero y pienso en ustedes a diario \"",
        "Temazo! Y literal nos dan a entender que esto es la evolución del Duko ya que empieza sin tatuajes en la cara y le van saliendo mientras cuenta diferentes etapas de su carrera ",
        "0.00",
        "3:11 En serio que esa parte del final quedó demasiado bien, imposible no querer gritar eso",
        "Sin duda... LA MEJOR SESSION DE BIZA DUKI GRANDE ️",
        "Muchos se rinden, pero este no es el casó!!! 🇦🇷\nLos 1 en letra y en los bit...️‍",
        "Me produce tantos sentimientos… simplemente el mejor artista de estos tiempos, dominando todos los géneros ",
        "me recordó a la session de Paulo, ambos explicando su historia y hablando con la verdad, muy buena session la rompieron los dos",
        "Vine por un video de Messi ",
        "Esta canción te da ganas de hacer de todo",
        "Alta session",
        "BOY DANDO PASO POR PASO Y CALLENDO EN FRACASO PERO COMO DISE DUKI ESE NO ES EL CASO A LA JUVENTUD LOS BOY A CONSEJAR EN ESTA VIDA UNA FUERTE CAIDA TE TENDRA QUE PASAR PERO NO POR ESO TE TIENES QUE RAJAR TE TIENES QUE LEVATAR SALIR Y DEMOSTRARLE AL MUNDO  QUE TAMBIEN LLEGASTE PARA TRUNFAR Y NO SE OLVIDEN DE DIOS QUE EL ES EL UNICO QUE LOS PUEDES ALLUDAR",
        "La session que esperaba desde que escuché al Biza🇦🇷",
        "para cuando el bzrp de ozuna ,badbony,maluma y cartel de santa",
        "Duki BZRP musica sesión #50\nLetra\n\n3, 2, 1",
        "Solo esto .\nUna BELLEZA !!!!!!",
        "Con esta music session me está pasando algo parecido a lo que me pasó con la de Quevedo, al principio no la amaba (o sea simplemente opinaba que estaba bien) pero después de escucharla varias veces tengo ganas de escucharla cada vez más",
        "No confundir!!! Esto no es temporada de Reggaeton... Es la Bizarrap del Duko. ",
        "La nostalgia que dió de por lo menos a los que  lo seguimos desde el inicio siempre supimos que llegarías lejos duki \nNosotros siempre confiamos en ti y seguiremos aquí firmes",
        "Conocí a duki con no vendo trap a la par del quinto escalón y me emociona ver lo lejos que llegó él y todo. Gracias duki, y a biza también, que lo conocí cuando hacía videos de batallas con humor y remixes. Los amo ️",
        "ME VOLARON LA CAPOCHA QUE BESTIAS DÍOS!!! ",
        "vamos por esos 100 ohhhhhhhhhhh",
        "Venga viza por la segunda parte",
        "Ese Pana Es Un Genio Tiene Que Frenar a RD 🇩🇴 A Colaborar Y Hacer show",
        "Mis felicitaciones a Sandra por este pibe y a bizarrap por este hit",
        "Arriba bizarrap esta re buena y más con el duki",
        "Hace 4 años conocí a duki y la verdad no me arrepentiento de nada,estuve cuando todos decían que ya no sonaba en 2020 y aquí sigo firme ahora que está en la cima.\nEl orgullo de LA ARGENTINA🇦🇷",
        "Superó todas mis expectativas, mi sesión favorita",
        "Duki con bizarrap, 15M de visitas en solo en 1 dia. Historico que sentimental la primera parte, historia que no se volvera a repetir. Duki con quizas menos de 25 años la rompe, si muere las letras quedan siempre en el cora DUKI Y BIZA HISTORIA",
        "Muy duro bizarrap desde Tampa fl \nAll day",
        "Biza ase sesiones de rap",
        "Qué lindo es verlo al duko en la cima!!, yo lo conocía desde el quinto! que hermosas batallas nos regaló ",
        "buenisimo duki un capo",
        "por favor DUKI! MÑANA GANEMOS POR DIOS!",
        "Esta bzrp sesion claramente es de las mejores es una canción como la de los viejos tiempos de Duki, es un gran cantante y además esta esde las bzrp más esperadas por la gente. Like si amas a Duki.",
        "gracias por este tema duko, a seguir adelante y fuerte!",
        "Como se llamaría esta session : No hay fracaso",
        "Tengo 54 años mi hija me enseño a escuchar a DUKI  fuimos a su concierto en Lima - Perú y me pareció genial, esta session me emocionó.",
        "una para robleis",
        "Sin ser Argentino, siento un orgullo brutal por Argentina. Aguante 🇦🇷",
        "Mauro Lombardo se esta convertido en una en una leyenda musical, y me siento muy orgulloso de seguirlo desde que rapeaba en las plazas, Felicidades a Biza y a Duki ",
        "Esto es el pasado, presente y futuro ",
        "0:44 simplemente la mejor parte",
        "Simplemente hermoso ",
        "Yo primera vez que escucho este rapero y me encantó cada palabra se me erizaba la piel, la parte de \"ponte dentro de mi vaso, siento que todos me juzgan cuando doy un paso\"\" me encantó",
        "Desde mi adiestramiento militar, fue un honor escuchar esta session ️",
        "Sigue creciendo biza",
        "Son los pocos que hacen calidad en sus letras, sin insultos, con trabajo, con mucho sentido y mucha composicion, grande DUKI ",
        "2:40 el efecto de los anillos de sonic es completamente hermoso, en todos los detalles biza",
        "Gracias a toda la gente y toda mi familia por ayudarme a salir de la mierd@ ",
        "️\nWho love this song ",
        "VAMO BIZA",
        "Me encanta este producto es muy rico y muy economico",
        "te amo duko, gracias por existir y hacer mi vida mejor con tu música ",
        "Dios mío que bueno es el flow 2:18",
        "Me acuerdo cuando te seguía en tu cuenta de facebook soy uno de los primeros dónde solo subías rimas de raperos y no cargabas gafas",
        "De pie muchachos, hoy nació un nuevo Himno. ",
        "Que no les sorprenda que no tenga tantas vistas, son pocos los reales que entienden esta session ",
        "️️️LOS MEJORES️️️",
        "una obra maestra",
        "Cumpli mi misión de rapero le compré a mamá la casa que quería, es el Duko you Know",
        "Mi session fav gracias Duko y obvio tmb al Biza"
    ],
    "comments_disabled": false
}