{"video_id": "Gzs60iBgd3E", "comments": ["Esta session va para todos pero especialmente a los que nos siguen desde el principio, nunca vamos a olvidar nuestras raíces", "Dónde están todos los que creímos en este gran artista ", "¿No les pasa que después de una session, hacemos un largo tour por el canal?", "Fue un honor haber conocido a Duko en el quinto escalón  muy significativa la letra", "Acá los que siempre estuvimos, que chingon que no olvidaron que todo esto viene por el free sigue adelante Bizarrap y Duki", "sufro de depresión hace años y solo recién encontré la fuerza pa irme a terapia. tus letras y tus temas siempre me ayudaron a encontrar la fuerza pa seguir adelante pero ahora toy teniendo un bajón y esta canción es lo que me está dando más coraje pa no soltar todo. gracias Duko por ser tan grande artista y persona, estás ayudando un montón de gente y espero que sepas cuanta fuerzas transmites a tus fans", "\"Cumplí mi misión de rapero, le compré a mamá la casa que quería\" Cuántos desearíamos eso, te felicito duko.", "Duki, así como dices que sos un milagro, nos muestras de que nosotros también lo somos, y solo basta saber que estamos vivos y mientras eso suceda podemos lograr lo que sea, mientras tengamos la convicción de levantarnos siempre.", "Todos los días escucho esta session antes de irme a trabajar y es imposible no llorar sabiendo cuanto la luche!", "Fue realmente un placer escuchar a Mauro despues de tantos años, es genial, solo Bizza lo puede lograr :)", "Yo soy español, pero sigo al Duko desde el 5nto y al Biza desde los combos locos, y soy fanático de la escena y movimiento argentino y es un orgullo lo que están logrando, yo siento su éxito como propio. Lo que han hecho por el movimiento hispano no tiene sentido. \nSolo puedo decir que la espera mereció la pena.", "Esa lírica, esas barras, todo es mágico en esta canción. ️", "Con solo 17M de reproducciones tiene más likes que muchas de las otras sessions con 10 veces más reproducciones, Duki el más querido, el que más fans de verdad tiene, gracias por tanto Dukooooo", "Cuando te fijas más en el \"beat\" disfrutas muchísimo más de la canción  y te das cuenta de lo buena que es", "Soy de 🇵🇷 y de verdad que admiro como a evolucionado argentina en la música ", "\"Cumplí mí misión de rapero, le compré a mamá la casa que quería\"\nTodos nosotros deseamos poder hacer eso felicitaciones duko te lo mereces", "Esta buenisimo el tema me encanto  Vamos  biza Vas Triunfando cada Dia Te amamos! Ahora esta cancion se va hacer viral", "Casi 25 millones en cuatro días \nLeyendas", "Esta canción no es para Tik Tok. Es Inspiración que viva el Rap Latino y sus raices ", "La música es como una leyenda,nunca muere.", "Esta canción es ejemplo de que con trabajo fuerte y dedicación todo se puede lograr! Super orgulloso de estos dos genios,espero yo lograrlo algún día también en la música 🇵🇷", "Es una joya esta bizarrap, ambos representaron el rap y el talento argentino, duki con esa letra y ese beat de trap la rompió totalmente, saludos desde la bandera Mexicana 🇲🇽 ", "Esta sesión es espectacular, la música, como van apareciendo sus tatuajes, es sencillamente espectacular... Ahora  a por la parte 2 3:49", "Claro que no es suerte Duki, es talento, es no rendirse, es luchar por tus sueños. ", "\"Cumplí mi misión de rapero, le compré a mamá la casa que quería\"\nCuántos desearíamos eso, te felicito duko.", "que orgullo haber vivido todo esto duko", "Esto merece estar en tendencias por siempre", "Lo grabaron con una Orquesta!!! Por eso suena tan grandioso!!! Por eso nos conmueve y nos deja con piel gallina  porque es Música, carajo!!!!", "Dejo mi comentario acá para que cuando a alguien se le ocurra dejar un \"me gusta\", me llegue una notificación y me recuerde que tengo que volver a escuchar esta joyitaaa", "LETRA\n\nDUKI:\nEl milagro de Sandra y de guille nacido el 24 e junio", "Mi hermano falleció la semana pasada y no llego a escuchar esta locura, pero se que cuando toque en vivo esto va a llegar al cielo y a sus oídos también", "Mientras más la escucho se vuelve mejor y mejor dioossssss, es increíble", "CADA VEZ MÁS FUERTE DESPUÉS DE TANTOS AÑOS YO NO LE DIRIA SUERTE ", "ESTA ES MI SESSION FAVORITA GRACIAS BIZA Y DUKI", "3 días y 24 millones de vistas felicitaciones Biza y duko soy su gran fan saludos desde Argentina Lima ️️ y si existe", "Esta música no se hizo para tik tok, se hizo para la historia ", "A todo volumen con auriculares esta parte me pone la piel de gallina  00:40", "Yo primera vez que escucho este rapero y me encantó cada palabra se me erizaba la piel, la parte de \"ponte dentro de mi vaso, siento que todos me juzgan cuando doy un paso\"\" me encantó", "Increíble duki cómo creciste te mereces todo amigo hasta lágrimas me salieron con tus palabras", "Cada vez que la escucho es mejor que la anterior, es increíble diosssss", "1 en tendencia\nBzrp siempre rompiendo con cualquier tema \nGrande bzrp", "Si prestan atencion al video, duki empieza el video sin tatuajes y mediante cuenta los sucesos de su vida le van apareciendo en la cara poco a poco, que nivel de sesion mamita.", "Vaa gente hay que subir las visitas y comentarios \nYa casi tiene 24 millones de visitas", "Desde chile escuchando a duki desde sus inicios 🇨🇱🇦🇷", "Aquí los que estuvimos con el DUKO desde el principio de su carrera , desde el primer hasta el último tema que sacó este grande artista ️", "Cuando estás arriba, es orgullo plasmar todos los factores, obstáculos y esfuerzos de día a día el inicio.. ahora un triunfo, una enseñanza, una manera de expresar los límites que te propones sin expectativas..", "Si fuera boxeador entraría con este temaso ", "Cumplí mi misión de rapero, le compré a mamá la casa que quería ", "Simplemente épico, después de tanto tiempo que salga está session y sea tan buena... Mereció la pena cada maldito segundo de espera.", "Me pongo a pensar y me pongo a pensar que está canción es muy profunda, ya que habla de su pasado y sus problemas en su carrera musical, pero aún así siguió adelante sin mirar atrás, hasta alcanzar la fama y aún así nunca se olvido de sus leales que estuvieron con el en un principio", "Orgullo es ver que una canción que no se hizo para ser un hit sino para agradecer a los fans qué estuvieron desde los inicios llego a más de 6 millones en cuatro horas CONVIRTIENDOSE EN UN HIT ", "Ya perdí la cuenta de cuántas veces la he escuchado pero me sigue gustando más y mas", "duki este tema lo escucho cuando tengo ganas de dejar de todo lo que estoy haciendo, es una puñala de motivacion esta cancion, gracias por tanto bzrp y duko, al fin una cancion que te da un empujon de motivacion para todo ", "Estuve con la piel chinita toda la canción.  Duki, muchacho, tu humildad te va a llevar lejísimos. Dios bendiga el talento de ambos. Viva el talento argentino. Btw, ojalá ganen el mundial 🇦🇷️", "Aun recuerdo esos tiempos en la secundaria, cuando escuchaba tus temas de camino a casa y me llenaba de emoción a la vez que nostalgia con muchas de las letras de las canciones, no hubo una sola canción con la que no rompieras.. pero yendo mas atrás todos conocimos la bestia que eres en el rap en el quinto escalón y muchos no lo van a negar no hacia falta sacar un buen tema para darte a conocer, bastaba con una batalla para dejar en claro que tu naciste con ese talento. ", "Ese día estaba de la sh*t porque había fallecido mi gatita. He estado escuchando estas barras desde su lanzamiento y solo les agradezco por el tema ya que me representa un poco. Duki y biza sigan creando temazos", "Todos necesitábamos este duko, represent a todos los pibes que se rompen el culo todos los días para poder cumplir su sueño como el mauro lo hizo, sos la influencia que necesitamos y vas a ser la leyenda que el mundo disfrutará hasta la eternidad", "Se me pone la piel de gallina gente escuchar al duko me hiso ver todo desde el principio y me recuerda q no ahí fronteras cuando uno busca encuentra", "Es la primera vez que la escuchó y sin palabras  ,rompiéndola como 100pre Bizarrap y Duki", "Sesión mucho más que lograda, quédate tranquilo duki que lo lograste, transmitiste lo que quisiste, todos los que te queremos amaremos está obra de arte forever️", "Sigue siendo tendencia #1 en Guatemala", "La fe es lo que te llevo a todo esto duki, nunca la pierdas, bendecido hermano!", "Esta session la estábamos esperando hace mucho y ahora que llegó superó las expectativas, QUE GRANDE EL DUKI ️", "las canciones de duki vienen cada vez mas fuerte woww", "Literal es como una canción de amor y de rap al mismo tiempo", "Va gente a por los 24 millones", "Segunda vez que la escucho se me puso la piel de gallinaaaa", "Puse esta canción a todo volumen , y mis vecinos rompieron mi ventana para escuchar mejor ", "Por primera vez, me gusta más la letra que el ritmo de la canción, que también está muy bien, por supuesto. Una canción en condiciones. Felicidades a los dos, estoy deseando escuchar la parte 2", "Esto no es una session... es la historia de, no una, LA leyenda...\nCada vez más fuerte ! \nCada vez más fuerte !\nDespués de tantos años yo no le diría suerte !", "DESPUES DE ESCUCHAR ESTA SESSION COMO 30 VECES ME DI CUENTA DE 2 COSAS QUE NADIE DICE:\nCuando termina de decir \" la 512 me tiene sintiéndome Sonic. Al lado mío quedaron lentos\" se escucha el sonido de cuando agarras un aro de Sonic.\nY cuando dice \"Si quieren ver a Dios yo se lo presento\" se escucha el Dorime en el Beat, DIOSMIO biza eres un GENIOOOO", "Que temazo bizarrap siempre con los temazos que nos gustan", "01:09 considero que esta es la mejor parte de toda la session en mi opinion ahora que paso un tiempo y ya tengo mas criterio considero que es una musica muy bien producida pero poco disfrutable no lo escucharia en mi dia a dia con mis auriculares es una excelente cancion pero una mas del monton no varia ni revoluciona en nada tqm duki espero sigas mejorando como lo haces cada dia saludos desde Paraguay ", "3:52 minutos en los que no solo duki nos cuenta su carrera, sino también los que empezamos a seguirle desde el 5to sentimos la caricia de recordar cada sensación que nos daba cuando largaba temas under, no tengo palabras, amo a duki, amo a mauro y amo la proyección que hemos tenido varios en reflejar nuestra motivación en el.", "DE VER A DUKI EN EL 5TO ESCALON Y A BIZA EN COMBOS LOCOS A VER ESTA SESION... es una maravilla lo que crecen dia a dia... <3", "La producción que tuvo la hace más legendaria a la session simplemente los mejores biza y duko", "es increible esta cancion y tubo 14M de vistas en 1 solo dia", "Viste pibe que se puede hacer canción sin tener que decir grosería desprestigiar a las mujeres hablar de Rumba alcohol droga y sexo, escuché criticas negativa de la canción y eso me llevo a escucharla y sacar mis propias conclusiones y es muy alentadora ademas el beat está brutal como siempre lo hace bizarrap ", "Que grande DUKOOO esta canción me da la motivación que necesito ", "Es increíble que haya salido hace tres horas y este numero 1 en tendencias y tenga más de 5 millones de reproducciones, de locos la session del Biza ", "Está canción una joya...\n\nDuko siempre rompiéndola...\n\nTe apoyo siempre y mis respetos, cada vez una música mejor...", "Emocionan. Orgullo argentino!", "Duki recuerdo la primera vez que escuché Hello Cotto, te veía en el quinto y me explotaste la cabeza con ese flow de aquella canción, recuerdo cuando le gritabas a tu mamá que algún día serías millonario y famoso mientras jugabas lol con los chicos en stream, ahora tengo 25 años y tu música me sigue gustando como el primer día, ahora trabajo y cuando salgo del día laboral y voy para casa estresado queriendo despejar pongo rockstar y vuelvo a emocionarme escuchando ese flow maldito que le metes, un saludo desde Ecuador crack", "Arte puro dejando un mensaje motivacional el primero el unico creo pudiendo aver hecho un tema pal verano viral la rompio toda my respect dukoooo", "\"Duki\" me alegro de que estes representando a Argentina,el trap argentino sin vos no es TRAP ", "ESTUVIMOS DESDE EL INICIO Y SEGUIMOS A DIA DE HOY, TE AMO DUKO GRACIAS POR TANTO, ORGULLOSO DE SER ARGENTINO Y ESO QUE NACI EN PERU,  ES NUESTRO AÑO CARAJO VAMOS LA ARGENTINA LPTM", "La eminen-cia de Argentina,señores/as con ustedes Duki,gracias amigo por estás palabras que salen del cora y es verdad que SOS el talento....saludos", "Empezamos tocando pa' 30 persona y ahora te llenamos el estadio", "Escuchar con audiculares esta sesión es otro nivel", "El beat es una locuraaaaaa y de la letra ni hablemos el mejor DUKOOO ", "El nuevo himno de Argentina ", "Cada vez más fuerte después de tantos años yo no le diría suerte", "No voy a morir mientras vivan mis letras  barras que nunca olvidaré ", "Ufff. Temazo!!!!! Se superaron los dos el duko y el bizza", "Me gusta mucho esta canción porque es muy inspirado y la letra es muy buena la mejor", "Bua y añadiendo los tatuajes según narra los logros es brutal ", "Está viendo la reacción del xokas y cuando dije \"¿Y sus tatuajes?\" y ahí me di cuenta que les faltaba pero mientras pasa la canción van incrementando hasta lo que son hoy \nINCREÍBLE", "Mi hermano murio hace 3 meses justo el 16, y esperabamos este tema, y lo estoy disfrutando por los 2 aun que no este aqui hubiera deseado que lo hubiera escuchado", "Todas las BZRP son hermosas pero está ufff un temaso ", "la piel de gallina lo escucho en loop amigo increible está"]}