{
    "video_id": "H3Yh9Gi-p3M",
    "comments": [
        "If you a real cap fan you been on nocap since nocap and capalot days",
        "Ur the hardest",
        "11:11",
        "Not you feel inlove with a white girll ",
        "Whenever u hear \"AL Geno on the track\" u know Issa banger",
        "It’s giving juice wrld trippie red ",
        "Fuego",
        "He saying he like his women on drugs ",
        "Seeing Jev genuinely enjoy a game while he does a camo grind is such a wholesome thing to me.",
        "Once it popped up I tapped on this song",
        "My fav song stay on repeat ️‍ juss came from a heartbreak w my female and this is hurting me more ",
        "yessir",
        "I ain’t expect this",
        "Some songs hit harder than yb songs this one of them fosho OHIO",
        "You fuck with Nocap you’ve been into hip hop for a long time and know what’s real",
        "gas",
        "Nocap really the backend baby ️",
        "No cap really Making moves \" love your consistency ",
        "NoCap= ",
        "The most versatile artist from the city.",
        "Another one ",
        "Music videos be the sickest",
        "this shit so mid, nocap was onna streak of bangers",
        "This been leaked but still appreciate it",
        "This shit hard af",
        "Chief keef Dropping Almighty So2 in Dec",
        "STAY SAFE YALL️",
        "10k views a hour…. Motion",
        "Aight this one mid",
        "Album soon",
        "Can’t never fall the biggest ",
        "🫡",
        "Yessir ",
        "We need a no cap yak rod wave tape",
        "This hardd",
        "hard️‍",
        "Thank you for dropping",
        "Wow I really like this song  ",
        "No Cap you need to do a song with Youngboy people fucx with both of yall",
        "Way better then youngboy, yeah i said it.",
        "This the cap we been missing ",
        "No cap ur  don’t worry abt the hate you need no one.",
        "No cap the goat this man will be remembered for generations give this man his flowers while he here he don't want it when he gone️",
        "First this shii going be fire",
        " ",
        "yb better",
        "7/10",
        "Drop this on Spotify asap!! ",
        "Everyone Gonna make it ... Just push and trust the process... On God",
        "I don’t care how I die but I ain’t dying sober !  Ong",
        "Love u no cap",
        "Longlive Wap ️",
        "Your a big deal cap ️",
        "MOG here 🫡",
        "NoCap stays making these modern classics..",
        "NoCap is a huge inspiration to me and I WILL produce a song for him one day.",
        "No cap the fucken goat man I'm telling y'all this man word play is too hard y'all don't understand he the lil Wayne of this generation ",
        "Rappers tht switch up diversity",
        "Here for first comment",
        "ATP cap what trippie was supposed to be",
        "This song and video should be blowing way more than this ️",
        "This beat goes crazy",
        "This song is terrible! This genre he try enter doesn’t work",
        "She keep feelin on my heart I think I broke her ",
        "Here before a million like this .",
        "NoCap the  no ",
        "NoCap a star fr",
        "Best artist",
        "THIS SONG IS GREAT BUT CHECKBIT IUT JESUS IS OUR LORD AND SAVIOR TURN WITH ME TO CHRIST",
        "3/3 nocap been dropping ",
        "Safe ta say Paul ",
        "I can tell you how to (sell ) it ima (Sold)ier \nShe keep feeling on my heart I think I broke her (broker) ",
        "Respect,Respect 🇵🇷",
        "THIS NIGGA MUSIC SLOWLY BUT SURELY HEAL MY PAIN ",
        "All his music has a sad vibe, he's not versatile",
        "Hard ",
        "One of them ",
        "No cap went too hard on this",
        "It’s always good day when nocap drop",
        "I only listen to No Cap cuz Gunna can’t drop",
        "Who else waits until the red line stops at the of each of his songs because they are so unique and he's so talented",
        "NoCap these girls dangerous cap",
        "Wish Young Boy and Capp could’ve kept that shit off the net️️️",
        "NoCap and juice wrld would’ve been crazy",
        "Trippie and no cap would be fire",
        "I was worried when I saw the thumbnail and title. I'm so glad that we're doing thanksmas, you have helped so many people. Let's help some more!",
        "When he said vampire i left",
        "This the flow I been waiting to get more of",
        "Is YB better still?",
        "no cap the toughest rapper rn",
        "Nice song  mr Crawford",
        "Give this man his flowers RIGHT NOW ",
        "NBA NEVER BROKR AGAIN TOP ARTIST ",
        "Hit me up",
        "Is that a Nocap album coming ??",
        "NoCap drops are the BEST days",
        "We can all agree that nocap is a legendary person",
        "NO CAP BETTER NO CAP",
        "was just listening to Cap",
        "Idk what’s better the beat? The video? Or the lyrics? ",
        "The Harry Potter quote and saying she can do what she wants now has me crying, seeing how relived and free she feels. In a world so full of bad endings I'm so happy that, by the looks of things, she got the good one <3 :",
        "all his instrumentals never miss ",
        "No Cap for president ️",
        "NoCap.   this song is actually good. The first time you hear it, is a feeling you won't get again. Nice song.   I like all my all my girls dangerouusss",
        "ARTIST OF THA YEAR TWO NO  WORLDWIDE PUT THIS ON THE ",
        "U getting main stream cap plz don’t do dat to us",
        "Here on the early side No Cap   Music Get a nigga through a hole day ",
        "Can’t believe this guy beefin Yb dat shit hurt lol fucc it tho still Wit U cap 🫡",
        "I don’t drink but I be buying all the bottles",
        "he so versatile",
        "5am",
        "Cap too hard",
        "That get to you they get to me",
        "Why u snapping like this ",
        "like of nocap the goat",
        "I wish one day 4 i die cap use one my beats   i still pray ",
        "Don’t miss ",
        "hardest out ",
        "GOAT !!!",
        "Love the slight alternative sound bleeding through this",
        "cap ain’t missed yet",
        "Tuff",
        "I fw this ",
        "Your last song wasn’t it I’m being real but this one is ",
        "He really hit a million",
        "G.O.A.T",
        "NoCap hasn’t missed yet ",
        "NoCap & AL Geno = Jordan/Pippen",
        "I Dont Care How I Die But Ian Dying Sober",
        "Need dis one ",
        "Nigga don’t miss…",
        "NoCap go in sooo hard on this right here, straight up BANGER! He aint like all them trappers out here these days who just be GOIN HAM ON THE GRAM by usin dat IGROCKET dawwwt cawwwm jawwwn to get mad followz and shiiieeett...",
        "I fw it ",
        "Another NoCap W",
        "THIS MAN DONT MISS ️‍",
        "This nigga on his polo g shit with these guitar type beats man where that youngest shark alive type cap at",
        "No cap better",
        "first one️️️️",
        "Who's can relate to the video? Dupe . Oh God protect #Nocap for us ",
        "Juice wrld wouldve slid with him on this ",
        "Yb trippin cause no cap ain’t tryna pick sides or beef wit nobody he just wanna be a artist smh ️",
        "This song is a CIassic.",
        "The constant drops! Yesssss! Ready for a new album! ",
        "The goat",
        "Early",
        "shii so hard",
        "🇸🇳🇸🇳",
        "This shii hard ",
        "NOCAP!!!!!",
        "#NOCAPBETTER",
        "Itqetq u look so cute",
        "The biggest  Artist RN",
        "Shit is so inspiring to me , My music is just as good as no cap  and ima be on top like him one day ",
        "Yea this the one ",
        "Just as I thought the day couldn’t get better we are blessed with another hit by NoCap",
        "How this man hasn’t blowing up yet should be studied",
        "Song is ok",
        "No cap dirt #yb better",
        " I hate the see this but your idols become your arrival and I do think YB be is jealous of him.",
        "Real rapper",
        "No cap can get on any beat fr it’s crazy ",
        "“ SHE THINK SHE EMO, but to me she just AH MODEL️”",
        "We love the backend child we love the main bird",
        "Here first my favorite artist",
        "We da GREATEST ️",
        "This the one",
        "He’s dropping more yb passing him\nThe torch",
        "Need that NoCap and Rylo album ASAP after this",
        "Sheeeshhhh",
        "Peeped trippie redd in the video lol",
        "HE DONT MISS",
        "GOAT AT TS FR.",
        "Ready to re-sign",
        "“She say she emo but too me she is a modelll”  !!!!!!️.",
        "You turnt on YB so now WE turning on you!!! #QUANDOBETTER",
        "ts just hits different bro",
        "Apple Music  ",
        "I think I done fell in love ️with a white girl I got angel’s I got demons on my shoulders I don’t care how I die but I ain’t dyeing sober ",
        "No cap the hardest but this song weak just being honest",
        "Juice wrld would go hard on this ",
        "Song pressure frand this japanese girl looking good af",
        "This one go crazy big bruh ",
        "I still a post up in the hood like a motor ️",
        "You trim fr",
        "in this situation top is wrong",
        "why tf was i just listening to sun up to sun down and now i see yu drop.",
        "No hate but it sounds like he doesn't put too much effort in the music nowadays.\n\nI came up off \"New Ones\" Ghetto Angels, Radar and some. His early sounds had more effort.",
        "Okay then",
        "Go to 4pf bruh",
        "Nocap is the best rapper rn gotta love this nigga bro",
        "This song is so perfect this give me old noCap vibes",
        "YB better",
        "gotta appreciate how consistently this man puts out heat",
        "NoCap da GOAT like every time he drops its for real gunna be a good song not just some bs.",
        "What a legend, the guy cares about charity more then himself, I can’t, someone protect this man at all costs.",
        "NoCap",
        "This goes hard and so does the video of the song “Gandi - 3 Telefona “ ",
        "Lost me at the white girl line ",
        "SUPERSTAR ",
        "I wonder if they’ll like my shit lik this lol",
        "The real ones know this song from ig story snippet lol  thanks Cap ",
        "I still post up in the (hood) I’m a (motor) ",
        "Yess sirrrrrr ️",
        "Bro is diffferennnnnt",
        "Sleeping through the day the dark times I wake up️️",
        "I love that feegee wants to curse but still wants to keep it family friendly",
        "Him ️",
        "First ",
        "Yb wannabe",
        "Pretty girls be the most craziest",
        "Here ",
        "Cap ona guitar tracks be the hardest songs!! ",
        "hardest",
        "If you like the song like this comment !!",
        "Thank you… NO CAP ",
        "No one can beat the swag of NoCap . he is not like other trappers who are going viral by using authentic views to get  views up Thumbs up who agree",
        "One his hardest songs",
        "Keep walking on water ",
        "cap need to talk more shit I was feeling that",
        "First",
        "please don't go industry ",
        "Never miss ",
        "Love no cap flow it’s fire",
        "I love this song I started crying to it.️️️",
        "One da ima blowup,yessirski,onJesus!",
        "Drop that song at the end of no hook",
        "Cap you been a hit streak bro \nThese niggas don’t here you bruh \nIsaac kilt this video too   #1600 #NBA",
        "Closes thing to juice wrld and lil Wayne omm",
        "My Favorite",
        "U hard cap",
        "YB ain't trippin.... YB trippedddd outttttt !!!! Nocap x Rylo ",
        "I’m proud of you .",
        "I pray for you the devil got you right now but when my father come back to his people he gone help the darkness repent and pray more than ever ",
        "This man too much of a underrated  superstar...him and rylo  the two that's meant to takeover frfr",
        "Istg I’m dropping tears cap can’t nobody innerstand man you help me beat suicidal thoughts much love fam ",
        "goat",
        "Jus be urself cap we with u no cap",
        "FREE RYLO FROM HIS LABEL",
        "U N D E R R A T E D",
        "I absolutely love how this part of the game plays out. The scene with the ink demon was absolutely amazing, love this serie sor far",
        "Fw with this vibe heavy  ",
        "Lowkey reminds of lil Tracy fireeee",
        "#251 ",
        "And it’s that POPSTAR CAP",
        "Nocap X Rylo Rodriguez = ",
        "️I'm still here in 2022...",
        "Knowing that you have been able to play this is making the wait more difficult!  I'm still so appreciative that despite that, you keep your videos pretty much spoiler-free (or provide plenty of warnings for those who want to avoid it)",
        "Bro dis shit so fuckin hard ",
        "NoCap Flow so unique and Different I can't wait till the world wakes up on him ",
        "beat had me shaking shi was fire",
        "Backend child and 1400",
        "No  ",
        "YESSSSSSSSSIIIIIIIIRRRRRRRRR",
        "this shi is crazy  nocap a genius",
        "This fie ",
        "Bro met Travis Barker ",
        "Keep going NoCap ♫♫♪♪♪",
        "Best rapper out right now No Cap",
        "2:09 what is the girl on the left doing",
        "Him",
        "I saw trippie Redd I hope they got sum, cause dzamn I want it",
        "Radio Jawn ",
        "Let's goo",
        "Every time he drop it’s straight 🫡",
        "Fye ",
        "I fuck wit it",
        "too easy for you fr",
        "Too hard️",
        "I just want to say thank you nocap you are the goat you are on a different level you are nothing like these other rappers but i just wanted to say thank you for pursuing a music career i don’t know what i’d be listening to if you wasn’t around your such a blessing to the industry much luv cap",
        "He sound just like youngboy",
        " KENTRELL, NOCAP WILL ALWAYS BE THE BIGGER ARTIST ️",
        "dah",
        "i tune in when cap drop",
        "true roccstarr ",
        "What the fuck. How I ain’t never bumped NoCap before?",
        "He Dont Miss.",
        "Goat  ",
        "Movein$ilencegang",
        "It’s a movie ",
        "EmoCap tuff hold on️️️",
        "NoCap on ",
        "I’m still gon post up in the hood I’m a motor",
        "Oh my fucking god ",
        "i’m livin innis dangerous world i’m only into dangerous girls",
        "Back with another one I swear no cap never disappoints me  they really undefeated out here and them together is amazing all his music helped me get threw a lot my favorite rapper",
        "FYAAAAAA ",
        "shid made me get off my ass going to have the biggest designer clothing brand soon…\n\nrealchaser",
        "Legend back at work",
        "251️MOBTOWN R.V. Taylor project made me️",
        "Sincere.",
        "Out here really workin️🫶",
        "First Goat!",
        "Yb proud of u",
        "Who ever reading this I hope that ….nah lol it’s not one of these kinda comments, y’all stay focused though ",
        "Always dropping at the right times",
        "New no cap fan",
        "Noti gang. In nocap we trust",
        "Vibe setter",
        "its dangerous bein talented & intelligent",
        "Another banger ️",
        "Juice wrl would of went crazy on this rip  some one  make a remix",
        "All we need is juice wrld verse..!!",
        "This next album he getting back to them MOBILE ROOTS ",
        "It’s YB or NOBODY",
        "Whoever’s reading this, I pray that whatever your going through gets better and whatever your struggling with or worrying bout is going to be fine and that everyone has a fantastic day! Amen",
        "NO CAP keep ur foot on they head!!  like alway!!!",
        "this shit on repeat ️‍",
        "Guitar CAP don’t miss",
        "Man Im rocking with Cap",
        "Sheesh",
        "Didn't hear it yet, and I don't need to. I already know it's a banger ",
        "This beat hard asf too",
        "Damn who mad about yb and Nocap beef",
        "Turn me up baby",
        "I already listened 20 times",
        "A juice type beat",
        "No Cap Dont Miss !!",
        "@Nocap need dis on Apple Music asap no rocky",
        "Wolf",
        "He on a run ",
        "Another banger ",
        "Fireeeeeee",
        "\"This For Everyone Watching\" Y'all Be Safe Out Here Mane Cause Today Nor Tomorrow Not Promised This World Cold Asf We Can't Lose Nocap Bruh He Heal The Scars",
        "b",
        "Nocap come see me your the best",
        "Not a fan if the effect on this one Cap",
        "He don’t miss ",
        "The hardest out rn",
        "Rockstar shii",
        "wild ashh .... noooo cap",
        "i think cap does a good job",
        "In Cap We Trust",
        "Bro NoCap really be spazzing on EVERY BEAT LLC ",
        "need the asian girl in this vid @",
        "No cap for president bra omm",
        "The visuals ",
        "i needed this today ngl thank you no cap",
        "Reminds me of juice heavy",
        "mane they can’t fw you no cap",
        "1st",
        "cap man you too talented why u gotta turn into a sell out️",
        "Please somebody tell that's trippie redd in the studio with no cap! I must dreaming",
        "Goated ",
        "I said this will be trending..then looked down and he #22!",
        "Riding with Cap4L",
        "Perfect beat for this flow  ",
        "1Mill",
        "DONT STOP CRAWFORD WE GOT YOUR BACK",
        "YB BETTER",
        "Him & rylo rodriguez are two of the most underrated artists of this generation.. Literally your favorite rapper's favorite rappers  i just pray God keeps them alive coz if y'all listening to their music they really have people trying to kill them  and we need them alive",
        "I love your music keep up the work",
        "Let's take the moment to appreciate how much effort and time he puts into his content for us",
        "Capppppppppppppppppppp",
        "Its simple…Hes too good this shit fye, Cap never missed️he DIFFERENT️",
        "I love you so much sara \n\nCan’t wait to spend the rest of my life with you and our sons… ",
        "i dont care how i die BUT I AINT DYING SOBER",
        "New no cap song let’s go",
        "This vibe always go hard by nocap 🫡",
        "shoutout trippie ",
        "No cap on his yeat shit ",
        "I fukks wit this   \n\n#DangerousGirls \n#YOLO",
        "Wassup cap",
        "W",
        "Ayoooo NoCap x Trippie Collab comin",
        "No cap always spitting fire ",
        "YB BETTER ",
        "Love it",
        "NBA1400|1600  Real Rockstar this was hard cap so versatile you could do some shit like ozzy osbourne & you the neighborhood hero.",
        "Fire jus from da beat I know it is",
        "FIRST LITERALLY",
        "The ",
        "This is a certified banger",
        "Fyeee ",
        "This man really dropping bangers after bangers",
        "Keep going up can’t nothing stop you when your focused but yourself.",
        "post on itunes",
        "Could I make my music go big?",
        "Because it's amazing",
        "Bro definitely an artist. Saying he’s a rapper is an insult",
        "Bro drops straight fire without miss Everytime",
        "I see da homie repping Do yo Thang  ️",
        "I needed this Cap ️",
        "caapp",
        "Nocap You Fire bro ",
        "Sad how him and yb beefin now just goes to show that even the closest ones you be with can also snake you, Issa cold world be safe out there everybody",
        "Legend  ",
        "Only 78k in 7 hours is a crime people",
        "618",
        "No cap being putting the work and dropping consistently for us ",
        "video of the year no cap",
        "stereomud",
        "Yb and no cap next please  more wins my choice 🇳🇬 No one can stop no cap ,Still fan of ,The Hood dictionary,till today.",
        "Rip no cap",
        "Nocap never disappoint me ",
        "Вокал - никакой, тексты - пустота, видеоряд - посредственный. НО БИТЫ, почти в каждом треке шедевральные музыкальные проигрыши, которые останутся в моем плейлисте навсегда.",
        "Never miss. ️",
        "istg this shittt hardddd af istg I've been vibing to this since last year April",
        "Congrats on a milli subs",
        "Nocap dangerous",
        "fye",
        "Yb better gang when lil baby tried bully you yb stuck up for you when lil durk went for yb where was you at",
        "Kobe make my life easy#24",
        "NBA ON THE TOP ",
        "My favorite rapper",
        "Yeah yeah yeahhh ️",
        "0:02 THIS SHIT SUM HEAT ALREADY ",
        "This my Nigga man  if you hating on him I dnt wanna hear who a real nigga because it shows cap that nigga much love cap an the whole 1600",
        "Where the album?!Mixtape EP something",
        "YESSSS",
        "Nocap is so hard ",
        "fat future???",
        "Hell yea cap 1st",
        "So cold",
        "i can relate to all of it 100% facts on everything he said",
        "Idol",
        "Yessir nocap dropped ",
        "This shit is invigorating, this type shit makes me see a new sensibility and new tropes in this shit (just like YoungBoy since Blackball and em vids)",
        "Fix that shit with YB that’s all I gotta say don’t even care who’s wrong",
        "Nocap>>>>ya fav rapper",
        "This that one",
        "Juice wrld would go so hard on this",
        "Nocap dropping like yb constantly",
        "Damn bruh hopefully the shit with yb was. A misunderstanding",
        "#YBBETTER ",
        "NO CAP CANT MISS BULLS EYE EVERY TIME",
        "Goat ",
        "Top 3 rn ",
        "The hardest",
        "Gunna vibes",
        "Goatcap",
        "Cap a beast",
        "Why these not on Spotify ?",
        "NoCap one of the greatest to do it",
        "Trippie redd in the cut",
        "goat.",
        "Bro getting better and better every drop",
        "This man right up under YoungBoy he's passionate in his music to",
        "Undefeated  Niggaz can’t touch this pain",
        "CAP DA GOAT!! \nFREETHUG&WUNNA",
        "ALABAMA eating ",
        "Hard",
        "cap no matter how we feeling you always help us go through this life shit  we appreciate your music",
        "@no",
        "Yeeeeeeeee",
        "i like all my girls dangerous",
        "No cap never miss y’all keep being sleep ",
        "Cap Pluto",
        "Dope track",
        "bro had the turban on",
        "Legendary",
        "This sum different️",
        "this shit on repeat",
        "Masterpiece",
        "here before a mill",
        "i love when my man drop ",
        "He’s very slept on his music is myself only safe place.",
        "Big NoCap fan but let’s be honest this ain’t good enough",
        "This man just make my days better real shit I can be down! then I turn cap on & forget",
        "Yb better",
        "He had trippiered in that???",
        "No Cap Never Missed if I'm lie let me know ",
        "Best rapper out, drill/gangster beats and bars/songs. But actually has meaning  feels real",
        "I waited for this so long",
        "PlayBoi carti and trippie redd in the video bihhhhh",
        "Only real ones listen to NoCap",
        "She say she emo but to me she is a model",
        "#Cap4President",
        "Can we say cap never miss",
        "Who here from the beef wit yb",
        "I Fw NoCap. A Legend. Damn I Pay Attention To ALOT. Free On The Back Of His Fit. Free Nocap! Alotta times it's better to rock alone. Fuck fitting in. Do it by yourself! Guess he seeing it now",
        "First ️",
        "the goat.",
        "Never misses.",
        "lets talk bout the most under rated",
        "We don’t care is YB fuck with you or not",
        "Ou paka raboure Young Boy sou beat tande pousi... Gyèt manman'w",
        "Crazy🥹",
        "Love you cap ",
        "Yeah yeah amazing song Im  from nom",
        "I admire your work, my dream is lives from music like you do and I invest my money in music. I hope one day record with greatest artists as you. I have worked no matter what to achieve it and I trust God that sooner or later my dream will come true. Meanwhile I enjoy listening to your music and I will continue fighting to make you listen to mine one day. ",
        "U only live 1's, No Cap...",
        "Only because the police are out to bust the guy.",
        "@nocap Ion drink but I be buying all the bottles ",
        "Noting but fire ",
        "Nah ",
        "no ",
        "Giving me juice wrld vibes",
        "Bro don’t miss",
        "Sexually active type beat  s/o trippie redd",
        "First like literally",
        "Nocap music makes me love life ",
        "hit",
        "Cap does it again dude is literally my fav ",
        "Real Shit",
        "NO CAP BETTER THAN YOUNGBOY",
        "We can all agree that he never disappoint us with his content ",
        "Shii hot every time",
        "He finna go weird next year I bet",
        "Cap so underrated dawg",
        "️‍"
    ],
    "comments_disabled": false
}