{"video_id": "H3Yh9Gi-p3M", "comments": ["Him & rylo rodriguez are two of the most underrated artists of this generation.. Literally your favorite rapper's favorite rappers  i just pray God keeps them alive coz if y'all listening to their music they really have people trying to kill them  and we need them alive ️", "What a legend, the guy cares about charity more then himself, I can’t, someone protect this man at all costs.", "Just as I thought the day couldn’t get better we are blessed with another hit by NoCap", "Whoever’s reading this, I pray that whatever your going through gets better and whatever your struggling with or worrying bout is going to be fine and that everyone has a fantastic day! Amen", "We can all agree that he never disappoint us with his content ", "NoCap go in sooo hard on this right here, straight up BANGER! He aint like all them trappers out here these days who just be GOIN HAM ON THE GRAM by usin dat IGROCKET dawwwt cawwwm jawwwn to get mad followz and shiiieeett...", "No drugs,\nNo swearing,\nNo naked women,\nJust 100% real talent", "Even when he's shouting at us he's being wholesome, this man is a walking inspiration", "DONT STOP CRAWFORD WE GOT YOUR BACK️‍", "cap no matter how we feeling you always help us go through this life shit  we appreciate your music", "Istg I’m dropping tears cap can’t nobody innerstand man you help me beat suicidal thoughts much love fam ", "All his instrumentals always turn me soft and chilled.", "gotta appreciate how consistently this man puts out heat", "Hits right in the feels️‍", "Knowing that you have been able to play this is making the wait more difficult!  I'm still so appreciative that despite that, you keep your videos pretty much spoiler-free (or provide plenty of warnings for those who want to avoid it)", "This goes hard and so does the video of the song “Gandi - 3 Telefona “ ", "this shit on repeat ️‍", "I love this man his sound is so unique ️‍", "Always dropping at the right times", "No one can beat the swag of NoCap . he is not like other trappers who are going viral by using authentic views to get  views up Thumbs up who agree", "Let's take the moment to appreciate how much effort and time he puts into his content for us", "THIS MAN ON A ROLL so slept in it's insane", "No cap the goat this man will be remembered for generations give this man his flowers while he here he don't want it when he gone️", "Drop this on Spotify asap!! ", "Perfect beat for this flow  ", "I just want to say thank you nocap you are the goat you are on a different level you are nothing like these other rappers but i just wanted to say thank you for pursuing a music career i don’t know what i’d be listening to if you wasn’t around your such a blessing to the industry much luv cap", "Hits right in the feels‍", "The Harry Potter quote and saying she can do what she wants now has me crying, seeing how relived and free she feels. In a world so full of bad endings I'm so happy that, by the looks of things, she got the good one <3 :", "all his instrumentals never miss ", "No one can beat the  of NoCap he is not like other trappers who are going viral by using authentic views to get the views up. Thumbs up who agree", "This man just make my days better real shit I can be down! then I turn cap on & forget", "I absolutely love how this part of the game plays out. The scene with the ink demon was absolutely amazing, love this serie sor far", "I love you so much sara \n\nCan’t wait to spend the rest of my life with you and our sons… ", "This man really dropping bangers after bangers", "0:02 THIS SHIT SUM HEAT ALREADY ", "His songs sound so different from everybody else ️", "THIS A HIT ️", "This the flow I been waiting to get more of", "I love this song I started crying to it.️️️", "all i know is that nocap next diss song gone be hard as hell", "\"This For Everyone Watching\" Y'all Be Safe Out Here Mane Cause Today Nor Tomorrow Not Promised This World Cold Asf We Can't Lose Nocap Bruh He Heal The Scars", "Back with another one I swear no cap never disappoints me  they really undefeated out here and them together is amazing all his music helped me get threw a lot my favorite rapper", "No cap and YB been killing it ", "I was worried when I saw the thumbnail and title. I'm so glad that we're doing thanksmas, you have helped so many people. Let's help some more!", "Need that NoCap and Rylo album ASAP after this", "The constant drops! Yesssss! Ready for a new album! ", "This shit is invigorating, this type shit makes me see a new sensibility and new tropes in this shit (just like YoungBoy since Blackball and em vids)", "This vibe always go hard by nocap 🫡", "No cap always spitting fire ", "This man really dropping bangers after bangers ", "Give this man his flowers RIGHT NOW ", "NoCap Flow so unique and Different I can't wait till the world wakes up on him ", "The visuals ", "Everyone Gonna make it ... Just push and trust the process... On God", "Protect this artist . Only rapper that went hella hard when they got out of jail . ", "You can tell Jev is super passionate about the sport of mma. He literally watches pretty much every event even the smaller ones, he knows all the fighters and what they are and arent good at. I always enjoy listening to him talk about it cus a lot of the mma community is rather casual and only seems to care about the biggest fights . Its fun to watch them all fight whether theyre the best in their division or not", "This beat goes crazy", "I love your music keep up the work", "Love no cap flow it’s fire", "Keep going up can’t nothing stop you when your focused but yourself.", "I love howdelivers aggressive positivity to get the message across everyone, to do something good for those who need it", "Keep going NoCap ♫♫♪♪♪", "NoCap is a huge inspiration to me and I WILL produce a song for him one day.", "Always a good day wen no cap drop ", "This song is so perfect this give me old noCap vibes", "This is a certified banger", "No cap and rylo been dropping hits .....mobilans  keep Makin dem hits", "This may go unnoticed One day threw hard work and dedication ! I will make my dreams of being the best rap artist in the world\nCome true . ", "No cap being putting the work and dropping consistently for us ", "NoCap stays making these modern classics..", "This man too much of a underrated  superstar...him and rylo  the two that's meant to takeover frfr", "Who else waits until the red line stops at the of each of his songs because they are so unique and he's so talented", "All Hits No Misses Every Time Cap Drop", "always get me through the world.", "Bro NoCap really be spazzing on EVERY BEAT LLC ", "My fav song stay on repeat ️‍ juss came from a heartbreak w my female and this is hurting me more ", "Keep shining ️", "Bro getting better and better every drop", "Shit is so inspiring to me , My music is just as good as no cap  and ima be on top like him one day ", "NoCap and juice wrld would’ve been crazy", "Love it", "Stay safe  we need you", "Every time he drop it’s straight 🫡", "The consistency is crazy", "Let’s go Cap ️", "NoCap.   this song is actually good. The first time you hear it, is a feeling you won't get again. Nice song.   I like all my all my girls dangerouusss", "Another banger ", "This one go crazy big bruh ", "I’m up it’s like 5 in the morning and I’m listening to this but look…I like all my girls dangerous ️", "You did it again my brotha that solo at the end of the track pressure too", "Sleeping through the day the dark times I wake up️️", "It’s always good day when nocap drop", "NoCap da GOAT like every time he drops its for real gunna be a good song not just some bs.", "Its simple…Hes too good this shit fye, Cap never missed️he DIFFERENT️", "This next album he getting back to them MOBILE ROOTS ", "We need another album", "THIS NIGGA MUSIC SLOWLY BUT SURELY HEAL MY PAIN ", "this man will never miss.", "Legend back at work", "Absolutely Beautiful"]}