{"video_id": "hniQALX9-ic", "comments": ["the fact that lufu was in a completely different game has me cracking up", "That has to be one of the best thumbnails in a while", "What a way to go Vin.  Respect!", "gotta love the thumbnail of Loserfruit getting gooed on", "I love your content, keep going and never stop doing what your doing. \n\n\n\nNever stop being kind to people", "i swear this game will never die ", "\"Death can have me when it earns me\" is such a raw line and the fact that Kratos is the one saying it is just so satisfying.", "Lufu was just in the wrong game ", "I know something if they just stood on a Shockwave in center zone they could of survived without taking damage from goo", "Can we take a moment to realize how sus the thumbnail is lmao", "Bro I can’t believe Lofu was in a different game ", "There are so many dirty jokes I can make about the thumbnail ", "I said this last time worthy won and I’ll say it again worthy is the best player in pwr", "Mitch is the absolute best gooer", "GOOING ALL OVER LUFU", "If ur stuck by goo place a sheild bubble and stand so ur half in half out. U don't take damage", "that thumbnail is outta pocket bro ", "LOVE the PWR videos so much! I hope we get to see more IRL content like the hide and seek again or like a ninja warrior situations, e-sport athletes trying to be real gymnastic athletes kind. Worthy has been on FIREEEE recently! GG Radius and Sync, that was an epic final trio. Insane editing as always! ", "I love the fact that lufu went into the sniper game", "Whoever chose the thumbnail knew what they were doing ", "The sky base kid probably is playing from NA or somewhere where he's getting a lot of ping, so he lagged off", "Best PWR video so far", "Worthy best player in PWR honestly", "Waiting for Alex to be in these vids ", "To keap guns out of customs you have to remove animals. The person got the gun from a purple or gold animal they killed.", "I love how lufu is in the thumbnail when she didn't even join the right game", "Pwr should do a dial drop loot only video", "Vindooly placed 69th and got gooed.", "THANKS for the video guys it inspired me to make my own", "Wasn’t my best skybase to say the least...", "I love the goo gun  I think  it's better than grenades ", "W Vid. We need a part 2.", "If I played this my pc would’ve crashed ", "Why does Radius keep taking fall damage?", "Of course the thumbnail is the Lufu skin ;)", "i hate the goo gun dude like its so annoying when ur fighting someone and a whole squad comes up behind you and starts gooing all over you.", "Worthy is too good", "How do you guys create these game modes!", "i liked the part where that person got into the wrong game", "Chicken man deserved the win", "I absolutely hate the goo gun as well as shockwaves. Both are used way too much and make the game unfair.", "F’s in the chat for Charlie ", "Love ya vids man", "you guys should do swords and hammers tournament", "Radius doesn't stream enough!! Miss watching him", "The thumbnail tho ", "Why is Loserfruit in EVERY PWR thumbnail?", "Vindooly placing 69th in a goo gun only lobby ", "Every salute Vin in honor!", "Respect Worthy I thought you were gonna win and the lufu thing was so funny\n\nEveryone - melting each other with goo-guns\nLufu - Has snipers in a different game", "the guy that had a shotgun and did the wish version of take the L has pwr in his name", "I love the goo gun. A fun new weapon, a weapon that you can actually use cuz it doesn’t suck. Just love it", "Of course they use lufu for the thumbnail", "I love your content, keep going and never stop doing what your doing. \n\nNever stop being kind to people", "love these vids", "8:08 <———>8:11 death via fall damage", "Not lufu living her life, in an completely different match.", "Whoever chose the thumbnail knew what they were doing ", "I said this last time worthy won and I’ll say it again worthy is the best player in pwr", "the fact that lufu was in a completely different game has me cracking up", "Lufu was just in the wrong game ", "gotta love the thumbnail of Loserfruit getting gooed on", "Best PWR video so far", "The sky base kid probably is playing from NA or somewhere where he's getting a lot of ping, so he lagged off", "\"Death can have me when it earns me\" is such a raw line and the fact that Kratos is the one saying it is just so satisfying.", "I love how lufu is in the thumbnail when she didn't even join the right game", "I love the fact that lufu went into the sniper game", "I love your content, keep going and never stop doing what your doing. \n\n\n\nNever stop being kind to people", "I love the goo gun. A fun new weapon, a weapon that you can actually use cuz it doesn’t suck. Just love it", "Whoever chose the thumbnail knew what they were doing ", "Whoever chose the thumbnail knew what they were doing ", "Whoever chose the thumbnail knew what they were doing ", "the fact that lufu was in a completely different game has me cracking up", "gotta love the thumbnail of Loserfruit getting gooed on", "gotta love the thumbnail of Loserfruit getting gooed on", "Lufu was just in the wrong game ", "Lufu was just in the wrong game ", "the fact that lufu was in a completely different game has me cracking up", "I love the fact that lufu went into the sniper game", "I love the fact that lufu went into the sniper game", "\"Death can have me when it earns me\" is such a raw line and the fact that Kratos is the one saying it is just so satisfying.", "Vindooly placing 69th in a goo gun only lobby ", "pwr videos is the best u can also make pwr tournament using cars only it will be fun like if u like the idea", "the fact that lufu was in a completely different game has me cracking up", "good luck at the FNCS", "i liked the part where that person got into the wrong game", "Pwr is brilliant", "Can we take a moment to realize how sus the thumbnail is lmao", "Nahhh I know the thumbnail isnt lufu getting gooed  What is that, a gang bang ", "Worthy is crazy", "This video has the most sus thumbnail ever ", "5:05 nice to see us 🫣", "Worthy is my favorite pwr member", "I love how they know when they say something sus", "THat has to be the best thumbnail ", "If I played this my pc would’ve crashed ", "If I played this my pc would’ve crashed ", "If I played this my pc would’ve crashed ", "I love the PWR vids ", "CHARLIE throwing L's left, right and center"]}