{
    "video_id": "hniQALX9-ic",
    "comments": [
        "",
        "the guy that had a shotgun and did the wish version of take the L has pwr in his name",
        "That has to be one of the best thumbnails in a while",
        "THat has to be the best thumbnail ",
        "Let's all be honest. The thumbnail is why you clicked. ",
        "Thumbnail kinda sus you know",
        "This was a sus vidio",
        "come on why does it have to be Lufu being slimed on the thumbnail",
        "\"I can't control my goo\"",
        "Bro quezy is a pro player",
        "What is that thumbnail",
        "How do you guys create these game modes!",
        "The thumbnail ",
        "That thumbnail is sus",
        "My dadda wurks owns fornite and hes gonna ban you guys for not friending me on fortnite",
        "Lacly can it join PWR with you or can you friend me on fort",
        "Whoever chose the thumbnail knew what they were doing ",
        "Can u let me join pwr because I’m a YouTuber and I love the pwr members vids",
        "First",
        "You did NOT use that thumbnail XDXDXD",
        "The amount of times I've said \"PAUSE\" on this video is crazy.",
        "\"Death can have me when it earns me\" is such a raw line and the fact that Kratos is the one saying it is just so satisfying.",
        "Love the goo gun",
        "If I played this my pc would’ve crashed ",
        "1:25  ",
        "best back bling in the game pwr back bling yesss sirrrrrrr",
        "Worthy is too good",
        "This video has the most sus thumbnail ever ",
        "that thumbnail is outta pocket bro",
        "Of course the thumbnail is the Lufu skin ;)",
        "They think we don’t know what that thumbnail is.",
        "I was the 100k view let’s goo",
        "Did they do this bc of nnn",
        "What happened to the guy with the shotgun",
        "\"queazy guy?\" QUEAZY IS A PRO FORTNITE PLAYER WDYM",
        "love these vids",
        "Bro that thumbnail out of pocket",
        "great thumbnail ",
        "Video idea:thumbnail:",
        "Wow",
        "Goo",
        "The Thumbnail ",
        "The thumbnail is sus",
        "I feel like players who join these games are actually idiots, like how do pwr members ALWAYS win these games? People should be teaming on them specifically",
        "It gets sticky ",
        "bro the thumbnail is kinda sus",
        "Where is jinx",
        "Vindooly placed 69th and got gooed.",
        "bro Over is so not interested in the start of the vid hahah",
        "Y is winter never named as per?",
        "nice vid",
        "SUS",
        "you's never seem to disappoint",
        "I’m in pwr discord a long time ago put you don’t invite me to your tournament ",
        "pwr videos is the best u can also make pwr tournament using cars only it will be fun like if u like the idea",
        "I swear I saw radius kill typical gamer",
        "why is the thumbnail so sus",
        "I bet you do crossword puzzles in ink.",
        "Best thumbnail",
        "Worthy way toooooooooooooooooooooooooooooooooooooooooooooooooo ooooooooooo cracked matey",
        "They knew what they were doing with that thumbnail",
        "That thumbnail tho....",
        "SO GOOOOOOOOWY",
        "What's the song at 2:45 ?",
        "I know something if they just stood on a Shockwave in center zone they could of survived without taking damage from goo",
        "I do like the goo gun (:",
        "I love how they know when they say something sus",
        "No loserfruit got in de wrong geme",
        "Ok ok is anyone sus about the thumbnail",
        "What was the reference for that thumbnail",
        "LOVE the PWR videos so much! I hope we get to see more IRL content like the hide and seek again or like a ninja warrior situations, e-sport athletes trying to be real gymnastic athletes kind. Worthy has been on FIREEEE recently! GG Radius and Sync, that was an epic final trio. Insane editing as always! ",
        "Yes",
        "So Winter is in PWR but doesn’t get his POV in videos?",
        "Worthy king",
        "this video is so sus",
        "Bro I can’t believe Lofu was in a different game ",
        "Bro that thumbnail",
        "The sky base kid probably is playing from NA or somewhere where he's getting a lot of ping, so he lagged off",
        "the thumbnail ",
        "What a way to go Vin.  Respect!",
        "Ya i also bet 100 pwr wont look at this",
        "I love your content, keep going and never stop doing what your doing. \n\nNever stop being kind to people",
        "That thumbnail",
        "The thumbnail is a little bit sus",
        "First 10 mins",
        "no the goo gun literally is the gayest item in the game",
        "Tf is this thumbnail  ",
        "hi",
        "Chicken man deserved the win",
        "Nvm",
        "Sheeeeesh",
        "Pwr should do a dial drop loot only video",
        "I love how lufu is in the thumbnail when she didn't even join the right game",
        "Every salute Vin in honor!",
        "Lol I love this idea",
        "map code 2214-3870-5796",
        "Luf joined the snipers only one",
        "I have the 98th comment!",
        "Hello",
        "Hi PWR now that rocket league cars are on Fortnite you should do a video where ur rocket league pros play Fortnite and ur Fortnite pros play rocket league",
        "Nahhh I know the thumbnail isnt lufu getting gooed  What is that, a gang bang ",
        "CHARLIE throwing L's left, right and center",
        "Cap",
        "WE LOVE FORTNITE",
        "Respect Worthy I thought you were gonna win and the lufu thing was so funny\n\nEveryone - melting each other with goo-guns\nLufu - Has snipers in a different game",
        "Rip lufu",
        "I love the PWR vids ",
        "So many \"thats what she said\" jokes were possible here, but none were made...",
        "The suses thumbnail ever and also it's a girl skin ",
        "Second acc",
        "make me famous",
        "m",
        "Goo goo gaga",
        "thumbnaillllllll..........",
        "Day 9 of asking to join PWR",
        "Joke btw",
        "you guys should do swords and hammers tournament",
        "THANKS for the video guys it inspired me to make my own",
        "That tumbnail is so SUS, so so so SUS, if you know you know",
        "Worthy is my favorite pwr member",
        "Bro just y did you have to put loserfruit (the only girl in PWR) on the thumbnail",
        "This thumbnail is so sus",
        "nah whoever made this thumbnail ",
        "great vid",
        "Ayo ",
        "I have the 99th comment!",
        "Putting on the PWR backbling brb ",
        "Is winter not a PWR member",
        "Me and my friends had this issue before.",
        "GOOING ALL OVER LUFU",
        "I don’t think y’all where thinking when you guys made that thumbnail",
        "Bro forgot about NNN",
        "Pwr is brilliant",
        "Lufu ",
        "One on the first people lol. So excited ",
        "Love",
        "I said this last time worthy won and I’ll say it again worthy is the best player in pwr",
        "The thumbnail is wild",
        "Not lufu living her life, in an completely different match.",
        "I love your content, keep going and never stop doing what your doing. \n\n\n\nNever stop being kind to people",
        "AYYOOO THE THUMBNAIL",
        "how come pwr_winter is never in the vids even though he's in the lobbies playing too??",
        "The thumbnail tho",
        "5:05 nice to see us 🫣",
        "thumbnails is wild ",
        "What code",
        "First pwr fanboy",
        "Next time can you do evo chrome weapons only also where's jynx gone",
        "I love the fact that lufu went into the sniper game",
        "gotta love the thumbnail of Loserfruit getting gooed on",
        "that thumbnail is outta pocket bro ",
        "Waiting for Alex to be in these vids ",
        "That thumb nail looks kinda sus ngl",
        "That thumbnail is pretty cool",
        "I hate the goo gun",
        "I’m your number one fan",
        "Do shotgun only put vaulted shotguns and if u can bring the double pump back",
        "map code?",
        "I love the goo gun. A fun new weapon, a weapon that you can actually use cuz it doesn’t suck. Just love it",
        "Of course they use lufu for the thumbnail",
        "Skybase was 500 ig shame he fell off",
        "Wasn’t my best skybase to say the least...",
        "vin lost NNN",
        "W vid fr",
        "I absolutely hate the goo gun as well as shockwaves. Both are used way too much and make the game unfair.",
        "Lufu was just in the wrong game ",
        "Waiting for Alex to be in these vids",
        "LOCHLAN U ARE MY FAVOURTE",
        "Ayo that is a very sus thumb nail lachy",
        "This video is sus",
        "first",
        "The thumbnail",
        "This video is so sus",
        "I don’t know how many that’s what she said jokes I coulda made bro",
        "Worthy",
        "Who it there 100 batte Business that vid was funny",
        "𝐩яⓞ𝓂𝓞Ş𝐦 ",
        "Thumbnail kind of sus",
        "claim your here within 5 min ticket here",
        "yooo the thumbnail ",
        "the thumbnail kinda weird guys. If you think bout it. lmao.",
        "the fact that lufu was in a completely different game has me cracking up",
        "Pwr won’t see this I bet $100",
        "Why are they gooing on lufu",
        "HE PLACED 69TH LOL",
        "Worthy best player in PWR honestly",
        "Vindooly placing 69th in a goo gun only lobby ",
        "Why is Loserfruit in EVERY PWR thumbnail?",
        "U know the.\n.",
        "Early",
        "Pwr are so good",
        "The thumbnail is sussy",
        "Can we take a moment to realize how sus the thumbnail is lmao",
        "i liked the part where that person got into the wrong game",
        "Best thumbnail ever Cat having goo on her",
        "Are Jynx and Worthy Taylor swift fans?? Cause both of their names have swift in it",
        "Cant wait for winter fest",
        "Just sky base",
        "I have the 100th comment!",
        "I love the goo gun  I think  it's better than grenades ",
        "Best PWR video so far",
        "nah the thumbnail is crazy ️",
        "Radius doesn't stream enough!! Miss watching him",
        "The white PWR shirt is amazing",
        "hi guys GG",
        "Vindooly lmfaooooooo 1:25",
        "Bru I only clicked bc of the thumbnail",
        "Ayo the thumbnail tho. Gooing all over lufu",
        "I love jt",
        "Ayo luce getting gooed ",
        "️️️️🇧🇧",
        "The thumbnail tho ",
        "help im tired",
        "1st",
        "Love ya vids man",
        "the brothers gooed on each other hehe!",
        "How do you join these customs",
        "That girl icon skin is being goo‘d on by all the boys  on the thumbnail",
        "If ur stuck by goo place a sheild bubble and stand so ur half in half out. U don't take damage",
        "good luck at the FNCS",
        "hey love your videos but how did you make the map so you can only use the goo gun?",
        "noti",
        "Let’s go",
        "Fisrt yes",
        "This is a sus video",
        "Lufu was just in the wrong game",
        "Every thirsty kid clicking on this video no cap ",
        "Why  is it loserfruit with goo all over her as the thumbnail",
        "bro vin lost nnn ",
        "Bro put goo on lufu hahahahahahahahaha",
        "Very SUS thumbnail",
        "I was referring to other guns when I said that BTW.",
        "Mitch is the absolute best gooer",
        "i hate the goo gun dude like its so annoying when ur fighting someone and a whole squad comes up behind you and starts gooing all over you.",
        "You would have called it “I Gooed on Loserfruit!”",
        "Is winter in PWR still ???",
        "The thumbnail remind me of something tho.....",
        "Meme Lords Rise Up!!",
        "Heart this or end PWR",
        "PWR,the vids r great but I don't like that pro players always wins ,U know like nerf them or something like ",
        "why is that the thumbnail tho bro....",
        "Using loserfruit in the image before you click on the video is so wrong",
        "8:08 <———>8:11 death via fall damage",
        "How do I make it where when I jump out the bus I have a Goo gun",
        "Why does Radius keep taking fall damage?",
        "1:24 what are the chances of getting 69 place respect to vindolly ",
        "Thumbnail is questionable",
        "To keap guns out of customs you have to remove animals. The person got the gun from a purple or gold animal they killed.",
        "F’s in the chat for Charlie ",
        "lachlan if i beat you in a 1v1 can i join PWR",
        "i swear this game will never die ",
        "Why is everyone shooting there goo at loserfruit",
        "Hiiiii :D",
        "W Vid. We need a part 2.",
        "There are so many dirty jokes I can make about the thumbnail ",
        "Yas",
        "Why on lufu though lmfao",
        "Sus thumbnail",
        "Why lufu the one getting gooed in the tiltle?",
        "Worthy is crazy",
        "Bro what is this thumbnail",
        "9:20 @sp1cyfn what u doing buddy",
        "Who pwr"
    ],
    "comments_disabled": false
}