{"video_id": "hWe07O22db0", "comments": ["Maybe the judge can release a new rap song called, \"No Transfer?\" ️", "I cant believe it has been 1 year Feels like we just lost him yesterday  I pray God is holding Dolph in His arms.", "RIP YOUNG DOLPH, he was a true legend , he was showing mad people the way", "Isn’t this technically a statement?", "What happens in the dark comes to the light", "That’s right! “No guns in Jail,  you gotta stand on all 10” Half of them punks ain’t never been in a fistfight. Prayer for young dolps’s family", "We know he straight dropping statements", "Holy shit Mick living life like its death note. Dude spent two years creating and refining his defense for absolute destruction.", "\"Got no gun  in jail, he gotta stand on all ten\" 100 percent  true and he might regret what he did too dolph real quick after the first few ass whippings. Man was buyng cookies   these guys deserve  the worst", "I actually teared up what a supportive woman, mother, and she feels and sounds so war when she says so loudly AND YOURE MY SON! Kai was so excited and so was his mom. Im so glad that they could celebrate like that. I hope they have a long and heartfelt life going forward. :/ :O :O", "You can feel that Dolph has been absent .. he would've dropped soooo much hot music by now!!! He always stayed relevant !! I really don't like talking about this..I never got the chance to meet him, but it's crazy how you can connect with a person through music.  I connected with Dolph like many connected with Pac. He inspired me to get my first Mercedes Benz!! LLD 4 ever mannnnn ️", "My condolences to Yung Dolph family", "LONG LIVE DOLPH️️", "Everytime I watch this series I'm always so impressed by Techno's creativity, ruthlessness, and dedication to achieve his goals. Even after his passing his ingenuity continues to have an impact on Youtube and its creators. Rest easy, King. TECHNOBLADE NEVER DIES:_TechnoSalute: <3", "Prison is your new home bruh", "I loved hearing the dialogue between Mimir and Kratos in this episode, it really showed us how troubled Mimir is because of his past deeds, and how wise Kratos has become. Also, it's so great to see Sean having a lot of fun with this game! Can't wait for more episodes! :(", "Rip Young Dolph ", "Rip flippa 1 year already rest in peace buddy", "Words cant describe how much I love this collab", "Woo had my dying when he said \"ain't no guns in jail\" then hit em with that lil smirk and was like \"gotta stand on all 10\". He know them boys applyin pressure behind bars and that's why dude tryin to transfer out... ", "It's sad that Young Dolph's killer puts out a song and actually thinks it's gonna put him on SMH. This just shows how jealous and envious he was of Dolph. He couldn't be him on any day. What's worse this is a tragic trend happening among black society. If anyone is succeeding at something in life and someone is envious or jealous of their lifestyle and accomplishments, that person is either assaulted or murdered. It's not right. Love for humanity has gone wax cold. Jesus says there will be times like these. RIP to Young Dolph and every person taken away by unnecessary, senseless violence.", "King Dolph has fans EVERYWHERE, in jail/out of jail, in Memphis & out of Memphis, Worldwide. There's nowhere these punks will be able to hide! The nerve to post music too. No transfer needed, keep him there! I hate that Dolph is gone. He is definitely missed️", "you can tell hes young & dumb but the one thats snitching & not to mention snitching on himself now they really going to hold that song against  him dummy...", "This is nuts. I feel for the breakdown of this nation.", "Glad to see Lui and Velocity back especially Velocity been a while since he been around. Life hits everybody but hopefully it's been kind to him and hopefully we see more of him and Lui of course!! 8)", "Damn still kant believe Dolph gone man Dolph yo shit hit deferent miss that sound L.L.D ", "Grizzys high pitched scream at 5:48 gives me life", "Rest up Dolph", "The judge needs to release a song called \"General Population \" or \"No Protection In Prison \". I'm so pissed who allowed this, who is profiting from the song, whomever they are, they are accessories to murder. LLD", "Rest easy Dolph , 803", "R.I.p dolph r.I.p desto, praying for Memphis", "Rest in peace young Dolph we are heartbroken love you always and forever Pam", "What goes around comes around.", "Absolutely , Justice For Young Dolph by any means  miss ‘ em", "It's sad cuz he was a Pillar in the community. Taken out by his own kind & for what greater purpose..none. Pure jealousy. Now there's a huge hole n the city of Memphis that no one may ever fill again. Sad sad sad reality", "WHY is a prisoner given the right to do this? \nWhat a mockery of the justice system.", "there will be a time when these memes gets old like rage comics. but until then, im enjoying this like no other", "Attention seeking behavior- acting in a way that is likely to elicit attention. This guy is a lower lesser narcissist. Pity playing too, trying to get a change of venue for his case. Don't care about the rap beef but he's a prime example of the dangers of narcissist.", "Cory : I am going act weird \nAlso Cory :starts beatboxing", "LONG LIVE DOLPH ️️", "This is how you know he is done for ", "This is actually a statement", "\"Because tony ALWAYS learns from his mistakes.\"", "This generation never fails to show out", "So yall thought let's help him get his music out there and be heard cause i wouldnt had known shit if it wasnt for this post but now he definitely put a target on his back", "He most definitely should not be transferred", "And he’s down bad because it’s the “EVE” of his passing. He did that though in order to get folks to go listen to it cuz he’s definitely gone need the funds, if not for his trial, he’s fasho gonna need it on them books! You ain’t going NOWHERE my guy…you might as well get comfyyyyyy! It don’t seem like it’s been a year already though smh…RIP KING DOLPH", "Nawl nawl  don’t holla transfer now, They wanna be big billy badass on the streets until they meet up with those real gladiators… rest easy Flippa ️", "Y'all should have linked the song in your description, now I gotta find it", "I swear Austin is monster at making content. I so needed this guide for when I get my copy", "that public defender told him to do this ", "If the 3rd person wasn't the driver then we still need arrests", "Man this video was a real treat, so nice to see Lui again. I kinda know that Velocity was og but I don't really remember him but still it's great to see some of the ogs come back :(", "I hope you realize that the boy released his song the way he did because he knew everyone and anyone would look for it so he could go viral and make money off this situation  because this is the world we live in now. What is his name again?....\"cell phone drop\" ? \"My service drop\" something drop. Lol", "Give him the chair! He took a dad away from his kids and family. LLD .", "Young Dolph was my guy \" all involved in his murder should pay \"", "Rest dolph PRE ", "Justin Johnson is incarcerated on a murder charge with no BOND and has recently asked the court to transfer him from 201 Poplar for safety reasons. On any other day I would probably agree that his life as well as the other guy could be at risk in any facility in Memphis Shelby County but I don't think this is the case for Justin Johnson. This guy isn't afraid. He has sat in his cell and made up song crappy song about his charge & the reason for his incarceration that will hopefully go viral for him. ", "He thinks he's going to get out of doing time because of a song, I don't think so. He says he's a rapper but I never heard of him before. I just want to see Dolph get justice, he was a good man. He didn't deserve this.", "this man Cory is really balancing 2 seriess, and being consistent with it. Such a hardworking YouTuber bro", "Thank you TM for not making us forget the real threats on the internet. These bots are real and they truly wont leave, they grow when channels grow.\n\n(Also seeing you lay the smack down on a bit was great)", "Gangster rap has radicalized us smh", "Angrbroda: you cant defy fate!\n\nKratos: was supposed to die and literally said no multiple times", "Only in America a murder suspect can release music online how the police don't stop that ? Smh", "Killing the competition isn't literal. It's artistic.  No one dies.", "Damn...  now that's entertainment.", "Sending that message not to snitch on him ", "Releases a song called No statement... immediately gives the statement in song form", "RIP ", "I just thank god I got to see flippa  live at rolling loud in 2017 one of my fav artist and a great role model RIP the ", "Imagine ambushing somebody, flee n go on the run. release a song & video when you supposed to turn yourself in. talk super crazy like you that niqqa, get caught then asked to be transferred because you scared after you got attacked  I stand with that 1 dude ain’t no guns in jail my boy you gotta have that same energy you had running up on dolph tryna buy cookies! Couldn’t even give him a fair chance to bust back", "If bro released a song he got way too much freedom", " damn I already knew this was going to happen", "i love how sigils just gets bullied the entire time  :D", "Hope he enjoys it. Free meals and free bed to sleep in", "Always screaming R.i.p dolph who ever did it carma will get u man da streets r not safe anymore", "Bring back the post-game lobby reactions, they were so good.", "I hope none of them get too see the light of day we lost one of the great gone but not forgotten young dolph", "This may be an understatement, but I don't think that these are the smartest dudes in the hood.", "But he needs protection or want to be moved for safety yet he put a target on his back  He's sooo smart", "the judge wrote a new song too called no freedom", "Kinda confident to have a public defender", "I love your videos. Very entertaining . Hope you make more videos to entertain us.", "Very smart now the cops can listen to you telling on yourself LET'S GO CHAMP!!!!! ", "What kind of jail let you use a cell phone that's why these people will come out and do the same crimes because the justice system ain't nothing but a damn joke yeah I said it", "Damn str8 drop dodging General Pop bc mfs gone get on his ass . It's sad that people commit crimes and they protect them in jail. LLDOLPH ️ FREE STR8 DROP SO WE CAN GET THAT STREET JUSTICE", "pRE aaahhh it’s dolph r.i.h my boi u created a team of real ones ", "This is the culture we love. That killer culture. Our  music is toxic .", "His attorney must be proud ", "I honestly respect Andrew now for how professional he acted at that moment.", "Dont transfer him! Dolph did not get that option ", "I love that Wildcat is playing more games with them, his whole vibe just makes these videos even funnier", "He should of came out with the song called \"No freedom\"", "Thats exactly what I thought when I found out they made the top green\nI was like, Camman.", "It's sad that a rapper is anyone's role model.", "\"I dont want to live on this planet anymore\"", "Major shout out to the local news station for having a \"big/beautiful\" correspondent in front of their cameras.  I tell you what you'll never see that anywhere north of the Mason-Dixon line.", "No statement no transfer", "BRIA JONES \nDEFINITELY CAN'T WAIT UNTIL THANKSGIVING DINNER ", "Drops a song called No Statements as if that’s gonna help your case  bro could have kept that ! Long Live Dolph "]}