{
    "video_id": "hWe07O22db0",
    "comments": [
        "",
        "He keep playin they really gonna get his ass",
        "He thinks it a game... rip  ",
        "Yea is reality if he don’t make no statements who can blame em. this is what go on in the streets everyday. If had it ben the other way around who would want young dolph to comply with the justice system nobody!!. ️",
        "Snup and Cuzz wild",
        "I hope none of them get too see the light of day we lost one of the great gone but not forgotten young dolph",
        "His $cary a$$ trying to get moved to another jail,make a song about that.. Shake n bake",
        "i love how sigils just gets bullied the entire time  :D",
        "Mannn Go Roundup These Fools GAME OVER!",
        "No comments",
        "He is not the killer... It was the Govan father and daughter Duo",
        "Wowwwwwwww",
        "Rip dolph f straigh drop aka Justin Johnson. Fake aaaaa",
        "Ain't no transfer bihh... gotta out those guns down and get knocked out like his father used to",
        "\"Got no gun  in jail, he gotta stand on all ten\" 100 percent  true and he might regret what he did too dolph real quick after the first few ass whippings. Man was buyng cookies   these guys deserve  the worst",
        "He snitching already ",
        "The suspect dropping statements how we know it was another suspect involved",
        "Looks like dat bout da only place ya make a statement....",
        "That's gonna be a long blink. Hope they all rot to the core in there. Tuff guy in PC...funny",
        "3rd man indicted and then he drops this song? He just dry snitched on himself, lame azz we all know its you telling  1st he got no money for a lawyer, then asking the judge to move location cause he scared, now lyrics, \"Will be home before you blink\"... Yep you snitching ",
        "Any money should go toward restitution to victims.",
        "Glad to see Lui and Velocity back especially Velocity been a while since he been around. Life hits everybody but hopefully it's been kind to him and hopefully we see more of him and Lui of course!! 8)",
        "The lawyer is grilling him as we speak why drop the song and you haven't beat the case yet don't forget you still incarcerated with people who want money on their books that are  willing to bring harmful intentions to him Forest Gump say it best stupid is as stupid does SMH",
        "Maybe the judge can release a new rap song called, \"No Transfer?\" ️",
        "The devil can't save you out of this one buddy",
        "So how much did yo gotta pay him?",
        "Blm huh",
        "Straight drop has a fool for a lawyer.",
        "Damn still kant believe Dolph gone man Dolph yo shit hit deferent miss that sound L.L.D ",
        "Gotta love that black culture",
        "Trap  music is just like the emoji a box with a trap waiting on another new rapper to die. \n\nJust another blood sacrifice for money and fam. ",
        "That one dudes fake chain missin sum stones....must need a different paper route",
        "The song trash could have kept it never dropped it lol but yall go check out the KING OF MEMPHIS YOUNG  GET AWAY. RUN HIM UP WE LOVE YOU ",
        "Ole boy PRE chain is turning colors..lol these fake chains \"rappers\" be having is hilarious",
        "Oh no he didn't...smh",
        "I really liked Dolph in Rocky 4. He played that mean Russian perfect. \"If he dies..he dies\"",
        "he's really trying to profit off this cowardly act smh",
        "The fact this news outlet reported on this goes to show you how we have failed as a society.",
        "I love that Wildcat is playing more games with them, his whole vibe just makes these videos even funnier",
        "He thinks he's going to get out of doing time because of a song, I don't think so. He says he's a rapper but I never heard of him before. I just want to see Dolph get justice, he was a good man. He didn't deserve this.",
        "YES, SOMEBODY DONE TALKED️...EITHER JOHNSON OR THE OTHER BUM! HE WANTED TO MOVE OUT OF THAT JAIL CUZ GOVAN HAS BEEN INDICTED & POSSIBLY GONNA BE HIS NEW JAIL MATE. PRAYERS TO FAMILY & JUSTICE FOR YOUNG DOLPH, AMEN!PLEASE FOLLOW EVERYDAY SHENANIGANS FOR UPDATES TO THIS STORY & BREAKING NEWS...THANKS!",
        "Imagine ambushing somebody, flee n go on the run. release a song & video when you supposed to turn yourself in. talk super crazy like you that niqqa, get caught then asked to be transferred because you scared after you got attacked  I stand with that 1 dude ain’t no guns in jail my boy you gotta have that same energy you had running up on dolph tryna buy cookies! Couldn’t even give him a fair chance to bust back",
        "Why is pre smiling",
        "This man asking for a life sentence smh ️",
        "He most definitely should not be transferred",
        "He sending a message to ",
        "I love the culture",
        "What happens in the dark comes to the light",
        "\"Dude said you got to stand on all 10\" Lol",
        " Dead man rapping  They still flipping about flippa. Safest place for you is the cell lil dummy. I won’t ever say your name! Forever live flippa!",
        "Prison is your new home bruh",
        "I swear Austin is monster at making content. I so needed this guide for when I get my copy",
        "Is dat snoop dog son?...LL DOLPH",
        "Boi ain’t no way boi",
        "Clown ",
        "Keep spinning until Dolph killer beg for mercy!!! Long Live Dolph ",
        "It's Dauuffff",
        "Mane ain’t nobody gone listen to that bs",
        "PAPER ROUTE 4L ",
        "TENN. CODE ANN. § 29-13-403 (2000) cannot profit from your crimes.",
        "He’s cashing in on the sacrifice. No shame.",
        "No statements but yet more and more are being captured looks like he straight dropped names",
        "Drop ah song called, \"No Bond\"..",
        "No bond  just throw away the key ",
        "The BonB crisis is more dangerous.",
        "\"You gots no gun in jail\"",
        "On YouTube you can see a lot of like movie everything song drama I love you toop awesome *",
        "LLD️ Get all them !! Set  Soul free !! Justice now !!",
        "Crazy he dropped this the same day key Glock dropped his album  hmmmmm…..@onantv",
        "Get this out of my recommend. Thanks.",
        "Rest in peace young Dolph we are heartbroken love you always and forever Pam",
        "Angrbroda: you cant defy fate!\n\nKratos: was supposed to die and literally said no multiple times",
        "The judge needs to release a song called \"General Population \" or \"No Protection In Prison \". I'm so pissed who allowed this, who is profiting from the song, whomever they are, they are accessories to murder. LLD",
        "If you buck expect to get knucked..period\nPeriod \nPrison is different than them streets",
        "No guns in jail gotta stand on all ten  buddy laughing hard",
        "Man beat it out of him he will talk",
        "Young brother said \"u  don't have any GUNS in jail, U got to stand on yo 10\". Meaning \"MAN UP.",
        "Trying to get paid ,off murder.",
        "SMH",
        "Major shout out to the local news station for having a \"big/beautiful\" correspondent in front of their cameras.  I tell you what you'll never see that anywhere north of the Mason-Dixon line.",
        "So disrespectful!",
        "BRIA JONES \nDEFINITELY CAN'T WAIT UNTIL THANKSGIVING DINNER ",
        "Why they killed Dolph I still don't get it",
        "My condolences to Yung Dolph family",
        "So Strange How you order a Hit on Somebody  Child and someone completes  Hit on your Child Life is Strange like That..",
        "Why are Dolph’s artist smiling about this??",
        " \n\nNIGGAZ!!!",
        "P.R.E. Should make a song about the it",
        "RIP YOUNG DOLPH, he was a true legend , he was showing mad people the way",
        "The Brothas that are getting interview are so ignorant.",
        "Another sacrifice",
        "LONG LIVE DOLPH️️",
        "He’s locked up and his arrogance in hope that’s crazy",
        "Tells you a lot about the justice system, huh!? We should get a cut from the taxes we pay. Smh!",
        "He got  a lot of time now he might come out with a few mix tapes ……I’m not not really sympathetic to people who hurt people period",
        "no statement cuz he knows better :D",
        "Got no gun  in jail, he gotta stand on all ten\" 100 percent  true and he might regret what he did too dolph real quick after the first few ass whippings. Man was buyng cookies   these guys deserve  the worst",
        "Who cares about his safety after taking someone's LIFE, leave his A** right in there and let him face the consequences of his Actions ",
        "Should’ve called it No Parole️",
        "How is this news",
        "Haa anyone heard what the motive for the murder was ? Gangs ?",
        "Rip Young Dolph ",
        "That's why they call him straight drop",
        "Takin his man hood ",
        "Where's their video at",
        "Paper route empire is  illuminati",
        "Sending that message not to snitch on him ",
        "Wtf is wrong with this?! Dude is on a murder case and getting publicity?… really… and y’all worried about the justice system, be worried about the media system first!",
        "I love bria Jones ️",
        "Disrespectful!!",
        "Does this guy think he is x-rated or something?",
        "Lock him up and throw away the key  He has no remorse...making an incriminating heartless statement. Cancel Straight drop! Dude is a ",
        "No statements? Someone is definitely making statements. I think you meant no parole.",
        "Bring back the post-game lobby reactions, they were so good.",
        "Subtitles please",
        "Give them all the Electric Chair!!!",
        "He smiling the whole time that get back be real asf",
        "Thank you TM for not making us forget the real threats on the internet. These bots are real and they truly wont leave, they grow when channels grow.\n\n(Also seeing you lay the smack down on a bit was great)",
        "Damn bruh",
        "Anything you say can and will be used against you. Keep talking fool",
        "It should not take a famous rapper being killed for us as black people to want justice their are black men getting killed everyday we should have that same anger an energy when it comes to black on black crime period.",
        "Young Dolph was my guy \" all involved in his murder should pay \"",
        "I thought they legally passed not using \"lyrics\" against rappers anymore? Oh, wait is this a \"real rapper\", or is this just another bird in jail silently singing on himself?️️",
        "To fucking bad! He needs to learn! That's what he gets fro killing dolph.",
        "And he is the one talking",
        "They nerves of him",
        "How amd he just asked to be moved",
        "Gotta stand on all 10  ",
        "Attention seeking behavior- acting in a way that is likely to elicit attention. This guy is a lower lesser narcissist. Pity playing too, trying to get a change of venue for his case. Don't care about the rap beef but he's a prime example of the dangers of narcissist.",
        "LLFlippa ",
        "Better Promo then most…. Apple what’s the hold up",
        "Cory : I am going act weird \nAlso Cory :starts beatboxing",
        "\"No Vaseline \"\nMuch better song and name",
        "he scared they gone str8 drop it off in his y",
        "LONG LIVE DOLPH ️️",
        "Only in America a murder suspect can release music online how the police don't stop that ? Smh",
        "our boy woo missing a stone in his chain lol",
        "Safety concerns? Why he scared now? Smh... LL Dolph",
        "His next album labeled \"No Freedom\"",
        "Mannn if they make it to trial",
        "This is how you know he is done for ",
        "Mask over  or don't wear it.",
        "Woo ",
        "It's amazing to me that a murderer gets to release a bullsh*t song while incarcerated.",
        "UNFORTUNATELY, YOU CAN NOT HELP THE STUPID BECAUSE HELPING THE STUPID IS STUPID.",
        "dear momma",
        "\"No track hawk\" should be the song name ",
        "Awe yo ass done told them folks something .",
        "So many ppl want to be a famous. And you believe killing someone wl get you there! Nooooooo",
        "He definitely gotta stand on all 10 he can’t hide behind the gun anybody can pull a trigger",
        "Its nobody going to ride with that !!!!!! Need that cash for lawyer fee",
        "He'll yeah, murder and prison will make you famous as long as you are a rapper or drug dealer. People will buy that stuff",
        "إلحقونا إلحقونا",
        "Dummas",
        "F that song I refuse to give it a single play I won’t look it up or any of that, he wanna be famous so bad off dolph name. Rip flippa",
        "What goes around comes around.",
        "I hope they do get out of jail that way the streets can take care of the trash",
        "No",
        "\"I dont want to live on this planet anymore\"",
        "I just thank god I got to see flippa  live at rolling loud in 2017 one of my fav artist and a great role model RIP the ",
        "He bt to serve time for a MURDER.....A song should be the last thing that's on his mind, Especially when Anything you say (Songs/Social Media Included)can be used against you in the court of law...Such A DUMMY",
        "The nerve...",
        "Why",
        "Wow…he really is singing like a bird huh ",
        "But he needs protection or want to be moved for safety yet he put a target on his back  He's sooo smart",
        "He definitely wasn’t one of the shooters especially from the pics I’ve seen on the news. His body style is bigger . What role did he play?",
        "No statement but you asking for special management housing. We are not listening to that.",
        "wheres BLM AT? ",
        "Daaaaamn, Chocolatequisha needs a DIET",
        "Y",
        "He gone get got",
        "Interviewed  dude said.. They're is no guns in jail. Should there be? Lol",
        "Awesome 🇺🇸",
        "Now his new home is prison time",
        "Let us know cause ain’t nobody listening to that bullshit we all bumping Glock ",
        "Isn’t this technically a statement?",
        "He trying now because he knows he ain't finna love long after release",
        "That’s right! “No guns in Jail,  you gotta stand on all 10” Half of them punks ain’t never been in a fistfight. Prayer for young dolps’s family",
        "Black Lives Hurt Everyone ",
        "How he going to release new music and he locked up really",
        " niggas boi",
        "He should’ve name it LifeLifeLifeLifeLife\nHope he see his face every time he close his eye",
        "Woo know Darn Well who A.B is he raps he’s a CRIME BOSS.. Glade You not My Homeboy Cause You know this Information And want tell The Police. In front of the camera Talking About Somebody talking in Real Life  think  ????? Yo  Azz Remember God is out Here PURE Energy Boyyyyyyyy!!!!!",
        "I say yeahhh PAPER RT WOO TALK YO SHIT these mfs out here shooting an don't realize where you goin ain't no guns in jail ..make a song bout that playboy it'll be a hit",
        "They doing what he want! #SharingIt smh",
        "Rip to Dolph and other rappers we love , it sad How rap culture have gotten worse since biggie n pac and others but now it just sad to hear I Know that a lot of rappers out here lost they life over envy don’t forget about king von , nipsey , moe 3 , xxxtentacion , takeoff, doe b , trouble, P n G rock  so many more the list is long people it time for a change I had enough of news never nothing good it plain insane that we are living in a world of hate",
        "PRE4LIFE",
        "If bro released a song he got way too much freedom",
        "It's sad cuz he was a Pillar in the community. Taken out by his own kind & for what greater purpose..none. Pure jealousy. Now there's a huge hole n the city of Memphis that no one may ever fill again. Sad sad sad reality",
        "What kind of jail let you use a cell phone that's why these people will come out and do the same crimes because the justice system ain't nothing but a damn joke yeah I said it",
        "Why it's news he should get more time in jail .",
        "No statement no transfer",
        "Ion care ITZ STILL ",
        "R.I.p dolph r.I.p desto, praying for Memphis",
        "Next track gone be No parole.",
        "you can tell hes young & dumb but the one thats snitching & not to mention snitching on himself now they really going to hold that song against  him dummy...",
        "Hmmm  no guns in jail got to stand on all ten...whoa",
        "Hope he enjoys it. Free meals and free bed to sleep in",
        "But he's actually snitching smh LLD one year today",
        "Where's Bria's neck?",
        "Good PR I guess when the news are promoting your new song",
        "How do these guys get in this much terrible?",
        "I myself the great gift drick Smith game pep dig wigs gone get rocked real nice  He says he gone be out before he blink iam sure he done blinked dam near a million times and every time he opens his eyes  to his surprise the jail doors never slide lights never go off but only in jail he can hide did not know how to stay free and enjoy his ride because he still in jail blinking his eyes Dig son Nap Nice.1",
        "the judge wrote a new song too called no freedom",
        "this man Cory is really balancing 2 seriess, and being consistent with it. Such a hardworking YouTuber bro",
        "If the 3rd person wasn't the driver then we still need arrests",
        "Story: https://wreg.com/news/local/young-dolph/young-dolph-murder-suspect-releases-song-no-statements-from-jail/",
        "What TF is they smiling about",
        "This is terrible",
        "He had a statement MOVE ME TO PC",
        "Drops a song called No Statements as if that’s gonna help your case  bro could have kept that ! Long Live Dolph ",
        "Kinda confident to have a public defender",
        "Oh YEAH NO STATEMENT WE GONE SEE BOUT DAT...AYE CUZ GET EMMM",
        "Don't believe them lock them all up  ",
        "What happened he look like he from hoova in LA he said psychic eye blink it's the photographer guy of the industry he a gay psycho he gone get out he ain't do it",
        "Everytime I watch this series I'm always so impressed by Techno's creativity, ruthlessness, and dedication to achieve his goals. Even after his passing his ingenuity continues to have an impact on Youtube and its creators. Rest easy, King. TECHNOBLADE NEVER DIES:_TechnoSalute: <3",
        "there will be a time when these memes gets old like rage comics. but until then, im enjoying this like no other",
        "What his next song? \n‘No parole?’",
        "Why is his IG still up or any social media account? Somebody need to get that shut down ASAP!! or matter fact let him keep talking he gone end up digging his self in a bigger hole trying to prove he so gangsta!",
        "st8 drop aint got to cough, sneeze, or a blow noise for all i care, but obvisouly he is going to sit and be sentenced to life weather he make a statment, play possium, and whatever else he thinks male you look cool in the public eye, when you not even in the public,??????? aint nobody about to come to his rescue and say \"thank you for not making a statment, I will take over your punishment and serve\" Its just not going to happen.",
        "This shouldn't have even made news",
        "FREE DROP",
        "Drill Rap from the Bounty Jail",
        "Releasing “No Statements” is a statement. ️",
        "Siglis reaction to SSundee being of the cause of his torment that entire round made my day priceless",
        "I loved hearing the dialogue between Mimir and Kratos in this episode, it really showed us how troubled Mimir is because of his past deeds, and how wise Kratos has become. Also, it's so great to see Sean having a lot of fun with this game! Can't wait for more episodes! :(",
        "Dolph>>>>>>>",
        "No Transfer lil punk",
        "Ayo, I didn't know Town of Salem got a new update",
        "Don't  know how he recorded a song on a phone???????? In jail?????? Not in Cincinnati!!!!!! Why Memphis let them have phones in jail, democracy  sucks sometimes, bites them in ass!!!! Democratic ran city, they feel sorry for criminals, in jail, give them a phone in jail, WTF",
        "It's sad that a rapper is anyone's role model.",
        "Holy shit Mick living life like its death note. Dude spent two years creating and refining his defense for absolute destruction.",
        "Here before it blows up ",
        "Flunkies",
        "Damn str8 drop dodging General Pop bc mfs gone get on his ass . It's sad that people commit crimes and they protect them in jail. LLDOLPH ️ FREE STR8 DROP SO WE CAN GET THAT STREET JUSTICE",
        "Paper Route Woo smiling cause he knows karma around the corner for straight dropp",
        "I like the song it's nice",
        "Pure evil",
        "pRE aaahhh it’s dolph r.i.h my boi u created a team of real ones ",
        "️",
        "I ha wait heh k huh fu k lol",
        "I wouldn't call it a song, it's all gibberish like most rap..",
        "It's crazy you would even put this on news and promote it",
        "This is nuts. I feel for the breakdown of this nation.",
        "Ha. Haha. Ahahahahaha. AHAHAHAHHAHAHAHAHAHAHAHA\nFucking perfect",
        "Lol boy you wanna be transferred smfh",
        "Chin diaper",
        "Disrespectful AF!",
        "Anything u say or do….UHHHH ya know da rest LL",
        "No crime was committed. \n\nTwo birds with one stone though",
        "I hope some rapper writes a song that the killer died in jail.",
        "668 it I'm a to",
        "Everyone is not going to make it to heaven except the ones who except JESUS AS THERE PERSONAL LORD AND SAVIOR AND DO HIS WILL.",
        "Nawl nawl  don’t holla transfer now, They wanna be big billy badass on the streets until they meet up with those real gladiators… rest easy Flippa ️",
        "Killing the competition isn't literal. It's artistic.  No one dies.",
        "Prosecutor's Will now release a song called \" No Plea Deal\"\n\n\nThe judge will release a song  called \" No Transfers\" ",
        "He’s probably the one snitching … One of the 2 snitched on the 3rd suspected. Probably both of them snitched…",
        "Thats exactly what I thought when I found out they made the top green\nI was like, Camman.",
        "You can feel that Dolph has been absent .. he would've dropped soooo much hot music by now!!! He always stayed relevant !! I really don't like talking about this..I never got the chance to meet him, but it's crazy how you can connect with a person through music.  I connected with Dolph like many connected with Pac. He inspired me to get my first Mercedes Benz!! LLD 4 ever mannnnn ️",
        "They all look broke ",
        "His team would be happy if he got out lol they just smiling because they know someone talking. They ready",
        "As I heard young black rappers are more likely sing violence and threat song but it does not mea LGBT.",
        "How about he write a new song called \"NO PAROLE\"",
        "No guns in jail! FACTS!!",
        "The culture…lol ",
        "This shit sad .dolph deserve to be here.black people stop killing each other",
        "I love your videos. Very entertaining . Hope you make more videos to entertain us.",
        "We have no guns in jail you have to stand on all ten that’s the most important message I done ten years in prison and that’s real shit every body got people and ounce u hit that yard those boys did not for get",
        "The rap game suppose to be a come up money making entity sounds like a recipe for disaster",
        "Murdered a guy over jealousy this should  be a lesson to anyone that becomes  successful when you can afford  to make  it out don't  go back",
        "Today marks 1 year since young dolph death ",
        "Rest easy Dolph , 803",
        "He should call it knee pads  that what he using down there",
        "I cant believe it has been 1 year Feels like we just lost him yesterday  I pray God is holding Dolph in His arms.",
        "Rip young Dolph qnd tqke off",
        "Sooo,, how is he able to have a phone and release a song from jail....TAX payers money?????  Peace to DOLPH's wife and kids",
        "Welp this song will be used against you in the courts buddy",
        "Absolutely , Justice For Young Dolph by any means  miss ‘ em",
        "This is the culture we love. That killer culture. Our  music is toxic .",
        "This generation never fails to show out",
        "  and he wants to get transferred to another prison.. wat a ",
        "No guns in jail..def gotta stand on all 10 ",
        "Justice️️for Adolph Thornton Jr",
        "Rest up Dolph",
        "King Dolph has fans EVERYWHERE, in jail/out of jail, in Memphis & out of Memphis, Worldwide. There's nowhere these punks will be able to hide! The nerve to post music too. No transfer needed, keep him there! I hate that Dolph is gone. He is definitely missed️",
        "It will all come out by their own mouths",
        "\"Because tony ALWAYS learns from his mistakes.\"",
        "Oh somebody definitely telling dats how da 3rd person got caught",
        "What's with the masks",
        "He knows what’s coming. Might as well try to get the few supporters he can, cause they’re are out there. \n\nThat being said this fool reminds me of buck shot from key & peels. \nhttps://youtu.be/14WE3A0PwVs",
        "You're an awesome friend.",
        "yea u aint gonna make it through that bid if u already need protection. u wanna be a killer on the street so now deal with them killers in da pin on a daily basis",
        "Pitch still trying to get famous from jail",
        "Then let the judge release a song called \"no remorse\" jailed for three life sentences to run concurrent.",
        "I be damn lookahdere free promo.I wearrrr my suuuuuuuuuuuuuunglasses at nite .. .",
        "LL Flippa ",
        "A new what “Are u kidding me and special housing ",
        "Some people just don't know when to shut up smh.",
        "These rappers rap about everything except wiping they a@@... nvnd there's probably someone somewhere that has",
        " damn I already knew this was going to happen",
        "Confessed! Lock him up",
        "No guns in jail pretty boy just plenty of soap... Don't drop it killah.",
        "LOL",
        "Unfortunately self destruction is a thing with young black males, it seems.",
        "These kids nowadays ruin their lives",
        "CMG ",
        "Pm\nQt J nb",
        "And he’s down bad because it’s the “EVE” of his passing. He did that though in order to get folks to go listen to it cuz he’s definitely gone need the funds, if not for his trial, he’s fasho gonna need it on them books! You ain’t going NOWHERE my guy…you might as well get comfyyyyyy! It don’t seem like it’s been a year already though smh…RIP KING DOLPH",
        "How Do Yall plan on doing Shows with this weight On Your ️… Across the Globe . Knowing I as in ME,You,and GOD.Knowing this????? come on Talk To Me!",
        "That shit was hard",
        "He wants the whambulance to transfer him to a safe place  does baby want a bottle   too ?",
        "No respect for the purpose he's in there, but the sad thing is people will still support this alleged killer and this type of behavior by dancing and singing to it and purchasing it. Make it make sense!!",
        "That nigga giving all the statements  how tf else does a 3rd suspect come into the picture ️",
        "️  atp ion think he did it cuz be fr who go really keep going like this knowing this was go happen….",
        "Clown",
        "I Don't Get It.",
        "Guess who they interview the main 2 that was in on it ",
        "Now that Foo  is cray",
        "Titles song no statement … then releases song stating everything ️",
        "Mac Dre was the first too EVER make a album behind bars",
        "Bro trying to make it look like he ain't no snitch. He's in there telling everything.",
        "I not racist,  but every days black people do bad things,  we can't nothing  to them,",
        "I always wondered what stand on all 10 meant until I just looked down at my feet to count my toes smh I need to slow down on smoking tf",
        "Dolph and my daughter mother Kesha passed away  on the same day. 11/17 is a hard day for us",
        "Hes snitching that song is so they dont suspect him but then again who am i 2 say ️️",
        "This whole thing is disgusting ",
        "You call that a song?",
        "He might not be alive by the end of the week too hear the reviews of this trashy song. Now he wants a transfer to another prison because he fears for his life foh. He haven't seen nothing yet! RIH Young Dolph",
        "This rap killing music y’all love is what’s killing these people",
        "so who dolp killed yall glorfie these rappers....but they music hurts our own df grab the big fish in let the streets handle him ??? we all know who that is",
        "Making songs? From jail ... tell em make s song called PC ..next.../ no guns",
        "But he in PC Lmfao smh gotta stand that on that behind that wall and fence….",
        "I actually teared up what a supportive woman, mother, and she feels and sounds so war when she says so loudly AND YOURE MY SON! Kai was so excited and so was his mom. Im so glad that they could celebrate like that. I hope they have a long and heartfelt life going forward. :/ :O :O",
        "???and this is news",
        "Now the news is the MOVIES!! Lame AF-",
        "I honestly respect Andrew now for how professional he acted at that moment.",
        "Releases a song called No statement... immediately gives the statement in song form",
        "I hope you realize that the boy released his song the way he did because he knew everyone and anyone would look for it so he could go viral and make money off this situation  because this is the world we live in now. What is his name again?....\"cell phone drop\" ? \"My service drop\" something drop. Lol",
        "Y'all should have linked the song in your description, now I gotta find it",
        "Yes, can't HIDE behind GUNS in jail!",
        "Dont transfer him! Dolph did not get that option ",
        "Song was weak sounded like he had been crying and broken down.",
        "Its even sadder cuz the killers feel they fulfilled a purpose.",
        "Dude trying to write rhymes. Judge please give him a long sentence.",
        "Words cant describe how much I love this collab",
        "Somebody telling if niggas keep getting locked up.",
        "Im glad they are talkin!! Whoever did it Deserves to be Locked up and Key thrown out!",
        "Very smart now the cops can listen to you telling on yourself LET'S GO CHAMP!!!!! ",
        "Next song \"acquitted and then I hit it\"",
        "Why ate the guards still wearing masks? Even new york state courts took that off already",
        "Str8 Nefarious!",
        "Rip flippa 1 year already rest in peace buddy",
        "The guy in all camouflage is straight up old law. At one point time you could get out there and throw hands then walk away. Nowadays guys are scared of getting knocked out, so they rather shoot it out. But for the guys that have that mentality understand this, you are going to fight no matter how many people you shoot it out with. The law will catch up to, throw you in jail, and like he said. “ there is no guns in jail”. Your going to fight, one way or the other.",
        "His attorney must be proud ",
        "Govan …Daddyyyyy  ",
        "He's already a snitch, so this song needs to be cancelled.",
        "Behind bars and still try na get clout",
        "what a shining example... of the death sentence right hes gonna get the death sentence and justice will be done... what's that... ooo the state will pay for him to stay alive and feed him... yeah justice",
        "RIP ",
        "Hmm dude special next song  oops I drop the soap . Need to just stay  silent",
        "Don't transfer dude.. Fight ninja fight.. They go get azzz in there",
        "Justin Johnson is incarcerated on a murder charge with no BOND and has recently asked the court to transfer him from 201 Poplar for safety reasons. On any other day I would probably agree that his life as well as the other guy could be at risk in any facility in Memphis Shelby County but I don't think this is the case for Justin Johnson. This guy isn't afraid. He has sat in his cell and made up song crappy song about his charge & the reason for his incarceration that will hopefully go viral for him. ",
        "RIP Dolf",
        "Hood rats",
        "You'll never be safe",
        "Transfer denied he not in  danger dropping music lol.....",
        "LLD",
        "Man this video was a real treat, so nice to see Lui again. I kinda know that Velocity was og but I don't really remember him but still it's great to see some of the ogs come back :(",
        "Who the guy with pre chain on under the ski mask",
        "Another rapper dead by their own people. Everyone talking about takeoffs death but not young dolph? Is he not as popular as migos? Lol",
        "WHY is a prisoner given the right to do this? \nWhat a mockery of the justice system.",
        "I hear the train a coming comin round the bend and I haven't seen daylight since I don't know when",
        "Nah he good st 201. Let them dudes do what they need to. Seriously thought they would have given him wings way before now. And he's releasing music??? For what? Won't be out and won't be Dolph.",
        "Freaking HYSTERICAL!!!",
        "This is like that episode of Boondocks with Gangstalicious",
        "Don't drop the soap ",
        "Next track he's gon make love songs too his celly  ",
        "R.I.p young dolph ",
        "Fse ant no guns in jail fseee  it's not but fse he go get jumped fse dam Flippa ",
        "So why give this man press for his song, he's a jailbird nobody should emulate him or even want to listen to him",
        "DO NOT go search for this song!\nDO NOT share his content!\nWe gotta start by STOPPING these murderers from Gaining  influence and social power.\nIt's been time for a change!",
        "It's sad that Young Dolph's killer puts out a song and actually thinks it's gonna put him on SMH. This just shows how jealous and envious he was of Dolph. He couldn't be him on any day. What's worse this is a tragic trend happening among black society. If anyone is succeeding at something in life and someone is envious or jealous of their lifestyle and accomplishments, that person is either assaulted or murdered. It's not right. Love for humanity has gone wax cold. Jesus says there will be times like these. RIP to Young Dolph and every person taken away by unnecessary, senseless violence.",
        "I sent three and yes",
        "You can feel that Dolph has been absent .. he would've dropped soooo much hot music by now!!! He always stayed relevant !! I really don't like talking about this..I never got the chance to meet him, but it's crazy how you can connect with a person through music.  I connected with Dolph like many connected with Pac. He inspired me to get my first Mercedes Benz!! LLD 4 ever mannnnn ",
        "I heard back rappers are more likely sing violence or dramatic song. It's what youners generation wanted to heard. They're always of their appearance mean they look. They're enjoying life but they don't beside that they always judge from that. I told my son to give up on music. Its a target to them. Honestly don't listen young. Generation music Sometimes he shake my head i said this. Is why they are over heat.",
        "that public defender told him to do this ",
        "What's funny friend",
        "Young Dolph ? What did he sing about?",
        "He should of came out with the song called \"No freedom\"",
        "Boy I can smell the fuckin common from here. Live the life, this is what happens. I can't believe this shit is acceptable let alone glorified. All this useless killing and hate, y'all need to step your game up and be better.",
        "Woo smiling cuz he know they putting pressure on his ass in 201",
        "Thug wants transfer cuz he fears for his life not so tuff in jail ah coward",
        "That's bullshit ...why are prisoners allowed to do this",
        "Snupe Bands should feel bad he ignored Dolph phone call right before he died ️ these 2 clowns you interviewed know what happened.",
        "Gangster rap has radicalized us smh",
        "This news coverage just got this man so many views, why even she'd light",
        "هظ",
        "How can you record and release songs in jail?  this is all a joke",
        "Witness tampering",
        "I wonder if a CMG indictment gone come now, that the dude who order the hit is caught…. If he gets the high paid lawyer then we all know where the money came from",
        "https://www.youtube.com/watch?v=3ByPm2fJm70 \n\nYoung Dolph’s legacy is set to be both celebrated and continued with nationwide \"Dolph Day of Service efforts this week. Per press release, Nov. 17—which, notably, is formally recognized as a Day of Service in Tennessee and Georgia—will be commemorated with a variety of philanthropy-focused activations across the country.",
        "Young Dolphs Squad in jail looking for Johnson in jail",
        "What a shame.",
        "Why even acknowledge this dude .that's what they do when they locked up it's only popular if us in the world make it so .",
        "#culture",
        "Karma will catch up to him \nHe think he’s clever.",
        "No guns in jail",
        "All the says to me is that the garbage is taking itself out.",
        "Lol He will break",
        "Why are y’all even announcing this mess?! Don’t give this man any type of clout !! He doesn’t deserve any notoriety or money!",
        "He can make a song called Electric Chair..",
        "Him or that song shouldn't be released.",
        "Right aint no guns in jail.",
        "The Bell Curve is correct ",
        "Idk I'm still not convinced it was these 2 dudes who shot dolph in the video cause one of them was to tall these 2 dummies short is hell",
        "Dolph family should sue him for wrongful death, and pull the money from the song. Now that's some justice.",
        "Always screaming R.i.p dolph who ever did it carma will get u man da streets r not safe anymore",
        "Woo had my dying when he said \"ain't no guns in jail\" then hit em with that lil smirk and was like \"gotta stand on all 10\". He know them boys applyin pressure behind bars and that's why dude tryin to transfer out... ",
        "why are you giving free promotion to a murder suspect?",
        "This is actually a statement",
        "Damn...  now that's entertainment.",
        "He scared",
        "Rest dolph PRE ",
        "I swear I'm not going to go listen to that Trash...R.i.p Dolph",
        "We know he straight dropping statements",
        "It sounds like the song \"no statement\" is a coded message for someone in particular on the outside. Disrespectfully put out on the eve of  death.",
        "Mark negga, lol   ",
        "False new",
        "This may be an understatement, but I don't think that these are the smartest dudes in the hood.",
        "Hey everyone I'm not snitching!!",
        "Not illegal to rap over the phone. Why is this news.",
        "All they going to do is take away his phone rights . he ain't never gonna release another song again. He in there now with no paper no pen. And a camera up his. ",
        "Who cares about him? He doesn’t deserve special treatment. If you were in there your way no one special lol don’t drop the soap.",
        "how is this possible? they dont have recording studio in the cell lmfao tf",
        "Loving dat enrichment",
        "Pure ignorance….life and death is no playing matter.",
        "Who cares?",
        "Give him the chair! He took a dad away from his kids and family. LLD .",
        "Now it’s just mainstream ass rappers",
        "The first dude that will be convicted over his rap song",
        "Dinnz gonna dooo",
        "Who gives af about this? I don't even know who he was. He must of had a big mouth on him just like most of the others",
        "Grizzys high pitched scream at 5:48 gives me life",
        "How they get a studio in jail barely can get a book in jail",
        "So yall thought let's help him get his music out there and be heard cause i wouldnt had known shit if it wasnt for this post but now he definitely put a target on his back"
    ],
    "comments_disabled": false
}