{
    "video_id": "ID1FiiBb9-E",
    "comments": [
        "... Did Scissor Keep Technician after evolution? I thought that changes on evolution",
        "I miss broken bdsp xD",
        "My man buying a second switch AND buying BD again just for a Scizor. This is the most funny way to get what we want. Throw money at the situation.",
        "I love the PM7 representation, feesh for the win ",
        "So, you wasted 500$ to get a member so you could finally beat this CYNTHIA………\n\nTHATS DEDICATION!! ",
        "You played perfectly until that stupid metronome! Garchomp should've swept you as punishment. Cool to see you win anyway though. I had to over level to beat Cynthia in Shining Pearl.",
        "The streams from this run was so hilarious. I was laughing for hours ",
        "Am I the only one who thinks Steve is way more of a challenge than Cynthia XD",
        "I started watching you when you did the giveaway streams and you're starting to become one of my favorites.",
        "15:44\nYou did it because it would be funny, dangerous, but most of all, perfect for content... or u did it because your just too good at the game, i belive both options",
        "My man Moxie did his homework to win :)",
        "I am a ten year old and beat her first try",
        "You don't know how much this means to me, Cory. This community you've established is built on love.",
        "I have to respect that you failed it the first time and you do it another time",
        "ALSO ITS NOT JIRATINA ITS GIRATINA",
        "Really entertaining video. \n\nAlthough I found kind of dumb that you acted like you were still in danger against that Garchomp after you f@cking neutered it.",
        "I can hear Jaiden now. \"I told you Gastrodon was the best Pokemon\"",
        "Amazing job with this video in crunch time! I can speak for many who watched live, you did Jaiden dirty. ",
        "Is it just me or do you have to name you Oni x Dwayn",
        "Bro when he said live to Gastrodon I immediately got an ad",
        "Moxman blessing us with all these videos recently yess",
        "Loved the streams! Can't wait to see who wins!!",
        "They gave the garchomp max speed because they were afraid of jaiden outspeeding it again to beat her platinum run",
        "Moxie is so entertaining! I love the art too!",
        "He is coming to react to this, RUN",
        "Using Sonic's Escape form the City is a pro editing move!",
        "10:00 That Diddy Kong Racing music tho",
        "I cant believe you bought another switch for Scizor",
        "Coincidentally half of his strats in Cynthia's fight were same as PChal's strats:\n\nSpecs Clefable to one-shot Spiritomb.\nLeech Seed Roserade against Milotic ( though this is not 100% foolproof, still pretty close. Like, an 8% chance this might not work )",
        "the bulbasaur doodle @ 2:25 is so cute!",
        "I always love when people use bravely default music. Loved the video regardless!",
        "Jaiden has the worst luck",
        "That Garchomp dragon dances instead of eq you lose the entire run",
        "Did he call it a budu? A fucking budew?",
        "I love your nuzlockes",
        "Bruh, you posting the perfect sequels at rapid rates now. Great vid",
        "Still insane",
        "It’s Geratina in German",
        "THE LEGEND HAS RETURNED",
        "the ballsy ass Metronome got me laughing my ass off lmao. Never change Moxie",
        "I GOT LITERAL CHILLS DURING THE CYNTHIA FIGHT",
        "How was ur mcdonalds",
        "Moxie do you plan on doing another artlocke?",
        "Jan is going to be so proud for all the prep! At least. . . Until he loses his mind over the garchomp fight xD",
        "Wait does this fufill the arceus locke lore about jaiden being there?",
        "\"It's like giraffe!\" \nTell that to Farigiraf. ",
        "Lets be honest. Flamingo is losing his brain cells every video, and you know it.",
        "The Dragon Ball Super music is just making me more excited watching this. I salute you good sir",
        "Mmm new video? Yes gimmie",
        "Run",
        "lessssssss gooooooooooo!!!",
        "Moxie: YOU'D THINK I'LL LISTEN TO YOU CHAT HA!",
        "Wow, Moxie, the quality of your videos just keeps getting better. LOVE the pacing and the lilttle sprite animation bits to explain stuff in this one. Super nice video, cant wait to see you play Scarlet and Violet :) if you're planning to stream, I'll be sure to watch you while I explore Paldea as well. Keep up the good work ",
        "Bro watching u metronome 3 times in a row was painful  I loved it",
        "I Have Alakazam Called Hiracles, He Become The Heracles When Battling Cynthia He \"Killed\" 3 pokemon\nLucario, Togekiss And Milotic\nSavior.",
        "4 EV = 1 stat at level 100, it depends on the level (lv 50 it's 8 EV, lv 25 it's 16, etc...)",
        "I love how moxie basically just trolls chat like 24/7",
        "8:00",
        "Wished I watched this stream",
        "Where is the vod for this? I wasn't seeing it on the vod channel",
        "\"I can trade...with myself.\"\nGenius",
        "Love the videos, where I get most information from. Also DANG THE HAIR",
        "ME AND MY MONKE",
        "SooOoOoo about the scarlet violet giveaway, is it play through stream or?",
        "I understand the new switch idea but since you already had pearl why didn't you trade with that?",
        "That ending was insane. If metronome worked I would have flipped out",
        "When you brought up Gerald I remembered toys r us for the first time since it shut down.",
        "How dare you throw jaiden like that, you had it and then just shoot her in the back. You owe jaiden a real elite 4 run.",
        "I love how well Moxie is tied to Gen 4",
        "Okay. I am 32 years old. I've been playing pokemon since I was 7. And I ONLY JUST LEARN NOW WHAT THE SPEED EVS MEAN AND WHAT THE MAGIKARP DOES FOR THEM!!!! WHAT???",
        "The Cynthia remake is by Braxton Burks for those wondering. I listen to all his remakes, they are pretty amazing",
        "Egg",
        "I love the idea that all the Jaydens throughout Moxie's Nuzlockes are the same Jayden just reincarnated",
        "8:45 Huh, what's this? A male Gardavoir? I thought you said male Ralts became Gallade.",
        "Yooooooo",
        "I am so excited for Scarlet and Violet, and Moxie is badass “U thought I would listen to chat?”",
        "God the music in these videos is just so epic. Wonder where he finds these music, goddamn",
        "It woulda been funny if you named monke piplup instead as that was what chat wanted.",
        "When i first played Diamond i completely ignored the i in Dialga and was pronouncing it Dalga.. i dont know why or how",
        "PUFF CAKE best name!",
        "We literally had a war in chat over Metronome omfg that chaos was fking amazing. Long live Moxieverse I'm so ready",
        "big momment",
        "Machop really focused his energy",
        "Are you gonna artlocke scarlet/violet?",
        "first",
        "Ratio\n\n(Btw Puff cake is goated)",
        "That loppuny joke showd up when my phone was at 69 percent",
        "Bro wtf Metronome",
        "I’ll be honest moxie is great at story telling also I thought with all the dialga set up Jaiden would have used roar of time",
        "Moxie, you're an absolute legend. This editing is so good!",
        "NICE MATE YOU DID IT",
        "Why does flint have a lopunny? Cuz she hot",
        "YOU LEGEND!",
        "Great video as always Moxie!",
        "You should play poke wild it’s a really good game",
        "I'm so in love with how you drew Jaiden the Clefable XD",
        "What version of Megalovania is that at 0:40?  I've heard it before but have never been able to pin what it is called.",
        "Wow he really threw Jaiden under the bus back there",
        "friendship is so absurdly broken, its like 5 different items at the same time",
        "9:44 \"That's a lot of money\" he says after streaming a three-part \"If my pokemon dies, I give away a copy of Scarlet or Violet\". Moxie you are something else",
        "Wow the lives this week where Awesome GG Dwayne and Nugget",
        "literally so fcking entertaining",
        "I was disappointed about hearing you cry about Musk buying Twitter.  Who cares.  Twitter is a terrible place.",
        "Loved catching these streams, and getting to be there for the end. A legendary journey!",
        "I was there for the stream and it was chefs kiss 10/10",
        "Goofy for that metronome play ",
        "This was so fun to watch!!",
        "Broooo let Jaiden alive ><\nI love your story telling, gets me chill everytime",
        "Bruh, when you pulled out that metronome, you had me banging my head against the desk.\n\nNevery change, Moxie. Never change.",
        "Moxie literally says she’s hot as f!?$ me:looks at HP bar looks over male",
        "Go Moxie Go, a bit sad I missed the finishing stream but oh well ^w^ <333",
        "GGS ",
        "Why not get a switch lite?",
        "My first play through of brilliant diamond i did a nuzlock and I got a shiny krickitot as my encounter",
        "Gastrodon really just hit us with the no, huh.",
        "Oh man that metronome move was truly stupid. Definitely glad I didn’t watch it",
        "i will just never understand it.. Why Gastrodon doesn't get more love is beyond me.. Always turns up! Always beats expectations! Best Boi/Gurl! I want a North and South AND a better shiny dammit!",
        "rip catto",
        "The moonblast to metronome made my heart sink the ending was amazing tho",
        "OMG, that bulbasaur around the 2 minute mark is the happiest bulbasaur that ever happied. \n\nI love the sped up doki doki song <3 Respect for the amount of nuzlockes you seem to do lately XD",
        "Does rare candy glitch work?",
        "I like how no one likes the friendship mecanik, but in the pokemon anime the friendship thing is one off the biggest things that win battles and shit  ",
        "Moxie: How do children beat Cynthia??!!\nMe: Bibarel Swords Dance",
        "FINNALY. a gen 4 nuzlocke that someone picks chimchar",
        "12:18 me coming out",
        "I am more and more amazed by your storytelling skills with each video you upload! I couldn't take my eyes off the screen for a second, truly impecable ",
        "I got a Shiny Starly for a soul link nuzlocke with my brother",
        "this is unrealistic this is near impossible",
        "he should have moonblast from the beginning which would have made him have a full team. tho it was great seeing the drama. congrats on winning dude it was hard fought.",
        "Yoooooo Its always a great day when Mox-man posts",
        "Hmm well thing about BDSP is This game is baby easy lol",
        "I can't believe you named your Clefairy after a YouTuber1",
        "bro mewtwo is pissychick type",
        "So many pokemon gone",
        "Dropped in the stream for a while it was fun keep up the good work",
        "23:26\nTHE WAY I SCREAMED AND ITS 2 IN THE MORNING",
        "Moxie, your battle style cracks me up every time. The metronome meme was hilarious and completely on point with your gaming aesthetic  never change!!",
        "I liked the video for... \"tackle\"",
        "Honestly you kinda won from the power of friendship",
        "$500 for a tesla, seems like a steal to me",
        "I recently lost to Cynthia just before Garchomp so am grinding at the moment",
        "Everyone sleeps on Gitafarig, but it was thebmain reason I was excited for BDSP. And also why I'm ecstatic about Farigiraf. \n\nRupert the Girafarig fought hard against Cynthia, and has earned his evolution.",
        "I actually cheated a bit to beat cynthia, i transferred a abomasnow to my BD account cus i was only having trouble with garchomp, but i 1 tap the garchomp with it.",
        "whar",
        "FEESH!",
        "please please post the Pokémon to instagram it's been 8 weeks please bro",
        "I respect getting the second switch for that.",
        "I very mad because you didn't listen to your chat",
        "WAIT IS THEIR LORE NOW",
        "The best things in these vidios is when he meets Lopunny",
        "His face reminds me of Joel Hansen",
        "1st comment",
        "Really love your content man just the best",
        "\"I used to think Psychic was pronounced 'pissy chick.'\"\nME TOO!",
        "ha!",
        "Pls can u make an evolution for mandjtv fighting type Pokémon trainin I really want to see what it is",
        "What program do you use??",
        "Sup",
        "Congratulations on beating your first hardcore nuzlocke. You did an amazing job on this video, can't wait to see your next one.",
        "It’s been a wholesome week between the streams and this. Salute to Dwayne🫡",
        "The metronome tackle absolutely killed me",
        "No one gonna question what happened to jaiden with dialga?",
        "Well my anxiety level went high in the end",
        "I dunno if it's just me but man this whole video felt too fast-paced for me, absolute information overload LOL",
        "my hearth at the end",
        "Woohoo",
        "Honestly, I would never have the guts to make risky choices like locking into metronome because of the moves it could give you (like tackle). Somehow, you still made a comeback. Love the content, and congrats on beating your first hardcore nuzlocke.",
        "Loved the ending of the video! Great cliff hanger! Everything with Dialga was great foreshadowing! Loved it!",
        "Hardcore lets go",
        "I was there and it was way too hype and stole my sleep",
        "Based",
        "Jan from pokemon nuzlockes is gonna roast you so hard",
        "I just love your edit. It’s so fantastically dramatic! ",
        "Great Run! Congrats fam!",
        "I mean sure Moonblast would win there, but Metronome could be anything. Even a Moonblast.",
        "Amazing video! Subbed bc of the $500 scizzor ",
        "Already know exactly what PChal is gonna say:\n\n“Yeah, he really should have used Moonblast there, but I get why he didn’t. At the end of the day, we’re all making content and sometimes you have to throw for content. It definitely added to the story. Definitely should’ve used Moonblast though.”",
        "Why metronome ",
        "I love how epic and dramatic you made your videos. Can't wait for Scarlet and Violet ️",
        "Meep",
        "I cheesed Pokémon brilliant diamond elite four by getting a trade for a shiny level 100 entai and the sweeper them",
        "puffcake supremacy!",
        "pokemon challenges is gonna klill you over the choice of metronome over fairy type attack xD",
        "Jaiden did not deserve the ending she got.",
        "Early Gang! Been waiting for this one to come out lol",
        "Seriously? Way to give me a heart attack before I have to go to work Moxie. And that Milotic with its stupid Recover took me AGES to beat. It took me 4 tries to beat Cynthia, she is truly EVIL!! HOT, but evil.",
        "The easiest game",
        "So this is the last Hardcore Nuzlocke PChal has to react to before SV.",
        "*2 days before scarlet/violet come out",
        "Moxie your fucking editing skills are SO GOOD I'm always on the edge of my seat by the end of these LMAO",
        "looks great.love you videos",
        "I feel like should have been before the legends arceus nuzlock cha of how dialga teleports jaiden to the past ( i think )",
        "Honestly such a risky play at the end but if it worked it would've gone down in nuzlock history that was a good run Moxie",
        "bro wtf you talking about?? you did this MONTHS ago",
        "Hey Moxie, nice video! Your videos mean a lot to me, I started drawing from you. In fact, me and my friend are creating a comic book! Cya",
        "Shhh I'm in class",
        "uhh... leftovers heals 1/16th.",
        "NOT PISSY-CHICK ",
        "yesss",
        "Welp, after this I think it's confirmed Moxie hates Jaiden.  he's let her die like 3 times.",
        "Dialga basically said “ YOU THOUGHT JAIDEN WAS DEAD!”",
        "The drawing d at the ends are sooo fricking cooool!!!",
        "And give is the same",
        "You got a like because of the lopuny joke",
        "BDSP nuzlocke is always a joy to watch with the insane elite 4 and champion fight",
        "U were never losing to the twice slowed gchomp so it was all good xd. Infernape defo wouldve sent it packing",
        "YOOOO i named my chimchar monke in my nuzlocke!!",
        "When he said live and the screen went black fighting Cynthia, I got a clash of clans add and the opening for it came on. I thought it was the funniest thing ",
        "I trust Moxie more than I do Google\n\nAnd that's saying a lot! ",
        "This was phenomenal dude!!! Loved every bit of it",
        "10/ out of freaking 10 lovvveee love love love! Yes mate! The drawings- the narration- the content! Love it all! Thank you sir! Thank you! FOR JAIDENNNNNNNNNN",
        "What dose set mode even do please respond",
        "Can you do the same thing you did on your fourth video where you picked generation one Pokemon and changed your typing but this time the generation 2? I would really love that",
        "I love your nuzlockes!!! I was on the edge of my seat on that end game!! Love the artwork too!\nCan't wait to see how you'd play scarlet and violet!",
        "Aww you didn’t go for my boy turtwig I wanted to see turtle again earthquake is one of the best moves and pearl was my first Pokémon game and turtwig was my starter and I named him Leo after Leonardo from tmnt specifically the 2002 Leo those turtles are my top favorite turtles sure 2012 had one of the best shredders if I had to choose between 2002 shredder and 2012 shredder I’m choosing 2002 shredder he’s the scarier one in my opinion",
        "I was confused for a second before remembering timezones are a thing I can I ask where you live I still have two days til SV is out",
        "lets  go first minute\nkeep up the good work and content",
        "How is it a hardcore when u use items other than poke balls",
        "Jijuwa jajuwa joojoowoo",
        "We are in the end of times. Repent and be baptized. Turn to God.\n\nMatthew 3:2 and saying, “Repent, for the kingdom of heaven has come near.”\nIsaiah 45:22 Turn to me and be saved, all you ends of the earth; for I am God, and there is no other.",
        "As always an amazing nuzlocke to watch, even if the deaths Hurt like hell sometimes",
        "So the scarlet and violet giveaways will be next video moxie?",
        "New video let's gooooo!!",
        "Any Nuzlocke can become way more interesting if you can frame things in a way that really add the \"oomph\". You clearly got that in aces now.",
        "Pretend I commented something cool",
        "as a cleffa evolution line lover please stop killing clefables",
        "Could you ppls also play the after story? With Cyntia rematch",
        "Well played moxie",
        "Lmao. “After 15 minutes of stalling his PP”",
        "Me: Why does the fire type user use Lopunny when other fire types exist?\nMoxie: Hehehe, because unlike other fire types, Loppunny is extremely HOT (drum joke sound)\nMe: *Pulls out Gun*\nInfernape: *Aims flamethrower at Moxie*",
        "Moxie Moxie Moxie. Love your content and cannot wait for more. I do hope to see you do more Hardcore Nuzlockes.",
        "JC is a chad, ty for the membership! It won’t go to waste I’ll make sure to give my support to this channel as well",
        "How do I get infinite rare candies?",
        "When was this stream? I’m pretty sure I was there for the Tutel run but is this with the other version of the game?",
        "PM7 FEESH HERE",
        "Me as a German, I'm glad we say the G as actually G like from Greg in every case in German language so giratina is actually giratina with a hard g like Greg",
        "I just finished your type swap nuzlock this morning XD I didn’t know there was a BDSP nuzlock too! Why haven’t I been notified of your streams? Hyped for SV nuzlock next!!",
        "The base way he baited chat into picking starter",
        "And there's my friend, how are you doing there, I don't know that you are always in my heart guys",
        "I didn't know about all of these glitches. I'm probably gonna have to try them now",
        "in my head canno greg is a god of power like kratos ( from mythology not god of war ) ,goerge is god of under world ( like hades) , jaiden is goddes of rebirth like zakreus ( he is god of rebirth cuz he died and was reborn and dionisus) and now we khnow when she was broud to hisui to become goddes",
        "HOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOW",
        "How I beat Cynthia’s Garchomp used Garydos as I just used waterfall and full restores and  garchomp kept using dragon claw finally beat it cheesed with no regrets",
        "I love how you literally stomped that gym leader with a shellos. Probably shouldn't love it as much, but oh well.",
        "I some how beat Cynthia without items and on my first try",
        "Man I must have totally missed this stream, unless it's old?",
        "Puffcake honestly goated",
        "Keep up the great work with the nuzlockes moxie was great time watching them",
        "Lol I'm sorry.Moxie. Moxie strategizing? Remember that time he kept failing the questions in the gym XD what strategy???",
        "Oh God the crits early",
        "Love your videos, I wish you would upload more often but I understand the work that you put in, well worth it. Looking forward to the new game.",
        "Bro bought an entire new switch, iust for a scizor. The Dedication is crazy",
        "Just think the run would be dead if moxie played shining pearl",
        "While watching this I found my first ever shiny, wasn't even hunting",
        "Chimchar w",
        "Hi\nLove you man",
        "Seb the legend. Congrats moxie. You deserve the win!",
        "he legit made a whole Jaiden subplot mid nuzlock. best Poketuber! The editing and voice over with that delicious accent makes everything more epic.",
        "Your videos are always so freaking delightful. Definitely turned the end of my day around \nAnd I finally caught your most recent Nuzlocke streams! I stayed up until 5am to watch, but it was so much fun. Keep making quality content Moxie, it always makes my day ️",
        "Congratulations on the successful Nuzlocke!\nLike last time, Cynthia was insane. The music choice and video editing were great as well (not the biggest fan of the frequent use of the dramatic sting at the end tbh, but it's completely fine tbh).\nEnding was also pretty cool, really provided closure and whatnot.",
        "First",
        "This game still looks better visual than scarlet and violet. At least they chose an art style and stuck with it lol",
        "gible and giratine are both pronounced as K because fo the I",
        "pog",
        "I really like how the champion actually is \"Hard\" the competitve team helps bring about that sense of fear and struggle to older pokemon fans, yet still can be beaten if its babys first pokemon game.\n\ncompetitve elite four and champion should be used more often",
        "Fabulous video! I absolutely love your videos!",
        "Me screaming at my phone, \"YOU HAD MOONBLAST!!!!! JUST USE MOONBLAST!!!!!!\" But then he probably did it for chat to get their reaction",
        "You absolute mad lad",
        "Moxie good job winning the nuzlocke but I'm salty for the fact you just almost lost the run due to the fact you made jaiden use metronome",
        "I beat Cynthia by switching in my garados using intimidate then switching in my clefable to make dragon claw useless.",
        "Jaiden died for nothing. NOTHING!",
        "Yassss",
        "I always found it funny that people simp over Cynthia.  I mean I get it, she's got step on you energy, but I fucking hate that shit xD",
        "YOU USE A WEVILE",
        "“Girafa-screams-RIG” ",
        "Im love seeb ",
        "Dialga: No resetting your way out of this one, Jaiden\nJaiden: But I'm not that-\nDialga: I'm aware. But even gods allowed to be petty sometimes. Farewell.\nProceeds to banish Jaiden to the past.",
        "This man should do Radical Red!! Think he would love the new patch with the pixelart",
        "6:30 ayo",
        "Love how you can abuse the game with bugs",
        "Love your videos man",
        "If you had used Togekiss you could've easily beaten the whole game, and been immune or resistant to all of Garchomp's attacks.",
        "I beat her on my first try",
        "Hay moxie I have a request. Since you're a great artist I thought I could send you an idea I had for Pokemon I do have discord and I am in your Discord just message me if you're interested.",
        "Dialga: What are you doing here?\nJaiden: He went for the memes and failed.\nDailga: Carry on",
        "No only does Moxie make great videos but he also gives tips for nuzlockes! Now I know how to get EVs for my Pokémon Sword nuzlocke!",
        "When i got the secret ability sinnoh starters a while ago i named the chimchar monke also when i played diamond back in like 2019 i had a turtwig named turt litteraly the next year jaidenanimations did her platinum nuzlocke and named the turtwig turt",
        "I like how in every Nuzlocke some form of Shinx just dies",
        "SHELLOS!!! Shellos are amazing.",
        "Did you use metronome as a joke orrrrr",
        "Lol Jaiden dies (again), but this time she kamikaze’d herself instead of getting taken out by a crit. Also, that was pretty Jaiden-like that Metronome didn’t go for the conventional moves.",
        "Think how cool it would've been if Jaiden had called a cool move on metronome though! Kinda worth it xD",
        "The moxie lore is so amazing! Can’t wait to see where it goes in the Paldea region! ",
        "yes finally somebody knows the the item metronome can actually be used against this very Cynthia i used the start of Gyarados metronome crunch and it litterly ate Cynthia's entire team",
        "I swear I heared hottest not hardest Champion Cynthia !",
        "Hello",
        "Moxie: Shows Gastrodon fighting Garchomp.\nAlso Moxie: Tries to convince us Gastrodon will die right before Garchomp coming out.",
        "Early",
        "''YoU ThOuGhT i WoUlD lIsTeN tO cHaT?'' never gets old lmao \n\nalso ayo more lore? ",
        "What a legend, unreal dedication",
        "metronome for the content is ALWAYS worth it, even if you lose. don't listen to the tryhards. get that epic clip",
        "Bro I love how he’s in the middle of the battle and isn’t paying attention at all and still won",
        "Why would you throw the game. With metronome.",
        "TOYS-R-US IS COMING BACK!! WOOOOOOOOO MY CHILDHOOD!!",
        "8h ago????",
        "The triple crit Machop sums up most of my Nuzlocke attempts",
        "And to think that I watched this video AFTER he streamed a game where he spent away over $3000 Dollars for a Scarlet and Violet Giveaway.",
        "Moxie: Has Jaiden use choice specs metronome\nAlso Moxie: \"Jaiden, what are you doing!?\"",
        "Beat bdsp a few nights ago- let’s just say I’m very glad I didn’t replace toxic on roserade.",
        "The friendship is SO BROKEN. In Sword and Shield, my sylveon just always crit and nothing touched her.",
        "Is that glitch legit? Because I would use a ton of rate candy to get through bdsp.",
        "Here’s a rule that I have been adding to my recent Nuzlockés; The rule is “The player may not have two (or more) of the same Pokémon type in their party.” This allows for a much higher difficulty challenge wise, and strategy wise.",
        "A Legend inside a group of legends.",
        "The adventure continues in scarlet and violet",
        "Lopunny also learns Blaze Kick in SwSh, furthering it’s fiery nature",
        "I NEED more artlocks\n\nNuzlocks < Artlocks",
        "The Puffcake run! Let's gooooo!!! Also the art at the end...️",
        "I'm pretty sure we have friendship dodges and crits since Pokémon XY, I spent literal hours in Pokémon Amie to max my friendship with my Pokémon, they dodged and crit a lot. why people just say is bullshit now? it's because no one cared enough to play with Amie and Refresh?",
        "Don't mind me jamming out to the Bravely Default song at 18:08",
        "I was looking to do a artlocke can anyone give me some tips cuz i never done one before",
        "Hi",
        "Bro just got off work hype for a new video!!",
        "I'd never thought I would see a play dumber than Onix v Jynx but yet here we are, Choice Specs Metronome instead of Choice Specs Moonblast v Garchomp. I'm... speechless",
        "(no much but) The recent SV giveaway livestream was insane, Wow for my first, I would've not expected that lol! A very fun nice idea tho, and you held up well in it.. :) Here's more for the giveaway pile, or bills, whatever you need. Please have a fine day and well rest Moxie! ",
        "what's a nuzlocke?",
        "“Short for evaluation value not the Pokemon eevee”\nBut I like eevee ",
        "I pp stalled her garchomp with a skarmory and togekiss. Just swapped between for dragon claw and poison jab immunity. Literally nothing she can do. Poor garchomp",
        "I remember when I did my first ever nuzlocke I was willing to try to finish. I got all the way to the elite four, and none of it was luck from the friendship mechanic. Most of the elite four except Burny who almost killed my Bubbles the Gastrodon. When it finally came to Cynthia though I finally lost a Pokémon, and it was my Bronzong named Coin who got mirror coated. When it finally died most of Cynthia’s team was easy. At the end there was one single time friendship mechanic may have helped but it was missing a minus 1 attack dragon claw so it wouldn’t matter. Cynthia still scary as heck though.",
        "I can't wait to see how PChal reacts to you saying \"He isn't going to react to this\" lololol",
        "Let's fucking go! Such a great video",
        "Moxie never heard of monke? Damn Australia is really behind",
        "I’m glad I’m not the only one who named their starly birb",
        "How to take down Garchomp : \n\nSend out a Gardivor which knows trick room with a focus sash. ",
        "Fun fact you can play the gym badges in bdsp.",
        "Your commentary throughout the Nuzlocke makes me laugh, Moxie. I'm also proud for all the prep you did in getting this dub. CONGRATULATIONS ON YOUR FIRST HARD Nuzlocke WIN!! ",
        "For those confused about the final scene, this takes place before my Legends Arceus nuzlocke. There's your hint ",
        "\"YOU THOUGHT I WOULD LISTEN TO CHAT?!\" is the BIGGEST reverse uno in streamer history lol",
        "The song at 9:30 hit me hard in the nostalgia",
        "Jaiden was sent from the god of time to help Moxie. What a legend ",
        "e",
        "I remember watching this! :0",
        "Scizor was the best member on my team for Cynthia. Swords dance and double team spam on Roserade and then one shot everything. Is it cheap? Yes. But does it work? Double yes",
        "LETSSSSS GOOOOOO!!!!!",
        "sup",
        "Moxie payed $460 for my 2nd favourite pokemon, I really respect that :) also that metronome thing was way too unlucky",
        "early",
        "12:17 TRANSGENDER:bangbang:",
        "So a nuzlocke is basically letting your pokemon die after it faints. Calling the people who killed it bad when you killed it lol.",
        "your story telling has improved massively its really insane dude, keep it up",
        "Imagine doing this without “glitches”. Nah that’s not fair. To hard I guess…. Only one I don’t have a problem with is the rare candy glitch. No one wants to sit there grinding,  but the other ones ? Come on",
        "Poketubers are bouta milk the life out of this video",
        "13:48 excuse me but you killed the water type with earthquake... then chose to use scald on the luxray???? HUH????",
        "Dude I was so mad when you threw with Jaiden lmao",
        "As pchal would say \"punished\"",
        "Legit insane editing skills! Sick video!!",
        "weavile makes cynthia so ez",
        "He made the final fight vs Garchomp  way more complicated than it need to be",
        "Moxie I just turned eleven 5 days ago I won Cynthia on brilliant diamond",
        "I love seeing how much Kratos has grown, he has absolutely changed and continues to do so. Also really loving the trio of Kratos, Freya, and Mimir",
        "I'm glad moxie is finally back to uploading again",
        "the JAME crashed ooohhh my god I hate my life ",
        "Jaiden is a freaking TANK",
        "Did Jaiden just meet God?",
        "He actually made BDSP challenging… BEFORE CYNTHIA",
        "SZA is a great pokemon",
        "when you're also a jimmyhere fan and named your chimchar MONKE!!!!!!!",
        "Risking the Locke for funny content instead? I'm down for it! xD",
        "That was amazing",
        "I am SOOOOOOOOOOO mad that he used \"that\" move for Jadien at the end. Idc if it was for content, he could've been a deathless battle against her.",
        "I almost lost against Cynthia but thankfully had Gardevoir and just used Calm Mind like 4 times and then thunderbolt the Milotic and was able to have Gyrados bulldoze the garmchomp so Gardevoir could outspeed and moonblast it.",
        "The Clefable moment was dumb man",
        "Pokemon challenge coming in this video and saying how good is starter is for 42 minister streate bet",
        "I saw myself in a few frames lmao- am happy",
        "You risked matronome? Bruh....why?",
        "Great Nuzlocke Moxie!",
        "moxie can just never keep jayden alive lol",
        "When scarlet and violet come out when are you going to do them and which one are you going to do first.",
        "Yo moxie do you think the reason they put aipom on volkner’s team is because of a monkey wrench? Stretch maybe but still…. Monke Wrench.",
        "Ngl, I thought the Art of Dialga and Clefairy was forshadowing that  Metronome would choose Roar of Time xD Especially with all that build up xD",
        "This is dramatic humourous and just perfect!",
        "8:31 Sonic Adventure 2 music :0 Escape From The City. I sang that for the talent show in my school last year lol.",
        "Imma be honest, he fuckin got me with the “u think it didn’t live?”",
        "I felt so much pain when you decided to lock in Choice Specs Metronome for the meme. You’re throwing lives away!",
        "Noice dude I think I was there for some of those streams",
        "Man I hope Jan reacts to this. He'd get a good laugh I reckon.\n\n\"I know, let's metronome!\"",
        "\"You thought I would listen to chat?\" Moxie is an absolute madlad xD",
        "Loved this video, unreal dedication to beat an entire second attempt!",
        "Damn i think i never been this early before",
        "Doesn't know how to pronounce Giratina, meanwhile this dude pronounces Acreus as arse-ius ",
        "Well of course Luxio doesn’t one shot your opponent, he’s special stat is shit, he’s a physical attack to the point I’d believe it if somebody said spark would do more damage, to bad he can’t learn Thunder fang naturally in this game.",
        "amazing",
        "Maybe Barry's starly refuses to evolve",
        "I recently played doki doki for the first time and listening to the OST on the background kf this vid gave me war flashbacks",
        "I laughed at how you predicted & shutdown Steelix & Mismagius in the gyms... good job",
        "Ah yes, the good ole \"Do a *Hardcore Nuzlocke but using glitches to get infinite Rare Candies\" run. That's like a player winning Super Bowl MVP in the same season they gets suspended a few games for getting busted after getting caught using PED's.",
        "This will once be known as legendary! And the best video on YouTube!",
        "1:56 jaiden would be sooo pissed xD she REALLY wanted it in her platin nuzlocke but didnt get it xD",
        "Excited",
        "Moxie: hyping up the Garchomp fight as being the end of the run\nMe who realized that with a Fairy-type, a Flying-type, and a Steel-type, he could PP Stall Garchomp: \"AAAAAAAAAAAAAAAAAAAA\"",
        "How I beat Cynthia with a damaged under leveled team: \n\nMy team was ",
        "Amazing video! And I was able to make it to the stream!",
        "Nicely done sir!  Too bad about Jaiden…next time!  I can’t for the next Pokémon game!  I hope you doing either nuzlocke or artlocke.  Although you could do a Jaiden must live locke where Jaiden can’t die but you lose a random Pokémon on your team.  Keep up the good work bro!  See you in the next one.",
        "Is it sad to say I wish he would of gotten sweeped after that play",
        "Moxie I adore you and your videos are amazing, but seriously you are your own worst enemy! Poor Jaiden glad you won it for her at least.",
        "Disliked for the bullshit with metronome at the end. That isn’t funny, it just kills tension and satisfaction of seeing a well-laid plan work out when you throw on purpose",
        "Jaydenand turned into a God",
        "That's hilarious. My first playthrough of this game ended with my Roserade dodging Earthquake due to friendship and finishing with Dazzling Gleam, too.",
        "your luck was bs the entire  video and time you felt lucky something screwed it up, an amazing video nonetheless, also you financial decisions are something else.",
        "That Metronome at the end was painful to watch. Lol.",
        "Quac",
        "Moxies great",
        "Hi moxie",
        "11:22 Oh no not the Jame",
        "So here's a question, does the hold Item Metronome increase the power of the move Metronome with consecutive use?",
        "My man really bought an ENTIRE new switch and a new copy of the game just to evolve a Scyther. What a madlad. (Couldnt you just use home to move the Scyther to a different game that can go online, trade it to evolve then use home to put it back?)",
        "hello",
        "You explaination of EVs is wrong, having 4 EVs in a stat does make the stat 1 point higher.... When you are at level 100, at lower levels it requires a lot more EVs to raise a stat by 1",
        "i would pay for anything for a scizor but not buying another switch like you. HAHAHA",
        "I love that the final battle is a third of the entire video",
        "Moxie don’t try anything Sus I repsect that",
        "Can i get the new swichts i need it heheh",
        "Cynth",
        "Blub",
        "Awesome video",
        "little art in vids make me happy",
        "Great video",
        "Greetings from Puerto Rico!. I'm tye first comment!.",
        "Moxie: I need to beat this before scarlet and violet come out\nAlso moxie: LET'S THROW THE FINAL FIGHT AGAINST THE LAST POKEMON BY USING CHOICE SPECS METRONOME!!",
        "Why no trick room",
        "The editing and music gave Minecraft Manhunt levels of tension!!!",
        "Phenonmenal art and reactions as always. Congratulations Hardcore Champion",
        "The nerve of Amity Square personel to call Shellos & Budew \"not cute\"   one of them is even a baby Pokemon and they are the essence of cuteness",
        "Not even different? Have you even compared the secret bases from the original versions with the remakes? They ruined the secret bases in the remakes. Worst remakes ever.",
        "2:02 the fact you didnt name Shellos \"Jaiden\" since its her favorite Pokemon makes me kinda sad lol",
        "An interesting idea for a future nuzlocke:\nInstead of no items in battle, you can only use healing items while in battle.\nI don't know for sure how good of an idea that is but it might be interesting ",
        "What is the song at the end called? :) It really gave me goosebumps together with the drawings :D",
        "Thanks for posting at the perfect time!",
        "For the CONTENT!!!!!!",
        "I'm late but I started a new game and named my chimchar monke before I watched this video",
        "so sick",
        "Loved this vid moxie keep up the good work.",
        "Bro stop throwing",
        "I think this is your best video yet, Moxie! 10/10 entertainment, start to finish! Congrats on winning even after almost snatching defeat from the jaws of victory!",
        "wait how did he do the glitch- i need some help figuring that out please",
        "I can't believe you actually got jaiden killed you monster",
        "Comment for the algorithm.",
        "Of course the Pokémon you named Tesla wound up being comically overpriced. Art imitates life",
        "After watching this video, I have no idea how I beat the Cynthia at 8 years old with strictly attack moves",
        "R.I.P. Jaiden",
        "Yo I'm early",
        "8:47 Time for the eighth Gym",
        "I love bronzong",
        "Congratulations on your win!\ncan't believe you opted out of Moonblast, for Metronome!\nGlad to see it wasn't a run killer- can't have a $400 + dollar Scizor for nothing- but damn ya could of gotten a clean win.",
        "Ok finally I BEAT MARS'S PURUGLY WITH ONLY 2 MOVES WITH MY MONFERNO",
        "Can someone explain the ending",
        "High roll metronome",
        "YOO I NAMED MY CHIMCHAR MONKE TOOO",
        "I remember lying about zubat and then I named them pyra for 10 subs and didn’t pay up",
        "My guts avalanche Ursaring ohko’d the Garchomp",
        "moxie you spent $400 just to trade a metal coat, please blink if you need help",
        "Moxie really did just decide to sacrifice Jaiden for kicks, and I respect that",
        "Love watching your nuzlockes! Please keep up the amazing content!",
        "You got f***ing lucky",
        "Im here for the giveaway BTW im gonna like and WATCH THE WHOLE VIDEO love u BIG MOMMY MOXIE",
        "When he called Flint Ronald lmaooo",
        "Why on earth would you let Jaiden's luck roll the dice?! It's Jaiden!",
        "Hell yeah, our boy steppin' up to the big league. My lunch break tomorrow just got insanely better ",
        "I enjoy each new video more than the last. Your editing and storytelling skills are incredible. Keep up the good work and the funny and entertaining videos!! ",
        "Man, that was pretty intense with some big brain strats. You still threw with that Metronome tho bruh.\n\nIt was a great watch though. Can't wait to see you play Scarlet and Violet.",
        "Classic Jaiden luck.",
        "Thank you for showing pink Shellos/Gastrodon some love.\nEverybody seems loves the blue one..",
        "Gyarados was all you needed for garchomp. Two ice fangs kill. First one breaks the berry, Gyarados survived any attack that didn't crit, then the second ice fang would do enough to kill. Switching Jaiden in wasn't required",
        "That Jarchomp could've really screwed you over",
        "That friendship mechanic is insane my torterra dodged Cynthia's Garchomp so many times. I loved it so much that Torterra became my favorite.",
        "Cynthias music is so cool! >:D It just makes me wanna Punt something to the moon. COME HERE MOXIE",
        "maybe next time, when you catch a gastly itll be jaiden! because gengar is clefairy's opposite!",
        "17:03\n......Oh...",
        "earrrrlllyyy",
        "YEESSSS",
        "I love that PChal is the boogieman of the nuzlocke community",
        "I'm amazed how a single Metal Coat made Moxie pay 460$ just so he could get a Sizcor xD",
        "BDSP looks like a child's game but the battles are waaaayyyy harder",
        "8:33\nLooking at the box, I'm waiting for PokemonChallenges to react to this nuzlocke, push up his glasses, and go, \"Chat. Looking at this box, what is the best Pokemon in it that he could have used in the ghost gym, maybe even the best Pokemon he has?\"",
        "Y did u not switch to scisor on the poison jab",
        "Its giratina with the hard g",
        "Yes!! Im so excited! I enjoy your videos so much! ",
        "How did he spend $460 on it?",
        "Moxieverse of Madness",
        "PUFFCAKE",
        "The difficulty curve in bdsp is so crazy",
        "Errr...  BDSP is a really easy game to Hardcore Nuzlocke.  Sure, Cynthia is by far the hardest champion in the franchise, but she's just ONE potential run-ender, who you have an entire game to prepare for and the ability to cherry-pick your team with dupes clause guaranteed encounters and even the ability to save and choose your Underground encounter (even if you lock yourself to ONE encounter for the ENTIRE Underground, like me).  Meanwhile, games like Colosseum, B2W2 and USUM have potential run-enders REPEATEDLY throughout the game, as well as you having MUCH less time and fewer resources to prepare for them.  Hell, if you don't ban the Lake Guardians, Uxie alone can 1v5 Cynthia's team with Yawn + SubCM + 1 Psychic type attack as soon as you run through the Spiritomb with another pokemon (people who ban most legendaries still typically allow those with below 600 BST).  ",
        "Death, it's one of the biggest events that will ever take place in your life. We face death everyday, conscious or unconsciously of it; death lurks around every corner of our life. Like a lion waiting to catch its prey, death comes for us all in many shapes and forms; seemingly there is no one who can escape from the jaws of death.",
        "",
        "dude the movie pronounced it with a hard g",
        "Chimchar is just better overall",
        "Hype ending, that was epic! ",
        "Waiting for Jaiden's Redemption Arc? Maybe in Scarlet Playthrough? Can't wait for the next run",
        "Awesome work Moxie! The video was awesome! Now! On to Gen 9! >=D",
        "I have to say, the friendship mechanic does succeed in making good stories, even if it is kinda broken",
        "Megalovania!!!!! Lol i love this"
    ],
    "comments_disabled": false
}