{"video_id": "ID1FiiBb9-E", "comments": ["For those confused about the final scene, this takes place before my Legends Arceus nuzlocke. There's your hint ", "Dialga: What are you doing here?\nJaiden: He went for the memes and failed.\nDailga: Carry on", "\"You thought I would listen to chat?\" Moxie is an absolute madlad xD", "Moxie: Shows Gastrodon fighting Garchomp.\nAlso Moxie: Tries to convince us Gastrodon will die right before Garchomp coming out.", "I have to say, the friendship mechanic does succeed in making good stories, even if it is kinda broken", "Jan is going to be so proud for all the prep! At least. . . Until he loses his mind over the garchomp fight xD", "9:44 \"That's a lot of money\" he says after streaming a three-part \"If my pokemon dies, I give away a copy of Scarlet or Violet\". Moxie you are something else", "I'm amazed how a single Metal Coat made Moxie pay 460$ just so he could get a Sizcor xD", "The moonblast to metronome made my heart sink the ending was amazing tho", "He actually made BDSP challenging… BEFORE CYNTHIA", "Honestly, I would never have the guts to make risky choices like locking into metronome because of the moves it could give you (like tackle). Somehow, you still made a comeback. Love the content, and congrats on beating your first hardcore nuzlocke.", "Wow, Moxie, the quality of your videos just keeps getting better. LOVE the pacing and the lilttle sprite animation bits to explain stuff in this one. Super nice video, cant wait to see you play Scarlet and Violet :) if you're planning to stream, I'll be sure to watch you while I explore Paldea as well. Keep up the good work ", "As always an amazing nuzlocke to watch, even if the deaths Hurt like hell sometimes", "Having moxie troll the chat and the chat troll back is both wholesome and hilarious. I will always stay up until 3 in the morning when he streams.", "I love how moxie basically just trolls chat like 24/7", "The difficulty curve in bdsp is so crazy", "Moxie: Has Jaiden use choice specs metronome\nAlso Moxie: \"Jaiden, what are you doing!?\"", "That ending was insane. If metronome worked I would have flipped out", "We literally had a war in chat over Metronome omfg that chaos was fking amazing. Long live Moxieverse I'm so ready", "I love how well Moxie is tied to Gen 4", "Honestly such a risky play at the end but if it worked it would've gone down in nuzlock history that was a good run Moxie", "Moxie: I need to beat this before scarlet and violet come out\nAlso moxie: LET'S THROW THE FINAL FIGHT AGAINST THE LAST POKEMON BY USING CHOICE SPECS METRONOME!!", "The triple crit Machop sums up most of my Nuzlocke attempts", "You don't know how much this means to me, Cory. This community you've established is built on love.", "Watching this after watching your randomizer of Soul Silver (live)… you are ready for Scarlet and Violet", "Hell yeah, our boy steppin' up to the big league. My lunch break tomorrow just got insanely better ", "Loved catching these streams, and getting to be there for the end. A legendary journey!", "your story telling has improved massively its really insane dude, keep it up", "I am more and more amazed by your storytelling skills with each video you upload! I couldn't take my eyes off the screen for a second, truly impecable ", "The metronome tackle absolutely killed me", "BDSP nuzlocke is always a joy to watch with the insane elite 4 and champion fight", "I love how epic and dramatic you made your videos. Can't wait for Scarlet and Violet ️", "That's hilarious. My first playthrough of this game ended with my Roserade dodging Earthquake due to friendship and finishing with Dazzling Gleam, too.", "Only watched about a minute and I know it's gonna be a banger.", "I just finished your type swap nuzlock this morning XD I didn’t know there was a BDSP nuzlock too! Why haven’t I been notified of your streams? Hyped for SV nuzlock next!!", "Your videos are always so freaking delightful. Definitely turned the end of my day around \nAnd I finally caught your most recent Nuzlocke streams! I stayed up until 5am to watch, but it was so much fun. Keep making quality content Moxie, it always makes my day ️", "I love seeing how much Kratos has grown, he has absolutely changed and continues to do so. Also really loving the trio of Kratos, Freya, and Mimir", "I trust Moxie more than I do Google\n\nAnd that's saying a lot! ", "Congratulations on beating your first hardcore nuzlocke. You did an amazing job on this video, can't wait to see your next one.", "I love that PChal is the boogieman of the nuzlocke community", "Phenonmenal art and reactions as always. Congratulations Hardcore Champion", "I am so excited for Scarlet and Violet, and Moxie is badass “U thought I would listen to chat?”", "Your commentary throughout the Nuzlocke makes me laugh, Moxie. I'm also proud for all the prep you did in getting this dub. CONGRATULATIONS ON YOUR FIRST HARD Nuzlocke WIN!! ", "Thank you for showing pink Shellos/Gastrodon some love.\nEverybody seems loves the blue one..", "Love watching your nuzlockes! Please keep up the amazing content!", "This man should do Radical Red!! Think he would love the new patch with the pixelart", "I enjoy each new video more than the last. Your editing and storytelling skills are incredible. Keep up the good work and the funny and entertaining videos!! ", "I’ll be honest moxie is great at story telling also I thought with all the dialga set up Jaiden would have used roar of time", "This will once be known as legendary! And the best video on YouTube!", "Moxie, your battle style cracks me up every time. The metronome meme was hilarious and completely on point with your gaming aesthetic  never change!!", "Moxie: “Whole team, versus Garchomp.”\nGarchomp: “Then it is an even fight.”", "Seb the legend. Congrats moxie. You deserve the win!", "Congratulations on the successful Nuzlocke!\nLike last time, Cynthia was insane. The music choice and video editing were great as well (not the biggest fan of the frequent use of the dramatic sting at the end tbh, but it's completely fine tbh).\nEnding was also pretty cool, really provided closure and whatnot.", "Moxie, these are so much fun to watch!  GG man!", "I love your nuzlockes!!! I was on the edge of my seat on that end game!! Love the artwork too!\nCan't wait to see how you'd play scarlet and violet!", "The moxie lore is so amazing! Can’t wait to see where it goes in the Paldea region! ", "Man this was SOMETHING to be apart of live, I'm so excited for the SV nuzlocke & the video from the HG nuzlocke.", "10/ out of freaking 10 lovvveee love love love! Yes mate! The drawings- the narration- the content! Love it all! Thank you sir! Thank you! FOR JAIDENNNNNNNNNN", "Loved the ending of the video! Great cliff hanger! Everything with Dialga was great foreshadowing! Loved it!", "This is dramatic humourous and just perfect!", "This was phenomenal dude!!! Loved every bit of it", "Moxie is so entertaining! I love the art too!", "Keep up the great work with the nuzlockes moxie was great time watching them", "Moxie, you're an absolute legend. This editing is so good!", "An interesting idea for a future nuzlocke:\nInstead of no items in battle, you can only use healing items while in battle.\nI don't know for sure how good of an idea that is but it might be interesting ", "The streams from this run was so hilarious. I was laughing for hours ", "Bruh, you posting the perfect sequels at rapid rates now. Great vid", "The Puffcake run! Let's gooooo!!! Also the art at the end...️", "Bruh, when you pulled out that metronome, you had me banging my head against the desk.\n\nNevery change, Moxie. Never change.", "That friendship mechanic is insane my torterra dodged Cynthia's Garchomp so many times. I loved it so much that Torterra became my favorite.", "Love your videos, I wish you would upload more often but I understand the work that you put in, well worth it. Looking forward to the new game.", "No only does Moxie make great videos but he also gives tips for nuzlockes! Now I know how to get EVs for my Pokémon Sword nuzlocke!", "the ballsy ass Metronome got me laughing my ass off lmao. Never change Moxie", "I can hear Jaiden now. \"I told you Gastrodon was the best Pokemon\"", "Jaiden was sent from the god of time to help Moxie. What a legend ", "I'm glad moxie is finally back to uploading again", "Moxie Moxie Moxie. Love your content and cannot wait for more. I do hope to see you do more Hardcore Nuzlockes.", "Loved the streams! Can't wait to see who wins!!", "Dialga: No resetting your way out of this one, Jaiden\nJaiden: But I'm not that-\nDialga: I'm aware. But even gods allowed to be petty sometimes. Farewell.\nProceeds to banish Jaiden to the past.", "interms of epic nuzlocke videos, I don't think ayone tells a better story than you. G frickin' G Moxie!", "Legit insane editing skills! Sick video!!", "What a legend, unreal dedication", "A Legend inside a group of legends.", "Great Nuzlocke Moxie!", "This was so fun to watch!!", "Bro I love how he’s in the middle of the battle and isn’t paying attention at all and still won", "he legit made a whole Jaiden subplot mid nuzlock. best Poketuber! The editing and voice over with that delicious accent makes everything more epic.", "Everyone sleeps on Gitafarig, but it was thebmain reason I was excited for BDSP. And also why I'm ecstatic about Farigiraf. \n\nRupert the Girafarig fought hard against Cynthia, and has earned his evolution.", "Dialga basically said “ YOU THOUGHT JAIDEN WAS DEAD!”", "Great Run! Congrats fam!", "Great video as always Moxie!", "I really like how the champion actually is \"Hard\" the competitve team helps bring about that sense of fear and struggle to older pokemon fans, yet still can be beaten if its babys first pokemon game.\n\ncompetitve elite four and champion should be used more often", "Man, that was pretty intense with some big brain strats. You still threw with that Metronome tho bruh.\n\nIt was a great watch though. Can't wait to see you play Scarlet and Violet.", "Moxie payed $460 for my 2nd favourite pokemon, I really respect that :) also that metronome thing was way too unlucky", "Awesome work Moxie! The video was awesome! Now! On to Gen 9! >=D", "I dunno if it's just me but man this whole video felt too fast-paced for me, absolute information overload LOL", "While watching this I found my first ever shiny, wasn't even hunting", "Congratulations on your win!\ncan't believe you opted out of Moonblast, for Metronome!\nGlad to see it wasn't a run killer- can't have a $400 + dollar Scizor for nothing- but damn ya could of gotten a clean win.", "Man I hope Jan reacts to this. He'd get a good laugh I reckon.\n\n\"I know, let's metronome!\"", "You go Moxie."]}