{
    "video_id": "IFchKNel1Xc",
    "comments": [
        "No matter what you decide to do I will watch it hands-down I love your videos!",
        "I think going live would be so cool and from what I’m hearing I think you’d enjoy it as well as us fans. It really does create a sense of community and connection.\nAlso my favs would be your product testing videos and drugstore reviews ",
        "From seeing those first ads for your channel…to driving down to my US mailing address to pick up my Tati vits….to today…I’ve enjoyed being a part of your journey ️",
        "Happy YouTube anniversary Tati!! ",
        "Boobra was a memorable video  I would love to see a how to complete look video from outfit to jewelry to hair and makeup. I’m a 35 yr mom of two and the horrible dread of letting myself go is kicking in. The balance between caring too much (of how I look) and not enough is an art I haven’t mastered yet ️",
        "I think a live would be cool because its new and no beauty chanel is going that way.",
        "I know it's not something you'd normally film but I'd love to see a try on video of your staple clothing pieces, or new things! I think you have such a great fashion sense, I'm always wondering where you shop for clothes!",
        "James throwing water on you was a definite favorite. I love wtf.",
        "Yes been here since the begging.  I was so happy to see you back after you left YouTube for awhile. You have always been my favorite person to watch on YouTube. Love vlogs with you,james,and puka. Day in the life videos.Hope Puka is feeling better! I love the idea of lives and podcasts. Always loved your wtf videos!",
        "Thank you for being so graceful all the time, never regrets supporting you!!",
        "Been here since the beginning...the true raw \"beauty community\" before it even had a name. The early days of Jaclyn Hill, MissJenFabulous, Nicole Guerriero, etc. Before the days of sponsorships and brand deals, makeup lines and collabs, before rings lights and filming on anything but a webcam or phone camera! ",
        "So when my son was born I had the worst postnatal depression. And you became part of my every day sanity.  \n\nSo in the UK your videos would go live at 6pm and every night I would put him in the bath and I would sit on my bathroom floor and watch your videos for a small moment of peace in my day.  A time where I would be totally distracted from what was happening around me. My son would sit and play in the bath and I would sit on the floor beside the bath and just escape it.     You were a massive part of my everyday routine during that dark time. And I think that’s really what YouTube is suppose to be, a place for someone to escape and connect to something bigger than themselves and there own circumstance.",
        "CAN WE take a moment and point out YOUR GLOW?? Literally your hair and skin look ABSOLUTELY PHENOMENAL ",
        "I think your idea of a live would be great. It rings true to the idea of connection and community. And Happy Anniversary to you! I'm one of your ghost viewers who don't leave comments often but when i do watch your videos, I always thumbs up!",
        "9 years ️ Love you Tati ",
        "I do not prefer short videos, I want to put something I like on and sit back and relax with, also short videos you ave to concentrate the whole thing or you miss it.",
        "I’ve been here for a very very long time I don’t know if it’s been all 12 years because I don’t know how to tell but way back to long before James and a lot of purple and wet and wild! I have to many favs to count but I am loving the more homey content! Vlogs if you will! I also love a good dupes and just the tips oh tip Tuesday! I love it all!",
        "I’ve been here since 2013, I just can’t believe it’s been almost 10 years since I’ve been watching you! My favorite videos have been you creating your palette and presenting it to us, just because a lot of us were anxiously waiting for our fav YouTuber to drop her very own line. I had the high hope it would not be a quick cash grab and it would be very high quality and boy you did NOT disappoint!! I have not found to the day a better shadow palette, just because I felt like I was truly part of it. Like you waiting to do something of quality for your subscribers! ",
        "Congrats on 12 years! ",
        "I’ve been here since 2014 and I was in HS now I’m 26 It’s so crazy because this is why I first subscribed to your channel. You are so real and honest, beautiful inside and out, funny and energetic! You’re like a breath of fresh air!  Every time I would come on YouTube if I was having a bad day your videos made me forget all about it. I definitely loved full day wear test videos! helped me so much with picking the best of the best. Before I bought a product I ran to your channel to see what your honest opinion was on it. Love you Tati and I love the idea of going live, watching a movie together, doing a get ready with me, shopping together sounds all great to me! Definitely want to see a video or two, once a week like maybe a live + a video ! Xoxo happy 12 years ",
        "your are the only beauty channel i watch anymore.",
        "Love watching your channel!! Been here for a couple of years already!! And honestly enjoy it all!",
        "New make up how to’s for different face shapes. I swear I can’t contour a round face so I just try to bronze ",
        "Hi! I love the full day wear tests",
        "I've been watching your videos since i was 12 years old, for over 10 years, and I'm so happy that you were my introduction to makeup. You are an amazing person tati, i hope to meet you one day. You've influenced me so much tati, your videos helped me through some of darkest times, and I'm so happy for you ️",
        "Love you Tati!  I'm so glad you didn't leave YouTube permanently, I'm so happy you came back. I really love watching your videos. It's so relaxing. You have a lovely personality. Always be you \nThere has been some really funny videos you have made   you are awesome xxx",
        "Congrats on 12 years Tati! Would love to know your opinion on new products for video ideas! (Like the viral Danessa Myras cream-to-powder foundation)",
        "Girl you scared me with that montage!  Thought you were signing off for good!!!",
        "Happy 12th anniversary to us, Tati! ",
        "Honestly, I think the idea of a podcast sounds great. Makeup related, business related, pop culture, family related. It's different and might bring in a new following as well.",
        "Cried watching this...been through so much with Tati",
        "I’ve followed you for years. I LOVE watching you do makeup. I also LOVE LOVE LOVE your more vlog style videos!! ",
        "Tati you are my favorite because you genuinely love the makeup. Its like sitting down with a friend. I feel like a lot of content is rushed or forced these days, but I can always count on you for the real old school makeup videos where you are covered in swatches and just playing in the makeup and having a good time. I truly appreciate that about you and the content you create ♡",
        "More content about hair, diet, lifestyle videos.  Love your sisters too!",
        "I don’t remember when I started to watch your videos. Probably 8-9 years ago.\nI am glad you came back . \nI like reviews, makeup collection, videos about brands. Makeup organization. \nAnd may be you can try something new like perfume reviews?  ",
        "I've been watching since before you and James got married, been a ride or die ever since ️ I have always loved your style of videos and the length is perfect! Your one of the only \"OG's\" that still make videos and didn't leave it behind for something else... part of the reason why I watch all your videos is your personality, thoughts, opinions and humor! Yes, you kill at makeup and I trust anything you say about a product (TATI APPROVED) but you are also an amazing, grounded, self assured woman and we need that! I stan and I only hope that more people see that",
        "Vlogs!!!!!",
        "I only started watching your videos 5-6 years ago but I feel like I’ve been here forever. Your montage brought tears to my eyes because I thought you were leaving us for good, thank you for not only staying but for giving us more content!\nI would love to see your WTF series come back! Also I love following you along when you shop at Sephora/drug stores ",
        "Would love any content you create  I’ve been watching since 2015 and am so happy you’ve come back to the platform. Your soothing voice and sweet and playful personality would make excellent podcast material too! Love you always, Tati! ",
        "I love watching your videos no matter what they are about but since you wanna know what more we would like to see, i would love to watch home decor videos from you! Your sense in that department is so good and i would love to see how you decorate your new home",
        "I have been watching since the very beginning! I remember your tutorials in your bedroom! I have always loved watching you, so informative and relaxing. Almost like your my close friend  love you Tati",
        "Happy 12th Beautyversary! I'm excited to see what the future holds for you ",
        "You go girl  you’re a survivor.",
        "Crying at this intro because I’ve literally grown up watching you 🥹 I was 10 when I first started watching!! I didn’t even have an account but would look you up all of the time. Totally shaped my love for makeup and you’ve always been someone I look up to   I can’t believe it’s been 12 years!",
        "Omg I thought you were quitting! Out of the entire beauty community, your videos are the only ones that I watch and have had kept watching for several years now. You were the person that taught me how to do make up all throughout high school and college. I would really hope to see a podcast from you soon. That would be amazing!",
        "WTF was my faveeee BRING HER BACK she was that girllll !! But also a live would be fun",
        "I really miss the Madness Monday's....",
        "That's so cool how I have been watching you for 10+ years. Thank you so much for being transparent and open with your life for so many years.",
        "I love the personal stories and insights. Single mom of 4 here, make up rarely happens lol . But I have learned a lot about make up by watching your videos.",
        "Thank you so much for not leaving the YouTube community. I didn’t start watching any beauty type videos until 2019 but you are one of the first I found and subscribed to and I have always loved all of your content. My favorites are your most recent couple of years where you seem to be so incredibly humbled and appreciative. Your insight on life is beautiful as are you a person inside and out! No matter what you decide to post, I’ll be here watching. ",
        "For me it was when fleur was on your channel. Xx",
        "I've been here for 5 ish years and you are the only GURU I watch and it is genuinely off of the vibe and comfort I get from watching your videos almost feels like we are actually family. I would love live but honestly anything you are comfortable with. my favorite videos are the 24 hour wear tests !",
        "Tati thank you for being my comfort channel when i needed it the most.. you taught me everything i know when it comes to makeup… you are my makeup mom ️ ily",
        "I was tearing up thinking you were leaving. You’re the entire reason I’m completely obsessed with makeup, why I’m taking the classes I am so I can go to college and start my own business. My dream is to end up on the shelves of Ulta. I watched the first video of yours 7 years ago, so not from the very beginning, but you and your videos kept me going. It’s weird how someone you don’t even know can be so important in your life. Anyway, glad you’re not leaving. My fav video is definitely the April fools one where you did the blue look. Or the one with Logan. Love you!! ",
        "Found you in 2014! I was a junior in high school trying to find good makeup!",
        "I used to get up and wait for 10am. Been watching for 7years. The weird products was one of my faves. Wtf was really good segment.",
        "I miss you filming going into the drugstores...your WTF series",
        "This made me so emotional. I grew up watching you. You were one of the only makeup artists on youtube where I could watch every second of your videos and always be inspired. Makeup is a stress reliever, a creative outlet and your videos always brought a sense of peace and comfort. Happy 12 years Tati! You deserve it all",
        "I'm not really sure how long I've been watching your videos, probably from 8 to 10 years and it has been like growing up with you, I'm from Mexico but I feel so close to you, like a friend, thank you for all of these years of making content. I love the way you review products and also test them, your gorgeous and such an inspiration",
        "Live chats could be so fun! Congrats on 12 years ",
        "Love your channel, I’ve been here since the beginning , I can’t believe it’s been 12 years. ",
        "Scot come out lot of stuff , bring him back to y u r channels",
        "Been here from the beginning!! I cried when I got your pallette for Christmas the year it came out. You sparked inspiration in so many.\n\nI loved all those structured videos - wtf, all day wear, ect. ",
        "I would love to see videos on makeup application and techniques but not on yourself but on other people with different shaped eyes, etc.",
        "Omg a tati podcast would be a blessing for my stress and anxiety! \n\nAlso I LOVED the WTF series and full day wear tests ️",
        "I've been in here for 8 years! I'm 23 now so yes you are my YouTube mama, I literally learned so much from you and Jackie Aina that I dared myself to go to a makeup contest on national TV and got 3rd place against 2 PROFESSIONAL makeup artists!",
        "More: Live QA, haul videos where you take us shopping with you, and detailed technique videos.\nFave videos are with Scott Barnes or your sisters!!",
        "Not a weekly request, but I hope you can give full detail on what happened to Tati Beauty. \nI’d love to see unique makeup products again. ",
        "I've watched you since the beginning tati!",
        "How nostalgic🥹🥹🫶🫶 love you from colombia ",
        "I have watched you since the beginning! I am a trauma nurse and you, Emily Noel and Kathleen Lights have gotten me through some intense, emotional, physically exhausting days! Thank you!",
        "I cried with this video especially when she said I want to let them know that everyone matter  we need more people like Tati",
        "SOOO glad I came across your videos again.  You are definitely one of the OG beauty creators that I have loved and followed for years.  I would love to see more vlog lifestyle videos mixed in with beauty.  Your healthier eating alternatives as well as cleaner, non toxic home and beauty choices",
        "Loved the wtf days. I haven’t been here from the very beginning, but def been a supporter for the past 7 of those years. I miss seeing the craziest most ridiculous products tested and reviewed.",
        "From a fellow Californian who also lived in Texas (now in Kansas), Lifestyle videos all the way!  We definitely experienced the big bugs of Texas! Keep doing you - nothing's wrong with continually evolving!",
        "Please don't go to Tiktok .. i refuse to give that app any attention.  And the Podcast world is so over saturated. We don't need more people on trends. We need more quality youtube videos. Please stay here.   more drugstore stuff would be more realistic in this day and age as less and less people can justify LaMer prices over CeraVe ...",
        "I still love full day wear tests, full face of one brand, monthly favorites, pr unboxing, etc.",
        "I’ve been watching for 12 years. I really missed you when you were gone and if I had to choose only one beauty person to watch, it will be you!",
        "Shop online together, live, and then try it...",
        "I have been with you about 10 years. I came to you as a teenager looking for makeup help, because my mom was always too busy working to teach me stuff like that. Today, I’m the person that women and girls in my life come to for makeup/hair advice. You’ve not only impacted me and taught me a love for makeup, helping my self-confidence in the process, but you have helped me bond with loved ones. Thank you for everything, Tati ",
        "I would love to see a “Back to Basics” series. I know you’ve done them before but an updated version would be great. You can teach us how to do makeup looks for special events. Weddings, Birthdays & Date nights. ",
        "I miss the old Youtube with the long video/reviews. I agree I can't deal with the shorts/Instagram/Tik-toks. I like the more in-depth videos discussing the pros/cons of products etc. The full day wear test videos would be great!",
        "I would love to hear your honest thoughts about life, struggles, current events even.. just hearing you talk honestly and candidly is so therapeutic and I relate to that so much. I’m currently going through the most beautiful spiritual journey where I genuinely feel like I’m strengthening my soul and making myself a stronger person and it seems you are too. I’d love to just hear your honest open dialogue about pretty much anything. I’ll be watching whatever you come up with.",
        "I love you lifestyle stuff!!   Vlogs",
        "Self care ,skin care, something on that line.",
        "Dupes, Amazon favorites, indi makeup reviews, speed reviews. As a professional makeup artist these types of videos are the most useful for me. I think I found your channel 10-11 years ago ",
        "I love videos with James! \nBut also any videos that are using your current collection in creative ways. I’m less interested in new new all the time.",
        "I love the idea f a live! Because of the time difference I wouldn’t be able to watch live but would def catch up on it! Xx",
        "I am from London and have been here since you used to hang out with Fleur deForce and obviously you did her wedding 9 years ago. I now don’t watch any YouTube videos anymore, except yours. For me your videos are comfort and I treat them as my self care time with a cup of tea and a cake when my two children (under 2) are napping at lunchtime. It’s like getting a hug and helps me recover for the second half of my day when the chaos starts again. Thank you for all you do for us - we are loyal and so invested in you. I personally love your sit down and chat videos where you just get ready. Always love it when James pops in too!",
        "I like that idea about community. I have been trying to figure out how to do that too.",
        "The videos with Scott Barnes, I watch non stop. They’re just everything",
        "I remember when I first started watching you Tati. You used to sit on your bed.  I never had an account to leave messages but I watched every video! And I miss those wtf videos and I miss all the hats you wore to the store ! You always have given your real opinion on products and that’s why I watch. You’re real. You keep it real even if you don’t like the product you say so.  I watch every single video (and I agree those tictoks and reels are terrible ",
        "Scott Barnes on your channel, doing your makeup, was an incredible video. I watched it several times, loving seeing your joy and his exquisite talent, was a pinnacle moment. Also, I'm never giving up my Tati Palette ",
        "How you make your videos  how you set Up your lights, choose your products, make mistakes etc",
        "I was 12 when I started watching your videos. I'm 24 now, a working makeup artist. Because of you. I love you ",
        "I would love videos of you updated favourites . One week do moisturizer, then lip products, then foundation… etc",
        "Personally I came it late, but I love the vlogging. Because especially now it definitely feels like when you vlog, you are your true self. But ultimately whatever your comfortable with ",
        "I got to know you 3 years ago during the 'drama time' but later on I started watching your content despite I don't wear makeup, but I'm a creative person like you. I'd like to see challenges on the third day of the week. They're fun and you've made some in the past",
        "SEPHORA SWEEP",
        "Vlogs girl! Would love that once a week!",
        "I only found your channel 5ish years ago and I am really so happy for you and glad you didn't give up. Happy anniversary Tati! And many more!",
        "I miss WTF series so much!",
        "One of the best videos I like is Scott Barnes being on and doing your makeup. I’d love to see what other makeup artist would do on you. What is there go to? And you doing others make up (mom, sisters).\nAll you videos are so informative and I’ve loved watching you the last 5/6 years",
        "Favourite videos were the og madness monday ones and when the store would get mad at you for filming. And when Fleur came to get Puka with you. \nYour wedding, James joining unboxings. I feel like I just grew with you and your content and will always be the biggest fan of your energy and soul. I’d watch you review paint drying for an hour over watching a TikTok. Personally not a fan of short videos, I’m far too lazy to go find another video to watch. ",
        "I found your channel 5 years ago when I was scrolling through YouTube suggested videos while I was taking my 30 minutes 2 times a day pumping breast milk at work for my newborn and subscribed immediately! I watched all of your new videos and almost all of your prior content at that point. I was so bummed you were gone in 2020. I missed your content so much and I’m SO glad you’re back and better than ever with James ",
        "I’d love to see more about TX. City tour. Or a 30 minute walk and talk around the area.",
        "I have been following since Mr Kate did your makeup room, more amazing YouTubers that sort of had a slump in views, which makes no sense to me!! I found you and have been hooked since. I’m going to be for the people for my new Bohbaby brand  such a great idea",
        "I miss the WTF’s!!!",
        "Hello Tati, \nGod is so good and has blessed you very much! So happy you will continue with your videos!\nI have been watching you for many years, and enjoyed your videos very much!\nI would love to see reviews with high end products, that I think would be very useful  to many before paying a high price in a product.",
        "Watching that reel... Makes me feel like i was a part of your journey too because i remember those videos... Love  ",
        "U are the first one I started watching on YouTube during Covid, I enjoyed very much and bought many products and learned how to use make up. I’m interested in skin care and  home design. I like the utube version",
        "I haven't  been here from the very start, but I started watching at 19, young and fresh when I was trying to be a pretty young woman in a business world. I'm now 27. I made 10 years in my military career in November, and for almost my entire career your videos have helped me decompress and learn how to feel beautiful in my own skin working in a still predominantly man's world and job. Thank you for the years of love and commitment and for teaching me how to do my makeup from work days to going out. I'm ready for many to come, no matter the content you feel creatively to produce. You are amazing!! Thank you!",
        "Love you Tati ️",
        "I love your life style vlogs",
        "Tati I have been with you for all 12 years!!! since i started college as a freshman. you posted your engagement video and James proposal. \n\nI watched your tip Tuesdays In front of your mirror closet and hot or not Thursdays. I went shopping during madness Mondays and busted out all my coupons as a broke college student to laughing so heartily during  Your ice bucket challenge. Watching your wedding planning Wednesday series to grieving with you and James after the loss of his dear friend. Celebrated with you when you got pooka and cheered you on seeing your wedding video.  I screamed for joy when you launched Halo and was so nerve wracked refreshing my webpage to get ahold of the beloved story palette. ",
        "I loved WTF and full day wear test! Love you Tati!!",
        "I'm 68, been watching for about 7-8 years. When I was working I did makeup almost every day, now I just wear it when I want to - which still is most days, TBH. I like the way makeup makes me feel, and since I have chronic illnesses, my husband tells me he knows when I feel bad because I wear more makeup! God bless, glad you left the west coast, get some southern in ya! Texas is not that far from Alabama, where I live, so stop by sometime!",
        "More vlogs about your daily life, or lives on Fridays would be so fun!!!",
        "I have been here since 2016 I guess ️ never missed a video since then  i miss the wtf series ️ love you tati",
        "my prefered ones are those with James, your love for each other make me feel so happy and they bring me down to earth…it's so easy to feel disconnected on the internet…but you, sweet Tati, always make me feel good and keep me grounded 🫶️️",
        "I have to say, I kinda freaked out thinking you were leaving YouTube again from the beginning throwbacks. I really enjoy watching you and James just doing normal everyday things. Your connection puts a smile on my face and we all love James! I always loved watching your WTF videos, they were so fun and a lot of the things you pulled was seriously WTF. We love you Tati!",
        "A live weekly would be really fun!",
        "I would love affordable skincare and makeup reviews",
        "You’ve been through so much, but seeing your smile in each video, it’s clear you genuinely love doing this and care about your viewers. Thanks for being a shining beacon of positivity on this platform ",
        "One a week live  and or podcast",
        "Tati, you’re still my go to when I need to know what’s good in makeup. Thank YOU for 12 years of out of this world content. ",
        "I loved the monday drugstore vlogs!",
        "You will forever be synonymous with my solo Paris trip in 2015. I was 25, I went on my first trip alone, and I wanted something to watch while doing my makeup in the mornings - and there was Tati! \nI love the fact that you don't plan on doing short form content. It can be hilarious, and I follow some short form creators, but I like to have a variety of videos in my subscription inbox. Some channels are breakfast content for me. Some are listen-only content. Others are while-I'm-getting-ready content. Others yet are evening-after-dinner content. It would be awful if there was only two minute videos getting uploaded. ",
        "Oh my goodness! I’ll watch anything you put out there. Love the WTF and the 24 hour wear tests. \nSo glad you aren’t going to make shorts.\nHappy Anniversary!",
        "Maybe you should bring more people on your show who maybe have a small business or a cause or something,  but just have a fun casual conversation and talk about their product or cause a little,  but don't make it all about that.  I would also love maybe some lifestyle videos.  I enjoy everything you create.",
        "I truly would love a combo of fun Tati reviewing what’s new and good and what look you’re wearing, ALONG WITH you giving a podcast style hearing what’s going on with you and your life and believes on what’s going on in the world, with Texas and your new life!",
        "More vlogs! Seeing you and James together is uplifting. Also I think lives could be fun to try!",
        "I want to see a video on: \n- Whats in my everyday purse\n-Nighttime Routine\n-your 5 min face",
        "I’ve been here since the beginning!!! I loved the content you put out",
        "I would absolutely adore a weekly live!! I love love love “hanging out” with you through your videos and I’ve been watching your channel for years and years because of it. So a chill hang out, go online shopping, watch a movie, or get ready together type of live on the weekend would be lovely",
        "I stopped watching you since the drama with everything. I even bought your eyeshadow palette when it first came out. I love you and I love this. Thank you for being one of the only YouTubers to try to bring it back to its roots. You are so beautiful and I can’t wait for this. ️",
        "WTF videos",
        "I would love more of anything but sprinkling lifestyle favorites is always a fav of mine. ",
        "The first time I saw your channel was video about reviewing essence makeup, I believe in hot or not video maybe in 2011  since then I love your all reviews makeup brand  from drugstore to luxury one, even though I live in small country in south east asia, Idkw I still believe your reviews, your not only talking about what's good or not, but thought me some knowledge behind makeup or how to use etc  please be with us forever ",
        "Interactive live sounds so nice!",
        "I'm here for the long haul too. I've been here for around 10 years! It's been so lovely to grow up myself seeing you grow up! \n\nI know you've had a very hard few years but it's so nice to see you come out the other side ",
        "I love the idea of weekly lives on Fridays, it would be the perfect way to wrap up the week! And I LOVE your longer videos!",
        "I've not been around for too long but I sure love you and James. You're the cutest couple with so much personality between you  Loved the few clips of your wedding!",
        "You should do a weekly live while you do your makeup in the morning and just chat with your audience :) Just low pressure, no fuss, relaxing chit chat",
        "Congrats Tati! During the time of COVID, I really felt a change in makeup trends and popular products that everyone used to use aren't so popular anymore. I would love to see you go back through categories like you previously have and show us what your top 10 ten of different products are.",
        "I would love to see more reviews on colorpop or other cheap but good quality makeup",
        "When you wrote XO’s Tati on the mirror I had tears. Wow. Beautiful video. I haven’t watched you from the very beginning but it’s been a long time. So grateful you came back  Full day wear tests  or more lifestyle/food/fashion!  Honestly I’ll watch anything and I know I’ll enjoy it.",
        "I love the shopping videos and I love full\nReviews and wear tests also love the PR hauls I’m not even sure how many years I’ve been watching you but it has been A long time!",
        "Tutorial",
        "I love the live idea as well as the wear test!",
        "Panic!!! Thought for sure you were leaving YouTube! Phew!!! What if: don’t even know if it’s possible, but we could somehow share what we do for a living, send you a pic of ourselves and you give advice on what type of makeup or routine we should do? For example: I’m a nurse that works 12-14 hour shifts (and I am 52). I need something quick in the early early mornings. I leave the house at 500am for work. I concentrate mostly on making my eye stand out because of the masks, of course using your volume 1 palette ",
        "I’m so thankful to see you back on YouTube! I’ve been watching you since 2015– and seen a lot of ups and downs for many creators in that time. \n\nI’m not a big fan of the shorts—I enjoy the long form videos—I loved your WTF videos, and your drugstore videos! I also love your deep dives on one brand! ",
        "I’ve been watching you for going on 8 years now. Love all your content and so glad you are still here doing what YOU love! Since you asked, I really enjoyed your natural product reviews and would enjoy seeing more.  Take care! XOXO",
        "I loved the full day wear tests! Seeing a kind of vlog of your life was my favorite of your videos. They just felt so intimate going through the whole day with Tati and what you do in your day to day. ️ you go Tati",
        "I subscribed in 2015. Your glam makeup style doesn’t match my minimalistic style, but I’ve always stuck around for you and your personality. You’re such a calming presence. The live idea with movies and shopping sounds amazing. It feels like everyone is doing a podcast these days and it honestly feels like people will look back like they did on daily vlogging and feel burnt out. It’s a lot of time. You’re typically very polished and put together - that’s part of your charm, so I honestly don’t know if long unedited content is for you. Editing such long content is a job and a half. I’m not the biggest podcast fan - I just don’t know what people talk about for such a long time. Lifestyle content would be amazing! Cooking, organizing, shopping, movies, books, home decor, etc. It also helps us get to know you better. Jessica Braun is a great example of someone with a great personality who reviews  makeup, just not all the time. Makeup is great, but there’s so much content out there on technique and most of us already have too much makeup. The WTF series would be fun, too. You always put so much effort into finding interesting thing to try out. Again, it could be makeup or a mix. At least with this you wouldn’t be reviewing the same thing as 1,000 other people. Whatever you decide to do, even if it’s a podcast, I’ll still watch!",
        "Fashion stuff like the expensive bags etc you regret , love u! you inspire us all",
        "I think a podcast would be so fun! But, I think it would be better to put it on a separate channel. As a viewer/listener, I think that would make it easier to keep track of episodes (especially with the current mess on the Subscriptions page). I'd LOVE to see some livestreams on this channel instead!",
        "Hi Tati, back to basics for sure, but I love love love your vlogs! And videos don’t need to be over 20 minutes. You have so much makeup knowledge and life experience to share with us. Looking forward to your new videos. ️",
        "I’ve watched you since the Makeup Graveyard days and I’m still tuning in  Your kindness, resilience and commitment to your viewers are only a few of the reasons why…here’s to all that you have to offer in the years ahead ",
        "I love tips and tricks, I love when you have James on, I love when do reviews and new make reviews, I love hearing about your life and your walk with the lord. I love you before you left and even more now. I learned how to apply makeup from you. I grew up not allowed to even wear or how to apply it. You taught me. I am sure there are others out there you can teach like me. I just want to say thank you so much. Lives would be good just not all the time. I was so happy when you came back. I am not perfect at makeup but you taught there is no wrong way just keep practicing and because of you I have gotten better.",
        "Im not into short videos either",
        "i'd love to see you talk about ingredients in products and getting more sciency! i feel like u have a loooot of knowledge on this topic xoxo",
        "I like vlogs including cooking",
        "Was hoping for a palette release since I wasn't able to get the original",
        "Podcast but interviews",
        "From day one baby!!",
        "I’ve been here all 12 years, you were one of the first Beauty Gurus and YouTubers in my childhood. You, Nikitutorials, Game theory/Matt Pat and Stephanie, The Oddsones out, Nerdy numiies/Rosana pansino, Jaidden animations were some of the people that shaped me growing up. Thank you for everything",
        "I would watch anything.I like your daily routines too.️️",
        "I want to see all the good stuff. Full face of _ , all day wear test, product reviews, products you love, products you don't love",
        "I say pod cast! Your voice is so relaxing to me. Honestly the majority of my time “watching” is actually just listening lol",
        "I wish I knew you twelve years ago! But I have been watching for 9 years! Love you Tati, I have always watched your content. I love live shopping online or blogging with James! Friday’s! Love to you! ",
        "I've whatched you for about 7 years, my favourite was vids when your family members participated",
        "Love you tati i still have my tati pallet, years later and it's still perfect (maybe expired but i can't let it go)",
        "Started watching nearly 8yrs ago and it was your wear test reviews that I loved. Like a proper deep dive into the performance of the product. No one was doing that. Also love your full try ons when you tested all colours from the range etc",
        "Been watching for the longest time. I remember recommending your channel to a few people. Watching you grow really made me happy. You’re iconic",
        "Love when you vlog! ",
        "I have been here from the beginning. I have been here for the ups and the downs for the good and for the bad. I am so grateful you are back. You are one of those YouTubers I sit back and watch when I need a break from reality. I am mostly bed bound and I suffer from major depressive disorder and anxiety. I don't get to play with makeup as I used to. My love affair with it has not died down however. I can't even begin to tell you the emotion. I felt when I got the notification that you posted a video. When you came back. I felt a warmth come over me from the top of my head to the tips of my toes. I was almost frozen and then able to move because I could not believe my eyes. I really thought my eyes were tricking me. Thank you for coming back. You are one of my tools in my toolbox for fighting my depression and my anxiety. A live once a week would be so utterly fantastic. I would really enjoy that. I do not have a preferred time because I don't work. Going to pretty much just lay in bed morning, noon and night. So I am ready for that. That is my vote ! Keep being you ",
        "Would love to see more of your dedicated videos, could never get enough of those!",
        "Hi Tati!!! This is so sweet, I would love a live on Fridays! Also product reviews are my favorite videos to watch, and of course whenever you film with james",
        "I’d love to see different eye looks using your palette. I also love your wear tests and product reviews.",
        "More videos on your makeup techniques and “how” YOU do what you do please!!! ️",
        "Any happy videos you made with James really makes me smile️️",
        "Please do a video on best of the best concealers!",
        "Vlogs!!! I love your vlogs! I love you and your channel but I'm just not that into makeup videos anymore, but that's just me, I pretty much only watch vlogs now ️",
        "I started watching madness monday videos and have been watching since!",
        "Congratulations on 12 years Tati <3",
        "I don’t think I’ve been here for all 12 years, but I have been a fan for at least 10 of your 12 years on YouTube and I’ve enjoyed it every step of the way ",
        "Your one brand videos where you explored one brand, be it drugstore or luxury, exploring the best of that brand and telling us where to save our money was such a favourite series of mine, and it really helped my Mua kit back in the day too ",
        "I love this! I love that you’re reaching out and asking everyone what they think and I’ve been a long time viewer of yours and I absolutely love WTF videos and I love the idea of going, live and having a community chat!",
        "Address skin changes from aging products to lines and wrinkles. Weather changes skin dryness keeping up our face canvas makes the art of makeup different as well. I turned 54 this year and have so many questions no one else is talking about.",
        "Tutorials",
        "I love the single product reviews.",
        "I have loved watching you through the years. I found your channel in 2016 and fell in love. I always call you my makeup mama, because even through a computer screen you just seem so caring and genuine like you are right in the room with us. I am so glad you are continuing to stick to YouTube considering other people in your situation may just quit when they find views dropping, but not you and we will always be here to watch and cheer you on! This may sound weird but I have always loved your sense of style in home decor and would love a live of shopping for your home decor items, but of course anything makeup related is always appreciated! Please bring back Hot or Not and WTF, best series ever!!! Again, thank you for always being here with a smile and not leaving YouTube forever. It was very unfortunate that you got dragged into the toxic beauty community drama but you handled it with grace. You managed to be in the community for over 10 years without being involved in the drama, as most beauty YouTube creators literally get caught up in the drama in the first year. I am glad you are still here and am looking forward to the beauty community being loving and drama free once again",
        "I love the idea of a live! Or just the soothing \"get ready with me\" because every Monday and Thursday I watch your videos as I put on my makeup and literally get ready with you. It feels like there is a friend nearby. ♡ We love hearing stories about your youth, your life, and your family. ",
        "I have been a subscriber for many years and love your makeup content the most their so awesome  I have learned about so many makeup products I have bought because you reviewed them and I feel in love with and some I repurchased. My favorite video of your is apart of a series I wish you would bring back it’s where you showed deal from cvs and Walgreens , rite aid , Target and Walmart the sales and coupons of the week and then reviewed all the makeup. I hope you and James, Puka have a Very Happy Thanksgiving ",
        "So happy for that milestone of yours! We will be here for the next 12 and more ️",
        "Thank you for always being raw and real with us. You'll never know how much you've helped me and others. As a trans woman you've taught me do much more about womanhood than just make up. Seeing you get married, seeing you grow as a business woman and even just growing as a woman.",
        "Congrats on 12 years!!! I have really enjoyed your vlogging and living vicariously hoping to get to Texas myself. Could you ever do a dupe for your palette? I bought one for my mom for Christmas and was going to get one for myself as soon as I had the money but then it was announced it was going away for good. I was so sad I missed out. I've always loved your collabs no matter who they were with. Hoping for many great years ahead!",
        "You've grown in such good ways. I've been here at least 6 years, probably longer. I've cried and laughed with you, felt angry for you, proud of you for your success and missed you while you weren't filming. You're like a sister. You are such a real, genuine person and that's why so many can truly feel connected to you.  I love all your content so whatever you choose to do I'll watch. My favorite are tutorials and WTF too. We love you  Thank you for giving us 12 years!",
        "I’ve been watching you for so long…I don’t remember when I started watching but I remember meeting you at the galleria in Houston with Birchbox in 2015. Your content has always been amazing but it’s you as a person that has made we loved watching for so long. Rooting for you always! ",
        "I love podcasts!! Live videos and made invite your fans to say hi it will fun",
        "Been here since the beginning, so happy for all your success ",
        "All day wear testing with life vlog mixed in are great to watch. \n\nCongratulations on 12 years. ",
        "I would love to see more of your home decorating content to see how your home styling has changed and themes you're into right now! Also your fashion has always been beautiful and I'd watch more content with it too! I been following your videos for 7 years now and I'm so glad you were able to comeback after your break! I definitely missed your videos!",
        "Happy 12 Years  we’ll watch anything!",
        "I love your “everything I’ve tried from _ brand” or anti haul videos, would love to see a hair and skin care routine :) love you Tati!! XO",
        "I’ve been watching your videos for maybe the last five years and feel connected to you. You connect with your audience on a personal level because you are so personable and relatable and genuine. This is why we all love you",
        "I love the WTF videos ",
        "Genuinely been with you since the beginning! I remember being 10 years old, OBSESSED with makeup. And I loved your get ready with me for date night with the song “mermaids and poets”. I still listen to that song TO THIS DAY. And it always brings back fond memories. Thank you Tati ️",
        "I love the moments with your sisters! ",
        "I’ve been watching you since the LA days. Still have your palette. Thank you for everything you’ve done. You are one of the YouTubers I still watch.",
        "Lots of love all the way from Pakistan. Been a fan of yours for the past few years now and im so happy you didnt leave! I look forward to your content all week! Would love to see more of WTF! Always helps us find new wacky products.",
        "Crazy 12 years already!! You were the first YouTuber I watched while I was getting into makeup 10 years ago and it’s crazy to see your journey. You’re very inspirational! I am so glad I found your channel!",
        "I’ve been here since 2016  and your channel has always been my safe space. I love you, I support you and I admire you so much! I would love to listen to your podcast! I feel like you have so many things to educate us on and to talk about! That would be so good! I’m really happy that you came back to YouTube ! Congrats on your 12th year anniversary  xoxo",
        "Everyday in the life of??????",
        "I love all videos with \"Boobra\"......LOL. I've been watching since 2012!!",
        "I'd loved if you bring back WTF series.\n\nKisses  from Portugal!",
        "Wonderful video so amazing️ I found you maybe 6 years ago from a product  review i was looking for! I dont normally comment but you are a comfort show vibe for me and i love that️ your wedding video was amazing. I loved ur drugstore vs highend videos, top 10 or 5 in each category i would watch every video! Below price point videos. I used to work at Sephora but a drugstore lover so I love the comparison between the two. More recently the pr unboxings with james and his son were my faves. Love you gir happy to still have you 12 years later  xo",
        "Omg I seen the title and thought you were leaving!!  Thank god you’re not and Thank you for being the light for a lot of us. It’s crazy how fast the years have gone by. Lots of love!!",
        "I’ve been here for 9 of those 12 years! You’ve always been on the TOP of my watch list. I love you!",
        "The Tati beauty palette is still unmatched in my opinion ",
        "I’d love to see/ hear more of your health journey and help us explore more clean makeup and skincare.  I was sooo intrigued by the tallow skincare products you showed us and would love to hear more!",
        "I'm not crying.... it's just allergies.... 🥹",
        "It's crazy, that 2 years ago, most of her videos had around 1 million views. Now they are sitting under 500K. How consuming content has changed in 2 years is really saying something. \nI do scroll through reels etc. a lot myself. But if I need a full review or a step-by-step, those are not sufficient. They can be fun for sure. Johnny Ross is hilarious in his shorts. Maybe you two can do a colab?",
        "Bring back the WTF series please!!",
        "Please do a podcast!!!! I wish I could say I was here from the beginning, but I am about 5 years in and absolutely love you and your content!! Happy 12 years!!",
        "I miss the WTF videos whether it was weird or expensive products. I don't do makeup that often, but I do really enjoy your videos with products that I would either never buy or just don't have time to look into.",
        "I’ve been here all 12 years  it’s been amazing watching you grow into the woman you are now. ",
        "I started watching you about 10 years ago when I was 16. You were the first YouTuber I subscribed to and I still drop everything to watch your video. Please bring back WTF because they were always so entertaining . Lots of love to you, James and Puka x",
        "I would LOVE to see a \"skincare with tati\" type series or a video ️️\nChatting about ingredients, clean beauty and life. Unwinding at the end of the day, chill. I love your vibe and I trust your opinion not only on makeup ️!",
        "Dive into your health journey! Talk about the products you use  - shampoo, soaps, house cleaner, etc.  I have found myself on the same health journey as you and am so interested in what you’ve learned, started doing, etc., on your journey! I was so excited to find out that YOU use beef tallow!! I’ve been using tallow as a full body lotion for almost a year now, and I now consider it a part of our first-aid kit for skin injuries! When you mentioned you use a drip coffee pot, I bought one immediately and have used it since! I’m so intrigued and would love to hear more about what you know!",
        "It has been so crazy! YT has changed so much. The community has been declining. I miss the full day wear test, one brand, drug stores weekly ads, and videos of you and James...",
        "I love your vlogs. Casually showing us your day but some skincare and makeup elements would be so interesting to watch!",
        "Beautiful journey. We love you ",
        "People like your channel because you keep it real. A more natural approach. A role model for anyone interested in beauty, regardless of age. From drug store makeup to high end. No gimmicks. No craziness. Stay with the basics. You don't need all the other forums. People relate to you. Like family. Feel good approach. Love the unboxing with James. You give hope to those who may be going through the same issues. Puka updates. You have an audience that cares.",
        "Drugstore more please I am so poor! Lmao",
        "I have watched you for almost all those years and my makeup is so much better thanks to you. I love your chatty videos, I love James too. Whether it’s shopping for your home or whatever I don’t mind. Just glad you are doing well again. Thank you ",
        "Tati you are such a beautiful person, inside and out! Can't say I've been here since the beginning but I've been watching for many years and I've always loved your content! Keep doing what you're doing, can't wait to see what you come up with! Lots of love ️",
        "You’re a ray of sunshine, god bless!",
        "12 years later and you are still making our lives better ️ thank you for not leaving us",
        "The freaking Tati palette is my number one! Absolutely unmatched",
        "My partner just said to me \"is that Tati? Your still watching her?\" I was like YESSS OBVS ",
        "A Tati podcast would be everything! I don't know how long I've been watching your channel but when you left I was so sad. I'm thankful you started uploading again",
        "Can you bring back or do random couponing drugstore makeup?",
        "I would love if you once a week showed us how to do makeup with you and with your favourite makeup at that time. So we could follow and do our makeup at the same time and learn about the very best makeup ",
        "Interactive live yes, like a day with Tati, James, Puka, cooking. Decorating, fashion (shopping), travel etc.  Congratulations and wishing you many more years of YouTube success.",
        "I’m 35 , you and fleur were the ones that really got me into makeup 12 years ago. I still love watching your videos",
        "I'd say 3 days a week; 2 makeup, 1 vlog lifestyle/fashion !",
        "This is so beautiful! I’m so glad you’re back & staying ♡ My sister and I found you as pre-teen/teenagers 10-11 years ago & have followed you ever since - crazy to say you are the only YouTuber I’ve consistently watched all these years! Love the idea of a live shop with me on the weekends & to be able to connect more :) Lots of love, XO",
        "yes!!! i want a live vid each week!! just honestly want talk while you do whatever, cooking, cleaning, doing makeup, doesn’t matter just wna chat with you!! :)",
        "I love full-day wear tests! I feel like how makeup looks when one first puts it on is so different than how it can look hours later!",
        "I am only through the intro to this video and I literally have tears in my eyes I'm choking back the crying that I want to do for you because I am so happy and so impressed and so driven by your success.",
        "I was so scared that this was gonna be a goodbye video. Tati thank you for all of your hard work for the past 12 years. You're truly an inspiration to me. Sending all my love!!!",
        "Honestly, the stand out video for me is the one with Drew Barrymore. That was my favorite collab of all time! Overall, I just love your Ulta hauls testing out the makeup that would entice the average person ",
        "I would really like the wtf series back or more irl vlog style stuff",
        "I have been here since the beginning. You have been my escape. You were the first Channel I ever subscribed to. I used you watch your videos and they would and still do inspire me. You take away the shallowness of this industry and really do make the makeup industry about empowerment and being a strong women and having confidence. So Thank you.",
        "Your videos gave me confidence to try make up and to have with it. All that led me to have more love for myself and to not put so much pressure on myself to look a certain way. Thank you ️ \n\nI think a live and we all get ready together even if we aren’t going anywhere  & do a live, we all do our night time skin routine together ",
        "I love every videos you di Tati but i love PR unboxing with James and WTF series!!",
        "Hi Tati, I would like to see more of the science of beauty and makeup, ingredients etc. Talking more about clean sustainable beauty as that would be more interesting and knowledgeable.",
        "I love the product review tests!!",
        "Vlog and makeup",
        "Live would be fantastic! More Tati is great so what ever you decide I’m down for!",
        "Tati I would LOVE weekly lives! That would be so fun. ",
        "I was a madness monday girl from shopping in cvs and rite aid and walgreens and than the hauls in your bedroom what a simple time I would love a video like that back to basics",
        "I’m only a minute into this videos and I have literal goosebumps and tears because I didn’t realize I’ve been following you for 12 years!!!!! You’ve come SUCH a long way! Love you Tati",
        "I have never once commented on YouTube, but I just have I say congrats on 12 years I’ve been watching for 9 years and haven’t missed a video since. As a 4th grade teacher and new mom, your videos are time I get to spend on myself I fill my cup, and I can’t thank you enough for being the comfort to so many of us! Absolutely loved when you would bring you sisters on! How’s Taylor doing? You’re the one and only person I take makeup recommendations from! Enjoy your holidays and please don’t ever go anywhere",
        "I like the video with you doing your sisters makeup for her wedding.",
        "I found you while I was single and pregnant with my daughter. I immediately became close to you and evolved into a makeup lover without wearing it. Your presence meant so much and watching you grow as a person makes me emotional because I’ve also changed. My daughter is seven now and the obsession is still there, I LOVE YOU TATI!!",
        "I would love to see you teaching us techniques for all diff ages and skin types. I’m 57, so have “mature skin”. ️",
        "De mon point de vue français (et très lointain), les 24h wear tests forment ta meilleure série !",
        "You were the first beauty YouTuber I ever  watched.",
        "Life style would be fun. Here since the beginning.",
        "Madness Mondays!",
        "Okay but this video is making me so emotional",
        "I’d love to see the Wear Test series make a comeback! Congrats on 12 years🫶",
        "We love you Tati! been here since about 2014, so not a day 1, but you’re simply the best. Cheers to 12 years sweet lady!",
        "I don't know how long I've been watching but I loved Tati showing us her outfits when she was doing Style Code. I was also here when she mostly did purple eyeshadow. I love those days when people in the YT beauty community share their authentic self. The only beauty channels I still watch is Fleur De Force and Tati ",
        "Would love to see videos about the things you’ve learned on your journey and what you find useful to avoid, as you grow as your own person…",
        "I've been watching since almost the beginning. I love your passion for the beauty community and the dedication to us. ",
        "Ohh, Tati, I wanna watch too many things on your channel: new product reviews (esp foundations!), video blogs about your family and routine about the house. And the most wanted thing is to have a live streaming with you! Like Q&A...Just to chill and talk about whatever  from Russia with love!",
        "One of your most memorable videos for me was actually the one where it was just James. He explained that you were very sick and he was going to fill in and do a man favorites video. Not only was it soooooo sweet that he was filling in for you so you could have a sick day, it was also helpful to get a few things for my hubby that he might enjoy. ",
        "I  enjoy soooo much the wtf videos, along with the bad bin. \n I love so much your honesty when explaining why a product didn't work for you or was not what you expected. When I was younger it really upskilled me and help me to pick wisely \n So happy you came back Tati , you're one of the OGs of the beauty community... Luv u!",
        "I am so glad you are back on Youtube! I would love to see a weekly live stream or a Vlog. I love your video format.",
        "A day in a life… drag make up?",
        "WTFs were a favorite of mine.",
        "Vlogs ",
        "I discovered you when your WTF series started going viral and stuck around ever since. I watch you for you and will watch no matter what you put out. We are nearly the same age (1 year apart) and watching style, beauty and overall outlook on life evolve and mature is really relatable. Btw one of the funniest moment from your channel forever will be you blowing your eyelashes off with a hairdryer, I sometimes remember it and die laughing, that whole video is youtube gold. Continue being you, thank you for everything you've done <3",
        "I've been with you since 2011!",
        "Thank YOU for so many years!!! I've been here for 6+ of them (I'm 25 now, yikes) and will continue to watch every video, forever and ever. I myself have grown up so much in that time and been through so many of my own huge moments while watching your videos. It's wild to look back and reflect and it's super important to celebrate these major milestones. You should be so proud of everything you've achieved. Happy 12 year Anniversary!!",
        "Would love a podcast series ",
        "Wtf series, 24-hour wear tests, and dupe videos! I've watched you for years. You're a kind soul, and I've learned so much from your videos. Cheers to many more!!!",
        "I truly miss WTFs but either you are amazing and I love all of them.",
        "More of your new lifestyle in regards to your diet ",
        "Would love a live on fridays!",
        "I really enjoyed reviews, often before buying I came to you",
        "Still one of my top fav beauty YouTuber to watch tho I don’t use make much anymore.",
        "I’m here for I would say more than 10 years. I loved loved loved your channel from the moment I found it. You are so talented. Here’s to another 12..24..36 years",
        "Girl! I have a 13 year old daughter and you got me through so many of those first years of her life. She knows Tati like we’re real friends. lol We have been with you from the very beginning!",
        "Tati, Ive been following you since 2014. Ive been with you through all the ups and downs. Love you, girl. Ive come to your YouTube channel many times for makeup advice, and you always change my day. Thank You.",
        "Thank you for staying and still making videos even though Youtube has changed and views for people in the beauty community aren’t the same ️ there are still soooo many people that love your videos and get excited every time you upload! Thank you thank you for staying for us! ️",
        "I’ve been with you for sooooooo long.  I would say the makeup grind has died from what it was a cpl years ago, but have seen a lot of my favs testing top hacks, recipes, other youtubers stuff.  Rachel loves life is killing it with her videos and I think she had taken a smart turn",
        "Vlogs!! Happy that you have started that!",
        "Tati!!! You were the first YouTuber I ever subscribed to  back in 2016 when I had just started college!",
        "Yes Tati! A live video would be so much fun! I loved the WTF videos and PR videos. But I love the thought of live sessions! ",
        "Empty products, Amazon favorites, best and worst makeup, wtf, full face using only one brand…",
        "Oh please do more collabs or life blogs.",
        "I would love to get some inspirationvideoes on how to use your palette, because I think alot of us are still using it",
        "I would love to see more features exploring clean and indie brands. Would love to see you help new brands and clean brands get more explosive. As a woman in her forties, I love the recommendations for more mature skin.",
        "I personally enjoying seeing the \"real life\" moments. Maybe not quite like a vlog video a little more \"life style\" videos. It feels personal and less like sitting in a studio holding up a product and testing it. I would also love to see how to accessories different makeup look...like what type of makeup or colors go with jewelry, hair styles and outfits. Sometimes I get inspired by an a color in an outfit and it ends up looking too \"matchy-matchy\" and the head to toe look blends too much together. You always have a great sense of style and you coordinate in a such a way that things compliment.",
        "I started watching in the beginning of 2016. I loved the wtf because thing I would never be able to buy I still got to see.  Gratz!!",
        "I’m 35, and finding some of my OG makeup techniques aren’t quite as effective as they used to be. I would love to see videos of how to do makeup as we… gain wisdom . LOVE what you do! Thank you for your hard work, dedication, and passion. And above all, thank you for your willingness to share with us!",
        "One of my favorite episode was when you had James’ son dress up as your “ghost” I loved it because not only was it funny, but my son (7/8 at the time) was watching with me and asked me to replay the video so many times. It was a fun mommy and son moment for me and I thought you would like to hear how you were part of one of those moments.",
        "when I was in high school I really struggled with anxiety and I used to come home everyday and watch a Tati video because you always calmed me down and you were such a big part of my well-being! Thank you for always being a voice of positivity in my life ️️️",
        "I would love you to be LIVE once i week  and it could be different everytime depending on the demand. One week it could be tips on makeup, the other week, life chat. There's a lot of people would live that approach  Well i know from my part i would love to see Tati LIVE ",
        "Thanks for still being here my how times flys! ️",
        "I love the unboxings w James.  Soo good.  I like the WTFs and I love the calabs that you have done.  ️. I'm glad that you are still in this space.",
        "definitely lives. once a week?",
        "1 Vid of make-up reviews\n1 Vid of day out with tati\n1 Vid of live get ready w/ tati (clothes,hair,makeup) ",
        "I'm so glad I found you on YouTube when I started really getting passionate about skincare then shortly after,  make up. You are one of the few beauty influencers I watch that are younger. You are just gorgeous and love your GRWM makeup tutorials. I would love to see a video of your favorite lip combos especially nudes. I think your lip colors are always gorgeous! Congrats on your successful career!",
        "Vlog",
        "I would love to see wtf?! Shopping hauls and full face of clean make up! Thanksss",
        "If you're bringing stuff back I loved the WTF videos!",
        "Hi Tati I love your videos, when you take us along whit you, when you teach us how to and talk about cheap go great makeup. Personally I would like skincare a bit more. I’m from Norway and don’t have access to all the brands you talk about, and would LOVE if you could check out European brands also? Like Lumene from Finland has so many great products I think, and hope you could make a video about that brand ",
        "No to the Lives or Podcasts, more Vlogs! In my opinion ",
        "What about  collaborations/consultations with subscribers? Even if it’s just through zoom? Kind of podcast style interview, kind of personal style/advice  session…?",
        "I want them all!! lol wtf videos were amazing.",
        "I have been watching you since end of 2015 or start of 2016 (the date I'm not sure of) when we moved to Dubai to live with my father as a whole family that i wanted so badly and had the best 2 to 3 years of my life and i remember i would use baba's laptop that we all shared and discovered the life of YouTube and Youtubers and knowing that i don't know anything about makeup and would not do any makeup as i was not interested in doing makeup but loved watching u and also we (me,my mama and 2 sisters)shared what my mama had already so i loved watching u every single day that u become part of my life. I still don't have my own makeup but i do   know what will i buy when i will have my own money because of you so THANK YOU for sharing your life moments with us as they were not only yours but ours too. ",
        "If you’re still friends with Scott Barnes I’d love to see you guys play with his new products together! The combination of both of your tips and tricks has really shaped how I do my makeup",
        "Been watching you from day one! From Bulgaria . I really love when you make full day wear tests, opening PR and decluterring ",
        "Congratulations on 12 years! I love your videos!!!",
        "I don’t know how long I’ve watched you but I know it’s been years!! I started following since you started off as couponing channel “rite aid, rite aid” lol, still remember that song and those little fury animal hats with those long sides haha whatever their called. But I’m glad you’re back!! You have been missed!! ",
        "Please bring the WTF series back! It was so much fun",
        "Please bring back madness mondays, where you go to the drugstore and shop for the best make up deals. That was my favorite segment!",
        "Been with you from the startSooo happy you came back",
        "I was lost without you.  I am so happy you are back.  Still working on perfecting everything makeup and skin.  thank you Tati.  LOVEYOU!",
        "Loving on your existing makeup/shop your stash!",
        "Available and affordable makeup tutorials will ALWAYS be IN, layed back chit chat playing with makeup DEFINITELY not just new stuff , (not always having to buy more more more to keep up), but going back to what I'd say the majority of us already have from Walmart.  And same with skincare to go along with it. ",
        "I've been with you since pretty much the beginning, and I definitely would love more tutorials. I think YouTube shifted from tutorials to reviews a few years ago, and I kind of miss the old school tutorials.",
        "Been here for 7 years! Love u Tati",
        "Tati, I watch you for 4 years now and I was so sad when you left and so glad that you’re back and grateful this is not a goodbye video! What a relief! Never leave us again ️   wishing you always the best ",
        "Ive been following you ever since.",
        "PLEASE BRING BACK WTF SERIES!!!!!",
        "Hi Tati, I like vlogs and I also liked seeing what you had in your wish list to purchase and then the review of the product once it came in after you purchased it.",
        "I think a live could be really fun!!!",
        "I LOVE long form content. I love it. And I love watching long videos on YouTube where it feels like we’re getting ready together, or relaxing together. That’s what this platform is for me—it’s a companion when I need it",
        "Madness Monday!!!",
        "Thank you so much for your videos! I’d love to see WTF videos! Or a podcast would be iconic!",
        "This was so emotional  I’ve been watching your videos for ever…. I’m glad you’re back, stronger than ever and I think you should make in depth videos about makeup and techniques (u have too much experience for 2 min video ). I would like to see you doing makeup on different models. Thank you!",
        "I’m just so glad you’re back too!!!  thank you for all that you do Tati and James!! I’m so thankful for you guys!",
        "Wtf!!  Series was the best.  I also loved more on the go videos.  All day wear tests!! ",
        "I love WTF and GRWM, also tips & tricks and product reviews. Thank you for being here, Tati!",
        "Tati congrats from a faithful subscriber… been watching you from the very beginning, please do tutorials again , we have learned so much from you! \nYour wedding videos!! ",
        "Congrats Tati on 12 years! I love all the content you put out. I would love if you had videos that broke down make up techniques. I know you've done it over the years, but just sharing your wisdom on what you've noticed has worked best. I've done my make up for a while now, but still feel like I don't know enough to buy products that might help make my make up look elevated. Almost like teaching me the basics. Overall, whatever you put out I'll be happy. Thank you!",
        "Health and wellness.",
        "GO FULL PODCAST!!!",
        "Xoxo, Tati. Cheers to 12 more years",
        "Vlogs! Post one video each week, that was a wrap up of the past week. It's more personal, and takes your viewers along the ride of the life that you and James live. I personally love longer videos, and miss the old YouTube.",
        "Aging like a fine wine ",
        "more vlogs! maybe you cooking or different things?️and yes live videos so we can interact in real time ️",
        "I would love Day in the Life!!",
        "I haven’t been here all 12 years but I have been here since 2015! I love how much you’ve blossomed into such a strong and capable woman. You’re such a blessing in my life. ",
        "WTF was my favorite ️ bring this back",
        "I would love to see a Makeup techniques live with drug store products. That way we can real time learn how to apply certain things and figure out how we’re doing it wrong if we are. Been here for about 4 years and I still love the way you do your videos ",
        "Congrats! I think you can’t go wrong doing “get ready with me’s” while testing new makeup - it allows for keeping in touch while sharing our passion and excitement for makeup",
        "Super love if you incorporate current LIFESTYLE trends but in a long video version vs reel because i love hearing you talk!!! Not really into hauls anymore and prolly u wouldnt wanna hoard so much makeup too!  \n\nMaybe like a TREND or KEEP series? ",
        "I have been here all 12 years. Since I'm 43 but I live with the same kind of youthfulness, playfulness, vivaciousness and joy I appreciate seeing in you. So happy you are still here sister. Lives or more vloggy stuff would be great.",
        "I love the J.Lo makeup you did with Scott. Great education, true behind the scenes. Live chats would be fun.",
        "I still keep the Tati beauty palette. The glitter is amazing in it ",
        "I found your channel with the wtf series like many other followers, and that stayed my favorite series. My favorite video was the first unboxing with that funky presentation, it felt like you were having so much fun. From the editing, to the actual unboxing, your chemistry, everything felt fun and laid back. Congratulations on your 12 years on yt! ",
        "Tati love all your videos you would never come over to my page once but that’s OK. I thought you were leaving us. I’m glad you’re not love Crystal.",
        "If you could do skin care, anti aging products and devices and reviews of such would be awesome",
        "Start a discord!! Especially if you'd want to watch a movie and what not, that is a really great source to do so! <3",
        "Full live vedio & shopping about the make up products.",
        "We love you Tati! Thank you for being someone we can always count on being honest and truly passionate about what you recommend. You are an amazing human!",
        "15 seconds in and I’m already sobbing, I love you Tati, you’ve come so far ",
        "I LOVE your videos. Your voice is so soothing and peaceful I love listening to your videos while I sew, do house stuff; the longer the better.  The wear tests are great, so are the videos when you do cheaper dupes because I can't afford the super expensive products. I also love your vlogs and seeing what life is like in Texas. If you do a livestream , Fridays are good days, and yes to podcasts.  So happy you didn't quit YouTube!",
        "Was so scared that this was you letting us know you’re walking away from YouTube. SO glad that is not the case. So happy to see throughout everything that your love for makeup prevails. Sending so much love from Canada ",
        "I love your vlogs where it’s just you and James doing life together.",
        "Been here almost from the start. Found you when I was pregnant and my son is almost 11 now. Since then it has been you and coffee to start my day  So happy you came back! ️ Your voice calms my mind.",
        "Bring James more often with you and Taylor back. Also… I love 24h wear tests and all the best in drugstore make up!",
        "Everyday life vlogs",
        "Podcast? Yes!!!!",
        "Omg I used to love WTF’s! Would be awesome to bring those back!!! ",
        "I loved your WTF series back in the day. I would always watch those first. Also, your makeup advice and expertise is really helpful for those who don't have the time or money to check it all out. Now that prices are high and there's just so much good makeup out there, it's so helpful to hear from you on what's worth it and what's not. It's nice to feel like you have a trusted advisor on your side.",
        "Would love to see more lifestyle content!!",
        "Id love to listen to your podcasts.",
        "I’ve been here for so long! So grateful for you!",
        "Full day wear test please!!!!!!! over half of my collection is because of you and I loved those videos ️️️",
        "I’m obsessed with any of your celebrity makeup artist collab videos! And any popular makeup or clothing brand review videos!",
        "Wow, 12 years? What an accomplishment! I have been here from near the beginning. You had maybe a couple dozen videos uploaded when I found you. I was sad when the drama drove you away. But I was extremely excited to see you return. You'll always been one of my favorite beauty Youtubers! ",
        "I would absolutely LOVE to see wear tests and madness Mondays! ",
        "Congratulations on 12 years! \nI would say my personal favorites are the the vlogs. Just watching you and James go about your day. I also used to LOVE the WTF series! They were so fun and I definitely wouldn’t mind seeing some of those again!",
        "WTF yes that was awesome :D!",
        "Tati you have always remained a constant calm here on YouTube for me, and in my life.  You may not know it but we’ve been through so much together, I’ve watched you from the time I was a barista to the time I was working at a makeup counter, to now being a licensed nail technician and finding my own side of the beauty industry.  I have learned not only from but with you, I have laughed with you, I have cried with you.   I am so beyond thankful for everything you have done, and continue to do.  I will forever be thankful for you!",
        "i'm not crying, you're crying...     (<3 u Tati)    { edit:  i would loooooove a GRWM style 1st impressions eye shadow [and/or full face of] type of video.  nothing makes me YT Happier than that <3 }",
        "Alexandra Anele makes my favourite makeup videos right now, straight to the point, actually helpful, not “fad” type makeup tips! i’d love videos like this from you :) been watching you for 6 years ️",
        "I was so relieved when this was NOT a goodbye video. I have been here for the last 12 years and still get as excited as I did then!",
        "The Tati Beauty Palette is one of my favorites because the textures were diverse and colors were great it was my goto neutral palette for a long time.",
        "I love you so much I’d literally watch anything you put out",
        "More Lifestyle videos, home renovations. etc",
        "Tati is single handedly bring back the beauty community to life. Thank you Tati love you 🥹️",
        "Technique!\nSkincare reviews!",
        "Yessss! I'm an oldie subscriber! It sure has been a blessing seeing you grow and your journey. Thank you for sharing your experiences and knowledge with us. Most importantly for not giving up on us (YouTube)! We would surely miss ya. ",
        "Want to see more and more best and worst of new products try new stuff love those sort of videos",
        "I love full day wear tests! Congrats on 12 years Tati ️️",
        "I too went into a panic thinking you were leaving us!!!! I haven’t been here for 12 years but I’ve been here for more than half that. I love all your videos regardless of what they are. You’re positive and kind and caring and compassionate. It’s just nice to “spend time with you”  I’ve stopped watching beauty Channels over the last few years with exception to yours once you came back. You’re a beautiful person inside and out and your true fans/friends will be here regardless of what you upload.",
        "It might just be me but, I would love to see vlogs. I know this is a beauty channel but, I would love to see Tati do more than just beauty videos. I would love to see more of her life outside of makeup and would love to see vlogs",
        "I loved the WTF series!!! The contrast of you being so elegant and put together vs the absolute no shame in trying hilarious products is so inherently funny.",
        " ᑭᖇOᗰOᔕᗰ",
        "Doing crazy make up every once it a while ",
        "Long time watcher! I feel like we’ve matured together. I miss a lot of the drugstore finds and deals; there are SO many new drugstore brands now! I also love the lifestyle content! Cooking, shopping, decorating, etc.",
        "I loved the all day wear test or day in the life of Tati stuff. The testing weird products are neat even though I would never buy them. Also seriously thought you were telling us goodbye from YouTube... so happy you are not.\nThank you for being here, we love you. I've been watching for 5 or 6 years now, seriously watch every single video.",
        "You literally saved my life. I will watch you until your very last video or wherever or whatever you post on social media!",
        "I love the live/podcast idea. I watch another channel like that and it’s a lot of fun. Definitely a sense of community!",
        "Dear Tati, \n\nI have been with you since I was 14. Ten years later I am still here because of the amazing human being you are. You're the reason why I love makeup and I have evolved from just wearing powder to creating magic on my face thanks to your videos. You're my inspiration and I can't wait for what's in store for the future. ",
        "Still my favorite makeup guru on YT! Have tried your products and still in love. \nI would love to see more videos with James. And or videos about your overall health maintenance, because beauty comes within the inside right?",
        "Tati on a podcast?!?! I love that!!!",
        "I have always loved your artistry and your willingness to share how to either recreate or get inspiration from your ideas. I’d love for little tips and tricks about how you make your videos sprinkled in. You have shown your awareness of the set up all along and let us share in that as well. Pointers from someone that just does it all so well would be greatly appreciated (at least by me ) As far as revisiting ideas WTF have always been a fav, because sometimes the insanely priced products ARE good, and how would the average consumer know that? And, on a personal note, I love it when you just chat about a topic from the heart. Keep up your amazing work - here’s to another 12 years of enjoying being able to see you smile, empathize through tears, and share some time together.",
        "Pleeeeaaassslllleee! Bring back the tati pallet! I broke mine! It was my staple!!",
        "I am drown to your honesty, integrity, love and you are an example of the kind of woman I want to be! Thank you ",
        "I’ve been with you for about 10 years  I recognized so many of those backgrounds. What a journey! I wholeheartedly agree on creating more of a community. I think live streams would be exactly where to start with that. I also think creating member spaces would be awesome. Patreon or here on YouTube. I’d pay subscribe to you for exclusive content or member only lives. You know Tati - I actually found  Emily D Baker because of you. Which is kinda weird because it wasn’t for things going well in your life. But I went to that video back in Nov 2020 that she uploaded & discovered she was creating a community over there. A welcoming, caring, non judgmental space… she was so respectful toward you….and so I stay there. (And never left here). I think you have that same magic - just by being yourself and allowing us to engage with you in real time. Share stories, memories and things we have in common. I’ve been here for 10 years… I’m not going anywhere and can’t wait to see where we all go with you next.  ",
        "I want more tati",
        "Hey Tati! I’ve been watching you since High School. Now I’ve graduated college and I’m 4 years into my career.",
        "I love the simple daily life videos.  I could watch  2 hrs  of that.",
        "Awwwwwwww your such a classy wonderful lady ️ I adore you and your channel  Godspeed everyone ",
        "With you since the beginning. You get better and better each day. Grateful for you.",
        "I like your longer videos. I put them on and do my laundry, do my makeup, draw, design, etc. Because they are little longer I can just listen, enjoy and get through my task without flipping around so much. I guess I have a long attention span. Didn't have a cell until college. ",
        "Tati, been following for years! But never commented, you are the only make up channel I watch! Love your videos, two part question  have you tried and reviewed Jones Road Beauty and how do keep Puka’s eyes stained free? I hope he is doing so much better ",
        "I never wore makeup or knew anything about it until I was about 35. The first of your videos I watched was with you and Scott Barnes, and I was mesmerized! I love watching your videos as much for the information as I do for the community. I don't follow a ton of YouTubers, but I appreciate your candor when it comes to drug store vs high end makeup, which ones work well in spite of the price point and those that fall short. Declutters are always fun because you're really weighing similar products against each other which gives us insight into what you would buy again or that you find real value in. I would say the same goes for videos like this where you evaluate past purchases. A high end bag should last years, and for that reason, I agree that you should look for one that you can wear with anything! The same goes for jewelry. If you're going to spend the money on it, you need to be able to get your money's worth out of it! Thanks for sharing everything!!!",
        "My favorite videos of yours are still product reviews and best drugstore products. Best of lipstick. Best of concealers. Best in every category as new things keep coming out. Would also love to see more tutorials even of your hair lol your hair is iconic 🫶 my biggest wish is that you being back Tati beauty for sure though. That’s my Christmas wish this year lol.  ",
        "Lifestyle stuff, fashion, more makeup, vlogs of you and James, decor ideas, old school stuff like mile long CVS receipts and how to get cheap makeup, diet and exercise, hell read the phonebook. I will always watch every single video you post. I've watched you since 2015 and I consider you a friend! Love you Tati!! ",
        "There's so many good videos it's hard to pick....️It's been a long time and a lot of videos.️",
        "Tatiana hon, you are the beauty authority of YouTube. I will always 100% heed your reviews ",
        "I love your show an your make up products. I watch all your vedios. ️ You tati.",
        "Lives!! Do a LIVE! then slowly do a podcast. But I think a LIVE will be amazing! Don’t do it on weekends do it on a weekday evening",
        "Hi Tati! I’ve bee with you a while and tbh I dropped off on the makeup community but I will say that you have drawn me back in and I’m so glad to see you continuing. I really used to enjoy your series so I won’t mind if you bring some back",
        "I remember you mentioned about your exploration around piano music and some songs you had started to write in terms of spirituality and thriving after the storms in life which are more lessons and manners to help us see how stronger we truly are and that we never walk alone. Also it could be nice to maybe do vlogs in areas in Texas that you are liking or just visiting for the first time.",
        "Omg what an accomplishment for someone. Not just a YouTuber who is continuing to grow and deliver after all this time, but to put it bluntly, as a woman over 30 in an industry that's not kind to maturation (not that any industry really is but the beauty world especially)\nYou're someone I look up to and I'm so amazed at what you've accomplished. Can't wait to see the next 12 years!!",
        "Vlogging!",
        "I joined halfway, 6 years ago, and currently today you are only one left that I make sure that I don't miss a single video from. I hope you continue as it all is- we love you <3",
        "Please announce another Tati Beauty palette there’s nothing like that palette",
        "Weekly vlog! Or live.",
        "I just want to say Thank you Tati for allowing yourself to be vulnerable and to show who you really are on the internet. Im a 31 year old female and you have been my inspiration to FEEL beautiful for a long time now, over 6 years. You went through tragedy, loss, love. You lost yourself and found yourself time and time again, that alone helps me so much to realize that life isn't linear. You've taught me that i have to fight against what people WANT to give myself what i truly NEED. Thank you Tati for showing your life through a camera so a stranger, like me, can be confident in who we are and what we want to achieve despite our age. We are STRONG! and you gave me and so many others that feeling of being a strong independent person. Sending so much love and support to you and your fam alone with anyone else who needs it! <3 <3 <3",
        "Congratulations on 12 years Tati! I think I’ve been watching your videos for at least 8/9 years. You’re my absolute favorite beauty YouTuber! I understand your wanting to maybe keep things fresh, but honestly, don’t fix it if it’s not broken! Your videos are wonderful! I loved wtf, 24 hour test and ALLLL your make up and skin care reviews.  I appreciate the eyeshadow swatches, the potentially painful lipstick try ons, and your passion for makeup. Thank you for all you do! ",
        "Love you so much Tati! Thank you for always making my day a little warmer.",
        "I personally would love a once a week live sit down with you just doing our makeup and getting the best tips from you and having some laughs as well. We adore you so so much and thank you for devoting so much of your time to us. Thank you for all of it!",
        "VLOGSSSSSSS!!!!! Love youuuuuuu  so happy you came back!",
        "Vlogs! I love watching everyday lives, cleaning, cooking, getting ready. morning routines",
        "Been watching you since 2016 and you are the reason I blow money on makeup  I would appreciate if you can make In detail videos how to makeup",
        "Happy anniversary!!! \nI have been here since 2012. All of your videos have been so entertaining. I would like to watch anything you feel like is the least stressful and fun for you to make! I would t still be around if you weren’t entertaining. I would totally be down for a live video with a chat. That would be so much fun! Or even a home vlog! 🫶",
        "Here near the ending, I’m definitely down with you doing some lives! I fully enjoy your vlog type videos as well!",
        "Been with you for at least 10 years! Love the WTF series and overall hearing your voice. It’s so soothing ",
        "please do \"get ready to sleep\" routine after attending a glam event",
        "I have watched your videos about 1 year now and I’ve learned alot about beauty and products. I think a video with James is a good mix and you both are great together. Thanks for sharing.",
        "Bring back WTF series please.",
        "Lifestyle, health, cooking, diet. You've transformed your self in multiple areas and it would be nice to share knowledge and experience.  I know we are all unique but we still have common threads and it would be cool to share how to truly live our best lives.",
        "Tati you said it.. times are changing.. try tiktok people love you here and they’re going to love you there. And you don’t have to leave yt do long videos too because you’re amazing. But also try something new because you’ll create something new.. i love you ",
        "Do vlogs!",
        "Plz do weekly foundation wear test videos! I can never get enough of them! Been with u since the very beginning ️ love u and the journey",
        "Podcast ",
        "I loved the WTF series, finding new brands - indies and high end- I appreciated your input on the products! I found so many new fun makeup loves from your recommendations!",
        "Damn, I can’t believe it’s been 12 yrs. I learned to put on fake lashes from you. Damn 12 yrs, I am 46 now. 12 YEARS!!!!  I refuse to get IG/TT. I am glad you are still posting long form content. I still order your Halo regularly. Keep doing videos, makeup tutorials, live chat would be fun.",
        "Clean beauty, clothing hauls or home decor",
        "I think you should do some combined videos , and what makes you happy based on the products that cought you eye threw the week.",
        "I’ve been following you since I was 14 in 2014, when I got my first foundation I went through your videos to decide which one to get cuz your reviews have always been very in depth and thorough. The beauty community is definitely not the giant that it was but I’m glad you’re still posting and keeping it real",
        "I’ve missed WTF videos but I’d watch anything you put out honestly ! The podcast/live sounds pretty good too!",
        "Happy anniversary!!! I think I started watching around 2014/2015, I learnt so many things from you! One of my tip-Tuesdays tips that I start doing at this time of year is warming up my mascara before application... I put it under my boob whilst I do the rest of my make up ",
        "Bring James , and makeup or skin care  for man , you could make a episodes about it. I'm a guy and I'm watching you videos for many years all ready. Love you guys",
        "Yes Tati! I’ve been with you from the beggining, when you sat on a bed! ️ Forever you fan! \nI would like to see more videos with you and James, or your sisters, mother, James’s son. I loved WTF as well.",
        "YES!!!  Guilty I’ve been following you when you filmed in your room way way back before the lights!!",
        "Thank you foe transforming our makeup game and especially teaching us all your beauty secrets ",
        "Please do a series where you show us multiple looks with one palette (per episode). I’d love it if you started with your favorite ones first.",
        "Podcast Team, leave your mark here ️",
        "I fell in love with WTF but also a live sounds fun!!",
        "Would love,  makeup tutorials, and vlogs and both u and James",
        "Would love to see product reviews again from sephora and ulta. Non drug store reviews.",
        "I found you in 2014, so almost 10 years!!!!! You will always be my favorite beauty youtuber. I was working at South Center Nordy when you were in downtown! It's been surreal to follow your journey. The best part has been seeing you openly profess your love for God now, it's so beyond heart warming and encouraging.",
        "I’ve honestly been watching your videos since I was 16, barely getting into makeup! I have always resonated with your simple sit down videos. I would like to see maybe more videos with you and James, as those are my favorite! Maybe also bringing in celebrity makeup artists like Mario/Scott Barnes on your channel. I just love love you and your channel and THANK YOU FOR THE LAST 12 YEARS! HERES TO MANY MANY MORE!",
        "One video with beauty, makeup, and fashion and maybe one video that’s a vlog style.",
        "I remember being 18 or so and just learning makeup and wanting to buy the best i could with the little i had and then i found the madness monday videos and i was so hooked on those. I just can't believe that was 12 years ago. Your videos have always veen so great and positive and you send such a good energy out into the world. ️",
        "Hi Tati I remember the first time i came across a video of yours was how to clean a beauty blender  and ive been here ever since ",
        "Absolutely love your vlogs, and I’m a fan of the 24 hr wear videos. I remember finding your channel 10 years ago when I was deep in post-partum blues. I would watch your videos & they motivated me to pull myself together & reminded me that I was more than just a mom. I was a beautiful woman! ",
        "I loved your moving vlogs",
        "Love this video Tati, wow what a 12 years!!! I’m into your vlogs, love a WTF, and I’m definitely into a podcast series with you and some special guests maybe. Would definitely be into a live video, on a weekend would be fab for us working women. ",
        "Ohhh I also loved watching your skincare videos the crazy tools and daily skincare",
        "I love the vlogs, also the full face of new or favorites.",
        "I cried during the into because I thought we were saying goodbye to Tati again… ahh such a heart stopper!!",
        "YES TO THE LIVE IDEAD!! \nYou have so much knowledge in editing/business/ entrepreneurship I would love to se see those kind of conversation incorporated into GRWMs🫶",
        "I have been with you the whole journey ️",
        "️️",
        "I LOVED the WTF series!!",
        "Congrats Tati! You are one of my favorites and I was very happy when I saw you came back here ️ I’m also a proud owner of a tati beauty palette from Finland. \nNot loving the short videos too. My favorites from you are maybe the one brand videos or the Wtf ones. I also like to watch videos of your current favorites or the best 5/10 of something (for examble the best 10 mascaras) ",
        "You're still my favorite youtuber Tati!",
        "Love your channel. My vote for content would be tutorials- your artistry and skills are unmatched",
        "I can't believe I've feel following for close to 10 years!! I love this channel! Thank you Tati",
        "I’d say a daily vlog coz your life looks fabulous xxx",
        "I would love vlogs",
        "Tati beauty launch was the best moments !",
        "Wtf and empties are my favorites!",
        "Just taught of a good livestream idea, Tati's Kitchen. Think of it. We all get to learn new recipes together. Trying out new protein rich dishes or dishes packed with vegetables done in different ways."
    ],
    "comments_disabled": false
}