{"video_id": "IFchKNel1Xc", "comments": ["The Tati beauty palette is still unmatched in my opinion ", "I was so scared that this was gonna be a goodbye video. Tati thank you for all of your hard work for the past 12 years. You're truly an inspiration to me. Sending all my love!!!", "How can a person just get more and more beautiful as years go by! So happy for you Tati!!", "I have been watching your channel since I was 13 and owned nothing but claires makeup. I’m now 24 and doing my own makeup for my wedding in two weeks. You were one of the first makeup inspirations I ever had and I’m so proud to be a part of this community. ️ So much love for you and James.", "Your one brand videos where you explored one brand, be it drugstore or luxury, exploring the best of that brand and telling us where to save our money was such a favourite series of mine, and it really helped my Mua kit back in the day too ", "I found you while I was single and pregnant with my daughter. I immediately became close to you and evolved into a makeup lover without wearing it. Your presence meant so much and watching you grow as a person makes me emotional because I’ve also changed. My daughter is seven now and the obsession is still there, I LOVE YOU TATI!!", "I seriously almost had a minor panic attack thinking \"She's leaving me!\" Whew! Thanks for sticking around. Happy Anniversary and thank you for loving this community so much!", "I’m 35, and finding some of my OG makeup techniques aren’t quite as effective as they used to be. I would love to see videos of how to do makeup as we… gain wisdom . LOVE what you do! Thank you for your hard work, dedication, and passion. And above all, thank you for your willingness to share with us!", "I have never once commented on YouTube, but I just have I say congrats on 12 years I’ve been watching for 9 years and haven’t missed a video since. As a 4th grade teacher and new mom, your videos are time I get to spend on myself I fill my cup, and I can’t thank you enough for being the comfort to so many of us! Absolutely loved when you would bring you sisters on! How’s Taylor doing? You’re the one and only person I take makeup recommendations from! Enjoy your holidays and please don’t ever go anywhere", "I have been with you about 10 years. I came to you as a teenager looking for makeup help, because my mom was always too busy working to teach me stuff like that. Today, I’m the person that women and girls in my life come to for makeup/hair advice. You’ve not only impacted me and taught me a love for makeup, helping my self-confidence in the process, but you have helped me bond with loved ones. Thank you for everything, Tati ", "I've watched you for 6 years. You taught me how to blend my eyeshadow and for that I thank you", "I’ve been here all 12 years  it’s been amazing watching you grow into the woman you are now. ", "Maybe it's just me, but I love the videos with you and James. Going to the grocery store, I'll watch. Going makeup shopping, take us along.", "I love full-day wear tests! I feel like how makeup looks when one first puts it on is so different than how it can look hours later!", "Thank YOU for so many years!!! I've been here for 6+ of them (I'm 25 now, yikes) and will continue to watch every video, forever and ever. I myself have grown up so much in that time and been through so many of my own huge moments while watching your videos. It's wild to look back and reflect and it's super important to celebrate these major milestones. You should be so proud of everything you've achieved. Happy 12 year Anniversary!!", "Thank you for being the big sister I didn't know I needed for all of these years.   You've taught me so so much, you've been there when so many left.  I'm so grateful for your channel and the safe space you've created these last 12 years.  Love you Tati", "Congrats on 12 years! I’ve only been on YT about 7 years but have loved you since the day I found your channel! Personally I have a soft spot for “empties” videos. I love seeing what people love so much that they use up completely. We’re all game for whatever you bring to us! ", "I don't know how long I've been watching but I loved Tati showing us her outfits when she was doing Style Code. I was also here when she mostly did purple eyeshadow. I love those days when people in the YT beauty community share their authentic self. The only beauty channels I still watch is Fleur De Force and Tati ", "Short videos don’t feel nearly as personal as hearing you goof off, ramble and enjoy yourself playing with makeup or skincare. I love that you’re keeping these long videos and staying dedicated to your fans versus catering to the quick scroll through content. You’re one of my comfort YouTubers and I always look forward to the new video notifications. ", "I loved the WTF series!!! The contrast of you being so elegant and put together vs the absolute no shame in trying hilarious products is so inherently funny.", "I never thought I'd find a beauty and lifestyle youtuber who I would like so much but I've had several jobs since I graduated uni, watching this channel helped me destress through it all, and I've recommended to all my coworkers that they watch tati Tbh my fave videos of yours are the ones you shared with James and Taylor because I think the chemistry between you guys are so fun... I know I'll watch whatever else you come up with though just because I love the way you talk about things <3", "real story, I trust your recommendations so much that I bought my sister the MAC painterly paint pot because she was looking for a good eyeshadow base, when she asked why I chose it, I said becasue Tati likes it, she said: that's it? and I was like, yeah.. isn't that enough?", "12 years later and you are still making our lives better ️ thank you for not leaving us", "I found you when I was looking for someone in the beauty community who was my age who could teach me to do my makeup and I’ve been here ever since - 7 years on. You have always been one of the most honest, open and down to earth influencers and I’m forever grateful that you have replied to so many of my messages. You’re a queen and I’m so happy you’re still here. Xxxx", "the 24 hour wear tests where you would take us around your day were always so so fun i loved them", "I love jenluv’s Sunday live chats talking about anything going on in makeup like revlon going into administration or new trends in the beauty space. It’s really great to grab a coffee on a weekend morning and interact with a live conversation  Obviously James and pukka can make an appearance too", "I think learning is hard for everyone, but don't call it cringeworthy, focus on the skills you've gotten, how you've grown & who you've helped as we are learning too! I like a variety if instructional and real life videos.  Prayers for success in all you do!", "I would looooove to see you doing makeup on other people! Especially mature women! But really all kinds of women! I think that would be so cool!", "Been here almost from the start. Found you when I was pregnant and my son is almost 11 now. Since then it has been you and coffee to start my day  So happy you came back! ️ Your voice calms my mind.", "I too went into a panic thinking you were leaving us!!!! I haven’t been here for 12 years but I’ve been here for more than half that. I love all your videos regardless of what they are. You’re positive and kind and caring and compassionate. It’s just nice to “spend time with you”  I’ve stopped watching beauty Channels over the last few years with exception to yours once you came back. You’re a beautiful person inside and out and your true fans/friends will be here regardless of what you upload.", "I would LOVE to see a \"back to the basics\" series. Very simple, like how to do blush (how to pick the right color for your skin tone) or how to do eyeliner. Where does highlighter go, how to shape your eyebrows. Stuff like that! ", "I’m so glad I ordered the Tati palette when it was released. It is so easy to use and I just love it. If it’s from Tati it’s quality. We’re lucky to have you as an artist and creator.", "9 years or so! Started watching when I was going through a divorce. I was trying to find myself again, and makeup was so therapeutic for me in that way. I loved your content because it was more wholesome than some other creators. It was about the makeup and I really connected with that. I love seeing some of your lifestyle videos so that is always a good choice. Happy 12 years!", "I remember buying every drugstore recommendation you did and then apparently everyone starting doing that and your recommendations started selling out! And then you released your own products and I loved them!", "I don't even remember when I stumbled upon your channel... I know and feel like we have been in it together for a while now- seamlessly and effortlessly. Thank you staying with us <3", "12 years? Wow! Congratulations . I am happy you came back to YouTube- thank you. PR unboxing, following you on shopping trips(makeup, food, household etc) and even to the vet with Puka are some of my fav to watch. Just the feeling of like hanging out with a friend doing stuff like painting our nails, cooking/baking etc I’m here for that. Do not be unsettled by the tic toks and instagram, there are many of us who are looking forward to journeying with you right here on YouTube for many seasons to come ", "Please do a series where you show us multiple looks with one palette (per episode). I’d love it if you started with your favorite ones first.", "OMG I thought you were filming your last video and saying bye forever. First I want to thank you because with watching your videos for almost 10 years I've learned so much, from how to accept yourself for who you really are and to not care what the world thinks. Next, watch how you evolved and grown is awesome. I like how you have changed the content of your videos and in my opinion I liked the videos where you would go to drugstore and showed us how to save. With these times we are living in, a little bit of saving would help, not everyone can afford high end makeup and knowing you can get a deal is great. Hope Puka is getting better, Godbless", "Omg I love how much you’ve grown, even just from your most recent move. You’re such an inspiration and I love how you went from “selfish” to “selfless”. Your personal growth shows and I couldn’t be prouder of you. Keep going strong! Much love ", "I found you while pregnant with my daughter.  She is 11 now and loves watching you as much as I do.", "While I haven’t been around for all 12 years, I have been here for 6. I love your holiday guides, and your real life day to day videos are my favorite! Health, food, and family! I’m so grateful that your not leaving us ", "I’ve been around since around my senior year of high school in 2015. I cannot begin to explain how thankful I am for you and your videos. I feel like you have been with me through so many different phases of life. Senior year of high school, 4 years of college, 3 years of law school, getting married, taking the bar exam, getting my first attorney job - you were with me through it all. Your videos definitely have that connection you want with your viewers - I feel like we are besties!", "Available and affordable makeup tutorials will ALWAYS be IN, layed back chit chat playing with makeup DEFINITELY not just new stuff , (not always having to buy more more more to keep up), but going back to what I'd say the majority of us already have from Walmart.  And same with skincare to go along with it. ", "Your videos are the ones I keep going back to over and over. I have watched most of your videos uncountable times because your tips and recommendations are ones I trust the most. When you were gone I just kept goin back down your Playlist while getting ready for my day. Your energy is unmatched and we can really feel your compassion thru the camera. I'm here for long form content. It's more relaxed and relatable to be able to put on a video and learn and have laughs with you. I can't thank you enough for what you have taught me and not just with makeup but with life experience. You are a shining light here and wr are so grateful for you", "Been here for 9 years, and if I had the opportunity to feel like I'm sitting down with you while you do your makeup in real time that would be AMAZING. A livestream, even if it's not even every week, would be awesome!", "Tati thank you  as a fellow 40 year old, having struggled with infertility, and a true makeup lover, I feel like we are one and the same! Your videos, in their simplest of beauty, allowed an escape in my day, all of those days, so again, I say thank you!!! I have your eyeshadow palette that I still cherish to this day as I, somehow, feel part of the club for those who get it ", "I found you in 2014, so almost 10 years!!!!! You will always be my favorite beauty youtuber. I was working at South Center Nordy when you were in downtown! It's been surreal to follow your journey. The best part has been seeing you openly profess your love for God now, it's so beyond heart warming and encouraging.", "Just wanted to thank you for being a constant in my life! Left the beauty community after i realized how much toxicity it entails and this is the first video i have watched ever since. Thank you for being and staying the way you are. Started watching you when i was 15 and now I am 20 and i realized through you that growth and maturity is a blessing. Wish you the best! Xoxo", "Interactive live yes, like a day with Tati, James, Puka, cooking. Decorating, fashion (shopping), travel etc.  Congratulations and wishing you many more years of YouTube success.", "That's so cool how I have been watching you for 10+ years. Thank you so much for being transparent and open with your life for so many years.", "As if madness Monday was 12 years ago! I was just a teenager and yet I feel like it was yesterday! \nI feel like I grew up with you and your energy and spirit has always been beyond infectious!", "I have been following you for 10 years now. I was in the middle of a divorce and was having are hard time finding myself through it all. Your authenticity helped more than you could know. Thank you and Godspeed ", "Tati you’re absolutely amazing and there are so many different routes you could take with your talent. I’m so relieved to know you’re eager to do more and you’re not leaving us. (Sigh of relief) Honestly I have been waiting for you to start a podcast. I think that would be a whole new lane for you to tap into and give you more opportunity to connect with your viewers. On the other hand, I have absolutely LOVED your sense of style from day one and have always wanted to know what and who you’re wearing. Now too, I’m dying to know all the new recipes you’re making for your new healthier lifestyle. From your coffee to your lunch, snacks, dinner and even desserts! I would really enjoy learning how to make healthier dishes at home from somebody I know who’s had success with it and is still learning herself. Which ever route you take we know you’ll be amazing, super successful and we’ll be here to support you all the way through!!! XOXO", "I literally teared up. I love you Tati! You have been one of those channels that I never got sick of and consistently followed. You truly have a gift and I am so incredibly thankful that you stayed on YouTube. I honestly can’t put into words how much you stand out from all the rest out there. The growth you’ve shown since coming back is astronomical as well. I have been watching you for about 9 years or so and will continue to do so. You have taught me so much and your genuineness is so apparent. I wish you the absolute best and nothing but happiness for you and James. Although we obviously don’t know each other you’re like a friend to me. I’d love to interact on a live with you if you choose to do so!", "Omg I thought you were quitting! Out of the entire beauty community, your videos are the only ones that I watch and have had kept watching for several years now. You were the person that taught me how to do make up all throughout high school and college. I would really hope to see a podcast from you soon. That would be amazing!", "Been with you from the beginning. I feel like I have grown with you. Thank you for bringing joy into my life these past 12 years", "Can't believe I found your channel 10 years ago now. I was 28 and you were someone my age talking about products I needed. Then 2 videos later was your engagement. You've always been one of my favorites. \nI like the live idea, even though my life is nuts and I'd probably miss them all the time lol (mom of teens).", "I have been here for about 4.5 years. You are the first makeup creator I started watching! Congratulations and here is to 12 more!! ", "Take a pallete a week and show us different ways to combine colors from only that pallete! That could be so imspiring, plus, if the pallet is really thought out you could do wonders with it", "as much as I would love the live video format I vote for a weekly vlog. Several moments of your & James daily life... watching the two of you banter and laugh is a blessing especially after coming through the darkness. Its inspiring. Perhaps cooking together , shopping, seeing more of you guys in town or in your home. Of course with your puppy .  The connection is there... from a viewers stand point. Regardless of your decision I will be watching. Fellow makeup artist. I always learn from you. Cheers xoxo", "I started watching you when I was 14. I am 25 now. You have been such a big part of my life and you don't even know. You are such an admirable woman ️", "I remember being 18 or so and just learning makeup and wanting to buy the best i could with the little i had and then i found the madness monday videos and i was so hooked on those. I just can't believe that was 12 years ago. Your videos have always veen so great and positive and you send such a good energy out into the world. ️", "I LOVE the message of this video. Doing it for the passion, not just flowing with the short attention span tide. ", "I have been here for 7 years! I have seen high highs and low lows but girl you have rocked it all! I’ve watched you work your butt off and then I have watched you so mentally,emotionally and physically healthy in this part of live and I’m so happy for you️️️ we all love you Tati!!!", "I love tutorials, they don’t get old. Easy glam, full glam, etc. Also loved your career video, that is rare to see on this space. Would love to see that content also.", "You’ve done so much over the years. I’m in awe of you and your perseverance  Congratulations on 12 years. Definitely keep the drugstore content coming. I love when you do looks under s certain price point, what’s new at the drugstore, and one brand hauls or tutorials. And if I had to choose one of my favorite moments I would say your Scott Barnes videos were fun to watch", "Congrats Tati! During the time of COVID, I really felt a change in makeup trends and popular products that everyone used to use aren't so popular anymore. I would love to see you go back through categories like you previously have and show us what your top 10 ten of different products are.", "Alexandra Anele makes my favourite makeup videos right now, straight to the point, actually helpful, not “fad” type makeup tips! i’d love videos like this from you :) been watching you for 6 years ️", "I LOVE long form content. I love it. And I love watching long videos on YouTube where it feels like we’re getting ready together, or relaxing together. That’s what this platform is for me—it’s a companion when I need it", "Congratulations on 12 years! Honestly I would be happy with whatever kind of video you decide to make, but I vote for a live once a week on Friday evening. You were one of the first beauty YouTubers I started following. I just seemed to connect with your content.", "Thank you for always holding yourself with so much class! I have looked up to that in my life. I loved your foundation review and wear tests ! You’re the only YouTube who I  would take foundation recommendations off ", "I have been watching you for almost 10 years  still can't believe how fast the time has flown by! Congratulations on your anniversary  ️", "You’ve been through so much, but seeing your smile in each video, it’s clear you genuinely love doing this and care about your viewers. Thanks for being a shining beacon of positivity on this platform ", "I love seeing how much you have grown spiritually and have become the \"you\" you have always meant to become!", "I’ve been here since 2013, I just can’t believe it’s been almost 10 years since I’ve been watching you! My favorite videos have been you creating your palette and presenting it to us, just because a lot of us were anxiously waiting for our fav YouTuber to drop her very own line. I had the high hope it would not be a quick cash grab and it would be very high quality and boy you did NOT disappoint!! I have not found to the day a better shadow palette, just because I felt like I was truly part of it. Like you waiting to do something of quality for your subscribers! ", "I’ve been here since around 2013, so not all 12 years, but it’s been amazing to watch you evolve over the years I’m ready for more lifestyle! Love your new journey to more animal based because I’m doing the same!!", "I been with you since day one and it’s been a joy to watching you through all the natural ups and downs of life. The beautiful and the brutal. And watching you walk through everything with grace. My favorite season is watching spiritual grown Tati. You sharing what God has done is beautiful. Congratulations on 12 years, sweet soul.", "You're even more beautiful now than you were when you started. Honestly,  anything you choose for your videos is fun. My personal favorite is vlog or live. Anything where you're just spitballing...maybe James pops in...bloopers included...vlog/live/reality TV style. You're such a breath of fresh air.", "I think it would be SO fun if you did a series re-creating makeup artist looks from their videos (like Hindash, Hung Vango etc.)! It could be a nice way to get out of your comfort zone  Congrats on 12 years! xxx", "Honestly, I come to your channel because you elicit a very happy, comfy feeling for me. I would love a comfy cozy tati corner where you share other things that bring you joy so we can live vicariously through that. Your joy brings SO MUCH joy to others. Whatever you decide to do I will most definitely be tuning in ️", "Tati you have been like the big sister of the beauty community that everyone looks up to and I’m so glad you’re sticking around  I love the testing new make up and full face videos!", "A live with Tati would be so cool! But also just another trying makeup or tutorial video would be great too :)", "I started watching you about 4 years ago but I became more hardcore and started watching every video 3 years ago and when you left I was so emotional about it. And you came back and I cried happy tears. I know I sound insane but I feel like you’re my friend or my sister that I can look up to, who reminds me to shoot for the moon but also that it’s okay if your dreams change. And maybe somethings not everything you wanted and it’s okay to adapt. So thank you for meaning more than you could ever realize", "This is a silly story but I started watching you back in 2014 and I’ll never forget I just got my wisdom teeth removed and I was in so much pain trying to pass the time, and I discovered your channel! I binged every video and I have been such a big fan ever since ", "We need more makeup tips/tutorials!  No one does those anymore.   Also I loved your collaboration with Rachloves.  I watch her videos to this day because you  had her on your channel.", "I've watched since beginning & you have become a staple to watch weekly in my home. Thank you. Presentation & editing is next level over time but your personality is as it was always which now has extra confidence to tackle any topic. When you disappeared I did wonder with all the drama would you return? Your new chapter has been breath fresh air. Always enjoyed James & your family popping into videos for a visit which added little extra authenticity & fun.", "I have watched you for almost all those years and my makeup is so much better thanks to you. I love your chatty videos, I love James too. Whether it’s shopping for your home or whatever I don’t mind. Just glad you are doing well again. Thank you ", "What a milestone! I’ve been watching you for 8 years and am such a huge fan of yours. I only wear makeup for special occasions but everything I’ve learned (and bought) was from you and your channel. ️", "I was 12 when I started watching your videos. I'm 24 now, a working makeup artist. Because of you. I love you ", "Congrats on 12 years!! I love your videos and it has brought me closer to makeup. My husband has also learned so much from your videos and we used to watch them together. I would love a podcast or for WTF to come back.", "Would love a “topic Tuesday with Tati” or something where you just talk about a topic you are passionate about. Love the new topics of health and wellness ", "This is so beautiful! I’m so glad you’re back & staying ♡ My sister and I found you as pre-teen/teenagers 10-11 years ago & have followed you ever since - crazy to say you are the only YouTuber I’ve consistently watched all these years! Love the idea of a live shop with me on the weekends & to be able to connect more :) Lots of love, XO", "Oh my gosh, a podcast would be amazing! ️ I’m so glad you’re in a great place, happy we’re gonna get more Tati!!!", "Tati, I just feel so much love and warmth towards you and your videos. You've literally pulled me out of so many panic attacks and helped with the grieving of my lost family members for a lot of years. Your videos are so calming to me, but I also love the sometimes chaos and am grateful for those times when I'm able to laugh with you and put my pain in the background for a bit. You and I actually started making videos around the same time. I posted my first one in May of 2010. I've made a few hundred videos on and off but was never able to be consistent because of my depression, so I never really got far, but I sort of feel a kinship with you from starting at the same time. But I'm so happy for your success. And I know things have been rough and so stressful for a while, but I'm so glad that you pushed through and that things are getting better. You're one of the good ones and you deserve so much happiness. All that said, I would absolutely kill to have WTF back. It was my absolute favorite series. ", "This beauty channel is way up there among the best on YT. The content is awesome, informative and original. If I had to choose I'd go back to Tip Tuesday, WTF or a weekly drugstore deals on makeup. Short videos like 5 mins. Actually « lives » are fun too. Something in that range. Congrats Tati on your 12 year YT anniversary. You're so good!", "I'd love to watch get ready with me videos. I love how you throw in tips of how to get things done super quick and that's what I'm after! Congrats on your 12 years!! Love listening to you!! Wouldn't mind a podcast either !!", "Your palette is the only one I own. I am 50 and your channel is what helped me feel beautiful again. Thank you for not giving up ", "So when my son was born I had the worst postnatal depression. And you became part of my every day sanity.  \n\nSo in the UK your videos would go live at 6pm and every night I would put him in the bath and I would sit on my bathroom floor and watch your videos for a small moment of peace in my day.  A time where I would be totally distracted from what was happening around me. My son would sit and play in the bath and I would sit on the floor beside the bath and just escape it.     You were a massive part of my everyday routine during that dark time. And I think that’s really what YouTube is suppose to be, a place for someone to escape and connect to something bigger than themselves and there own circumstance.", "I love full day wear tests! Congrats on 12 years Tati ️️", "I still adore the long form content, but I love the way your content is evolving. Makeup reviews combined with chats are great, but I’d also love to see more lifestyle from you—and as part of that include all the wisdom. It’s your depth of character that makes you such a standout, and your sharing your ongoing transformation allows all of us to see how we can evolve and grow into more authentic versions of ourselves."]}