{
    "video_id": "ig2px7ofKhQ",
    "comments": [
        "The very fact that they are now using a proprietary connector is sounding the alarms in my head, sorry! Not going to support that! In fact I am GLAD and THANKFUL that the EU is forcing even Apple to use USB-C and now Nvidia tries this crap? Sorry, but go to hell! Stuck with you for over a decade (had my last AMD-Card in 2007 or so!), but this is too far - especially in addition to your unfair pricing! Seriously, I'll wait for the new AMD-GPUs and buy one of them!",
        "A close colleague of mine has done failure analysis in electronics for decades, and he had this to say when I asked him how accurate this breakdown was:\n\n> Pretty legit, a lot of that hits very close to home, especially the high pressure, long testing times and “wild theories”. Tin plated connectors can be easily screwed up, especially since they shouldn’t be use for more than 5 insertion cycles. Some plating shops are also super shady! ",
        "You did draw 600 Watts though this connector? 50 A through this small connector. Holy cow. \n\nWell why they didn't use some kind of connector similar to what VGA cables had in the past? You tighten it and it's fixed. Or something like display ports have. Something that clicks in on the sides and prevent the connector from bending and twisting as you tested. I am afraid that even fully pressed in connector may suffer some melting...",
        "Scientific methods to find the reasons for a serious issue! Don't have that card or any interest in buying, but I just want to support a content creator that can be trusted!",
        "There is no A on the Nvidia Logo. You must mean the A on the Nvidia NAME.",
        "I never planned on getting an RTX 4090, nothing I play is that graphically intense, but seeing your coverage on this probably the best I've seen on any tech product. Most only seem to repeat what others have said but you've gone the extra mile and ran actual tests on these claims. I hope you guys are part of a new trend on consumer reporting.",
        "Imagine how much better off the world would be if areas such as politics, corporations, and other shady entities had this level of credible, detailed journalistic investigation.\n\nUnfortunately for my pipe dream you guys have found great success in the PC sector. Feels like one million subs wasn't so long ago, and pieces like this are why you're creeping on two million so quickly. Awesome work. Glad this community has you guys.",
        "Im like only a few handful seconds in and there's already mention of a failure analysis lab and omg. Whatever hope the company had about refuting whatever you are about to say... poooof!",
        "buying 4090 come with rng of you burning your house",
        "The HAL 9000 series is foolproof and incapable of error!",
        "Having a high-resistance path will NEVER cause overheating. Electricity takes the path of least resistance. What will cause overheating is a lack of paths of low resistance. So more likely the cause of this is the fact those nubs are being angled, so instead of flat contact they have point contact.\nWe really have no one to blame but bad DIYers on this one. Pulling on a plug to make sure it's seated fully is assembly 101.",
        "So... \nBad connector design that doesn't click into place + card is too wide and long to fit in many cases properly + terrible socket placement (the outward edge of the card) forcing users to bend their cable to clear side panels + no detection circuit to prevent this = uSeR eRrOr hurr dur!",
        "Surely they will be forced to recall them all because it's a fire hazard.\n\nIt seems like the 6 pin socket design is no longer fit for purpose with the power draw of some cards. It needs replacing with something more robust.",
        "Just to think AMD was thinking about going to this plug. Thank GOD they didn't.  Nvidia needs to take notes and take things back to R&D.",
        "Keep up the amazing work!",
        "6:55 imho, at that point is not user error, but design error. If you designed the connector such as being easy to improperly connect and that improper connection makes it either a fire, or a shock hazard, you should not be designing said connector in the first place.",
        "What it means to me?  Absolutely nothing.  I won't be able to afford a 4090 until the 7090's come out.",
        "My God the level of detail and scrutiny in GN videos never ceases to impress me. This is a whole ‘nother level. Most youtubers would just blurt out whatever the latest news is and get clicks for that, not GN, they go the whole way!",
        "I know that hating on Nvidia is the thing now, but come on, if you can afford to buy a 4090 and not be able to plug it in properly...",
        "Incredible work as always! It's hard to make a 30 minute informative piece also be highly engaging to watch, but you have done it yet again. This should help viewers remember everything that much better, and be more critical and attentive when it comes to other reports (which will hopefully help dampen sensational reporting going forwards).",
        "How THE FUCK nvidia tested it????",
        "Appreciate the insightful content about the connector. Thanks to Steve and the entire GN Team for speaking out on this issue on NVIDIA Behalf.",
        "and ppl used to say china product is shit hahaha xdd",
        "The videos you guys create are always fantastic never stop.",
        "I appreciate you guys adding microscopy pictures into this. Hopefully that’ll attract more enthusiasts into the field! Keep up the great work.",
        "Gamer's Nexus out here being more transparent about Nvidia's problems than Nvidia. Round of applause guys!\n\nAnd that coupon code made me actually LOL",
        "All I hear is Gamers Nexus taking nVidia's money to damage control.",
        "awesome work! i'm a design and release engineer in the auto industry. quick connect cables like these should have an audible click sound when fully seated, and should have a low insertion force. no guess work should be needed by the customer to verify the cable is fully seated",
        "One nitpick: I'd say that a 0.1% failure rate is actually quite high for a dangerous failure mode like this - that means 1 in 1000 units fail dangerously! At that rate, I'd be inclined to suspect that the design just doesn't have enough of a safety margin (against eg. aforementioned user error).",
        "Excellent work! I don't think you should include the particle theory, by your own words it wasn't replicated, so it falls in the same bag as Igor's lab.",
        "Thank you for this informative video and well put together.\n\nYour team and you deserve so much respect for this amazing effort that has put in this video, all your videos are worth donating to.",
        "Thanks for the work, sorry i adblock the shit out of your stuff, but i dont really need anything from your store, so have some money <3",
        "Turned into a good life lesson ",
        "Loose connections really do cause melted cables - it happened with the 4 pin CPU connector on my previous PC. About a year after I built it, one day I noticed that it wouldn't start up at all, but then it started after I unplugged the 4 pin connector and inserted it more firmly. I thought it was just a fluke and didn't think anything of it, but then several years later my PSU's 4 pin cable melted, then the second one also melted after I switched to the power supply's second 4-pin cable. ",
        "nvdia owes you money",
        "Thanks! That is exactly what I wanted to know. Any chance you can share the name/contact info for the failure analysis lab you used?",
        "Pound for Pound for the price, performance AMD gpu's are superior over Nvidia ridiculous expensive prices.  Also the technology that AMD uses for lower power supply watts will save us money.",
        "Anyway the socket is bad. There are many reliable high current sockets existing on the market. Nvidia just choosed cheap trash instead of proper solution",
        "everyone knows bubbly melting plastic boosts performance all the way up to 451 fps",
        "Great video and analysis. This kind of information should've come from the manufacturer.",
        "So basicly best way to avoid this thing is to route all your cables finish everything,put it on table connect everything at back side and last connect the connector to gpu realy good put or dont put side panel and you fine?maybe even some how ziptie the plug  guess im lucky i cant afford one ",
        "So, we can move on to the next horse to beat dead?",
        "Thank you for the great reporting. I don't have a 4090 but I do have an NZXT H1, and your thorough reporting on these types of issues is incredibly important.\n\n\n\nMany automotive connectors have double locks. where the secondary lock will not engage if the cable is not completely seated. That design ensures that it is obvious to the person assembling the device if they have connected the cable correctly. For a connector that passes 60+ amps, I think it would be wise for Nvidia to design a connector that provides positive feedback regarding proper insertion.",
        "Next up in the news: Nvidia let's go all their testing and safety engineers, GN will do that work for them in the future. I really don't understand how a YouTube channel can find the resources to do a root cause analysis of a failure like this and a mega corp like Nvidia seems to just shrug their shoulders and let the issue slide.",
        "This is basically free R&D for nvidia damn",
        "Very well done and I applaud your level of quality. The extra effort you did to involve xrays from an external company that specializes in failure analysis really shows how much you care about accurate reporting.  I thank you and the many people make supporting you, making these larger expenses.",
        "I wonder if it would help fix it to have the connector clip on both sides instead of a center latch.",
        "Cool, but im still going team red this gen. :D",
        "Thank you for going back to facts. You had a few videos that were very biased, while you claimed you are unbiased, and you hurt those people.\nWords from people never tells a story, only evidence tells the full story. This proves this, yet you tore down other youtubers because of what you heard online. Again, thank you for getting to the facts.",
        "Incredible content! Your commitment to finding the actual root cause here is truly commendable.",
        "It's hardly fair to expect a small company like Nvidia to research and test at the level of Gamers Nexus though.\nIncidentally, why would you ever have such a high current connector, sounds like politics, they could easily have gone for more pins. Why not 16? They wanted to downplay the power... looks like that went well.",
        "Great work and great video. It makes me wonder if NVIDIA and the like took the time to employ your methods and a lab.  You would think that they would have the biggest need for knowing what is happening. I'm pretty sure they have more resources and money to invest in this research and testing. Anyway, I'm glad you are here doing the work that needs done!",
        "Responsible reporting and the lack of it is why people have lower trust in \"mainstream\" journalism than the US Government.\n\nThank you for doing it right.",
        "Hurray for the scientific method. Great job.",
        "Phenomenal video, and as always, I learned something new. Thanks to you and your entire team Steve! ",
        "To think these guys were once working out of a house doing mostly CPU and GPU benchmarks. It's impressive to see how far you guys have come since then! Thank you for going out of your way to provide this much valuable information for the PC-building community.",
        "It's at this point that my occupational therapist telling me that she was greatly surprises at how strong my grip was/is during my carpal tunnel rehab. Apparently, there is (and has been for quite some time) a national epidemic of \"weak grip\"/lack of hand strength.",
        "Seeing the overwhelming support for this video finally calls for a truly proper use of the meme line \n\"𝐢 𝐚𝐦 𝐬𝐨 𝐩𝐫𝐨𝐮𝐝 𝐨𝐟 𝐭𝐡𝐢𝐬 𝐜𝐨𝐦𝐦𝐮𝐧𝐢𝐭𝐲\"",
        "When they kept saying Jesus will return. I didn't expect him to come back a gamer.",
        "Cablemods do a 3rd party version so I've heard. Excellent video as always.",
        "\"In God we trust. All others must bring data\"\n\n\n\nThis video is the physical manifestation of this quote.",
        "SO MAKE SURE YOUE PLUGS ARE PLUGGED IN!!!",
        "This is fantastic work! You should send NVidia a bill for the failure analysis they should have been doing and communicating already.",
        "When your customers do more rigorous product testing than the company that makes the product do. What a time we live in.",
        "Having worked all levels of Tech Support for 20 years of my life, I can safely and confidently confirm that 9 out of 10 issues are caused by user error. Building your own computer can be extremely fun and very rewarding for beginners. BUT the first few times you do it, you really really really (throw in a couple more \"really\"s there) should have the finished build checked by someone who knows what they are doing.",
        "4:13 the article reads in the 1st sentence: ''and quasi also'' ",
        "it wasn't well plugged in",
        "Melting Moments.",
        "Brilliant work as always!\nIt's amazing the lengths that you go through + how much technical analysis and effort you guys put in. \n\nTheres never any clickbait with GN or putting out pointless speculative videos just for the views.",
        "Awesome reporting as usual",
        "No way am I getting a 40xx series not any other series of card that requires more than 2 power plugs.",
        "Thank you to everyone at Gamers Nexus for your amazing content and dedication to the community.",
        "I really appreciate the time the GN team takes to actually test and validate the things you talk about. This is what real journalism looks like and I applaud your commitment to it, excellent work as always.",
        "This is extremely well done.  Thoroughness of the reporting as well as the detailed analysis is top flight journalism.",
        "if I can mine with it and withdraw tether",
        "Don't we ALL need more insertion cycles? And yes AVOID pulling the cable taut. Seek an insertion cycle instead.",
        "Come on guys. For a team that prides itself on meticulous technical data it pains me to hear Steve mangle the use of the words “theory” and “fact” and do so with such confident gusto.\n\nA fact is what something IS. A hypothesis is a guess as to the WHY. A theory is the hypothesis that is widely accepted as the best WHY based on repeated experiments yet it is still subject to change if a better hypothesis comes along that can be validated.",
        "4090 1, dummies 0. I was getting fed up with people saying I was stupid to use mine. It never smelled like burning and I knew to just be cautious and make sure every connection point was firm and straight before bending it to fit in the case. It ain't rocket science, if you're paying this much for a graphics card take care of it ",
        "The cable lock needs to go completely across the connector NOT just in the center",
        "what about native psu cabels",
        "This has been my theory the entire time after it took a lot of force to get my adapter into my 4090 Strix. I ran it for about an hour before I checked my adapter cables and heard a clicking from the connector. Gave one hard push and it made a loud click and it was in. I've been building PCs for almost 27 years and still made this mistake. Couldn't tell you how far out my adapter was but I assumed it was in given the amount of force I applied and know it wasn't given the loud click of the latch connecting when I gave that last push.",
        "Many large cities now do not patrol traffic anymore for speeding, reckless driving and illegal turning, etc…",
        "I came for melting cables. I stayed for Steve's manly mane.",
        "Thanks for doing the hard work of true  reporting and research!!!!",
        "So 99% user error blaming the manufacturer and other content creators jumping to conclusions for clickbait ad revenue.  sounds about what I'd expect, and shows that GN is in a tier above their peers. Good stuff.",
        "You should see if you can reproduce this on a 3090 with the older style connector",
        "I believe this massive drama surrounding the cables melting or potentially catching fire has caused many potential 4090 buyers to change their minds or even look elsewhere and possibly lose Nvidia millions of $ in sales no matter if you think Nvidia deserves it or not this kind of sensationalized reporting is truly damaging to the market as a whole",
        "Holy sh**",
        "Just more reason why GN is my favorite PC info dump channel. You guys kick ass and are always so incredibly professional.",
        "Nvidia's technology at its finest! Why wouldn't I want to spend $1600 on that? And another thing, what if the failure occurs after your warranty has expired, then you're screwed as this failure can happen at a later date.",
        "This channel has been responsible for the sacking of countless product engineers since.....?",
        "with 4090 everything is clear and 3090 is the same? what do you think?",
        "LOL...improper insertion....many of earth's problems.",
        "Thank you",
        "here i am tryinna buy my house to buy 4090. and he's burning that shit for real",
        "Regarding your monologue; you're right and not just about this.  \n\nIt's not just your peers, tech journalism or even journalism in general.  ",
        "Wow, you guys have gone above and beyond. Absolute LEGENDS. Hope this blows up to hopefully cover at least some of the cost.",
        "Steve and team have really done a Batman-level analysis, x-ray, spectrometry, thermography, and what not. It's almost like they are the real life version of star trek's tricorder!",
        "So many donations! How did this happen?",
        "It is a feature, actually. Ever heard of self soldering connectors? The GPU detects that the connector is not soldered, and solders it for you. A soldered connection is always the best connection!",
        "expected and even the old pciex conn can get hot upon bad contact, but thanks to alleviate some of my worries.",
        "Thanks to the whole GN team for putting in the work and trying to get to the bottom of stuff like this. Also, part of this is why i'm glad I always second guess myself and triple or even quadruple check to make sure all the PSU cable connections are good whenever I work on a system.",
        "Mad respect for the effort you guys are putting into this",
        "okay, i'm tired. Simple solution to the complicated problem. Use clipping mechanism that presses contacts from both - up and down. like putting hand in the waffle maker - metal contact from above and metal contact from below the pins that clamp onto pin. Like when you place CPU inside tha bracket and use lever to fix it in place. Come on, tech guys.",
        "No other PC tech channel is this dedicated. Absolutely no contest. GN is the cream of the crop.",
        "Just design it like a VGA Cable with screws to ensure proper contact lmao",
        "That ridiculous connector shouldn't \"click\" in. You should have to screw it down like an old-school VGA cable.",
        "so I will never efford for this card but I just wonder and heard the rumors... so here I am to checking out :D",
        "Yeah when I first saw this news POSCAPS POSCAPS POSCAPS instantly came to mind. Do proper research first",
        "This is the best investigative journalism I have ever seen any media outlet perform in the IT industry. Usually they would just sellout (won't name names) to manufacturers or advertisers.",
        "️I can fix the factory and fix problem\n️Puedo arreglar la fábrica y solucionar el problema",
        "Steve, you continue to evoke my respect and admiration with the lengths that you will go to in order to protect consumers. I deeply admire your dedication to using scientific methods to do all your testing. However, die a little inside very time you say \"theory\" instead of \"hypothesis\" in this video.",
        "How the hell did nvidia not catch this before launching it ?!",
        "Glad I'm going with the 7900xtx this time around!",
        "A huge thanks to Steve and his team for the resources that it took in order to deep dive into this topic.  As always, great video and excellent reporting.",
        "Seems funny Nvidia was talking about limited cycles of plugging and unplugging these connecters before these problems started cropping up. Its almost like they knew there was a problem and were trying to cover this up right from launch.",
        "This is an example of opinion versus facts. A trend that started several decades ago. Once a discourse was universally headed \"opinion\" whereas now opinion is rarely distinguished from facts or real reporting. Kudos to GN for maintaining the tenets of reporting.",
        "clearly, you did more testing on these cables than Nvidia’s QA department ",
        "Very thorough analysis. Well done!\nNVIDIA really didn't do themselves a favor with this connector. There was no necessity for it to be this small but their over-engineered tiny PCBs. They could have just gone with the standard tried-and-trusted PCIe connectors.",
        "It seems that EVGA knew something the rest didnt until now. the 4090 is a disaster of a launch and i think they knew so they got out.",
        "Wow, truly informative and extremely thorough!",
        "To think someone would call you a Nvidia apologist is nuts to me.\n\nI think it's fair to say that this is primarily a problem of user error induced from a design that makes it a bit to easy to screw up. Cable management usually puts strain on cables, people don't want to put too much force onto a connector, the lack of satisfying click means people might not notice when the cable is seated, and people work on their machines more than once. Ultimately not accounting for user error is itself a design fault. Had they, somewhat ironically, made the connection looser but easier to know when attached properly there probably would be less failures. I believe that if you have a clip it doesn't also need to be a press fit like Molex and trying to design it to work without the clip makes it more prone to failure rather than less.",
        "Why does it only use 8 pins is more my question. Amd high end cards use 2x 8 pins",
        "Now we know the REAL reason why EVGA wanted nothing to do with this launch.  LOL.",
        "19:03 - Well, in retrospect, this actually makes sense.. only someone who can justify spending this kind of money on a GPU could be such an inept that they couldn't even fit a connector into its socket.. ",
        "Gamers Nexus is the GOAT.",
        "You guys deserve this from every subscriber.  Thanks for taking the first principles, scientific approach and staying with this story!",
        "This is the first time I comment on a video, not to mention donate to a youtube creator. Incredible work, truly feels like a grassroot investigative movement looking out for",
        "The work you are doing is insanely informative and brilliant. Thank you GN Team!",
        "thank you really really much guys for this intensive/extensive in depth testing ^^ \nyou all are doing a great job and i love your content \nkeep up the good work :3",
        "Holy cow, the amount of effort put into this video. Bravo!",
        "steve, truely the jesus christ of all tech",
        "Excellent reporting!",
        "The monologue at the endliterally exactly how politics and the news works.  Everyone thinks their facts are the real facts.  When in reality most people don’t get how facts work.  Science is the way people…",
        "Hope Nvidia appreciates you as much as we do and monetarily compensates you for the work you did for them as well as for everybody that will use this standard in the future.",
        "Top source for facts = Gamers Nexus\nThank you guys!",
        "결론은 케이블이 꽉 껴야 하고 꺽이면 안된다는건데 VGA가 커서 케이스에서 간섭이 일어날텐데  규격을 바꿔야 하는거 아닌가",
        "It's a common problem in other journalism too - the first to publish the story gets all the clicks, even if the first publication is wrong. I for one appreciate how you guys sort facts from fiction and publish honest reports. Your reports I can trust. That's why I don't bother with the other sites anymore. Tthey're wrong more often than they're right. And you go the extra mile to reproduce the failures like the NZXT riser card fires, exploding Gigabyte power supplies, now the melting 12V GPU connectors. You put in the effort to get x-rays, to get resin sections, to analyze the failures under a microscope, and finally put together a theory that is both correct and that you could reproduce. That's engineering. That's why I trust this channel and pretty much only this channel.",
        "You guys keep blowing me away with how detailed your work is. Really appreciate you all going the ekstra mile to make sure its done right.",
        "GN took 10 extra miles on this one! \nHats off for being such a reliable resource",
        "Who in their right mind goes through all this trouble?! I'll tell you who, GN, the best of the best.",
        "The trend of fast & sensational headlines instead of properly looking into the issue truly is a big problem in a variety of subjects.\n\nThanks a lot for your work, you guys don't produce the most \"EXCITING\" videos, but you produce the correct videos that are I can confidently watch without having to fear that you guys overhype or rush anything just for monetary sake.",
        "Wow, my comment deleted for speaking truth ? Not trying to bash you Steve, just stating that a high resistance path, parralel to a low resistance path, is never going to heat up.\nAnd you didn't say \"a high resistance path parralel to the source\".",
        "Thanks for your hard work and dedication!! You guys are awesome !!",
        "thank you for this investigation after 20 years at NVIDIA now I'm going to AMD  doesn't understand the expectations of gamers at the current state of the world where energy consumption is at the center of the debates and that the  power does not explain everything power without mastery is worth nothing and even me 2000 dollars!  to PLAY Witcher 3 Remake LOL",
        "As long as Nvidia uses the 12VHPWR connector, I won't be buy the cards. I still believe (being in an industry where I see this issue happen on vehicles) that these pins aren't the best possible solution to deliver power to a graphics cards.",
        "I’m no cable expert, but in regards to not properly plugged in this should be easily avoided if a single signal pin was shorter and not allow current to pass through unless it has contact..",
        "Thank you for thorough testing!",
        "Its great that you and your team spend the time to get real answers and skip the speculation.  Purchased a few things from the store to help support efforts like this.  Keep up the great work!",
        "Great video! Using mosquito for scale at 9:27 too! :D",
        "So, you ahve to do Nvidia work for them? Man, I wont buy a VGA from them ever again, thery're so damn arrogant! In the beggining they blamed the community for the meltdown ... that said a lot about Nvidia as a company.",
        "Wow, smelly burnt 12vhp connectors should make the worst of 2022 shirt?",
        "Intel yg bikin, NVIDIA yg kena apes. Parah",
        "Good Content ! ^^ Having no probles so far by myselt im still interested",
        "Thanks so much for raising public awareness about this issue. I've lost faith, trust, and confidence with an eroded image of Nvidia. Now they have released a product that I cannot trust. I can't tell them how I really feel but my wallet can. From this day forward I will never buy another Nvidia product. In fact, if someone offered to give me a 4090 for $160 dollars, I would not buy it or even take one for free. My life, family house is far more important than some stupid FPS in a video game. Really sad Nvidia has been so good reliable, fast, stable GPU's with monthly driver updates. The rtx 3080 has the old-style connectors doesn't suck down a ton of power either. Why NVidia? I thought you had labs and testers to double check before launching a product? How/why did this happen? was the 40 series rushed? who's responsible for this? I demand answers from an official Nvidia representative. The community at large all the pc gamers/content creators need to step up and put Nvidia on notice. This could be a serious health hazard. It needs to be resolved before any GPUs from NVidia are purchased or sold. AMD has two 8 pin connectors on their RDNA 3 that's what I'm buying.",
        "Edit: I forgot to say Thank You for doing such a damn good job on the topic, the money spent, and the education on this topic. This potentially will or have already saved lives. I'm not being hyperbolic about that either.",
        "Why's the latch design so small. It should be wide",
        "Whether user insertion error contributes to the problem or not, this connection and those 4 to 1 adapters are a garbage design.",
        "Can you imagine if a multi-billion company cared if their products didn't catch on fire? \n\nThanks GN team you are the MVPs",
        "Great work!",
        "Great Job GN!   Thank you for working so hard to find the cause of these issues!   Your laboratory and scientific testing methodology may be 'slow' but science is not usually fast.  Keep up the great work!",
        "This video was OUTSTANDING!!!! It may well be the absolute best piece that GN has ever produced. It is truly a pleasure to be able to watch thorough and competent analysis of a problem, see your proof (not just feelings or suspicions, but hard facts) by showing your work, and then provide definitive solutions on how to fix or avoid the problem in the future. You shouldn't apologize for the timeline because thorough and ACCURATE research demands time and cannot be rushed. I don't own or plan to buy a 4090 now or in the future, but the lessons learned from this situation can be applied to all computer hardware (not just GPUs). Your work here may well save someone from a catastrophic failure in the future, just from a reminder that ALL cables (not just power cables) need to be fully seated and connected to avoid problems. This was damn fine work! WELL DONE!!!",
        "That's so very comprehensive, nice. I still want to say, because this seems an excellent occasion, a theory in the academic sense isn't just a hypothesis or mere speculation. A theory is a conjunction of propositions that together have a certain explanatory power. Usually, differing depending on whether we are talking merely conceptual or empiric theories, these are supported by robust evidence.",
        "How do the 'old' 8-Pin PCIe connectors avoid this issue? I've not plugged in one of the 3 cables on my 3080 correctly (roughly as shown in the video) and the PC simply won't POST then. Why can't the 12-Pin connector work in the same way?",
        "This was really excellent reporting. As an electron microscopist, I particularly liked the failure analysis, really comprehensive. \n\nI don't own a 4090 but I'm still checking that my GPU power cable is properly seated when I get home ",
        "solution should've been to use a regular 8 pin connectors lol",
        "Jay has been pretty quiet since this video…",
        "Steve, thanks for the thermal imaging for the \"cut down\" connector.  I was wondering if something like that  could be the case, since you see that failure mode with bad power outlets in  the home.  The heating/cooling cycles and plugs being yanked out by their cords ( either straight or at an angle) leads to bad contacts and melting.  One thing about the solder job on those small pins:  Stranded wire is a cursed invention when it comes to ANY electrical contact but solder penetration into wires is usually not an issue for a splice.  For a crimped connector pin though?  ",
        "This is my very first time donating to any YouTuber in my 10 years watching videos, and watching the entire video, being entertained and informed at the same time is an amazing accomplishment. I am well informed about the issue and have been enlightened. You guys deserve any donations for the countless hours you guys did to bring an informative and objective light into this issue. Keep it up and I will continue watching your guys' content!",
        "What an awsome video!",
        "Solid research, very much appreciated work",
        "Thank you for this video. I was really nervous about this topic since I've build 2 PCs with 4090s before news about melting cables appeared. Now I can sleep with clear conscience again :D",
        "thinner contact can cause temperture increase cause your asking for not enough material to support the amps draw . Put your hands on a hairdryer wire when it draws 1500 watts vs 750 watts . You always thicker copper for the higher amount of power to prevent a metlting that could cause a fire if there were bridge in the connectors.",
        "Could definitely see this scenario happening with some of the pre built pc's that gn has bought from coming like this already from the company or those that have the end user plug it with some one not tech savvy thinking its plugged in just by it feeling tight and bending it and causing it to stick out more but not noticeable and puff there's your melted wire",
        "Наркоманы из Nvidia решили что давать видеокарте мощность обогревателя (450-800w) хорошая идея. Уже по 30 серии было видно что   они намерены обогревать дома. Самая младшая модель серии 3050 имеет TDP 130w, страшно представить какое TDP будет у 4050. Вангую около 185w. У меня компьютер включен по 120 часов в неделю по 500 часов в месяц. Если я поставлю себе 4090ti вместе со всем остальным коробка будет кушать под 1200w/h и в месяц выходит по 600kw только за один компьютер.",
        "That conjecture about the \"parallel high-resistance path\" doesn't make much sense, because if there are two parallel paths only one of which is high-resistance, most current will naturally flow through the other (current \"auto-balances\" between the two based on resistance). It only becomes an issue when there are no longer two parallel paths, and the high-resistance one is the only path left (or when there are multiple paths but all of them are high-resistance).",
        "Yep, NVidia can't deny it with the copious amounts of video evidence that Gamer's Nexus has been gathering.",
        "You Should Solider in a Pair of 4Ga Wires right to the Card and Solider into the Power Supply",
        "Awesome video guys.\n\nI work for a company that manufactures and sells failure analysis equipment. If you guys ever want to do this analysis yourself in house(section/mount/grind/polish/microscope) let me know. I'd even be willing to do setup/training for you guys!",
        "You and your team are simply the best. Nothing more to add.",
        "Some next level investigative journalism.",
        "Thx. For all of it. Keep up the good work.",
        "ITs clearly a shame, AMD had discussions about these issues years ago and did well seems so...  ( Like hey spend over 1000 dollar, to may have your PC in flames while rendering or game XD ...\nWhen i listen to what these cables and connectors are made from, i just think...  (  Guilty of could had awareness on this topic, but NVIDA lost for whatever reason ) outsourcing sensitive hardware, is another blame NVIDIA has to take!!! ",
        "12VHPWR should be at least have capabilities of 1200 Watt for 600 Watt Rated so the safety is 100% Safety like 6 & 8 pin",
        "Incredible work GN!, The level of detail, honesty, quality investigation, investment and re-investment of resources and a top team is what sets GN apart!. Every video GN does sets the standard in quality unbiased reporting and a very high bar for others.\nThank you GN for continuing to deliver incredible content!",
        "must be a gauge issue",
        "I hope Nvidia donate anonymously to support the channel.",
        "Do we know if the failure rates are equal or higher than the current 4/8 pin cables at all?",
        "connecting two 4090 gpus on single mother board gap between to gpus are very less. is that fine to keep two gpus . do they meltdown?",
        "Test soldering straight to the pins of the connector and see what temps you get at the joint and along the wires, pritty please, this would be answome test to see how much contact is needed and if the port its self can handle high loads for extended time periods, Wishi had the extra cash for parts so i can help out, IM working on it though, also i has some memory from a rtx 3080 and other parts if any one is in wants them .",
        "TLDR: If your cable burned up, you probably connected it poorly. LOL ",
        "Tier S+ content right there",
        "Nvidia is truly on fire this season! Blazing products! Price-wise and otherwise ",
        "I have a lot of respect for you and your team. You all are the perfect blend of very technical, cynical, optimistic, and humorous.",
        "How in the hell were those cables not plugged in all the way? The lack of feedback to the user (lack of audible clicking or tactility) is a ridiculous oversight and just flat out lazy. I've used NVIDIA nearly all my life but they honestly deserve all the bad press they're getting with this generation of cards.",
        "I wonder how long it takes for the cable to work itself loose enough to cause this.",
        "Bedankt",
        "16:11 Steve, it is pronounced \"spec-tross-copee\" not \"specto-scopee\"",
        "I would like to see how long it would take a improperly seated cable from 1mm to 4mm take because of the bends required by cable routing. Not saying it isnt user error entirely, but if someone believes the cable to be seated at .000005 mm, but it isn't... that doesn't mean that connection can't be made larger over time because of bends.",
        "They should introduce atx24v for high power gpu usage. Bye bye 12v for high end nvidia gpus.",
        "Ask any electrician in Automation right now. They will look at the connector and laugh and tell you why it’s melting. No macro pics or thermals needed. \n\nRemember the Old Power company commercials? Too many plugs into one plug ?! Got to stay safe around electricity! ",
        "I’m literally not buying a 40 series card until this shit is sorted out",
        "Great work GN. Thanks for the allnighter.",
        "\"Thanks, Steve!\"",
        "Rofl... it went to commercial, and I got up and checked the connection on my braided 12-pin adapter cable. lol  So yeah, the fear around this is real.\n\nI can say that having different PSUs connected to the same 4090s produces differing results on the wattage that can make it to my card.  With a thicker gauge, after-market 8pin x 4 to 12-pin adapter from Amazon connected to my AX1600i, I can get my Gigabyte Gaming OC 4090 to pull as much as 609watts to the GPU alone, and about 659 watts total board power draw.",
        "I again understand why EVGA dipped.",
        "Is this an issue on the 4080 as well?",
        "When you know GN will go above and beyond in their testing and analysis, and then you are still absolutely blown away by the lengths (and no doubt expense) they go to to make sure their reporting is as accurate as humanly possible.",
        "Stop apologizing for something that isn't your fault. You did the testing and show a factual result with real time proof, anyone who has opinions or hypothesis with out proof is simply speculating. You don't have to apologize. If they get mad is on them not you. Also thank you for the time spent making this information available to everyone. Keep up the good work.",
        "Steve and his awsome Crew is dedicated AF. Love you Guys, thanks for making the World a better Place <3",
        "#thisisfine",
        "Not cool story regarding bad design/user mistakes... Once was charged with installing new modular Antec 1200W PSUs in 2 workstations. Well they used the exact same connector for the 12V GPU connectors and the 3.3/5/12 peripheral supplies... The only thing different was the color on the PSU side.",
        "When it was smoking at the start it didn't look as if it was plugged in correctly.",
        "That failure analysis footage at the top. Wow that cannot have been cheap. You're the heroes we want but don't deserve",
        "I'm starting to think it was a good idea to skip this generation of GPU's .",
        "my 4080 will be here in few days. After watching this, I now feel MUCH safer and more confident I will have many hours of uninterrupted gameplay. I appreciate your time (a lot of) and efforts in showing the underlying issues of this cable. Sure it can happen still, but I feel the chances are that of winning the lottery...and I never win anything!  Again thank you!",
        "Extraordinary work",
        "Thank you GN team for all the hard work and time you put into this piece. I really appreciate it!",
        "The amount of work going in these testing is phenomenal, i hope that you could influence the industry more with your dedicated work :)",
        "i was here for this",
        "Idk why I keep watching all these videos to see if it’s safe to buy a 4090 or not when I can’t even afford a 3060, but I’m ok with it and appreciate the amount of detail y’all do for these things at GN.",
        "Holy sh*t this video is amazing. Great work!",
        "GN proving once again that they’re the only tech channel willing to actually get real information, so real testing, and not making clickbait.\nTheir dedication and integrity puts literally everyone else to shame",
        "Bottom line, is there a connector that is safe to use?",
        "nvidia clicked on this video notification lightspeed fast",
        "EVGA sitting in the crowd laughing at the burnt cables",
        "This time i walk over to AMD ",
        "The problem is the user. If you simply use the product, it will fail. This is because of user error. If you would like a refund, please know that we cannot. Because we did not melt it. We simply set it up to melt; it was your doing for using it. ",
        "TecLab found the issue first, but they are a small channel so no one watched their videos ='(. Anyway, that was a confirmation, as many try independent sources get the problem better we can understand it.",
        "Steve, you and your team don't get paid enough for the work you do. Thank you so much for the effort you and your team put in to keep us informed.",
        "Excellent work.  Rock solid engineering.\nA similar melting plug fire storm is happening in electric cars.  The fire problem is with the 14-50 connector, which delivers up to 40 amps at 240V or 9600 Watts.  Sandy Munro was discussing it \"Home Charging Installation Risks and Advice\" on the YouTube channel \"Munro Live\".",
        "the lab analysis imagery was so cool",
        "I, also, am tired of clickbait creating YouTube channels. People need to grow up.  TY Steve for calling them out.  What they have done in the name of greed is abhorrent.",
        "It requires a \n\"CLICK!\" \nsound when fully connected with manual on new connection proper mounting. \nA lot of power cables has this feature, even a cheap ones. ",
        "Gonna be funny when some twitch streamers rig catches fire live on stream...",
        "Not all heroes wear capes! You guys go above & beyond for the community. And it can't be overstated enough how appreciated your dedication to what you do, is to us. This is the kind of ethical effort that makes all of us continue to come back to this channel. Thank you for digging into this issue.",
        "Time to make that support again and buy more of their sweet merchandise, because you guys aee awesome!",
        "Good report with what sound to me as the correct conclusion: incorrect mounting of the connector with the pictures of the indentations on the plastic as the real smoking gun.\n\nThere seems to be one big mistake however. There are multiple mentions of a high resistance parallel path as a potential cause of heating, however that makes no sense. Electricity makes heat (mainly) by the Joule effect which has the formula I²R. This means that current is way more important to cause heating than resistance. By adding a high resistance in parallel to the low resistance connector, the total resistance will be about the same (actually a little lower than before) which means the voltage drop across the connector will be about the same (also a little lower in reality). Ohms law states U=IR. So if voltage U across the connector and the high resistance parallel path stays the same, that means current I halves every time you double R in the parallel path. Applying the Joule effect I²R, this mean that for each doubling of R, the amount of heating in that parallel path halves.",
        "Been using my 4090 without issue",
        "Thank you for existing and always accepting nothing but the truth, for doing all the hard work of gathering the data and presenting these facts. We love you guys!",
        "Great job +1",
        "I didn't really have the time to stay for the whole video but when I seen how comprehensive it was i put my plans aside and made sure i supported GN by watching the whole video. Good job guys. Weird how Nvidia didn't go through this with the media really raising a storm about this issue. I feel like if Nvidia addressed this it would make them look better but since Nvidia left it up to the consumers (you guys) to do expensive comprehensive testing really shows how much of a peice of $hit Nvidia is with a potential serious issue. ",
        "Steve is basically a scientist at this point. Nvidia hire this man.",
        "So when Jay made his first video about being worried about the cable being bent to the side or pulled loose, and Nvidia blasted him for that being a non-issue, he was actually right all along. Amazing",
        "I feel like I need a masters in electrical engineering to figure out what he’s saying.",
        "Yo Linus, step up yo cable Game!",
        "..............omfg don't wiggle the plugs into the ports!.............wow~!...........these aren't automotive plugs!!!...........just like everything always double if not triple check your connections before ever, ever, ever powering anything up...............",
        "THX Steve for completely and throughouly covering this issue!\nIt is now known fact that we can always depend on your studies!  ",
        "You guys are amazing!  You are providing the pc community with invaluable information while holding manufacturers accountable.  You make channels like Jayz 2cents and LTT look like sellout children.",
        "The GTX 4090 is the another point where \"household technology\" met a breaking point .\nNvidia's goals are going counter to what the world needs right now (more energy efficient cards) , and this was a beautiful wake up call (that they'll likely ignore, since they're waaaay full of themselves and their 'vision') .",
        "There you have it: The spaghetti-arms of gamers are not able to fully press the connector in.",
        "thank for your dedication. it could happened especially in tight built",
        "Thank you guys for taking the time to investigate this thoroughly!!  This is why y'all are among the most trusted, respected voices out there.  It has been earned.",
        "Thank you your fine don't worry about it you've done an invaluable thing for the community.",
        "This whole saga is like watching an air crash investigation episode. Good work as always and im glad to know there's someone out there actually looking into things like this",
        "In summary: Fit properly",
        "GN is a gem in the industry and I'm glad to see the commitment of you and your team to providing real information for the community",
        "i surprised there hasn't been a recall because of this.",
        "mmm...NICE! :)))))))",
        "again thanks a lot <3.",
        "Thank's for your great work, this was very informative!",
        "Probably your best video yet. You did something here that no one else seems to be able to do including massive billion dollar companies. Keep up the awesome work. Thanks GN!!",
        "Goddamn these comments. I just wanted to find a tl;dr not read 5000 comments thanking the makers of the video. I guess I'll just watch the video then.",
        "Seeing the connector bubble is just nuts",
        "That new hair lighting on the set, chef's kiss. Great to see not only awesome unique and important content, but an up in production decisions on the aesthetic level!",
        "I have always told people that nowadays connectors in PCs are idiot proof. I see that these days are gone...",
        "Thank you so much for all the hard work you guys put into everything you do. You're truly in a class of your own.",
        "How is even 0.05% okay? If one out of every 2000 cars manufactured bursts into flames, you will see a mass recall.\n\nAlso callling this a user error is somewhat ignorant of the fact that it should not be possible to make connectors melt by simple not triple checking proper connector seating and also suggesting that every 1 our of 2000 people are carelsss and negligent is.. well okay that is reasonable, but still.. there is a reason why we make things idiot proof these days. Its ignorant of a manufacturer to just assume everyone will pay extra attention to something as trivial as plugging in their device.",
        "The sheer fact you figured this out faster than Nvidia a 25+ Billion Dollar company speaks volumes about just how incompetent these guys are. Most of us have bought GPUs before we're not new to plugging cables into a GPU but if it's that difficult to plug in even for your average gamer & the fact contamination of some sort can cause or worsen this it should have never left the factory. ",
        "I'm 100% sure that Nvidia knew all about this issue prior to shipping out these cards and cables, they simply don't give a s#$t. The regular consumer has zero power and is simply sheeple that makes them money. Sad. Thank goodness for channels like this. Nicely done.",
        "Tangkas",
        "God a bunch of potatoes on Reddit were pooping all over nvidia when it was user error the whole time lmao.",
        "Man what a high quality piece of content we have here. Awesome video! Also i think the ending monologue was really necessary to say the least. Keep up the good content :) Thank you so much for you hard work to all of gamers nexus!",
        "With larger connection pins none of this would have happened or maybe with a more usual click system... But for me it remains absurd that 16 cables coming from 2 molex 8pins turn into 4 stupid microscope pins in comparison, a connector from $10 for a $2000 graphics card is ridiculous",
        "I just bought the gxr, the mouse mats, and the coasters!",
        "I miss using planar power connection wedges.",
        "In a world where easy answers and rushed conclusions get rewarded we are fortunate to have Gamer's Nexus",
        "\"Use code thisisfine\"\nI see what you did there.",
        "Haste makes waste",
        "I thought so this is the problem. It was my first time to handle a GPU with 12PIN with 15+ years experience in building my PC. My first attempt was not fully seated. Its just that because of awareness, I have to put extra pressure until there was like a click that I felt.But this isn't obvious. It's good to fully see this in this channel",
        "We need to move to Ram slot style connectors where  you push in the cable then use tabs to click it in and hold it in place, not just for gpu but for motherboard connectors too, it would make things so much easier, and yes i know ram is often not seated properly, but the fact that those tabs are tiny compared to the width of the cable. And also latching up ala latches either side the cable socket lifted up to click in and hold the cable in place rather than push down to click would make less user error,  coz it latches or doesn't.",
        "Why didn't Nvidia just use normal pcie power?",
        "How likely would you say the 4080 will experience the same issue? I assume they did not have a chance to replace the power adapters for those already packaged.",
        "Thanks heaps for this, I have been having massive anxiety about using my 4090 since upgrading $3.5k in Australia and I did not want to lose it from a burning connector, Avoiding playing games, limiting my graphics and watching the performance monitor to keep the watts low, This video gives me some relief in the fact that I have it plugged in all the way, clipped and not bent at all so fingers crossed I don't see any issue ",
        "I doubt I will ever own a 4090. With that being said, I love that GN goes waaaaaaaaaay above and beyond most others when it comes to giving us real answers and deep dives like this. \nEven while I will likely never own this card, its still an interesting topic and almost sad/scary that its taking GN over major corporations who are heavily invested in this to provide this level of useful information and feedback.",
        "I have the Asus Loki SFX-L for my TUF4090 with the 12VHPWR crimped cable in an open xproto L.\nTriple checked fitting plug.\nThe only firework so long is the FPS-firework.",
        "just buy him a 4090 or send him a loaner? dont u guys have extra or capability to?",
        "Steve, you and your team are invaluable in the tech space. Thank you for taking the time to track this down. Proper failure analysis is not achieved by rushing things.",
        "I hope you sent the invoices to Nvidia man basically doing their job for them XD",
        "I can’t tell if I feel pain or pleasure watching a 4090 burn like that",
        "Just a big ass thank you here, for this video! ",
        "Great video. Thank you. You guys taking it to the next level . I am holding off on buying 4000 series due to this issue . Hypothetically , would you implement this part into aircraft electronics? The ERR is too high therefore this part is unsafe(just my opinion).",
        "for the algorithm",
        "Kinda makes me wonder why not use automotive connectors at this point... there are already many decent high amperage designs out there. The design of the connector it's more fragile. I wouldnt use after like 15-20 cycles of me plugging it in but also that kinda makes me wonder how durable are the sockets on the GPU side and are we going to see need to replace those sockets in the future ?",
        "Keep up the great work! You guys are at the top in trust and reliability!",
        "Really appreciate your fine work.\nI always come back around for this channel to get a more in depth, original and intelligent cover.\nThank you so much for keeping such a high quality level for so long!\nKnow that it does stands out.",
        "Also keep in mind that some resistors are made of carbon, so having carbon contamination on your connector is not good. You don't want a resistor in your connector, resistors are not good for passing large current through them. Also, as metal heats up, its resistance goes up, making it heat up higher and faster. It's a runaway reaction.",
        "These connectors should come with screws like the good old VGA cables.",
        "Really remarkable and well done investigation in regards to these cables melting down. Good work GN!",
        "Disco inferno!",
        "Don't need coasters, but I think the team deserves compensation for the production and investigation, and encourage others to also contribute.",
        "Amazing investigative journalism. You guys rock!",
        "The manufacturers should pool (so it's not conflict of interesty)  resources and pay GN for this work.",
        "Nice work. Check all your contacts in general guys! :P especially when building your PCs while drunkard",
        "Coming from Jayz audience on this matter, there is one thing in his video that I was hoping you'd test and that is if the heads of the wires that are soldered to that thin piece of metal inside of the plug (not the pins connecting to the gpu) breaking is a possible problem. Though now I don't think it is the reason for the melting pins like I did at first, it seems like an added point of of failure. What I mean is that if one of those pins breaks off from that metal plate, wouldn't that push the remaining wires well beyond their capacity and cause damage around that area? Because there is no way for the gpu/psu to know that one of those wires broke off, it will still ask for/send up to 600 watts through the remaining wires and (if I understand this correctly as a noob) overheat them with that much power being forced down the wires. Pin-to-pin cables do have this problem if the wires break, but in theory should be far less prone to it since they are without that metal plate. ",
        "I understood some of these words",
        "Thank you so much for that final monologue. It speaks volumes that the entire goal of this video series was consumer safety and a focus on actually getting a result rather than falling into the trap of feeling like you need to get something out. That was pretty much the best usage of constructive criticism I've ever seen of your peers without any outwardly hard feelings. Bravo.",
        "Thanks for the incredible work and findings! Once again GN raises the bar for investigative journalism and tech news. \n\nI’m glad this piece came out, now owners of the 4090/4080 can be at ease and enjoy their cards.",
        "2:58 GN successfully made an Apple logo smaller than 100 um.",
        "the 4090 is about  4300$ in Algeria. i cant imagine  someone  will buy it with  that price.",
        "\" ..... \" \"This Time \" \" ...... \"",
        "\"Use code THISISFINE\" XD - How deep into geek-territory is thát?...",
        "Whoa. It's almost impossible for a company to buy this level of analysis as a service. You're giving it away as \"journalism\". ",
        "watching him slide the plug in an then back out again without the lock even functioning really shows how bad these cables really are.",
        "So now we know the cause, what the hell are they going to do to fix it? We know it needs a better connector, but they have already made the dyes for these things. So how much extra is this going to cost the customer for them to fix it? it needs a secure fitting at both ends, flawless metal parts and wiring, all of which means extra quality control and in turn, means extra cost that someone has to pay for.",
        "This is fine",
        "Absolutely ludicrous attention to detail and honest, investigative journalism to find the root issue. No speculation, just facts. Also the balls to give constructive criticism to peers. This is why I am a Patreon subscriber, and it’s amazing seeing the gold tier level of reporting that comes from it.",
        "Thank you guys for all your time and efforts ️",
        "Look this was great; and provides a fantastic platform with actual data for further discussion.   Thank you all so much for doing the groundwork with testing and analysis that was desperately needed around this issue!",
        "Heh always trusted and knew amd is the best!",
        "I can fix all this. \n\nIt's all just crap on the car design. They needed a different bigger style connector. And a different mounting location.",
        "Does anyone know if a BeQuiet 1000W power supply along with the Bequiet 12vhpwr adapter cable is now a safe solution to power the RTX 4090?\nThanks!",
        "Basically just don't buy 4090",
        "when you fly that close to the sun your going to get burnt.\nThough looking at your two pin only test. i have to wonder if we are seeing a larger than statically normal failure rate or are we seeing a problem because we were looking for one?",
        "Best testing company ever! While I don't agree these tiny destructible dimples are the right way to go, I'm satisfied it was only the pulling out of the cable, causing an improper connection which anybody who's worked with electricity should recognize. Thanks!",
        "You guys go above and beyond what I ever expected a YouTube channel to go into!",
        "A robust cable adapter could fix this problem. Single output and four inputs. A 90 degree or 180 degree \"U\" shaped adapter would eliminate power cable bends (although cable bends probably wouldn't matter anymore with the adapter). Nvidia could engineer this quicky and put this issue behind them.",
        "Shouldn't you guys be wearing safety goggles during the destructive testing?",
        "You guys are rock stars!",
        "No apology needed for the TED talk, you are doing the work that others should be doing. Thank you for the honesty and thorough investigation. Thank you for being such a great resource!",
        "I really just wish you guys put time into the science behind your claims, you'd be such an amazing Source for these things!",
        "so high amperage parallel power distribution, across many small pins is a bad idea?",
        "I can trust the results from gamers nexus because of the testing methodology and the transparency in which it is presented.  Great  job guys.",
        "Is it okay that it's so damn hard to put the cable in place? Maybe it should be easier to insert the connector and have a sensor the validate the connection.",
        "Clean Loud Click Connectors. I always enjoys those high pitch and loud SNIPs as a connector fully slide home.",
        "Damn, Linus' lab really has a big hill to climb, unless they're purposely investing in testing machinery that has totally different goals than Gamers Nexus.",
        "I'm so glad I'm poor and can't afford any of the GPUs of the latest years!",
        "RTX BUTTER with a cable when not fully clipped",
        "Man i got so much respect for the work done by GN, admirable",
        "Thx for your hard work.",
        "So if my house burns down because of faulty wiring could that be reproduced  by pouring gasoline on the floor and dropping a match?  Results would be the same and reproducible.  Still think there can be other answers to the same question.",
        "Y derrepente salió una tarjeta de video que dejó en claro que la mayoría que lleva años armando PC's no sabe conectar un cable de poder? jajajaja AAAANDAAAAAA",
        "Why hasn't NVIDIA done this?",
        "I had a bad feeling about making a high current connector smaller. Creates more potential for error/failure especially when you have a cable that is meant to carry up to 50 amps - 8+ amps per pin. I feel like the better option would have been to make a full size 12 pin connector which would have still been smaller than having dual 8 pin connectors on a card.",
        "The fact that y'all guys took so long to release the video just to make sure that there's an actual problem it's something i really appreciate, love you  guys",
        "Holy crap! Unbelievable work. The effort and detail are insane",
        "Imagine sending your adaptor in only for Steve to figure out not only did you fail to seat it, but you pretty much played just the tip.",
        "Fantastic job, guys. Doing Nvidia's work for them.",
        "Some of your best work. Responsible and ethical and easy to understand.",
        "And if it were to happen with the 4080? If they already tried everything, what would be missing?",
        "Great content as always! I wasn't very worried about this on mine but am even less worried now. Think I'll still stick one of the temp probes from my Commander pro to the connector with a temp alarm just for some piece of mind. Thanks for all you guys do!",
        "Making the most expansive graphics card to date and having issues with a 1 dollar part (because it needed to be cheap and dirty), Cant be bent cant handle the load (wires look to thin for the powerdraw), dor a new connector it is a EPIC fail on all fronts even if supposedly only 0.1% goes bust it is still alot of people considering they sell the cards by the thousands!!!",
        "Great job GN, never tried this donation thingy on youtube before but supporting you seems like a good enough cause for testing it out.",
        "Jayztwocents definitely got called out here. His channel pretty much only exists because of his relentless sensationalism.",
        "I get wanting to give a balanced perspective but this still feels to me to be the fault of poor design, a power cable that give little feedback as to whether it's properly inserted or not combined with connectors that continue to draw power when improperly seated should have instantly drawn red flags especially knowing people were going to put stress on the cables due to the cards design. A properly designed cable should be idiot proof, if wall sockets were built like this there'd be house fires left right and Centre (atleast here in the UK plugs can't draw power if improperly connected which surely should be a key tenant of modern cable design). ",
        "This piece is sets an incredibly high standard for professionalism in journalism; the monologue in particular was handled incredibly well. I hope you continue to use this platform to curate these practices to newcomers in the space. Thank you for all that you do.",
        "So yet again the weakest point is the user...",
        "There's one thing I appreciate more than anything else from a journalistic source in today's society and that's integrity.  I really wish this level of dedication to giving the facts was the most common way that any sort of news was portrayed.  But absolutely have to give credit where credit is due and I'm glad I've found my way across this channel in my first year of getting into PC building and wanting to know what I'm getting myself into when buying specific components.  And it's an added bonus y'all are from my home state!  My wishful thinking has me hoping is a step towards Micro Center opening a store in NC somewhere.",
        "I have a 4090 and I don't understand why there isn't a click to make sure the cable is seated properly.",
        "you're a tech philosopher",
        "Those car battery connectors that require a spanner to tighten them should be mandatory on all GPU's in 2022.",
        "To be honest. I never really enjoy hearing your talking about things. Can't even understand why either. Maybe it's because you appear to be \"one sided\" in tech brands?\nBut, you SOMETIMES deliver well organized and fluid information that's to the point and incredibly easy to digest. Great job on this one.",
        "This bullshit new power adapter just seems like a bad idea.",
        "That is a problem with ALL \"Journalism\"(in quotes because most that claims to be is not imo). Especially in politics, but the whole \"2 party\" GPU and CPU landscapes makes it very similar with people in a way basing their \"Identity\" with a brand(party, faith, person, sports team, etc.) and then becoming almost desperate in their attempt to disprove(at least to themselves) anything negitive about that vicarious \"part of them\" because by adopting those other entity's accomplishments as a source of pride, they in turn will have to accept their failures/transgressions as well. I wpuld imaginepeople that are like that are not very good at processing their own failures, faults, or inaction let alone much larger, complex, impactful, and public ones out of their control completely. It's unfortunate that so many people feel the need to source pride from other's and/or things they have no part in controlling, such as race and/or Nationality. I wpuld personally rather have even a small accomplishment of my own than live through others. It's not like it really changes anything about the person by doing so. It's a tad delusional if you think about it. It's rather sad too.",
        "We need that electronic vehicle plug for these new gpus",
        "At 18:40, slowest playback speed, you can notice a small particle of something shiny, flying away from the connector, maybe, just when they pull out the cable from the card showing that it was not properly connected. Maybe a sign of easy delamination or metallic debri inside the connector.",
        "Doing great work again! Fire is no joke.",
        "Thanks for the video",
        "it's seriously impressive how high the quality of your investigations are at this point. \nwe need more of this in the tech space!",
        "I know you guys are busy but would love to see some GPU performance revisits when it gets slower. Particularly of the GTX 16 series and RX 5000 series cards. Thank you for all you're hard work!",
        "Here what I got... 1 simple team of a group of people that honestly care about PC in general and everything along with that have tested rigorously for a solution to a problem that was created by someone else and a limited amount of funds compared to Nvidia and yet GN has found numerous issues, and yet the people who make this damn thing can't figure the issues or they need more  \"time to investigate further\" yet just another prime example on \"if you want it done right u gotta do it yourself\"",
        "23:00 - That connector is way too long to have that tiny securing clip holding it in place. A longer or two securing clips would prevent wobbling and movement, if inserted correctly by the user.",
        "Inserts Jesse Yeah Science!!! Meme",
        "I don't like Jayz nor most of the other YouTubers for that matter. We really appreciate what you do, and the way you do it. I come to YouTube for useful information, I go to HBO Max for entertainment. That's just me.",
        "Whaat about melted native 12VHPWR MSI PSU? Any answer?",
        "It does seem to me, if you dont very firmly seat the cable connector, the power connector can walking itself out overtime through vibrations or tension on the cable by other cables or other internals weighing on the connector cables.",
        "Can't wait to see what linus does with his labs creation a love all this technical stuff",
        "The related products sent me :D",
        "Gives new meaning to the word \"foolproof\". Obviously Nvidia's design needs some work to be completely foolproof.",
        "Nvidia better pay you for this one. Like, literally, they should be asking you for an invoice. That analysis should have been their job, period. Stellar work as always, GN team!",
        "You are a Brütal Legend",
        "This kind of reporting is why I subscribe to y'all's channel. You do absolutely outstanding reporting--and muckraking--in the computer & computer hardware industry, and it absolutely shows. When this whole thing broke out, I was like \"Oh boy, GN's gonna HAVE to cover this...\" and y'all delivered. Also, I love a good objective failure analysis, and taking the already failed samples to a lab that specializes in exactly that was absolutely the best thing to do.",
        "How we miss the 10xx series...",
        "holy s**t that's a giant graphics card. Does that take up FOUR SLOTS??",
        "ありがとうございます！",
        "Ok. Now I need to be in clean room with laminar air flow with closed HVAC system besides constructing a mini nuclear power generator and become a billionaire to do it all just to use 4090.",
        "Guys, why people thinking they can run 15+ Watts thru small piece of metal? like 0.3mm*2mm*5mm with contact surface 0.5mm^2? They know about it when choose wires, but somehow forget about that when choose pins.",
        "this is why i buy ya'lls merch gotta support these boys they do good work",
        "This is all great, however, the connector didn't fail in past years but it fails now. What has changed? More power draw. Conclusion: this type of connector cannot handle the power. Doing some simple computation. 600W at 12volts is 50 Amps. How much is 50 Amps? Well, your car battery is 12 volts and takes about 50 amps to turn the engine over. It has a wire that is as thick as your finger and about 1 sq-cm surface area on the connector. Engineers learned this over 100 years ago.",
        "Cards were better off having 3 8pin connectors for multiple reasons. \nSwitching to a single 12 pin and have smaller gauge wire is only going to heat up the conductors at any point. \nIts just physics with electronics. ",
        "Bravo",
        "Hey Steve, are you going to do a quality comparison between the different aftermarket Brands of nvidia 4090s? Like between Zotac, Palit, Msi, Gigabyte, ASUS and other?",
        "Brilliant testing and reporting, thank you for putting this together from a neutral standpoint.",
        "that several minutes failures can power the fanless psvita for several days non stop!",
        "КОроче пора датчик температур ставить на коннекторы и восхвалять самые низкие температуры в какой-нибудь стрикс или суприм версии карт",
        "your content is pure gold.",
        "This video was the final push I needed to buy a coaster set. Thank you, GN crew, for your tireless devotion to getting the story right before you publish.",
        "NZXT: Our Cables set your PC on fire!\nNvidia: Hold my beer.",
        "Journalistic integrity is why I watch you guys and not a lot of your peers when it comes to trouble shooting serious issues. Thanks for the information :)",
        "Steve, I'm so damn glad my Patreon support money is going in to content like this. Sending this stuff to get X ray/scanned probably cost a pretty penny.",
        "A video about the issue from the melting connectors and a bonus code called THISISFINE is an interesting choice.",
        "Too many pins in a single body creates too much friction and this prevents full insertion and causes indiscernable latch feedback.",
        "You don't have to be an aerospace engineer to tell this was a bad idea, as soon as I saw the four way into one I knew it was going to be problematic and that was before I heard any of the melting issues.",
        "Good job guys love the content",
        "So it is mostly user error, thought so. .1% failure if still pretty high. 6 sigma should be 99,996%",
        "Steve and the talented GN Team:  Please, no sorry's needed in the pinned comment.   This is high-level reporting - the kind you would see in investigative media or, dare I say, industry or academic journals.  This is the level of reporting one would expect to see in \"paywall\" media or specialist scholarly publications that certainly are not distirbuted on social media platforms for free.   All that to say your talent, ethics and serious committment to the work has convinced me to buy as many GN coasters for my family and friends as possible for Christmas here in Canada.   I already have your tool kit but I'm sure Santa will be picking up even more goodies for me! ",
        "Current NVIDIA is what happens when you get too complacent at the top.  They think they can do whatever and people will buy it up, and they are mostly correct.  As much as I like them, I hope AMD stomps them in this new gen of cards.  Force NVIDIA to be good again.",
        "Nvidia: wait...lets just let the influencers figure it out.",
        "What if the power supply delivered not ahmps on that cable par wired is that just 1 pin was affected",
        "So, the pins are not long enough or thick enough to maintain a solid connection. This seems like a lawsuit could win in cases where damage to property happened.",
        "That was some serious analysis, sending to those labs etc.  That must have cost a lot.   Sounds like this is a rather low risk but still need to be careful and keep an eye on it when first installing one of these cards.  I do think they need to come up with a new standard for delivering power to GPUs though, 12 pin connectors are quite absurd and it will only keep going.  If they added a 48v standard to ATX power supplies they could perhaps drop this to a single 4 pin connector with a bit of room to spare.",
        "GN is a channel where you can find high quality content, a scientific approach and more importantly an holistic view of the matter analysed. Thanks Steve and GN's Team, your passion and dedication is something i can always look forward to.",
        "Okay I do electrical work and have seen many high voltage issues in joints/connectors. Things change a lot. My biggest question is does the cable only burn on that one end ever? If so there is probably many ways to fix that connection and lower its resistance. That’s the big problem looks to me along with arching. So fix those two things with just a couple easy hacks I can think of and every single one would be fine. But if I didn’t fix the issues before and during connection I would not trust it. It’s getting like appliances lol where the wire inside is so crap but they get away with it low gauge and many joints of low quality. Problem is not everyone is going to understand this that works in computers because y’all are just now starting to see any kind of voltage and ohh lol are y’all gonna learn lol. Only if everything could be a clean 110-130v at 50-60hz. For that we gotta pay gotta take dirty power change to DC and back to AC all with losses. Why tho? For it all to be able to use highest voltage where possible and there is proper way to insulate circuits and still handle heat. There’s a reason high voltage is used to go long distances but also a reason you don’t see it near as close to other circuits or grounds either tho. It’s also a way to use smaller wire at higher amps. Joints and connectors can be important tho after voltage goes up for many reasons. Also traces at higher voltages my god the distance they could arch if not properly insulated and all. It’s a lot different but I can’t believe they can’t even get 12v right tho lol. Problem is it’s 12v tho just go even higher lol. I’m no electrical engineer but I build a lot of toys and fix everybody products just about lol that’s if I can. But I have been so electrician many years so I get this quick and seems obvious too me. I’m joking about higher voltage BTW at least for now lol that’s another day and year. But everything within the connection bust be beefed up to lower resistance. Too much material bad too little bad and wrong materials used is what is causing this. It should be able to be partially connected and not heat like that especially at that specific point what about any other end of the cable? It’s nonsense so stupid of an overlook I just don’t get it. I guess some just never dealt with real amperage and ever had to learn about resistance in connections. That’s why we electrical guys real ones love to hardwire and some of us in certain situations even solder thing tin things we get a little more involved than the average electrician. Over the years tho we learn to tell a lot by feel. Also we use meters lol but still this is so so stupid never should be an issue stop allowing companies to use such small gauge wires at end points and just enough. Obviously sometimes you can get it wrong a little therefor leave plenty of overhead. That’s the issue why is it not bigger than needed of shoulda doubled the volts by now until you get to traces and things so close. I get the whole issue with arch and all but I can see places where voltage changes multiple times can be very beneficial but for carrying certain amps it’s almost a must and then what? Can we insulate things enough to keep them close at higher voltages? We will see which way all this goes has me really curious after they couldn’t handle ever 12v lol. I can’t wait to see the future to there so much to come soon.",
        "Thank you! Amazing content, highly professional! Love you channel! I think you guys are top tier tech channel",
        "Thank you for covering this properly. There's so much information being presented as fact that I was very deceived by all this mess. It's really hard to check sources on this issue right now.  It's also been really interesting that no one was able to reliabky recreate the failure until now.",
        "One thing to note. Im supprised that cutting down to 2 pins didnt cause a thermal issue. Yet a fully connected plug could fail on one pin.\nAs you noted, the power + resistance causes heat... Yet. power also prefers the path of least resistance. Meaning that if each pin is equal and one is not. The equal pins should take on a higher load than the failing pin. As the power prefers the least resistance... So in theory even with 1 bad pin the power should balance out. Which suggests theres something really funky going on on the receiving side. Maybe the card favours certain pins over others?",
        "Just want to say excellent job guys.  Real quality engineering going on here (used to be a QE myself). In most scenarios, this type of \"deep dive\", \"FMEA\" does not occur until insurance companies and government agencies get involved, after people experience injury and lawsuits are afoot.  No sir, not here in the Gaming PC world.  ",
        "Nice reporting! This is a pretty valuable service to the consumer space, bringing clarity as to what not to do, but also being clear and accurate on fault and mitigation.",
        "It is a stupid connector, solving a problem that didn't exist.",
        "Good science takes time, open minds, collaborative expertise, and sophisticated  - and often expensive - testing.  Steve and the team at GN are exemplary scientists!  The \"Ted Talk\" was very necessary and appreciated.  I hope other content creators will learn something.  I just ordered my debug coasters to complete my collection and to make a tiny dent in the expensive testing that went into this most excellent video.",
        "Incredible work. Have barely read 10 resposnes so I'm sure it's been said though it's highly likely that the lack of positive confirmation of connection by the plug clicking into place leads to the connector working its way out of the socket over time. Particularly if there is directional physical strain on the cable in any direction. I've similar failures before on 6 and 8 pin pcie connectors at both GPU and power supply end of the cable and put it down to cramped conditions and my own laziness for not ensure the plug is properly seated. Pretty sure I had a molex connector melt once too (yes I'm old) though that was just overly ambitious current draw.",
        "Excellent work!! PCI SIG needs to go back to the drawing board on this one.  Just too much power flowing through such a small surface area.  The design is (apparently) difficult for end users to use safely.  Power connectors should be idiot proof.  Especially when carrying this much power.",
        "Sorry but like the technician I am I know why this connector is failing all the time, imagine a video card demanding 10-20 amperes and going through a finest pin and terminals the most fragile or the first poor connection will overheating and finally be burned... Electrical physics my brothers, and I don't know what's going on on the technical department from nvidia",
        "Finally, someone scientifically gets it right by actual testing and not by guessing(theorizing). Good job Steve and all the crew at Gamers Nexus.",
        "watch were air flow comes off fan if look you see hot air hitting side pins so when card starting getting up temp hotter pins get they build box around pins or chance way air flow so air don't go near pins it poor design of cooling fins. have look around pin area watch heat go up as card starts get hotter u see. why don't you make a out of box design with pins and connector find way draw same power as video card find if just pins and connector my be over heating or design of cooling system.",
        "Never paid any money on YouTube before, but this was such insanely good work I couldn't not. You guys are the best.",
        "hopefully nvidia pays you for doing their r&d for them :P",
        "Eh! Just install it in an NZXT H1 with an exploding Gigabyte PSU. It'll be fine.",
        "Nvidia should be paying you MILLIONS! You saved them so much money in testing and engineering costs. While also probably causing millions in loss over deserved negative press ;) Hats off to everyone at Gamers Nexus. What an amazing journey to witness as you and your team have become the gold standard of tech news, hardware review and most impressively, enterprise level testing and evaluation.",
        "RGB Fan for Powercables: when?",
        "Nvidia thanks you for doing their job for them.",
        "The work you're doing here is gonna make a big difference!",
        "\"JUST PLUG IT BETTER \" lol it s like the \" hold the iphone in the correct way\"",
        "Anything designed to carry significant current and be operated non-professionals should have some sort of safety system to prevent this (sense pins, shortening pins required for operation that dont carry current, etc)",
        "The solution on this problem is siple. The manufatures just need to separate the power conector on 2 x 8 pin like before and this problem will be fix. Now there a to many pins in one conector wich is a too close together wich made a lot of heat.",
        "When a youtube channel do more engineering work than the producer (Nvidia) itself.",
        "Looks like a Dodge Dakota blower resistor. Air gap = carbon with each startup and soon enough you're carbon arcing between pins.",
        "I bought merchandise from GN because of Steve's last video on this ... beating Nvidia to the punch on their own stuff.  Though I returned my 4090 to Newegg already, I'll feel better about a potential future 40-series purchase.  Thanks Steve!",
        "Great thanks to the Failure Analysis LAB. Excellent work and awesome gathering of data and information and reporting from GN!!!",
        "Nvidia needs to slow down, they're really turning into the bad guys pretty fast. Been an Nvidia buyer my entire life, on the verge of buying an AMD next upgrade, doesn't feel right buying from Nvidia.",
        "Nvidia should just integrate the dyson sphere required to power a 4090 into the gpu so you dont need a power cable",
        "Continually amazing content and amazing attention to detail! <3",
        "I have a 4090 gaming trio and the very first thing I made absolutely sure of was a complete and firm plugin on the adapter. I even double checked that the clip hooked onto the small plastic latch. I've opened and added parts to my PC several times since getting my 4090 as I'm adding more RGB shenanegans in there and once or twice I check if the cable is burned up. Fortunately there's no signs whatsoever that it is so while I do think this design is fundamentally weak and vulnerable to failure, and Nvidia/Intel should've done a lot better I also think there IS a way to do it right and safe so you can just enjoy your GPU without worry.",
        "I think you should publish this investigation. This is almost academia standard.",
        "This sounds like a lot just to plug a GPU in",
        "Without Steve/GN and other YTers getting big enough to afford tests like these, we would be stuck with whatever BS marketing we get from major companies telling us that everything is daijoubu. Thank you GN for investing your time, energy and finances into important topics that give us the truth of the situation.",
        "Thank you, GN.",
        "nVidia is really powerful. There is so much care about this theme in the professional circuits. That's the way it should be. But what if this fail were happening on AMD's cards?.\nHere there is a clear design mistake that should have been detected on internal lab tests, at least in the mid stages of the product's deveopment.",
        "With the adapter I pushed pretty hard and never got a click.  I got a click with the cablemod cable",
        "You guys really take everything much further than any other channel in terms of your reporting. Great work.",
        "can you not xray the cable whilst on  with not plugged in properly to show the arcing across the connection  to show why its heating up be good to see ?  , arcing across bad joint will cause heat quickly",
        "find it VERY HARD to believe there's hundreds of users unable to notice a cable that's half sticking out. there must be some other failure mode at play",
        "wow; great work",
        "The amount of testing on this video just proves why the RTX 4000 series is a big fail.",
        "Outstanding works sir, this is the depth of analysis we should be looking for when delving into burning issues (pun intended).  I feel like all 4090 and soon to be 4080 owners owe you a payment, not to mention nVidia themselves, whom I doubt did nearly as much as you guys other than waving the issue away as they always do in annoyance.",
        "incredible work",
        "Well, I guess it's time to update that \"GPU testing experience\" graph to \"out of the chart\" level",
        "I love how well you did this work. Very well done.",
        "I think that the failures related to foreign object debris are a manufacturer design flaw that allows for a gpu power socket to sit upright in an environment where metal shavings, old thermal paste, and who knows what could fall into the socket, helped along by a lot of moving air and system vibrations.",
        "This may be the most important channel for Pc analysis. I hope this sets a precedent to really know what you're paying for, and hopefully leads to a future where everyone can be informed on their tech.",
        "I have said this before, I'll say it again. I should not have to buy extra things to get a product to work properly",
        "Probably not healthy to breath in that stuff as it burns ",
        "Am I the only one that's been hearing the \"tinny\" audio issue in the left-channel of GN videos for the last month or so? It seems like it's just the audio coming from Steve's lav mic in videos at times but it might be something besides that. Actually it seems like all the audio in this video - but I don't hear it in other videos from other channels, just GN. The audio seems fine except with an extra layer of highest frequencies on it, only in the left-channel. When I play the audio back in audacity at half-speed it's like there's a really high frequency echo in the left channel, but it happens in the video all over the place, not just in one place where one person is talking, which leads me to think it's a recording hardware issue somehow.",
        "I can't express how valuable your unbiased, science-based approach is. I know you know how great your channel is and everyone here is very grateful for the effort in each of your videos. Thank you!",
        "The fact that the RTX 4090 draws 8,3 Amps from each one of the pins of the connector that are officially rated for 8,5 Amps is a shame. And I don't even talk about a GPU that would have been overclocked with MSi Afterburner for example. It's so close from the limit. No margin ? Who is stupid enough to forget about this ?",
        "Looks like he didn't plugged the connector all the way in.",
        "New Jimmy intro sounding even better than ever. Definitely my favorite =:-*",
        "This is why I'll never get tired of supporting GN. Thank you for all the work Steve and crew!",
        "Sorry tech jesus, but that conclusion is the most anti-consumer and pro-corpo I've ever seen from you.\n\nYour sample of 1 case of an \"extremely\" badly inserted adapter is no indicative of anything, here people have reported cases of melting with good insertion, click and everything.",
        "if the retaining clips were at the edges rather than the centre it would be easier to check if it was fully inserted and stop it being pulled at an angle.",
        "Excellent video as always.\n\nI can't tell you the number of times that I have purposely and deliberately burst into an emotionally charged discussion and FORCED it to become a data-driven, evidenced-based discussion instead and then watch all of those people who were so emotionally charged, fissle out of said discussion because they COULDN'T provide the data nor the evidence to back up their statements nor claims that they were making.",
        "I now want a thermal screen computer case.",
        "Imagine playing Super Hot.\n\nCurrent GPU temperature is...",
        "Thanks a lot for this! I work at an archviz company and we upgrading all our workstations to 4090's as well as most of our clients.\nMy team actually had sleepless nights over this, great to have it finally figured out.",
        "Why not just having locking pins like usb c, display port, and hdmi have?",
        "Not for nothing but knowing and working in the electronics field from car audio installation to micro soldering repair. Nvidia is taking 4, 8 pin high current PCIe connectors and adapting to a 12+4 high current power adapter that the wires are thinner and really cannot handle that kind of wattage. From its inception, it was a bad design and idea and bound to fail.",
        "This is the first time that I was ever felt compelled to make a donation to a content creator and deservedly so. Truly amazing work from Steve and the GN team! The community is so lucky to have you guys and this video proves that no one even comes close to the dedication that you guys have to straight up factual journalism and responsible reporting.",
        "Wow! Awesome job guys! The work y’all put into researching issues is truly unmatched.",
        " Stop  buying  nvidia.",
        "As a 4090 owner, I really appreciate you looking into this matter. Your professionalism is impeccable and you really are at the forefront of technology journalism. Thank you for your hard work.",
        "Nvidia should reimburse you the costs of all this analysis. I bet their engineers will see this and use some of the findings in solution/upgrade/next gen.",
        "If they designed it in a way that it's easy for end user to make mistakes like this then perhaps it's their fault.",
        "as a mechanical engineer student, im just loving with all my heart all of these testing results, jeez, this is amaaazing",
        "GN, you guys are awesome. \nThank you for all the hard work, looking for facts, and doing it correctly. Like old time journalists and reporters, not fast but thorough. <3",
        "I expect Jensen Huang to send Steve a leather jacket for this kind of work.",
        "Thanks for putting this amount of effort in to get accurate results!",
        "Bruh there are car companies that don't even analyse their produce failures as hardcore as GN, this is some aerospace engineering level shit",
        "holy moly, you just went full scientific on it and it is glorious. Thank you all at GN!",
        "I never thought I would see the day that Gamer Nexus running pr for Nvidia!",
        "We need 220 v uk connector",
        "I'm wondering if the problem is people trying to jam these massive cards into their existing cases (or new ones that aren't big enough) and then not having room for able management and/or are just trying to get the cables out of the way for airflow. Then things get pulled tight in the process and things heat up and melt.",
        "The saddest part of this WHOLE fiasco is that you guys have to do these tests at all! I'm sure \"some\" will agree that this should be Nvidia's job... right? Thanks for the great content yall. ",
        "I'm still taken aback at what a truly massive card the 4090 is.  It becomes even more obvious when seen out of a case like this.",
        "So basically this issue has potentially (under the conditions you mentioned) always existed for any connector but exacerbated by the high power usage?",
        "I find, the more pins a connector has the more annoying it is to plug in or out, like the mainboard 24 pin connectors being a pain. Just had to test a failed system with different PSUs and the force I had to apply to get these connectors properly clipped in and to remove them again was crazy...",
        "Test 3090Ti vs 4090,",
        "Love the hard work and dedication! I literally told a friend yesterday I was waiting to form my opinion on the cables until GN covered the topic. Well worth the wait!",
        "ust a follow up to my post about Newegg. They didn't answer my E mails about the matter. The card wasn't shipped from them in California as was listed but, by some third party seller in Georgia. And of course they lied about three day shipping. It's taking 6 business days. The only good news is that I bought through E Bay, so should have no problem with return. Definitely will avoid them in the future.",
        "S TIER journalism right here! Thank you, GN team, for the top-notch work, as always. Nvidia should cut a nice paycheck to you guys for this level of investigation! \nCheers!",
        "I love you guys: this is fantastic content. Sent you a donation through your storefront-- what a good idea to have a way to donate directly without buying a product (your products are cool, but I just don't need more Things(TM) right now [except more amazing PC-related youtube content, of course!])"
    ],
    "comments_disabled": false
}