{"video_id": "ig2px7ofKhQ", "comments": ["Sorry it took so long to put this all together! Thank you so much for the interest and patience the last few weeks on this story! USE CODE 'THISISFINE' on the GN store for 10% off through 11/23/22! https://store.gamersnexus.net/ - grab a GN coaster pack, PC building modmat, mouse mat, shirt, or more to support our work and get something quality in return!", "Thanks for all of your hard work Steve and team!\n-Adam", "I love seeing videos like this. Makes me happy to see a legitimate thorn in the tech industries side, holding them accountable.", "As simple as the issue was, I appreciate that you guys ran multiple other tests to rule out everything else.", "This is the best investigative journalism I have ever seen any media outlet perform in the IT industry. Usually they would just sellout (won't name names) to manufacturers or advertisers.", "If I where a QA Engineer at NVidia I would hit that subscribe button. You pretty much did the cause and correction action process for them.", "In my opinion, we are all extremely lucky to have such a dedicated and thorough group as Gamers Nexus. The videos you all are putting out are fantastic.", "GN is literally irreplaceable at this point. Thank you Steve and team for your dedication ", "Rare to see such in depth and professional investigation from a third party! Appreciate what this does to help inform consumers.", "Steve is as legit as it gets.  I love GN and always trust their information, testing and opinions above others. I watch the other guys too but feel like these guys are next level.  Thanks as always and keep up the great work! ", "Really appreciate everyone at GN for putting in so much effort into this. You always try to deliver accurate information, and I know you would correct yourselves if you were wrong. Thank you for going above and beyond for us all ️", "Stop apologizing for something that isn't your fault. You did the testing and show a factual result with real time proof, anyone who has opinions or hypothesis with out proof is simply speculating. You don't have to apologize. If they get mad is on them not you. Also thank you for the time spent making this information available to everyone. Keep up the good work.", "Great job! Thank you for taking your time, researching, reproducing and fully understanding the issues. If only other sources (main stream media included) would do this. Thank you GN.", "I’m no cable expert, but in regards to not properly plugged in this should be easily avoided if a single signal pin was shorter and not allow current to pass through unless it has contact..", "Doing my small part to ensure this video gets more views and thus helps more people!\nGN, you do fabulous work, and I've come to not only enjoy your content but also factor in your opinions on hardware due to videos of this caliber.\nNot many reporting sites/youtubers/reviewers go to the lengths that you do, let alone attempt to stay as facts focused as you guys do. Not only does that speak to your dedication to the truth of the matter you're investigating, but it also serves as validation to each person who views your videos that you are, in fact, reporting on legitimate findings and not mere speculation.", "I appreciate you guys adding microscopy pictures into this. Hopefully that’ll attract more enthusiasts into the field! Keep up the great work.", "as a mechanical engineer student, im just loving with all my heart all of these testing results, jeez, this is amaaazing", "I praise you and all who contributed to find this issue in this video. You have saved many uncountable lives specially those who do Folding and leave their PCs ON overnight. \nThank you", "Incredible work. Thanks for all your team does for this community.", "The fact that y'all guys took so long to release the video just to make sure that there's an actual problem it's something i really appreciate, love you  guys", "That was not going the extra mile, it was going a full marathon more !\nThank you for the very thorough testing and recap! The lab invoices must be *$#% costly, wow \nAm I a bit disapointed it's not a big failure from Nvidia? Well, I'll only answer with my lawyer ", "Thanks team GN for your dedication to the \"tech community\"  ", "I watched many of the community’s videos about this issue, was aware that a lot of it was sensationalism, but was also grateful to be aware of the issue. All that said, Gamers Nexus is who I look to for a real understanding of the issue and this video is a great example as to why. I am glad the time needed was taken to do the research correctly. Thank you GN for all the great work that you do!", "Thanks for doing this; this is awesome. Hope you guys grow and continue to put dedication in as tech reviewers/auditors/etc., or whatever other opportunities comes your way.", "As an early 4090 owner it's been a stressful month to say the least, I love your content and appreciate the hard work you put into them. Thank you.", "This is why I'll never get tired of supporting GN. Thank you for all the work Steve and crew!", "Great Job GN!   Thank you for working so hard to find the cause of these issues!   Your laboratory and scientific testing methodology may be 'slow' but science is not usually fast.  Keep up the great work!", "Definitely appreciate the deep dive and all the thorough testing that you did for this. Some of it goes over my head but it is great to have the information to point people to if they are considering getting 4090's and such. I agree it is a bit frustrating that people just put their theories out there and without confirming it by getting a failure just decide to pose it as fact, but it is the internet lol. Always gotta take everything you see and hear on the internet with a grain of salt... which is probably why the internet is so salty about stuff all the time come to think of it lol. Thanks again!", "Thanks to all of the GN staff and hats off to you guys, this was a very overwhelming piece of content, the amount of work you  guys have put in is insane and very very thorough, again thanks a lot <3.", "Steve and team, you guys may be specifically tech journalists, but you honestly can set the bar for all categories of journalists with your level of dedication and integrity.", "The amount of work going in these testing is phenomenal, i hope that you could influence the industry more with your dedicated work :)", "Appreciate your fight for responsible reporting. Beyond admirable!", "Amazing job covering this. Super in depth and well explained. You guys are awesome!", "I know you guys are busy but would love to see some GPU performance revisits when it gets slower. Particularly of the GTX 16 series and RX 5000 series cards. Thank you for all you're hard work!", "Wow Steve, you and your entire team deserves so much for this. Imagine what can you do with millions of dollars or with the resources that Nvidia has. How the Euck they do not test this.", "Man i got so much respect for the work done by GN, admirable", "I really just want to say thank you for doing this public service! I feel like you have hit the nail on the head with this one. Excellent reporting, excellent scripting and explanations. Will you go indepth with the nerdy science of the failure analysis lab?", "Steve, I'm so damn glad my Patreon support money is going in to content like this. Sending this stuff to get X ray/scanned probably cost a pretty penny.", "Thank you for your contributions to journalism/reporting. The world is safer with folks like you in it who research and study computer safety hazards even when many manufacturers and regulators aren't interested.", "Unbelieveable what you guys are doing. Really great job!", "Congrats. You guys deserve all the love and care for the HUGE research!\nYou're always my go to channel. You've earned my trust over and over again!", "Thank you for your hard work and for having us informed with proofs, passion and dedication.", "You guys go above and beyond what I ever expected a YouTube channel to go into!", "Your team's exhaustive and scientific approach continues to raise the standards of technology reporting, thank you for your continued hard work", "This is nuts (in a good way). Have to appreciate GN with how they are always thorough and try to get to the truth themselves.", "Keep up the great work! You guys are at the top in trust and reliability!", "Incredible work Nexus. Going over and above, to get to the truth of the matter.  Appreciate your work.", "what an incredibly in depth analysis of this issue. Well done Steve and team!", "This kind of in depth analysis and wonderfully exhaustive research really makes you the Carl Sagan of the pc hardware community.  Thank you for doing this!", "Great job Steve and the GN team. As an engineer myself that has had to do substantial failure analysis like this, people do not realize the amount of time and effort that is spent trying to recreate failure modes. Consulting with experts and the trial and error involved wit reproducing failures all take a ton of time. Most people, even engineers, also struggle with jumping to conclusions and not following the data to consistently reproduce a failure. This often results in fixing nonexistent issues and missing the actual failure mode. Excellent, excellent work.", "thank you really really much guys for this intensive/extensive in depth testing ^^ \nyou all are doing a great job and i love your content \nkeep up the good work :3", "I love to see a tech channel working with professionals. Very professional of you guys.", "Steve, its really awesome that you guys went the distance to bring us this information. The sad part is, this is exactly what Nvidia should have done in their QA testing. Very sad that they did not do this or go to these great lengths to make sure these cable are safe for the consumers.", "Really remarkable and well done investigation in regards to these cables melting down. Good work GN!", "Steve and team have really done a Batman-level analysis, x-ray, spectrometry, thermography, and what not. It's almost like they are the real life version of star trek's tricorder!", "Thanks Steve. Whole GN team is a pinnacle of quality IT journalism in any cases, like this one. Keep it up", "Thank you for covering this properly. There's so much information being presented as fact that I was very deceived by all this mess. It's really hard to check sources on this issue right now.  It's also been really interesting that no one was able to reliabky recreate the failure until now.", "You have put my mind at ease now with this video and most definitely a lot of other buyers of the 4090. \nThank you for all your hard work and dedication! ", "Great work and great video. It makes me wonder if NVIDIA and the like took the time to employ your methods and a lab.  You would think that they would have the biggest need for knowing what is happening. I'm pretty sure they have more resources and money to invest in this research and testing. Anyway, I'm glad you are here doing the work that needs done!", "Super cool video and thanks for the persistence to find the answers, awesome stuff as always! Just bought a 4090 and to be honest I'm not worried. There's more chance of something breaking in transit, so many people have blown this out of proportion, appreciate you keeping it real! ", "Imagine how much better off the world would be if areas such as politics, corporations, and other shady entities had this level of credible, detailed journalistic investigation.\n\nUnfortunately for my pipe dream you guys have found great success in the PC sector. Feels like one million subs wasn't so long ago, and pieces like this are why you're creeping on two million so quickly. Awesome work. Glad this community has you guys.", "Thank you for existing and always accepting nothing but the truth, for doing all the hard work of gathering the data and presenting these facts. We love you guys!", "Another fantastic video, thank you for the unbiased well created reviews <3", "No other PC tech channel is this dedicated. Absolutely no contest. GN is the cream of the crop.", "Man what a high quality piece of content we have here. Awesome video! Also i think the ending monologue was really necessary to say the least. Keep up the good content :) Thank you so much for you hard work to all of gamers nexus!", "I absolutely love how GN puts themselves in the way of danger (even though they obviously have high safety standards) in order to find out the truth, so we don't have to. Makes more mighty fine content, and hilarity you'll only find with Steve's personality  not to mention his was of making highly complicated processes understandable to the obvious noob (which would be me )", "I'm still taken aback at what a truly massive card the 4090 is.  It becomes even more obvious when seen out of a case like this.", "This is extremely well done.  Thoroughness of the reporting as well as the detailed analysis is top flight journalism.", "GN, you guys are awesome. \nThank you for all the hard work, looking for facts, and doing it correctly. Like old time journalists and reporters, not fast but thorough. <3", "It's crazy to think that you went through all of this effort instead of Nvidia just admitting and fixing the very obvious issue that doesn't even need that much science and research to see that there's something wrong with this cable. But I'm glad you did for the sake of informing customers. Thank you.", "There's one thing I appreciate more than anything else from a journalistic source in today's society and that's integrity.  I really wish this level of dedication to giving the facts was the most common way that any sort of news was portrayed.  But absolutely have to give credit where credit is due and I'm glad I've found my way across this channel in my first year of getting into PC building and wanting to know what I'm getting myself into when buying specific components.  And it's an added bonus y'all are from my home state!  My wishful thinking has me hoping is a step towards Micro Center opening a store in NC somewhere.", "Nvidia should be paying you MILLIONS! You saved them so much money in testing and engineering costs. While also probably causing millions in loss over deserved negative press ;) Hats off to everyone at Gamers Nexus. What an amazing journey to witness as you and your team have become the gold standard of tech news, hardware review and most impressively, enterprise level testing and evaluation.", "I have never seen this channel until today. I haven't been in the PC building game in over 10 years but I am planning on building a rig soon which is probably why this was recommended.\n\nI just subscribed because I wanted to say this is amazing! I'm no expert but a lot of this stuff isn't even covered out in the real world or like you said much of it is speculation and not fact.", "As a paranoid 4090 owner, thank you. Kind of crazy that a third party has given us more info than Nvidia themselves.", "Thanks a lot for sharing this valuable information on the cables. Appreciate the hard work and effort you have put on to help us out.", "Thanks for your dedication. Without your hard work big corporations like Nvidia could never be challenged in the past.", "Never paid any money on YouTube before, but this was such insanely good work I couldn't not. You guys are the best.", "Well done Steve and GN team. Invaluable content. This is solid and dedicated scientific lab work. This was an outstanding video about a melting hot (pun intended) topic. Thank you all for your hard work.", "Steve and his great team at Gamers Nexus continues raising the bar of what top level tech journalism should look like.", "Whoa. It's almost impossible for a company to buy this level of analysis as a service. You're giving it away as \"journalism\". ", "Simply incredible coverage. A service to all PC gamers.", "Fantastic job, guys. Doing Nvidia's work for them.", "It's videos like this that have a direct positive impact on the world and our lives. Thank you sir!", "Technologically,  we would be in the year 3022, if the world was more like Gamers Nexus.\nIncredible, simply INCREDIBLE !", "I feel confident that I have never used an nvidia gpu in any of my builds. Thanks for this educational material.", "This is my very first time donating to any YouTuber in my 10 years watching videos, and watching the entire video, being entertained and informed at the same time is an amazing accomplishment. I am well informed about the issue and have been enlightened. You guys deserve any donations for the countless hours you guys did to bring an informative and objective light into this issue. Keep it up and I will continue watching your guys' content!", "Terrific real world analysis/ testing pushing through all the rumors and general fear of that issue here very informative!!", "When your customers do more rigorous product testing than the company that makes the product do. What a time we live in.", "Brilliant testing and reporting, thank you for putting this together from a neutral standpoint.", "Great job guys. Your time and efforts are truly appreciated.", "Wow! Absolutely superb investigative reporting!! Thank you and your team for this!! Great word smithing the monologue, it had to be mentioned. Cheers!", "You guys keep blowing me away with how detailed your work is. Really appreciate you all going the ekstra mile to make sure its done right.", "I love the spray fire extinguisher in the background...good idea :) As a hands-on EE I've done my share of melting connectors and burning traces. Kudos on the depth of testing.", "I wish this level of investigative journalism and integrity existed in other parts of the media. Excellent report.", "This is above and beyond what other tech channels have done.\n\nFantastic analysis and video on this issue.", "This is why I enjoy what you do. You make sure what you say is right (as best you can). And if something comes up that says otherwise, you test, and if at fault, admit it. True scientific approach. Even if it annoys others. And is also why you’re so well respected among peers. Even if you say something that may ‘hurt’ a peer, it is out of want for what is right to be done, not malice. And why when most of said peers come under that scrutiny, they respect it. They don’t feel it an attack, just a course correction.", "Excellent job. Ask any electrician and they will tell you a loose connection equals heat. Love your hard work and dedication in finding the truth.", "You made 4090 owners sleep better! Thank you Steve and GN team for all the effort invested. ", "Love the deep dive and research done on this in order to get to the bottom of the issue. A little devils advocate, but if jay didn't cover it the way he did would we even have this video right now or others? Just something to add. Again great reporting as usual GN has become a lot bigger than just a youtube channel.", "Thank you for your hard work and for making sure to take the extra time to overview and reiterate things in the conclusion.\n\nI really appreciate that you work to get good information, draw good conclusions.from it, are transparent in what you do and the limits of it, and present your findings in a way that is through, followed by a strong summary in the conclusion."]}