{"video_id": "iYJr9pZxSPM", "comments": ["Only people who didn't come from tiktok are allowed to like this", "This just proves how good of an animator he is by making this whole video an add at the same time", "god i’m so proud how far he’s come but i’ll still always miss his old animation style and vids :’)", "From where he started and where he is now, James has really stepped up his animation game!", "Never thought James would do a happy meat farm video but I like it", "I like the idea that his merch is actually grown in a farm. Plus that ‘horror twist’ at the end was perfection", "Seeing how far James has come with animation and story telling is just… MIND BLOWING", "James should start making mini horror vids like this where he lures more and more people in to make those lava lamps from them", "James' voice acting, creativity for a merch plug, and entire animation team is overflowing with talent damn", "Friggin love the turn to analog horror and the way he did it was perfect. Keep making amazing content James ️", "Suddenly James proves his abilities as a horror creator a week after Halloween\n\nEdit: two weeks", "This went from merch drop to horror...I LOVE IT", "Never knew James had the ability to pull off a cursed, horror ending like that. Meatcanyon would be proud", "I love the fact that he was able to make a creepy short story about his merchandise, that goes to show how creative he is", "Can we appreciate how James can just turn a sweet, wholesome add into an animated horror story", "I love how this is thoroughly animated and cartoon James’ mouth opens and closes but he still doesn’t physically pronounce things in sync with James’ voice. Keeping the tradition.", "I'm excited to see how many YouTubers get in on the muse films. It's really cool to see it animated", "It's awesome how he's making different genres he's really improving on his skills", "I absolutely LOVE this!!! It’s so reminiscent of an Omega mart commercial! Absolutely amazing animation you guys! Keep up the incredible work!!", "I never thought I'd see the day James would do actual horror, but y'know what? I like it!", "This was so funny and perfect because while he was promoting his merch he's also got this little horror story up his sleeve that is super entertaining", "I like how the mouth doesn't move when James talks. it adds to the horror.", "That horror ending was like backrooms level !", "Suddenly James proves his abilities as a horror creator a week after Halloween\nEdit: two weeks", "Its incredible how much this dude has improved over the years", "I like how James tried to add a horror twist but It’s hard to pull off with his art style", "Wow! That was truly amazing! Great work!", "This is the perfect blend of humor and horror, well done!", "Congratulations on your show you deserve every good thing that happens to you", "And this is why we love James, he managed to take a literal merch ad and turn it into a genuinely creepy and cool video. James, my respect for you is infinite.", "Wow the production quality on that one! It really looked like it's been made by a whole studio.", "I love your show please keep making more it’s really good", "Rest in peace techno we all love you and all of your content. Fly high our hero you have done your job in this world :", "This guy is able make  horror animation how impressive", "The slow build up descent into horror in this animation is GODLY.\nGood job James, ya gave me a good chuckle. You do know how to make people uncomfortable lol", "the animation gave me chills.... great job man", "From the first weird part when Odd1sout takes the dude into the basement type thing immediately got texas chainsaw vibe. Well done on making this creepy and cartoonish at the same time!", "as a longtime odd1sout fan, i can confirm he grows the freshest t-shirts", "I absolutely love how much james has come over the years but i feel like the old simple videos with interesting stories were more fun to watch", "This is the best thing I’ve watched today by far. Nice job james", "Only Theodd1sout can pull off merchandizing while the creepiest stuff is playing", "I never knew a 2-d animation could be analog horror, much less a merch drop! Absolutely brilliant work!", "That was both hilarious and terrifying ", "This is the most funniest ad ive seen on YouTube its got that funny but weird vibe also this dude seriously got me in to animation with these videos he inspired me alot", "the Odd1s family farm should become a story arc,  this has so much potential. Good job, James! :D", "This is so well put together! Love the backgrounds!", "Good job on the show, me and my sister love it lol ", "Can we just appreciate how much work and time is put into these videos to make our day, huge respect", "That's good when you have that glitchy thing in your animation. That's fantastic!", "It’s so amazing to see the improvements he has made, and how he can sell his merchandise while telling a good story.", "This is the best horror animation I have ever seen! OMG goosebumps all around. Loved it James ", "This was actually terrifying, kinda, to watch. good job", "Now that’s how you sell merch! Bringing in that eerie atmosphere and making it a whole video instead of a shameless plug, and the throw back of “wear your seatbelt” fantastic all of it", "Can we actually get a odd1sout horror game now? That was insane and incredible", "I’m convinced he’s going to make a animated analog horror series, and I would watch all of it.", "I've always wondered, what platform does he use to animate?", "only James can pull off a scary horror merch ad like this. theres no way any horror game/movie/tv show can pull something like this off.", "Leave it to James to turn a merch drop into an analogue horror mini-film. Man, those chickens were like something out of a nightmare... shivers", "James still manages to make his ads entertaining", "Add another minute, and this could have been the Halloween episode ", "Just imagine if James' short animated videos just immediately got filled with intense lore.", "This gave me HEAVY happy meat farms vibes. Best merch add ever", "Well done, James and team! This video is pure Odd 1s Out Gold! ", "the sheer amount of lore in this", "this is probably just the best attempt anyone has made at making a whole video on plugging merch, something like this will never come around again. It's just beautiful.", "James bring some great stuff out in videos and lore", "This just turned into an analog horror video and I love it", "Hey James! Just finished watching 16 episodes of your Netflix show! I’m so glad u were able to come so far!", "The fact that his youtube channel has better animation than his show tells a lot.", "I’ve always loved horror and disturbing content and this was perfect. IM BUYING ALL THE MERCH NOW!", "Nice analog horror dude. Absolutely amazing.", "Honestly, James could actually be a great voice for a terror villan", "james has gone from a relatable dude with a normal life to a nonrelatable business man with lots of merch, series and stuff. I miss when it was just him, his stories and millions apon millions of views", "This genuinely looks like a Happy Meat Farm video, and I'm very certain James is sponsored by them. I have a theory that the jacket monster is actually a muse, just, well, wearing James's merch.", "This has some uncanny resemblance to happy meat farms and im all for it!", "You and your team have gotten so amazing at animating your videos. That was incredible!", "THIS LITTERALY MADE ME DIE OF LAUGHTER. James is my fav youtuber", "Man, Happy Meat Farms collaboration with James seems awesome!", "I like how james makes these characters occasionally have realistic hands and fingers", "You turned this into a straight up horror film. You should do more of theese.", "Please don't delete this video like you did with last year's James. This is too good to be annihilated from YouTube.", "The slow build up descent into horror in this animation is GODLY. Good job James, ya gave me a good chuckle. You do know how to make people uncomfortable lol", "someone make this man a horror movie animator", "It’s crazy to see his animation progress throughout the years, his videos released like 4 years ago weren’t nearly this good of quality but his skill has just been ", "The foreshadowing was amazing & this is actually terrifying. It would be really cool to see more of this in the future maybe cause just the idea was absolutely astonishing.", "These are the type of YouTube shorts we need in our lives", "Let’s all appreciate how good this is", "This was a complete fever dream and im here for it", "Man is probably going to make a whole entire horror show out of this", "Matpats gonna have so much fun dissecting this in his next HMF video", "Man I haven’t looked at James content in AGES and he’s doing so well", "Who knew that odd1sout would make an analog horror animation we need more of this", "watching vanoss's videos always put a smile on my face and im so happy that he just keeps on going with them all :O", "Finally, a 2d animation with realistic camera physics.", "It’s amazing and I love the twist! If you think about it could be a real ad made by someone who actually  I’m just messin’ with ya! But yeah ty for creating all this amazing and entertaining content James!", "I feel like this is inspired from Andy's apple farm it hits the vibes so much", "James is such a great character", "Man I haven’t looked at James content in AGES and he’s doing so well!", "the fact that the video is exactly 3:33 is perfect", "Never thought it was so scary and cursed at the same time"]}