{
    "video_id": "iYJr9pZxSPM",
    "comments": [
        "Watched it a .25x speed and found that that guy dies lol\n(You probably already saw that this comment is useless lol)",
        "Glimmery slurping noises",
        "Nice analog horror dude. Absolutely amazing.",
        "For God so loved the world, that he gave his only Son, that whoever believes in him should not perish but have eternal life",
        "2:05 jumpscare",
        "¿sabías que en términos de reproduccion de Pokémon humanos masculinos y femeninos, Vaporeon es el Pokémon más compatible para humanos.\n\nNo solo están en el grupo de huevos de campo, que está compuesto principalmente por mamíferos, los Vaporeon miden un promedio de 3 \"03 'de altura y pesan 63.9 libras.",
        "That was so cool",
        "Bro is that true that you’re friends with hamnianations?",
        "I want to live on this farm and join odd1s family",
        "I love how James can make a literal 3 minute merch add and make it the best video in existence",
        "Jesus loves you",
        "Hi james, love your videos!",
        "Your content is perfect ",
        "His channel is gradually turning into meatcanyon's",
        "I didn't expect that James promotes his official merchs in a cute but creppy way. This is such a great animation video. ",
        "Well well well time to contact game theory my dearest friend who can solve all mysteris",
        "Made me remember little runmo",
        "This is the perfect blend of humor and horror, well done!",
        "1:07 omg harry Potter refrance",
        "This is absolutely amazing, nobody could put so much storytelling into a merchendise ad",
        "James did you stop making your odd balls series? Or when are you gana make another episode",
        "Happy meat farms much",
        "This is not far from seeming and Dont hug me i scared",
        "This is like those 1980's classic VHS horror vids, which I absolutely enjoy watching, can we get another?",
        "1:12 \nOnly gods will understand the refrencs",
        "I'm waiting for you to upload a vid",
        "It’s always amazing to me to see how much he’s improved over the years. I often rewatch old videos of his since they make me laugh, but seeing his newer videos just astounds me ",
        "1:17 At first i thought its reference to the muse arg",
        "Theodd1sOut I can't believe you made your own neflix movie 10\\10!!!",
        "His animation has changed a lot",
        "What in gods bright heaven did I just see",
        "This gave me HEAVY happy meat farms vibes. Best merch add ever",
        "Gave me omega mart vibes",
        "The plot is amazing ",
        "It is really great that James is the only merchandizer I have seen yet making an entire video animation \"story\" on merchandize!\nLove Odd1s",
        "Hi the odd ones out",
        "the eye?!?!?!?!?!?!?",
        "woah they somehow concocted the most generic POV skin color?? like I can imagine anyone being like \"yeah that's basically me\", it's honestly really cool",
        "as a longtime odd1sout fan, i can confirm he grows the freshest t-shirts",
        "feels like happy meat farms",
        "That animation style fits surprisingly well with analog horror",
        "What's your fav\norite Pokemon that's asking",
        "Now I want to buy your merch even more!",
        "It gave me Gravity Falls vibes and I love it!",
        "its time for a theory..",
        "I love how this guy just advertises his merch at the best and scary ways",
        "I need a shirt of your art style with anime characters now ",
        "I saw oddballs episode 14",
        "Love the horror twist",
        "Reminds me of happy meat farms",
        "happy animal farm hello?",
        "James why Reindeer rap 2:25It's rude",
        "This is a bit",
        "Is this an ARG?",
        "Okay. Show of hands of who got legitimately afraid toward the end of the video. Those who don't. \n\nYou are a liar.",
        "…lord…",
        "Your never aim to disappoint Luv this James great job",
        "Berleezy: How are you gonna bypass me like I'm terms and conditions?\n\nMinors: I AIN'T SAY NOTHING ABOUT NO AIR CONDITIONERS, I'M TALKIN' ABOUT ACCUSING YOU!",
        "I feel like this like this has a connection to happy meat farm,since their both farms and have giant blob monster but hey,thats just a theory,A GAME THEORY",
        "I’m so glad he brought back the “don’t forget to wear your seatbelt” and also Christmas shopping is gonna be a way easier thanks James ️",
        "SILENCE BRAND",
        "I'm confused, i thought this was happy meat farms",
        "Look at the time signature at 0:31",
        "Backrooms",
        "This reminds me of the backrooms camera",
        "What is in those lava lamps?",
        "Wheres mat pat",
        "I feel like James might be a muse host lol",
        "I had to go back at 1:17 3 times just to check what the heck just happened ",
        "TheOdd1sOut ARG?",
        "Never thought he would do a happy meats farm video.",
        "It’s crazy to see his animation progress throughout the years, his videos released like 4 years ago weren’t nearly this good of quality but his skill has just been ",
        "It's still gofy as hell",
        "Dude that animation!!!!, how far James has come 🥹",
        "Lol",
        "JAMBS I'M A CHIOLDE CAN I GET NOE FOR EREE",
        "The Mandela Catalouge vol.7",
        "This kinda reminds me of Backrooms vlogs and found footages",
        "this feels like a Flamingo merch ad",
        "I feel like he could make amazing movie.",
        "I love the vhs filter really adds up to the \"horror\"",
        "James in the past year you have made 10 vids but I still love the all ",
        "James the next video should be a story video",
        "0:43 what the",
        "We need a part two so we can find out what he actually is going to find in the box",
        "THIS IS SO COOL!!",
        "Lol this should be featured on the next Spooky Scary Sunday",
        "SESION 2 ODD BOLLS",
        "I just wish that he posts more story time :(",
        "gravity falls vibes",
        "So this is what animators do when they’ve explained every millisecond of their life.",
        "This is so cool and so scary I had nightmares but it is so good I watch it again and again!",
        "That farm is the same place toasty went",
        "THE MUSE, DEAR GOD NOT THE MUSE",
        "the most terrifying advertisement",
        "This went from merch drop to horror...I LOVE IT",
        "Can't wait to see what MatPat has to say about this",
        "the voice acting\nis amazing",
        "James apple farm like andys apple farm",
        "which wacom stylus are you using?",
        "I have no words to describe how awesome this is.",
        "I will try to use those haunting eyes on my next video, very great job!",
        "Hey James rallisonnnnnnnn",
        "The genuine creativity put into this video was truly amazing! Props to the whole team for making it happen!",
        "be with them forever more like won't be with them forever",
        "I fucking adored this",
        "what  is the name of your gif",
        "This question is not about the Farm this is a question will there be a season 2 of your show just asking?",
        "He just went full Grunkle Stan with those tales designed to sell his merchandise. Great Video",
        "The Odd1sout is starting to feel more like a company then a YouTube channel.",
        "ThatVeganTeacher is gonna fail James for animal cruelty",
        "I KNOW WHERE YOU LIVE I SENT SOMEONE TO FIGHT",
        "Yeah because I’ve been living in the Falls account 50 I brought the candy game",
        "It's funny that he's made a farm video, cuz he's always milking his content to death.",
        "Hello I love subway and want to meet you I love your channel too ok bye",
        "analog horror in a nutshell",
        "Man James pulling off a horror short this good is something i never expected. Great job!",
        "hey, since your TV show is out on Netflix, I was on then, I am gonna make a season 2 because I watched the whole damn thing, I mean, your TV show, I watch you a whole teacher",
        "0:13 Amongus",
        "i can't even imagine how much work was put into animating a film foutage video you crazy artists",
        "Theodd1sout/oddballs",
        "i like the show oddballs ahh pillow fightinh ep is hellierios",
        "3:33 mandela catalogue number",
        "This would make for a hilarious video game where you have to run away from various Odd1sout merch.",
        "Bro this is so good what-",
        "James,I think people are gonna stop buying your merch after this ",
        "I like this idea! merch but its terrifying and more. I really enjoyed this video!!",
        "is this part of the Alex bale theory like where they are getting controlled by a tentacle monster?",
        "AHHH I LOVE THIZ",
        "This is giving me Alex Bale vibes with the HMF arg (game theory has 2 vids on it if u don’t know)",
        "Are you o k",
        "This feels like it would actually make a good commercial",
        "\"mMm..gLiMmEry..\" ",
        "And this is why we love James, he managed to take a literal merch ad and turn it into a genuinely creepy and cool video. James, my respect for you is infinite.",
        "How the heck do you reach the counter though does Max pick you up or do you stand on a chair?",
        "A hundred percent good, but too cursed. PS: is the camera man okay?",
        "Why did this make me think of happy meat farm",
        "The slow build up descent into horror in this animation is GODLY.\nGood job James, ya gave me a good chuckle. You do know how to make people uncomfortable lol",
        "This is amazing. Best merch ad ever!",
        "that w",
        "You and your team have gotten so amazing at animating your videos. That was incredible!",
        "ok that way more entertaining than expected",
        "Are you making theese from HUMAN SOULS!??!?!",
        "Odds1out when are you going to do a Q&A?",
        "Ok the merch monster was actually a pretty terrifying idea.",
        "Did you know Technoblade is dead",
        "Bros turned into a walking advertisement",
        "2:04 did that just move ",
        "Pls not andy apple fram noooo",
        "Is this an arg??",
        "James finally lost his sanity from all the videos he has made (great animation though)",
        "This video is giving me \"this is not a happy farm\" vibe, and I like it.",
        "I don’t get why but the camera is giving me backrooms vibes.\nAnyway the MFT UNIT EPISILON-11 is on the way",
        "hey james, do you remember the YouTube channel called the odd twos out",
        "... WT- WAS THAT GIANT MONSTER CHASING HIM WITH JAMES ON TOP OF HIM IN THE LAST CUTSENE?!?!?!?!",
        "can't wait for 2 years where everyone remembers James ripped off happy meat farms with this lol.",
        "what the duolingo did i just watch\nhelp",
        "It says 7 days ago-\nWhy doesn't it say 1 week??",
        "Praise the LORD for kind and real emotions!",
        "Bruh this is how i would sell my merch literally every time i go on sale",
        "THE FACT IT ENDS AT 333 SECONDS AND 2X IS 666",
        "GOD BLESS YOU AND YOUR FAMILY AND YOUR FRIENDS AMEN",
        "From what I heard,the ratings on this farm is an average 10/10!",
        "How come we have not gotten a film theory on this?",
        "James, did you spit in the lava lamps?",
        "1:40 Peta approves this massage",
        "absolutely amazing",
        "Its impressive how James has managed to mix the genre of both funny and horror in one animation... This seems like some sort of \"Invest in merchandise\" video gone wrong",
        "mat pat!!!!!!!",
        "Are you thirty noe",
        "Do you still have 8 snakes in the fizzer",
        "This was so funny and perfect because while he was promoting his merch he's also got this little horror story up his sleeve that is super entertaining",
        "ADNYS APPLE FARM REFERENCE JUST WHYYYYYYYY",
        "Legends say the one who recorded didn't make it out alive, that he's trapped in his factory waiting for another poor soul to save him, while begging they stay protected and away from that horrible monster he saw and will never unsee",
        "This was the best ️️",
        "I want to name the mercy monster at the end Joe.I don’t know why but it kinda looks like a joe",
        "Cool Mandela catalog",
        "James, I used to love your videos, but you’ve lost your charm…",
        "new arg!?",
        "Hmmm, happy meat farms?",
        "And I totally agree on Smart toasters artificial intelligence is the future",
        "w… t… f…",
        "When is the new episode of odd balls coming out",
        "That is sacry",
        "I respect everyone who were involved in this , seriously the best piece that I ' ve ever seen on YouTube ,Hats of the Well All ! Love your videos",
        "This scared the crap out of me",
        "I like the idea that his merch is actually grown in a farm. Plus that ‘horror twist’ at the end was perfection",
        "Film theory you got a theory to talk about.",
        "Are you making oddballs season 2",
        "I want matpat to just watch this for the fun of it lol",
        "did anyone else get mandrake vibes from the plushies?",
        "sorry not sorry of this WTF",
        ":(sus):",
        "Damn James is farming in Ohio",
        "This is one of the best ways to promote merch \n\nThe art and animation is on point",
        "AAAA Theodd1sOut, please translate your video, i want watch it but i can't know what you say because i don't know english ):",
        "Is nobody gonna talk about that this is  as long as the rickroll ?",
        "James I missed u",
        "softer then a marshmallows bottom ",
        "Hey James can you recommend some videos with \"crazy\" people talking about aliens?",
        "odd1sout villian arc frfr",
        "The thumbnail reminded me of the \"corn\" video by Slimecicle. And the slow descent into creepy fits with that.\n(Or more famously, the video where the \"come down today, try some corn, or we will sacrifice your newborn.\" meme comes from)",
        "Friggin love the turn to analog horror and the way he did it was perfect. Keep making amazing content James ️",
        "1:51 Nice to know our hand is  pale and not a marshmallow",
        "What happened to the old odds1out?",
        "Okay, does anyone think this is related to that Alex Bale ARG? Nobody at all saw the guy get taken by a tentacle at 1:16 ?",
        "James you the best",
        "I love your show please keep making more it’s really good",
        "Just watching oddballs right now",
        "The scream from the plushie is priceless",
        "This is on some next level Poppy playtime vibes",
        "That meatcanyon video with James in it, might've left an impression",
        "This is awful",
        "Lol \"I guess he wasn't ripe yet\" and look at the end and WHY WHY WHY WHY",
        "As soon as I saw the thumbnail I knew it would be a banger ",
        "Question: Will you make a Season Two in Odd Balls?",
        "This is some happy meat farms stuff man ",
        "you don't tell him were stories about your life. I might just described because of that I'm bored",
        "james clearly copied andys apple farm but instead of apple its cursed merch, but i still like it",
        "he still managed to include “be sure to wear your seatbelt” in the end. chad moment",
        "The fact that this video is 3:33 minutes long makes it better",
        "Ahhhhhhhh",
        "I wish you did your research",
        "This guy just made... the greatest ad ever!!",
        "OMG I JUST REALIZED UR FROM THE ODDBALLS THINGY ON NETFLIX SO THATS WHY THE CHARACTER WAS FAMILLIAR ",
        "ITS only the last part",
        "Anyone else think this is a start to an arg? I have no idea if the phone number leads you to buying actual murch or leads to an arg, if anyone can do that for me it would be great",
        "i love how even after all of that stuff he still says “and make sure to wear your seatbelt”",
        "Will we still have storytime animations plz",
        "This is honestly the most creative ad I've scene",
        "how can James grow merch",
        "I finished the Netflix show now please continue it",
        "Jame's first ARG! Nice!",
        "g r e e t i n g s",
        "Why is the end so creepy?i’m a kid you know",
        "I'm sorry but WHAT DOES HE MEAN BY USUALLY?!",
        "It’s always a good day when James posts.",
        "This guy should make this into a horror game",
        "Am I the only one getting Happy Meat Farms vibes from this video?",
        "Congratulations on your show you deserve every good thing that happens to you",
        "This has to be connected to happy meat farms",
        "If only the show played each episode like this cause it played it too safe also this gives me andy's apple farm vibes",
        "That was one of the best advertisements ever.",
        "James is so good at having a creepy voice when he wants to",
        "James your the best animator I’ve ever met",
        "Gosh dang it I need to know if these are gonna be in the stores or not like in target or Walmart",
        "This feels like the FNAF VHS tapes but with no gore or any of that creepy shit",
        "I’d love to see a horror game made by James, if someone told me this was a trailer for a game I’d believe them",
        "i just boght all of it",
        "You’re the first YouTube animator that I ever watch and I love watching your videos hello",
        "This may have been an entire merch commercial, but it was very creative and I enjoyed watching it. I love the \"tree-shirts\".",
        "I didn't even look at the thumbnail but the second I saw the video I knew it was going to be horror",
        "James using comic sans is the scariest thing in this video",
        "Indie horror game James merch farm",
        "james make more horror content this is great",
        "wow a collab between theoddsonesout and the happy meat farm thats coooool",
        "Finally, a 2d animation with realistic camera physics.",
        "Hello my name is Corneuleus CornWall and im here to intereduse you to CORN,side affects may include choking,I geus8",
        "I see that working with meatcanyon has had an effect on James",
        "2:15 had me dying laughing lol ",
        "Is this analog horror",
        "Backrooms: level james",
        "too young i drink out of squeezey pouches",
        "this is really reminding me of the happy meat farms stuff",
        "Make more oddballs please like this comment so he can see it",
        "Imagine this was a backrooms level called \"backrooms level huanted odd1sout\"",
        "Anyone notice that the time of the video is 3 minutes and 33 seconds",
        "happy ment ferm",
        "This would honestly be the best ad ever",
        "this is a weird way to promote merch ",
        "According to my calculations, this Muse is made out of someone wearing his merch. This is also one of the many bases of happy meat farms. We should get the upper hand on him, it easy to deal with the Muse.",
        "That escalated quickly",
        "The muse",
        "Bro I can’t tell if it’s supposed to be a scary ad or a hidden ARG",
        "THIS. IS. AMAZING.",
        "noise",
        "The Odd1sOut is being really generous by giving us a plentiful amount of Oddballs episodes and these awesome videos, even when they are OMINOUS like this one. A round of applause to James and his team.",
        "It's like a puppy play time game and james if you see this message you also create this topic game",
        "is it weird that I want to go here?",
        "Awesome show! Me and my brother love it and we are so excited for more episodes!",
        "Best drop announcement ever",
        "analog horror be like:",
        "1:20",
        "HMF is everywhere ",
        "That took a very \"happy meat farms\" turn, I like it :3. Maybe you and matpat should collab /j",
        "James are you going to ever do another story episode?",
        "Idk why, but now I need insane farmer fanfics yesterday! Doesn’t need to be James, I’ll settle for any wolf in sheep’s clothing farmer hellbent on killing me! And I mean any. There are no limits.",
        "Huh. Never knew that he would make something as horrifying as this..",
        "0:15 when James have fingers\n0:30 when James don't have fingers\n2:18 when the scary part begin",
        "Meat cannon really inspired James huh?",
        "Time for a ARG",
        "Hmmm",
        "This reminds me of Happy Meat Farm.",
        "The foreshadowing was amazing & this is actually terrifying. It would be really cool to see more of this in the future maybe cause just the idea was absolutely astonishing.\n\nAlso, don’t worry, I’m not a bot if you think that & I can show you proof if you ever ask.",
        "MmMmM Glimmery 0:37",
        "This genuinely looks like a Happy Meat Farm video, and I'm very certain James is sponsored by them. I have a theory that the jacket monster is actually a muse, just, well, wearing James's merch.",
        "Hay James  When will the 2nd season of odd balls come out",
        "damn these bring back memories of randomly looking at memes online",
        "The \"T-shirt tree\" sounds like some kind mythical thing i would believe to be real as a kid, but it's a great thing nonetheless!",
        "I want it",
        "I just realised this was recorded on 9.11.2022",
        "I didn’t know meat canyon and James were having a crossover",
        "Omega mart got some competition",
        "Do I smell an ARG???",
        "Alpha's ability to sense Groudon is incredible. It's like they're soulmates.",
        "Q and A IM TMnextos and I’m wondering what is the funnest way to grow your channel",
        "the scp foundation would like to know your your location",
        "I LOVE JAMES' SHOW ODDBALL",
        "Wtf  1:15",
        "Slay James ",
        "I have a q do you do all of the characters voices in your vids besides sooud way part two",
        "Hi I am a furry",
        "James' voice acting, creativity for a merch plug, and entire animation team is overflowing with talent damn",
        "Liessss",
        "OUT OF MERCH WHY",
        "This guy is just getting better at animations!",
        "Rest in peace techno we all love you and all of your content. Fly high our hero you have done your job in this world :",
        "soory about the last comment [ i was toomad and i still mean ]\n\ndear James",
        "make a oddballs 2 please.",
        "Me and my sister were talking about how peculiar this video was and as soon as I opened my laptop and got on youtube, it was the first video that popped up.. James, please don't come after me and put me in your basement. PLEASE",
        "Ooo, this was epic James. God, if I had money a hoodie would be in my possession. As would all my favorite creator's merch.",
        "Seems like James partnered up with happy meat farms!",
        "Isn’t this base on Andy’s Apple Farm?",
        "noice",
        "Is it only me how misses the old James? The James who would just make videos about his life. The James who would tell fun storys. Sure he makes videos and all ,but most of them just are about how his Netflix show is going. Exept from the ''Geting punched for free'' video we haven't goten a storytime for over a year now.First he writes a book then gets his own game , netflix show and know just straight up advertizing. I miss his funny storytimes I really want them to come back. I am just getting board of him at this point.",
        "0:11 AMOUNG US CLOTH",
        "Can we just appreciate how much work and time is put into these videos to make our day, huge respect",
        "You can already tell something is wrong from the thumbnail, he looks like he is going insane and with the cam recorder video going like poppy’s playtime",
        "matpat better make a video abt this, delving into the deep lore of the merch farm.",
        "Logic.exe has (for some reason) stopped working.\nPlease, give me more merch ads, they are lit.",
        "You always make the funniest videos",
        "this looks a lot like a happy meat farms colab",
        "Happy Merch Farms",
        "Season 2",
        "yes ill put on a Seat belt",
        "please make a video about just you reviewing some animated movies",
        ":)",
        "From the first weird part when Odd1sout takes the dude into the basement type thing immediately got texas chainsaw vibe. Well done on making this creepy and cartoonish at the same time!",
        "Nah that scared me ",
        "By the way not this video",
        "Im scarred",
        "James' voice has gotten more animated over time.. love it",
        "Bro you already had me at the upbeat wacky farm themed merch talk, with vaguely underlying hints of darkness, but actually TAKING US to the basement, that was fun. You one upped my expectations, and then one upped them AGAIN in the same video James. Nice.",
        "Cool to see a hmf parody",
        "Did the person who was recording get dragged?",
        "i love this",
        "Analog horror and lore James!!!! Can't wait for and arg lol",
        "This was a complete fever dream and im here for it",
        "Happy meat farms",
        "Really looking forward to your Muse ️",
        "ok this is really good but how does he manage to make 4 videos promoting something in a row ",
        "Honestly this was so good I brought some of the new merch",
        "James bring some great stuff out in videos and lore",
        "It’s not a mistake it’s a masterpiece",
        "Who knew you can make a horror video and yet still comedic and \"kid friendly\" ️",
        "ok but is this not kinda weirdly related to that one recent mat pat video....",
        "They’ve got him guys",
        "Hmmmmmmmm maybe happy meat farms",
        "Um  I’m not a marshmallow pervert soooo how soft is a marshmallows bottom?",
        "well he's getting better at animating.",
        "I love the fact that he was able to make a creepy short story about his merchandise, that goes to show how creative he is",
        "And I'm not even that old",
        "1:15 what haopend Bach there",
        "making this a horror video game would be a million-dollar idea",
        "oml this is such a james thing to do.",
        "Alright you made this as a joke bye",
        "Checking in on a old channel that was the best and never maked me not laugh.",
        "wooo happy meat farms collab?!",
        "Seeing the black tentacle after watching about the Alex Bale ARG was a bit surreal",
        "I wish I could be a pc of you too and you're big too lava stuff.",
        "If you want to nkow about this vídeo \nIf an from the channel \n\"This pleace is not hæppy\"",
        "Why is that black blob be looking like a muse from happy meat farms?",
        "Netflix be like 2:46",
        "you kill the man",
        "MATPAT!!!!!!!!!! I GOT ONE!!!!!!!!!!",
        "Thanksgiving is not here yrt",
        "How are your things are\nOk",
        "This reminds me of the back rooms I made a POV for it\nAPOV:your in a level then you no clip into level !",
        "James is starting an ARG, get the notepads out people!",
        "wheres matpat right now",
        "Bro bought Andy’s Apple Farm",
        "I'm love the season 1 part 1 is so good",
        "🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺",
        "this just proves that youtube animators are the best when it comes to advertisements- fr will sit at the edge of my seat with peak interest ;-;",
        "MATPAT WHERE ARE YOU",
        "At the end, slow it down to 0.5 and you can hear what he says",
        "Now I want an Odd1sOut theme park",
        "can we just notice that james`s animations are so smooth?",
        "I absolutely positively think this is the best video you've ever made. it was an amazing experience",
        "omg this was more terrifying than I imagined. he has hands",
        "Odd1sOut analog horror when ?",
        "Damn\nThe new SCP short is looking fire",
        "All Hail Professor Dumas!",
        "I feel this could be an arg for some reason",
        "better then the entire odd1sout netflix show",
        "Petition to make james remove fingers from animations",
        "Matpats coming",
        "0:40 \nDE FU-",
        "At first when I saw this I was like come on, only 3 minutes.\nThis is a masterpiece. I love this.",
        "Damn the lore reminds me of the \"Mother\" from Alex Bale's videos",
        "LORE!!!!!!!!!?",
        "amongus",
        "This gives me andy’s apple farm vibes watching this",
        "видео джеймса это невероятный мотиватор, чтобы учить английский, ведь больше нет озвучки твоих видео на русский(",
        "2:57 bro coomed ",
        "That was crepy",
        "Holy sh**",
        "Your mom",
        "Just imagine if James' short animated videos just immediately got filled with intense lore.",
        "Can we appreciate how James can just turn a sweet, wholesome add into an animated horror story",
        "The number doesn’t work 3:16",
        "The idea of planting yourself in the ground and then growing clones is such a cool idea! Would be neat for a sci fi story",
        "dear James\n\nI am not going to lie, this video... this video is nice. But I don't understand why you can't make video like use to instead of selling merch and making shorts [ which are decent ]. You could have made your thought on Halloween for the audience 'sake, FOR MY SAKE. but I understand, you are  growing as youtuber and have merch to sell, mobile game to take care plus board and card game, you can't just make video all the time,  BUT I SWEAR IF YOU DON'T MAKE VIDEO LIKE YOU HAD FOR THE PASS 8 FREAKING YEARS IN 3 MOUNTH, I AM UNSUBCRIBE TO HIS CHANNEL AND DISLIKING  TO EVERSINGLE VIDEO THAT SHOW ANOTHER YOUTUBE AND THAT I DIN'T LIKE [cause I don't do that i was toO nice]. Like how does Jaiden do it , sure she stared videos just about game but they still good. [ this comment is just my opinoin so don't judge ]. I miss your old video",
        "Hey there partner",
        "This better be an ARG",
        "Never knew James had the ability to pull off a cursed, horror ending like that. Meatcanyon would be proud",
        "This gotta have something to do with Happy meat farms",
        "Funng and odd way to promote your merch",
        "3:06 UNSUBSCRIBED",
        "The descent into madness though.",
        "You need to make this a series",
        "This should become a horror game",
        "why is this actually scary",
        "I WOCH ODD BOLS I LOVE IT",
        "I love it",
        "I love the Omega-Mart esq. ad concept!",
        "OMG that was absolutely amazing! Keep up the great work james!",
        "Andy's apple farm be like",
        "HAPPY MEAT FARMS",
        "Meet Canyon and Omega Mart vibes. I love it.",
        "This so fun to watch and that horror twist was the best!",
        "I don't like the new artstyle odd\nIts feel different can you make a video with your old artstyle please",
        "When are you going to make full length videos again?",
        "James this gave me a very creepy Vibe and normally you don't do this so yeah I like it but I don't like it at the same time so could we be real like kind of a little creepy so can you not do that that might get you demonetized so yeah bye also I subscribe to you like all your videos and yeah love you bye also I say love you bye to everybody so yeah okay bye",
        "PRETTY sure this is a happy farm reference...",
        "Ummmm",
        "Dang bro, advertising your merch while making a short horror film, now that’s how you know this is a good YouTube channel.",
        "Bro this is a backrooms level",
        "At 1:17 the black thing, was that the muse from the don’t feed the museARG?",
        "Me coming up with something dark be like",
        "That ending man",
        "Was that the muse?",
        "Came here straight from Oddballs. Never realized how disturbing his non-animated mouths are until now. Bravo, James. Bravo!",
        "heck the ending was like a odds1out backrooms level ! also know as run for your life fever dream!",
        "Why¿",
        "My god you are so great at drawing",
        "Remember to wear your seatbelt? Ok!",
        "And I am a huge fan of you James or YouTube calls you odd ones out okay bye",
        "fine fine fine... i better go check them out!!! i love a good dael!!!",
        "I have a feeling that that’s a muse, if you don’t understand that check out the game theorists you will understand it then…",
        "Only Theodd1sout can pull off merchandizing while the creepiest stuff is playing",
        "What is this?",
        "1:29\nBruhh, my milk tastes like COLORS",
        "New backrooms level",
        "Don’t feed the muse?",
        "Jee",
        "I'll rate this video a 10/10",
        "The slow build up descent into horror in this animation is GODLY. Good job James, ya gave me a good chuckle. You do know how to make people uncomfortable lol",
        "like amanda ThE AdVeNtUoR",
        "I’ve never gone back and rewatched a merch video before, damn James.",
        "@The Game Theorist some more \"muse\" things here",
        "This needs a matpat theory",
        "James please release more oddballs on netflix!",
        "lol",
        "Welcome to an new episode of film theory",
        "1:16 look in the bach ",
        "I hope there is gonna be a cover of final escape of this 3:08. Who wished that would happen also?",
        "is this an arg?",
        "idea: make a video about pc's",
        "3:18 play at 0.5x and you’ll be fine",
        "Wow, an ad that turns out to be a skit instead of a suit that turns out to be an ad. It's kind of refreshing.",
        "Gabs oun out",
        "He took the camera man",
        "I Like your vídeos It’s very good",
        "This just proves how good of an animator he is by making this whole video an add at the same time",
        "That was both hilarious and terrifying ",
        "I watched you on Netflix oddballs",
        "I miss your old videos ",
        "James, not to be pushy but when are you making a non short? Just asking. It’s been awhile since you made a full like episode since the charity boxing video",
        "Hey Oddball, do you play Overwatch 2. Make a Viedeo about Overwatch 2 please",
        "Ohio farm",
        "bruh where is that hoodie?? 0:49",
        "He’s doing this because of no not November",
        "Always a good day when James uploads! ",
        "hey when will u do the new tostie episode on netflix?",
        "Who knew that odd1sout would make an analog horror animation we need more of this",
        "Chicken",
        "only in ohio",
        "This is the best advertising I've seen in years",
        "Holy shet",
        "That farm looks fun :D",
        "I just found out you're a furry. Why would you do this to me? You were my childhood, how could you? Monster",
        "This is like Andy’s apple farm the horror game",
        "Happy meat Farms?",
        "As good as this is, I think the premise is that he has way too much merch, more than the normal YouTuber, and he will still continue to expand that roster, even if he has to make some dark decisions",
        "Man is probably going to make a whole entire horror show out of this",
        "This is literally like those VHS backroom videos and the way the camera drops at the end is just perfection\n\nEdit: Jesus fucking Christ thanks for the likes",
        "My grandma called you \"the odd man's out\" ",
        "It's been a very, very,  very long time since theodd1'sout has been good.",
        "This could be turned into on of those games that look cute but are actually scary! It would bee amazing"
    ],
    "comments_disabled": false
}