{
    "video_id": "j09jcgNPolQ",
    "comments": [
        "13:32 \"My Crocanaw's build\" ahahaha))) intentional or mistake?",
        "Skelidirge's cry speaks to my soul and I love it.",
        "In my opinion the best starter is the fire one",
        "The past two games I've gone with the fire starter but Skeledirge is my least favorite design.  To me he looks like a transformer or something. No he's not a robot but I'm playing violet and I don't want another one.",
        "I’ve never picked or passed a mon based on design… quackaval may change that… and over all I think these are the worst designed starters ever. That’s just me though, idk who I’ll pick yet",
        "70 hours?! Bro the game just came out ",
        "Water boy looks kinda fruity",
        "Skelredirge also has a good HA (unaware), he is decent bulky fire type.. Fire type doesn't really have decent bulky pokemon so a bulky starter is a great addition.. Skeledirge is also a proper quadraped fire starter, so another thing making it unique.",
        "im honestly not thrilled with any, but im glad Quaxleyis good for the long haul",
        "giving my honest opinion i think that this pokemon game has failed to impress me after the design of the overall game this is including the starter pokemon the overall world and the pokemon centers it looks liek they were aiming for a modern futeristic look but have definitly failed for me. I dont think i will be picking this game up but just honestly i think this game needed more time to fget worked on and i think the game freak company tried to rush things",
        "Do they test/play their own game before they release it.....? Or do they just say F it, they can deal with 15 fps in the year 2022.....??? Unbelievable...\nTHANKS AUSTIN JOHN FOR LETTING US KNOW THE GAME IS UNPLAYABKE BEFORE WE BOUGHT IT EVEN THOUGH YOU GOT IT EARLY  GOOD LOOKING OUT DUDE.... What a clown ",
        "I love da meowscarda",
        "I mean for me I don't like the talk about the starters, from what I seen and being a fan of Pokemon since Kanto, they are all diverse in their own way and the Pokemon company wanted to make the perfect theme for every game that was released. I personally don't have this game yet or a switch but when I do I will be getting violet.",
        "Your crazy, the Cat is the best hands down for 2nd and 3rd form",
        "I wish they would hire a new lead designer, the hype fan art is always MILES better than the official Pokémon",
        "I feel like skeldirige with Frick room could be a realy good combo, or hjust using evs and items.",
        "lol at 20:00 i thought he was gunna say \"honestly they all kinda suck\" cuz... thats what im thinking the design for meowskarada looks okayyyy but it just coulda been so much better, and the skeleturge or w/e looks like a fire crocodile Walrein. and the duck one just looks so akward like whaaat???",
        "I just hate the final evolutions of then all  \n\nBut great video! I have about 12 hours to think before choosing ",
        "Least favorite is Quaqaval. For favorite its a tie between the other two",
        "My disappointment is immeasurable fuecoco should have been bipedal not sprigattito ",
        "Wow, such cool pokemon. I think I'm choosing Fennekin as my starter",
        "I still think I'm going with Sprigatito, but I am not sure if I am sticking the with nickname I had in mind. I was going to name it Spriggan, based on the fae lore and how dark it is (I suspected grass/dark from the beginning)",
        "When I saw how fuecoco’s first evolution looked I was a bit nervous since I was going to pick fuecoco but seeing the last evolution I didn’t worry about it because that last evolution of fuecoco looks amazing",
        "I hope I can get a female quaxly since it's more feminine design",
        "I think in the last generations, Pokemon designers are letting us down with the final evolution of the starters. They start so promising with the 1st stage and they end up way below the expectations. Sprigattito, fuecoco and quaxly are sooo good looking that honestly i didnt know which one to choose, with quaxly maybe slightly ahead. However, looking at the final evos i dont know what to say, i am just thinking to put the starter on the PC. I am really disappointed with the designs, all three for me are looking bad with Meowscarada maybe a bit less messy, which i will end up choosing eventually. Once again, the water type is so bad in terms of design, like it happened with sobble which i looooved the 1st stage as soon as i saw it, but when i saw Inteleon i got disappointed as ever. I just hope this will be the last time we have so bad starter designs (final evos)",
        "Anyone else think that crocolor looks like some kind of fakemon firetype ludicolo?",
        "How did they make a worse Pokémon game than sword and shield",
        "Austin, quick question, slightly related. How long after the start of the game can you realistically trade over the other starters?",
        "The fact that the cute cat became a biped is disappointing",
        "Weird my quaxwell evolved at lvl 39, maybe i did something wrong lmao",
        "So this game encourages you to move away from your starters. That's awesome",
        "None of them I’m going for klefki",
        "meaowscarada is just tuxedo mask from sailor moon",
        "Hello maybe someone can help. \n\nI’m a sweaty nerd but still want to be a kid at heart, playing the game and trying to go into much of it blind.",
        "Lol everyone was right about Sprigatito walking on 2 legs as the final evolution, Nintendo is going furry ",
        "I'm getting Ralts ASAP and pretending it's my starter",
        "Well looks like I’m not evolving floragato",
        "I was always going to go for Weed cat, but it's a shame it's type match ups aren't great. I don't mind it's final evolution, I kinda like it but they just had to make it stand up didn't they?\nI love the idea of Fuecoco signature move, however I'm actually going to go ahead and say it's my least favourite final evolution. I just can't get past its weird balding fire hair.",
        "Skeledirge looks bad",
        "I get why they have a carnival dancer here, because Spain colonized Brazil (so you know gotta have it in the colonizer place) but I would personally LOVE Quaquaval if it just didn't have those grippers",
        "77hrs how it’s been released for less than a day",
        "Damnnn, all 3 final evos are so bad  still the grass starter is best among the worst design ever",
        "im going with the water duck today",
        "I didn't like them at first, but they've all grown on me. Really liking the theme for all 3.",
        "So disappointing. Sometimes we get great final forms. Sword and shield were good.  These are on.",
        "18:37 - Oh darling!  That is Sylvando's starter!\n\nAlso, finally a spoiler free video that ONLY shows the evolutions of the starters.  I don't want to see other Pokemon, I don't want to see story bits, I don't want to see what the towns look like.  This is perfect.",
        "Terrible starters =(",
        "Can you catch all the starters before you beat the game",
        "Skeledirge is the only good design",
        "Quaxly... What have they done to you...",
        "The first thing I thought when I saw Quaquaval was “Look! It’s Pave’ from Animal Crossing.",
        "smart move to not show the final evolutions prior to launch, it would have brought negative publicity and they know it.",
        "Wonderful, more humanoid evolutions that feel like Digimon",
        "Meowscarada is pretty clearly a swashbuckler rogue archetype",
        "How did you get all three starters?",
        "I have decided to name my fueccoco taki. Don’t know why, but I love it",
        "You are releasing on the dot! And you even explained how to make the game accessible to everyone at this time through the New Zealand time zone. Cheers champ! I’m going to try it now",
        "I kinda don't like any of these TBH",
        "I literally dont want to use any of them",
        "Design wise I REALLY like Meowscarada. Seeing the final forms has swayed my starter choice to grass cat",
        "The cat was my choice before I found out it ends up like that. Now I'll just have to keep it at stage 2",
        "I really like Skeledirge’s design it looks absolutely amazing Fuecoco is my first pick ever since the first trailer of the game",
        "Austin Could You PLEASE Creat Traiding Codes For Version Exclusive And Trade Evos Like You Did In BDSP To Help Everyone Complete The The Pokedex",
        "Starters look terrible.",
        "I really love Quaxly and his evolutions, they are all so interesting and the final form makes a lot of sense. Plus I love all the secondary typings",
        "These have to be my least favorite starters out of all the games, final designs are really ugly. I also really hate how humanoid they look, so I guess I’m going with Fuecoco",
        "I don't have the game yet, but I can't wait to see if it has a feature like dynamaxing, mega evolutions, etc.",
        "tbh I LOVE QUAXLY!!! And the theme of a carnival so im not that mad at its last evolution.",
        "Bang bang maxwell. \n\nI mean, Air Slash Quaxwell…",
        "Mine evolved at 18 and 38. Why?",
        "i swept most of the game with skeledirge with flame charge + torch song + shadow ball with assault vest\n\n1 flame charge is enough to outspeed most of the game and torch song just makes him snowball the entire game",
        "Can you obtain the other starters by playing the game? Or did you get your's by trading? Surprisingly hard to find confirmation if trading is necessary or not lol",
        "Meowscarada is my choice still despite the bad match-ups with types. I really do love the design as it reminds me of a mix between a cat, Dark Magician, and Tuxedo Mask.",
        "The color scheme in skeledirge head is a bit odd to me. Maybe because its in 3d or something like that.",
        "Quaquaval is like the a water blaziken for what I understand.",
        "As someone comes from a culture with those same types of super over the top street festivals/parades I can’t help but love the water starter. And it’s such a fun idea to combine that with a peacock. I’ve wanted a peacock Pokémon for a long time now.",
        "I love everything about Meowscarada ",
        "Why can't they deliver on the final evolution, so disappointed, might not use the staters. Might make an Eevee my official starter.",
        "The water has the best design",
        "To be fair, crocodiles aren’t agile out of water so I understand why the fire line is slow",
        "Tbh I’ve been playing for over a week and i love my skeledirge. both design and stats. i just happened to get a +speed -attack natured at start, didn’t even think to check. i was so excited for the game. once i saw what was up i put the power anklet on her and took er out in “lets go” and shes so fast now man",
        "I usually always go fire type, since I was a charmander guy but I think sprigatito is the move, Im not a fan of either fuecoco evo",
        "Can you catch all the starters in the wild or can you only get one of them at the beginning of the game like the older games?",
        "NO IT STOOD ON TWO LEGS NOOOOOO",
        "I'm really sad to hear about the grass starter. I was hoping for a grass/fairy. ",
        "The Fanart versions look way much better then the originals. They look like the designers dont care at all.",
        "Who ever designed these needs to be fired",
        "QUAQUAVAL. just look at my username. I love ducks.",
        "Hey guys… I just started playing the game and my first starter pick, Quaxly, is a female! Is that still super rare in this game or have they changed it and I’m being overly happy about nothing? ",
        "When he pulled out a spreadsheet I almost cried from laughing this man is actually insane I thought people were exaggerating but no he's actually insane.",
        "I think I’m going super bulky Skeledirge idk if speed is for me",
        "I'm going with Sprigatito just because I specialize in Grass Pokemon.",
        "Hope this runs okay on my old Switch version, bet it'll be laggy. I can't afford a new switch for a long while.",
        "Happy to be a fire starter guy ",
        "With those stats, would he be a Quaquaval trades?",
        "Man these evolutions are garbage, same with the stupid bike pokemon",
        "I'm a professional pokemon design critic. These designs are not great.",
        "I feel like if they filled in the eye holes for Meowscarada’s mask, it would’ve looked a lot cooler.",
        "I miss the starters looking tanky",
        "I don’t know how you’ve had time to sleep in the last week, but thanks for this content!",
        "My choice base on final evolution looks is the opposite of yours, i really love meowscaradas design and my least favorite is the fire type.",
        "puss in boots would have been a much better design for the final evolution. HE SHOULD HAVE A GRASS SWORD",
        "I kinda like how they balance the starters and make them average unlike the older games which we can just steamroll with the starters. Gives us more reason to use other random mons for a full team",
        "People who don’t like the Quaxly line don’t season their meat. Just saying.",
        "Quaquaval is the worst designed final evo of all the starter Pokémon since ever, and fuecoco’s second form w the sombrero is really just not a good sign of things to come",
        "Eversince gen 1 I've been picking water starters.  Thru thick and thin my water buddy is on my side.",
        "I cant pick which one they all look fabulous so I’m going to get all of them (using home)",
        "Appearance wise all but the fire type suck.",
        "Definitely going with Sptigatito, I love Meowscarata’s who masquerade vibe. Quaxley/Quaquaval is a very close second.",
        "Definitely glad I chose Fuecoco, his final evo does not disappoint! It basically sealed my choice.",
        "This is ugliest pokemon among all generations.",
        "Fairly confident that Skeledirge may be based on alebrijes, which are essentially animal spirit guides. Absolutely love the design and obviously made a good choice off the bat.",
        "Of course sprigatito had to become 2 legged",
        "I'm sorry my duck boy was my favorite starter hand down.",
        "Meowscrada is based off of Masquerade balls, where people ware intricate masks to hide their face. As you might assume, it becomes fairly easy for a person wearing a mask to do nefarious things without being caught... like a dark type.\nIn a side note: if the widely released hidden ability becomes available anytime in the next few months, most of Mewscrada's issues with their defenses should be mitigated.",
        "Only love quaxly final evo cause it runs like Jack sparrow.",
        "Disappointing",
        "I didnt like any of those. I guess for the first time I'll skip all starters",
        "For me it's  top pick Sprigatito because I dig it's evolution line, 2nd Quaxly because it's ok second evolution isn't the best but neither was Rowlets it comes together in the end for both though, 3rd Fuecoco. I'm sorry but the evolution line isn't my aesthetic and that's ok, they can't all be Totodile. 2nd L for fire pokemon for me, first was Tepig. THIS IS JUST JUDGING OFF AESTHETIC, I don't battle other players so I tend to pick my pokemon off aesthetics and what moves they learn.",
        "I’m ok with using a meh Pokémon if I like the design but boy, not a fan of any of their designs",
        "Ok, why do I feel like questioning my decisions again, I already saw these evolutions, but Sprigatito's evolution is actually very good now that I take a good look at it, Quaxly had nice evolutions but is it really my definitive choice, Raaa why is it difficult",
        "I don't like any of them :(",
        "\"this is Florigato, I think it's a thief?\"\nlooks oddly like Taokaka blazblue to me",
        "I like the Carnival theme, it applies to all the starter final forms. One represents masquerading because of the masks worn at these festivals, another represents the unique costume of Carnival dancers, and the last one is a clown that you might find roaming at this event. Gotta vote for the croco-clown, though, he's like Rudolph the combustible crocodile.",
        "So tired of the stupid anime humanoid starters.....I hated Scorbunny and these two are as bad....",
        "The numbers u use are confusing. Why not name the columns what they are",
        "I think Skeledirge could preform as a great sweeper on a trick room team in doubles but the amount of rock moves in doubles could hold him back",
        "I'm still going for Sprigatito.",
        "That water final evo is horrifying",
        "I love Austin John when ever there is a new Pokémon game and he is really good about spoilers and leaks. Love the work man ",
        "skeledirge is absolutely the worst wtf lololol",
        "The way I see it:\n\nSprigatito will benefit most from an Adamant nature since it already has a very high speed.",
        "Playing through the game with meowscarada was great. It doesn’t scale like the other two but the typing was consistently helpful and the flower trick move hits like a truck",
        "This is going to be the first gen that i probably use a grass starter but i am not fond of any of the designs this time",
        "I think this may be the first time I don't use my starter",
        "IMHO game freak dropped the ball this time. Grass and water starters final evolutions look kinda stupid. My entire friend group agrees.",
        "Nobody’s two-shot biting a fully evolved starter with 104 base hp and 100 base defense.",
        "Ah yes a fire type crocodile but it can't go in water",
        "I’m going for sceledirge I heard a prediction months ago about it being ghost fire crocodile all my friends doubted it and said it’s unrealistic",
        "I am shocked. Quaquaval turned out to be my favourite of the three.  I’ve always loved the carnival aesthetic and I’m pleased with how they translated it in the starter.",
        "Who is the grass ground pokemon he referenced?",
        "I can't wait to get this game and your channel is my go to when I need help/info. I love how respectful you are when discussing possible spoilers when a lot of youtubers just want to be as shock-value as possible. Looking forward to the guides you'll have for future videos.",
        "To be honest I don’t love any of them",
        "MEOWSCARADA IS SO GOOD!!  I actually like them all though, I wasn’t expecting to",
        "Does Skeledirge look different if female?",
        "WHY ARE GAMEFREAK SO OBSESSED WITH MAKING THINGS BIPEDAL",
        "Would love to know what moves you ended with for Grass and Water",
        "I'm so happy they didn't make another bipedal last evolution for the fire starter.",
        "I'm excited to play around with a tanky fire starter.",
        "Thanks for this coverage, Austin! I'm still going for Quaxly but now I'm seeing this gives me second thoughts haha",
        "Bought the whole Nintendo switch special edition double pack, so I’m gonna start with all 3! ",
        "And now everyone is gonna rage",
        "I said it when I saw the leaks, I’ll say it again, my gut instinct was right, I don’t like Skeledirge, but I LOVE the other two. Though, considering my favorite Pokémon is Primarina, that tracks.",
        "fuecoco final looks like centipeetle. I can look at it without hearing those whimpering noises",
        "I knew I was gonna choose fuecoco from the start, I always choose the reptile starter when possible, I’m really happy how it turned out! The long snout reminds me of a gharial, and the fire/ghost typing is perfect!",
        "They just love making humanoid starters now",
        "They just don’t feel like Pokémon",
        "Ehhhhhhh, I think I know what my starter is gonna be…. Come on TicTocCroc, the only cool looking one!  Probably gonna work with the others to see if they’re good but def not gonna start with them.",
        "Quaqiaval is my favorite final evolution design tho I do think red was the wrong choice in color. Maybe they were trying to keep from being too feminine with it.",
        "Quaquaval is gorgeous and I’m excited. On my way to the mall to get my pre-order Violet.",
        "I love how all of the evolutions grow into festival themes. I'm actually impressed at Meowscarada's design after the thief look in the second stage. It's like a masquerading cat's paw",
        "I love them all!!",
        "Ive been torn between quaxly and sprig. I might choose quaxly because of yhe better typing though",
        "18:39 that is the bird from ACNH 100% the carnival bird... thats the first thing I saw. ugh. Awful final forms... 20:38 lmfao blamin the cat when the bird is doin zoomies all over the screen",
        "The middle evos this gen are top tier in my opinion",
        "Yo can I somehow get your number cus my crocalor hasn’t learned snarl to flamethrower and haven’t evoleved",
        "Can Skeliderge not learn Trick Room? That would solve the speed issue right?",
        "fuecoco is so cute and i love its evolutions! keeping my fire-type-always decision",
        "MEOWSCARADA SO CUTE",
        "Duck boi coming in clutch!",
        "Quaquaval actually looks cool. Skeledirge looks really bad, like a stiff clown-croc.",
        "Why cant we just keep them animals ",
        "So sprigatatio doesn't get  a signature move?",
        "Hi I been watching you for 1 in half and you show us when they evolve . Why didn't you show  us when sprigatito evolves' into a second form?!!!",
        "Watching this has confirmed my choice! I had almost no expectations for these guys so seeing them was cool. I couldnt wait until tomorrow haha. I might be in the minority here bit I do not think Skeledirge looks that cool but maybe that's just seeing it on a small screen. I'm still choosing Sprigatito tomorrow and that middle evo might be one of my new favs",
        "I hate the duck fully, and Sprigatito's final evo is ugly asf.\n\nTeam Fuecoco all day everyday.",
        "Revealing them at the end and telling us about them first wow you are amazing",
        "Starters get more gay in every generation.",
        "Skeledirge is the best one",
        "So do you want to use adamant or jolly quaxly?",
        "Quaquaval honestly looks really cool! But since my sister is choosing Quaxly, I’m still going for Sprigatito, and this Meowscarada.",
        "GUYS, I NEED HELP! Should I name my sprigatito, “Asparagus” or “Can Noire” (from miraculous ladybug)\n\nPls tell me.",
        "Final forms are such a disappointing design this gen, just going to stick with Floragato until level 99",
        "For some reason, the second evolution of the duck (forgot the name, sorry) kinda reminded me of a ballerina from how it moved. And the third from the cat, I instantly thought of El Zorro. Just missing the rapier to complete the look.\nI wanted to get the cat, but now I'm liking the duck more, and I'm generally not a bit fan of Water Types. Guess there's a first time for everything!",
        "I want all 3. Someone trade me the other 2 please.",
        "how to get all 3 starters from the start? haha",
        "Low-key I might not use any of them for my play through... I'm REALLY not a fan of any of them",
        "Normally there is at least one that is kinda good looking, but this time they are all garbage af.",
        "Austin John has the shirt that I remember giving a friend of mine growing up who is obsessed with Nintendo. He would wear it whenever we played anything Nintendo. I want to get one myself at this point, too.",
        "I always look forward to your Pokemon videos  I definitely want Sprigatito. I like how fast they are and that Flower Trick is a guaranteed critical hit. I definitely prefer the 2nd evolution design but the final evolution is ok too  Thanks for the informative video!",
        "Meowscarada definitely has my fave design and I love a speedy attacker so he’s probably my pick. Quaquaval is close tho. Skeledirge I would never touch ",
        "Those stats though ",
        "fuegoatgoat with 3 100+ stats",
        "Quaqaval looks like a tiktoker",
        "Yeah i was gonna choose Fuecoco this video made me wanna choose it more",
        "How 77 hours of playtime before it's released in USA o.o",
        "Im very biased towards Grass type starters, but i might go Fire this time around. The Feucoco line is so unique.",
        "i am disappointed",
        "I love fuecoco’s evolutions so much!",
        "Question how long does it take to get to trades I want all 3 but don’t want to waste time if it will take to long.",
        "I just wish they stopped making them into furry esque beings",
        "It's just weird bec I honestly don't like the design of Fuecoco's evolution line, and I love Quaxly's. no hate ",
        "Meowscarada is wearing a masquerade ball mask. Could be meant to be a thief or just a person at a masquerade ball",
        "Nahh bro zesty",
        "I don't like that Fuecoco becomes Fire/Ghost, but Skeledirge is and awesome design.",
        "Not really a fan of any of these. I guess Skeliderge is okay, but I think I’ll be going with none of the above in my playthrough. Mareep shall be my starter",
        "I feel like the first forms were better on most of them, but I definitely wouldn't say any of the final forms look ugly by a long shot. Quaquaval is probably my least favorite shape-wise, but all their color pallets still look really good, and the concepts work decently well. Still sad we didn't get a Puss-in-boots inspired Sprigatito evolution, though.",
        "Jester kitty it is",
        "Well this is gonna be a tough choice. I think I'm gonna check what typing the Violett legendary has and decide based on that.",
        "If you enjoy this kind of content CONSIDER Subscribing! <3",
        "Uessss",
        "My first choice was Fuecoco but unfortunately there is another ghost type that I really want and I never double up on types. I hate the duck but I actually kind of like Meowscarada, even though I'm sick of starters being furries with jobs.",
        "I really love when people comment on the Quaxly line \"standing up right\" or being \"bipedal.\"\n\n...Birds only have two legs.",
        "They are all so…. Underwhelming",
        "It appears Feraligatr has met a rival. I know the type would mean Feraligatr wins but still.",
        "Not cooperating for a picture? Typical cat.",
        "Meowscarada should've stuck with the puss in boots theme, it's middle stage looked amazing and it should've kept that style\nEdit: also quaquaval will probably be the best competitively, his hidden ability is moxie so he can sweep and his signature move raises his speed every turn",
        "So disappointed with what could have been amazing evolutions",
        "I did not see quaxly 3 being a peacock coming",
        "This is my first time seeing all the final evolutions .. & I’m not impressed definitely feel let down",
        "My friend Tako and I are super excited. We're gonna name our starters with a shared theme, so it'll be fun. Sprigatito has my fav evo, Quaxly looks nice now that I've seen it properly, but Feucoco? No. I do not like it. Sounds like a beast tho, definitely gonna raise one.",
        "I like the idea behind Quaquaval, but I think it has the same problem Inteleon had. Not only does it look like a human, but the most skinny human the ever existed.",
        "7:22 A brooch is something you put in your hair to keep it from getting in your  face, Its a pin of sorts\n44:25 Light's laugh still gives me chills when I hear it to this day\n1:15:21 This is my favorite coryxkenshin moment",
        " I was so hype for skellidurge. After seeing his reveal, I’m not a fan. I thought he’d be awesome. Oddly enough, I like Quaxly’s final the best. Overall, I’m not overly impressed with any of their final designs. I guess I’m old school. Blastoise was my dude! charizard, typhlosion, and feraligatr were awesome designs as well. I even loved Greninja, decidueye, infernape, and incenaroar. IMO Skellidurge is my least favorite of the 3 currently. Maybe it’ll grow on me once I play the game",
        "All I'm hearing is skeledirge is good for trick room",
        "I saw that ducks name I can’t remembers line I choose fuecoco noq",
        "Floragato reminds me of Puss in Boots, a really strong design, a little sad to see its not fully carried over into the third stage. I really appreciate this video and all your helpful stat tips and tricks! My personal theory for starter Pokémon being more humanoid is because then they are more classified as \"friends\" or \"partners\" instead of pets like how a luxray or arcanine remain on all fours, even though I like those type of designs better.",
        "good god they dropped the ball with quaxly, i just can't bring myself to pick him now",
        "I love love love everything about meowscarada. im defo choosing it, and i always was going to anyways. this just solidifies my choice more tbh.",
        "Just realized floreatto is just killua and now I’m set on him when I get my game in a few hours",
        "Quaqaval is going to be my starter just because water and fighting is a good offensive typing. Plus I live the move feminine design that it takes on. I am a girly girl so I love any cute or girly designed Pokémon. Plus it’s stats are pretty well rounded. It will be nice for water fighting and ice moves.",
        "How do I evolve my starter Pokemon?",
        "these are literally the worst evo lines in the entire series.",
        "These starters are absolutely terrible. I miss the old Pokémon. ",
        "I still want meowscarda",
        "Welp, this would be the first pokemon game where I don't choose water to start.  \nAll three forms are the absolute lamest forms.  Why do they insist on Humanizing pokemon?  Whatever happened to the animal aspect?",
        "Games not even out yet for the public and man has 77 hours danggg",
        "WHY did they have to make it a cat that stands on two legs? WHY",
        "A quick correction Meowscarada’s name is a mix of meow and mascarada which is masquerade in Spanish so it’s based on a mask, not a jester",
        "I'm so upset that the mess up all 3 of these so much. They didn't  keep the cat on for legs and made him frail they put arms and legs on my snake stater. And they made my wizard duck physical...",
        "Can you easily get all 3 starters in a playthrough?!",
        "Thank you sooooo much for this video!!! The starters is THE info I’ve been wanting more than anything! You’re an angel.",
        "Wow quaxly evolution is gorgeous",
        "Crying at the final evos. Crying tears of sadness sniffle into the box graveyard you go cute grass cat..abandoned forever.",
        "Meowsquada yass based off zoro",
        "I feel like Fuecocco will be excellent for a trick room team in competitive play. I think it’ll just be a juggernaut with an assault vest equipped. I’m so excited to use it",
        "Meowscarada looks like it's going to a mascarade",
        "Honestly Skeledurge is my least favourite and Meowscarada is my favourite. I just think skeledurge is awkward looking",
        "Austin John Plays I have so much respect for you I've been watching your vids for years and have been a long time sub and you always have such high quality content and prioritize validity in your work even if it means losses and your always so straight forward you are AMAZING! Thank you for all of your hard work!!!!!",
        "Damn their final evolutions look so bad",
        "Honestly, probably be going with Fuecoco in the hopes that Totodile is introduced later (just love the idea of teaming up the crocodile duo), but IMO these are the worst starter designs to date. Not crazy about any of them, and even with choosing Fuecoco I'll likely remove him later in the game for something cooler.",
        "Well i guess tast is different ... imo the croc is the uglyest starter in any poke game ...",
        "I absolutely LOVE Quaquaval personally. I will admit, at first look, I wasn't too excited...and then I saw all his animations....and yeah. Yeah that was all it took to endear him to me loooool\n\nSkeledirge is just a liiiiiiiittle bit below Quaquaval when I'm considering who I like the most of the three starters. And I'm saying this as someone who liked Quaxly the least and Fuecoco the most at the start. Meowscarada has also grown on me by now too actually, although that one is my least favorite of the three.",
        "48:36 Lets just take a minute to appreciate how much time and work she put into these videos? Its unbelievable and I think they deserve a lot more than that <3",
        "The fire starter finally stays on all 4 legs, massive W",
        "I hate to say it because I was really hopeful about this generation but all the starters suck I’m probably just gonna use six normal Pokémon",
        "I'm sorry but I think the fire one looks the worst haha. And I'm a fire main as well!",
        "I'm definitely not choosing fuecoco any more",
        "I'm not a fan of the angular parts of Skeledirge's design but I'll still go with Fuecoco I think. I just like the first form the most. I actually think Quaquaval has the best  most cohesive design apart from the weird feet, even though it's not really to my taste. Has a lot of personality too.",
        "Meowscarada looks like a carnival magician not a jester it looks sooo good. And it has Protean completely removing its weaknesses",
        "Quaqaval looks amazing",
        "I'm gonna be honest, I'm pretty disappointed with all the final evolutions of the starters. I'm not really into de anthropomorphous look they gave Meowscarada and Quaquaval, and think they could have gone for way better designs if they kept the more \"animal\" look.",
        "I know the problem with my Typhlosion, it just one shots everything before they can use bite or crunch, very unfortunate for them :/",
        "Grass type has a myriad of weakness in general so adding a dark type at least balances",
        "It's been a few generations but I actually like all three starter designs. All of their secondary typings are nice too, I was a little worried that Quaxly's final evolution was going to by flying type.",
        "fuecoco can learn slack off as an egg move, it’ll be great for stalling turns",
        "so depressing how the only positive comments here are about competitive gameplay optimizing. designs are such trash",
        "W",
        "I absolute hate how the pokemon company doesn't give a damn about the wishes from fans. We all wished for non Human like Forms bc they look like furrys and not animals, and what did they do? Hate it so much. This would be the first game I don't want to play bc of how trashy this company is to us fans.",
        "How do you have the game already",
        "The final selfie attempt, every cat Guardian ever. Yes I will be getting the cat because it's a cat and that's the only reason why.",
        "Bro what is this the starters are so ugly ",
        "They are so bad, what a disappointment...",
        "Fuecoco was my favorite choice from minute one, and i am so happy he is the best looking final form of them all for me.\nSprigattito looks good in its final form, but Catwoman? seriously?\nAnd Quaxly becoming a Carneval/Flamenco Dancer is fitting for a water Bird Flamingo esque thing.",
        "Since it was announced I was going to choose fuecoco and that hasn't changed",
        "Another year, another pokemon, and we find ourselves back on Austin's channel before we all jump in on the game. Again, thank you Austin!",
        "6 on trending let’s go",
        "Dang I’m so disappointed when I don’t get the rap at the end on the videos. Anyone know where I can get it.",
        "They really have been letting us down with the starters.",
        "Fuecoco is about it. Otherwise ill just get other starters if you can trade them over.",
        "Notice the secondary types in their final stages, each gives them an advantage against the starter they're normally weak against.",
        "Genuinely like all three starters.  The looks, the stats, and the movepool.  Can't wait to have all three, but I get the feeling I'm going with feuccoco mostly because of my team composition",
        "I just clicked the video because I like your content not sure I want to see them yet",
        "I really liked Quaxly at first, it was my favorite starter, but now that I've seen it's final form I can say that I'm not a big fan of it even though it looks stunning and elegant. I'm personally more a fan of Sprigatito's final form and I think it will be my starter when I get my hand on the game. Fuecoco is my least favorite, but it still looks cool. Now I wanna see their shiny form !",
        "IMO.. the starters designs are garbage . I’ll get them for the Pokédex but I probably won’t be using them.",
        "The worst.",
        "These Pokémon don’t even fit in with each other and the 3d models make them look basic. This looks like vr chat",
        "Bruh…. Naruto run FTW!!!!! Definitely going with grass now ",
        "if i were to be honest, the designs of the final starter evos are ugly. humanoid final evos are weird. i prefer them more animal\nthan human. (skeledirge is not humanoid—but its design is also ugly. What’s happening with the designs of pokemon?) smh.",
        "I dont like any of the evoletion",
        "Cats getting dark type as a secondary typing is just perfect  First Inceroar, now Meowscarada",
        "Thumbnail kinda bright   no spoilers",
        "first time i dont like all the starters ",
        "I don’t like Pokémon berry much because of sprigititos evo(because it became a 2 legged animal…) \nBtw I’m not trying to be mean to pkmn",
        "How did he use all 3 starters???",
        "Finally! Thank you so much for showing the starters! ️ I’m going to choose Sprigatito!",
        "I really wanted to like Skeledirge. Fuecoco is easily my favorite of the base forms, but something about Skeledirge's shape and color scheme just doesn't do it for me. Looks like I'm going with Sprigatito",
        "Not really impressed by the designs the cats second stage is coo nd thats it...maybe the crocodile 3rd is coo but not really impressed...in my opinion ️",
        "I've been in love with all of their first evo designs since the first announcement, but at first was torn about their final stages. With time, I learned to like Quaquaval and Meowscarada a lot, and this video finally made me appreciate Skeledirge quite a lot too for his inspirations. \nThis gen is shaping to be very heavy inpired in Spanish culture and folklore which just makes it amazing. I've been waiting for a new dex that shakes me just like Gen 6 Pokémon did, I'm so hyped.",
        "Everyone told me Meowscarada looks awful because it stood on its hind legs, but honestly, I think they’re overreacting. I think the design and the shiny are great, imo.",
        "Keeping sprig, second form and calling it killua cus of the yoyo ",
        "IDK why some people hates Floragato like come on man we already have fury humanoid Pokemon (Incineroar)️",
        "These look underwhelming think i'm gonna put off getting this game for now",
        "Easily sprigatito wins. Quaxly looks like its gonna call me a slur and almost all fire types are a sin.",
        "I think meowscarada is supposed to be a magician, kinda fits the whole carnival/festival entertainers, Magician, Singer, and Dancer.",
        "To me, floragato seems like it should be a middle evolution of riolu and lucario",
        "Do you get the legendary at the beginning of the game?",
        "Is it just me or does this generation’s starter seem more viva piñata characters ",
        "2nd fire type looks trash!! Stupid sombrero on his head!? Meanwhile, water type reminds me of sonic the hedgehog  ",
        "Skeledirg looks like a clown alligator to me, but to be fair, they all are a bit disappointing statwise.  Which tracks to me, I guess, I did not use any of my starters in Arceus and Eevee is gorgeous and love petting her, but I do not really like using her in battle... Starters feel more like emotional companions than warriors for the cause of making me the very best.",
        "Soo two gay final forms and one dope ass crocodile  damn nintendo what's up with you right now??",
        "i'm obsessed with sprigatito's final evo, i'm not even mad it ended up on 2 legs because it's so pretty ♡\nand i didn't like quaxly at first but it's final evo is amazing, i can't wait to have these 2 on my teams ☆",
        "How soon in the game are you able to get the other two starters?",
        "Been waiting for this video for ages! And btw, I really appreciate the sensitivity you are putting into the videos regarding how you reveal info. It’s so useful for those that want some secrets. Much appreciated!",
        "So very tempted to go with a floragato with eviolite ",
        "They’re all so bad",
        "Fun fact, Meowscarada is actually a magician",
        "Thanks for this video. It's very helpful. This might stop me from getting a bad starter",
        "wait pokemon scarlet and violet is out",
        "bro why isnt Skeledirge a giant dino thats what i thought",
        "I can see fuecoco in trick room teams",
        "The number one thing? Dude it was leaked last week. Where you been? In the hospital? Lmao late last video and really late now even more lol credential just went down again lol btw say Arceus for us again lmfao",
        "Clown Crocodile over the water Blaziken?",
        "Quaxly best starter",
        "I didn't like this presentation....explaining the third forms with the stage 2's on screen was annoying. A spoiler alert was more than enough...nobody who doesn't want to be here wouldn't be here. but whatever.",
        "Homie read the letter and spent the next two years collecting receipts. I respect the level of patience",
        "Idk who to choose. I like carnival and die de muertos",
        "Eeeh they look like humans.  Except for the crocko Boi. I'm not a fan. Was soooooo hoping The kitty would stay on 4s. Great video btw!",
        "Not gonna lie, I hate all of the final forms",
        "I was so ready to pick quaxly, but the final form ruins it. No idea who I'm picking now...  But leaning towards the grass type. It was my least favorite at first but they really brought it back!",
        "How many times do most fans have to scream that we don’t want humanoid starters  anyway thanks for the great videos!!! You’re the best!",
        "Can you catch the other two starters in the wild ?",
        "Quaxly's line is clearly David Bowie inspired, like how the Galarian Zigzagoon line was KISS themed.",
        "I hope that the evolution mechanic is the same in “Legends Arceus” hope we don’t go backwards, instead I hope we go same way for “Legends Arceus!?”\nI hope…",
        "Like the state of the world, Pokemon designs just keeping getting worst.",
        "I don’t know which game to get. I’ve never been so split. I like Miraison just a tad better. And I like ceruledge, but I like the past forms more. It’s like I like half of the version exclusives in each",
        "Kinda funny how my favorite and least favorite completely reversed\nWhen the starters were first announced I was fully expecting sprigatito to be my favorite but then it had to stand up so here we are",
        "I was worried about the sprigatito line buy they actually look really cool",
        "I'm a gen1-3 pokemon boomer, but I just feel like pokemon design just continually get dumber and they come with gimmicks that just get weirder.",
        "Thank you for putting extra spoiler steps in the video. I came here to be fully spoiled but if I only wanted a little bit of information that would have saved me.",
        "Quackhiavelli RIP Tupac",
        "I've been ride or die Fuecocco day one, and I am not dissapointed. Must say Quaxlys final form looks awesome too, I really like it. I do kinda wish that Sprigattito stayed as a 4 legged creature tho, but I like the jester inspiration.",
        "i chose Quaquaval cause it looks like a flamenco dancer.",
        "Thanks for not spoiling them in the thumbnail! I appreciate you!",
        "Timid Nature Fuecoco right off the bat.",
        "I went in blind not knowing the evolutions and I hated each one I am honeslty so disappointed and heartbroken\n\nEnded up ditching all 3",
        "I love everything about Skeledirge. Dirge is \"a lament of the dead\" and comes from Spanish/Latin Dirige, Domine, Deus meus, in conspectu tuo viam meam. That makes sense given its signature move \"Torch Song\". To further explain, this is more based in Christianity/Catholicism than anything else. ",
        "did not change.. still going for quaxly",
        "So how do I increase the speed of my fire starter?",
        "My game came in today, I thought it wasnt supposed to be out until tomorrow?",
        "I think all there hidden abilities are great willing to try them all out even though protean is nerfed",
        "I'm absolutely going with Meowscarada. I don't think the final evo looks too bad. I'd figure out a way to work around it's weaknesses somehow. ",
        "These are probably the worst starters designs. I guess I'll be rolling a die to decide which one I pick.",
        "just want to say thank you for those of you posting positive comments, i was really struggling with this starters and thinking they were lack luster...and sorta the worst we've seen.\nBut the way you talk about them, pointing out the themes / inspiration of them, I'm starting to grow to like them...personally went Fire croc, hoping his design grows on me as I bond with him haha!",
        "I personally have loved Fuecoco the most out of the three before I knew anything about them, and Skeledirge just solidifies my view of him. Definitely going with the little ghost pepper",
        "ehh underwhelming",
        "If anything Meowscarada looks like a phantom thief... Protean is also its hidden ability. Once I find an ability patch, it's going on mine and I can't wait to have it be overpowered",
        "JESTER, DANCER, CLOWN!!!!! OK THATS HONESTLY COOL!",
        "The Meowscarada definitely reminds me of the Nights games that came out back in the early 2000s, great designs for all three really ",
        "Are the starters hidden abilities locked at the beginning?",
        "Female Quaxly it is ",
        "Kinda odd, this Gen feels like you really are supposed to Box your Starter Pokémon after a while (if not right away?). It's the first time I've seen Starters not be somewhat beefy.",
        "Fuecoco all the way. Bust out trick room and stack those special boosts and sweep  everything away. Excited to get my hands on it soon.",
        "Sprigs, full evolution is a gun powder rebellion era soldier in a masquerade mask. Famously Guy Fawkes was a member and his mask inspired v for vendetta and the anonymous mask",
        "The Fanarts are much better than THIS wtf\nI saw so much potential for the duck... But now... No..",
        "I love meowscarada . He has a literally floating piece of grass ",
        "Meganium isn't the worst grass type anymore austin lol",
        "",
        "Haven't liked any of the starters in a while... I guess Pokemon just aren't for me anymore, which is sad. I'm sure there are plenty that will love them though.",
        "I like the fuecoco design theme of starting a nest with a couple twigs, to laying the egg and finally having the baby bird hatch. Definitely choosing him when I get the game",
        "I thought the fire type middle form was gonna have a nest and egg on its head",
        "I decided on grass cat and pokemon scarlet when they first announced the game and i haven't changed my mind",
        "How do you get all three starters at the same time? It's been awhile since I played any form of Pokemon",
        "I saw someone say that the \"sombrero\" is actually a nest with an egg that hatches to be that little flame wisp",
        "Definitely choosing the cat. I think the cat has the best designs too.",
        "Can you farm the hiden hability of the starters at the start? Or is locked?",
        "I actually like Meowscarada more than I thought I would.  But, I’m still Team Skeledirge.  I kinda wish he kept the sombrero though because that was hilarious/awesome to me when I first saw mine evolve.",
        "I’m glad my friends were so adamant on their starters cause I definitely got the coolest one as leftovers  I love how Skeledirge’s cry reverberates it gives off a menacing aura worthy of my team’s head. I’m not a competitive battler but I’ll defo look into upping its speed ",
        "Learning the moves and stats for quaquaval made me so much more excited for it",
        "THESE FINAL EVOLUTIONS ARE SO SMALL...",
        "I’m gonna choose Fuecoco because he is by far the best design, he looks so fun",
        "They're all performer  based, with a lean towards Carnival/Carnaval.",
        "Quaxly’s whole evolution line is probably my favorite",
        "Despite it being extremely slow, I absolutely love the design they gave to skelidurge so Ima pick fuecoco!",
        "Team Skeledirge all the effing way.",
        "Ooooof the people in the background around  17:25 had like 15 fps.\n\nAlso meowscarada sounds like a pun or a play of the word masquerade, perhaps that is the reference?",
        "Oh no, you mean I can't walk through the game with one pokemon and I have to actually build a team? Not a big problem! I think they all look good in their own way!",
        "What did they do to sprigatito ;--; im no longer choosing him what the hell is that he was done dirty",
        "I love cats, so i was stoked for a grass cat. as long as it didn't end up like delfox. and it's better than that, so I'm good :) i like the design :D type match up isnt the best, but i can work with that.",
        "I was hoping Quaxly would be a pirate.. NOT A TAP DANCER",
        "Meowscarada is so awesome I love it’s design and inspiration, I’m getting one and naming it Dimentio! \nSkeledirge is a close second for me, the concept of a singing flame monster is kind of awesome to me.\nDancing duck is not for me, but I’m glad it has its audience.",
        "Going with Meowscarada. I personally think the designs “ok-ish” but I’m mainly getting it because it balances out my Pokémon team I have set and it has a pretty good ability that turns it into the typing of the move(s) that it uses.",
        "The duck has the Jack Sparrow run and that's what sells me on it in all honesty.",
        "If I’m going to say anything, the Sprigatito line is the best that stands on two legs haha",
        "Honestly,we all knew that sprigatitos forms would be bipedal,we just didn’t want to believe it",
        "I'm so glade I found this video before I decided to pick up ether Scarlet or Violet. Cause now knowing what etch of the starters evolves into  quite honestly makes me excited to play this generation. And as much as I like my water type starters, I will admit Fuecoc's evo line dose look the best.",
        "They all look bad in my opinion",
        "I MISS Grooky....that was a cool grass typ.",
        "I’m not actually gonna watch the video, because I wanna go into the game blind, but thank you SO MUCH for not including the evos in the actual thumbnail and spoiling it",
        "Meowscarada reminds me a bit of Zorro",
        "meowscarada is more mascarade than court gester",
        "I'm gonna be needing an everstone...",
        "Grass final evo is absolute trash. These designs keep getting worse and worse every gen. But I'm still gonna play the game ",
        "When can we start trading?",
        "Fuecoco was my starter until I saw the final evos. Now it’s sprigatito for sure!",
        "Man this really threw me off, I was for sure going sprig but now I’m thinking quaqua",
        "Why gamefreak does always the same, you have a great second stage starter, and they ruin it in the final stage. They did it with trecko, them with Litten, and now with spigatito",
        "Funnily enough I like Meowscarad's design the most, but I also just mainly choose grass starters anyway. The Fuecoco's final evolution also looks pretty cool. I want ceruledge  so I probably won't be using Fuecoco",
        "I was really hoping the starter leaks were photoshopped in some way… the design team realized messed up with these starters.",
        "I think Fuecoco's final evo looks very cool",
        "I can’t choose they all look stupid, fire one just a clown. Hope next gen they start bringing back the old starter styles.",
        "Did you obtain all the three starters by online trade or is it possible with the normal playing?",
        "Yesssss I've been waiting for this, thank you so much for your coverage!!! \nHaven't been this excited for a new gen for a while but this one seems awesome! Can't wait to play it myself and all the upcoming videos, Austin ",
        "i am kinda disappointed of the design",
        "No lie, pretty disappointed with them all. Probably not a popular opinion.",
        "I think that if you go for a Poison or Fire Terastal type on Meowscarada, you can really deal with a bunch of those counters, 4 to be exact, though, you do gain other counters.\n\nI might go Meowscarada. The Signature Move Flower Trick is a guaranteed critical hit, which is basically a guaranteed crit on the 70 base power which will benefit from the high speed and high physical attack of Meowscarada. A Fire or Poison(preferably poison because likely a poison attack in usual moveset and less weaknesses) Terastal Type will help deal with counters being only weak to Ground and Psychic at 2 times and resisting 4 previous weaknesses of Fighting, Bug, Poison, and Fairy. If you keep Grass, Dark, and Poison damage moves on Meowscarada then Terastal, you can then 2 times 7 different types including Psychic and Ground, a Poison type's weakness. So I would go Flower Trick, Crunch(Night Slash if can't get Crunch), Poison Jab/Poison Fang(Poison Fang badly poisons which is a poison that gets worse, though Poison Fang has 50 Base Power compared to Poison Jab's 80 Base Power. All this depends on what Meowscarada can learn though), and something else.",
        "The duck is horrendous imo",
        "W VID LOVE THE CONTENT",
        "Personally, I done like any of the designs. Kinda disappointed ngl. (Sorry to those who disagree, but it's the truth)",
        "Fuecoco and her evolutions honestly look like Alabrija and it’s actually REALLY cute",
        "fuecoco is defiantly my starter",
        "Considering I never had an issue with fire/ghost Typhlosion and bite I'll have no problem with Skeledirge here. Also love the gay duck and it was funny how meowsquarada just acted like a cat at the end!",
        "At first I was going to choose the water starter because I liked the whole little sailor thing it had going but seeing what it eventually evolves into it’s just not for me, I’m definitely going with the grass starter now I actually really like it’s final evolution and grass/dark is a cool type in my opinion. Thank you for your wonderful videos Austin!",
        "The prophecies were true…",
        "Spoilers, games isn't out for most yet, it's just November 17 Thursday until midnight tonight when becomes the 18 it's not avaibke",
        "They’re all “butt”, therefore I will be picking Quaxly and naming it ButtQuax.",
        "For me it reminds me of a Arrancar from bleach, the grass type I mean",
        "I heard you can get all the gen 9 starters in the post game if true where can you get them ?",
        "It's not a Sombrero, it's a bird's nest, hints why the final form has a fire bird on its nose and it's special ability sends out a firebird/Phoenix",
        "I think the thing on crocalor is a egg in a nest that's whySkeledirge\nHas a little fire bird on his nose",
        "My quaxley is level 17 and still hasn’t evolved?",
        "See, I like Skeledrige’s design. I do. I get it’s super slow. But my only complaint is that yes he’s cool. Yes, he has a fire power up punch basically. But I don’t want to have to go through the process of having to get all these items just to raise that already abysmal speed stat a bit to make him viable. If he was naturally even a bit faster, maybe. But with such a low speed stat, I would probably focus on making him tanky as crap.",
        "NOOOOO THEY DIDNT KEEP THE CAT ON FOUR LEGS",
        "i am a water/fire starter picker in most games. but after seeing sprigatito's final evolution im going with sprigatito.",
        "What are those type match ups? Of course the primary typing where  beats  which beats  which beats  but then it goes backwards from  beats  which beats , but  doesnt beat  so Quaxly would be the better choice because it beats Skeledirge and Meowscarada",
        "I am hoping that eventually there is a move called false swap. It would be essentially the illusion ability but as a move that makes it look like you are switching out",
        "My quaxly is level 16 and hasn’t evolved. I haven’t gotten to the lighthouse yet so I don’t think I’m done with the tutorial. Is that the reason or is it something else?",
        "Not gonna lie, despite hoping that Sprigatito would remain bipedal, this one looks pretty damn good, so I like it. Guess it was the right decision to go with the Grass Starter :D",
        "Definitely picking Fuecoco.  I picked it when they were first revealed and I've loved everything I've found out.  Absolutely love the typing.  Fire and ghost are two of my favorite types.",
        "I’m glad you did this video because I was gonna go with sprigatito but after seeing that final evolution I’ll be going with my second choice of croc boyo",
        "it might be weird the way that he takes naps but hes a choir/band/art major kid, nothing new.",
        "Meowscarada gonna be the new grovile where people like his design over sceptile",
        "150% picking fuecoco. Love how it looks throughout the line- the little “hat” in the second evo had me laughing so hard but in a good way, it’s adorable. Also when it was taking a siesta, loved it more. I loved your edit with the music with the reveal of it too. The final evo also takes it from cute/goofy to badass. As always, you kill it with all the info. I cannot wait to play this game!",
        "Finally I can watch this video lol",
        "PLA's evolution animation is still the best imo ️\n\nStill gonna pick Fuecoco ",
        "My team so far consists of Meowscarada, Ceruledge & Tinkaton excited to see who else is going to join them! Thanks for the video as always",
        "How do u get all three starters.",
        "Definitely getting Quaquavaul ",
        "Idk why but seeing him for the first time and the music and the sombrero all at once made me so happy I’m picking him",
        "Seems like he's similar to emboar",
        "Meowscarada looks like a persona character",
        "I’m definitely sticking with my grass starter, it looks pretty good in my opinion",
        "OMG THE FUECOCO EVO IS A REBIRTH CYCLE. the little sombrero is actually a nest for a little fire egg when it evolves its a little bird soul",
        "Fire and grass are miles better than water this gen. Hasn’t been a good looking water starter since gen 6",
        "Skeledirge is very underwhelming and honestly it looks too small. It's body is also very bare-bones and is boring to look at. Meowscarada is iffy for me, as I didn't really mind it becoming bipedal, but it has a very plain design. Also, it's high. Quaquaval is my pick. It looks so cool, the colors blend nice, and I think that one attack animation is based on a peacock. Let's face it; we needed a peacock Pokémon. Plus, I'm planning on having Armarouge on my team, so that's a no for Fuecoco.",
        "Thanks Austin, this convinced me to box my starter as soon as I get it.",
        "Quackquaval is the epitome of \"Here comes the hurricane, bitch! OW! Katrina, Katrina, Katrina!\"",
        "Now what have you done now Meowscarada is on two legs thanks to Gamefreak lol.",
        "Meowscarada is my favourite design. I think I’ll use that one, but keep it with U turn. It’s hidden ability would make it better, if I’m right. But I don’t know if there’s a way to get an ability patch or something before the post game.",
        "Honestly for me the sprigatito line seems the best. the whole evolution line it's like a thief story. The young and pure sprigatito who turned into the naive trickster floragato due to some dark circumstances. The immature floragato who learn from its mistakes and became a much more calm, calculating and sinister meowscarada - the magician crime lord which it's always one step ahead of everyone. Its like a combination of Loki and the Joker, i love it and i am definitely going for Sprigatito",
        "20:28 \"Look how gayly I run\"",
        "Meowscarada is supposed to be a phantom theif, like arsene, or joker",
        "I really like the signature moves, they fit the identity of each pokemon really well",
        "Grass cat has protean hidden ability. It’s automatically gonna cover up that type weakness",
        "I  their final designs!! ",
        "i actually like that water duck's final design, the peacock feather thing that appears is really fun",
        "It comes out on my Bday. Can't wait for it to arrive. I'm losing my mind waiting ",
        "I love all three. YouTube I guess doesn’t let me say what I really want to so instead imma say they just like me fr  I think this is the first full starter trio I really enjoy since sinnoh",
        "i wouldn't say 85 speed is bad, more like average",
        "Can I choose Pikachu as starter? lol",
        "Well, when I get the game I'm getting a grass type lol",
        "Bruh, we asked for Sprigatito to not be bipedal. Damn you GameFreak…. Quaxly it is",
        "ITS A CAT BURGALAR!",
        "L starters",
        "Going with all 3! What was the easiest way you found to transfer? I’m thinking about starting a game on one switch, and on my secondary switch trade all to the first. Then swap over 2 back. Should be fun",
        "i want to like quaquaval but the movements are too much",
        "Does nature mints permenatly recude attack and increase speed? if not what does. bc i rly want skeledurge",
        "Fun fact: did you know a male crocodile is called a bull. If you know where I’m going with this you are amazing.",
        "I can't wait to play Violet!!!",
        "I thought Gen 8 starters were bad....this just makes me appreciate them even more now.",
        "Im not using any of those in my playthrough.. I dont really like the design.. There were better fan made designs like brute captain and a fat crocodile.. Im very disappointed",
        "Wow you can tell game freak did like so little culture check. Why are they using Mexican, Brazilian, etc inspiration for a game that takes place in what’s suppose to be something like Spain.  it’s like they just added whatever seems Spanish.",
        "The supposedly bad typings aren't an issue at all for me. I always find ways to get around the weaknesses. It's a tossup between the cat and the duck, but that depends on what another family member is picking.",
        "They’re all awful. \n\nprays for a Pokemon reboot",
        "Meowscarada looks like a persona.",
        "Sounds like Skeledirge would do well in Trickroom",
        "ive been super sick and bedridden ever since this series started, these videos are keeping me sane lmao",
        "STOP MAKING MY CAT POKÉMON RUN ON TWO LEGS! FAAKKKKK! WEED KITTY IS RUINED!  still gonna pick her on my Violet play through tho. Thinking Ducky boy for Scarlet",
        "Is there a way to pass on all these starter Pokémon and get sword and shield starters instead? I swear the Pokémon just keep going downhill in design. Some of the fan art for the starters is way better than this game.",
        "Looks like a phantom thief from Persona 5",
        "Aaaaaa I love meowscarada even more now that I see them move and from multiple angles!",
        "Not gonna lie, I can't unsee Skeledirge's Power Donut haircut.",
        "Honestly I only buy Pokémon games after I see the whole pokedex. I would rather know what Pokémon I’m going to get.",
        "WHEN WILL OUR CAT POKEMON STAY ON 4 LEGS DAMN IT",
        "Meowcarada looks awesome, definitely my pick.",
        "SKELEDIRGE HAS A FIRE BIRD ON ITS NOSE OMG, what a cute nod to irl gator/croc and bird symbiotic relationships :D",
        "2:57 is that really how they come out of pokeballs? Why didn’t they do it like legends arceus it looks like it just spawned out of thin air",
        "I really like Quaquaval's design! I like meowscarada design but I think it could be a little better",
        "Why does Quaquaval run like a gay man in a library?",
        "No idea what Austin is talking about, Meowskarada looks awesome. A bit like a Digimon, but I don't mind that"
    ],
    "comments_disabled": false
}