{"video_id": "j09jcgNPolQ", "comments": ["fuecoco can learn slack off as an egg move, it’ll be great for stalling turns", "With that speed and movepool, Meowscarada is gonna be a crit machine, if you want to set it up that way. It also getting Play Rough by level up is insane and will give it a good way to check it’s Fighting weakness. I can’t wait to use this thing tomorrow.", "I love how all of the evolutions grow into festival themes. I'm actually impressed at Meowscarada's design after the thief look in the second stage. It's like a masquerading cat's paw", "One of the best things about this dude is that he never takes credit for himself when he uploads something. He always respects us, the audience, and he is always full of energy in his videos. Keep up the hard work! :o", "I love how Skeledirge and Meowscarada are chill and Quaquaval is running around frantically, that duck has so much personality, I love it", "I like the idea of the starters not being dramatically strong! Makes you more apt to use a diverse team", "I used to dance competitively. I immediately recognized the sleep animation as a very common stretch for warming up. A neat detail, honestly. It also feels pretty good because its not very intense, and just generally loosens things up.", "I've been ride or die Fuecocco day one, and I am not dissapointed. Must say Quaxlys final form looks awesome too, I really like it. I do kinda wish that Sprigattito stayed as a 4 legged creature tho, but I like the jester inspiration.", "Floragato reminds me of Puss in Boots, a really strong design, a little sad to see its not fully carried over into the third stage. I really appreciate this video and all your helpful stat tips and tricks! My personal theory for starter Pokémon being more humanoid is because then they are more classified as \"friends\" or \"partners\" instead of pets like how a luxray or arcanine remain on all fours, even though I like those type of designs better.", "Love Meowsarada’s design. Could team it up with Delphox and make a magician and magician’s assistant kinda thing ", "I really liked Quaxly at first, it was my favorite starter, but now that I've seen it's final form I can say that I'm not a big fan of it even though it looks stunning and elegant. I'm personally more a fan of Sprigatito's final form and I think it will be my starter when I get my hand on the game. Fuecoco is my least favorite, but it still looks cool. Now I wanna see their shiny form !", "Definitely going with Sprigatito. \nI’d say that Meowscarada is very much still a thief though, as it’s name seems to be a play on the word Masquerade and it’s mask is similar to a masquerade mask. I can’t quite to recall the name of this type of thief but the Phantom Thieves from Persona 5 do come to mind. Totally naming mine Morgana.", "I love Austin John when ever there is a new Pokémon game and he is really good about spoilers and leaks. Love the work man ", "Thanks for the time and effort you put into these videos Austin! By far the best YouTube channel out there covering Pokemon   brilliant content and coverage every single time!", "Meowscarada looks like a carnival magician not a jester it looks sooo good. And it has Protean completely removing its weaknesses", "Really like how you laid out the video, showing details/stats/typing without spoiling the final form!", "imma be real, all the final forms are awesome; i especially love Quax and Sprig's.\nalso, Meowscarada is likely a masquerade partygoer, not a jester lol. Masquerades are known for being mysterious, as you never know who you're dancing with under the mask.", "I was kinda hoping for Sprigatito to go down the Zorro/Puss-in-Boots kinda route, especially seeing how Floragato had a thief aesthetic. But Meowscarada has grown on me, and the jester/assassin aesthetic is pretty cool", "I am going Quaxley, I like how the final form animates and gets the showy tail feathers, I kind of wish they tail feathers always looks that way.", "I really love Quaxly and his evolutions, they are all so interesting and the final form makes a lot of sense. Plus I love all the secondary typings", "I already loved Quaquaval’s evolution but learning more about its movepool and stats make me really excited to pick it for my first play through!", "It's been a few generations but I actually like all three starter designs. All of their secondary typings are nice too, I was a little worried that Quaxly's final evolution was going to by flying type.", "I usually pick pokemon based on looks more than stats, but i couldn't even focus on stats bc the pokemon were constantly doing something and felt so much more alive and had more personality in their animations! that said, I love quaxly's line so much and I'm so glad I'm sticking with it", "Meowscarada is my choice still despite the bad match-ups with types. I really do love the design as it reminds me of a mix between a cat, Dark Magician, and Tuxedo Mask.", "Grass type all the way , love the design all throughout and the move pool is INSANE , gonna reset for either adamant to guarantee oko or jolly to capitalize even more on speed", "Quaquaval is going to be really good for competitive its like an auto setting up sweeper with moxie as a hidden ability", "I personally have loved Fuecoco the most out of the three before I knew anything about them, and Skeledirge just solidifies my view of him. Definitely going with the little ghost pepper", "My team so far consists of Meowscarada, Ceruledge & Tinkaton excited to see who else is going to join them! Thanks for the video as always", "The starters are really solid all in all this gen. And their hidden abilities are also good. But I think Meowscarada is going to dominate when it gets it's hidden ability since it basically turns it into a physical Greninja.", "I feel like Fuecocco will be excellent for a trick room team in competitive play. I think it’ll just be a juggernaut with an assault vest equipped. I’m so excited to use it", "Design wise I REALLY like Meowscarada. Seeing the final forms has swayed my starter choice to grass cat", "Definitely going with Fuecoco now. Skeledirge looks really cool.", "I believe that the fire starter is based on the day of the dead and I just love that origin and it makes so much sense with the ghost type. I was going with fuecoco first anyway cuz he was adorable but the final Evo settles it for me he looks the best out of the 3 for sure.", "The grass and fire starters are my fave this gen. Loved Meowscarada's design and the weaknesses didn't bother me too much tbh. Grass types are my fave though. :3", "Finally! Thank you so much for showing the starters! ️ I’m going to choose Sprigatito!", "I’ve tried to avoid spoilers, but I had to watch this video to see the starters. I’ve been so indecisive and I’m even more indecisive! Thank you for the spoiler free videos as much as possible!!!", "I actually like all of these evolutions as far as how they look. Sadly, I'm not as big of a fan of their typings and stat coverage but honestly I think it'll be fine in the end. Normally on my first playthrough I start off the game with all three starters via trades from the other version just so that I can experience what they feel like in the game plus have them in my Pokedex. Knowing that Sprigatito is the fastest kind of makes me want to start with that Pokemon as my actual starter since I've always been a fan of fast Pokemon and less so slow Pokemon. Fuecoco feels like the Pokemon that I would start using and eventually replace with something else as I'm just not a fan of slow Pokemon but I'll definitely level them all to see.", "The Meowscarada definitely reminds me of the Nights games that came out back in the early 2000s, great designs for all three really ", "Smii7y doing content on multiple channels and still keeping up with schedules is incredible he puts a lot of effort in to doing these videos and its good to see how much he truly enjoys himself in them\n\nEdit: the editor(or editors) is great too for working hard enough to put together these videos for us to enjoy", "I think that if you go for a Poison or Fire Terastal type on Meowscarada, you can really deal with a bunch of those counters, 4 to be exact, though, you do gain other counters.\n\nI might go Meowscarada. The Signature Move Flower Trick is a guaranteed critical hit, which is basically a guaranteed crit on the 70 base power which will benefit from the high speed and high physical attack of Meowscarada. A Fire or Poison(preferably poison because likely a poison attack in usual moveset and less weaknesses) Terastal Type will help deal with counters being only weak to Ground and Psychic at 2 times and resisting 4 previous weaknesses of Fighting, Bug, Poison, and Fairy. If you keep Grass, Dark, and Poison damage moves on Meowscarada then Terastal, you can then 2 times 7 different types including Psychic and Ground, a Poison type's weakness. So I would go Flower Trick, Crunch(Night Slash if can't get Crunch), Poison Jab/Poison Fang(Poison Fang badly poisons which is a poison that gets worse, though Poison Fang has 50 Base Power compared to Poison Jab's 80 Base Power. All this depends on what Meowscarada can learn though), and something else.", "I started this video three times before finally deciding I wanted to see the evolutions but happily it didn’t change my starter decision! I wanted Quacksly for the Water/Flying combo, and I’m not a huge fan of the final form but I still like the move combo and the comments around their stats and type matchups kept me on the same path! ", "Seeing Quaquaval running really fast all around the place at the end when you were trying to take a photo of the starters had me dying XD", "Well, now I must find a way to get both the grass and water starters. I like Meowscarada because it reminds me of Delphox (my first Pokemon game was Pokemon Y, and I always chose Fennekin) but Quaquaval is more aesthetically pleasing to me...\nI will find a way. When Christmas comes so I can play Violet.", "I’m thinking of going with spirigato because it’s sort of a heavy hitter and a fast attacker which is what I always liked in Pokémon games and I love the design choices, I mean that last one kinda steps down but I like how fluffy it looks lol ", "Hey Austin I love your content! I was wondering if we can obtain the other starters in the game? Like from either wild encounters or post game?", "I think all 3 names for Sprigatito is amazing and decently clever!", "It's nice to see a bulky Fire type starter for once that ain't just Incineroar. We've seen tons of offensive Fire types and while I do love them, it's nice to see some variety too and it'll most definitely do good with the defenses if given a chance, especially with Slack Off.", "Now that I see Quaxly's final form in-game, I want to buy a second copy of one of them.", "Fuecoco and her evolutions honestly look like Alabrija and it’s actually REALLY cute", "I  their final designs!! ", "I chose Quaxly as my starter and I love the carnival dancer vibes, but I think I’ll do another playthrough to get Sleledirge", "Honestly my favourite design out of them all is Floragatos, but Grass/Dark is rough! Ironically, I'm going for Quaquaval who's design i like the least. Love the Water/Fighting type having just played through Legends with Decidueye Grass/Fighting *Chefs kiss*. Didn't even factor Skeledirge until AustinJohn mentioned how easy it was to fix their speed issues later on or atleast improve... But I'll stick to Quaxly... Though i do love Sprigattitos start & mid designs.... THIS IS HARD!!!", "Meowscrada is based off of Masquerade balls, where people ware intricate masks to hide their face. As you might assume, it becomes fairly easy for a person wearing a mask to do nefarious things without being caught... like a dark type.\nIn a side note: if the widely released hidden ability becomes available anytime in the next few months, most of Mewscrada's issues with their defenses should be mitigated.", "I think Skeledirge could preform as a great sweeper on a trick room team in doubles but the amount of rock moves in doubles could hold him back", "I was briefly leaning toward Fuecoco and Skeledirge for a bit, but out of the trio Sprigatito/Meowscarada remains my favorite in terms of design, stats, and style of play. I liked Sprigatito from the start so I undoubtedly will choose it when I get the game, but Fuecoco is a close second for me.", "i'm genuinely torn on who to choose. fuecoco is absolutely by far my favorite first form starter of the generation-- i LOVE how goofy he looks. but i really don't care for his middle and final evos, at least not yet. floragato is my favorite second stage of the gen, and quaquaval is probably my favorite final stage of the gen. it's really hard to choose! i know that if i chose quaxly i'd have the easiest time since i'd actually want to evolve it all the way, but i love fuecoco the most. if i chose fuecoco, i'd have a stage 1 starter the whole game because i don't want to evolve him. if i chose sprigatito, i'd have a stage 2 that i really like, but might not super want to evolve it past that. i dunno! i mostly play to have whatever pokemon i like the best on my team so i might just go with using fuecoco-- i'll have to see when my game comes in tomorrow! (:", "Despite it being extremely slow, I absolutely love the design they gave to skelidurge so Ima pick fuecoco!", "Tbh I’ve been playing for over a week and i love my skeledirge. both design and stats. i just happened to get a +speed -attack natured at start, didn’t even think to check. i was so excited for the game. once i saw what was up i put the power anklet on her and took er out in “lets go” and shes so fast now man", "I think Fuecoco's final evo looks very cool", "Austin John Plays I have so much respect for you I've been watching your vids for years and have been a long time sub and you always have such high quality content and prioritize validity in your work even if it means losses and your always so straight forward you are AMAZING! Thank you for all of your hard work!!!!!", "Fun Fact: each starter final evolution is based on a proformer. Skeledigre is a Singer, Meowscarada is a Jester/Magician, and Quaxaval is a Dancer", "Man, I actually love all three starters and their final evolutions this gen! Meowscarada was my least favorite until you pointed out that it resembles a jester, funnily enough... I freaking adore jesters. And while Skeledirge definitely looks awesome, Quaquaval actually has my absolute favorite design of the three! But I really love all of them and kinda want to do multiple playthroughs just so I can use each one (and very different teams of new Pokes!).", "Meowscarada is definitely the pick I’m going for. A guaranteed crit move that never misses is a huge deal I can just restart the game to get it with a nature that gives it better speed\n\nEdit: also it has great defense coverage. Weak against ice, fire, flying and bug types but it can learn Power Gem which can counter those problems", "Tbh the Ultra Beast that is a Firework thing Is also Fire Ghost but it’s pretty good and usually dies to itself with Mind Blown. Also I love all three of the Final Evols", "I started with Sun/Moon, so my first starter was Litten. Loved Litten to pieces, liked it a lot less in the final form personality-wise. So, wanting to avoid Dark typing but loving cats, naturally I picked Sprigatito. :P", "Meowscarada is definitely what I'm going for", "I would like Skeledirge a lot more if it didn't have the nose plume. So by default, Quaqaval is better for me and also, kinda just like that the aesthetic design they were going for is actually really apparent and obvious for it. Meowscarada looks good too, but is it supposed to be a masquerade hero, phantom thief, or like you said a jester.", "I was team Quaxly from the very beginning and still am, I adore Quaquaval!", "EXCELLENT format for an overview of the starters! Handled spoilers perfectly and gave valuable insight to help choose, especially the late game / end game viability versus early stat advantages.", "Im very biased towards Grass type starters, but i might go Fire this time around. The Feucoco line is so unique.", "I feel like skeldirige with Frick room could be a realy good combo, or hjust using evs and items.", "I’m gonna choose Fuecoco because he is by far the best design, he looks so fun", "Austin, quick question, slightly related. How long after the start of the game can you realistically trade over the other starters?", "When the started got revealed I thought I would take the duck and now I'm definitely going with the duck! A move that gives speed sounds good but not broken. Can't wait to get home from work and play", "Dude the dedication that goes into your channel is sometimes unbelievable\nWe appreciate the time and effort put into these games for us", "Thank you so much for not putting spoilers in the thumbnail. I got spoiled on the final boss of violet and I’m angry about it. I hate that you have to avoid the internet when a new game is coming out, that shouldn’t be a thing imo. You’re the best Austin :)", "I'm so glade I found this video before I decided to pick up ether Scarlet or Violet. Cause now knowing what etch of the starters evolves into  quite honestly makes me excited to play this generation. And as much as I like my water type starters, I will admit Fuecoc's evo line dose look the best.", "I still think I'm going with Sprigatito, but I am not sure if I am sticking the with nickname I had in mind. I was going to name it Spriggan, based on the fae lore and how dark it is (I suspected grass/dark from the beginning)", "Quaxly Was the starter I am going with anyway- I like picking water starters plus I figured out of the three this starter was would be the least picked. I’m also use to water Pokémon having weird looks until it’s last evolution (at least looks weird to me). I actually like the last evolution now I see it. \nI always enjoyed Pokémon that have a dance theme to it (like Lilligant, Bellossom, Kirlia, Meloetta- etc). ", "I absolutely LOVE Quaquaval personally. I will admit, at first look, I wasn't too excited...and then I saw all his animations....and yeah. Yeah that was all it took to endear him to me loooool\n\nSkeledirge is just a liiiiiiiittle bit below Quaquaval when I'm considering who I like the most of the three starters. And I'm saying this as someone who liked Quaxly the least and Fuecoco the most at the start. Meowscarada has also grown on me by now too actually, although that one is my least favorite of the three.", "I am shocked. Quaquaval turned out to be my favourite of the three.  I’ve always loved the carnival aesthetic and I’m pleased with how they translated it in the starter.", "I think all there hidden abilities are great willing to try them all out even though protean is nerfed", "Definitely going grass type.  I love the masquerade (mascarada in Spanish) aesthetic.    And the Skeledirge would be cool, if it wasn't for the flaming snot bubble coming out of his nose.", "Hi Austin John, thank you, for reviewing the 3 Starters Pokémon, I think, will go with the Blue one, which is the Water Type Pokémon, the Blue Water Type Pokémon final form looks like a peacock, well...to me the Blue Water Type Final Form looks like Peacock, well which is kinda ok with me, all of the Fire, Water, Grass Types Pokémons all is very Funny Looking, especially the final form of the 3 starters pokémons ", "Quaqaval is going to be my starter just because water and fighting is a good offensive typing. Plus I live the move feminine design that it takes on. I am a girly girl so I love any cute or girly designed Pokémon. Plus it’s stats are pretty well rounded. It will be nice for water fighting and ice moves.", "The water one I don’t hate. I already took Quaxly anyway it looks weird when it runs but the tail opening up looks cool.", "I love the sprigatito final design a little less than the second, but they're still by far my favourite... Especially after theif signature essentially being a grass frost breath :)", "can you do a video on how the raids will work and if they add a third type or if it replaces? Just wondering what starter to go with for the upcoming charizard raid", "These evolutions are amazing!", "7:22 A brooch is something you put in your hair to keep it from getting in your  face, Its a pin of sorts\n44:25 Light's laugh still gives me chills when I hear it to this day\n1:15:21 This is my favorite coryxkenshin moment", "48:36 Lets just take a minute to appreciate how much time and work she put into these videos? Its unbelievable and I think they deserve a lot more than that <3", "I’d honestly have to say that in terms of design relating to the region it’s amazing. Honestly no Pokémon starters have really done this where they have the final evolution heavily relate to the culture the region was based off (Spain) and I can really appreciate the uniqueness of it. It makes me wonder how new gens will base there starters off whatever region it may be.", "Definitely glad I chose Fuecoco, his final evo does not disappoint! It basically sealed my choice.", "I've been stuck deciding on quaxly and fuecoco for so long. Even after both final forms were leaked I still couldn't choose because I loved them both. But now after seeing stats I think I finally know. I'm gonna be best friends with that zesty duck", "I am hoping that eventually there is a move called false swap. It would be essentially the illusion ability but as a move that makes it look like you are switching out", "I actually like Meowscarada and Floragato is great too. I prefer them over the others.", "At first I was going to choose the water starter because I liked the whole little sailor thing it had going but seeing what it eventually evolves into it’s just not for me, I’m definitely going with the grass starter now I actually really like it’s final evolution and grass/dark is a cool type in my opinion. Thank you for your wonderful videos Austin!", "I saw the leaks that came out a week ago for the starter evolutions, and as a Quaxly enjoyer since day one, I was pleased to find that I liked Quaquaval the most. Even though I admit that it would've been SO MUCH COOLER as a pirate or sailor, the dancer theme is executed pretty well and isn't out of nowhere ((cough) Inteleon (cough)). The coolers go together very well and it has a very entertaining personality, which doesn't always work for me in starter Pokemon but this time I really like it", "I was mainly going for fuecoco at first but now I’m going for sprigattito", "I was thinking of breaking my tradition of going with the water starter, just because I love cats... However the Typing of Water/Fighting hasn't been on a Non-Legendary since Poliwrath in Gen 1... I'm totally getting that!"]}