{"video_id": "JZEsmQRLxy0", "comments": ["let’s take a moment to appreciate how this guy single handedly raised us when he was a child just like us", "he’s so calm and mature for 14- yet he is pretty entertaining. I’m happy he’s made some videos like this.", "This man is the definition of “worth the wait”", "No one can say that the kids grew up \"spoilt\" due to the fame and money because Ronald is a perfect example of maturity at a young age right here. I'm just so shocked to be back after years and see him look so different and sound different.", "he is aging with us. i genuinely cant wait for more videos he has had such a glow up and he is so calm and seems so well mannered x", "To be honest this guy really made me shocked. I’m older and I used to watch this guy but he seems more calm and mature than me and I honestly admire him.", "He seems like someone I’d feel comfortable around, he seems so chill tbh.", "god, this guy is aging with us. it’s amazing!", "This man is such a chad. Bro went from being funny and childish to mature and calm. Huge glow up my guy.", "The maturity difference between him and his sister is so damn much even tho she’s older.", "Damn, Ronald's just answering our year-worth questions these last few videos. Thanks, man", "he still has the same laugh,personality and everything yet deeper.", "Ronald now in my opinion is better when matured, a calmer version of himself is something I always wondering how it would play out\n\n(Also kinda feels relaxing after all the high energy sis vs bro gave us)", "Its crazy how chill he is, in the last video he posted the whole time I just really appreciated that he didnt' get up tight about what people of to say about him. It's very odd watching him now but he's turned into a very well mannered kind young man! :))", "As someone who absolutely adored rubber ducks for the majority of their childhood, this makes me so unconditionally happy", "bro literally raised us the way my cousins in a whole other continent speaking whole other languages watched their videos the fact we watched them together says wonders. i’m def rewatching the old sis vs bro for vibes even tho i’m way to old for them ", "his voice is so calming, like he’s more mature for his age he changed so much its crazy how hard puberty hits.", "I would really want Ronald to do some reaction videos as well. It’d be pretty fun lol.", "let’s take a moment to appreciate how beautifully this boy turn out, literally can’t say enough how happy i am to see you back ronald especially knowing you’re doing alright <3", "the fact that this guy the youngest in the family is addressing problems unlike the rest..", "The reason he is my favourite is that he addresses his problems, instead of avoiding them like his sister.", "You've actually grown a lot, sometimes we take certain things for granted and I really miss how y'all were back then. Though got shocked to see you active again! Truly glad to see you well and happy, and about you're height...", "Idk but his voice is still surprising everytime i hear him speak  cuz I'm way too used to \"hey peeps!\"", "he seems like such a sweet and genuine person. His voice is also so soothing and relaxing, glad he’s posting again can’t wait for more videos!!", "Oh God I miss thissss! I literally grew up watching him and karina. Like sometimes, I still go back to their channel and watch their old videos. Brings me back to my kid self (still a kid now though) the feeling is just unexplainable in a good way. And seeing him right now back on making videos, it makes me happy. I like how he's become. He answers very maturely and calmly. Also, he looks so fine, like fr.", "he's matured a lot and his voice is SUPER comforting", "I like how you're just being yourself and to the point", "Since he seems so chill, I think that it would be fun to see him play like Omori or a chillas art game.", "i love how calm and chill he is, plus u can see how he's getting more comfortable in front of a camera again. take ur time bud, no pressure! :) (btw ronald if u see this pls wear ur glasses! i think its pretty cute and when u wear ur glasses its just hits diff!!)", "Even though he’s 14 he talks and looks like 17 ", "I absolutely LOVE how open and calm you are, keep it up!!", "you can tell that steadily he’s getting more comfortable again in front of a camera", "lets just appreciate Ronald for being in charge with news and updates about the sibling's old channel", "I'm literally so happy that he's posting again. Like damn the nostalgia hits hard ", "he may be older now but he still seems like such a sweet person he just gives off that vibeee", "This is literally the best character development I have seen!  fr how can you be so calm and mature for 14 years old, truly the biggest flex.", "The fact that Ronald grew up and still kept his energetic mannerisms like the hand movements and the impressions makes me happy", "If he keeps doing more content like that the videos would be so good ngl. He's so chill and entertaining", "I like how after a long while he's starting to upload more again and he's really updating us on everything that happened over the past few months/years", "Really happy Ronald’s back. He was always my fav in sis vs bro and now he’s just so chill and laid back, I missed him bro", "Great vid Ronald, you seem like a chill guy who is more than comfortable to answer the internet's burning questions.\nAlso, are you gonna post on sis vs bro again-", "Honestly back in 2017 to 2019 I watched him, to see him watch SunnyV2 video, answer questions and come back and embrace his new self and not fear to answer anything regarding their change is amazing.", "Just wanted to say thank you and your sister for given us so much joy in the past on sis vs bro channel, I love all of the contents and ideas that you guys had and it's been a blessed for my childhood (even though we're literally the same age, I still kinda go back and watch those old videos you guys made.)", "I'm glad he still appreciates the time he was so lucky to spend on SIS vs BRO", "this guy seriously went from a childhood star to mature adulthood", "Honestly seems like such a cool guy. He's matured a lotttt, can't believe this guy and I around the same age when he and his sis where basically my childhood lmao.", "this is crazy. It’s crazy that last year he was really active and energetic, but in a year, he’s so chill. that’s so crazy.", "He honestly has such a calm and comforting voice ", "Let’s take some time to appreciate that he raised us when he was a child like us", "I can't believe that he went from a funky, stuttering, funny, sqeaqy voice little boy to this guy who is SO tall, and has a deep voice ", "This guy made our childhoods, and changed them", "They all took a break which is important for people's wellbeing. Lots of youtubers quit for a little then decided to come back a little while after. It's nice to see them trying to come back and be active again.", "I googled how tall he is and this is what I got back His father's name is Freddy Kurzawa and his two siblings are named Karina Kurzawa and Aria Kurzawa. He is approx 5 feet (based on his newest QnA video) and his weight is 37 kg (approx). He has dark brown eyes and wears glasses.", "I really love that Ronald is back and better than ever. He's so chill and calm and taking everything so mature. He answers questions and doesn't just throw away his past from sis vs bro. He's just so calm and chill and I love that. He's so comforting", "I’m glad he did this and explained instead of leaving us", "After being a fan for 3 years now I still cant understand that this man is so muscular and can make rat noises like  what", "I only watched one video from their channel, but it feels like I grew up with them my entire life.", "i cant believe how mature he is for his age", "I always had a crush on him and \napparently we the exact same age, it amazing seeing him grow up and how he is very calm and i lowkey miss the old days tho", "he grew up guys im so happy for him, he matured and, glew up and developed an accent. dam, im so so proud <3", "I love how you can actually get Gianni to voice Gabriel whenever you want", "My heart during this was  THANK YOU SO SO MUCH YOU LITERALLY SINGLE HANDEDLY GREW US UP!!! And you're so mature and calm now you handle everything nicely!", "Screw it. I'm rewatching SIS Vs BRO I don't care if I'm too old I need the nostalgia ", "Can we take a moment to look at how much he's grown into a very handsome young man  <3", "I would watch SIS VS. BRO all the time as a kid. To see where you are now in your life is shocking to me, i know you did it for the better. Keep up the great work :)", "okay, since ronaldomg is back, i actually wanna see him playing doors since it's been blowing up the whole internet", "i love that theyre back and i still love their content", "Thanks for being my only friend when I was young, even though we didn’t know each other, you raised me basically. Thank you", "Still processing his voice. I just love how calm and chill he is", "I’m literally 17 but he seems so much older and more mature than me lmaoo", "Bro how much you’ve grown and how calm and relaxed you are bro it’s just insane", "So much more chilled then back on sis vs bro.", "Ronald really ended up growing up so well, so happy the way he has matured and how calm he has become", "I miss the videos where they would do sis and bro challenge Just glad that he's back", "The moment he put his glasses back on it just unlocked 800 memory’s!", "his unexpected comeback gives me butterflies 🫶", "I love how he goes “ I don’t like my glasses bc im not a nerd anymore” ", "He is such genuine, mature and handsome guy super chill and the way he talks is comforting.", "Damn bro this dude was my whole childhood", "Let’s take a moment to appreciate how this guy single handled raised us when he was a child just like us", "i love how everyone here is basically growing in age together", "Swagg makes me happy and enertains me daily with his great content keep it up Swagg!", "I remember when he was a kid and just made a lot of entertaining videos and now he is older and it just makes me remember everything.", "I didn't realise how much I missed Ronald's videos. Nice to have him back. Loving the new content and catching up with him again.", "Im so happy Ronald starting streaming and posting more, lets give him 100 million subs in the future :)", "He seems so sweet and kind. Definitely a great kid!", "“We have a white fluff ball and a tiger.” - Ronald 2022", "Ronald seems so much more chill than in the past! ", "I feel like when he grows up he going to be a lot like Arman from Korean Englishman, like their vibes are kinda the same. Also I don’t know why but his face really reminds me of Hueningkaifor no reason.", "Aw I think it’s safe to say we are all liking  the overall glowup Ronald had \nEspecially this calmness \nI hope u keep on growing more ", "Naurr I found my new bias dawgs, Ronald now literally looks like the next Leonardo D Caprio like damn with those blue eyes and blonde hair and that deep voice and that calm personality he can literally steal any girl’s heart.", "honestly loving how he’s posting a lot lately", "Thank you for making all our childhoods", "I remember watching sis vs bro with my bsf in like 2017 maybe late 2016 and I was like wow, kids who are basically the same age as me making videos. I wanted to meet you guys a lot and honestly still do. you have grown up a lot and matured very well. You always made me smile I love your energy. You radiate happiness and are really chill. I hope someday we could be friends, you are amazing ronald thank you for making our childhoods awesome.", "Bro let’s appreciated this guy is back", "I’m so glad he is uploading things about the situation more now. Karina uploads on TikTok everyday yet gives very little information but he solved all myths and mysteries. Thank you Ronald.", "Bro is so calm now, I used to have to watch him for my siblings but now I’m the one watching him", "He's gotten very handsome over the years, I can't even lie ", "Why are his cheekbones more defined than my life", "Like I have been watching y'all since my childhood (currently I'm 13), you guys are one of the best part of my childhood.\nI missed you both so much!\nIts good to see you both growing and I hope for your good future :)"]}