{
    "video_id": "JZEsmQRLxy0",
    "comments": [
        "You should play Warzone",
        "I really wish sisvrsbro was back",
        "It's still so weird to see him because one of my memories is the video of Ronald and Karina in the sauna room   he's so chill",
        "THAT IS NOT RONALD",
        "Will you be changing your name on yt anytime soon",
        "Ronald new thing to say is u known lol ",
        "I am glad he is posting again :)",
        "You should make sis vs bro videos because while you grew up so did your fans",
        "I feel so nostalgic right now, because he was literally my childhood and the reason I wanted to make a YouTube channel in my first place!",
        "OH MY GOD",
        "Omg im crying he is different now now he looks handsome",
        "Broooooo your getting soo big (in a good way). I now feel like I'm old now lol.",
        "Ronald do u play cod",
        "Who misses sis vr bro!!\n  ",
        "Bro my childhood",
        "i told my bf abt us (jk ion got one)",
        "Damn, they were the best ytbers for me when I was younger now it just amazes me of how much he has changed ",
        "I can relate with the thin hair",
        "He has grown from the wild kid to such a chill guy i missed watching their vids!",
        "its crazy that kids these days are getting nostalgic over mfin FORTNITE like ",
        "Screw it. I'm rewatching SIS Vs BRO I don't care if I'm too old I need the nostalgia ",
        "I love you and your my childhood YouTuber in your back i’ve been watching since 2017",
        "last he uploaded he sounded like a kid",
        "I screamed when he said he did ent play Roblox anymore now it’s a thing if the past",
        "2020 lil huddy?",
        "Who dafuq is that?",
        "I can't believe that he went from a funky, stuttering, funny, sqeaqy voice little boy to this guy who is SO tall, and has a deep voice ",
        "If you want to play story games you should try Sally Face!",
        "If you want your hair to have more volume use a hair roller, and leave it in your hair for like 5 minutes, use a hair dryer if you want it to be volumed faster",
        "Ronald grew with me , because I am also 14 and if Ronald would post reacting videos or another videos of his age on sis vs bro , their fans wouldn't mind it because they grew with them so their fans are also not child anymore....Thx for reading till here !",
        "the way that we literally grew up together that’s crazy",
        "His voice has changed a lot in just 2 years",
        "Nah mans zesty now ",
        "Hey ronald tell me r u 13 or 14 or already passes?",
        "Yo i met you in the feria and you were really chill i hope i meet you again soon",
        "Wait a minute this doesn’t look or sound like ronald",
        "Omg your so big now I watch you since I'm 7",
        "ronald why are you not vlogging anymore",
        "Wow another vid man nice honestly its so nostalgic just seeing u by ur self at this time u and karina were my childhood.",
        "Why does the light at the door keep blinking",
        "Old Ronald is back  love the old look ",
        "Ronald’s “hehehe” made me giggle 🥹",
        "Ronald will you play minecraft please I like when you play minecraft",
        "Broo i remember when i had a crush on him in 2018",
        "He's kinda scary",
        "Can you do more ApexLegends",
        "some roblox",
        "Omg I feel like it’s been forever since you last posted and I just want to say you and your sister practically raised me even though you a year or two older then me and thx for answering or questions Ronald and ps you had a big glow up since sis vs bro",
        "I think I know why you name your channel RonaldOMG",
        "You have grown up so much",
        "“I’m down for anything….” \n“Except sis vs bro”",
        "You grew up so fast I watched you when u were like 9 or 10",
        "Ronald, I’m actually very surprised/happy that your kind of returning to YouTube. Thank’s so much for uploading a bit more! We all really do appreciate it.",
        "I loved the old Ronald more, but like people change, nice vid Ronald",
        "I haven't watched you for years omg!",
        "AYOO U LOOK SOOOOO DIFFERENT THAN BEFORE",
        "Throughout this whole thing, he was just moving his hair around so much, it was hilarious ",
        "Why in the description he told us to sub to sis vs bro if there not going to post",
        "Should defo do a part series on God Of War Ragnarok.",
        "Your voice my god",
        "he's so pogi na aaa",
        "Are you from poland bcuz i am from poland",
        "This man raised me.",
        "no way bro went from 8 to 18",
        "I just respect that he has grown so much",
        "Swagg makes me happy and enertains me daily with his great content keep it up Swagg!",
        "Why is karina not in video’s",
        "Do more sis v bro it so good",
        "How old are you \nBro u are older",
        "Why Karina is not posting anymore",
        "I'm honestly just happy that he's back yo",
        "I was only gone for 2 years and HOW TF HAS HE GONE SO MATURE!? HIS VOICE AACCCKKKK",
        "Play hello Neighbour 2",
        "It’s really cool how calm he is now but still kinda miss that high energy he gave in sis vs bro",
        "PLAY ROBLOX",
        "Chibi and George might have a new house :)",
        "His smile is still the same ",
        "His voice is deeper then mine by far",
        "so cool to see him posting again!",
        "his voice is so calming and I love some of his recent gaming content! He really matured over the time he went offline but he came back very smart, very nice, and very mature and so calm I love it!",
        "Did Mrs. Spartalis teach you",
        "can you have karina in won of your vids",
        " please tell her make   more videos Karin a to  neat Mall videos please please",
        "Hey Ronald how old are you?",
        "He is so mature holy goddd I can't believe it !",
        "Why does his voice sound so mature and deep ",
        "Just can't believe I was 9 when I used to watch there videos now I am almost 14 . He has an big glow up vocal,visual and so mature just hats off Mann . All the best for your future Ronald .... felt heartbroken and disappointed when u said you will not post in sis vs bro... Gonna miss all the videos",
        "I still remember watching with my sister and trying this stuff out",
        "Ronald had a amazing glow up like dangggg",
        "The nostalgia intro and  ending was pure gold 🥹",
        "I can still hear his special accent",
        "I haven’t seen them in 2 years how is he grow already-",
        "Tf Ronald u have grown the last time I seen u it was like last year or the yea before",
        "Man, I have aged with this kid.",
        "5:44 I grew a whole foot\nMy brain: HE HAS 3 FEET???",
        "I can't believe Aria is three! it feels like the first time she was on the channel was like a week ago.",
        "As someone who absolutely adored rubber ducks for the majority of their childhood, this makes me so unconditionally happy",
        "Ronald can you play Fears To Fathom.",
        "hi guys i dont rly know why im asking this but can someone tell me what mic hes using? like if its a shure what model? thanks lol",
        "He is so chill now since a few years ago...",
        "Ngl, since he seems so chill, I want to see him play like a chilla’s art game or omori. I think it would be entertaining to see how he reacts",
        "Ronald, start wearing your glasses again man comeee onnn",
        "Are you going to post Minecraft videos and do you still play Minecraft",
        "i love how everyone here is basically growing in age together",
        "I used to watch SIS vs BRO and the entire video I was like: Last time I saw Ronald, he was 11 or something, NOW HE IS LIKE A TEENAGER",
        "(crying) i miss the old Ronaldomg",
        "Make m9re grown up vids",
        "He literally looks like a 17 yrs not like before-",
        "You look so different now",
        "While I was younger I used to watch somtime I watch sis vs bro still but not as much as I used them",
        "Are you gonna keep posting",
        "NOOO I WATCHED SIS VS BRO FOR 4 YEARS!!",
        "Wait wait wait what happened to the kid him I feel like I'm missing something.....",
        "6:51 is hilarious because he said, \"I'm not a nerd......anymore!\" I love the old and new Ronald!",
        "I was OBSESSED with their old cats, I’m so sad that their gone..",
        "3 years and what a difference!!!",
        "This is going to sound crazy but, when I was wayyy younger than I am rn, I watched this channel all da time, I’m happy that I finally found it again!",
        "Sheeeesh he tall",
        "wth when did ronald had a deep voice",
        "When will karina post on her channel?",
        "4",
        "Really happy Ronald’s back. He was always my fav in sis vs bro and now he’s just so chill and laid back, I missed him bro",
        "where is Karina",
        "Just wanted to say thank you and your sister for given us so much joy in the past on sis vs bro channel, I love all of the contents and ideas that you guys had and it's been a blessed for my childhood (even though we're literally the same age, I still kinda go back and watch those old videos you guys made.)",
        "Dude what happened to you voice last time I watched you you were smaller",
        "What happened to karina",
        "Only the real OGs remember the blindfold slime challenge",
        "He’s just amazing, I grew up watching him with my brothers and I. Good times :)",
        "WHO ARE YOU I DONT KNOW MY OLD FAVOURITE YOUTUBER LOOKING LIKE A WHOLE CELEBRITY",
        "RonaldOmG once said: I'm not deathly allergic",
        "“I’m deadly with a pausing remote ”",
        "you look so diffrerent",
        "My heart during this was  THANK YOU SO SO MUCH YOU LITERALLY SINGLE HANDEDLY GREW US UP!!! And you're so mature and calm now you handle everything nicely!",
        "He is so mature and calm like I remember my sister and I watching them when we were younger a lot and stuff and now he has changed A LOT and has had a big glow up and I can’t wait for more content from you",
        "Bro I love how he is right now when he was a kid he was so loud and didn’t put any makeup on\nBut now it’s like he does his eye brows and now he’s so Quiet",
        "You should play Team Fortress 2",
        "Cat in box also dude Karina is like 15-16?",
        "No one's going to talk about how his new cats is soooooo adorable!",
        "how is his voice so calming now?! im still used to that high pitched voice when he was younger  but rlly, im glad your back",
        "He sounds so much like his dad now...",
        "I'm literally so glad i can show my future kids your channel and actually be proud that you and Karina were a huge part of my childhood,thank you",
        "You got so big you were my favorite YouTuber I hope you post more!",
        "His voice is so deep!",
        "Ok I know this is like off task but can you please   plage roblox doors",
        "I miss Ronald laugh although his voice is so much deeper ️️",
        "You are so change",
        "Bro nobody noticed the light when on and back off",
        "I remember watching sis vs bro with my bsf in like 2017 maybe late 2016 and I was like wow, kids who are basically the same age as me making videos. I wanted to meet you guys a lot and honestly still do. you have grown up a lot and matured very well. You always made me smile I love your energy. You radiate happiness and are really chill. I hope someday we could be friends, you are amazing ronald thank you for making our childhoods awesome.",
        "i loved ur hello neighbor videos. Can u pls do more hello neighbor content?",
        "11:24 Ronald saying he is not a nerd\n Meanwhile \nRonald plays Fortnite \nnOiCe",
        "He has such a calming and soothing voice... I've been listening to his videos and his manner of talking makes me genuinely feel safe.\nIf he had a podcast, ngl i could probably fall asleep to it",
        "This man here bro",
        "Do you miss sis vs bro",
        "Look at u now ronald",
        "he may be older now but he still seems like such a sweet person he just gives off that vibeee",
        "Ayo why do you look so beautiful like ho my god lol ",
        "I haven’t watched you for about three years and the second I saw this video I thought this was like your uncle or something",
        "Hey peeps it’s Ronald and today we’re back in Minecraft with Karina   The days ",
        "Where’s your sisters channel?",
        "Do more among us",
        "I was always watching your channel back in the good ol days",
        "But.. you guys said you would never replace them… Just keep Chibi and George in your hearts..",
        "Stream cod",
        "I love how you don’t feel ashamed about your past!",
        "my guy got a huge glow up while im sitting here like a rotten potato. still cant believe he's only a year older than me",
        "I miss when you guys would post on sis, verses, bro",
        "omg i remember when i used to watch you guys and you’ve all grown up.",
        "Editors on Tik Tok watching this rn be like: Saves video and starts editing him",
        "Tentacle difficulty’s  I love that Ronald loves his fans and is chill when they take a pic with him",
        "Anyone notices the door in the back ",
        "Ain’t no way this guy is younger than me (I’m 15)  he’s so chill too",
        "He's changed so much it's sad how he thinks he was a nerd but it is what it is",
        "he voice sounds so much deeper than I remember- i mean i understand why, but why is it soooo deep",
        "He is such genuine, mature and handsome guy super chill and the way he talks is comforting.",
        "Im 12 and im like 170cm",
        "i like how soothing your voice is now lol!",
        "I love how he can still make me laugh",
        "Is sis vs bro coming back",
        "I just feel so comfortable with him! He's so fun!",
        "I named my cat chibi because of you guys ",
        "You should play it takes two with Karina it’s a two player story games and it has a very good story and the bosses are very well made.",
        "I personally think that him and Karina are being very rude we subscribed to them we got them we’re they are today they just ditch us and then there like oh ye hi guys we’re back like yk what I mean I think it’s quite rude",
        "Ronald seems so much more chill than in the past! ",
        "Play Warzone 2",
        "His accent  \nHis eyes \nHis smile hair humor voice everything ",
        "Your 5.8",
        "He looks like a Rovan",
        "Can you make more hello neighbor videos",
        "I'd honestly miss the old Ronald, he was fun around, he was funny as well. XD\n\nbut this new Ronald is great as well!! I like how he's mature and calm now.",
        "I won’t ask the question I just don’t understand why I Ik literally crying right now you guys were my fav YouTubers and you guys just stopped posting one day and I just you could have least don’t like a signing off vid like come on and I’m not even joking when I said I am crying",
        "Can you make more sis vr bro videos ",
        "RyanToysReview lasted longer than Sis vs Bro",
        "your voice is so deep compaird to how loud you did speaked and you look so different your hair but i love your videos",
        "NO I COME BACK AFTER A COUPLE OF YEARS AND THIS IS RONALD!? NO PLS THE YOUNGER ONE COME BACK",
        "Let’s take a moment to appreciate how this guy single handled raised us when he was a child just like us",
        "can you make karina to post more videos",
        "Damnnnn we love maturity",
        "He seems so chill",
        "Bro I haven’t seen him in 1year like he got a glow up!",
        "Id love to see these in a longer format. They have such a nice flow together, that it would definitely keep me around O:-)",
        "Wen is your birthday???",
        "I would watch SIS VS. BRO all the time as a kid. To see where you are now in your life is shocking to me, i know you did it for the better. Keep up the great work :)",
        "He’s kinda cute now",
        "I love how he goes “ I don’t like my glasses bc im not a nerd anymore” ",
        "He needs to start a podcast",
        "I wonder if he has a gf?",
        "You still play mincraft",
        "0n Sis verses bro will you be making any more videos",
        "Play bendy and the ink revival",
        "I can definitely say Ronald has grown in a very nice manner very mature and understanding but looks like kairna has kinda no realy been spoiled and took the money for granted",
        "I didn't realise how much I missed Ronald's videos. Nice to have him back. Loving the new content and catching up with him again.",
        "There’s a new game called Bendy and the dark revival. Id recommend making a series for the 5 chapters. 5 videos for one chapters each :)",
        "Bro your voice is so deep compared to when you were a small child ",
        "Ronald, we be proud of you bc how much you GREW",
        "\"ThE WrEcKiNg BaLl BoOk\"  Do you you mean Hard Luck? And didnt you have a dog before?",
        "Hi I’m glad your back hope your sister is ok",
        "He’s literally young pewdiepie ",
        "Jesus Lord I have missed out. Look at Ronald now jesus",
        "6:54 \n\nhëłłœ",
        "Do you have a gf",
        "He grew so much",
        "Can u make hellonaber videos pls",
        "The “hey peeps it’s Ronald” got me thinking",
        "What’s your ethnicity/culture?",
        "dangg he grew up fast ! but its nice to see how has has matured.",
        "I would love to see you stream on twitch, and play new popular games like genshin etc",
        "IM 6,8",
        "Very deep voice i miss ya",
        "If you ever post on SIS vs BRO again I will be so happy",
        "How old are you?????",
        "His voice sounds so different",
        "His voice has changed so much",
        "Wow things have changed so much since a few years ago ",
        "Plsss play call of duty please \nRonald",
        "My sis called you a dork",
        "Please keep posting",
        "Let’s appreciate this guys the question we have all been waiting for is answered and it’s a no  I would still love maybe a goodbye send of on the channel but it’s ok if not I will sis vs bro and u Karina and Ronald are the best! And guess now he has more time to do these videos so hopefully he will branch out a bit more",
        "Bro hit puberty in the most attractive way possible. Who knew the guy who entertained me with slimes, Roblox and Minecraft would be a guy I’m simping for",
        "Did anyone see the light that turn on in the background was that karina",
        "That UWU part got me laughing out of my chair",
        "How old  are u",
        "Finally you made a new video after one year",
        "You  just get older and it's not fun any more and I get that",
        "Mold your hair into a Mohawk like it used to",
        "Have you ever tested drugs??",
        "he sounds so akward i love it <3",
        "I love how calm he is and open to us",
        "How long has he been gone",
        "wait I thought you found Chibi and George?",
        "You should do a react edits of you on tiktok",
        "i love cats too",
        "I remember being a kid and watching Ronald. I lost his channel and I jus found it today. He changed so much I need a glowup too ",
        "He is so calm",
        "Hi Ronald I can’t wait for this video!!",
        "Get a vr headset",
        "I cant believe the small Ronald we used to know looks like this now he’s so big wow (:",
        "Can you and karina do a Q&A together please?",
        "Wow puberty hit him hard",
        "HE IS SO CALM AND CHILLLL ",
        "He looks si damn different and his voice",
        "How old are you",
        "If Roblox is in the past, then Fortnite will eventually become something in the past for Ronald.",
        "He's 14 but looks like 18...",
        "You're starting to sound like Freddy",
        "I miss you so much",
        "Can someone please tell me his instagram bc i think i have a fan account",
        "Bro says he aint a roblox kid but he sure is a fortnite kid",
        "Will u be doing Minecraft vids enymore?",
        "Bro he looks like he’s secondary school last time he look primary school",
        "Bro’s voice cracks every 5 seconds",
        "I want you to play minecraft",
        "i have a qna question: who was messing with the lights at 7:00",
        "Pls updated",
        "bro's 5'6\nwow",
        "Sis vs bro ",
        "You’re 5’6",
        "Holy fvck? Ronald that u?",
        "Hi so I’ve been watching u since I was 8 and I just found out we have the same birthday but u were born a year before me",
        "It should be do u wanna not are u gonna",
        "Did you get contact lense",
        "Bruh his eyes are so fricken pretty",
        "You should make a video of you and karina like saying bye and etc",
        "I remeber the sleepover girl vs boy and Ronald was a girl with a Blonde wig and Karina with a black wig XD",
        "How old are You",
        "i love the amount of fortnite jokes LOL",
        "Undertale Please",
        "I got a quick question and I'd like if you answer do you have a tick tock account?",
        "if you are interested in story related games you should definetly try genshin impact",
        "Does Karina live with you?",
        "woah, ronald you have certainly changed but nothing can delay the fact that you and karina were literally my childhood.Thank you so much for answering these questions for us :D",
        "I could listen to his voice for hours, it's so calming",
        "... omgggg u can see him get emotional and tear up when talking about chibi and george...",
        "did anyone notice the light turn on behind the door at 7:00",
        "No his old cats",
        "There’s this kinda new thing called it takes two and if you and karina become friends again then you guys can play it",
        "Ronald should really make an ASMR with his soothing voice",
        "The power of puberty",
        "i feel so comfortable with him, he’s so nice and chill ",
        "Could you make a video on sis vs bro or on this channel about how you guys are doing?",
        "9:35 He says it like it died",
        "I am 175cm",
        "Ronald thinks glasses and Rubix cubes are nerdy...",
        "He seems so calm before he was crazzzy",
        "Are you still gonna play Minecraft??",
        "Super chill",
        "You make me smile Ronald! (⁠づ⁠｡⁠◕⁠‿⁠‿⁠◕⁠｡⁠)⁠づ",
        "The reason he is my favourite is that he addresses his problems, instead of avoiding them like his sister.",
        "This is literally the best character development I have seen!  fr how can you be so calm and mature for 14 years old, truly the biggest flex.",
        "Hello Ronald my name is Nicholas lugo and I am a 10 year old kid or you can call me widgey bear and I watched your videos because this is cool and I remembered you so I'm going to ask you a question have you played fortnite in a while?",
        "Can you please play a game of fortnite .",
        "hi ronald can u please ask karina if u can make just one vid with her thank you",
        "Can u atleast post one video in the main Channel pls make like a Fortnite video Pls and Thanks",
        "U should play apex maybe",
        "Naw dude I'm 5.3 and u tall ...agh",
        "Damn bro i remember when you were at 500k subs, you’ve come such a long way. keep going to 5Mil and hopefully 10Mil.",
        "Everyone talking about how mature he had become \nMe: noticing how the light turns on in off in the hallway",
        "10:51 that honestly just felt so sweet",
        "NAH AS SOON AS I HEARD THE VOICE WHAT HAPPENED TO LITTLE GOOFY SLIME BOY WITH GLASSES",
        "why are you not posting on sis vs bro pls post on now pls",
        "I still can’t get over the fact that this is the goofy, silly old Ronald",
        "He’s so chill now like to hang out with that many guys but he’s like he’s like so chill. I feel like he would be one of the guys who is my friend.",
        "You should react to sis vs bro videos",
        "You should make a series of playing it takes 2 with Karina!",
        "your one of a kind bby",
        "Can you try playing overwatch",
        "Consistent uploads nice bro keep going on the grind :D",
        "I can't get over the voice change !!!!",
        "I beg u do videos on warzone 2, I feel like you’ll be good at it",
        "I wish I asked him if he still played mincraft",
        "Please post gaming videos",
        "No one can say that the kids grew up \"spoilt\" due to the fame and money because Ronald is a perfect example of maturity at a young age right here. I'm just so shocked to be back after years and see him look so different and sound different.",
        "Since your posting videos. in one of them can u do a video u and karina like can u put karina in one of ur. Video",
        "Man pls upload again",
        "Hi blue eyes tho-",
        "He is sooo cool and chilled now and I like the way he doesn't exclaime most of the time like he used to..... But can we just notice the fact that his voice is so deep (btw ...I got one more question for you y don't u show up in Karina's vids)",
        "Hes a old man now",
        "The Kong",
        "he remids me of his dad",
        "Thank you for coming back",
        "I was shocked when I saw his reaction to Sis vs Bro and I'm happy he's back But the real question is Where's Karina? Is she OK?  Is she also calm? Love you Ronald it's amazing how we grew up as a fan group and are all now matured :))))",
        "Omg now way that's you... THE LAST TIME I WATCHED U U HAD STOPPED POSTING ON SISVSBRO AND U HAD SPIKY HAIR AND UR VOICE WAS SO MUCH DIFFERENT",
        "Ronald can you plz  do a vid with Karina plz plz plz ",
        "It's sad to hear that they are not going to post more on Sis Vs Bro",
        "Dam ronald is short",
        "You might say no but can you play a game with my 15 year brother",
        "I used to watch sis vs bro when I was like 4 it's crazy how much they have grown up",
        "hes so fine",
        "ronald is such a calm person now and i’m loving it",
        "this guy seriously went from a childhood star to mature adulthood",
        "What is Kareena?",
        "What did you do in 2yesrs you were inactive on youtube",
        "“we have a white fluff ball and a tiger” lols",
        "I am 152 cm and I am still just 11 I just realized how tall I am for my age",
        "okay, since ronaldomg is back, i actually wanna see him playing doors since it's been blowing up the whole internet",
        "Oh yeah I like that video",
        "I remember when you were younger you had like mowhawk kinda hair style",
        "Naurr I found my new bias dawgs, Ronald now literally looks like the next Leonardo D Caprio like damn with those blue eyes and blonde hair and that deep voice and that calm personality he can literally steal any girl’s heart.",
        "what's your age right now?",
        "We ignore one how the light went off in the back",
        "Gg things aren’t the same 🫡",
        "video idea:react to old videos of you and karina",
        "You truly changed",
        "Ronald really ended up growing up so well, so happy the way he has matured and how calm he has become",
        "His voice is SO low but it’s the first time I’ve heard from him in 2 years ",
        "5:08 Why am I so tall I am literally 12 and he is like 14 and I'm 176 cm, send help lol.",
        "You were my childhood ",
        "When is Karina coming  back",
        "I'm glad he still appreciates the time he was so lucky to spend on SIS vs BRO",
        "OMG RONALD U HAVE CHANGED SO MUCH ",
        "Bro is giving me real nostalgia like I got a massive teddy bear for my 8th birthday and I named it chibi I and we watched a video where u guys built a cat tree together ",
        "his voice is so calming, like he’s more mature for his age he changed so much its crazy how hard puberty hits.",
        "He grew up great ",
        "why is nobody talking about his glow upp? and like you guys have been saying he is mature and nice",
        "You should play bendy and the dark revival",
        "What happened to Ronald",
        "Your such a childhood man",
        "Hey Ronald if you do play story games you should really play omori. If u do, good luck ",
        "HAHA i love the way how Aria calls you guys funny names(:",
        "I didn’t know you had a discord... can I get it?  jk",
        "get a haircut oh my",
        "Oh wow Ronald you've grown a lot!!!!",
        "Bruh grew up",
        "I love how everyone of this family came back  lmao it has 420 likes",
        "Maybe y'all should post reactions to your old videos on your main channel",
        "It’s so weird seeing how different he is now, it’s really surprising",
        "You look so different from the last time I watchtower your videos",
        "I miss your roblox streams. Do those scary games on roblox :)",
        "I lottery cried watching this. We love you ",
        "His jaw line tho",
        "Do you still play hello neighbor",
        "Im happy you are posting again ",
        "I Miss When He Was A Kid",
        "Do you live with Karina your sister",
        "You should do a video of you playing VR!",
        "U R SOOOOO FINNEEEEE",
        "Pls can sis vs bro coming back",
        "i love your videos",
        "…\nWHO ARE YOU",
        "i can still imagine the HEY WHATS UP GUYS AND WELCOME TO(karina joins in) SIS VR BROOOO",
        "he reminds me of asmr ppl hes so chill and calm about everything. cant say the same about karina though...",
        "You should make a Minecraft series in hardcore, that would be sooo entertaining!!",
        "You can see hes getting more comfy in front of camera",
        "Used to Watch you guys as a kid nice",
        "Omg, you look like a whole diffrent person…",
        "WHEN DID HIS VOICE GET THAT DEEP",
        "Let’s just a minute to appreciate how the sky single-handedly raised us when he was a child just like us with a sister",
        "Bro your voice is so calming.",
        "The beginning hey Peps hehehGHAAAAAAAAA",
        "Puberty slapped that man in the face",
        "Cats come from tigers and dogs come from wolves",
        "Ronald omg can I have sis vs bro if yes I am going to make you happy",
        "what’s up brother just wanted to say i’m glad you uploaded",
        "Will you play Minecraft",
        "Rip Tito, and MMG you are one of the reasons that I started a YouTube channel",
        "can u play blockman go",
        "11:49 you have got the prince whihelm hairstyle from seaosn 1 young royals lol.\nand man he's really so calm and mature now, at the age of 14 it's really cool to see how much he has grown up. looking forward to the future.",
        "aw man, i missed chibi and george.. i hope theyre doing fine rn",
        "Ronald is cool",
        "Ronald aint Ronalding",
        "His voice is so deep not expecting for it to be that deep",
        "Q&A TIMESTAMPS\n\nQ. 1: 0:39 what was your favorite challenges or videos you did back in the day on sis vs bro?\nQ. 2: 2:09 how is aria now?",
        "I want to see this man play split gate",
        "why does he sound like he plays dahood on roblox ",
        "Holy he’s changed a lot he seems so much more mature now",
        "would love to see you play five nights at freddys.. you seem so chill so I wonder if you would even get scared lol",
        "Hey Ronald why Karina is not posting on her Channel we want to see her please please please can you tell her to make more videos please please please I'm begging Ronald",
        "It doesn’t feel the same anymore",
        "Who remembers when ronald always mentions about salads and eggs in food challenges ",
        "dear god what have i missed",
        "His really tall compared to me bc I'm 153cm or 5ft",
        "He looks so mature and older compared to 2016 ",
        "Ronald you should probably react to weird YouTube videos I recommend looking up Ronald and Karina died from covid I cried that night I realized that was fake so expose them",
        "I’m so sorry but you r cute",
        "can u like show us karina plssssss\ni am her biggest fan and i miss her soo much",
        "Is it me or did his eyes got more blue ",
        "His voice ",
        "Can u play GTA 5",
        "I love how chill he is now. ALSO HE SEEMS SL COMFORTING",
        "His way of talking is amazing he is respectful and so kind I wish u happy days",
        "Bro I haven't seen sis vs bro in like 5 years and you look 20 now",
        "bruh you grew so much you were my childhood",
        "Will you make any more videos on sis verses, bro?",
        "I do NOT believe that he is 14 \n He is so calm and mature for his age",
        "Oh you just remind me of the small you ",
        "Came here to see Ronald and I see this guy omg where’s Ronald",
        "i love how you can still see the traces of our \"Old Ronald\" in the New Ronald.",
        "He sounds amazing he is my brother's age 14 he sounds like different from everyone",
        "I like how chill he seems",
        "This karina slander in the comments..",
        "CAN YOU PLAY THE NEW CALL OF DUTY PLEASE",
        "Damn this dude had such a HUGE glow up",
        "Can you post a YouTube short of you having a mowhack",
        "I remember when he was just a little kid he has grown so much",
        "The rUvEn sisTa got me",
        "4:36 hahaha that made my day for real “technical difficulties” ",
        "Do you still talk to Karina",
        "Ronald kinda sounds like his dad",
        "o my god dude last time i watched you was so long ago you look so diffrent",
        "Ronald.... I just wanna say, I'm older than you... But I'm in love with you. You're so gorgeous, so beautiful. You're eyes has my attention and I really really love yours and ur sisters relationship. You're just so adorable . I started watching u guys when I was like, 10 or something. Yeah I am the same age as Karina and your just so awesome, I gotta say! ",
        "Can you play Minecraft please",
        "That’s not Ronald, I can’t believe he grew up this much. Good for you Ronald.",
        "I miss there cats",
        "OMG he's so differant",
        "no way i grew up watching a kid that is a year younger than me and now he looks older than me",
        "Why is Karina not posting?",
        "I do not believe this dude is only 1 month older than me ",
        "Part two",
        "how old are you now and how old is your sister",
        "I miss you Ronald it's been so long since you uploaded you grown up so much man I used to watch you on every single device I had you used to do hello neighbor my favorite game you expired me to play it",
        "I haven’t watched them in years and he has a deep voice and looks so much more mature and different it’s insane",
        "He really changed\n\nHis voice got deeper, he’s more chill.\nHe changed a lot",
        "Hey wait your 14 I'm 14 lol also nice to see you back I loved your sis vs bro videos when you and karina was making videos on it. Nice to see you again after all this time!",
        "I just come in for hey peeps its Ronald",
        "he grew up guys im so happy for him, he matured and, glew up and developed an accent. dam, im so so proud <3",
        "He's back again the LEGEND!!",
        "Idk why but the way he says th he replaces it with D but I just makes me laugh 14:44",
        "He has a big huuuuuugr glow up",
        "You actually now became quite a good looking dude",
        "I’ll never get over the Minecraft meme of Ronald ",
        "I remember that video",
        "Karina has followed the steps of Satan and Ronald still makes us giggle",
        "even though you are a grown man you still sometimes make me laugh",
        "Im so happy ur back Ronald! U make me laugh and u act like my 2 brothers and I love those personalities. I just love calm people and funny people it’s so amazing! I love ur family so much! Im so happy ur back I literally watched all of yall videos, Tysm for coming back! And it’s okay if u don’t post that much. You needa take care of ur fam sometimes! So don’t worry  -love summer ",
        "I would really want Ronald to do some reaction videos as well. It’d be pretty fun lol.",
        "Ok, I used to watch sis vs bro when I was little and when I saw this my jaw dropped, seeing Ronald 4-6 years later (I think) was so shocking! He kind of looks like drew starkey!",
        "hello Ronald I remember sis vs bro but do you remember the video when you found out of you sister aria that's my fav",
        "Aw I think it’s safe to say we are all liking  the overall glowup Ronald had \nEspecially this calmness \nI hope u keep on growing more ",
        "Good to see this guy and I would like to see some vlogs",
        "Heeeyyyyy do REACTION VIDEOS plzzzzzzz",
        "I'm not a Roblox gamer...\nI'm a Fortnite gamer :)",
        "You should pay valorant for a video",
        "No one gonna talk about the door changing colors",
        "You look so different",
        "do you guys have a new cat?",
        "hey Ronald can u please like do a video with Karina in it I don't have instagram and i wanna see how she looks likes",
        "Ronald is tall don’t get me wrong but in my family he is not that tall. I am 11 years old (I know I’m young) and I’m 5’3. My sister who is 10 is 5’1. My older brother but the youngest brother who is 12 is 5’7 the middle brother who is my older brother is 13 and he is 5’6, and the oldest of all of us my oldest brother is 5’9. As you know now we are a very tall family. My older brother who is 5’6 got my moms height lol. (My mom is short, at least to me she is 5’4) my dad is 5’11.  BTW I’m not hating AT ALL I’m just saying something I wanted to say for some reason.",
        "I'm happy he is back he helped me grow up",
        "I'm literally so happy that he's posting again. Like damn the nostalgia hits hard",
        "He seems so sweet and kind. Definitely a great kid!",
        "He seems like someone I’d feel comfortable around, he seems so chill tbh."
    ],
    "comments_disabled": false
}