{"video_id": "K997NyvxVxo", "comments": ["Diggs has been part of two of the most memorable Vikings games ", "As a Bills fan, I’m glad we’re involved in the game of the year every season. I just wish we could win one of them.", "The Minnesota-Buffalo game was one of the greatest games of all time", "Let's not forget about Dalvin Cook sparking the come back with 80 yard run leaving everyone in the dust", "this Vikings bills game should go down in football history", "Justin Jefferson should be in the mvp race imo. without him the vikings without a doubt wouldn't be where they are today. I know the mvp race is pretty much exclusive to qbs and rbs nowadays but I think JJ should be in the conversation. also coach O'Connell for COTY", "The Vikings and Bills game was so crazy!!!", "As a Jets Fan well done Vikings. Never seen a game like that. Unbelievable!", "Congratulations Vikings !! Game of the year!!! ", "I have tremendous respect for the Bills mafia, great fan base, great atmosphere for a great game, love to see these two in the Superbowl against each other.", "Best regular season game since the Rams vs Chiefs shootout game in 2018\n\n54-51.. wild game", "The Vikings are actually playing a full 60 minutes every game which they never did with Zimmer at the helm.", "Go LIONS!  I had a meltdown when we let the Vikings win that last game!  Since, they have taken off!  Great game, can’t wait to see them again", "The Vikings game was one of there greatest. it will be close to another favorite of mine which was when the Vikes played the cowboys on Thanksgiving. John Madden and Pat Summerall anouncing and Randy Moss being a rookie that year. I watch it every year around Thanksgiving. GO VIKES!!!", "As a Pats fan in upstate NY, thank you Vikes, it snowed recently and we needed a little salt here. ", "Dolphins and Vikings are 2 teams who have shown that they can comeback from double digit deficit anytime within a blink of an eye", "The Vikings will be one of the most battle tested and resilient teams going into the playoffs. All those close games taught them how to scrap and fight until the final whistle blows. SKOL", "The thing about the Vikings that still concerns me is the offensive line. Blocking failures stopped us from closing out the game multiple times in the 4th quarter and overtime. It’s great that the defense was able to step up and win the game anyway, but I’m afraid that’s not always gonna happen against the best teams in the league. Either way, amazing win for the Vikings, this really convinced me that this team can go up against anyone and win", "I thought Vikings were done - until Cook busted off that monster TD run.....I felt they would find a way after that.  It ended up being a wild way to get it done - but you gotta take a W any way you can.", "We love the @NFL here in Germany the crowd the atmosphere was electric ️that was awesome please more games in Germany ️🇩🇪", "Florio's like me. A long suffering Viking fan who shy's away from geeking out about them no matter what.", "As a Viking fan and has since 1970. Buffalo is going to be just fine. Keep believing in themselves and what they can do. The game itself, UNBELIEVABLE! The game for the ages.", "Although the graphic is correct, technically, the Vikes were actually down 17 points at one point", "I've been watching football since the 1960's, and I think the Justin Jefferson catch might be the greatest I've ever seen.  Maybe there are some as good, but there are none better.  I watched the ball go over him when he jumped as high as he could, and somehow he found the ball in the defender's hands behind him and snatched it - with the game on the line on 4th and 18.", "That was the NFL at it's best can't wait until January the playoffs!!!!!", "I've think Diggs was amazing, And that's how you do it with all team players working together on their skills doing what they do best , We all always come back even harder 3 games down, Now it's a new start , Yesterday News is yesterday news , Go BILLS, ️ Amazing game on both sides, We got this Buffalo ️️️", "The best teams are the ones that can come from behind and win.", "As a vikings fan I found out last year they gave me an anxiety issue this year they are giving me heart attacks why I'm I still a fan idk but I love the Vikings SKOL", "Week 10 was  pure madness", "I appreciate that they at least started with what MIN is doing right versus only what Buffalo did wrong compared to many other outlets", "I believe with the win against the Bills, the Vikings are now a team to reckon with. It can only grow should they beat the Cowboys next week!", "I know that the loss stung for Buffalo Bills fans, but I’m seeing too much stuff online about putting all of this on Allen losing the game for them, but there were enough coaching mistakes and defensive mistakes by the bills to not put this whole game on his shoulders.  KC and JJ were torching the Bills secondary the whole game….and the 4th and 2 in the red zone when you could have kicked a field goal was all on the coach.", "It should be a 17 point deficit for the bills game 27-10 at one point!", "Buffalo, since Week 1, which was impressive, has had scoring droughts for long stretches in games.  I don't think they're running the ball that well, and they seem to be a little short on receiving weapons.  They might put in the best offer for Odell-Beckham, looking for a spark on offense.  I think the way the Chiefs are probably playing a little better than the Bills, right now.  Last week, I'd've put Buffalo on top.", "The Vikings may have won in overtime but the upset happened in the 4th quarter with a strip fumble recovery touchdown by the Vikings that's when the upset was complete overtime was just an extended death", "Florio trying to hide his excitement - he be smirking ", "I've said it since K'O and Kwesi was hired this football team is gonna be great before the season even started.\nEven after the week1 win over the Packers I knew we were built different....\nI don't wanna hear anymore hate towards my team which is The best team in the NFL", "We have to thank Greg Joseph for the wonderful game.", "How can Kevin OConnel not be the coach of the year??? Talk about a complete culture change!!!", "It seemed that Buffalo wanted to give it to the Viks worse than the viks wanted to give it to Buffalo.", "Wild ending, I had just finished watching my Chiefs, saw the Vikes turn it over with 50ish seconds left and turned it because, well, it was over right??? A bit later a buddy said something about the Vikes win and I was like no, the Bills made the stop, they didn't win....so I watched the recap and couldn't believe it! KC right back were they usually are. Hope we can keep on winning and get that bye!!!", "Florio creates a new category to describe Colts' performance.  \"Assinine win.\"", "Now it's the cold weather for Tua ....These guys are hilarious", "Florio seething through gritted teeth at a Green Bay Rodgers win. Had to instantly talk about the run game.", "There’s no way Josh Allen can be the MVP favorite after today. He has cost his team the last two weeks by turning the ball over, most of these interceptions i don’t understand what he’s even looking at. Mahomes should be the mvp favorite right now", "The most amazing thing was the Colts beating LV!  That was a revolutionary game!   If Saturday can keep it up it will change the whole NFL coaching system!  It was almost like Trump winning the presidency!", "In this game, 14 points could equal 7--15. seconds.", "7:03 What are you talking about Florio?!? Tua has made those throws this year against Baltimore and Buffalo this season!", "oh, look, another game of the year,. as a Bills fan I'd love to experience what it actually feels like winning one", "Thank You Jason, Bills Mafia is taking a beating right now. p.s and rightfully so too. Go Bills !!", "Holy Mary I believe in the Seattle Seahawks..I'm glad I didn't have.. to finish the rest", "The ball never lies and the vikings scored 2 TDs that never counted before that Allen fumble ... that might be the game of the year so far Bills just know how to put a show they should of never lost to the jets that was a big loss", "Best regular season Vikings game since Favre threw that hail Mary TD in the back of the endzone against SF in 2009. The last time we were 8-1. Best overall game for the Vikings since the Minneapolis Miracle. Kirko Chainz rallying the troops and J.J. putting it on the d-backs has been amazing, but don't forget the Vikings D being one of the most opportunistic and \"bend but don't break\" in the league. Philly didn't score in the second half against the Vikings D and Buffalo only put up 6...", "Can we talk about changing the narrative that Cousins doesn’t show up in the clutch or prime time?", "The only reason the Cowboys lost is because someone on their team coaching staff to be specific is listening to you sports analyst when you guys are saying run the ball with Tony more that looks comfortable let them throw the ball more and they went out there doing all the old stuff that helped them lose instead of doing all the new stuff that was helping them with so thank you sports analyst for coaching my team to a loss", "I like this cast coach Garrett is doing a good job.  Maria is solid as host", "I could get behind a vikings super bowl this year lol I'm a chargers fan but this year's not doing too good for them", "Not to mention the like 30 yard play that they called a catch that was OBVIOUSLY incomplete and needed to be reviewed but they didn't review it.  They should always and I mean ALWAYS at leat look at it", "Dungy: I still have ties in Minnesota. \nMe: oh yeah you did coach here back in the day. I had forgotten that ", "Said it from early on,this is Cousins time. He has no excuses.", "Those so called \"wow plays\" get Allen nowhere. It's okay to admit that you were wrong. He is a TO machine.", "Vikings Bills game best craziest game I ever seen", "Leadership and Kirk Cousins in the same sentence! O.o Pigs must be flying.", "Last time Buffalo lost at home when up by 10+ points was....1968!", "Mike Floria of course he gonna hate on Tua", "Florio a bit quiet there when it comes to the tua take hahahah the other actual coaches that know football shut you down real quick hahaha", "As a Vikings fan, I have a two word message to the rest of the NFL: \"FEAR US\"", "I knew they were gonna make excuses for Josh", "Everybody waiting for Kirk Cousins to unravel \nSorry it was the other qb that choked\nOul First Cousins has an unbelievable security in JJ \nKids unreal", "\"The only place where success comes before work is in the dictionary.\" -Vidal Sassoon", "Florio has to be getting paid specifically to keep pushing the goal post on Tua. TUA HAS TO BE PERFECT EVERY WEEK TO SATISFY ME!!!", "THIS is why i never bought all the Bills better than Eagles talk...they're WAY too reliant on one player aka Allen so when he's not playing as well/has an off night/get outplayed by a good D and turns it over a couple times they could be in trouble whereas the Birds dont RELY on JUST Hurts because we have SO many amazing pieces around him, i cant think of a position group outside of LB where we' arent top 5...the trenches, our skill position groups....and a strong DEF too....Birds just build diff this year, and Hurts still tearing it up, but even if he just plays at an aveage level, this team can STILL beat anyone...and his potential hasnt even been full unlocked imo, his trajectory is wild", "Wild game.", "There are lots of salty Buffalo fans in the comment section. \nMinnesota has faced a disappointing franchise history. You have to let them have their time in the spot light. People sleep on Minnesota a lot and I think it's about time to bring home the trophy.", "Even though I watched it happen I couldn't believe it.", "Tua has made big throws in tight coverages especially in the browns game lol", "That fumble with 30 seconds left then the interception in ot holy crap the bills lost this game", "Going on 4 and 2 with 10 points up  was massive disrespect...karma works quickly", "With the Bills, Cowboys, Chargers and Raiders losing today this has me wondering which QB will win a Super Bowl with their team first: Josh Allen and the Bills or Dak Prescott and the Cowboys or Derek Carr and the Raiders or Justin Herbert with the Chargers?", "Peterson did great, but how do you mention this game without talking about the incredible game Jefferson had? That man had a game!! Especially the catch were he had one hand on the ball against the defender but still came away with it !! My goodness! Not Vikings fan but that was a great game. KC thanks you!", "He has gone back to his bad habits of forcing the ball on a long ball instead of field goals or running the ball", "Mike, have you watched Tua’s throws this year?", "Bills stole that choke from the 80's movie 'All the Right Moves\".   Same exact scenario.   They could have just taken the safety and then got the free kick.   At least made Minny drive with no timeouts to kick a fg", "I blame the boys loss on skip Bayless alone", "Shoutout to Jason garret for calling out florio for the hate, Tony’s comment about when it gets cold is fair but it was cold and windy last week in Chicago and he balled out so I’m not worried that the offense will slow down when it gets cold especially if they can run the ball like this the rest of the season", "Ms. Maria Taylor is great. Great job Ms. Taylor your the perfect fit , your the perfect Quarter Back for this show.", "One or two great players can't carry an offense in the NFL anymore", "Neutral fan. There should be stiff penalties for the refs in the bills vikes game.\n\nThe NFL is very lucky that the Vikings won because not reviewing that Davis \"catch\" was one of the most blatantly egregious things I've seen in awhile.", "Still the media won’t blame Josh Allen , instead they say he was asked to be ‘Superman’. No he was asked to not fumble a basic snap and turn the ball over twice in the redzone. Ridiculous", "I  them Vikings, teams are terrified when the Vikings come to town!", "TJ WHat what What!!\nHad more impact in one defensive sequence than Myles Garrett had all day Dolphins hung 39 on them", "We all know Jason Garrett would have went for it. …. Not got it … then started clapping !!! & spitting", "as a fan of football, I do not have access to the film that teams watch each week ( don't even have cable television) but I wonder why teams do not go to an area of their playbook that they have not shown to other teams in previous games. Each offense / defense has at least a few hundred plays etc..you have to change your tendencies every couple of weeks to keep teams off balance", "What a GREAT Sunday! \n\nCome to our channel and see what our best bets are for the MNF Commanders vs Eagles game!", "Analysts come up with so many ways that Allen's horrible decisions that lose games are not his fault, lol.", "Josh Allen thinks he can do it all all the time. And that’s his their down fall. Said it at the beginning of this year that this was going to happen for that reason.", "Who decided oh Mike Florio would be good for this job", "Bills gave that game away with bad coaching. Take the field goal, take the safety.", "They lost bunch close games last year", "Jason Garrett gets it....I'll bet with Tua not against him."]}