{
    "video_id": "K997NyvxVxo",
    "comments": [
        "The Dolphins haven't lost a game that Tua has started and finished... is that actually an argument? Wouldn't that be true for almost every NFL team and their starting QB?",
        "Cowboys fans been real quiet  cowboys choke season coming early this year",
        "Wild ending, I had just finished watching my Chiefs, saw the Vikes turn it over with 50ish seconds left and turned it because, well, it was over right??? A bit later a buddy said something about the Vikes win and I was like no, the Bills made the stop, they didn't win....so I watched the recap and couldn't believe it! KC right back were they usually are. Hope we can keep on winning and get that bye!!!",
        "Lol Mike said this past week the vikings going lose lol. Mike it's been 45 years the last super bowl we were in. Coach dungy nos SKOL",
        "Fire Florio.",
        "Jason Garrett gets it....I'll bet with Tua not against him.",
        "Allen is no Grim Reaper",
        "I  them Vikings, teams are terrified when the Vikings come to town!",
        "I've been watching football since the 1960's, and I think the Justin Jefferson catch might be the greatest I've ever seen.  Maybe there are some as good, but there are none better.  I watched the ball go over him when he jumped as high as he could, and somehow he found the ball in the defender's hands behind him and snatched it - with the game on the line on 4th and 18.",
        "The economy  is collapsing and there is an increasing rate of unemployment worldwide. I don't know who needs to hear this, you've got stop saving money, invest some part of it, if you want financial freedom...Due to compounding, which Einstein called the 8th wonder of the world, you can get rich slowly from investing if you do it from a young age",
        "Marias hair is beautiful.",
        "Did Mike Florio just say Superman committed 9/11?",
        "Did MICAH PARSONS play?",
        "I hope the NFL league officials investigate the referee’s in this game! Vikings beat the Bills + refs! Bills also had 12 players on defense when Vikings had first and goal at the end of regulation! ️️",
        "On a different note - is Maria Taylor not the best of all the NFL shows' anchors or what?",
        "Although the graphic is correct, technically, the Vikes were actually down 17 points at one point",
        "I like this cast coach Garrett is doing a good job.  Maria is solid as host",
        "Classic nbc down play packers win with 3 receivers out and the Tampa Bay looks real scary at .500",
        "Justin Jefferson and Patrick Peterson saved the Vikes.",
        "Miami is so impressive!  Beating the Bears, Browns, and Lions all in a row!",
        "Why is this washed former Cowboys coach on here ? Pretty cringe.",
        "Luck will only get you so far. Bills gave that game away multiple times.",
        "Go Redskins!!!",
        "Thank You Jason, Bills Mafia is taking a beating right now. p.s and rightfully so too. Go Bills !!",
        "Mike Florio is the biggest vikings fan skeptic. He talks negative and picks against the vikings every week even tho he's a vikings fan. He has no right to talk about the vikings. Unlike Randy Moss who stands with his vikes week in and week out.",
        "Josh Allen is 2 - 8 in one score games.\n\nDude has 0 clutch gene.",
        "Justin Jefferson should be in the mvp race imo. without him the vikings without a doubt wouldn't be where they are today. I know the mvp race is pretty much exclusive to qbs and rbs nowadays but I think JJ should be in the conversation. also coach O'Connell for COTY",
        "I could get behind a vikings super bowl this year lol I'm a chargers fan but this year's not doing too good for them",
        "Ya Florio def doesn’t watch football. Wtf does Tua have to do with Jimmy G? They are not the same player at all. Damn it looked like he was on trial talking about Tua, sweating bullets ",
        "Skol. Hopefully people start respecting the Vikings.",
        "We all know Jason Garrett would have went for it. …. Not got it … then started clapping !!! & spitting",
        "Go LIONS!  I had a meltdown when we let the Vikings win that last game!  Since, they have taken off!  Great game, can’t wait to see them again",
        "The thing about the Vikings that still concerns me is the offensive line. Blocking failures stopped us from closing out the game multiple times in the 4th quarter and overtime. It’s great that the defense was able to step up and win the game anyway, but I’m afraid that’s not always gonna happen against the best teams in the league. Either way, amazing win for the Vikings, this really convinced me that this team can go up against anyone and win",
        "Why does someone always have to put some sort of asterisk for Tua. Like here saying everything he's doing is pretty much wide open in the flow. And that he needs to prove he can make a pass in a tight window late. Had plenty of those type throws in the win against the Ravens yea not the 2 Hill TD but plenty on other throws like the game winner to Waddle. And this week he had plenty sure it wasn't a close game late but was a 10-7 game on the final drive before the half and he made 2 amazing throws in tight coverage. ",
        "This highlights my point that Vikings games this season have been like OS Star Trek episodes. It’s doom and gloom, then out of nowhere in the last 5 mins they pull something out of their behinds and live to fight another day. SKOL! ",
        "Who decided oh Mike Florio would be good for this job",
        "The life of a Bills fan. We can never have anything nice. Dorsey TERRIBLE game plan. Allen please get back to ALWAYS taking care of the ball in the red-zone.",
        "Cowboys have no run stopping defense.",
        "There’s no way Josh Allen can be the MVP favorite after today. He has cost his team the last two weeks by turning the ball over, most of these interceptions i don’t understand what he’s even looking at. Mahomes should be the mvp favorite right now",
        "Eagles will SMACK THE SHIT OUT OF THE VIKINGS",
        "The only reason the Cowboys lost is because someone on their team coaching staff to be specific is listening to you sports analyst when you guys are saying run the ball with Tony more that looks comfortable let them throw the ball more and they went out there doing all the old stuff that helped them lose instead of doing all the new stuff that was helping them with so thank you sports analyst for coaching my team to a loss",
        "Vikings are beast!!! but they don't want no parts of the eagles in Philadelphia...facts",
        "The most amazing thing was the Colts beating LV!  That was a revolutionary game!   If Saturday can keep it up it will change the whole NFL coaching system!  It was almost like Trump winning the presidency!",
        "The Simms influence: holding shitty coaching into account. Neither one of those other Muppets will say  about another coach. Garrett calls out Allen for trying to play like superman. Simms...er, Florio drops his dime on the Bills coaches who don't know how to order the game in a way that it's not all on his shoulders all the damn time.  Here Josh....go be superman and win it for us.",
        "At the end of the day…he ain’t no Patrick Mahomes.   Great talent, but still had a lot to learn.",
        "Florio is clueless,  just man up and say you were wrong about Tua !!!!",
        "Josh Allen is just overrated. He is 2-7 in games decided by 3 points. I'm sure he will have excuses like Herbert",
        "Tell the truth Florio...you thought Kirk was about to choke...again?  Huh???",
        "Florio creates a new category to describe Colts' performance.  \"Assinine win.\"",
        "Reminded me of the win vs Cleveland 1980",
        "One or two great players can't carry an offense in the NFL anymore",
        "Florio trying to hide his excitement - he be smirking ",
        "Mike, have you watched Tua’s throws this year?",
        "We have to thank Greg Joseph for the wonderful game.",
        "That fumble with 30 seconds left then the interception in ot holy crap the bills lost this game",
        "I figured Florio would shortchange Jeff Saturday. Previously Florio put too much into the criticism and he couldn't bring himself to say he was wrong. What a sheepish channel",
        "Kirko chains",
        "oh, look, another game of the year,. as a Bills fan I'd love to experience what it actually feels like winning one",
        "The Vikings may have won in overtime but the upset happened in the 4th quarter with a strip fumble recovery touchdown by the Vikings that's when the upset was complete overtime was just an extended death",
        "Bills stole that choke from the 80's movie 'All the Right Moves\".   Same exact scenario.   They could have just taken the safety and then got the free kick.   At least made Minny drive with no timeouts to kick a fg",
        "Mike Floria of course he gonna hate on Tua",
        "Florio the greasy lawyer",
        "Floria: \"Can (tua) make that big throw when the game is on the line, down the field, in a tight window\". Dude, this is Tua like every play. Guess he missed the 20 yard perfect TD to Sherfield.",
        "Florio such a clown trying to keep Tua and Jimmy G in the same sentence ",
        "Vikings Bills game best craziest game I ever seen",
        "7:03 What are you talking about Florio?!? Tua has made those throws this year against Baltimore and Buffalo this season!",
        "Analysts come up with so many ways that Allen's horrible decisions that lose games are not his fault, lol.",
        "We are going to have to check the NFL bylaws to make sure Aaron Rodgers can legally own both the Bears and Cowboys",
        "Bills gave that game away with bad coaching. Take the field goal, take the safety.",
        "Every super bowl team has losses. The Bills are still unstoppable and they will easily win the super bowl. Josh Allen is the best quarterback the game has ever seen.",
        "Keep our team out of your mouth, Mike Florio. Fair weather fans suck.",
        "As a Viking fan and has since 1970. Buffalo is going to be just fine. Keep believing in themselves and what they can do. The game itself, UNBELIEVABLE! The game for the ages.",
        "How y’all not talk about the giants",
        "Going on 4 and 2 with 10 points up  was massive disrespect...karma works quickly",
        "good takes",
        "Congratulations Vikings !! Game of the year!!! ",
        "Diggs has been part of two of the most memorable Vikings games ",
        "As a vikings fan I found out last year they gave me an anxiety issue this year they are giving me heart attacks why I'm I still a fan idk but I love the Vikings SKOL",
        "Look there is chance or risk in every play so definitely min is better than they were at beginning of season.  Bills have fallen off and unfortunately depend too much on Allen and Dorsey’s poor play calling.  Dabol was a better oc.",
        "this Vikings bills game should go down in football history",
        "Now it's the cold weather for Tua ....These guys are hilarious",
        "We love the @NFL here in Germany the crowd the atmosphere was electric ️that was awesome please more games in Germany ️🇩🇪",
        "Tyreke hill MVP",
        "With the Bills, Cowboys, Chargers and Raiders losing today this has me wondering which QB will win a Super Bowl with their team first: Josh Allen and the Bills or Dak Prescott and the Cowboys or Derek Carr and the Raiders or Justin Herbert with the Chargers?",
        "1:11 its happened before. Careful what you wish for",
        "Last time Buffalo lost at home when up by 10+ points was....1968!",
        "As a Bills fan Josh Allen is playing like straight garbage and needs to turn it around two games in a row he has cost us",
        "Kind of annoying Dungy gave Tua almost no credit so he could go on about weather but eh",
        "THIS is why i never bought all the Bills better than Eagles talk...they're WAY too reliant on one player aka Allen so when he's not playing as well/has an off night/get outplayed by a good D and turns it over a couple times they could be in trouble whereas the Birds dont RELY on JUST Hurts because we have SO many amazing pieces around him, i cant think of a position group outside of LB where we' arent top 5...the trenches, our skill position groups....and a strong DEF too....Birds just build diff this year, and Hurts still tearing it up, but even if he just plays at an aveage level, this team can STILL beat anyone...and his potential hasnt even been full unlocked imo, his trajectory is wild",
        "Said it from early on,this is Cousins time. He has no excuses.",
        "Tua has made big throws in tight coverages especially in the browns game lol",
        "Can we talk about changing the narrative that Cousins doesn’t show up in the clutch or prime time?",
        "If Bills take the safety Vikings may have lost",
        "Looks like terrible coaching again awesome play calling Dorsey.",
        "I'm surprised that all 3 of them picked the Chiefs as the best in the AFC.  I do not see them representing the AFC in this year's SuperBowl.",
        "Vikings whole season is basically that Jim Carrey meme from Dumb and Dummer... \"So you're saying there's a chance\"!",
        "Vikings could just as easily have Jacksonville’s record.",
        "They lost bunch close games last year",
        "the vikings didnt find a way to win this one as much as the bills found a way to lose - like, Allen STILL couldve just taken the safety when the play fell apart & they'd still have a FG lead and about 40sec on the clock for their D to try and kill",
        "The Vikings game was one of there greatest. it will be close to another favorite of mine which was when the Vikes played the cowboys on Thanksgiving. John Madden and Pat Summerall anouncing and Randy Moss being a rookie that year. I watch it every year around Thanksgiving. GO VIKES!!!",
        "We all know Florio is PISSED! He HATES the Vikings",
        "Not to mention the like 30 yard play that they called a catch that was OBVIOUSLY incomplete and needed to be reviewed but they didn't review it.  They should always and I mean ALWAYS at leat look at it",
        "The Bills got a LOT to fight for now, Josh Allen is still absolutely amazing and i think he still has a major shot at some playoff glory. Another Chiefs/Bills shootout is not a stretch of the imagination.",
        "Allen would have put up 70 if he wasn't hurt.",
        "I've said it since K'O and Kwesi was hired this football team is gonna be great before the season even started.\nEven after the week1 win over the Packers I knew we were built different....\nI don't wanna hear anymore hate towards my team which is The best team in the NFL",
        "The world can't see America without Biden!",
        "As an Eagles fan the MIN win was great cuz now people will stop putting a 2, now 3-loss BUF team over my undefeated birds & now re: anyone who says MIN are the best at 7-1; we get to remind them their only loss was to....us!",
        "DONT TALK ABOUT us NOW ... SHHH",
        "Put Vikings on prime time! We know Kirk would lay an egg!",
        "Tony Dungy has Vulcan ears",
        "\"The only place where success comes before work is in the dictionary.\" -Vidal Sassoon",
        "Florio we are not your team and you are not a fan of us we don't want you on our side!",
        "Leadership and Kirk Cousins in the same sentence! O.o Pigs must be flying.",
        "Josh Allen gave the Vikings the game.",
        "Florio's like me. A long suffering Viking fan who shy's away from geeking out about them no matter what.",
        "Tennessee will be a tough out people...",
        "Holy Mary I believe in the Seattle Seahawks..I'm glad I didn't have.. to finish the rest",
        "Life... uh... finds a way.\n\nHahah",
        "Dungy is the star of this show. She says, Coach,  Tony looks around.  Florio is badly placed between the moderator.  He should be on remote.\n\nFox does the best job,  because there are no journalists and everyone on the panel is a Hall of Famer except the moderator. ",
        "I don’t think that’s anything to brag about that u have ties to the Vikings.",
        "Best regular season game since the Rams vs Chiefs shootout game in 2018\n\n54-51.. wild game",
        "nbc is lacking. the clapper... and who even listens to that mike florio guy? your telling me this is the best they can do",
        "As a Jets Fan well done Vikings. Never seen a game like that. Unbelievable!",
        "Even though I watched it happen I couldn't believe it.",
        "Bills had not lost at home since 1968 when leading by 14 at the half. ",
        "Tua has to make a throw? Third and 22, game on the line. Throws a bomb to waddle between two defenders against Buffalo. That wasn’t good enough for you?",
        "WOW.... Y'ALL STILL MAKING EXCUSES FOR JOSH ALLEN..... WELL I GUESS YOU WANT SOMEONE TO BE GREAT ALL IT TAKE IS THE MEDIA MAKING THEM GREAT.....THEY SAY THE BILL RB CANT RUN ...THE RB AVERAGE OVER 5 YARDS A CARRY....",
        "THIS IS WHAT HAPPENS WHEN YOU GET A COACH YOUR PLAYERS WANT TO WIN FOR! we saw who was real and who was fake this week. the Vikings hype train already left so dont try and hop on now people ",
        "The best teams are the ones that can come from behind and win.",
        "Bills 0-2 in games of the year lol  the way to beat the Bills, go to overtime",
        "Josh Allen thinks he can do it all all the time. And that’s his their down fall. Said it at the beginning of this year that this was going to happen for that reason.",
        "It should be a 17 point deficit for the bills game 27-10 at one point!",
        "Wild game.",
        "I've think Diggs was amazing, And that's how you do it with all team players working together on their skills doing what they do best , We all always come back even harder 3 games down, Now it's a new start , Yesterday News is yesterday news , Go BILLS, ️ Amazing game on both sides, We got this Buffalo ️️️",
        "as a fan of football, I do not have access to the film that teams watch each week ( don't even have cable television) but I wonder why teams do not go to an area of their playbook that they have not shown to other teams in previous games. Each offense / defense has at least a few hundred plays etc..you have to change your tendencies every couple of weeks to keep teams off balance",
        "Going for it on 4th and goal was the bills worst mistake\n\nThey should have made it a two touchdown game and kept the momentum.",
        "Mike Florio is an embarassment to the sports analyst profession",
        "I dropped a bundle on the Vikings at +$250 and everybody laughed and said I was crazy. This is me walking down the street this morning ",
        "The Bills don't run the ball! You close out games on the ground!",
        "I appreciate that they at least started with what MIN is doing right versus only what Buffalo did wrong compared to many other outlets",
        "Where did this Florio guy come from? How come he doesn’t understand football and is on a football pregame show? Is he related to someone or have pictures on someone?",
        "The Vikings and Bills game was so crazy!!!",
        "Florio seething through gritted teeth at a Green Bay Rodgers win. Had to instantly talk about the run game.",
        "Florio a bit quiet there when it comes to the tua take hahahah the other actual coaches that know football shut you down real quick hahaha",
        "Dak is a top 10 qb",
        "Shoutout to Jason garret for calling out florio for the hate, Tony’s comment about when it gets cold is fair but it was cold and windy last week in Chicago and he balled out so I’m not worried that the offense will slow down when it gets cold especially if they can run the ball like this the rest of the season",
        "Everybody waiting for Kirk Cousins to unravel \nSorry it was the other qb that choked\nOul First Cousins has an unbelievable security in JJ \nKids unreal",
        "It seemed that Buffalo wanted to give it to the Viks worse than the viks wanted to give it to Buffalo.",
        "SKOL!",
        "Week 10 was  pure madness",
        "Just keep in mind Vikings beat the Dolphins without TUA . I’m just saying …",
        "Seemed like the Vikings were playing the Bills and the refs. Great game, but terrible officiating.",
        "Still the media won’t blame Josh Allen , instead they say he was asked to be ‘Superman’. No he was asked to not fumble a basic snap and turn the ball over twice in the redzone. Ridiculous",
        "Peterson did great, but how do you mention this game without talking about the incredible game Jefferson had? That man had a game!! Especially the catch were he had one hand on the ball against the defender but still came away with it !! My goodness! Not Vikings fan but that was a great game. KC thanks you!",
        "I don't understand this media Narrative of Miami going to have to play up in cold weather. okay so what if Miami wins the division or the conference? all those  teams will have to come down to Miami in the in the winter,  and buffalo came down there in the summer and lost already so basically it's just as bad for the cold weather teams to go to Miami in January.",
        "Buffalo, since Week 1, which was impressive, has had scoring droughts for long stretches in games.  I don't think they're running the ball that well, and they seem to be a little short on receiving weapons.  They might put in the best offer for Odell-Beckham, looking for a spark on offense.  I think the way the Chiefs are probably playing a little better than the Bills, right now.  Last week, I'd've put Buffalo on top.",
        "Buffalo fan here.... I'm tired of the team being in the greatest games ever for coming out on a losing end. The hail Mary pass to lose against Arizona, the shootout against the Chiefs, now this.",
        "As a Pats fan in upstate NY, thank you Vikes, it snowed recently and we needed a little salt here. ",
        "The ball never lies and the vikings scored 2 TDs that never counted before that Allen fumble ... that might be the game of the year so far Bills just know how to put a show they should of never lost to the jets that was a big loss",
        "I was very impressed with the Vikings never say die attitude in that game. As a Ravens fan wouldn’t it be nice to have a purple Super Bowl, the Ravens vs. the Vikings.",
        "don't mind me, I just came to gloat.",
        "lol, punting it is what Garret did against the texans in 2018.  didn't even decide to go for it or kick.",
        "Maria Taylor is just difficult to listen to.",
        "The refs should’ve reviewed that Davis drop that put the Bills in FG range. Glad the Vikes won",
        "Allen has like 10 picks this season.  Let's take the crown off this guy already.  Hurts has 2, that's it two.  Oh, and 0 loses.  So take them out of the best team talk as well.  They have 3 loses.",
        "I have tremendous respect for the Bills mafia, great fan base, great atmosphere for a great game, love to see these two in the Superbowl against each other.",
        "Keep it to just 3 and take that woman off the set.",
        "Let's not forget about Dalvin Cook sparking the come back with 80 yard run leaving everyone in the dust",
        "In this game, 14 points could equal 7--15. seconds.",
        "The Vikings are actually playing a full 60 minutes every game which they never did with Zimmer at the helm.",
        "Wow bills letting that lead slip is worrisome!that's if you bum analysts are consistent that is",
        "Worse officiating, ever. PI on Hokenson, all day. Non catch, no call on Davis. 12 Bills defending, goal line stand. holding call on Darrisaw? Horse collar call on Kendricks, WTF? Everything was stacked against the Vikings and they win. Justice served.",
        "Haha at last Florio dropped the sarcasm against vikings at 8-1, he is awful and biased, he needs to be replaced already he is one of the worst analysts, he adds nothing",
        "Those so called \"wow plays\" get Allen nowhere. It's okay to admit that you were wrong. He is a TO machine.",
        "As a Vikings fan, I have a two word message to the rest of the NFL: \"FEAR US\"",
        "Vikings can’t keep relying though on being able to come back.",
        "There are lots of salty Buffalo fans in the comment section. \nMinnesota has faced a disappointing franchise history. You have to let them have their time in the spot light. People sleep on Minnesota a lot and I think it's about time to bring home the trophy.",
        "Jason Garrett wouldn't take anyone over Josh Allen.  Not even Mahomes, I guess.",
        "Florio’s a clown … Tua’s made plenty of big throws this season. Especially during the Ravens game.",
        "Josh Allen he's a biggest choker...he losing every close games ...he can not finish to win...that means ..no superbowl this year .....all I heard is....this is our year....3 years nonstop ....than what's next ...the whole team fall flat on own  face ...so better close games without big mouth talk ...",
        "Dungy: I still have ties in Minnesota. \nMe: oh yeah you did coach here back in the day. I had forgotten that ",
        "Florio has to be getting paid specifically to keep pushing the goal post on Tua. TUA HAS TO BE PERFECT EVERY WEEK TO SATISFY ME!!!",
        "Ms. Maria Taylor is great. Great job Ms. Taylor your the perfect fit , your the perfect Quarter Back for this show.",
        "How can Kevin OConnel not be the coach of the year??? Talk about a complete culture change!!!",
        "Best regular season Vikings game since Favre threw that hail Mary TD in the back of the endzone against SF in 2009. The last time we were 8-1. Best overall game for the Vikings since the Minneapolis Miracle. Kirko Chainz rallying the troops and J.J. putting it on the d-backs has been amazing, but don't forget the Vikings D being one of the most opportunistic and \"bend but don't break\" in the league. Philly didn't score in the second half against the Vikings D and Buffalo only put up 6...",
        "Neutral fan. There should be stiff penalties for the refs in the bills vikes game.\n\nThe NFL is very lucky that the Vikings won because not reviewing that Davis \"catch\" was one of the most blatantly egregious things I've seen in awhile.",
        "This show got ruined",
        "7:36 lmao guess it wasn’t windy in Chicago last week. Keep doubting uno please",
        "As a Bills fan, I’m glad we’re involved in the game of the year every season. I just wish we could win one of them.",
        "allen is a reckless gunslinger.",
        "The Josh Allen pandering is just pathetic. If that were lamar, mahomes, hurts, or tua, they would be get chewed out. But the nfl golden boy Josh Allen gets praised after 2 int and a fumble which lost the game. It’s insane that people are so afraid to say a single bad thing about Allen but it’s even crazier that he just got praised for that performance",
        "I blame the boys loss on skip Bayless alone",
        "Josh Allen chocked",
        "Vikings getting that chiefs grit",
        "The Vikings will be one of the most battle tested and resilient teams going into the playoffs. All those close games taught them how to scrap and fight until the final whistle blows. SKOL",
        "TJ WHat what What!!\nHad more impact in one defensive sequence than Myles Garrett had all day Dolphins hung 39 on them",
        "Dungy is spot on about Josh Allen..",
        "TUA is the real deal, stop playing like his a puppet controlled by the offense coordinator",
        "The Minnesota-Buffalo game was one of the greatest games of all time",
        "Bills are done. Their team is completely predictable because they have no run game. Vikings vs. Chiefs for the championship.",
        "I like to imagine a new player just started to play Minecraft and got roasted the absolutely hell out by Camman himself.",
        "What a GREAT Sunday! \n\nCome to our channel and see what our best bets are for the MNF Commanders vs Eagles game!",
        "This show is B-O-R-I-N-G without an ex-player on the panel...",
        "Bills need to close out games. Cousins glad Vikings drafted Jefferson. Giants is  a team do not want play in playoffs. Allen got control that Farve in him , or its going hurt thd Bills. Chiefs oue best tean in the leauge",
        "That was the NFL at it's best can't wait until January the playoffs!!!!!",
        "Mike Florio, who clearly is either trolling or doesn't watch the games, wants to see Tua throw the ball into a tight window in a big moment.  Like the game winning throw to Waddle in week 2 to cap a 21 point 4th quarter comeback?  And Jason Garrett slapped him down beautifully with Tua's throw to win the national championship as a freshman.",
        "Maria Taylor is a wonderful moderator",
        "I know that the loss stung for Buffalo Bills fans, but I’m seeing too much stuff online about putting all of this on Allen losing the game for them, but there were enough coaching mistakes and defensive mistakes by the bills to not put this whole game on his shoulders.  KC and JJ were torching the Bills secondary the whole game….and the 4th and 2 in the red zone when you could have kicked a field goal was all on the coach.",
        "Hill was shut down and waddle Tua spread the ball around and pretty much carried the squad. I swear these talking heads keep changing the  goal line ",
        "He has gone back to his bad habits of forcing the ball on a long ball instead of field goals or running the ball",
        "They didn’t win we lost that game three times we’ve lost that game to them we should’ve won that game three different times",
        "As an #Eagles Fan #MINvsBUF was even better cuz:\n\nA.) No more BS Bills over Eagles takes now they're 6-3",
        "I knew they were gonna make excuses for Josh",
        "I thought Vikings were done - until Cook busted off that monster TD run.....I felt they would find a way after that.  It ended up being a wild way to get it done - but you gotta take a W any way you can.",
        "I believe with the win against the Bills, the Vikings are now a team to reckon with. It can only grow should they beat the Cowboys next week!"
    ],
    "comments_disabled": false
}