{
    "video_id": "kLwccC38F-M",
    "comments": [
        "Reminds me of Pat And Jen's look for the button series IM CRYING OVER NOSTALGIA ",
        "The following link for the following information about the same the first one is a good time and consideration in this message and any attachments may be a ",
        "Montages always cut him out when he talks r.I.p ",
        "You could've added a heart of the ocean, it'd make it infinitely easier to work underwatr",
        "How long did it actually take you to build all of this?",
        "U use a lot of glass make a glass factory",
        "How is this guy so patient like I could never",
        "Turtles don’t have tails",
        "69 Xp LOL..",
        "40k views in 29 minutes 6K likes that just shows how much people support him",
        "I think you should make a secret trapdoor in the ruins.And when u open it,it’s filled with gold.",
        "21:50",
        "I will send it to all of the best of the year and I am a very good and it will send the best of luck to all of the best time to be able and willing to all of luck to you need to provide a very happy and healthy and happy holidays to you need anything from 🇱🇰🇱🇰️️️️️",
        "my favorite hardcore youtuber ever ",
        "We can all agree that he never disappoint us with his content ",
        "How many times you gonna say brain dead no hate",
        "You can place a block on it and it won't be destroyed",
        "lvl69",
        "Your probably the only person who films yourself making a giant structure and all the detail for us! EVERYONE WATCHING GET THIS VIDEO TO 10 BILLION SUBS AND LIKES AND REACH THE HIGHEST SUBSCRIBER AMOUNT EVERYONE'S SEEN",
        "You can actually use leash and use your elytra to fly and it's much faster hahahaha",
        "Bro he forgot the stone thingy",
        "@aCookieGod",
        "Baby shark",
        "I LOVE your videos",
        "I'm new",
        "Lmao",
        "Maybe you should called the tiny ship's some",
        "..O",
        "The way he said \"hEh~\" at 3:14",
        "Sorry this is my first vid I watched on your channel",
        "I found you today and it made my day ️\nToday hasn't been very good and you made me laugh so hard thank you for that",
        "Stuffers HaPpY FuLl",
        "Sneako trying to insult Charlies relationship by showing off the happiest, healthiest looking picture of them is hilarious",
        "Fact about minecraft:if you wear the turtle hat you cannot die in ocean",
        "",
        "This shipwreck is AAAWWWEEESSSOOOMMMEEE!!!!!!!!!!!!!!!!!!!!!!!",
        "I liked the part when he said i catched jamal",
        "what is this world's seed? Pleaseee i love the lake and cliffs",
        "Nokoooooooooooooooo",
        "Bro my name is Carter",
        "8:02 the color changing is intentional by Mojang. Prismarine blocks change color from water green aqua and from aqua to water green, its just really hard to notice if you dont stand there and look closely. The easiest way to notice this without  timelapses and stuff is to take a photo of the blocks using your phone and just keep staring at the prismarine block in minecraft. after a while youll notice that the color in the photo you took and in minecraft is different. but you can just use replay mode too",
        "You could get any block and you would make it amazing",
        "Can’t imagen how greedy his mouse is",
        "You not weird but weird weird",
        "They do eat steak in real life (well my horse dose so)",
        "Haliphron atlanticus is the name of a seven armed octopus",
        "His exp level was 69 for whole vid LOL",
        "mans just made global warming in minecraft",
        "He should’ve name the golden fish Goldilocks",
        "Best thing I’ve ever seen ",
        "JJ sand wihg",
        "Miranda is my moms name",
        "Wi did you not tell us that you were going to be building ️",
        "aCòokiegod:\"shum slabs\"",
        "It's a septopus",
        "The literal amount of time and effort he put in his videos is insanely crazy.",
        "hw did this with just him with friends he can make hell oh ya do that",
        "13:23 its not explosion its EXPLOSHON",
        "Just pour one bucket off over the edge, and then step one block behind it down on the ground and start building up. Easy as that.",
        "These videos leave a smile on my face when thinking of Technoblade, because no matter how much he will be missed his legacy will never be forgotten. Rest in peace technoblade B-)",
        "\"Weeeeeeeeeeeeeeeeeeeeeeee\" I'm like \"Lol weeeeeeeeeeeeeeeeeeeeeeee\"",
        "Trevor is my absolute FAVOURITE out of the turtles  ",
        "It’s funny how he could of just made a circle glass cage in the ocean and it could of saved him so much time LOL",
        "Cookie always impress us with those magnificent build ",
        "Nice. Atlantis",
        "10_10",
        "I'm so happy I subscribed",
        "Pls explain me frankiln",
        "Fun fact: the prismarine blocks change the Colors and it’s normal",
        "you should have made a statue for Poseidon up there in the center",
        "I love it!  WoW!",
        "Apart from the golf, this is my fav series yet.. and it just got even more funny",
        "5:20",
        "He aways build anything impresses me!",
        "he does know dolphins are mammals and need air to survive, right?",
        "I have a idea how about you add Spongebob",
        "Cookie-lose his totem of unDying on purpose-also cookie being brain dead the whole time",
        "R.I.P that cow\n2021-2022",
        "Only 112 thousands of likes for such a masterpiece?",
        "I saw this on TikTok",
        "Fun Fact you can place hay bale under the campfire to make it bigger/higher",
        "8:02 Fun fact prism marine blocks are supposed to change color they do that all the time and if you stare at it long enough you can watch them change color which is pretty cool by the way I love your videos they are amazing!",
        "Bro is a god he takes so much time and effort for his vids",
        "U are so hard working no one can work hard like u:)",
        "hi",
        "You can also fly with mobs you can lead",
        "You never fail to make me laugh/smile",
        "How's your finger?",
        "I love you I love your cats I have a cat too",
        "bro really said”horses eat carrots i thought they ate steak”",
        "This build turned out amazing! But in my opinion it would be cool to have a little sand island for the turtles so they have a bit of land",
        "he says “come on” like a youth pastor trying to ge the crowd clapping",
        "We're just going to ignore that he said that horses eat steak",
        "sevenpus you mean",
        "Should’ve probably used soul sand instead of fire and signs",
        "Watched this entire video and I'm not disappointed one bit! This build is amazing!",
        "Marshmello Family is Here watching your videos ",
        "How long did this take you",
        "Keep up that good work @TheCookieGod the videos, keep getting better and better we all know that the pain it really hurts youtubers, gotta risk their lives for views",
        "orang saya mau main geme sama kau",
        "Wow",
        "I'm sorry that WEEEEEEEE bro ",
        "The enderman in the back when u were building the ocean monument lmao amazing build thoooo",
        "9: 49 I just realised his xp",
        "At 4:47 I love how he just falls like it's nothing",
        "I just realized that the blocks from the monument change color for night and day",
        "9:43 he’s the type of guy to ask someone in a fursuit “Are you a furry??”",
        "All the animals look so funny 20:49",
        "I wish I was as patience as u",
        "9:32 No Cookie, Horses do not eat steak.\n20:36 No Cookie, Dory is a girl.",
        "Cookie god: * fills place with water\n\nSkeletons: ️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️️",
        "Hi I really appreciate your content and I think you do do a really good job but I also wanted to tell you that when the axolotls stop moving like that they're actually healing and playing dead so yeah anyways have an amazing day!.｡.:*･ﾟ♡★♡ﾟ･*:.｡ ｡.:*･ﾟ♡★♡ﾟ･*:.｡ ｡.:*･ﾟ♡★♡ﾟ･*:.｡ ｡.:*･ﾟ♡★♡ﾟ･*:.｡ ｡.:*･ﾟ",
        "Diamond blocks are sure not the strongest block,but everybody noticed Bedrock does....every block looks like a “masterpiece”",
        "My name is ryan",
        "Here’s a tip for campfires!  You can place blocks over it and the smoke will still go through! (I use it a lot in my kitchens) But I don’t know if you can put sand though. I’ll test it later!",
        "We all like you",
        "I appreciate the content keep it up!",
        "What was that sound at 3:12",
        "make an earth in minecraft",
        "Horses can eat wheat and apples but if you want to breed them you use golden carrots that's why the horse was following you",
        "When you relize that a conduit would make the process 30x easier",
        "Why you named the third dolphin giga chad ",
        "The axolotls were acting “braindead” because when they are about to die, they play dead and heal themselves",
        "Yo u should have put hei over the camp fires to make the smoke go higher",
        "It's amazing to see how he can create things just on the fly like that.",
        "Balls?\nAyoo",
        "the city is good looking keep up the hard work",
        "I just thought of the best thing if you ever need to use any teeth for a shark or something or like a big monster you can use dripstone",
        "Bro ocean is 10x better than what we have",
        "You should put like a 2 block high barrier so the dolphins and polar bears don’t fall",
        "Love His EXP Level LOL",
        "I feel pain making a medium sized pool meanwhile this guy in hardcore and his unlimited amounts of totems",
        "You never face revealed :(",
        "I love how the xp is stuck at 69",
        "I love these videos but there is one thing I don't like is that someone  spoils everything. Anyways keep up the good work!",
        "I subscribed and liked",
        "The ship needs gold",
        "I Always dreamed a Atlantis was real too",
        "Turtles are already in Minecraft ",
        "20:39 did you call dory a he",
        "28:06 it allready in the overworld",
        "11:25 welcome to the 3th episode of cookie sucks at English",
        "Please add me on the wall of leaves",
        "O hay a couple docile sharks\nThe sharks are dead they are not moving they do not have open mouths\nThey should have ben made upside down.",
        "[TIPS] you might have to put teeth on the shark stickying out so it looks like a shark",
        "I name the octopus sepus",
        "Here are all the parts I dined the funniest \n3:13 \n\"The very first thing I want to- do!\" ￼\n4:36",
        "Que dedicación, Dios mío",
        "He is good",
        "It would be nice to get a conduit inside of the custom ocean, love your vids and ideas man!",
        "This is so entertaining",
        "This is soooooooo cute you guys",
        "Lol  ",
        "Hi @aCookieGod! So far I liked a lot of your builds. Keep it up and never give up!",
        "can we get the seed?",
        "Love yours vids!! I’m excited to watch it",
        "This is amazing",
        "one  you said   slime  balls",
        "Your an awesome youtuber. I love your content and how you never let us down. I love your channel. Your jokes don't suck. Your one of the funnest youtubers ever.",
        "please make a video of i tranformed the nether into end",
        "I like seeing kratos be more verbal with his emotions. Like hearing him say he loves his brother is something you thought you would never hear from him. :'(",
        "23:32 But :( Why not like ninja turtles ? U have 4 turtles D:",
        "Can we take a sec to see how much he does for us really he's done a lot",
        "Love your channel but did you just call Dori a boy......",
        "Dory? HIM? \nwow I never knew she was trans. She must have forgotten",
        "At 8:52 minutes it’s really funny how he says weee",
        "Instead of globe fish tank",
        "Who else notice the primerins blocks were changing color blue to green to blue to green to blue",
        "Yeah you're right",
        "I ️ your videos ️️",
        "3:12 ayo???",
        "Level 69",
        "Why do you have 69 exp near the end",
        "Cookie - \"Lats name him Franklin, all my old viewers will understand.\" \nMe - Of course I remember Franklin oh wait what you mean old??",
        "You’re not careful enough bro",
        "Let’s go you found.a sponge dungeon spongeon",
        "Very nice",
        "Wait wait wait instead of making a tube like aquarium can't u add details outside? Making it beautiful and yes u never fail to make us entertained",
        "I wanna see you build a whale pls",
        "I was expecting a monster's sea nest (like a huge cave). also little details that could be nice is to make the ice look like iceberg with more ice in the water like real icebergs. Also you didn't show the Atlantis once the water was there, neither the crater,  I would of like to see it.\n Great video nonetheless.",
        "\"i thought horses eat steak\" ",
        "Good",
        "Rip cow",
        "Next video: Minecraft, I grouped all the blocks into a single chunk in minecraft Hardcore",
        "Bruh",
        "Almost caught up on s2 this series and the last has gotten me through hell and back what an awsome cookie dude much love from the potato girl amazing builds and awsome pet naming skills p.s name one potato lmao x",
        "Ty u entertain me so much I love your videos WRITTEN BYE ASSAD AND GREGORY KEEP UP THE GREAT WORK  :)",
        "In a fact he’s exp is 69",
        "Why didn't you put blue dyed glass underneath it so it looked like it was wet",
        "I can’t believe that he builds tons of stuff for HOURS for us\nHe deserves 10 Million subs",
        "Hihihi",
        "Squid",
        "28:14 ️",
        "breaking the dirt block and letting the water fall was super satisfying..",
        "and im a huge fan and im giving you minecraft knowledge coocie head",
        "i did this and was exhausted",
        "GOOD CONTENTT!! but pls make the censor screen more blurry cause ur spoiling ur builds",
        "You do know that if you place bonemeal underwater it will create corals and seagrass right?",
        "Love from pak",
        "this is super AMAZING, i build a quarium too but bit smaller than that it is so painful ",
        "Where is episode 30 Im looking it yesterday but still nothing",
        "We can all agree that he never disappoint us with his content that's why I give you one Tesla ",
        "I have an idea that you put more fish in your aquarium",
        "20:38 dory is a girl …",
        "I love you ️",
        "you should of added drip stone for teeth for the shark",
        "man really named a turtle after my name bruh",
        "My  name is Ryan",
        "You have Covid 19 LOL",
        "you should add an orka shark  it's cool",
        "Idea: isntead of trapping villagers, you could build them a giant City for them!",
        "\"That horse likes carrots?!? I thought he eats steak\" - That must of been the funniest thing I have heard and sounds like Minecraft logic.",
        "You don’t need to listen to me but I feel like u should build a military ship that’s bigger than any other structures that u built and build it on top of the big pillar",
        "it's veeerry veery cool",
        "Cookie god you’re the best YouTuber",
        "Dolphins breathe oxygen",
        "Dolphins are whales so they can't breath underwater but they can breath air. They just hold their breaths for a very... very long time.",
        "The only thing that blows my mind is that how many totems do you have",
        "We both said roar that was so cool ",
        "Cookie build a statue of your self in minecraft like medium size",
        "Love the weeeeeeeeeeeeeeeeeeeee",
        "calls dory a boy at 20:39 lol",
        "looks crowded, too many builds lol",
        "if you make a conduit you can swim and see underwater without having to breathe",
        "Am think this is really good  it was fire ",
        "COOL!",
        "LOL bro know what he’s going to use for the underwater village yet",
        "three small suggestions 1 the icebergs usually go underwater as well two would be adding a small lip to the glass container and three you can bonemeal the water underground make seagrass",
        "Did he release 2 blue axolotls??!!",
        "Can you transform the nether portal maybe. ps Love your video",
        "where is the wall of leaves?",
        "Get your friend’s reaction to the giant fish tank",
        "you should avoid using a lot of item frames because they count as an entity",
        "WOW",
        "There are 2k different tropical fishes in minecraft",
        "How did he repair the elytra with squid? Don’t you need phantom membrane? \nAlso does he have some beef with wadzee ",
        "golden foods attract horses that is why the horse was following you",
        "AcookieGod:20 different types of fish\nBedrock Edition: 8350 different types of fish",
        "The fact that he did everything possible but mistaking Dory's gender",
        "Adorable",
        "this looks awesomel ",
        "9:35 sea horse",
        "All the best for you bro! Behind a good video theres a massive effort! You have my respect ",
        "I love these vids man!! Keep em up",
        "Please ddoo aaaa ffffaaacccceee reavel im7(:",
        "Dude his custom ocean Is way better than the normal one...like i am so impressed about how u have cover all the things which are in ocean in this circle",
        "Make a working lava lamp",
        "I'm going to play build like MC in Roblox",
        "POV: Your watching him collecting corals to put down before the water knowing what’ll happen.",
        "you can make any block into a masterpiece and they just get better and better ",
        "Bro I think he moan when he placed the orange shelter box",
        "Two minutes and when the zombie starts attacking you go he he he he he he he",
        "The best",
        "Fishy",
        "BTW it is simptopus",
        "I Love how he can entertain people with just his style. oh, also I watched him when he was a small content creator and his content keeps getting better and better.",
        "Cookie god the submarine look good! it’s not terrible ITS THE GREATEST KEEP THE GOOD WORK UP!",
        "He’s not weird at all",
        "ur sooo cuteeeee",
        "bro why didn't you just get a real turtle instead of building one",
        "17:36 That's either a Heptopus or a Septopus",
        "Only people who didn't come from tiktok are allowed to like this",
        "oķkkkkkkkkkkkkk",
        "Hes justvery good at building",
        "Btw dory is a her/she not a he/him",
        "seed -6638727709360098368",
        "Your octopus is not bad! It’s amazing! Mistakes help you LEARN!",
        "dude ya gotta chill out u made so many good build",
        "His imagination is great he has great videos i’m sure we all love it It’s Great!",
        "I hope this channel never ends and keeps spreading happiness ️",
        "Coockie got possed by zoro and coockie got lost in a straight line\nNc vedeo can i have a shout out",
        "should've called the turtles after the teenage mutant ninja turtles",
        "An octopus with 7 tentacles is actually called a squid",
        "How are you alive I eat cookie’s ",
        "Did anyone else realize that he’s level 69 the entire video",
        "There is over 1000 varieties of fish",
        "He used zombie catchers music man",
        "Good job no cussing",
        "It would be good if you were adding an underwater volcano but the thing that you did is amazing!",
        "Dora the explora not explorer no explora",
        "bro has the best soundtrack ngl",
        "COOKIE U DIDNT NOTICE U GOT A RARE\n VILLAGER",
        "amazing video cookie, appreciate your humor and efforts!",
        "Franklyn:D",
        "I'm not old but I used to watch Franktlen!!",
        "did anyone notice that after he repair his elytly xp is 69",
        "You should build the entire world in a glass and outside it would be the nether and the end",
        "bro dori is a she",
        "Let's just  appreciate how much work and time he puts in these videos to make our day, huge respect!! ",
        "Why u dont fly with elytra when u was getting mobs",
        "He really di d that hard work on survival mode",
        "The name should be Septopus ",
        "Axolotls actually play dead to heal and they can loos limbs and a chunk of their brain and still live...",
        "Love u bro",
        "Am I the only one who realize d that he is taking stuff from the ocean to build a ocean aqereaom",
        "Imagine how long this build took and how much editing and his vids are still 10/10",
        "My man can make a dirt block into smt better!!!!",
        "Respect for cookie he spent hours for this to be done",
        "XXX20",
        "Pov: the camera man ️️",
        "Omg",
        "They didn't have to break the campfire you just could have put a block on there and it was like it was on fire somehow underwater",
        "Fun fact: the axolotls are not bugged at all. They play dead in the game and that allows them to heal.",
        "Keep up the good work my guy",
        "Why did you go in the water your a cookie you are going to get soggy!",
        "I know that you’re gonna call him seven",
        "There are penguins in Minecraft. But only one is in Minecraft and his name is Skyes",
        "Are you from America?",
        "Can we just appreciate the fact that Cookie had 69 levels almost half of the video",
        "So cool",
        "Can you make a submeren under water",
        "Please make the turtle climbing the main big long thing 8n the middle please!!!!!",
        "Was the sand floating when he built the astrode.",
        "Ok ok can we appreciate how he spent ALL THAT TIME just for US can we?",
        "\"I'm better than you\" I'm Bigger Im Stronger IM BETTER I AM BETTER ",
        "@wadee",
        "You should maybe change the submarine color into yellow?idk its your opinion love the content manand i think you forgot to add the dolphin and the whale?",
        "The determination of this man is astonishingly humongous",
        "breaking the ocean to build an ocean is such a homo sapiens thing to do",
        "It’s funny how the ocean is already in the overworld ",
        "Sometimes he really sounds like Phil Dunphy, Especially at 18:06 :,)",
        "Cookie”wow the ocean is kinda massive in mincraft “ me : nah rilly",
        "It would be cool if your generator like the wool and wood gen connect to the big storage room",
        "how you have soo many blocks",
        "Hey Cookie you should put hay bales under the campfires to make the smoke rise higher. Love the content ",
        "nice ocean and nice village tbh",
        "Dory is a girl!",
        "SB 737 quited his hardcore world:(\nI wish u keep this world going cookie:)",
        "You should have removed the glass, it would look cool with just a tower of water in the land",
        "You left me",
        "I've been suffering from severe depression, I can barely get myself to eat or drink anything, I almost never genuinely laugh, and you help me with all of those. Every time you say to hydrate and grab a snack, I do. I laugh at almost all of your jokes. Thank you for helping me though a tough time Cookie.",
        "Bro imagine how dope all his builds would look with shaders on",
        "Cookie is the best let's go Cookie army",
        "why is no one talking about the xp",
        "WOOOOOOOOOOOOOOOOOOOOOOOOOOOOW",
        "I keep scrolling to see my comment lol my hand is friking * tired",
        "He forgot to drain atlantis",
        "3:12 uwu",
        "I hope one day you will remake the island you made in series one because i LOVED those",
        "The most used word “OCEANS”",
        "No you didn't",
        "I love ur content but I think I’m the only one that saw pairat",
        "I like how you brung 2019 to life in 2022",
        "his exp lol",
        "I cant belive that he had to even use his hardest work ever on this for our faces to turn into smiles",
        "One question: Why didn't you just place the sand on the bottom of the ceiling? It would fall and cover all the ground...",
        "Amazing content,amazing build well done. (This is my new acc btw )",
        "One thing- when axolotols have low health they freeze in place and get regeneration 2 effect",
        "I can’t believe you actually made that",
        "You can put a slab above the campfires so that it’ll cover it but the smoke still comes out.",
        "Please add a penguin in your next video ",
        "Seven is sep September used to be the seventh month of a year which is how it got its name until Julius Cesar created the months June and July",
        "With that campfire you can place an haybale under the campfire for a higher distance for the campfire >TIP<",
        "Cookie Is a God Of builds I mean Is the fact\nCookie>All Minecraft Hardcore players combined\nCookie Keep da Good work and The cookies! Remember the Wall of leaves!",
        "I've waited for a long time to see Jack's reaction to Atreus hugging Kratos, there's just something so genuine about Kratos saying \"Atreus. What has happened?\" and realizing that this wasn't just a reunion hug",
        "Why does he not use his woodfarm anymore",
        "Did anybody else see him? Brake check stone block thing woht his fist like one hit or just me?",
        "the city is very nice i like it",
        "Me when I was little building a house out of legos: “yes it looks so good!”\nMe now watching this video: “yeah that Lego house never looked good”",
        "How bout u add a kelp forest and that some kind of large crack in the ground which has magma blocks; I don't really remember what that's called...",
        "A conduit would look nice in the ruins that you created on the mound. Also place haybales under the campfire so that the smoke rises even higher.\nHopefully you read this...",
        "Omg its been so lonnnngggggg sinve i watched you!!",
        "Thank you, Techno, for making my childhood so much better.\n\nRest in Peace, Potato King.",
        "Little THOES he know when octopus has 7 hands they recently just had s@x",
        "the entire video was the definition of \"trust the process\" and it did not disappoint :)",
        "The secert Atlantis is like for the fishes to play hide and seek",
        "nice xp at the bottom funny number",
        "COOKIEGOD THER AR SEA TURTLES IN MINECRAFT GET SOME",
        "I realy love your videos, your content motivated me play in hardcore gameplay ! Thank you for MINECRAFT OCEAN",
        "Kookie",
        "Number of View ",
        "If you put a camp fire down and put a slab on top you can put water on top without it going out",
        "I can’t sleep ",
        "Man I don't even like bts",
        "Vi isto no tik tok",
        "How long are you going to make the shark ",
        "I’m glad for the recognition of the Septapus. Such an odd creature.\n(This is a joke comment if you didn’t get it)",
        "Guy: \"What did you during the vacation?\"\nHim: \"I spent 168 hours on a giant Minecraft aquarium\"",
        "If you have the time you should make us be able to go inside the submarine!",
        "Him : makes THIS in HARDCORE MODE\nMe dies in normal survival from blazes trying to get blaze rods: im quitting survival mode…\nU motivated me to play again today!! Im actually gonna beat the dragon this time!!",
        "Did you know I’m actually Mrs. Hopps mr. Hobbs girlfriend",
        "Smoke from the campfires Can pass trough slabs so you cant see the Camp fires and if you want the smoke to go Higher just use haybales under the campfires then the smoke Will be higher",
        "I remember that episode",
        "@aCookieGod you should make a auto glass maker so you don’t have to wait 6,000 years for glass.",
        "I Love You!",
        "Dirtyminded moments:",
        "Hammerhead sharks are now whales ",
        "8:00 Fun fact! Prismarine blocks do actually slowly change colour from blue to green, and that's why it's visible in the timelapse! :)",
        "3:14…",
        "At 3:15 LOL",
        "For the hidden city it would be cool if you put flowers and crops to make it look more alive. Maybe even some villagers",
        "you can leash animals and fly over there with elytra and land in water so they wont die from fall damage",
        "Kinda mad/sad that he didnt name them like the ninja turtles",
        "Nice game best story \nBig fan ️",
        "Can anyone tell he works hard for us? well he does️️️",
        "I like it it is lovely",
        "Awesome dude ",
        "I dont think you should make the shark out of wool cuz if the ocean caught on fire they'd be the first to go to the clouds  ( not trying to hate )",
        "Nice one We'd love to add you on our music blog!",
        "Actually,the octopus looks really good.",
        "0:35 “where the fun begins” sorry I just wanted to quote that lol",
        "13:38 \nFloating sand??? Anyone have an explanation?",
        "GF: U got time?\n“No”\nMinecraft: You got time?\n“Definetly”",
        "Ex-spo-sssshhhhiiiion got me laughing for 2 minutes straight",
        "Um when he placed that orange shulker box did no one else her that moan‽",
        "its not corals its coral",
        "13:39 “that looks pretty realistic right?!”\nMe:um in Minecraft right? Cause floating objects are not realistic in real life unless there’s a ghost in ur area",
        "8:53 he was singing “weeee” LOL",
        "FGGG",
        "You should add a beach on top of something so that the turtles can breed!",
        "Dude if u put a axalalotal with fish....",
        "Why do you have 69 xp levels",
        "is nobody gonna talk about him saying \"welcome to ur new home daddys\"",
        "i actually would’ve used the lead and flied over to the tank for the squids and dolphins. there’s water, anyway. they won’t die.",
        "We can appreciate him with all of he's videos and work he does, and nobody relies that horses eat golden carrots",
        "this citi is realli cool",
        "I am Amaksha nikshan 7years old.🇱🇰🇱🇰",
        "Dory is a she",
        "I subscribed",
        "The reason I watch your vid  you make me laugh even when I'm sick ",
        "\"Richer than Wadzee\" says the dude who wasted 50 totems of undying in a few hours of building",
        "You called dory a him",
        "That “I really want to dooouuuu” ",
        "25:38 20 types of fish? No there is ~2.000 types of tropical fish",
        "Every time I build something amazing I see this dudes builds and it humbles me real quick XD, but also inspires me to get better at building",
        "Dory is a girl and she only has blue colors but i really like them",
        "Wowe",
        "I love how Cookie always says \"and this is where the fun begins\" when he knows it's the hardest part that ends up being the funniest. I'm new but I'm already loving your content and have inspired me to build more in my worlds!",
        "Ok what was this 21:28 lol",
        "Its not a mistake its a mAsTeRpIeCe",
        "23:40 You should have named them Leonardo, Donatello, Raphael and Michaelangelo",
        "Turtles have tails",
        "Kelp? More like help HAHAhahaha..ah…️",
        "8:51 Hell nah!",
        "Cookie:*makes a build better than I can in my whole life*\nAlso Cookie:meh, it's looks pretty bad",
        "Can we just appreciate that he did this all in SURVIVAL! ",
        "Not sure if you know this now or not but the axolotls play dead so this way whatever is attacking them will stop so they can heal, that's why they sat there and amazing build!",
        "COOKIEGOD YOW FORGET THREE FISHS PUFFERFISH,SALMONS AND CODS",
        "Nice cool",
        "I am not surprised at how much totems he used.",
        "I really like your videos, I had an idea to make sure what happened to your other world doesn't happen again, maybe put a copy of the world on an external drive. ",
        "Dory is a not a boy",
        "can u show your statistics for next episode???",
        "You could have found clay in the lush biome so much faster",
        "altantis is a song right",
        "BEST ATLANTIS EVER",
        "What he didn’t realise is that campfire smoke can travel though 1 block but if you also wanted the fire than I guess it’s fine",
        "why don't you put the other fish like salmons and puffer fish?",
        "I like your build cookie",
        "He suffers about 17 hours while we just watch him lose braincells. :)",
        "i love how he makes the shark so cool keep up the good work",
        "That looks so good ",
        "It’s my birthday",
        "20:52 his level is 69",
        "the result is so beautiful omg",
        "your good at belding things and am new to the chanule hop you like my comment.",
        "exactly when the pillargers came to to raid him and he said u cant touc me im god i was like- REPLACE THE GLASS WITH BARRIER BLOCK",
        "Pov your Trevor the turtle your stuck in this hell place",
        "your building skills is god level bro",
        "Why dosnt he just cover the campfire with blocks???",
        "\"minecraft is weird\" more like \"your mom is weird\" 0:15",
        "Can we just appreciate he does this in survival made.? LEGEND!",
        "The fact that YOUTUBE has commented, it means it must be good. I haven’t gotten too far in the video, I’m only at 3:59! Good job Cookie!",
        "21:30 WTH WAS THAT SOUND ",
        "Hey a cookie god u have really good vids I watch them everyday and keep up the content and I love ur 1 blocks vids",
        "YESSS LAST EPISODEEEEE FINALLY I CAN BE UP TO DATE",
        "4:16 that looks a lot better it looks the same",
        "Your the best",
        "Wow how long did this take?",
        "69 xp",
        "prismarine is one of my favorite blocks because it changes color fro the light green to a blue.",
        "Bro actually said \n\"The first thing we wana dO\"",
        "No!!.... Horse in Minecraft eats Gold food like Golden apple and Golden carrots and thats why?. why the Horse is folowing you and....see i now Minecraft MANN im a GENIUS MANNN WOWWWWW!!! MANN",
        "Listen when I say this.. WHY THE FUDGE DID YOU NOT PUT A FENCE WITH THE DOLPHINS ON THE FENCE UNDERWATER???!!! BRUH DID YOU THINK OR JUST DO COOKIEGOD??!!",
        "Your level 69 for exp",
        "You are the best builder ever in Minecraft",
        "When you said I’m building something with stone I thought it would be a statue of a cookie",
        "You could’ve used a conduit to make the coral building less painful",
        "You should make a ice farm",
        "On every video",
        "He Did Not Collect All The Fish There Are Like 2000",
        "Make a glass factory",
        "I BUY 100 UV YOUR MERCH!",
        "No sleep",
        "18:26 lmao bro sounded like a vindicator",
        "Thank you can you build a biggest aquarium full of infinity fit aquarium full of 20,0000000000 fish",
        "The amount of effort you put into one video is immaculate. I could never and that really shows how much you care and how much you do for the content for your fans.",
        "I like The village you made I ….sub you bro amm…. Are you happy now",
        "️️",
        "I love the city",
        "Wow this the first video I see it for you and this is awesome that’s cray bro",
        "Bro knows my childhood animal",
        "You  coped  farzy",
        "Did you just say Squidward now I’m going to do Squidward on the chair",
        "“horses eat carrots?! wait i thought they eat steak” Cookie 2022",
        "Love this ️‍️‍️‍",
        "look at his level 12:02 ",
        "Nah bro Said horses eat steak",
        "2:44 He say’s there are no trees in the ocean. I found an oak tree growing in the ocean.",
        "Wow the biggest ocean in the overworld"
    ],
    "comments_disabled": false
}