{"video_id": "kLwccC38F-M", "comments": ["please subscribe and drop a like if you want me to drop my first ever MERCH, CLOTHING, PLUSHIES! :D", "you can make any block into a masterpiece and they just get better and better ", "The determination of this man is astonishingly humongous", "I love how cookie is saying that he is really bad at building and says \"I'm spamming blocks\" like his favorite block, leaves, then just makes it look even better than it was before. I love the videos and the idea of the wall of leaves.", "The amount of effort you put into one video is immaculate. I could never and that really shows how much you care and how much you do for the content for your fans.", "Let's appreciate the time and effort he put in his mind blowing vids", "Jev and horror is such a good mix", "I find it amazing that every video, Cookie creates something AMAZING and throughout the whole process he keeps saying \"I have no idea what I'm doing right now,\" or \"I'm just spamming blocks!\" It's amazing to see how he can create things just on the fly like that.", "For the hidden city it would be cool if you put flowers and crops to make it look more alive. Maybe even some villagers", "It’s amazing to see someone build like that, can we just appreciate the time he put in this video to intertain us?", "Every time I build something amazing I see this dudes builds and it humbles me real quick XD, but also inspires me to get better at building", "Can we all take a moment to appreciate how hard he works", "Fun fact, prismarine has an animated texture, it turns from a greenish blue to a more blue color, of course very slowly.", "Let’s appreciate of how much time he takes to make these type of videos and never disspapoint us", "Imagine how long this build took and how much editing and his vids are still 10/10", "All the best for you bro! Behind a good video theres a massive effort! You have my respect ", "Hi @aCookieGod! So far I liked a lot of your builds. Keep it up and never give up!", "The dedication Cookie has is insane!!!\n\n\nEdit: Thanks for all the likes!!!!!! ", "Can we just appreciate that he did this all in SURVIVAL! ", "I cant belive that he had to even use his hardest work ever on this for our faces to turn into smiles", "This build took very long,and it is worth it because they end up amazing!", "I love how Cookie always says \"and this is where the fun begins\" when he knows it's the hardest part that ends up being the funniest. I'm new but I'm already loving your content and have inspired me to build more in my worlds!", "Let's just  appreciate how much work and time he puts in these videos to make our day, huge respect!! ", "The amounts of times he escaped death throughout this series is just unbelievable!!", "As soon as I first watched your videos I knew that you put a lot of effort into it", "You should add a conduit it will help you see and breath better underwater if you build it, it's range is 32-96 blocks", "The village you could have added like a tiny hotel underwater but it came out really amazing and cool", "Oh MAN, the feels of Kratos asking for Brok's blessing on the spear just made me well up with tears <3", "The city that you made looked amazing Cookie!", "This is amazing, I can’t wait to see what the whole world will look like once your finished with every structure you want to build.", "Dude his custom ocean Is way better than the normal one...like i am so impressed about how u have cover all the things which are in ocean in this circle", "There will never be enough appreciated for the actions that Cory  has taken. Such a good guy.", "How is this guy so patient like I could never", "Can we take a sec to see how much he does for us really he's done a lot", "Can we just appreciate he does this in survival made.? LEGEND!", "I love how both final contestants had changed their skins for camo. And techno revealing to Fundy how he was still a step ahead was great.", "He just earned another subscriber that video was great thank you for keeping us entertained", "This is the first video I’ve seen of his and I’m really not sure how he made it this far in hardcore  2 totems in the first 2 and a half minutes.", "\"The very first thing i want to do~\" made me laugh. but anyways I love all of his videos, it's also crazy on how much time this guy puts into his video. (Making the build itself, and how long it takes for him to even edit.)", "The fact that he builds all of these HUGE projects in hardcore is just absolutely wild ", "The city looks great ", "we would like a full part on one video sorry if it's to much but GREAT CONTENT you never disappoint us u are the best keep going ️", "Are we just not going to talk about the noise he made around the 3:22 point?\nAnd he really makes me laugh a lot when I have a bad day", "Your builds are so awesome keep up the good content", "Cookie spends a TON of time on these builds all to entertain us ", "The amount of dedication and time he spends to entertain us is insane! you never fail to amaze us, cookie!", "It's amazing to see how he can create things just on the fly like that.", "I LOVE HOW YOU DID THIS!! Except it might have took you about like 12 to 9 hours which would seem very painful for me", "For the \"explosion meteor\" you can put magma blocks, it's stays magmatic", "I don't know how you have enough determination to do this!", "this man has all the patience in the world", "we should really give an award to him seriously...he keep us enterianment while he is pain....good luck cookie we cookie armies are here to support u <3", "Nice vid, I would never be able to make a masterpiece like you", "Just want to say me and my 6 yo son Jin just started playing minecraft and he absolutely love your video, so much so have asked us subscribe to your channel and all his structure in his minecraft world has been decorated with leave block! \nEven my wife now is hooked on your video.", "I am not surprised at how much totems he used.", "Awesome content and a lot of amazing work it must take so long to make these vids! ", "Bro imagine how dope all his builds would look with shaders on", "for atlantis you should've used warped doors, the blue wood in the nether it would match the theme more of the \"ocean\"", "i love how these videos have no back story, its just. Hm, I want to see the ocean condensed into a cylinder. LETS DO IT!!!", "I absolutely love this series, and also your new subscriber here!!", "I like seeing kratos be more verbal with his emotions. Like hearing him say he loves his brother is something you thought you would never hear from him. :'(", "You could've placed hay bales under the campfires to extend the smoke by quite a few blocks in height! :D", "I like how he had most of the things in his house instead of his auto chest building", "This man holds the world record for most totems used in one video\nEdit:how y’all get this comment to so many likes", "This has to be one of the best coolest builds in minecraft history....", "Cookie never fails to entertain us. Keep up the good work cookie!", "You Make Great Vids Keep It Up I Love To See Those New Builds", "You can turn any block into a masterpiece and your video's just get better and better", "He actually disappointed me a little cause he forgot the fact that bone meal can spawn coral and all that stuff in water. Overall he did amazing! ", "Maybe in a future episode you could build a proper underwater city within this build like the one made by bestcube, that would be quite cool.", "You can use hay bale instead of signs. It will even extend the smoke from the campfire and there wont be any caps in the ground. Anyway amazing content as always! ", "the hidden city looks really cool keep up the great work!!", "Could have made the middle piller an underwater volcano by making it out of Blackstone and gravel and stone and a few others, then used the balck and grey glass with a full black core to make it look faded smokey. Then have coral all growing off the side", "I love watching your videos your builds are so awesome and takes u so much time to make", "7:02 no the axolotls are just healing, you can see regeneration particles around them.", "I have officially found my New favorite minecraft YouTuber since yogcast. This is insane. The time and effort you lay in this hardcore server. Discovered your channel today and watched some of your videos and Im stunned. If only I had 10% of your patience and creativity. Now I want to play minecraft again", "Add a conduit in the center of it so you get better underwater vision, speed and other things from it", "Respect for cookie he spent hours for this to be done", "Just imagine how hard this guy works for us to see in survival mode", "Sorry i was late but u took so long to build this we appreciate that so much we love ur hard work new subscriber", "Here’s a tip for campfires!  You can place blocks over it and the smoke will still go through! (I use it a lot in my kitchens) But I don’t know if you can put sand though. I’ll test it later!", "Okay first of all, this is amazing! But I suggest that you can add hay bales under the campfires to make the fire go higher. Also did anyone notice he has 69 HP", "Did you know you can bonemeal sand in water to make sea grass? That would’ve helped a lot when you placed the sea grass lol", "1:40 u don’t have to struggle with placing glass perfectly, just place a water bucket on the wal and start building right next to the water pillar… lol u didn’t have to take that much time.", "Keep the content up! Youre an literal Cookie god", "He has to have toke a long time to do this and give him a lot of support for how long he toke to do this", "It would be nice to get a conduit inside of the custom ocean, love your vids and ideas man!", "The fact that he is in survival is mindblowing ", "Let's just appreciate how much time and work he puts in these videos to make our day, huge respect!! ", "What he didn’t realise is that campfire smoke can travel though 1 block but if you also wanted the fire than I guess it’s fine", "you sir, will be one of my fav mcyts to heal my inner child throughout the years and so on", "Respect to this guy", "The fact that this god has unlimited totems and pop them all is insane, you're truly a god.", "The hidden city is so beautiful ️", "It would have been really cool to see you make like a mini amethyst cluster", "The hidden town is so cool even the “ocean” you made is cool", "Keep up the good work my guy", "Respect this man for editing the minecraft sounds to sync with the music ", "Loved this video! Just a suggestion, you should get a conduit to put in your ocean (it'll help with mobs, let you breath, and light it up for you). Also, you can use bone meal so you get tall grass, the movement would look beautiful! Thank you for all you do.", "22:40 i love that fact that the mobs knew its already the end for them lol"]}