{
    "video_id": "kn8ci8Hn0b8",
    "comments": [
        "",
        "Bro the game been out for 3 minutes",
        "How do you even have custom perks. I have them in multiplayer but not war zone.",
        "You can't edit perk packages",
        "COME ONNNN RETURN OF THE WARZONE GOAT",
        "Benny always the first!",
        "You can't make custom perks in warzone",
        "how do u edit ur perk packages",
        "Alot more recoil...What? Even ground loot beams like crazy",
        "Wtf happened to bennys hair",
        "Warzone settings video for ps5",
        "Anyone rocking the EBR? Lol am I the only one?!",
        "What’s the best underbarrel for the m4 if I don’t have the ftac ripper",
        "How do you switch ur perks around I can’t do it",
        "I don't know if this is a bug or not, but I can't edit my perk packages.",
        "How do we change perks? I’m only getting presets",
        "I cannot change my perks in warzone 2.0 anyone else???",
        "New video and new haircut",
        "thanks!",
        "U cant make Ur own perks for warzone setup..",
        "Getting 200kbs while downloading ",
        "\"AND PLS FOR THE LOVE OF GOD MAKE MINECARTS FASTERRRRR\"\nThat got me laughing so hard  =3:)",
        "What whack names they have for these guns",
        "You forgot to show tuning for the vx pineapple underbarrel on the lachman 556",
        "Imagine putting out a video with custom perks only to find out u cans customize them",
        "How do u change perks on this?",
        "Do you get all four of the perks right off the rip, or do they activate over time (stupid) like multiplayer?",
        "Bro the game been out for 3 minutes ",
        "Terrible builds lol  bruh played 2 games and like this meta",
        "You can’t change your perks ",
        "Anyone cant buy their guns from the shop? Mine all say they have no attachments and it purchases the default gun",
        "It won’t let me edit my perk packages on warzone",
        "Where has benny been??? trying to get my daily dose in, is he not live streaming anymore?",
        "Too bad these classes don’t work for warzone as u can’t create a perk package.",
        "I played 6 games I think and my first impressions are that the game is beautiful visually but feels more like Black out 2.0 than Warzone 2.0",
        "in the us streams it looked like you can't do your own perks. but nice weapon overview :)",
        "How do I customize my perk packages. They only giving me the default ones",
        "This guy made this video before the game actually dropped, cause you can’t have custom perks lol",
        "How do you change perks? :) I can only use default",
        "Here is another Lachman 556 \n\nRapp barrel \nEcholess 80 muzzle ",
        "TV Wrecker grip is better but ok",
        "Put stamp marks on kmt",
        "SSundee never fails to make us happy",
        "Love that focus trick on the assault rifles!!",
        "Cant edit perks no more. You have to take a preset.",
        "Game is ️ and broken",
        "0:26 Rpk and LACHMANN sub\n4:28 TAQ56 and vaznev-9k\n6:25 M4 and minibak\n8:25 LACHMANN 556 AND FENNEC 45",
        "Sadly perks cannot currently be customised in Warzone 2 which was different to what we experienced playing in the past. All gun class setups are still top tier.",
        "how are you customising your perks??",
        "All these types of video games are for those with plenty of slack time on their hands. Plenty of money to buy the cool tools and a willingness for addiction. If you don't exhibit these traits your wasting your time and money. Not everyone has this privilege.",
        "You didn’t mention tuning on the schlager 3.4x …?",
        "Great video now we just have to get the chance to play it with friends and without massive lags",
        "FFS People understand that if your watching this. You CAN'T change your perks for Warzone 2, the gun combination will only work if you have Weapon Specialist. Even then this video I'm sorry needs to be updated correctly.",
        "What does it matter can’t even buy a load out ",
        "Who cares about best loadout a when there are so many broken things wrong with warzone 2? And I’m talking about basic navigation stuff and not gameplay issues which there are plenty of those as well",
        "Loadout 1 0:29\nLoadout 2 4:28\nLoadout 3 6:25\nLoadout 4 8:24",
        "ADS is so high in most of those weapons, even SMGs…",
        "We're back finally",
        "You can't change perks I'm confused how you did that in loudout 2",
        "How did u edit ur perks",
        "Why can’t we make custom perk packages for warzone?",
        "WE CAN'T CUSTOM PERKS!!!!!!",
        "Akimbo snake shot is the best indoor gun in the game and should be on every loadout",
        "I can’t change my perk load out I’m on Xbox does anyone know why",
        "Loadout trash meta fest br",
        "Get in Benny!",
        "Game is very disappointing",
        "You didn't show what the tuning is on the Fennec's ammo .45 auto armor piercing!",
        "4am in a chicken and chip shop never heard a story that starts like this with a happy ending  =(",
        "You can’t change your perk package…?",
        "Idk about anybody else but i cant edit my perk packages, there are only preset perk packages",
        "you cant choose your own perks in warzone lol",
        "How are you changing you’re perks",
        "Good to have you back ",
        "Let’s go!",
        "Wooowww new haircut benny!!",
        "First?",
        "Hey, for our convenience, can you please show for some time (like 5 second) full weapon load out so we can screenshot it for future use please? Thank you",
        "Do you have all gun mods available in game if you don’t own MW2 or are they unavailable like they where in Warzone 1 with vanguard",
        "You cant use ur own perks:(",
        "Harr-binge-er *",
        "you cant edit perks :|",
        "They need to fix footsteps asap literally non existent",
        "Too bad you can’t customize your perk packages. Lol",
        "It's literally been 4 hours",
        "Don't use armor piercing rounds even tuning doesn't do anything check exclusive ace video, the only one you wanna use is high velocity",
        "How do I unlock loudouts",
        "Anyone else have the problem where you can’t change your perks?",
        "Why is it not letting me choose custom perks. I have to use preset perks in warzone 2",
        "Why can’t I customize my perk packages?",
        "I thought the game was very bad last night. Slow to get in. Kept getting kicked. When I did get in the games where long and i spent most of time looting. And overall didn’t find it enjoyable",
        "Be nice to get into a game and join my pals",
        "I haven’t seen a sniper 1 tap anyone in the head yet on someone whose had a 3 plate vest.",
        "Bro chillgame has been out for 1 min",
        "Still blocking attachments for screen shots. Not everybody watches this on pc benny, some of us has real jobs and watch these on the go",
        "How on earth do you make custom perk packages???",
        "Such bullshit that I can’t change my perks",
        "RPK - MP5 0:29\nScar-L - PP-19 Vityaz 4:28\nM4A1 - PP-19 Bizon 6:25\nGrau 5.56 - Vector 8:24",
        "Wont even met me switch my perks",
        "Comments: speaking fax\nCam man: THE COMMENTS FLAMED MEEE!",
        "bro its litarly been like 5 hours lmfao",
        "armor piercing rounds does virtually nothing. TheXclusiveAce tested it",
        "canr even edit the perks",
        "are those custom perks man?",
        "I cant adjust my perk packages?",
        "Just downloded the game but custom loadout is Locked. Can’t edit classes, Anyone know why ?",
        "Is it just me or has he not realised you can’t custom make ur own perks on warzone , only in multiplayer.",
        "RPK - MP5 0:29\ntaq 56 - vaznev 9k 4:28\nM4 - minibak 6:25\nlachmann 556 - fennec 8:24",
        "Literally got MW2 last weekend, this is gonna be a good guide so I know what to level up fast!",
        "Sleeping on FSS Hurricane. Trust me, thing MELTS",
        "You gotta add the ak, picked it from ground loot and shredded 15 people with it, laser beam",
        "What is flint",
        "\"Im looking forward to Marty's apology video.\" Is what I would say if I didn't believe Marty was a self absorbed sociopath. \nGood on you Mick for coming forth with this.",
        "Benny comming in clutch rn",
        "Really shows this guy never played a single game of WZ 2 \n\nAlso, are you serious with this TAQ loadout? Going for range setup with a recoil thats absolute shit, wtf ",
        "How do you edit your perks? I can’t seem to do it",
        "Kinda split on how you unlock attachments in this game",
        "When ever I try to tune on ps5 it just goes all over the place",
        "You should definitely be using high velocity rounds on long range setups, it increases your bullet velocity by 45-50%. No way the suppressor is going to do that much, even with tuning.",
        "Lmao ",
        "These builds are bad",
        "Gotta try the raal it’s crazy",
        "Do you show up on the map when you don't use a suppressor I'm warzone?",
        "I cant choose my own perkloadout some else too?",
        "Gg",
        "Guys heads up you can’t have custom perks for warzone it is disabled",
        "How do you get custom perks? I can only get the preset ones.",
        "Why do u have the option to edit the perks but I dont",
        "How are you tuning it doesn't let me",
        "You can't customize your perks...",
        "How can he select his own perks? Is that available later on as you level up or what?",
        "Im here to tell yall not to tune anything for recoil smoothness. Recoil smoothness as a stat seemingly does nothing, or the effect is so small that it's completely negligible,",
        "this PC or ekbok? Anyone have a best loadout for PC? since we don't have auto-aim?",
        "How do you edit perks on ps5?",
        "I would love to see a full episode on just the side missions. It would still feel like a actual episode with the way Cory plays it",
        "Bro I’m telling you, the x13 auto with 33 round mags, 9mm overpressured +p ammo, xrk sidewinder-6 slide barrel, Cronen mini pro optic, then either the cn30 suppressor, or the cronen Lima-6 rear grip, it’s better then most of the smgs dead ass",
        "Second",
        "I'm still in school",
        "Love the fact that it lets ithers tune guns but not me",
        "But no gameplay backing the loadouts. ",
        "why icant edit my perk package ?",
        "How do you change your perk package o can’t do mine",
        "anyone else not able to customize perk packages? I can only use preset packages",
        "You cant change the perks in wz2",
        "You can’t change your perks"
    ],
    "comments_disabled": false
}