{
    "video_id": "KWterDbJKjY",
    "comments": [
        "Absolutely brilliant!",
        "Dontai coming In clutch when Im bored scrolling through YouTube",
        "It’s more okay to give some blame of someone from their ancestor’s actions when that person is still profiting from those crimes.",
        "Personally, my favorite reaction to the death of The Queen came from a tiktok video. A girl walks in to wake up her sister, telling her something really bad happened while she was napping... The Queen died. Sister just waking up takes a few seconds to process, gets a shocked sad look on her face and whispers, \"Dolly?\" But no, it was the actual Queen of England, and the relief was palpable. Dolly Parton is a queen though. She got that right!",
        "1:30",
        "Considering the history (long ago and more recent), I feel like Ireland and Scotland were more than justified in their impolite singing. I also hereby grant permission for \"Lizzie's in a box\" to be said and/or sung at my funeral. :D",
        "Excellent video as always. John and team, I would like to add that I find it really surprising in your coverage of the monarchy and the other videos you have done surrounding the problems they perpetuate, Pakistan and the partition of the subcontinent in 1947 have not come up even once. When talking about the atrocities of the monarchy, I find it really lacking that their colonial rule of 400 years which devastated us completely and continues to fuck us over, is not really talked about. As a viewer from Pakistan, I would really appreciate it if one day you could talk about all these things and the ways in which British rule continues to impact us.",
        "Americans Ohh you British are so stuck in your past having a monarch as head of state\n\n*British Person \"January 6\"",
        "John Oliver, thank you for spending 30 minutes unpacking some of the most important details of human history.  I majored in history in college, and one of the biggest takeaways I had (besides realizing I should have majored in Engineering), is that the fate of our species depends largely upon whether we decide to just give up the war and finally get along.  Tribal warfare was cute when there wasn't the planet's health or our ability to live without fear of a hurricane wrecking the neighborhood to worry about.  If folks can hold these 2 thoughts, 1) We can sincerely mourn the loss of Queen Elizabeth, and 2) We need to acknowledge her legacy – with all its flaws – and seriously examine whether the Monarch itself is relevant today, then I think we are still moving forward as a people.",
        "Look John, was there ever a strange guy in an old pub of the aristocracy standing nex to you and very strangely knocking out a young lords friends, but not the young big mouth himself?\nThere are different kinds of aristocrats. Some are nobleman, some are lords, some are knights. Nobleman come as lords or knights and act noble as diplomats or in arms. Lords are businessman with priveliges based on their families blood lines good deads for the commons. And knight fight war using violance. Of those some are from the nobility and others are from deep in the woods having pig and fishfarms using an axe over a sword historically because that tool wont rise suspicion when they taking out a Sheriff of Nottingham. The latter is never a prince and like the knight in the movie Iron Clad.",
        "A bit of a shame noone on the show fact checked Lidia Thrope. Her record recently, especially with indigenous elders is really horrible",
        "If only you added Julius Malema's speech on the death of the Queen. He too did not see the necessity to mourn her death.",
        "I think it’ll be a lot easier to have this conversation now that the queen has passed. I don’t think the average person likes Charles… including me to be honest. So it’s easier to be critical of them and call them out for the darker side of the symbol they represent.",
        "Yeah, nah, if anyone wants a neutral explanation, go see the video \"The True Cost of the Royal Family\" from CGP Grey. That will tell what you need to know about the financial part.\n\nWhen it comes to slavery, colonization, I guess it comes down to a personal perception. I am not one for considering people guilty for what their ancestors did two or three centuries ago. And for the recent cases, it is also not reasonable to blame someone who isn't even part of the government for any and whatever atrocities said government has comited. Would you blame Obama for the tortures in Guantanamo? Maybe to some extent. But I don't suppose if he died tomorrow people would cheer that the responsible for the tortures had died. And he WAS actually the head of government, unlike the queen. Seems kind of in poor taste to me.",
        "Well.... America didn't give up and close the Indian boarding schools until 1978, the Indian Welfare Act gave families a choice to send their children or not. However, not every school closed until 1996. You read that right, 1996...  Even today there are residential Indian schools but their mission is vastly different than it was. The UK closing Indian schools in the 1960s was more progressive than the US. With that said, thank you John for bringing all this to light.",
        "13:48   Nope.\nLook, monarchies are silly and all that, but there is no direct ancestry line from King Jimbo 2 to the current royal family of Engelland.\nWhen Queenie Annie croaked in 1707 the direct line ended.",
        "That officer.\n\nIt is one thing to deny your past atrocities.",
        "Just return our Kohinoor and stolen statues of Gods these people keep in their museums as exotic art",
        "wait was that a child I saw jumping with q fingers in the air? I mean its something I do but aimed towards the opposing team but this is wild. God bless you Ireland and Scotland  ",
        "Can we take a moment to appreciate how much time and effort he puts in the videos for us",
        "that money should go to the descendants of the slaves",
        "Thank you for presenting this important information",
        "King Charles reacting to this segment with a loooooooong pause before walking off saying, \"I hope we weren’t too bad.\"\n\nAnd the whole concept of chanting \"Lizzie's in a box.\" is the most amazingly factually correct thing of 2022. ",
        "Great educational and entertaining content as Always",
        "Now I understand Why they scream \" long live the King and Queen\"! They the people feel they will be killed as in the past ",
        "Why didn't all these people raise these issues when the queen was still alive? Raise the issues to her directly when she was in them parade like events?",
        "Excalibur Air Fresheners\n\nFirstly, if someone is using King Arthur you can bet something sinister is going on.  Though Arthurian Legends paint positivity onto the Middle Ages their reality was quite different.  King Arthur and the Knights of the Round Table was completely fictional and written as a political tool for the Ages to overcome disorder and conflict.  People often use Merlin, Arthur, Mordred, Lancelot, Gawain, Guinevere, and Excalibur as a tool for painting nobility and honor onto an otherwise dark regime or situation.  The truth is that due to common pragmatic realities one cannot maintain an aesthetic that grand, and it has been used either as a means of eliminating that dream or as hiding a more sinister plot.  Arthurian Legends, thus, become more like an elitist air freshener in a dirty car more than a noble aesthetic.",
        "what about the oompa loompas???",
        "“I spent 3 or 4 days studying this shit”\n\nMy man has transcended",
        "thank you John for spreading this information to people who may not know about it. these atrocities need to be known worldwide.",
        "Hope Thailand will have a serious (and sacasmic) conversation like this in public without fear of Les Majestr real real soon",
        "As a proud Irish man, shitting on the crown is just how I want my Monday morning to go. Eire Abú 🇮🇪",
        "The appendix is actually necessary. It helps maintain a healthy gut microbiome and is involved with the immune system.",
        "\"whose face answers the question: what if two cousins had a kid?\"\n\ngoing for the jugular, damn",
        "Look, in many republics around the world president has the same role as British monarch. They are only here for ceremonial purpose. Best examples are Germany, Croatia, Austria, Italy, etc.",
        "What a relief to watch an episode where I'm not left in despair about the state of the USA. This one is a freebie! 🇺🇲🇺🇲🇺🇲",
        "John Oliver talking about England will always be the greatest thing ever ",
        "So glad we are able to talk about all these things on the mainstream!\nDO IT Q!!!!!",
        "Tbh coryx is carrying my 2022, everytime i finish all my chores, i wait for you to post every time. You're my weekly boost ngl. Everytime i see you upload, i literally get hyped up while im playing games. I sadly cant donate anything but i would wish to. These uploads arent just \"videos\" they're literally a way to keep someone going. Thank you cory.",
        "Nearly choked when that Australian reporter said that colonialism was for the good ",
        "That's the best show yet",
        "Did you colourize Churchill?!?  Oh, dear!",
        "🇰🇪 🇰🇪 That's a moment of truth. Voice for the \"Voiceless\" common Kenyan. Well done John Oliver.",
        "I’m an American Citizen. I was born in the USA and intend to live the rest of my life in the USA. I say this because where I’m from gives me a completely different view and it keeps me from understanding or appreciating any monarchy. Due to my upbringing I just don’t understand why there’s still this system in the UK. I don’t understand the belief that it’s ok to pamper individuals for no other reason than they were lucky enough to be born to a particular person. ",
        "jailanwala bagh massacare? where was thar mr hypocrite anti indian mr oliver?",
        "Thank you for this video. I am British and whilst sad fir her family when Lizzie died. Really did not care.\n\nThe mass hysteria and fake sentimentality pushed by givt and media was sickening.",
        "A lot of the comments showing that the British Empire caused generational trauma....",
        "no eggs?  try tomatoes )",
        "King  Charles needs to step down\nAnd have his wife .....you remember the reason the people princess had\nTo die. We miss you PRINCESS DIANE  ....... IN",
        "I'm surprised a half an hour long episode about colonialisation did not even mention India once.",
        "Yay glad to hear that you feel the same way I do about the leaches, and also, hate the way they feel those red dressed soldier should stand up for hours and have themselves soil themselves for the crowns selfishness",
        "I have quite a few friends who were born and raised in Canada and when the Queen died they were full of jubilation and joy because it means they got a few days off from school and if thats not a ringing endorsement of the monarchy I dont know what is",
        "A performative monarchy might actually be worse that a real one. At least a real one can be held accountable.",
        "May this show never get cancelled! If so im going to make trumps insurrection look like a tuesday at chuckie cheese.",
        "Couldn't agree more.",
        "I live in Denmark. I just don’t understand, why people like to pay a huge amount of money to royals.",
        "ISHOWSUCK, this stream changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience",
        "This is why I advocate for an all corgi monarchy",
        "Taking the peasants money would’ve been a terrific answer",
        "Did John Oliver mention; the 1953 Coo in Iran? The joint cooperation with both America's C.I.A and Britains M1-5 or 6 (hard too keep up), which undermined their fledgling Democracy.\n\nWhich is one of the contributions for why Iran is so Messed Up (no other word I could use), where they are now, 2022 and soon into 2023.",
        "British stole 45 Trillion dollars and starved millions to death in India.\n\nThey should at least return Kohinoor diamond back to India.",
        "thank you, in Egypt we also sufferd due to the british colonization",
        " TV",
        "we irish did not do this, it was some pricks at a football match in scotland",
        "They don't need the govt money",
        "In Europe eggs aren’t in the refrigerated isles",
        "Thank You and your team for making such a priceless and valuable show!! Enjoyed every bit of it!",
        "The laughter in the background is odd...this isn't funny.",
        "Hearing John talk about the violence of Britain during colonialism, especially the atrocities committed in Kenya, was an unexpected and powerful surprise. As someone who's family was deeply affected, thank you for shedding a light on those events.",
        "The officer's that would take a bullet for Elizabeth, simply dodge eggs coming at Charles. Lol.",
        "Thanks John O. finally someone who will tell the Truth /-:",
        "Hi mr. John Oliver. On the season 8 episode 3 concerning police raids you mentioned a time where on a raid a policeman threw a flash bang grenade into a crib.\nNow i am writing this from Iran, where police have been using war guns and shooting innocent students anf protesters brutally and aiming their chest, neck and head. There are cases of under 15 year olds beaten to death bt batons. Right now there is a war-like fight happening in Mahabad where people are defending their lives with rocks and getting killed by non-stoping firing guns. Spread the crime and do what you can to help us. We need every help to overthrow this religious  totalitarian regime.",
        "is this supposed to be funny ??",
        "18:07 only John Oliver can so accurately mock a british accent while being british himself",
        "67% support the monarchy after a popular Queen has died. Once that effect wears off that will certainly decrease by several percentage points. Likewise as this decade develops and the actions of some of the royal household come to futher light that could plumment below the 50% margin where a popular vote could disolve the monarchy.",
        "These courses are getting progressively better and better with each wave. It's awesome to see Nintendo taking people's feedback into account.",
        "John Oliver looks so much like Prince Charles when he was younger.",
        "As someone who has Grenadian family- we don't like the monarchy. At all.",
        "It was amazing to see people after the Queen died saying things like “stop talking about colonialism, we are mourning and i felt like i was her grandson” while also taking every occasion to harass Meghan Markle who is… actually married to her grandson",
        "Emotionally unavailable guacamole",
        "The best part that he didn’t even mention is that years before this aired, he turned down an honorary order from the queen because he didn’t want to be associated with the empire.",
        "You can even draw a pretty clear line between the english monarchy and the fact there are nearly 400 million guns in the USA.",
        "Royal family is the UK-Kardashian, but worse lol",
        "how are you grouping their income in with what people payt o them. they are sperate incomes lmfao. one doesent affect the other.",
        "This was a masterpiece made all the better by who delivered it.",
        "67% of the British people want to have a monarch, but, as an American, I don't want one.  I was very annoyed at all the prime time Queen Elizabeth's funeral took up on the TV.",
        "The residential schools run by the Church of England may have closed in the 60s but the rest of those schools didnt close until 1996. I don't believe for a second that Lizzie didn't know. Also, the Metis were classified as non-human under federal law until 2016.",
        "John's commentary is amazing",
        "The British royal family through no personal fault of their own are from the Hanovarian royal line which is principally German. Because of the atrocities caused by the Nazi regime in WW2 they had to distance themselves from their origins by not only changing their surname to Windsor but to go out in public and be more visible to ordinary people and to show they cared about their ordinary subjects. This worked as a stabilizing factor to bring the citizens of Great Britain together under one flag and give the people a unified sense of identity.  However being so public enabled the media which is always negative to put their lives under the microscope and this in turn disabled both the Monarchy and the royal family to live a decent sheltered life. The long term effect of this has put such a strain on these individuals who are essentially human beings that it has been very destructive to both their personal lives and their reputation. ",
        "As I recall history, the Charles'/James' Stuart dynasty was replaced by the Dutch van Nassau dynasty, which in turn was replaced by the German \"Brunswick\" (Braunschweig) dynasty. The ancestry lines of English royalty are neither very straight nor very English. Seems to me some international aristocrats found out that England was a very profitable host.",
        "After the transgender episode I have a completely different opinion on mr Oliver. Pro blockers?! Because puberty is reversible?! Even if you are not a scientist you can grasp the concept and use your philosophical capacities to conclude that it is at least danger territory to use those procedures in this reckless manner. But hey, maybe if you scream your opinion and address everything as a fu***ing joke it becomes ok right?",
        "I’ve never seen ppl so out of touch of reality. It’s truly sad bc given the amount of stolen wealth they sit on/ they could do some good. Turn half of Buckingham Palace into a homeless shelter/clinic. It wouldn’t even put a noticeable dent in their wealth. I just don’t get it. I couldn’t have that much money n not do Something humanitarian w it. They prob can’t even define the word charity.",
        "\"DID YOU ORDER THE CODE RED??!!!??\" .... Col. Jessup responds with a 23 second pause. Lol",
        "Residential schools didn't seize to exist in 1969...they continued on till 1996. Pretty damn horrific!",
        "My grandfather was a detainee in one of the detention camps during the Mau Mau emergency in Kenya. For five years he endured harsh interrogations (beatings, hours in stress position, starvation, forced labor) until he was able to convincingly renounce an oath he had never taken in the first place. When he left the camp, he found two of his children had died and my grandmother and the rest of his children on the point of starvation from being forcibly housed in a concentration village (yes concentration as in WW2 concentration camps) with no access to food. Thank you JO for bringing this atrocity to light. Anyone seeking more information read Imperial Reckoning by Caroline Elkins",
        "The interview with the torture guy is priceless. Apparently, for him, torturing is acceptable but just lying about it -- no, that's too far. He can't do that.",
        "It’s been a couple days, I just wanna know if this aired on sky TV",
        "This show was good. Now it's just pretentious",
        "Now imagine the genuine world wide mourning that will happen when the true British icon, Sir David Attenborough passes away. That will be a dark day indeed.\nI was sadder about the actor of Hagrid (Robbie Coltrane) passing away. He brought true happy moments to his audiences.",
        "John's videos are basically Ted Talks. He's incredible.",
        "Absolutely brilliant",
        "SPOILER ALERT: https://youtu.be/uGd7fpdM3G8",
        "I was in scotland the evening it was going around that she died and some guy opened the pub door and just shouted \"the queen died\" into the whole pub and everyone started to have this ambivalence reaction of happy, but also somehow sad. Was funny",
        "Incredible, as always. Not many people can be so informative and so entertaining at the same time",
        "True funniness doesn't need that canned laughter.",
        "My understanding of it is like he said they have \"no power\", yet should they publicly apologies/acknowledge Britain's past and crimes then the British people have to pay with their taxes. Friday Fact so it's not up to the Monarchy but up to the British society and government to decide to apologies because their the actual people to foot the bill. The monarchy are extremely well paid actors and have no right or power, so \"mummies\" the word.",
        "My mum was just telling me that her parents and all their children were forced to live in specific villages/camps where they could be monitored by the white oppressors so what J.O says is completely true thank you",
        "This video is gonna be so British, I’m worried it’s gonna colonize my apartment for spices",
        "Insightful, well argumented and humorous talk on an important topic - honestly supreme quality content.",
        "I wonder what Oliver would be saying if he discovered that his ancestors were part of the slave trade and whatever wealth they accumulated was by that institution. I am sure he would be condemning them, but maintaining his own innocence because he didn't do it. I used to enjoy Oliver, but in recent years he has taken a leap off the deep end and lost his mind.",
        "No John tell us how you really feel",
        "In one breath he says the monarchy is ceremonial only and in the next he goes on to blame it for all of the atrocities of the democratically elected British and colonial governments through the ages.",
        "And that is without considering what the Brits did to the Irish for 800 years.",
        "For all you Sky viewers at home you can press your little red button.",
        "It sounds like you're asking the monarchy to go on a much overdue apology tour. I don't think that is a bad idea, but I do wonder if the very same people who are pro-monarchy would agree.",
        "My understanding is that the duchy of Lancaster provides all profits too the state. (Source: Memory of a old CPG grey video on the monarchy)",
        "Also as a Kenyan, I hope to see Kenya (and ALL East African countries) EXITING THE COMMON WEALTH in my life time!",
        "I sure did enjoy watching this 25 minute loop of Winston Churchill going backwards down a waterslide!  Anyone else??",
        "You need more taste.",
        "I think it's fair to say that we've all been waiting to see the Jon Oliver Roast of The Monarchy ",
        "100%agree now do a segment on Sri Lanka and the Rajapakshas  looting the country",
        "Mickey and Minnie at Disneyland is such a perfect analogy for the Monarchy",
        "7:20 Plus the money from the lands that the monarchy owns and let's the state use for a lot less than they get out of it. There the state makes a lot of money off the monarchy",
        "Canada before re-patration of our Constitution was not clean in no way. I think Canadains have a lot fo make up for to the First Nations People. Quebec who has never signed the constitution has a lot more to make up for in my opinion. Its time they sign the consitution or leave Canada all togther.",
        "2:28 that crows shadow over africa truly shows how they are still ruling us to this day and yes we celebrated we didn’t cry",
        "Fun fact John\n\nThe name 'Mau Mau' is not actually in the kikuyu language but actually just a phrase conjured up by the colonialist at the time from what they used to hear kikuyu  people chant to them. The phrase/word that they would chant repeatedly was 'Uma'  which translates to 'Get out' as a way of telling the British to go away from their lands. The word being said over and over, 'uma uma'  was heard by the British as Mau Mau and thus the name was born.",
        "Sometimes is hard to take UK people seriously, specially after learning they stamped their names on thousands of people. Interestingly enough, most of the true talents aren't actually from England but rather its colonies.",
        "This needs to be highlighted more and more. There is  a whole generation and a part of the world unaware about the atrocities Monarchy committed. We are always told the Monarchy did so much good too even by the rest of Europeans. There are so many stories to cover.",
        "The more I hear the criticism s of Charles the more I like him...",
        "Thank you for bringing that clip of Churchill to my awareness holy shit.",
        "Royalty belong in history books.",
        "This episode was unavailable In Canada, Britain, and Ireland. I had to use my VPN to get around it. Shame on you HBO and Shame on you British and Canadian governments.",
        "I said it years ago, and I'll say it again: I hope I live to see the last British Monarch resign/retire. I wish my cousins across the pond freedom. (I am American.)",
        "The guy who threw eggs at king charles is rlly hot lol",
        "theres a picture or video, cant be sure, where the queen was in some african country and feeding children in the yard like chickens, throwing food in the dirt. one child in fact went close to her and tried to get some food placed in his open hands, and was entirely ignored by the queen who threw the piece of food further away from her on the dirt ground.",
        "\"A lot of people would like what we have\": a queen? no, thanks, that \"privilege\" you can keep to yourselves.",
        "The day it will be abolished will be a day of celebration",
        "Is \"ancestors\" quite the right word?",
        "You can't be proud of your present, unless you recognize your past.\nWe have a king in the Netherlands and his family was as bad, if not worse. Since after the treaty, the Netherlands still traded slaves. \nWe pay him a mere  € 7.257.600,95 annually. A true bargain.",
        "I enjoy the pageantry but, as a Canadian, I don't know that we can have full reconciliation with our aboriginal populations while the Monarch is still our head of state. By the way, \"school\" is a gross exaggeration when speaking of Canadian residential schools. The children were tortured and several mass graves have been uncovered with hundreds of children in them.",
        "How come John Oliver still doesn’t cover the topic of Russian-Ukrainian war??",
        "My grandmother was from Belfast, I was over there a few times before the peace, and some after, I've heard the stories from family members, friends, etc beyond what little I saw as a kid. 'Lizzie's in a Box' is very much the nice version cause box isn't the only word some of them would change.",
        "Describing the British royals as mascots is the best description for figurehead monarchies I have ever heard",
        "I have a hypothesis that a real reason to keep a royal family - not only in england - has something to do with some historical legal arrangements that are still in force. probably ownership of some territories would be questionable or completely void without a royal family ... or something like this. and it would be probably very expensive and risky to try to dismantle these contracts ... but maybe i am being too technical and it all is really only one expensive show",
        "As an American, I'm naturally anti-monarchy. I don't understand why so many of my fellow countrymen find the institution so charming.",
        "When the price for energy food, commodities and other goods and services rise the entire economy is affected.Rising price known as inflation",
        "I just had a layover in London, and … surprise, this segment was NOWHERE to be found!",
        "Thank you, John Oliver and everyone at The Last Week Tonight show for an entertaining and educational video.",
        "I really wish they would bring back elective monarchies but just do them in colonies.",
        "Not being allowed 500 meters of the king and no eggs allowed in public spaces might result in this guy becoming an innovator who tracks the movement of British royals via satellite and social media and catapults eggs on an intercepting trajectory via a  vacuum-action contraption.",
        "It is a sad story. This piece deserves an Award.",
        "\"The people who grinned themselves to death, smiled so much they failed to take a breath, and even when their kids were starving they all thought the queen was charming\"",
        "This was PERFECTION!",
        "Charles fingers are soo gross.",
        "He's right on!",
        "I was playing D&D the night the queen died, and pretty much at the exact moment she officially passed, my party slayed a giant hog. Coincidence?",
        "\"Why they and everyone else are working so hard not to offend a family whose name was branded into people's skin and who sit atop a pile of stolen wealth wearing crowns adorned with other countries treasures\", worth repeating",
        "I should clarify: my comment concerns when Charles said, “Dig that crazy rhythm!” If you listen carefully, he is imitating Peter Seller’s famous line in ‘The Goon Show’. Charles was a big fan of the radio show and even did one of their skits at his school or some such place. John, as a comedian you must know this! And if you do, shame on you for pretending it  was Charles being an appalling twit.",
        "the monarchy seems to be blamed for everything, even though they were not in power for many of their supposed crimes.",
        "Stopped watching in the middle. You can't just judge today's monarchy or whatever state or country due to his decades or centuries mistakes. History is what it is and should be built better in a more civilized way every time. Even our century we will look like a bunch of medieval guys to the humanity in 200/300 years for now... so why to bring slavery from the 1700's to this topic?",
        "I read years ago that what the government pays them is vastly minor compared to what they bring in. Those collector plates add up.",
        "Mighty Odd that we Havent had Financial Beliefs But 2700 years whereas the Oldest Coin was Only Created around 600 BC and One Further back at 700 years , funny how we have fell so far so fast",
        "Our shame is we still haven't found all the bodies of the children. The genetic memory of the indigenous people is destroyed.",
        "Having an existing monarchy in this day and age. A constitutional monarchy at that. Isn't \"special or unique\", dear British lady. Japan has a constitutional monarchy. Malaysia has a constitutional monarchy. Thailand has a constitutional monarchy. Bhutan, Belgium, Denmark, Sweden, Norway, etc. Absolute monarchs still exists in places like Brunei, Qatar, Saudi Arabia, etc.",
        "“I’m looking at you with certain thoughts in my mind”\nI’m willing to bet those thoughts were about how much he wanted to put a boot on that interviewer’s neck.",
        "Ok. I admit I didn't know about a LOT of this stuff.",
        "Celtic FC I love you.",
        "I love this.",
        "I use to watch you all the time, but now your episodes are so condescending and your one sided/biased reporting is so dull lol.",
        "GJ JO yet another brilliant piece of journalism. Coming from a man that's a monocle and umbrella shy of being a Batman villain, that's pretty good in my book. RIP Kevin Conroy",
        "We need a part two. Plenty more atrocities to speak about, especially from the Indian subcontinent.",
        "If I were that man that got arrested for throwing eggs I would have shouted: \"Ah, Now we see the violence inherent in the system. Help! Help! I'm being repressed!\"",
        "At the very least, they should stop paying money from the Sovereign Fund. I'm pretty sure they can get by on the rest.",
        "Yep 17th century facts will help John   Typical",
        "Are we sure Big voted for Trump?  Was that mentioned in the show?",
        "Thanks for covering this.",
        "John Oliver took a subject I don't give a fuck about it and made it relevant and interesting",
        "'(The loan that Britain took out) went (not to former enslaved people) but to the enslavers, who wanted compensation for their loss of income from their 'properties'. \nbtw Not much difference there with Dutch (plantation) slavery and colonialsim.",
        "Did the segment air on Sky TV?",
        "Royal family costs less than a season of Netflix’s The Crown. ️ It’s just good entertainment mate.",
        "No one cares about Charles",
        "I was waiting for this segment since Lizzie's in a box, and John Oliver delivered. The extra touch of sending a loop of Churchill sliding backwards on Benny Hill's music to Sky TV if the UK doesn't want to broadcast it is the cherry on the pudding.",
        "The role of the monarchy has been in place relatively in 1215 AD. So....",
        "Thank you for highlighting the atrocities that the British government carried out in \"her majesty's name\" in my home country of Kenya 🇰🇪",
        "No gods, no masters.",
        "As a Grandson of a MauMau fighter, I must say, the few Colonizers and African collaborators who landed in the hands of MauMau sent Shockwaves to the British because of what happened to them.  ",
        "My understanding is the monarch still has Veto power over parliament.  Queen Elizabeth never used the power, but she did have it.",
        "Finally, the most British man reacts to the most British institution.",
        "This was absolutely  brilliant  John!",
        "”Lizzie’s in a box” \nNever change Scotland.",
        "The Anglican Church of Canada is a completely separate institution from the Church of England, and has been since 1893.",
        "CANADIAN here, \"Liz\"  was Beloved, The Monarchy is/was not. She is viewed as a Woman with strength and flaws",
        "Loved the episode. I also wanted to ask you to please do a bit of coverage of what is happening in Iran.. Children and teens are being murdered here and we need every help we could get",
        "Rubbish programme",
        "King Charles has to be the biggest geek on the planet!",
        "So they can make a ridiculous law for one guy? The United Kingdom is so weird. Its funny weird.\nGo look at the Royal Cypher I made my puppy! Isn't it cute?! It has a hidden dog in it!",
        "Irish Twitter. That’s what I was watching during the Queen’s mourning period. Irish Twitter and Black Twitter.",
        "All we want is reparations. Give us back our stuff.",
        "Whilst I find this segment hilarious, I want to disagree with him on a few key points.  First of all, conquering = dominion.  This has been true ever since we had more than 2 people on the earth.  Secondly, look at the bad that colonialism did, and look at the good.  Do you like heated floors (Asia)?  Gasoline (Middle East)?  Gemstones (Africa, South America, and Asia)?  Eating with a fork (Middle East)?  International medicine (every country England conquered)?  International education?  How many lives have those saved?  Is colonialism right?  Hell no!  It had a lot of benefits on the international stage though.  Finally, should we judge the living by the acts of their dead ancestors.  Look at QE2.  She is the monarch who gave their freedom back to those countries.  Few other monarchs in history have ever done that.  Could she have done more?  Maybe, but she did more than any of her ancestors have ever done.  We have a long way to go to make up for the horrors of colonialism, but do we look at the descendants of the French, Italian, Chinese or Japanese monarchies (current Japanese emperors) and ask them to pay for their ancestors' colonial pasts?  Some of those committed atrocities worse than England.",
        "Thank GOD I wasn't born under the British!",
        "Best day of my life when I found that AMZ11VR is making these moves into the mainstream. Celebrate this, guys I mean seriously!",
        "What about all the  western European countries have owned colonies all over the world ?\nWho's talking about this ?\nNot only Queen, not just UK but",
        "As a Brit who moved to the US, i'm so glad i was not living back home when the Queen died! I wouldn't have been able to stand the abundance of performative grieving. This clip was very important, I'm also dying to know whether Sky will even air it lol.",
        "When prince charles said \"yeh! Dig that crazy rhythm\" I could not stop from laughing several times today.",
        "What about the profits from royal lands? That’s another source of income the royal family could have but give over to the U.K. public. This CGP Grey video is from like a decade ago (so I’m sure the figures are off), but does a good job explaining it:\nhttps://youtu.be/bhyYgnhhKFw",
        "\"The royal families wealth, unlike their genepool is massive .\" \nAnd imagine not even knowing what the heck you do on top of that. lol",
        "John and his team are brilliant!",
        "As a Kenyan, am amazed by John Oliver's knowledge of Kenyan colonial past.",
        "\" you can't say you're just a symbol and take no responsibility\" I mean that is literally the role the monarch plays. Oliver has a fundamental misunderstanding of the monarchy.",
        "Belize is part of the commonwealth and recognizes Charles as its head of state?? I didn’t know that",
        "God I hate John Oliver so much .....",
        "The British royal family should pay for all that they have done! The end is nigh",
        "\"Lizzie's in a Box\" is a catchy tune!!",
        "Oliver is a common vulgarian. Long Live The House Of Windsor!",
        "It helps! I mean the alternative cancer treatment!!!",
        "I wish the USA had been on the list of colonies—The British were brutal with us, too. I can’t imagine a better person to handle this topic than John Oliver. Bravo! ",
        "You talked about Whole Monarchy but didn't even mentioned India once. Like they never ruled us or they never did anything wrong in India like some of the people think. You have not even mentioned the Bengal Famine.",
        "Holy shit, Australia has its own version of Matt Walsh!!!",
        "Fun fact: there's growing evidence that the appendix does have a use in the human body. It helps ensure that the microorganisms that help digest our food and protect against food poisoning are maintained. It doesn't serve a huge purpose in the grand scheme of things, but it does help to maintain gut health, which is important. These microorganisms in our gut microbiom are largely responsible for producing the serotonin our body uses, which can have a big impact on your mental health, among other things.",
        "For a moment it looked like somebody paused the video --- the pause and the response afterwards... Just appalling!",
        "Mushy peas are bangin",
        "Brilliant",
        "Charles, the man whose face answers the question, \"What if 2 cousins had a kid?\"",
        "when you are askes such a question there is only one reason to refuse to answer, that your choices are admission or lies.",
        "Crappy guy: \"No, I am looking at you with certain thoughts in my mind....\"\nAlso Crappy guy:  Thinking of putting his boot on the interviewer's neck",
        "As a Kenyan, we still have scars that were inflicted on our grandfathers.",
        "Why we left England 400 years ago. Off with their heads except for Harry",
        "I love when creators come together to do stuff like this.\nIt's incredible seeing so many people together.",
        "water kingdom ",
        "My thoughts and prayers go to the people of Ireland, who were surely left nursing the mother of all hangovers the day after the news of the queen's death emerged ",
        "Thank Mr.Oliver. As a Birth -10 year old American citizen growing up in East Africa in the 1950 ‘s, I have been overwhelmed all my life how educated people in the US are so lazy and ignorant about the history of the countries suffering the worst quality of life on earth .  For me racism has always been “There must be some genetic cause for both individual and geographical poverty”. It still causes me deep disgust with most of today’s white countries. And I constantly work to overcome this complacent superior attitude to find compassion necessary to help those  we forced to suffer and pay for our high standard of life. Bless you sir!",
        "I'd be interested in a comparison between how the British view their Royal Family compared to how Japan views theirs.",
        "Cuando esto comenzó ,historia channel me advirtió que la historia de Orfeo de Lira iba a pasar.Tambien la de Prometeo.",
        "14:12 reservation system in India triggered",
        "I think Britain really shouldn't worry about tourism, Vienna gets plenty of tourists interested in our palaces etc. even though there hasn't been an emperor in over 100 years, all you need is dead royals with interesting stories attached to them, Henry VIII probably draws way more people than Charles ever will.",
        "All good, but so much of this could be said about the US, and is not even mentioned.",
        "I've been away from Australia for 8years. Didn't realize that Sky News is the Fox News of Australia!",
        "thank you- history is history!",
        "I can understand how they feel. I get it. WOWWWWW TO THE LIZZIE IN A BOX SONG!!",
        "As an Irish person, I thought this was pure poetry. Thanks John.",
        "But then what would happen to TV show the Crown",
        "I don’t see why the rest of the world is obsessed with whether monarchy should serve as figure head or not . The British can decide for their own country what they want.",
        "\"I think a lot of people would like what we have\" - England\n.\n.\n.",
        "So the real question is, did the Sky show this episode to the UK audience or did they just watch churchill doin a slide for 25 mins ? please update us",
        "I usually like this show, but the Royal Family are an easy target. Sad! This episode is a cheap sell out dig at people who can't answer back.",
        "The UK wanting to keep the monarchy and voting to leave the EU paints a picture not of a unique and quirky country, but a country that votes against its own economic self-interest.",
        "John Oliver is the man!",
        "They're a tourist draw.  So not totally useless.",
        "Thank you as always John for covering these stories. I'm from Kenya🇰🇪, and I've always watched these episodes of\n \"U.S.A is just a 3rd world country with a Gucci belt\".",
        "I've just started watching \"The Crown\" after the queen died. I've never had any love for the monarchy, so it's more of an eyeroll-watch. I don't get the American obsession with royalty. I thought we fought a revolution over this, and yet in over 200+ years instituted a corporate oligarchy.  I enjoy some of the royal stories, historically, but I've never \"wanted\" for a monarch in real life. It's ridiculous. Thanks for this, John. ",
        "That old Kenyan lady broke my heart ",
        "Such  stupidly is also great  in Great Britain,  the Monarchy is  a waste of Air.",
        "I can't look away from Winston, it's hypnotic ",
        "Thank you for shedding light on this. People are far too comfortable being ignorant",
        "This is the first time in my life that I witnessed a British man mock an Australian accent ",
        "John Oliver is the real OG! Says what is right with zero fokks given!!",
        "@lastweektonight why dont u do an episode on Iranian revolution and massive bloodshed that is going on? Raise awareness, innocent children are being killed and raped by this regime in the name of islam and god. Please do whatever you can to raise awareness.",
        "Unless I’m mistaken, that wretched King James II (the Duke of York referenced in the passage at 13:40 or so) was the last Catholic King and because of the unorthodoxy of his faith he was exiled from the country, and he is NOT a direct ancestor of the current royal family of Britain.  Two of King James II’s daughters took the throne after him, the first daughter Queen Mary ruled with her husband William of Orange (from Holland) after the so called “Glorious Revolution” of 1688 (which drove off the unwanted Catholic King James II) and the second Queen Anne who died without living children in 1707. After this the British government invited the dead queen’s second cousin from Hanover (in modern Germany) to rule as King George I.  So … the slave owners and profiteers mentioned in the show are not actually DIRECT ancestors of the current royal family of Great Britain, since the Stuarts, referenced in John Oliver’s show here, died out with Anne in 1714.  Predecessors, yes; beneficiaries, yes; ancestors, no.",
        "don't worry, one day, some younger generations will find the things we do now and make a joke with it",
        "This doesn't negate the point and argument made, but it is important to offer the important correction that technically Elizabeth II and Charles III are not direct descendants of Charles II and James II, since their ancestor direct ancestor George I was the great grandson of James I (who was for the record absolutely complicit in an even earlier incarnation of trans atlantic slavery) by his daughter Elizabeth and her daughter Sophia of Hanover. Just a small correction.",
        "There is the same oath in Canada and we have representatives in Québec that refuse to swear allegiance to the King. We are about to pass a law to remove this non sense oath. Most people don't want anything about the monarchy in Canada, especially in Québec.",
        "Thank you for sharing this information. Can you please talk about Jalian Wala Bagh massacre happened in Amritsar, Punjab, India. Under British rule more than 1,000 people including children, women, and elders were shot in 1919. Hope to see you discuss that in the future Monarchy II episode. The world should know about it.",
        "He didn’t’t even mention all of Lady Diana’s experience with the royals.",
        "As soon as this episode gets uploaded to YouTube in Britain, I'm going to send the link of this episode to my uncle, who was made an MBE in 2002. I will force him to watch this.",
        "The thing I seriously don't understand about monarchies around the world is why everyone is so obsessed with what they're doing, outside of scandals and rightful criticism.\n\nI have the same stance with any royalty as I have any celebrity. They exist, I acknowledge they exist, I won't cry when they're gone unless they did something that touched me personally. I don't know them outside of \"they're well-known\", and they don't give a shit about me.",
        "proud of Prince Harry for pulling away, atleast a if even a little to longer be a part of that!",
        "Had he throwed eggs in India he would have languished in jail for years",
        "Amazing and important piece",
        "It might have been interesting to look at other European monarchies that still exist and compare and contrast them with the British monarchy, but I understand that John Oliver probably is most knowledgeable about the British monarchy and since most viewers are probably in English speaking countries, they may not have as much interest in other monarchies.",
        "I can’t believe John got through this entire segment without even mentioning India.",
        "A monarchy shouldn't exist. We all know it really is a monarchy and it's not just ceremonial. They created that for safety to minimize their profile. They streamlined their power fit efficient.",
        "“As an American with Irish blood, all I know is that we had to run those guys out of both our countries.”\n-George Carlin",
        "I find not speaking ill of the dead to be... weird. If they didn't want to be spoken ill of, maybe they shouldn't have been awful people. Death doesn't absolve people of the things they did.",
        "Charles should not be bankrolled by the taxpayer.",
        "I would like to say I (once again) find myself absolutely understanding John's attitude. That's how I see all the nationalism; If you find pride in achievements of people you find a common denominator with, have the decency and honesty to share the guilt and responsibility too.\nAlso I could listen to John's exaggerated British accent all day long and it never gets old.",
        "Australia is very much on the way to a Republic. I like Oliver but as an Australian his show chose a piece from Sky News which is barely watched and had a very extreme (right) view not shared by many in Australia. But its easier to get a racist bit about Australia than find something that represents the majority. I'm a lefty but this stuff makes you think Oliver just wants something to jeer at. Must be profitable while he rants.",
        "This is an abysmal video for several reasons.\n\nIt shows a critical misunderstanding, or at the very least a skin deep and cursory view, of the issues at play. ",
        "Love you John Oliver.  One positive is that Britain does seem to develop people who aren't afraid to question their government, and do so intelligently.",
        "First part of the video: monarchy is doing nothing. Second part of video: monarchy is responsible for all crimes, committed by the UK. So wait a minute. If monarchy does nothing then you need to blame UK parliament and Winston Churchill for those crimes.",
        "Thank you for this!",
        "That's gonna be expensive, they have to reprint all the money with the face of an old man with two farts left to live, only to have to reprint it all over again with his successor. Why not crown a younger successor and skip the old farts ?\nSigned, just another old fart.",
        "The British love the Monarchy cause without it their relevancy in todays world would disappear. Especially after Brexit. In my opinion.",
        "Wait - so does that mean that guy who threw eggs at King Charles cannot buy his own eggs? \nThat's mean.",
        "“War crime eyes.” I’m dead. I will now make that part of my daily life.",
        "\"Haha it is okay someone died because they voted for Trump\"\nSo funneh. Orange man bad.",
        "When will Rome forgive their atrocities? Vikings? Mongolians? Aztecs? Chinese? Maoris? Comanches? I bet the Egyptians killed someone I might have been related to, where's my apology and compensation?",
        "Let's not forget it was the queen's visit to the British occupation zone in Ireland that started the troubles. As recently as the late 1990s the queen's government paying pro British fascist hooligans to kill Irish people all over the occupation zone in the north of Ireland. In 2019 the BBC admitted this was true. I'd absolutely love to see a parliamentary inquiry into what the royal family knew about the actions of the British military that the queen was head of. Did she know her officers were issuing licenses to kill to far right extremists like the UDF? If she didn't know it's because she didn't want to. Regardless the fact remains the British government was fighting an illegal imperial war against Irish civilians in the 1990s. This institution is completely morality bankrupt and it's bankrupting the country. It's time for an affordable, transparent, democratic alternative. It's time for a British republic ",
        "The day the Queen died, Black and Irish Twitter was on fire with jokes and many of them were hilarious.",
        "Versailles is hugely overrated though",
        "John you should've mentioned the jallianwala bagh massacre where british troops led by brigadier general dyer fired on Indians protesting like Canadians  in a garden with 8metre high walls",
        "Fibs. Mushy peas are the mutts nuts.",
        "Gotta say, it's a little rich of John to complain about the fact that the monarchy exists despite having no role in government and then point the finger at them when the British government is responsible for atrocities",
        "\"The Sun never set on the British Empire, because even the God couldn't trust the British in dark.\"\n\n- Dr. Shashi Tharoor",
        "GOD SAVE THE KING",
        "I used a British VPN and this video wasn’t avalible ",
        "If he wants to be king  then not let commonwealth",
        "Whether it's a monarchy with a parliamentary representation (how fucking caste system is it to have one House of Commons with a House of Lords?) or a democratic republic, European imperialism/colonialism is and will always be the only thing that should be kept being discussed until the end of the human race.",
        "Honestly, Ireland and Scotland making that chant is just very much part of their countries' identity",
        "Dig that crazy rhythm is cool though…..what…..",
        "that lizzie in a box chant is horrible.. you can be against the monarchy without being cruel",
        "I don't mind them, they get money and we get free access to the royal estates which they maintain for us as environmentally protected aeas",
        "I normally am not a big fan of music from England but that Lizzie's in a box track was a 10/10",
        "Thank you, John Oliver, for that Maumau piece, because my tribemen are still suffering as a result of how the monarchy dealt with  Maumau uprising.",
        "Did Sky air it?",
        "While they‘re not personally responsible for their ancestors‘ sins, they‘re complicit in their silence and ignorance.",
        "The \"set fire and then put out said fire\" analogy implies that the British invented slavery. They most certainly did not. Slavery has always been a part of the human experience, and still is in Countries like Mauritania and Saudi Arabia.",
        "Look at the way the Royal family behaved around Megan and Harry, how  Will and Kate totally froze when confronted in the Caribbean. There seems to be strong unresolved currents everywhere.",
        "Thank you for highlighting the maumau story, my grandfather who is still alive and in his nineties was a victim of that horror, he was detained in Kismayu in Somalia and watched his siblings burnt alive, only a sister remained. He usually narrates these stories alot. He says before everything was forcefully taken away his family were actually wealthy landowners.",
        "I was hoping she would return the loot of the Empire",
        "I don't understand, why people from the audience are laughing during the interview with the British colonial officer... I think it's such an awful interview (the officer not giving an answer). I don't see any reason to laugh.",
        "As a West Indian I can tell you....Britain's stronghold is alive and well. I recently learned my mom had to change her Hindu name to an English name in order to teach in her own country! And this was in the 50s....hello!",
        "In America, we have new Presidents every 4 (sometimes 8) years.    In Britain, their Prime Ministers can change as often as our Presidents, but, the one advantage that Britain has always had is Queen Elizabeth II who has guided all of her 11 Prime Ministers for over 70 years.   That's a lot of wisdom she has provided to them all in her weekly meetings with the Prime Minister.    That longevity has helped Britain over the past 70 years in many ways.   As stated in Mr. Oliver's video here, the British Royal family has contributed greatly to tourism in Britain.    However, the British Royal family \"sells\" many of the products made in Britain on the world-wide stage.    For just one example, when Kate Middleton wears a British-designer dress, they sell out of it world-wide and the same can be said about both her children's outfits (George and Charlotte) which sell tremendously world-wide.   That's billions (not millions) of pounds that is brought into Britain and that's only clothing products.    For so many years, the British Royal family have become a \"Brand\" which sells most successfully in the global economy thereby benefitting their homeland in tremendous ways.",
        "While I agree that normally people should not be blamed for the acts of their ancestors, given that each monarch only becomes the monarch because of their birthright, I feel like holding any representative of the monarchy responsible for past wrongs is totally valid.",
        "Go figure the only color movie footage I've ever seen of Churchill is this. . .",
        "Wait, the monarchy doesn't pay estate taxes when they die?? At all... wow... talk about privilege.. I get its not true what they say about the certainty of death and taxes?",
        "So The Queen is a Travel Destination For The UK = The Crown ? hmmm , fits",
        "The former australian prime minister Tony Abbot paused alot longer when questions about his disgraceful comments about the Australian defence force.",
        "Can I just say, I will never get tired of how perfectly John Olvier recreates the \"50s British newscaster\" voice. He's done it in countless episodes by now and it's always a highlight",
        "Lizzy in a box in my ringtone ",
        "As a Canadian I don’t care much for the monarchy. They never did anything for me lol",
        "my 5 corrections below (I love John Oliver but this video has errors…):\n\n1) Fans singing 'Lizzie's in a Box' were ALL from the same team - Celtic FC - they've always been anti-monarchy. It's not a sign of change.",
        "The monarchy actually gives more money in the proceeds from their property (the crown estates) then they receive in the sovereign grant.",
        "Don't hold back John, just let it out...",
        "Hello echo chamber. I'm here to offend you.",
        "I recently visited the UK and concerning the British monarchy I came away with three observations:\n1) Most British will admit that in the 21st Century there is no political reason for the British monarchy to exist.\n2) The British as a whole don't take the monarchy too seriously. Beyond the monarchy's role as a symbol of State, the British look upon it mostly as a form of entertainment and a reminder of past glories.",
        "A swedish local politician (Staffan Tjörnhammar) for Stockholm out-silenced the man mentioned here in a news interview recently.\nA 26 sec pause following a question why the county chairman should receive a raise equal to a yearly janitor salary.",
        "It is kind of great that some of us don’t have to pay for useless head of state though. Becoming a republic would be such a waste of money just to elect a pointless figure head.",
        "The monarchy of UK is as you said \"appendix and symbol of a painful past\". Time to say goodbye.",
        "I hope he knows that most of the crimes he talks about was done by the UK while it was ruled by the parliament not by the monarch. But yes lets blame them.",
        "Ahhh Britain, a country where 100 year olds get letters from the King and teenage girls get texts from his brother.",
        "Can we do without the birds cackling in the background? This show was hard to watch during Covid and is worse now.",
        "There were actual concentration camps set up in Kenya during the colonialist era where locals were detained, tortured and killed. The British government attempted to erase this from history, but we remember. Thank you John Oliver for never hesitating to bring forward the hidden truths and uncomfortable conversations",
        "Im from Florida, I am an American, with that said I am pro-monarchy. God bless the Queen she will be missed, Charles is a bit of a fuck up, but I know when William is crowned will be a special day.",
        "What's classy if you're rich and trashy if you're poor : living on public money ",
        "My great grandparents passed down their own stories about boarding assimilation schools, and there's so many horrific stories and associations I can't help but connect to literally all of our current U.S. institutions today that so many people overlook if they're not indigenous...  When the queen died and I saw some coverage and interviews from Democracy Now with firsthand accounts of issues with colonization in Africa, etc. that the royal family still actively tries to maintain what tiny grip they still exert over them, my first thought was, \"I REALLY hope her death gets more people talking about effective ways to approach decolonization - and that we can go beyond just well-intentioned people who inadvertently see it as a metaphor and nothing past that.\"  Thanks, John, and to your entire team, for doing such a great job as always.  This especially warmed my heart at a time of year where I hate getting shit from everyone outside my family (except for the non-Native people who married into our fam and guilt trip the hell out of us) for not wanting anything to do with Thanksgiving for said reasons too, lol.",
        "Awesome ",
        "I'm Canadian and wish we would abandon those leeches. We have a prime minister but technically the most powerful person in our government is the representative of the British monarch",
        "Actually, you CAN have it both ways if both things happened. Britain had slavery in its plantations, but it also ended slavery in its colonies and destroyed the Atlantic Slave Trade using the Royal Navy.",
        "Bunch of theives",
        "I think Ireland is only country she turned up and said sorry to us.. it only took 600 years. She has blood on her hands simple as.. this crap she did not know..",
        "I'm Indian, I've got a few Irish and Scottish friends. And when the funeral was happening, you can bet that we were drinking and singing",
        "6:28 ironic \nMickey and Minnie are king and queen in kingdom hearts",
        "British monarch is pointless. They are just good will ambassadors",
        "Lizzie's in a box that goddamn burn",
        "The monarchy in England is similar to people like politicians like Nanci Pelosi in the US (career politicians). The US just makes more money so we have a lot of monarchs.....",
        "I feel bad for her family in the sense that they lost a mother, grandmother, etc... but her as a monarch? Certainly not. Yes, there are worse heads of state, but she was literally the single longest-reigning one at a time when she could've led the world in making it a better place, yet chose to cling what power she had left.",
        "Well I think we found another topic that will need a part 2.",
        "Y'know, \"Dig that rhythym\" is a very 1970s thing to say, and King Charles was a young man in the 1970s.  That's him using age-appropriate phrases, really.\n\nAs a (white, male, straight, mid-forties) Canadian, my relationship to the Crown is fairly low-key.  I value it, most notably because we have America right next door.  At the end of the day Americans and Canadians are very similar cultures, but we're not the ",
        "It's fun to make fun of a monarchy, when we ourselves just dodged becoming a monarchy by a nuthair.",
        "hilarious",
        "The tear of crocodailes that british shaed now",
        "Where's the link to Winston Churchill going down the water slide?",
        "Haha that crypto joke, fuck you John Oliver Great show!",
        "Lol! Not a fan of the new king but I hope he inspires people to take care of the Planet. I will grow in admiration if he does that work.",
        "absolutely love it, the suspence before you get to 0 players ahead of you, heartbreaking knife twisting server disconnects, relaxing and almost meditational waiting on the loading screen - all of this is so ground breaking, a true anthem to minimalism, just one single loading animation, counter, muted grey background and a logo of the game, what a masterpiece!",
        "I don't know how can there be laughs on the long silent pause. It's tragic, not funny. These are facts, it's not a sitcom.\nPlease, take a moment to really think about it.",
        "“The Royal Family’s income, unlike their gene pool, is massive”. OMG, PMSL! ",
        "This planet would be far better off if the British Empire AND it’s spin-offs had never existed, quite frankly they are the worst in human history. No one else even comes close to its level of evil.",
        "Mgr.Oliver, what about the originál inhabitans of America,how did you treat the Indians?",
        "John well knows that eggs do not go in the refrigerated aisle, he is just pandering to his American audience there.",
        "I really dislike when British narratives try to flex how Britain \"led the way\" in abolishing slavery, because it's so disingenuous. Britain conveniently stopped running the slave trade right when it ceased being profitable for those who controlled it, because they'd brought so many enslaved people to their colonies and to the US that the enslaved populations were at that point considered \"self-sustaining.\"",
        "who is the guy next to epstein at 14:23 ?",
        "I’m glad for the emphasis on how England was so involved in the slave trade because nowadays they seem to have amnesia about it.",
        "I hope egg guy goes out with a basket of eggs, and they're like \"hey! You can't have eggs out here!\" and he'll reveal that they're not real eggs, they're all made of wood, so they tell him to carry on, but then surprise, he starts hucking wooden eggs at the king.",
        "10:00 \"It makes us unique.\"  Belgium, Netherlands, Denmark, Norway, Sweden, Lichtenstein, Luxembourg, Spain, and Monaco all have royals too. More than half of some of their closest neighbors have royals.....",
        "Thank you. Thank you for being able to tackle ANY subject with truth, dedication and wit. We bless you. We the people bless you and everyone at Last Week Tonight.",
        "Australia awkwardly simps for the Crown harder than any other current/former colonial state.",
        "24:02 By the way, Lidia Thorpe is fantastic and just all around amazing! Thank you, John, for mentioning her in this episode - more people should be appreciating her!",
        "\"emotionally unavailable guacamole\" is the best thing all day.",
        "Wasn't the queen of England one of those crypto Jews ?  Wasn't even really British.",
        "The Mickey and Minnie analogy was spot on. The monarchy are the mascots of the country.\n\nThe guy with the long pause totally reminded me of A Few Good Men. This guy denied actually putting his foot on the necks, but when asked if he ordered others to do so, he didn't want to answer that. \"Did you order the code red?!\" \"You want the the truth?!...You can't handle the truth!\"",
        "My parents were born during the “Mau Mau” uprising, this stuff isn’t ancient history.",
        "\"Try to talk about the British role in the slave trade without talking about the monarchy, is sort of like trying to talk about Jeffrey Epstein without talking about the monarchy. They are inextricably linked however uncomfortable they find that fact.\"",
        "Before the queen died I thought they made money through PR stuff and of course family money, it’s ABSURD to me that they get tax payers money.",
        "My country had its more than fair share of Dutch atrocities since it was colonized in the 1600s and my Grandfather fought in 1945-1949 to keep them out of country when they came back attempting to recolonize it after WWII. When Queen Juliana died in 2004 I was in his home and he was all smiles, when I asked him why, he said he was celebrating lol.",
        "There are too many crimes against humanity piled at the British Monarchy's feet to even list them all confidently. The moment I focus on even one I have the dizzying feeling of all the other's I've left out. They love the word empire, they don't like unpacking what that actually means.",
        "For years now - there’s no one more brilliant than John Oliver and his team.\nToo bad that the by far best information in an entire week comes on a Monday morning… and then you gotta suffer another seven days… what a feckin’ torture!!\nThank you all… and cheers from Europe! ",
        "I am confused by this. One hand they call the monarchy functionally depowered and just a figure head. Then on the other use them as the scapegoat for British Policies and actions issued by the parliament and the prime minister especially at time after the role was made mostly symbolic.",
        "Umm... People. There are other countries in Europe that have kings and Queens... so it is not a \"British Thing\" @JohnOliver you should do with other monachies.",
        "Well done, team. I lived in Kenya for two years, in the early 80s. It still brings tears to my eyes, what they did there.",
        "They are The Monarchy after all…and I think it is great! But it is also important that they address these issues. However, it won’t be King Charles, but maybe Prince William…",
        "I think he missed something.  It's my understanding that there is a broad portfolio of properties that together comprise \"the Crown Estate\", and that the £100 million 'stipend' is less than a third of the income from that Estate, and that the government gets the rest in return for managing the Estate.  That would mean that it isn't really the taxpayers forking over that hundred million, it's income from property the Crown actually owns.",
        "I wish someone would dig up the dirt of all the other monarchies in the world. As a Dane, I'd really like to get rid of our monarchy too.",
        "Oliver needs to be protected at all costs. An illuminating voice in a dark time.",
        "If you want to know history of colonnialism go to all the countries that have English as a formal language , drive on the left. If you want to study African artefacts go the london museum  or go to London.",
        "John Oliver is a bright & shining beacon of light at the end of the 'tunnel of justice', so witty, so well moderated, so true...John Oliver forever!!!",
        "Educational! At what point did comedy shows become more accurate and educational than mainstream news exactly?",
        "Really should have shown the Liverpool fans singing this to the Rangers fans. To have an English team chanting this at a Scottish team would probably have blown American kinds.",
        "Really enjoyed this episode, lots of good information and as always addressing a serious topic with humor to help quell the discomfort these issues evoke.",
        "I waited for this episode!! Haha john oliver delivered!",
        "In Germany, we have a solely titular head of state as well, the Bundespräsident. Ist costs roughly 50 Million a year in salaries and budget alone (not accounting for estate maintenance etc.) and brings in no money what so ever for sure. Even if the 500 million is disputed, there is no doubt that the royal family is more useful for the English than the Bundespräsidents (former ones also receive a quarter million per year) is for the German",
        "... and I thought that was a \"The Goons\" voice (Major Dennis Bloodnok?) he assumed whan he said \"Dig that crazy rhythm.\" Maybe something from Bloodnok's Rock 'N' Roll Call. https://www.youtube.com/watch?v=rmR4FE8kWrA",
        "I mean think of them as content creators - yes you can visit historical tourism spots, but they are still actively generating that tourism. They should probably get their duchy corporations taxed, and sovereign grant reduced but absolutely not abolished. It's a cultural staple and is core the British identity. It's why Americans treat Hollywood stars like gods, society need a cultural core to worship. It's human nature.",
        "AT LAST,  the most British man reacts to the most British institution. Truly excellent segment.....!!!",
        "Kudos for editing the Winston clip for it to match the beats of the music",
        "Excellent!",
        "Charles is going to make a wonderful king .",
        "I love how John is not a hypocrite. He's actually got offer from The Empire to get OBE but he refused. He doesn't want to owe them anything",
        "need to talk about Russia next \nsame boat",
        "What role do you fulfill? Prince Phillip holding back from saying \"the queen's ️\"",
        "Meanwhile if you compare what Mr. Oliver had said about the British monarchy to the US, should the US presidents apologize for what their predecessors had done, like should Biden apologize for everything the US had done for the pass two hundred years? ",
        "An absolutely brilliant show this week. What happened to Kenyans can only be described as atrocious, horrendous, traumatic to say the least. No human should ever have to experience such indignation . Is it common wealth or common history?",
        "I don’t know how I ended up here, but I loved every second of this, this man is gold!",
        "Hardly important in context, but how awesome is it to see John being genuinely happy about covering a topic!",
        "12:45 The entire aboriginal population of Tasmania was wiped out.",
        "There should be a part 2: the Japanese Imperial family.",
        "do fifa again please",
        "Love from 🇱🇰 to john \nHey colonizers Give us our stolen jems and other valuable artifacts back.",
        "Hard to believe there are still monarchies in the 21st century.",
        "At this point, seeing the absoute failure that is democracy, I'd rather have one BIG tyrant than ten thousand little comissars.\n\n“Of all tyrannies, a tyranny sincerely exercised for the good of its victims may be the most oppressive. It would be better to live under robber barons than under omnipotent moral busybodies. The robber baron's cruelty may sometimes sleep, his cupidity may at some point be satiated; but those who torment us for our own good will torment us without end for they do so with the approval of their own conscience. They may be more likely to go to Heaven yet at the same time likelier to make a Hell of earth.\"",
        "Ha, Sweden actually has that pause beat :)\nRecently-elected right wing politicians in our lovely country voted to raise their own salaries by 27% for no reason besides \"we can\".\nIn response to questioning about it, a politician responsible for the raise paused for TWENTY-SIX seconds in primetime news.",
        "16:00 to be fair, paying off slave owners was probably better than a civil war",
        "Brilliant. I’m sad nothing was said about the Irish famine and the Brittish role in it since you chose to show the Lizzy chant.",
        "Kinda wish he went in a bit more on the negative reaction to Charles' asension and the crackdowns on said negativity. I saw that people were getting in trouble w/ the police and stuff because they were protesting using #notmyking and stuff.",
        "I think it is very disingenuous to exclude the parliament in the history of the UK. You act as if she had ultimate power to really change things. After all, she was a woman and we know how women were treated in her lifetime. Not seriously.",
        "\"Dig that crazy rhythm\" is cooler than you might think. It is a very obscure reference to a favourite line from the ancient BBC comedy radio series from the 1950s, \"The Goons\", starring Spike Milligan, Harry Secombe and Peter Sellers (yes, that Peter Sellers, in which the Goons actually parody \"modern, all-talking, sinful jazz music\" (e.g., The Ying Tong Song\" ) The royal family were big fans.",
        "Thank you",
        "So lets all sing together! LIZZIES IN A BOX! LIZZIES IN A BOOX",
        "What is the difference between civil servants and Christmas elves?  \nTheir historical importance. ",
        "Yes!!!!!!!!!!!! Yes!!!!!!!!!!!!!!!!!! What the king said about young kids music.",
        "Some lady from the US on Instagram become pretty irate with me because I happened to mention that the Queen herself actively in participated in brutal colonialism. Apparently because the monarchy said she was anti colonialism, we are to blindly accept it as fact. People are so delusional.",
        "It would be futile ask what a monarch or a royal does. Even when they wielded power it resided in making decisions which were then implemented by ministers and generals. A royal does nothing, that is what being a royal is. He or she collects tax revenue, upholds the values and traditions of the nation, represents the said nation, and by his presence ensures its longevity and prosperity. One would not be considered a noble or a royal if one held a job working for the enrichment of a master; that would be anathema to the nature of royalty or noblility which is grounded in the understanding that the said individual is superior to those who labour, and therefore is not required to do so for self-sustenance.",
        "I just wanna say, I love how most of the John Oliver YouTube videos I click on start with \"moving on...\" I know it's part of a longer show, and he's actually 'moving on' from the previous segment. But, I like to imagine we're 'moving on' from the previous thing I watched, which was likely also a comedy, making the grin and slight chuckle appropriate. This time, it was extremely fun, because it made me feel for a moment like Mr. Oliver had just watched a comedian react to funny reddit posts with me.",
        "Yo Charles! Start by returning the kohinoor to India.",
        "We still have monarchy in Sweden, can someone explain that to me please? Progressive country etc etc...",
        "No way that crown would cast that shadow. Shape doesn't match.",
        "Who knew Last Week Tonight could be so educational. Many countries are guilty of such atrocities...including the USA. The sooner we allow the truths to be taught the sooner we can evolve past those truths.",
        "I hope John Oliver is popular enough for modern British people to stop denying there recent history by saying we never learnt this in school.especially generationally wealthy people ,it's blood money",
        "Shading some light to the forgotten history of Mau Mau rebellion in Kenya and the horror events that went unpunished. Thanks John Oliver!",
        "Being the first human being who is officially prohibited to carry eggs in public places is a truly great inscription for a tombstone, he achieved everything in life :D",
        "From Ireland 🇮🇪",
        "I'm Kenyan and a Kikuyu and a huge fan of John Oliver. He has said what I have wanted the world to hear about the royal family and colonialism. My mum was just telling me that her parents and all their children were forced to live in specific villages/camps where they could be monitored by the white oppressors so what J.O says is completely true thank you",
        "That was a brilliant and honest show John.",
        "Concise, Precise and Poignant. Thanks  Mr. Oliver.",
        "Alas, as someone from St. Lucia who hates the monarchy, I have awaited this episode since Elizabeth’s death. \n\nThe only thing that could have made this better was if they showed St. Lucia’s PM’s face to the gift given by the Earl and Countess of Wessex. (It’s hilarious—the gift and the face to the gift.)",
        "As a U.S. citizen, for a very long time I've been saying Monarchy is a really expensive hobby for a country to have.",
        "It does occur to me that Charles wasn’t being entirely serious when he said “Dig that crazy rhythm”. In fact I believe that he was quoting The Goons. Similarly if you believe that Churchill wasn’t aware how ridiculous he looked you don’t know much about Churchill.",
        "YES! Thank you John for this super informative episode and major kudos to Lidia Thorpe! Right on!",
        "ESSENTIAL VIEWING",
        "As a Native American with a cultural memory, I myself have disdain for the monarchy (any monarchy honestly)",
        "12:43 wasn't that the australian government doing that, rather than the queen?  I'm no monarchist but blame should go where it's deserved.",
        "Laughing in hitl€r.... ",
        "Thank you John, once again, for continuing to educate/inform we viewers.",
        "I refused to give her a moment of silence. \n\nShe was Putin in a dress ",
        "Can someone in the UK comment whether this aired?",
        "Their PR team deserves a raise.",
        "The title should have been \"the British monarchy\" \nThere are several other monarchies, you know.\nAlthough Brits think it is only and all about them.",
        "Gonna look to see if Lizzie’s in a box got a remix",
        "Love you Sir. Love you.",
        "Great as always. Thank you for the insights ",
        "The British army cut Bengali weavers of famous muslins when they turned the richest revenue collecting state of India and turned it into the poorest state and how the Queen remembered it by accepting an invitation to dine in a survivor's house and never said how sorry she was. All held in an hour long video, broadcast though out Bangladesh. John Oliver could make an even funnies video mocking the British monarchy, than the one we just watched.",
        "Ah mate, as an Australian it is fucking embarrassing that the English royalty is still head of state here. Also they do meddle in politics here at least, the governor general (the Monarchs representative in Australia) fired the Prime Minister Gough Whitlam so to say their role is only ceremonial isn't really true.",
        "So good!",
        "0:25",
        "I like how the british keep apologizing for these things whereas we have a neighbour here who literally tried to wipe our entire population off several times and are loud and proud about it to this day. Greets from Estonia",
        "Maybe I'm weird, but I see monarchical figureheads, metaphorically, as being cultural capacitors. They're also top-drawer curators. Furthermore, they're most closely scrutinized by social climbers - it's funny to see someone like Oliver yap about them for more money in an hour than his average viewer makes in month.",
        "The coffee enima veggie and vitamin shot is accurate, almost cured Michael Landon. Gershon therapy.\nI'm not doing an advertisement, but watch anything about this man or family.",
        "UK would not be a kingdom without a monarchy, main reason I would visit UK IS because of the halo of the monarchy. Without it it’s just another decolonized island.",
        "This was such a great episode that I wish i could Like it 1000 times.",
        "Takahashi leaves behind an amazing legacy. He created so many of the powerful cards we had as kids, but showed how powerful his dedication to helping others was, even though it cost him his life. RIP Takahashi; you could've sat on the sidelines and lived life easily, but you chose to risk your own to help 3 others live theirs. Cheers mate",
        "Interesting fact re the Monarchy and abolition of owning people: They weren't just hypocrites about slavery, but the Kingdom of Hannover that was under a personal union with the British monarchy was the last part of what is now Germany to abolish serfdom in 1833. The neibouring Principality of Brunswick had abolished it in 1433, most other states in the region in the mid 1700s to first years of the 19th century. And no, I'm not equating slavery with serfdom here, they were very different and slavery was much much worse, but it tells you a lot about how hypocritical the \"leading the abolitionist movement\" claims are.",
        "Oh oh oh there will be a butthurt article in the Daily Mail tommorrow",
        "As the late King Farouk said when he was ousted from Egypt: \"In the end, there will remain only seven kings in the world: Four on playing cards, two in chess, and the King of England\".",
        "I didn’t see the Cayman Islands on that list of commonwealths; but I know they do not want to lose their status or wealth. It’s going to be an interesting few decades. Thank you John, for laying out some more facts of Britain’s role in slavery.",
        "the little kid jumping up and down, flipping off everyone, while \"lizzie's in a box\" is being chanted is quite an image...",
        "Check out the royal assets and you'll understand. They own like half of the land and have many large investments and stakes in major industries. They exist very clearly to take your money and to inherit the family fortune.",
        "Mr. Oliver; We need the Monarch as they are a neutral person who does not campaign for a person or party. \nOnce we electric a person for office they start a re-election campaign within 6 months and when they lose, the person stops working. \nWith the Monarch they continue working and support the nation’s interest. ",
        "9:45 Like the British monarchy, the human appendix still serves a purpose.  possibly not the original purpose it served, but it's there and doing something arguably beneficial.  In the appendix's case, it's basically a disaster bunker for your gut biome, ensuring you never fully lose the little monsters dwelling within you and that they will stay with you forever.  Not sure about the Monarchy though.  I'm sure they do something similar? :P",
        "The section about the Royals' income was particularly interesting to me. I remember watching CGP Grey's video (from 2011 or 2012) about how the Royals help make money through tourism and also turn over profits from land they own. At the time I thought it was an interesting video, but clearly there was more to the story than he presented (either the information wasn't available at the time or he just didn't know). I guess it speaks to the importance of (1) content creators digging deeper for the fullest possible story, and (2) audiences doing their own digging and not just taking a five-minute video as the be-all and end-all of an issue.",
        "Thank you  @John Oliver for highlighting the  plight of the Mau Mau in  Kenya 🇰🇪.  You're  correct.   Give the honest truth about the Royals , the Good, the bad and the ugly! This selective history does everyone a disservice!",
        "Buddy, aren’t you selective on whose pain needs to be voiced, you missed the whole of Asia. Wonder who is paying you?",
        "Says it like it is. This is why he wins the Emmy’s every year! Love John Oliver",
        "Brits have the freedom to criticise the monarchy. Now have a look at the Thai monarch.",
        "Mark: claims to not be a masochist\nAlso Mark: plays the game that made him rage so much he threw a chair",
        "Isn’t that answer to petition members of Parliament for a referendum to abolish the monarchy rather than getting mad at people who are literal figureheads with no real power?",
        "I was in Scotland when the Queen died and there were definitely mixed opinions on the monarchy there, some held signs declaring their love for the queen, while. Some openly thought they need to leave the commonwealth.",
        "My favorite thing is that football match where they didn't do a minute's silence because they were afraid the Scotland fans would fill the silence with heckling and instead did a \"minute of applause\", to which the Scotland fans responded by singing \"if you hate the Queen of England, clap your hands\" over it.",
        "Come on",
        "I been to Versailles and I can confirm that the fact that I'm not in someone's current domicile didn't devalue the experience",
        "That was long, only 23 s.  We had a longer silence by a Swedish politician that was about explain why they raised their salary by 50%.  ",
        "The Great Looters of Britain",
        "You didn't even bother to talk about the situation in Quebec... like come on. If there is a people who absolutely despises the monarchy, it is Quebecois, just as the Irish and Scottish people.",
        "Oh don't worry about DY or the African Company... Britts and Americans will as usual throw the responsability of that shit over Columbus. ",
        "Net result; the world is better off.  Don't like it?  Turn in your car keys, iPhone and electricity at the door and don't look back.. nobody's gonna stop you.",
        "Actually, the last residential school in Canada closed in 1996!!!!!",
        "\"They're like if mash potatoes killed themselves,\" killed ME ",
        "I will forever be grateful to LWT being ad-free",
        "Eldenrings soundtrack is amazing and has a major variety like the main theme/radagon theme is so triumphant and powerful but the ancestor spirit theme is honestly just so beautiful and peaceful sounding, I'm not saying elden ring deserves best sound design but it defeinrly earned its place on the vote",
        "EMMY  award to this episode ",
        "monarchy is like of brand of the product, like coca cola, red color, coca cola have no value without brand, if British have no monarchy is like coke that have no brand even the coke it self have the same flavor to the branded one",
        "hearing a British person do an Austrailian accent is the humor I didn't know I needed.",
        "I really liked the Queen, The Current King, is alright, he has been fine tuned for this role all his life, so he might as well do his thing for whatever time he has left. I don't think William will have a crown at all or for very long if he does..",
        "Investing in crypto now should be in every wise individuals list, in some months time you'll be ecstatic with the decision you made today.️️",
        "You’d actually probably get more visitors if you could actually tour the castle, go inside, etc.",
        "My grandfather was among those imprisoned in Kenya. There's a 6 year gap between his 1st and 2nd born children.The reason, he was in one of those concentration camps for 6 years. It's not a different age.",
        "THANK YOU!!! \n\nI stand by this",
        "The monarchy is a joke.",
        "war crime eyes ",
        "you",
        "The US President costs 4 billion a year. So you Americans gonna get rid of the office of president ?"
    ],
    "comments_disabled": false
}