{"video_id": "KWterDbJKjY", "comments": ["This episode did in fact air in full on the Sky network. Way to go, Mr. Oliver.", "\"Why they are working so hard not to offend a family who's name was branded into people skin, and who sit atop a pile of stolen wealth, wearing crowns adorned with other countries treasures\" well done to whomever wrote that. Power piece of text.", "Fun fact John\n\nThe name 'Mau Mau' is not actually in the kikuyu language but actually just a phrase conjured up by the colonialist at the time from what they used to hear kikuyu  people chant to them. The phrase/word that they would chant repeatedly was 'Uma'  which translates to 'Get out' as a way of telling the British to go away from their lands. The word being said over and over, 'uma uma'  was heard by the British as Mau Mau and thus the name was born.", "I like those two girls' reactions, not rude, just honest. Still obviously saying it's a sad time because a person died, someone who their country all knew, and deaths are in general a sad thing. But why care or worry about it when that person did absolutely nothing for you your entire life? It's reasonable, people have their own problems to care about.", "The best part that he didn’t even mention is that years before this aired, he turned down an honorary order from the queen because he didn’t want to be associated with the empire.", "John, I am also in the minority of \"I don't care about the monarchy\". My grandfather was deputy chief during the British rule in India. He was asked to arrest Gandhi and this was during the last years of ruling. He said \"I wouldn't and you give me a valid reason what Mr Gandhi did wasn't just that it requires an arrest\". The man high above my grandfather's position, sent him to prison. Since my grandfather was a man of principles, they released him after 3 days. In this day and age, we don't need monarchy and they are so backward in thinking", "Irish Times: “Having a monarchy next door is a little like having a neighbour who’s really into clowns and has daubed their house with clown murals, displays clown dolls in each window and has an insatiable desire to hear about and discuss clown-related news stories. More specifically, for the Irish, it’s like having a neighbour who’s really into clowns and, also, your grandfather was murdered by a clown.”", "This piece is deep. The atrocities the British committed in the colonies in the name of the queen  were horrendous. My grandmother lost her seven brothers in the Mau Mau war. She was imprisoned and tortured twice.  I have nothing to celebrate about her.", "I had a very honest talk with my teenager about the monarchy when Elizabeth died. Every time i see all those fancy jewels on those crowns i know many, if not all of them were stolen from other countries. Shameful. We have some dear family friends who are from India and the horrible stories they tell of the British Raj in their grandparents time are heartbreaking.", "This had me crying. They detained my grandfather when he was just 14  years old to prevent him from joining the MauMau.", "That graphic with the shadow cast over Africa is truly a magnificent work of design and art!", "as someone called lizzie, hearing a bunch of people sing \"lizzie's in a box\" with such glee honestly put a big open-mouthed smile on my face. sing that shit at my funeral, please", "My grandfather was a detainee in one of the detention camps during the Mau Mau emergency in Kenya. For five years he endured harsh interrogations (beatings, hours in stress position, starvation, forced labor) until he was able to convincingly renounce an oath he had never taken in the first place. When he left the camp, he found two of his children had died and my grandmother and the rest of his children on the point of starvation from being forcibly housed in a concentration village (yes concentration as in WW2 concentration camps) with no access to food. Thank you JO for bringing this atrocity to light. Anyone seeking more information read Imperial Reckoning by Caroline Elkins", "My favorite thing is that football match where they didn't do a minute's silence because they were afraid the Scotland fans would fill the silence with heckling and instead did a \"minute of applause\", to which the Scotland fans responded by singing \"if you hate the Queen of England, clap your hands\" over it.", "My Dad (still very much alive) was forced to live in those \"Mau Mau\" camps. The colonialists arrested my grandfather my dad and his brothers helpless. He had to move from camp to camp so that he could get back home while grandpa was in prison. In each camp, he spent ~1month while the colonizers sorted his paperwork of movement!", "The mention of Charles' previous distinction of being \"The world's most famous adult son\" is one of the most ruthlessly casual dismissals of a person's entire life I've ever witnessed. I literally winced from feeling like J. Oliver bitch slapped my own soul, and I ain't even no flippin HRH neither.... 10/10^10. Being coolly delivered by a Brit gave that dagger ~5 additional plunging twists to it too. GET 'EM", "Oliver is a treasure. Always sharp as a tack, and highly educational. And, of course, he is hilarious!", "its weird that most countries have social programs to help the poor, but the UK is like, lets give one family of unemployed people all of the money", "I'm Kenyan and a Kikuyu and a huge fan of John Oliver. He has said what I have wanted the world to hear about the royal family and colonialism. My mum was just telling me that her parents and all their children were forced to live in specific villages/camps where they could be monitored by the white oppressors so what J.O says is completely true thank you", "Well done, team. I lived in Kenya for two years, in the early 80s. It still brings tears to my eyes, what they did there.", "Tysm for mentioning the indigenous residential schools. My grandmother was in a residential school here in America and the university I went to, HINU, started out as a residential school too before becoming a college for native Americans. I wish the 100 missing Indian kids that were last seen following Queen Elizabeth out of a residential school, never to be seen or heard of again was mentioned but hey... I get that this show is only a half hour long", "Best full length episode of “How is this still a thing” ever", "My mum was just telling me that her parents and all their children were forced to live in specific villages/camps where they could be monitored by the white oppressors so what J.O says is completely true thank you", "That colonial officer's response is chilling, not just because it says 'yes.'\n\nBut because it further says that he doesn't regret it.", "John Oliver. The only Oliver who hates the monarchy more than Cromwell.", "Considering the history (long ago and more recent), I feel like Ireland and Scotland were more than justified in their impolite singing. I also hereby grant permission for \"Lizzie's in a box\" to be said and/or sung at my funeral. :D", "I just wanna say, I love how most of the John Oliver YouTube videos I click on start with \"moving on...\" I know it's part of a longer show, and he's actually 'moving on' from the previous segment. But, I like to imagine we're 'moving on' from the previous thing I watched, which was likely also a comedy, making the grin and slight chuckle appropriate. This time, it was extremely fun, because it made me feel for a moment like Mr. Oliver had just watched a comedian react to funny reddit posts with me.", "Thanks John for covering this, i would have loved it if you had also covered the unspeakable atrocities that the British monarchy committed in the Indian sub continent. Any person of colour from the \"common wealth\" will thank you for this as we have a lot of stories about how our ancestors suffered at the hands of the British but we don't have a platform to share it and therefore thanks for bringing some of them to light.", "It is a sad story. This piece deserves an Award.", "I love how John is not a hypocrite. He's actually got offer from The Empire to get OBE but he refused. He doesn't want to owe them anything", "We will not blame him for the crimes of his ancestors if he relinquishes the royal rights of his ancestors; but as long as he claims their rights, by virtue of descent, then, by virtue of descent, he must shoulder the responsibility for their crimes.” —James Connolly on George V", "ISHOWSUCK, this stream changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience", "Brilliant! And from a Brit, no less. John Oliver is precious gift to the world. And he does it all with humor. Wow. ", "John and his team are brilliant!", "It was amazing to see people after the Queen died saying things like “stop talking about colonialism, we are mourning and i felt like i was her grandson” while also taking every occasion to harass Meghan Markle who is… actually married to her grandson", "“They might seriously want to think about why. Why they and everyone else are working so hard not to offend a family whose name was branded into people’s skin and who sit atop a pile of stolen wealth wearing crowns adorned with other countries’ treasures .” So well and poignantly said.", "brilliant, as it always is... thank you to everyone at the show... safe journey", "Really enjoyed this episode, lots of good information and as always addressing a serious topic with humor to help quell the discomfort these issues evoke.", "Great educational and entertaining content as Always", "A regular customer walked into our store a day or two after her death and was like “oh man isn’t that so sad? It’s so so sad…” And everyone at work was like “… uh huh sure.”", "Thank you for highlighting the maumau story, my grandfather who is still alive and in his nineties was a victim of that horror, he was detained in Kismayu in Somalia and watched his siblings burnt alive, only a sister remained. He usually narrates these stories alot. He says before everything was forcefully taken away his family were actually wealthy landowners.", "I came by Last Week Tonight by chance: the pyramid scheme segment was the first one I watched and my favorite of all :) since then I've watched all the episodes from the start one after another, so much as I started hearing John Oliver's voice in my head instead of mine xD \n\nI love what you guys are doing, I'm learning a lot and having fun with this show. Greetings from Poland!", "I am Kenyan, Kikuyu and a huge fan of John Oliver. He said what I wanted the world to hear about royalty and colonialism. My mother just told me that her parents and all their children were forced to live in specific villages/camps where they could be followed by white oppressors so what J.O said was absolutely right, thank you", "After seeing John's appearance on Late Night with Seth Meyers this past September, I was really hoping he'd do a segment on The Monarchy. Thank You!", "Thank you for stating the truth, that nobody wants to say aloud. Thank you for your honesty and courage. ", "I find it hilarious that there's a man who's legally not allowed to purchase eggs. I'm just picturing him buying a dozen eggs at his local grocery store and an entire swat team just busts in and tackles him to the ground", "Simply excellent. Great perspective. Politely and professionally but while still hilarious. Thank you!", "It's amazing how many people have such reverence for another human being who is no better than their next-door neighbour or themselves.\nBeing brought up in the UK in the 50's I remember how much they tried to instill the respect we were meant to have for those 'better than us.' Stand up for the 'God Save the Queen,' Empire Day, respect authority and so on.", "Great as always. Thank you for the insights ", "Thank you, John Oliver, for that Maumau piece, because my tribemen are still suffering as a result of how the monarchy dealt with  Maumau uprising.", "As someone who strongly believes that people who commit funny crimes deserve equally funny punishments, the case of egg man brought a tear to my eye", "This was such a great episode that I wish i could Like it 1000 times.", "As soon as this episode gets uploaded to YouTube in Britain, I'm going to send the link of this episode to my uncle, who was made an MBE in 2002. I will force him to watch this.", "well done, John! you are a treasure!", "GJ JO yet another brilliant piece of journalism. Coming from a man that's a monocle and umbrella shy of being a Batman villain, that's pretty good in my book. RIP Kevin Conroy", "This was absolutely  brilliant  John!", "Please don't let the epstein story die when it comes to the royal family.", "Hats off to you JOHN, you are the official \"007\" of satirical comedy and I JUST LOVE IT.  You can take down the QUEENS, KINGS (THE REAL and the OTHER ONES) anytime anywhere with your glib combination of words and phrases and not to mention just your sheer enthusiasm doing it for us", "the reporter letting it slip that he was sad it ended had to be one of the best parts", "Kudos for editing the Winston clip for it to match the beats of the music", "And as my good friend, born in Kerala, said, \"Don't even get me started on the monarchy and India.\"", "When that British woman said \"I think people would like what we have\" all I could think was \"Because you took it from them.\"", "My grandfather was among those imprisoned in Kenya. There's a 6 year gap between his 1st and 2nd born children.The reason, he was in one of those concentration camps for 6 years. It's not a different age.", "I click on new LWT stuff pretty quickly, but never more quickly than when John is talking about the British Monarchy", "Finally ! I waited a long time for your input and it was absolutely worth the wait. Thx", "\"We will not blame him for the crimes of his ancestors if he relinquishes the royal rights of his ancestors; but as long as he claims their rights, by virtue of descent, then, by virtue of descent, he must shoulder the responsibility for their crimes\"  - James Connolly to the Monarchy", "There were actual concentration camps set up in Kenya during the colonialist era where locals were detained, tortured and killed. The British government attempted to erase this from history, but we remember. Thank you John Oliver for never hesitating to bring forward the hidden truths and uncomfortable conversations", "When the joke is about the royal families gene pool being shallow but you have at least six or seven ancestral lines that connect to that gene pool.  And then you remember that some of those family tree branches make circles or reconnect to each other and you realize you can’t really say much about it.", "Nailed it! Beautiful stuff and jolly well done.", "Thank you for this great information about the royal family. I will pass this information on to everyone.", "Thank you John, once again, for continuing to educate/inform we viewers.", "This is absolutely brilliant. Hatts off Oliver.", "Finally, the most British man reacts to the most British institution.", "Looks pretty good, can't wait to see the whole series", "Awesome show again! Love you John ", "John Oliver and the crew of LWT are my heroes", "Can I just say, I will never get tired of how perfectly John Olvier recreates the \"50s British newscaster\" voice. He's done it in countless episodes by now and it's always a highlight", "18:22 is why John show is still raging on, the man and his team delivers jokes with the most posh pompous accent and then start to bomb with facts that are so horrible that smashes your smile and smirk", "Thank you for discussing the trauma against native children in Canada. They believe they have found over 1000 bodies of native children, some of my older friends survived this abuse", "Blaming the Queen for Kenya is like blaming Ronald McDonald for McDonald’s withdrawing the McRib.", "Cuando esto comenzó ,historia channel me advirtió que la historia de Orfeo de Lira iba a pasar.Tambien la de Prometeo.", "I love that reporter's follow up: \"tell me about the care part, and then about the don't care part\"", "It's crazy seeing the historical topic, the Mau Mau uprising, which i've spent like five years studying, is actually on HBO. AND they use THE interview with Terrance Gavaghan, genuinely one of the most insane documentary interviews of all time. Massive props to the interviewer in that clip, John McGhie, the way he held this war criminal's feet to the fire calmly and methodically was absolutely pitch perfect journalism.", "\"They're like if mash potatoes killed themselves,\" killed ME ", "The Queen reminded me a lot of my grandmother, which sometimes made it hard to think of her as a shape-shifting alien reptiloid.", "I am living in Prague, we have no royal family here but people still want to see all the monuments built by our old kings. The numbers of tourist are rising, but we don really need them to rise anymore, overtourism was an issue before covid and is giong to be an issue soon. Even though we have a president, there usually are so many people on the Charles Bridge (built by king Charles IV, pedestrian only) that it is almost impossible to go from one end to another.", "Finally, in his 70s, Charlie gets the job he was literally born to have.", "Thank you for highlighting the atrocities that the British government carried out in \"her majesty's name\" in my home country of Kenya 🇰🇪", "Thanks for giving some information on what happened in Kenya in the 50s during the Mau Mau uprising.", "Trying to figure out the direct descent of the current monarchy from the Stuart line considering the house of Windsor is technically Saxe-Coburg-Gothe", "when presented with the \"yes, we spend 100mil/year on the royal family, but we get 500 million back in royalty tourism\" argument, I'm immediately reminded of big-time college football programs being essential to the core identity of many universities in the US, mirroring a similar 'esteem & income' symbiotic relationship.", "I just binged season 5 of the crown. I'm ready for this episode ", "And The Truth will Set You Free. \nMasterpiece of a show!", "Nearly 30 minutes of John roasting the monarchy? We are truly blessed to receive this juicy episode.", "EMMY  award to this episode ", "I've watched that Guardian interview with the two young ladies. They weren't being disrespectful or obtuse. That's just the fact for them.", "So I'm convinced this man will tell the truth no matter what.", "the little kid jumping up and down, flipping off everyone, while \"lizzie's in a box\" is being chanted is quite an image...", "I live in the area and thought it would be nice to mention that the neighborhood pulled together and raised money to replace the work truck. The family whos truck was stolen saved for almost 3 years to purchase a truck to run their own business. This incident occurred 2 weeks after the truck was purchased. It was a sad story with a happy ending all thanks to locals", "As an American, hearing a British person mock an Australian accent was the highlight of my week"]}