{
    "video_id": "L5PBWlDIz90",
    "comments": [
        "The fact that Russia treats any independent journalism as high treason and espionage says everything about who is in the wrong here. And again, it's not the Russian people or soldiers, it's Putin. Don't get me wrong there's a lot of grey area within what's going on that is hard to truly know without being deeply involved, but the long and short of it is thus.",
        "Hello Russian trolls . Hope you are having a miserable day, and soon getting your paper to deploy to the front line ",
        "Thank you Mr.Putin for sending huge amount of free organic fertilizer to Ukraine.",
        "It's funny to see that we people outside Europe have completely different ways of looking at things... We see both sides... Unlike bbc news paid",
        "I hope Putin had his people do the annexation paperwork on very soft paper, I wouldn;t want him to scratch his bung hole while he is using that paper for the only thing it is good for.",
        "11:00 The sheer terror in this guys voice when Techno goes 140 kilometers/hour to commit massacres in the name of charity is so wholesome. :/",
        "I also need help. But no one helps but that's okay because I still help you.",
        "Good to hear the Ukrainian are alive to the very real prospect this will be a trap",
        "Looks like the pro Russians have crawled back into the woodwork, oh well you can still shout “URRAAA” ",
        "Full support to the Ukrainian people for their struggle because they're struggling and fighting for their occupied territories from the Russian dictator puttin and his crazy army officers",
        "Ukraines still gonna lose,",
        "Wow! I thought Russia is a superpower!! I was wrong.",
        "Ukrainians are a different breed. What an amazing people. Glory to every single hero fighting for their freedom. Glory to Ukraine 🇺🇦 🇺🇸",
        "No compromise, don't let them have an inch of land. Push across the dnipier river and crack on! You can't start compromising now just because it's cold. That chance was in 2014",
        "Putin: This was not an abandonment, it was a special occupation, no, it was a partial occupation, no, it was a \"good will gesture!\"",
        "yep, it's a trap!",
        "I didn't realize that our tax monies were used to provide the Ukrainians with such sophicated artillery pieces!  Meanwhile, decorated U.S. veterans are hungry and homeless on U.S. streets!",
        "bbc must have some plan in kherson",
        "Glory and huge love from your georgian brothers I'm really sorry for passivness of my country in this conflict we could have done more, but Georgia was the first country that left soviet union and we had two war against the russians we are so tired... but...but we belive the victory is  flickering on the horizon",
        "Mabuhay kayo mga Ukrainians, pinapakita ninyo sa mundo paano ipagtangol ang kalayaan ng Ukrainians  at ng bansang Ukraine.  God Bless Ukranians ,  Mabuhay kayo!",
        "Forever Russian. Like the thousand year Reich. A fantasy of a lunatic.\nSlava Ukraini",
        "Don’t let them leave destroy them",
        "Continues praying to both sides who don't like war, but to live and enjoy precious gifts life.",
        "theres a rabbit off somewhere,it could be a trick,hes keeping the ukrainians away from kyuv",
        "Ukraine isn't blind. They know that Russia plays dirty. SLAVA UKRAINE 🇺🇦🇺🇦🇺🇦",
        "Wasn´t it reported that russian generals wanted to pull out of Kherson for a long time now and just weren´t allowed to do so until now? That retreat is probably genuine. It would have never been sustainable to hold and in just a few weeks or months thousands and thousands of their troops would have been pushed with their backs to the riverbank with no way out. If they wouldn´t be pulling out now, it would end in a catastrophic loss of soldiers and the end of the war.",
        "This report is delusional ",
        "From the USA you're welcome for the aid.\nSlava Ukraini.",
        "Slava Russia",
        "One of these days I'd like to go to Ukraine to visit and maybe show my support for the Ukraine people .",
        "Dear Ukraine solders we are with you, the enemy has lost morale in this war.try to apply gorilla tactics of three four personal, deploy more intelligence as many as possible in Russian position s , Russian soldiers  fixed they have run out ideas .but let us pray to God you  guys will win this war. I wanted to join you guys but had no way I would have wanted even my son's to join and help out brothers in Ukraine.",
        "The civilians are out of the area the Ukrainians  come in...There is no need now to worry about civilian casualties as the russian artillery pounds them from the other side of the river...a artillery's man dream",
        "They’re not giving up. This is a change of tactics. I expect large scale ballistic and missile bombardment .",
        "Not sure but maybe russia coming up with something big",
        "slava ukraina",
        "It could mean that Russia is going to hit that area in Ukraine with a dirty bomb!",
        "Ukraine should say it will only negotiate a ceasefire for troop withdrawal with the leader of Wagner to pile more pressure on Putin.",
        "nice propaganda",
        "Beware. Putitn does not give gifts. This very well could be removing his troops from a nuke annihilation area.",
        "Russians pull back then use tactical nukes on Ukrainian forces in Kherson.",
        "it would be great for Ukraine if they were to manage an offensive to recapture Crimea. But the fact that they've gained back this much ground since the start in February is a great advance in its own right.",
        "consolidate, improvise, adapt, overcome. remarkable how ukraine defeats the bear with nothing more than sticks and shovels, metaphorical speaking",
        "Get the reds out!",
        "be careful, they might throw a nuke there",
        "Interresting how they (media) spins it now. The Russians never had this possibility off the table. They openly said about leaving if necessary but. Now why did not  the other part move in while they are still there? Or they tried several times and got repelled? \nAny way, we should not be praising war of any form. Let's pray for peace and hope that USA and Russia come to an agreement soon, because they are the root players of this tragedy.",
        "If Ukraine 🇺🇦 can win Russia 🇷🇺  what  can England 🇬🇧  and USA 🇺🇸 do to them haha  ",
        "Mad how people think ukraine are winning  does anyone not think that he’s just pulling the troops out so he can bomb the place with nukes instead? But what do I know, just your friendly neighbourhood noddy",
        "God bless Ukraine 🇵🇭",
        "Slava 🇺🇦.  ️ from 🇨🇦",
        "I've seen this tactical move before on the battle field in 1943 just before the BOOM!!!",
        "Putin must change his heart please",
        "The entire world continues to laugh at Russia.",
        "good show keep it up",
        "Steve out in Russia draggin his balls, lol brave man.",
        "This may be some sort of a trap, can’t see putin leaving without wanting some sort of revenge.",
        "Just imagine spending so much effort, wealth, and courage on building something lasting. I hate the Putin’s of the world and their enablers.",
        "Makes you wonder what they are going to call it should the Ukrainians manage after all to push them back completely.... Of course, the more they compress Russian troops and vehicles in a smaller area, the harder it is going to become. Plus a larger part of the population there is not necessarily pro Kiev. The feasability of liberating Crimea remains a big big question. Not sure though if the Russians saw Kherson or rather Mariupol as their biggest win, given the presence there of the Azov batallion.",
        "Brilliant Tactics vom Ukraine's Commanders and the MERCY OF GOD. By this time, GOOD has WON!! More Power to Ukraine's brave soldiers.",
        "Well, with such good news, Ukraine can focus much more attention on the the more Northern and Eastern fronts.",
        "I hope is not a trap. Ukrainian people are the bravest people ever. May God keep blessing you guys. Stay strong.",
        "So is this the end for Russia's Invasion?\nPutin: Well, I don't really think the end can be assessed, uh, as of itself as being the end because what does the end feel like? It's like saying when you try to extrapolate the end of the universe, you say, if the universe is indeed infinite, then how – what does that mean? How far is all the way and then if it stops, what's stopping it, and what's behind what's stopping it? So, what's the end, you know.........is my question to you.",
        "The Russians never publicly announce their moves ahead of time, except this time (televised no less)!   LOL Time will tell  why!",
        "This could be a trap. Considering Russia evacuated civilians from Kherson and now Russia just leaves Kherson.",
        "but what nasty surprise have these psychopaths left  behind and what will they destroy instead for the shear brutal vindictiveness  we have seen so often",
        "🇷🇺love bbc sister proganda",
        "It's very simple to explain and easy to understand:\n-- Kherson  always was, is and will continue to be Ukraine.\n-- Kharkiv  always was, is and will continue to be Ukraine.\n-- Donetsk  always was, is and will continue to be Ukraine.",
        "I hate to sound pessimistic but seems like russia is working towards a very normal russian sroched earth policy. Seems highly likely they'll cause further problems at Zaporizhzhia or elsewhere as a means of attrition. They clearly don't care about losses, which is also a pretty common russian trait",
        "It concerns me that this is simply a tactical withdrawal,  There is satellite imagery of significant defenses being built on the other side of the river, and also reports of artillery and troops being diverted to them. It seems like if Ukraine takes Kherson they'll be dealing with a city full of traps, while enduring heavy shelling. From a laymans view this seems make a lot of sense, if you cant hold a city pull back to a defensible position and bleed the liberators.",
        "Why is Russia a super power again?",
        "Forward Ukraine! Kazakhstan is with you! Glory to the heroes! Death to the enemies! Russia on its knees!",
        "Hopefully hes not going start useing nukes,i pray for ukraine always  your so brave and strong never ever give up",
        "Id be worried about a Nuke, they abandoned way to fast",
        "Putin the Lunatic.",
        "General Surovikin is a genius of withdrawing. He is capable to do the best retreating possible! Putin choose the best General to lead this phase of war!",
        "Awesome news, glory to Ukraine",
        "That general made me laugh when he spewed his hilarious rhetoric.",
        "Kherson is a trap.  Dont go into Kherson. Level the Kersh bridge with topedos and boat drones. Take Crimea and work up behind the Russian trenches in a pincer movement? What do you think?",
        "A major Step Back! ",
        "Well done Russia you done great decision   \nYou should not allow them to cross  the rivers so make defence position it will be difficult for Ukrainians too to cross the river but push Ukrainians lines from buhmut city you can even take back the otherside of the kherson river",
        "As a Russian, we are going through just as much right now. our economy is getting worse because of sanctions. ",
        "President Zelensky is good at making plays full of lies",
        "Slava Ukraini",
        "Think the Ukrainians should fortify and reinforce best of what they got back upto the Dneiper and look to do insurgent actions south of Dnieper at a later date.",
        "13 hours later\nBBC: Ukraine's President Zelensky cautious over Russia's Kherson withdrawl\n(Facepalm)",
        "Ukraine, what you as a people have achieved is the stuff of legends.\n\nUniversities and military academies will speak, teach  and analyse this in classes, as courses of what you have done for generations to come",
        "Glory to Ukraine from Finland 🇺🇦🇫🇮",
        "Well done. I'm a Russian supporter but yea. Never mind, you took the city. It's yours.",
        "In your face usa and",
        "Marcos Aguirre substitute for Matt Diaz signing out till next time",
        "To step back and save lives is noble than to step forward and waste the lives of many.",
        "They couldn't keep up against Ukrainian military's pressure, which proved to be organized, well supported and efficient. Good work. Reclaim what is yours and make your enemy regret it.",
        "Don’t misslead people",
        "Make a referendum to make part of Ukraine a NATO member. Slowly until it become whole country.",
        "God blessing Ukrainian",
        "Nice try NATO propaganda, talking head..",
        "Ukraine chỉ cần đánh vào hậu cần của Nga ở những vùng Nga có sức chiến đấu mạnh là được vì Nga đã thiết lập 1 căn cứ rất mạnh và khó tiêu diệt",
        "Good GO HOME",
        "Gloria Ukrainian  people and army keep fighting for your country Ukrainian",
        "Hey Pootie! While you’re losing Kherson, lose Crimea too!",
        "Hardly a setback. Ukraine is losing 8 soldiers to every one Russian.\n\nThe Mongols mastered the art of the feigned retreat. The Arabs did too. ",
        "When did Russia start caring about the lives of it's service personnel?!",
        "Awesome news Soldiers  Keep up your fierce fight and stay safe and strong and God bless you and all of Ukraine.  🇺🇦️",
        "Tell you that when teachers look at their kids they don't see them as different races they see them as their kids",
        "What if russia pulled its army off kherson to nuke it ....imagine",
        "Lord protect Ukraine! ",
        "Sounds like one huge trap to me",
        "leaving an important city like kherson this easy? watch out for treachery! with the butcher of aleppo general surovikin i believe the russians are either going to use a tactical nuclear weapon or if they deem that too risky blow the dam as soon as the udf is in the city the dam has reportedly been prepared for some time! the russian troops remaining may be a sacrifice to to make it seem   real !",
        "Why are they broadcasting their retreat seems suspicious especially coming from Russia?",
        "War is horrible for any Nation, there are no winners end the end. It is just the end. Never give up Ukraine, Never surrender, you got this, God speed.",
        "Slava Ukraini \n\nFrom Kyiv's very proud sister city Chicago.",
        "The words of carrying about his own soldiers are super bizarre, Surovikin is known by being brutal towards the enemy and his own forces. He's also, just like the defense minister Shoigu never served in any forces",
        "we invite you to POLAND",
        "I SENT YOU TO THE SHADOW REALM SO MANY TIMES I DESERVED THE WIN  \n\nwhen is our next yugioh 1V1!?",
        "Man, i really really hope that this is not a trap. Or at least not a trap designed to wipe out the City and the people in it.",
        "Every city that Ukraine regains from Russian forces is another victory against Putin. He severely underestimated Ukraine and each day they fight against Russian forces is another day Putin has failed. Ukraine won't quit fighting for their homeland and are showing the world how strong they are!",
        "Er",
        "A major setback with more to come.",
        "God bless Ukŕain president people and army and countries helping Ukrain helping Ukrain fighting for their  motherland territories  in defense Patriotic brave",
        "Victory to Ukraine, home of the brave and free Ukrainians.",
        "It's going to get worse with upcoming winter. Russian  soldiers morale will drop drastically",
        "Russian people, this is the perfect moment to storm the Kremlin.",
        "Go on my Ukrainian brothers and sisters, Russia go home 🇺🇦",
        "It's clearly a tactical advance by Russia... advancing to a safe distance from Kherson before they nuke it.",
        "Please DONATE winter clothing gear to Ukraine. We need to help them get thru the winter",
        "Propaganda!!",
        "Its not a retreat it's a special boat race across the river",
        "Let's hope the Ukrainians dont allow them to \"politely\" withdraw but have to retreat under heavy fire. The danger is that if they \"withdraw\" they will simple regroup and reinforcec south of the Dhiepro. And repeat their mastery of the art of destruction by shelling Kherson  so well perfected at Mariupol.",
        "\"Huge blow for Russia as it abandons key Ukrainian city of Kherson - BBC News\"\nI think you mean a huge blow for Ukraine, a huge blow to Russia.\nDoesn't anybody here speak this language?",
        "But now Russia got a decent chance to dig in",
        "The world never stops praying for the total liberation of Ukraine from the evil barbarian who hates peace & respect  for their neighbors. Victory is coming soon Ukraine!!! Glory to God in the highest!!!",
        "Justice & truth will always prevails , takes longer sometimes , salute to the spirit of Ukrainian People.",
        "Ukrainian attacks on the Kakhovka dam threaten to flood the entire Kherson area. The Russian withdrawal avoids the possibility of the military grouping being isolated by the flood and limits the impact on civilians, who are being offered evacuation. Far from being a Russian defeat these steps are prudent measures which prevent needless deaths of their own men and local civilians. Things which dont seem to concern Zelensky or his handlers in the slightest. Theres always facts the BBC leaves out.",
        "Ukraine will win the battle BUT lose the war",
        "Tremendous respect to ukraine🇩🇰🇺🇦🇺🇦🇺🇦",
        "A wounded animal is more dangerous, do not believe that Russia will just retreat across the river and not retaliate.",
        "Putin is great",
        "As a Ukrainian lays dying on the ground, I don’t think they are concerned with Russia’s embarrassment. . 🇺🇦🇺🇸",
        "This is absolutely insane. The Ukrainians have been brave and scrappy. They are regaining their country step by step. I only wish the war can end asap so that people can go back to their normal lives. Russia needs to surrender. They have no international backing, their economy is barely staying afloat, and politically they face potential for coups. I wish the best to all people in both nations in the comming days.",
        "Is it wise to televise their tactics, equipment they use, where they get it from and how they're conducting their overall operations? I mean its interesting but how does this help Ukraine?",
        "This withdrawal would be a major blow for Russians.",
        "How can I volunteer myself to this war?? let us defend Ukraine with one heart",
        "Go home Russia",
        "Abandoned or got its ass kicked by Ukrainians?",
        "Kherson is strategical absolutely not important..U understand??",
        "General SUROVIKIN.  Be the hero in world's History. Get rid of Egomaniac , narcissist Putin and stop the war. You are the only one who can do it.",
        "Glory to Ukraine! Glory to the Heroes! ",
        "It shows standard of Russian standard of SUUUper power. Now this is the the time weakness of Russia take on !",
        "It’s all a game by west,,, because they need Gas and russia is ok with it ",
        "Es increíble que Ucrania le este ganando a Rusia, pero es debido a todas las armas y  la información que le han proporcionado a los ucranianos. Pero de una manera u otra están obligando a Rusia a utilizar armas nucleares.",
        "It is not barrassment for Putin ordering his troop to withdraw before defeat than after defeat.",
        "Good actor's ",
        "BBC ",
        "No, it's not a huge blow it's a difficult but necessary tactical decision and, unlike the withdrawal of US troops from Afghanistan, Russia put the lives of civilians first and foremost.  Well done Russia.",
        "at 5.25 min one word RELAPSE",
        "Like how the propaganda spreads.",
        "Great.! May God bless Ukrainian soldiers to win Vladimir Putin's troops soon as well as starts to fight to retake Crimea back..",
        "Never before Ukraine/Ukrainians were so positively popular and highly rated worldwide.  Now, finally, the world knows this great People.   I'm very happy and proud that this amazing Nation is part of the European Continent.\n\nGlory to Ukraine!!",
        "Russia vs USA,  NATO and Ukraine. Love for Russia🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩.",
        "🇺🇦 🇹🇼 🇪🇺 🇺🇸 ",
        "Nonsense",
        "the ukranian people are the embodiment of what is correct and morally acceptable",
        "Why would a general remove ALL his troops from a region? Not even a tyrant would annihilate his own men,",
        "Yep don't fall into their traps stay alert at all times soldiers. Also watch around every where as the enemy is changing position and attacks",
        "Be careful",
        "Its a trap",
        "It was probably the best move they could have made. It was just a needless source of attrition without the resources to exploit the bridgehead. They will pull their paratroopers out then man the river bank with some of the newly mobilized. This is not the great thing everyone says it is. It actually refines Russia's capabilities. I fear invasion from Belarus and a re-opening of the Kharkiv front after another round of mobilizations.",
        "I had a dream about this don’t believe them yet please",
        "Didn't they say they where withdrawing some time ago? if its pre planned its not a blow lol",
        "I wouldn’t think so presumptuously that this is a “retreat,” rather it is reasonable to be on guard. With Putin making nuclear bomb threats, I would be asking questions wherein these two concepts are their basis.",
        "Always good to hear Jeremy's reports.",
        "🇺🇦🇬🇧️",
        "If Ukraine has had 1/3 of the US armaments with intelligence know how, the war would has been over overnight..",
        "doesn't look very key to me, more peripheral than key, another feint by the russians, like kiev",
        "🇺🇦️",
        "They've not abadoned Kherson. It's a trap. Russians are leaving but lots and lots of Chechens with civilian clothes are in Kherson city patrolling there as we speak. Kadyrov just said he has a surprise for Ukraine in Kherson. The announcement of retreat and willingness for negotiation are for Ukr to let down their guard",
        "After the atrocities were uncovered in Bucha when the Russians were driven out by the Ukrainian forces, I would not be surprised to hear that the Ukrainian authorities find even more ghastly atrocities carried out in Kherson, since that city was held the longest by the Russian invaders. May God bless and save the Ukrainians fighting for their lives and freedom to exist.",
        "NATO forgets the Humuliation it faced in Afghanistan . We still & forever support Russia 🇷🇺🇷🇺, love from India🇮🇳🇮🇳",
        "Abusing innocent bridges to advertise a videogame!? This won't be forgotten Josh...",
        "Con amor a 🇺🇦 desde 🇵🇷.\n\nSlava 🇺🇦!",
        "I'm so happy! Slava Ukrajina!! 🇺🇦",
        "Somehow….. I think the Russian media may have a slightly different take",
        "Assumptions and lies. Period.",
        "I'm glad they pointed out the military skill a proper retreat requires. A fighting retreat is one of the most difficult military maneuvers one can attempt. It requires top notch, composed tactical commanders who also importantly has the faith of his men. If the men don't believe the commanders are capable disorganization will quickly set in. As stated Russia's military has demonstrated no ability to maintain the necessary cohesion for a proper retreat.",
        "Theres is GOD",
        "Oh god they are just waiting for  the winter remember 1942",
        "The Ukrainian people of this era will be remembered as legends. Keep fighting the good fight.",
        "Real journalism, no activism, really nice",
        "️🇬🇧🇺🇲",
        "BsB news lol ",
        "I remember a friend of mine being scared to fight the Russian army. I'm pretty sure he changed his mind when he saw how incompetent they were.",
        "American tax dollars at its finest",
        "This war has been one long humiliation for the Russian army and it's far from over yet lol",
        "Strategic move considering winter is coming.  One call could end the war, Ukraine can do anything they want just don't join NATO.. thats Russian views.\nWest benefits supplying weapons, breaking Russia etc. BUT innocent people are suffering and world wide impact.",
        "So sorry to hear of the Generals fatal accident ... tomorrow",
        "May Russia pay for all lives lost & to restore what they have destroyed. May Putin be tried at the Hague. Slava Ukraine.",
        "Why does BBC not pronouncing \n‘Kherson’ correctly, like the Ukrainians do?",
        "Ohhh anyday now.  Russias just holding back aaaaaany day now they'll  crush Ukraine. ... any day.... mean ...this time...  ... yeah. .\n\nSoooo....           nice day huh..     whistles",
        "Why not annihilate the kremlin at the very least? I still don’t understand the restraint",
        "We pray for Ukraine day and night - We love you, Ukraine, and pray for your victory and peace!!",
        "Who can believe in  them or Putin????",
        "I understand that the city of Kherson is divided by the Dnieper river so , no ; the Russians ara abandoning the half of it that they cannot defend . There is still the other half I think.",
        "There is one thing to note - the civilian population was evacuated; the city of Kherson and the region is subject to flooding should the dam up river be destroy - I wonder why the Russians evacuated the people from the city?  Gee that is a puzzle.",
        "Bro pressed Q and killed half the team  So much skill",
        "Why would russians think this is a set back? There are so many things that could have been done within real Russia. \nNot everyone approves of theft.",
        "Despite all the rejoicing, this must be met with extreme caution by Ukraine. I just don't trust the Russians, especially when the make a spectacle of it on TV. They are so clumsy. My heartful good wishes to the Ukrainians who are the heroes of this age.",
        "Hopefully this senseless war ends so that soldiers from BOTH sides can go home to their families.",
        "I don't know why but there's just something so entertaining about watching two grown men start a monopoly war over virtual potatoes",
        "In war, there is no winner or loser, let's live as brothers and sisters, say no to war.",
        "Haha... obviously a trap..",
        "Amazing how Russia has been dug into Kherson since feb and pushed out in a matter of days.  Way to go Ukraine",
        "Does anyone know how putin can sleep at night?",
        "Russia's army is as useful as me after a 16 hour shift a a few spliffs",
        "This benefits both sides it is not a loss for russia as they are sending troop elswhere",
        "Actually the Russian army still in Kherson but they retreat to other side of the river they still controll half of Kherson.",
        "Remember these Ukrainian soldiers! People will still be talking about the golden generation of Ukrainian fighters in 100 years from now",
        "Prove it",
        "It's about this time Putin will start negotiating with his US counterpart for peace.",
        "Thank you ally for your help️ Dnipro UKRAINE 🇺🇦",
        "Bullies, always are cowards.\nDo not own their failures, actions, are masters at scapegoating.\nHowever, they still want to be leader of the gang",
        "Western Warmonger propaganda machine barking .....!!!",
        "They knew they gonna lose the battle in Kherson therefore,they don't have an other option.",
        "Heart warming",
        "Very soon pain, sorrow and death Will be No more thanks to Jesus Christ Sacrifice.",
        "The problem for NATO mercenaries is how they will hold Kherson, empty of people and vulnarable to russian air/missile attacks of ukrainian supply lines and front line troops .",
        "Im confused about the russian troops trying to get out when clearly they hold the city at that time, albeit under attack and all the lands between it and safety ie the lands behind it that it already holds.   Tactical withdrawal at best, until the land freeze deep enough for those heavy tanks to go over and not get bogged down, in that 3-4 meter top soil that makes the land so productive.. when its wet and be easy pickings.     Some have said December is when that happens.  So no need to waste excess troops defending a pointless bastion in anything other than name.  ",
        "Everything is cool, but their faces in the moment when general Surovkin tellin' em that they must to retreat...  Priceless.",
        "I know Ukraine must tread carefully but at the same time Russia is likely overplaying this to create suspicion - if Ukraine delays then more Russian forces can withdraw in good order.",
        "This might be a moral blow to Russia but tactically speaking this puts Russia in a better position. Ukraine could have secured a much more significant victory and captured a significant amount of troops if they were able to siege them there and prevent supplies from reaching them.",
        "They are leaving because they left things behind. NO way sadamir has not instructed his expendable meat to leave nasty gifts behind much less the loss of face for losing such a prize city.",
        "Until the fighting stops and we can see what’s actually happened, we will be fed nothing but propaganda. Be the adult, sift through the garage and be open minded.",
        "A big salute to Ukrainian army. Keep defending your nation. This is the fruits of not giving up. Putin's over confidence is causing a big shame to Russian people.",
        "Now amongst the best fighting force in the world, a nation only forced to be so to remain one of the most peaceful people I know ️️️",
        "It’s not a retreat, they’re advancing backwards",
        "Surovikin did the right thing for the Russian forces. It's the long game.",
        "He's got all the advantage he's got technology in the side money on the side the government inside the people on the side all I have is me and my cell phone in my Bible",
        "Good decision,,",
        "God bless Ukrainian ",
        "Nobody cares about Joe Biden ",
        "Great job Ukraine ",
        "Stupid propaganda I watch yutubers directly from all the places of the conflict of diferent countries who have no interest of one side or another but to find the locals feelings and opinions.",
        "Ukrainian forces must be careful. Why would a theft will announce that he/she will still something. This is too obvious.",
        "Putin will come out and say it’s a tactical retreat.",
        "Gosh I loved kratos moment with TyrPULL YOURSELF TOGETHER, MAN!!!",
        "I really wander why these guys keeps on withrawing from place to place despite their massive fire power",
        "Putin is a Judo Master with a black belt. The core of the philosophy of judo is maximum efficient use of energy - Seiryoku Zenyo. Judo teaches you not to waste your mental, physical and spiritual energy on things that do not accomplish your goals. Winning battles never mattered- overwhelming your enemy by inflicting more casualties than they could replace is what mattered and Russia is obviously choosing where and when it wants to fight on its terms. Basically Russia is playing a long game while the Western politicians are exploiting the conflict for immediate political and economic gain and short term interests.",
        "Nowhere near what we bandoned in Ghannystan.",
        "UE",
        "haha, Ukrainian, I thought you're not a poker player ",
        "wow .  great news",
        "Imagine. The first truth Putin has ever uttered.’we are defeated in Kherson ,lets run.’",
        "Blessings to Ukraine 🇺🇦  Russia has lost the war already",
        "Don't behave as if it's the first time Russia is doing it and we all know what follows after such moves.",
        "How much is this costing the USA .",
        "Get rekt russia",
        "Astonishing, these similarities of behavior of Wladimir Wladimirowitsch P. with Adolf Schicklgruber's (alias Hitler).\nAs a German, I am so grateful to the allies to have freed Germany, and above all, Europe from tyranny, alas, not all of Europe yet.",
        "lets see if this is a huge blow in feb 2023.",
        "I have the honor to have two friends that were teachers when I was a kid and they were true friends . They were patriots and fought for this country",
        "\"Forever didn't last very long, did it?\" Wow. Just wow.",
        "Love one another as I have loved you Jesus said. And if you love me you will keep my commandments ️nkjv ️",
        "Ukraine started liberating Kherson 3 month ago when they blew the bridges effectively sealing the invading Russian fate in that area...slow strangulation..not a good year for Russia but getting brighter everyday for the Ukrainians if this trend continues!",
        "Slava Ukraini !!! Europe , or at least the GOOD part of Europe is with you .\nHeroyam Slava !!",
        "Send another 100 billion so they could afford non-Chinese drones and a laptop with more rams.",
        "Great work Ukraine !",
        "Russia is failing so hard!  Hilarious. #PutinWarCriminal\n\n Slava Ukraine! ",
        "I",
        "The Russian troops are preparing for their next objective: they prepare to invade Moscow!!",
        "Beautiful. Great Ukrainian engineers \nThere are countless examples of their grandiose work along more than a millennium!!  (*Yes, Ukrainians are much more ancient, centuries older, than ruSSia's existence).\nThe worldwide known Antonov is just one example among many others!",
        "Unlike NATO and its allies, Russia actually cares about their military personnel, and this is a military strategy. When an army takes less losses than the enemy it's called a win through attrition. Something that non-military propagandists know little about.",
        "Why should Russia troops get safe passage when they bombed Ukraine citizens trying to leave they didn’t care why should Ukraines",
        "We all know its a trap.",
        "Respect from Germany to Ukraine, Ruhm der Ukraine! Слава Україні!",
        "Go Ukraine untill you captured your old territory Chrimea",
        "Are you sure that’s why they are retreating?",
        "While I understand Russia's position in response to NATO mobilizing at their doorstep, I cannot but feel happy for the continued successes of the Ukrainian people in liberating their country of foreign hostile occupation. \nIn the future you should take a few lessons from the US and how it spreads and maintains its imperialist influence while keeping up a facade of spreading \"democracy.\"",
        "True heroes, the defenders of Ukraine are",
        "Good bless Ukrainian sending llove from Philippines 🇵🇭",
        "odear , how sad , never mind ...........",
        "Even with minor gains, we should all be cautious. That's Russia, they are still a threat, they will always pose a threat.",
        "BY 2025 correction",
        "God bless and protect Ukraine",
        "or keep retreating again",
        "Slava Ukraini 🇺🇦🇦🇺",
        "Can I get a pog champ",
        "Kherson City is not a \"regional\" capital.  Kherson City is an Oblast capital.  Oblast translates to Province.  Why does the media have a problem with using the words Province or Oblast?  Regions are smaller administrative divisions within an oblast.",
        "I can feel the view of the suspicious Ukrainian soldiers: healthy skepticism.",
        "Huge blow?..thats pathetic compared to what they did to Ukraine..stop telling the wotld that Russia is losing the war..",
        "Russian tactic: retreat, scorch earth and lure the enemy to a trap that defeated Napoleon and Hitler.",
        "Be careful. Russian moved a lot of people out of Kherson and now saying withdraw their troops out there there, possibly that they wait for Ukraine troops come in and trigger a nuclear.",
        "Glory to Ukraine 🇺🇦 󠁧󠁢󠁷󠁬󠁳󠁿",
        "We're looking of all safety & in the world's peace and economic.",
        "We rules on our knees and we win at the battlefield,in Kenya we stand for peace and prosperity of Ukraine",
        "Glory to Ukraine from Qazaqstan 🇰🇿️🇺🇦",
        "Slava Ukraine. Bravest people on the planet. They are an inspiration to the rest of the world how to defend, stand up to and defeat tyranny and oppression from evil warmongering dictators.",
        "Apex does a similar thing that I think is really cool, they also give you 400 free premium currently each season so eventually you can get a battle pass if you grind or get it cheaper",
        "Poland Winner ",
        "3:00 \"Russians don't allow independent journalists to enter there\" lmao, you BBC guys are not independent media you have taken a side in the conflict you are on Ukrainian side, and while I support that side, you cannot say that you are independent media, the only ones I saw that are truly independent media in this conflict is Al Jazira they try to give reports from both sides with as much objectivity as they can",
        "God Bless Ukraine, and the Ukrainian people, Love from the Philippines 🇵🇭",
        "Knowing Putin and the Russians, this \"retreat\" is a ruse.",
        "Born and raised in New York City during the height of the Cold War. Bomb drills were a constant in our public school system during that time. In my mind I always thought Russia to be a formidable military power. Judging by their conduct in Ukraine… They ain’t shit… Hang in there Ukraine, you got this… 🇺🇸 🇺🇦 🫡",
        "Glory to Ukraine",
        "ওওও🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩",
        "The fact that YouTube is giving us techno videos that means that he still wants us to watch his videos over and over again even if we get bored that will never change. Techno you will forever be missed rip king",
        "Hope the NATO decides not to declare a war as Russia has the most nuclear bombs.",
        "Bravo!\nAvante Ucrânia.\nTem que varrer todos os inimigos invasores. Logo,logo vocês chegarão na Crimeia.\nTenha força e ânimo.",
        "The whole world is with you. Fight on guys.",
        "Russia already won 🇷🇺🇷🇺",
        "They need to paint the bottom of the drone blue-gray so it would be harder to spot in the sky.",
        "It will be mitigated by those corrupted by pride and greed.   They will destroy something that does not belong to them,  and something they can not have.",
        "What are they exactly going to occupy and liberate?     Rubble ?",
        "Special military retraction",
        "\"For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.\"   \n\n -John 3:16\n\nGod gave us his only son Jesus Christ who Lived a sinless Life then died on the cross to endure our punishment, he rose again on the 3rd day and is currently seated at the right hand of God the Father Almighty. ",
        "I don't like this war, regardless of why it started I'm ruling for Russia, I love Russian people specially Russian girls \ngood luck Russia",
        "He getting supplies",
        "I would send money if I had it I have prayers though!",
        "If this is true (and not some Putin ruse), this is THE best news I've heard in weeks!  With Kherson back under Ukrainian control, it's going to be EXTREMELY difficult for Putin's forces to maintain any presence west of the Dnipro River.  So, hopefully, that entire region will soon be liberated!  That sociopath in the Kremlin had better stay away from anything higher than first-story windows from now on.  Slava Ukraini!",
        "Well yeah why would they nuke their own troops? Of course they pulled out of there.",
        "Hey BBC, how about you don't give away Ukrainians War fighting techniques, ff$.",
        "Lol..that \"drone MADE IN CHINA\" was definitely a dub over and the original more likely \"drone PROVIDED BY THE UNITED STATES\"",
        "Whoo hoo UKRAINE ️ FROM USA",
        "Russia as super power lost this war very long time.",
        "Can’t say it’s a retreat til we wait and see. Could be a withdrawal to completely level the city",
        "This may not be a withdrawal.  This may be regroup.  When did Russia ever withdraw willingly?\nDuring this entire war Russia has never withdrawn without some major retaliation.\nThis is the country that said there would be no invasion and on February 24 did the opposite.",
        "Mark muttering random stuff and Bob & Wade laughing at the chaos perfectly describes the relationship they had on the channel for around 10 years ^_^",
        "i applaud the general for finally considering the soldiers lifes higher than putins senseless war",
        "Slava Ukraine! from South Korea 🇺🇦 🇰🇷",
        "Great news, Slava Ukraini 🇺🇦",
        "Best of luck to you all.",
        "Kherson is in the grasp, onwards to Kerch!",
        "Tourism should be the great way to lift up Ukraine, yes when things will “normalize” we’re heading to Ukraine DEFINITELY - PEACE WILL ARRIVE WITH ALL EUROPE /WORLD AS ONE FOR UKRAINE…",
        "I still don't want to believe it.\nI find myself watching your old videos everyday still... Miss you so much man. Thank you for everything you gave us. The years of laughs and entertainment.\nTechnoblade Never Dies",
        "I don't believe that Russia would just give up.  They've done or will do something there.  I'd be scanning the area using testing equipment.  Could the Russians have left an atomic, biological or a chemical bomb?  That remains to be seen.",
        "We are both on the race against Time. Him to kill me before somebody believes me. And me to get somebody to believe me before he kills me",
        "Withdraw is tactical not defeat they will advance through winter",
        "God blessed Americans! ️",
        "Yes, GOD IS STOPPING THIS HIMSELF",
        "This channel can lie.\nWhy is Zelensky saying different things?",
        "These guys are very clever you have no idea what they're capable of you have no idea the technology that they have we're at their Mercy",
        "Who knows it’s not like the media don’t lie",
        "Wow, Russia really really cares for their soldiers. Such a loving and caring country.",
        "6:49 ooooooh what a roast for Putin!",
        "We need to understand that being at the top of the pyramid of creation means that everything we do trickles down the structure, from top to bottom. When it reaches the bottom, the inanimate level of reality, from which everything grows, it changes it. If we ooze ill-will, it creates negative changes throughout the system, which manifest in increasingly extreme climatic and geological events.",
        "Russia has a strong military, but the soldiers are weak and not willing to fight. Russian are against the war, if Russia can't defeat Ukraine how much more NATO and US and its alliances",
        "Should have attacked retreating barge and convoys... these russians will come back and will cause more damage if ledt to regrouo...",
        "В России сила и правда",
        "https://youtu.be/Ai0dxayi3zU  new footage!",
        "This sounds too good to be true, I would tread very carefully if I were the Ukrainians as I'm sure that Russian forces will have laid a lot of mines/traps behind",
        "love you",
        "Awesome news love to Ukrainian hero's  stay safe God bless .",
        "I don't think Kherson can be secured until the Kakhovka dam is safe.\n\nEven if by some miracle the russians regains enough scruples to not blow up the dam, they will cut the power to Kherson. ",
        "i dont care who wins anymore, just get it over with already!",
        "This may be a tactical move.\nThat in itself does not mean it's a defeat. How silly to call it such",
        "Distancing Putin from this failure: Because a \"strong man\" cannot be strong, can never take responsibility. Weak, pathetic Putin.",
        "Stop with the fake narrative",
        "Gen Armageddon has never smiled...\nIf anyone has a smiling picture  of him, it'd be worth millions of Rubbles",
        "Once again Russia is humiliated.",
        "My brain  child  \nRight now CM of Tamil Nadu india 🇮🇳is giving free electricity connect orders for farmers here ( karur) this is because my writing on my walls in our city buildings. They watch all my writings on my wall  and make use of it. ",
        "We feel elated at Ukraine's successes but don't realize the amount of pain and suffering experienced by them.  After the war documentaries need to be made to highlight this so that the world sees the horrors of war.",
        "Ok but I hope the Ukrainian Military still stays vigilant, Russia simply \"withdrawing\" away from such a key city (A city which would totally help its key ambitions) is strange",
        "“The Russians don’t allow independent journalists to operate there”  idk bud Patrick Lancaster is allowed,  and I’ll bet the  UK’s official propaganda channel is allowed too but who knows because you just made that up.",
        "The culture ️️ of Ukraine 🇺🇦 will prevail ",
        "One more thing to keep in mind for the so called witdrawal : One more thing to pay attention to in relation to the Russian 'concerns' for Ukrainian citizens Since when do the Russians care of the Ukranian civilians ??",
        "1Thessalonians 5:1-3 let them cry \"Peace and Security\" !!!!",
        "The river should be the border for Russia and Ukraine and need no bridge across the river",
        "Respect to the fallen Heroic AFU!  Legends Never die!!!  Salutations to  UKRAINE!  HEROES 🇺🇦🇺🇦",
        "The attack on the Kerch bridge must have played a key role in the damaged supply chain of the Russian army in Kherson!",
        "Victory of good over evil.",
        "Much respect from Ukraine much love from Kenya 🇰🇪🇰🇪🇰🇪🇰🇪",
        "Keep it strong my ukrainian friends ",
        "Keep going, all the way to Moscow.",
        "Why should they leave it? It would contradict everything they did so far.\nIt is also known that they amassed special forces in that area and artillary batteries around the left riverbank to be able to do conentrated shelling of the area around Cherson that Ukrain would have to advance through.\nAnd then they left their well build defence-lines? ",
        "There is no way Russia attempts to negotiate for a safe exit for those guys, that’s an omission of weakness and Putin isn’t going to do that. Putin would rather that they die fighting their way out and take yet another loss than admit he lost and appear weaker than he already looks.",
        "Excellent presentation in simple English. Thanks.",
        "Imagine the tanks and stuff left by the Russians.",
        "People don't realize that this is a very minor change, it makes total sense to withdraw troops to the east of the city to make supplying easier. Don't be fooled by this minor \"win\". Ukraine still has a lot to gain back in this terrible war...",
        "Is the war over now and Russians back to Moscow?? Why are they afraid of a trap if actually they are driving the Russians out of Kherson??",
        "WHERE THE F*&K ARE THE WESTERN MEDIA?! Rant from Lugansk (yt)",
        "6:50 lol )",
        "Most of us expected a large scale battle or a battle of some kind in this city, what a let down to see Russia shamefully retreat in the face of Ukrainian might.",
        "A while ago Techno said he would race Dream to 50 mil. The race is still on even though he passed 2 months ago as of writing this. Gentlemen and ladies, we have work to do.",
        "Glory to all countries helping Ukraine to fight russian fascism! \n\nGlory to Ukrainian Heroes! Glory to Ukraine! Слава Україні! Героям Слава! Слава ЗСУ!\n\nUkraine will win!",
        "This is the future of artillery using drones to get a firing position with great accuracy ,Glory to Ukraine!",
        "he was the god we didn't deserve thank you techno for everything hope your doing better where you are now !  =(",
        "Glory to Russia 🇷🇺🇷🇺🇷🇺",
        "great news! stay strong Ukraine!",
        "дЛЯ КОГО УДАР, ДЛЯ КОГО ТАКТИКА.",
        "At some point, no matter how disdainful it is, negotiations will have to take place.  Russia is not going to be annihilated nor is it going to be driven out of existence.  Let's be for real, a cornered animal is the most ferocious.",
        "Russian soldiers still think like poor Serfs, they follow their landlords blindly, without questioning ",
        "The Ukrainians are extremely impressive in every aspect.",
        "I hope this is not a trap. PUTIN won't quit  ( he is a mad man)",
        "Slava Ukraini!! 🇺🇦🇺🇲",
        "Congratulations ukraine you will win this war there's no doubt Russia offended you illegally and they will face the consequences 🇺🇦🇺🇦🇺🇦",
        "So they are abandoning Kherson because they are more concerned about the welfare of their military personal .",
        "My utmost respects to my ukrainian brothers and sisters. Glory to ukraine!",
        "That’s a good one . Blow on Russia. Next Ukraine defeats Russia, Russia retreat Ukraine invaded Russia…this channel is very believable…",
        "God give them victory ️",
        "One step closer to the end of this war and a Victor for Ukraine and her people.\n\nAlso, I don’t think Russia can evacuate 30k troops from that city without the cooperation of Ukraine because Ukraine destroyed all bridges and the ferries can’t operate without constant harassment.",
        "But for Kiev to have 'lost' Kherson city and oblast so easily in March was more humiliating than Russia forces announcing withdrawal, some reasons for it and why civilians were offered evacuation to Zaporizhzhia or Crimea.\nRussia is better at stagecraft than Ukraine's media oligarch martial law ruler in his bunker using a green screen to be in two places at once.",
        "“We’re not retreating we are just redeploying to a more advantageous spot so we can continue the battle.”",
        "Now be careful, my chef on work told me when the Russians are retreating there might be a possible chance that they will start throwing nukes...",
        "If the dam breaks from the Ukrainian shelling there will be massive losses of civilians and troops. That was one of the reasons for the evac.",
        "This is what we called gorilla warfare  or in other word. Autumn warfare. The leaves fall one by one. Two or three leaves fall here and there. Eventually, all the leaves will all fallen from the trees. This is what happened to Russia in Ukrain. Then the Soviet invasion in Early Afghanistan.",
        "Ukraine has got no chance of winning this. Britain should keep their noses out and start looking after their own homeless",
        "As a US citizen I used to watch the BBC geopolitical coverage for information. Sense the Brexit I have quot watching.  I am here now only to give this comment.  I quit watching when I caught them to me more than I could accept.",
        "Friends, before we put any comment on this platform, lets pledge to overcome both western and eastern propoganda and see things in a rational way.\nThanks",
        "NO safe passage......... Fight your way in....fight your way out...",
        "god save ukraine",
        "1:10 some Ukrainians must've been playing a lot of PUBG before this war lol",
        "Russia 🇷🇺 frever",
        "\"Until the Soviet Union collapsed in 1991, Ukraine had never been  an independent state.\" Ever\n\" Borderland: A Journey Through The History Of Ukraine\".1999\nEthnic Russians lived on this land  long before Bolsheviks created the Soviet Ukraine  in place of  Southern Governorates of Russian Empire,  Bolsheviks created Ukrainian  Soviet Republic  in factitious, artificial boundaries , with Russian speaking area included in it with the following forceful Ukrainization of Ethnic Russians.. Territories  such as Donbass, the industrial hub of Russian Empire, the Coastal Black See area, with its cities and ports such as Odessa, Kherson, Mariupol, Ochakov have been developed and built  by the Russian Empire after annexation of Crimea in 1783,  when Ukraine didn't exist yet. Ukrainian Soviet Republic was created by Bolsheviks as an integral part of the Soviet Union in 1922 after Russian Revolution  and Civil War. ",
        "This will make it into every history book. A small country, almost overrun, defending against a Goliath.\n\nThe Ukrainians can be so proud of themselves achieving one of the greatest achievements in war of the modern age!",
        "The cultural, language problem, Ultranationalist Policy  was behind the conflict in  Ukraine. Historically Russian Donbass, Mariupol, Odessa, Crimea, Ochakov - the Coastal Black See area, the \"Kharkov People's Republic\"- the short-lived Republic, proclaimed in Kharkov on April 2014 by protesters - they did not accept \"Maidan Revolution\" which \"promoted\" the  extermination of Ethnic Russians in Ukraine.  ",
        "Glory to Ukraine from Iceland 🇮🇸️🇺🇦",
        "It’s a trap",
        "Yes, truly there is 'no tyranny of circumstances that can imprison a determined will.' Ukrainians, please just keep on fighting, the world is with you.",
        "Look at the face of the Russian general, he looks constipated",
        "What does it mean for Putin ? Well a victory of course. He used his brains to save lifes of his soldiers. We should applaud !",
        "When 2elensky's regime lost Kherson, BBC was silent. ",
        "Ratatoskr: \"There's no reason to expect hostility so long as they're left in piece\"\nJack: tries to hit them with his axe",
        "Why is he still around ????",
        "From USA: keep up the fight Ukraine! You are in our thoughts and prayers.",
        "They are using the river as the next stage of defence.",
        "Praying for Ukraine🇺🇦",
        "Don't ever say never.",
        "You might say they are \"Russian\" to get out.",
        "Currently Ukraine 🇺🇦 is only nation in Europe who pays with life for democracy and freedom!",
        "слава укрïнса!!",
        "Glory to Ukraine 🇺🇦",
        "The future is what the Ukraine has to worry about!",
        "Can't wait to hear the Orcs spin yet another flying turrets spec mil operation BLUNDER!",
        "May this be a good sign for Ukraine 🇺🇦",
        "May long live RUSSIA",
        "The Ukrainians are making brilliant use of drone reconnaissance, and they might just have some friends with really good satellite reconnaissance to share. Slava Ukraini!!🇺🇦🇺🇸",
        "Come on then Russian bots, what's your excuse this time  for the Russians to just withdraw from the only major city they've captured in the war without a fight just proves there are INCREDIBLY serious deficiencies in their army",
        "Hopefully they don’t do the same thing they did in Kiev back in 1941",
        "DOES IT OCCUR TO ANYONE THAT THE TROOP MOVEMENTS MIGHT BE CLEARING THE FIELD FOR MORE HORRIFIC EVIL?",
        "Putin:where yawl going?\nsoldiers:uh lunch break yeah lunchbreak.",
        "Praise the Lord. I hope this war ends. I hope russia will mind her business and not violate other states",
        "i feel so nervous for Ukrainian defenders.\nwithout any collateral to damage, would the ruZZ now use the N word weapon? this could force the Ukrainian to spread out and thinning its force thus make it easier for ruZZ to launch another offense?\nmy imagination is running wild, i hope.",
        "SLAVA UKRAINI!",
        "Remember when Drumpf called putin a genius?",
        "Z is on the run.",
        "Slava Ukraine! Love from 🇨🇦",
        "But Ukraine Kiev is pitch dark. Ukraine claims that 69 out of 70 missiles were successfully intercepted, meaning that 1 was passed by the anti-air attack system.",
        "Sure........fake news.......",
        "The Russian troops would have more food if certain Russian generals stopped eating said food.",
        "Great fricking work Ukraine 🇺🇦",
        "Aa",
        "As Russia's humiliation, defeat and with severly broken morale, and being in a massive shortage of weaponry, Ukraine is going victorious, strong, keeping its head up, having a massively huge morale, and getting ALOT of weaponry, it is crystal clear as to who will come out of this war victorious. GLORY TO UKRAINE! 🇺🇦",
        "I keep on praying for Ukraine… LORD Have MERCY!!!",
        "If you would say every time Russia is withdrawing their troops that this is \"embarassing\", you just set up the stage for him to go back fighting. \nI think its wrong to phrase it that way. \nI think its good decision for them. They are saving their soldiers lives. And admitting to themselves, that they are unable to fight. You dont want to humiliate your opponent like Germans in WWI, becouse you would set them up for another war(WWII). You want to force them to withdraw and make borders strong so that they dont attack again.",
        "Go to  iEarlGrey yt channel.",
        "Please keep the faith, Ukraine!",
        "There's a reason for everything as to why Russia has retreated from Kherson. None of us will know why until the it happens. There's worse to come and Ukraine military will most likely walk right into a trap or it could be something far worse, possibility of nuclear war",
        "Just came back to this video to hear the voice again, crazy how you can miss someone you didn't know this much",
        "Tbh, abandoning a position that no longer benefits you is better than continually defending it. \n\nI learned this one when playing Total War medieval 2. It is better to trade space for time.",
        "no money \nno subtitles ! \nbye bye bbc !",
        "Can the Russian troop really don’t have the mean to jam a cheap Chinese drone lol",
        "Glory to Ukraine 🇺🇲🇺🇦 Keep fighting! Stand with Ukraine 🇺🇲🇺🇦",
        "lol, you are independent ofc :D dependent on uk goverment and western point of view :D",
        "Well done Ukraine! 🇬🇷🇺🇦",
        "Might want to go in there with a team and Geiger counters first. I wouldn’t trust them as far as I could throw them.",
        "Like,.... isn't it because they're about to drop a 'special bomb'?  I passionately hope not.",
        "Victory to Ukraine 🇺🇦",
        "Why doesn’t the map show Kherson regained/limited Ukrainian territory?",
        "What the Ukrainians have accomplished against all possible odds so far is just unbelievable and already legendary!\n\nThis war of brutal, disgusting, plain evil yet absolutely ineffective and unsuccessful russian aggression will be remembered, studied and looked up to for centuries to come.",
        "People dying needlessly should never be acceptable!!! Peace agreement needs to be made!!! Please read this message as it has eternal consequences for all:\n\nCan you be certain of where your Soul is going after this lifetime? There is awesome news! We can be certain.",
        "Will get them safety like Brittney griner. Put them in a penal institution and  get their mind right.. get some free Siberian labor",
        "jak rusy uciekli z hersona pieszo?   na moscie  jak i na barkach pod nim  niema ani jednego zniszczonego pojazdu ?!",
        "Glory to the heroes glory to Ukraine ",
        "Slava Ukraini ! Victory from CA.",
        "Thank you for pronouncing the city’s name correctly! I have nothing against people pronouncing it as K-erson emphasising the K, but it is nice to hear it pronounced correctly.",
        "Kherson is city where Prince Volodymyr(Vladimir) was baptized into Orthodox Christianity, so tremendous significance to Kremlin’s narrative that they are Rus’.",
        "Stand with Ukraine 🇺🇦",
        "Russia hopes for a harsh winter because they are used to it, they're need time to restore the army.\nBut the question is whether the Ukrainian army will give recovery time because Ukrainians are also used to harsh winters.",
        "Absolutely you are right ️️",
        "Russian forces do not loosing anything!!\nYou can say much more politely:     !\nUKRAIN TAKES BACK ITS CITY OF KHERSON!!\nAre you all drunk!?",
        "Run Ivan, run!",
        "Putin needs to un-annex Kherson, time to sign that paperwork!",
        "BBC tell them how that land is olde Tartaria Minor... the Greeks called it Tartarus Minor... the entrance to the underworld. All of you need to study up on ancient history this whole thing is so deep.",
        "They are getting their soldiers out and than do something far worse instead. But we'll see.",
        "Slava Ukraini! With love from Brazil 🇧🇷",
        "Glory to Ukraine!",
        "Exactly what was expected of western media. Russia is not withdrawing from anywhere don't be fooled",
        "What about sending Night Vision equipped Drones to obliterate Ukrainians?",
        "so saving civilians and troop's lives is a huge blow now?",
        "Uncle Fester hasn't a clue. Good for Ukraine!",
        "A good General that protects its soldiers",
        "God, look at that generals face lol. Tell you all you need to know about Russians.....",
        "Congrats to Ukraine from Serbia! 🇷🇸🇺🇦 Слава Украјини! ️.",
        "Hahaha, pure propaganda!",
        "AMAZING!  GENERALS TELLING THE WORLD WHAT THEY ARE GOING TO DO!",
        "🇳🇱️🇺🇦️🇺🇸",
        "Keep pushing them out of Ukraine. SLAVA UKRAINI! The Ukraine does not need NATO. NATO needs the Ukraine. A truly honorable and Noble people.",
        "Gullible people it's a tactical move, go Russia 🇷🇺 go",
        "False news we are still based all across Ukraine",
        "I think Russia is trying to show it is not completely and utterly tactically devoid and that it can make decisions that even if they look bad, are the right call because otherwise could be another disaster. It shows Russia itself that it is not beaten but choosing to withdraw and it shows it's troops they are not cannon-fodder to be left out to die.. even if that is likely what is happening in some areas anyway. Smartest thing they have done yet.",
        "God bless for Ukraine !!! Love from the Vietnam !!!",
        "from Bulgaria - Glory to Ukraine and its Heroes!!!",
        "Is the Russian retreat/withdrawal a pre-curser for a dirty bomb explosion?",
        "Russia definitely left snipers behind."
    ],
    "comments_disabled": false
}