{"video_id": "L5PBWlDIz90", "comments": ["It's not a retreat, it's a \"special military relocation\"", "What the Ukrainians have accomplished against all possible odds so far is just unbelievable and already legendary!\n\nThis war of brutal, disgusting, plain evil yet absolutely ineffective and unsuccessful russian aggression will be remembered, studied and looked up to for centuries to come.", "We feel elated at Ukraine's successes but don't realize the amount of pain and suffering experienced by them.  After the war documentaries need to be made to highlight this so that the world sees the horrors of war", "God Bless Ukraine !!!", "I have the honor to have two friends that were teachers when I was a kid and they were true friends . They were patriots and fought for this country", "Ukraine 🇺🇦 Be strong and Be safe soldiers, women , men, and children ", "Never before Ukraine/Ukrainians were so positively popular and highly rated worldwide.  Now, finally, the world knows this great People.   I'm very happy and proud that this amazing Nation is part of the European Continent.\nGlory to Ukraine!!", "Glory to Ukraine from New Zealand and the Pacific Islands 🇳🇿🇫🇯🇹🇴🇼🇸🇦🇸🇳🇺🇳🇨🇵🇫🇵🇬🇸🇧🇵🇼🇵🇳", "The Ukrainians are making brilliant use of drone reconnaissance, and they might just have some friends with really good satellite reconnaissance to share. Slava Ukraini!!🇺🇦🇺🇸", "Slava Ukraini! With love from Brazil 🇧🇷", "Thank you ally for your help️ Dnipro UKRAINE 🇺🇦", "The Ukrainian people of this era will be remembered as legends. Keep fighting the good fight.", "God bless and protect Ukraine", "Lord protect Ukraine! ", "Much respect from Ukraine much love from Kenya 🇰🇪🇰🇪🇰🇪🇰🇪", "Congratulations  Ukraine 🇺🇦. Victory coming soon hopefully. Keep fighting. Stay strong.", "Congratulations to Ukraine from Kazakhstan 🇰🇿! Victory to Ukraine! Slava Ukraini 🇺🇦🇺🇦🇺🇦 Glory to its heroes!", "My utmost respects to my ukrainian brothers and sisters. Glory to ukraine!", "Well done Ukraine! 🇬🇷🇺🇦", "Yes, truly there is 'no tyranny of circumstances that can imprison a determined will.' Ukrainians, please just keep on fighting, the world is with you.", "Don't trust them they're going to do something horrible and blame everyone else as per usual.", "Teachers are very special people. They make us who we are when we're not with our families we're with our teachers. We spent more time with our teachers than what we do with the families when we are kids", "War is horrible for any Nation, there are no winners end the end. It is just the end. Never give up Ukraine, Never surrender, you got this, God speed.", "Gloria Ukrainian  people and army keep fighting for your country Ukrainian", "Glory to Ukraine", "Justice & truth will always prevails , takes longer sometimes , salute to the spirit of Ukrainian People.", "God bless Ukrainian ", "Thanks God bless Ukrainian people Amen.", "Awesome news Soldiers  Keep up your fierce fight and stay safe and strong and God bless you and all of Ukraine.  🇺🇦️", "Tremendous respect to ukraine🇩🇰🇺🇦🇺🇦🇺🇦", "I know Russian tactics aren't the best but there's no way they are just going to surrender Kherson like that without leaving some sort of trap. It is a huge victory but the army must maintain high alert for whatever those Russians be planning. Besides, I'm pretty sure Russians are just moving to the other side of the dnieper river so in theory they still hold a portion of the city. Perhaps the will try to commit to something during the winter months", "From the USA you're welcome for the aid.\nSlava Ukraini.", "Finally learned his lesson and didn't choose the hardest difficulty on the first go  know it won't last\n\nEdit: knew it", "Keep it strong my ukrainian friends ", "Be careful, be resilient, be strong!!\nGlory to the brave Ukrainian people!!🇺🇦🇺🇦", "God bless Ukraine 🇺🇦🇺🇦", "Just came back to this video to hear the voice again, crazy how you can miss someone you didn't know this much", "Go on my Ukrainian brothers and sisters, Russia go home 🇺🇦", "Already rewatching this legends stuff its sad to see him leave this earth rip techno >:-O", "That’s the first time I’ve noticed a Russian General speak truthfully about a withdrawal without much spin. Which indicates this could be a feint.", "Slava Ukraini \n\nFrom Kyiv's very proud sister city Chicago.", "Damm, that's a huge win for Ukraine. Legit", "Bravo Ukraine, Keep up the Good Work.", "It will be mitigated by those corrupted by pride and greed.   They will destroy something that does not belong to them,  and something they can not have.", "Glory to Ukraine 🇺🇲🇺🇦 Keep fighting! Stand with Ukraine 🇺🇲🇺🇦", "Wow that is a welcome development for Ukraine. God bless that country!", "I still don't want to believe it.\nI find myself watching your old videos everyday still... Miss you so much man. Thank you for everything you gave us. The years of laughs and entertainment.\nTechnoblade Never Dies", "Perang tidak akan pernah membawa kebahagian namun rakyat kecil yang selalu jadi korbannya..", "Prayers for Ukraine 🇺🇦 ", "In war, there is no winner or loser, let's live as brothers and sisters, say no to war.", "Beautiful. Great Ukrainian engineers \nThere are countless examples of their grandiose work along more than a millennium!!  (*Yes, Ukrainians are much more ancient, centuries older, than ruSSia's existence).\nThe worldwide known Antonov is just one example among many others!", "The whole world is with you. Fight on guys.", "Slava 🇺🇦.  ️ from 🇨🇦", "Anyone else think they’re pulling back so they can clear their troops from a big boom", "I appreciate the journalist who honestly report the state of this war. God bless all those involved, a true tragedy of life and a world lost, pray.", "Glory to Ukraine from Finland 🇺🇦🇫🇮", "All The Best To Ukranian Warriors,  Morally we support You, God Bless You.", "Oh god I just shuddered thinking of Bastion when he had an overshield and could self repair while firing", "How I feel happy and thankful to God for this to the people of Ukraine 🇺🇦. Thank you Father of all creation  ️", "This sounds too good to be true, I would tread very carefully if I were the Ukrainians as I'm sure that Russian forces will have laid a lot of mines/traps behind", "And I think about these two people because they influence my life they taught me to help other people the way they help me", "As we say in Chinese: 兵不厌诈, meaning that we should still be vigilant despite an apparent victory. Hopefully the Ukrainians can successfully retake the city!", "A while ago Techno said he would race Dream to 50 mil. The race is still on even though he passed 2 months ago as of writing this. Gentlemen and ladies, we have work to do.", "Glory and huge love from your georgian brothers I'm really sorry for passivness of my country in this conflict we could have done more, but Georgia was the first country that left soviet union and we had two war against the russians we are so tired... but...but we belive the victory is  flickering on the horizon", "Everything is cool, but their faces in the moment when general Surovkin tellin' em that they must to retreat...  Priceless.", "I am highly sceptical about this abandonment. Just have a bad feeling about it. When Surovokin said they want the preserve the lives of their service personnel (not something they've been concerned about before), and the fact that they've released the broadcast, just makes me uneasy.", "Glory !! ", "From Australia - Success and victory to Ukraine. Humiliating and rapid defeat to Russia. Our heart goes out to the people of Ukraine. Many blessings on you.", "I love how Altrive is just standing in the background the whole time. It suits his humor so much", "This could be a trap. Considering Russia evacuated civilians from Kherson and now Russia just leaves Kherson.", "Hanging on the side of exfil is nice. Imagine last second and there is a team already inside. You just run up and hang on when it starts to leave and exfil with them", "They need to check those soldiers that have been seen in civies aren’t plasterers, painters and paper hangers etc that have been bought in to cover over damaged walls etc where explosives / demolition charges and wires have been hidden in all the major buildings ready to set off remotely once the buildings have been check for obvious booby traps.", "The fact that YouTube is giving us techno videos that means that he still wants us to watch his videos over and over again even if we get bored that will never change. Techno you will forever be missed rip king", "Glory to Ukraine from Iceland 🇮🇸️🇺🇦", "Brilliant Tactics vom Ukraine's Commanders and the MERCY OF GOD. By this time, GOOD has WON!! More Power to Ukraine's brave soldiers.", "Bravo!!! Well done boys!!  Maybe back home for tea and medals sooner than you think!! Let's hope!!", "This may be a tactical move.\nThat in itself does not mean it's a defeat. How silly to call it such", "Now amongst the best fighting force in the world, a nation only forced to be so to remain one of the most peaceful people I know ️️️", "I didn't think hearing his voice again would affect me this much, I'm in tears again. I hope he and everyone else had fun with this video <33 rest in peace Techno, rest in peace :-)", "God bless Ukraine 🇺🇦", "May this be a good sign for Ukraine 🇺🇦", "As Russia's humiliation, defeat and with severly broken morale, and being in a massive shortage of weaponry, Ukraine is going victorious, strong, keeping its head up, having a massively huge morale, and getting ALOT of weaponry, it is crystal clear as to who will come out of this war victorious. GLORY TO UKRAINE! 🇺🇦", "The words of carrying about his own soldiers are super bizarre, Surovikin is known by being brutal towards the enemy and his own forces. He's also, just like the defense minister Shoigu never served in any forces", "rewatching these videos makes me grateful that no matter what he was going through, even before cancer, he always uploaded videos for us, his viewers, to watch.\n\nRest Easy and in peace Techno, thank you for everything you did.", "As someone who started watching right before mc monday this was probably the best summer of my life.  It's so sad to hear that techno has passed, but he really does never die.  With our memories and his amazing videos still here, we can keep him with us.", "Ukrainians are a different breed. What an amazing people. Glory to every single hero fighting for their freedom. Glory to Ukraine 🇺🇦 🇺🇸", "Ratatoskr: \"There's no reason to expect hostility so long as they're left in piece\"\nJack: tries to hit them with his axe", "That general made me laugh when he spewed his hilarious rhetoric.", "Whoo hoo UKRAINE ️ FROM USA", "Great work Ukraine !", "Slava Ukraini!! 🇺🇦🇺🇲", "Be resilient be strong. Slava Ukraine.", "Praying for Ukraine🇺🇦", "I've seen this tactical move before on the battle field in 1943 just before the BOOM!!!", "\"A major blow to russias reputation!\" ? That tank exploded a long time ago. ", "Slava Ukraini ! Victory from CA.", "Wow, Russia really really cares for their soldiers. Such a loving and caring country.", "Stay Strong Ukraine love from NYC 🇺🇸", "From your friends in Canada - Ukraine's greatest generation marches on. You are not alone. Victory to Ukraine. Your country will be yours again.", "Best of luck to you all."]}