{"video_id": "LMWuv5aB-OQ", "comments": ["PART 2! - https://youtu.be/fX_kKBzq63k", "Its been a very long time since the first bendy came out, pretty happy that its finally made its second game", "Yeah it’s great that there’s more lore for MatPat to analyze and also a lot more content for Fusion.", "This is amazing, honestly. It was 3+ years in the making and we finally got the game. From the teasers and then the trailer a few weeks ago to now being able to play and see the game in action. This might go down as one of the best Bendy games that the team behind it has worked on. It's already so good.", "The fact that he manages to miss almost everything is honestly impressive and incredibly infuriating to watch", "It’s so nice to be back in the studio. For some reason, it just kind of feels like home. I grew up, watching all these old, nostalgic, kind of cartoons with my grandfather, so the animation style of this game has always struck a chord with me. On top of that grandpa would’ve loved watching this game if he was still alive. It would’ve been something we watched and played together.", "WOW. And here I thought this game was abandoned. Seeing absolutely immense jump in quality, with the extra animations, smoother renderings, wider color palette, etc., just shows how much EFFORT has been put into this one. No wonder it has taken so long! Well worth the wait!", "So for those who didn't notice, the layout of the beginning, is almost identical to the layout of the first chapter in the first game, except instead of a hallway, it was replaced with an elevator in this one. That's why the layout looks so familiar.", "This game gives off major Bioshock vibes and I love it. So far it feels so much faster than the first installment!", "This man seriously uploaded part 2 an hour after the 1st part, unlike any other youtuber. That's just pure respect.", "You can see the hard work the devs put in this game. Props to them!", "Oh man! This game is looking absolutely fantastic so far! I can’t wait to watch more and see what’s become of the studio since the first game!", "man i found out and started watching bendy playthroughs as a highschooler, im a sophomore in college. bendy definitely helped me develop my art style and embrace that i like creepier media! excited to see where this game takes us", "Honestly Bendy has truly made it far after all of these years. After the many occurrences of Dark Revival being delayed or even cancelled it feels like a breath of fresh air to finally see the game released. I remember the day Bendy first came out and to this day I am still a very huge fan of the franchise. I remembered playing and enjoying the game back then and while yes their were a lot of issues that didn’t stop me from playing and enjoying the gameplay and figuring out all of the lore. And seeing Dark Revival, it manages to kind of fix the problems that Ink Machine doe and managed to make it better. Overall seeing Dark Revival I am still legit excited to see how this game continues to go, also Cartoon Bendy is the most adorable thing I have ever seen fight me.", "The game looks so amazing, I'm very amazed by the work they've done and as always Fusion is one of the first people to post a vid on a new game, the vid was honestly overall amazing, good job Fusion and thank you for making the vid so quickly and I know they won't see this but good job to the creators of the game", "This far awesome ride. I love the little throwbacks they added and all the familiar tucked into the experience along side so much new, excited to see where the story goes :)", "I can not believe it has taken me this long to find you and your channel. Your play through is amazing, I love that you take the time to show the story and lore, and you played through the whole game in one day. Thank you honestly for the hard work, long game play, and posting at once instead of making us wait for each part. I have been anticipating this release for years and even though I can’t get the game right now, Watching the play through is a good second. And it’s not 18 min long that skips the story then asks us for the lore.", "This intro was such a masterclass on how to make good horror: I can hide and defend myself, but I'm still scared!\nAnd it looks so good! I'm both feeling nostalgic and in awe to see how much this evolved from BATIM", "Loving this game! I remember watching you play the first bendy game, but I can’t believe it’s been so long! Excited to see the endings!", "Can we just take a moment to appreciate that Fusion is always one of the first people to put out videos on new games", "I'm honestly excited to see how this game turns out to be.", "I never thought this day would come. It's so surreal. Also, let's appreciate how ontop of it Fusion is, always making great content for us within an hour of a new game coming out. Mad respect ", "BATDR is so well animated, props to the game developers for taking their time in creating an amazing game", "This man never misses a new game, its unreal-", "This new Bendy game gives me mixed vibes, it's like a combination of BioShock and We Happy Few, the atmosphere is very reminding of both games. I'm really excited to binge this let's play in a night!", "Can't believe it finally released despite the controversies. What a great game.", "Alice slowly opens a door labeled in bold “CAUTION.” Fusion-“Why is she being so cautious?”", "Glad to see the game finally out! Can't wait to see you continue the series!", "Lots of people probably say this, but as one of the many long time viewers still watching this channel today, as well as new ones, this really is one of, if not the best horror gaming youtube channels to ever exist.\nHe really does his best to upload as consistently as he's able to, and he always makes his videos really fun to watch.", "This might go down as one of the best Bendy games that the team behind it has worked on. It's already so good.", "I absolutely love your play-throughs!! Each time I see a new video from you I grab the nearest snack and settle myself in for a fun ride! Thank you for making amazing content!! 🫧", "this game is still incredibly unexpected and i am genuinely excited to see how this plays out", "Didn't expect it to release so early. So happy to see this series again.", "Can’t wait to binge this right now!!! My most anticipated game ", "I love how quickly you put out content! But I hope this game has multiple pathways like the teaser suggested. If it does are you going to do a second playthrough doing the other pathways?", "I was so dissapointed in Kindlybeast when all of the allegations and employees came forward, I was really scared for the future of the game. I'm so happy to see it come back, I hope everyone involved in this game can feel proud of what they made and not be scared of being let go by the place they work on.", "The games graphics are insane, the game deserves the hype it gets, also the lore is revolutionary, it is not too confrontational but definitely leaves questions to be answered", "13:32 \nFusion: Oh, welcome home.\nHim saying that made that feel very eery. That felt like that was meant to be there.", "Really Appreciate the work put into pushing these vids out, Props to you!", "Aw we made Bendy cry!! That actually hurt to watch! Dang, what an amazing game! After so many years of waiting, we end up with this masterpiece! Thank you so much for playing Bendy and the Dark Revival, Fusion!", "This game is already looking great! I'm so happy this is back.", "I loved hearing the dialogue between Mimir and Kratos in this episode, it really showed us how troubled Mimir is because of his past deeds, and how wise Kratos has become. Also, it's so great to see Sean having a lot of fun with this game! Can't wait for more episodes!", "No matter what Fusion’s videos will never disappoint even after years. Keep up the great work mate.", "Been so ready for this game! Excited to go through this adventure with you!", "Petition for mark to have his own podcast where he just reads stories. Literally anything. His voice is so soothing.", "It's so good to see bendy come back and how much the Batim team has improved. It's absolutely wonderful.", "LET’S GO!! My day is already starting great when I see this! Can’t wait to see what’s in store!", "Combining the powerful forces of your channel, Super Horror Bros, and MatPat I can die happily!", "It's been three years, and it's well worth the wait!", "This is gonna be a lovely way to end a terrible day! Can’t wait to watch the new entry into the world of Bendy! :D", "So glad this game is finally out! Loving the series so far Fusion!", "Its so great to see such a classic game return!", "This game is surprisingly realistic. As the weapons available are the only logical way to deal with spiders.", "Every story begins in a mystery.\nAlthough things may be dark at the start,\nthe truth will illuminate your way.", "Coming back to this video after finishing the entire series! I really want to get this game!!!! Thank you so much Fusion for constantly uploading!", "I've been waiting for this game to come out for so unbelievably long. It's been so hyped up and I'm ecstatic that it's finally here.", "I have massive respect for this guy just because he likes root beer more than anything.", "It's been so long since I have seen Bendy, it's nice to see how far it's gotten!", "YES thank you so much for reviewing this game! I cant play it myself but I love watching you solve puzzles! It’s almost like I’m playing it", "I love all your videos, This is amazing! I was really excited that all of the parts were posted in one day. Now you made me binge watch all of them!", "I'm so glad this series is up again, but I'm curious how their gonna include bendy into game mechanics", "LETS GOOOOOOOOOO!! \nReturning after watching, really loving how it looks so far. It feels like Bioshock but still it's own thing. Looking forward to more ️", "Just finished this series and I must say, thank you for making this, and the little sleep you got!", "I remember watching multiple playthroughs of this game so long ago! It felt like yesterday!", "I feel like he takes toddlers more seriously then anyone else,and lets face it, his face makes him 100x better", "So excited to see a new game! but is it just me or does this game look a lot like bioshock? either way I LOVE IT", "They took as long as they did to insure a good game for there true fans and I respect it", "So glad this game is finally out, I was upset for a while because of how long had passed with little communication from The Meatly or anyone. But now that it’s here it’s a very exciting day!", "Im so happy that BATDR is finally out! Its been years and I remember watching your videos about it all those years ago. Thank you for all the memories and the fun experiences!", "Seeing everyone hyped for Bendy gives me the shivers, like Deja Vu after a really funky tasting sandwich", "I really love that you're always the first one to play a (new) horror game when it comes out", "We're in the final days here. I can tell. \nPeople are packing things into boxes. Tools are going missing.\nYou can smell the panic in the air around the studio. ", "Ive been waiting so long for this play through and of course fusion delivers it the fastest thanks to fusion", "It's kinda surreal how this game is finally out after so long! And so far it looks amazing! Hopefully the whole game is as good as this!", "Ethan and Simon sniggering and laughing together like two naughty kids at the back of the class is my favourite part of this video. I love how you can put any two of the Sidemen together and theyre just instantly hilarious because theyre all genuinely such good friends. =3:)", "Dang this was more sudden than the Deltarune chapter 2 release. I know they released a trailer and everything but it's been so long that I stopped expecting anything. Glad to see it back.", "It’s been so long since the first game came out and I love the fact they made a new game", "It's been a long time since the first bendy game came out, pretty happy it's finally launching the second", "This game looks awesomeeeee. I cant wait to see where it goes.", "This was just perfect...I had the feeling the LK was gonna meet a real challenge that he wasn't gonna be able to just set up his own downfall on and would end up really having to struggle for once.", "As silly as it sounds, bendy has been a big part of my life, it was what started me to draw and I’m glad that it’s back and better then ever!", "I love how you posted all these videos as I was watching them. You really keep consistently posting these and it’s amazing.", "we all know that fusion is the go-to when it comes to getting gameplay fast! we love u <3", "God I'm so happy this is finally out.", "It feels like forever when this game was announced, I'm so happy it's finally out now!!", "I've been waiting for so long. It's finally out boys.", "I've been waiting for this game for so long. I'm so excited.", "Finally it’s out! I remember playing the first game it was so fun.", "I have waited so long for this~! I'm sooooo excited for the rest of this series!", "This game is so hype, I love everything about this game. The main menu gives me the chills and ive been waiting for so long just to watch u play this game", "Amazing to see this back in action, welcome home bendy.", "this looks like a hella good game. i hope it turns out so!", "Can’t believe it’s been five years glad it’s back", "I absolutely  love and enjoy your vids! I never seem to get bored of watching your vids.", "Another great series! Great video Fusion!", "Fuzion: Oh, of course I want health! Honestly, who even needs stamina, there’s no way you could run that much\nAlso Fuzion: spends the rest of the area frantically sprinting past enemies", "I needed this I was crying with joy when I found out this game came out the style the scares is what I loved about this game I needed to see this…", "22:40\n\nFusion fangirling over Audrey just made my day ", "So glad to have it finally out!", "Oh I’m so excited to see this game out, can’t wait to play! I noticed that at 19:40, the voice is humming the tune of Absolutely Anything by CG5"]}