{
    "video_id": "LMWuv5aB-OQ",
    "comments": [
        "whatever you want",
        "The janitor at the beginning sound like exactly like Sammy Lawrence",
        "Please remind me about my second time playing for naff security breach",
        "this cool video",
        "Much love fusion, keep up the grind and great work as always️",
        "I love this game so far",
        "sammy  is my favorite charecter you have grate videoes bro",
        "Finly",
        "get well soon fusion",
        "I want bendy and the dark revival",
        "Great game",
        "24:22 his name is Phil the goat",
        "Keep up the good work on your videos fusion ",
        "Yayyy it's finally  here",
        "Omggg",
        "The starting puzzle in the game is a good call back to bendy and the ink machine",
        "I subscribe to you with notifications on!",
        "It feels like forever when this game was announced, I'm so happy it's finally out now!!",
        "Joey Drew- Henry, have you ever heard of among us?",
        "It's a banjo",
        "he sticks his hand in the mashed taters, silly! then when the butler goes \"GRAB MY LITTLE HAND! ITS STRONGER!\" ",
        "Fusion be like Part 2! - https:/youtu.be/fX_kKBzq63k\nMe trying to read it ",
        "ohhhh its in 1970-\nthats why the player looks like ohio caveman status",
        "“If you don’t choose root beer imma come and have a word with you” \nWell then I choose cola",
        "I dont mean to be rude but i notice how the game needs abit more dialouge\nEdit : what i mean is atleast some more emotion from the character, while im not a game creator myself it definitly helps to know the bad situation your in.\n2nd edit then im done i swear : this feels like bioshock, is it just me?",
        "I'm so glad this series is up again, but I'm curious how their gonna include bendy into game mechanics",
        "for all the og's the heavenly toys factory was in bendy and the ink machine",
        "Aw we made Bendy cry!! That actually hurt to watch! Dang, what an amazing game! After so many years of waiting, we end up with this masterpiece! Thank you so much for playing Bendy and the Dark Revival, Fusion!",
        "47:15 baby bendy",
        "Didn't expect it to release so early. So happy to see this series again.",
        "The intro gave some good words of wisdom",
        "Hello, Fusion, long-ish time subscriber here. I would really appreciate if you read this. I don't have anything to play the game on, but I have a friend with a birthday coming up who really wants the game and I want to surprise him. It would make his day, and to an extent, mine as well. Aside from that, you did great completing the whole game in this short timespan. It was amazing to watch, and I'm glad you're doing this for all of us. I wouldn't have watched it if it were anyone else. Thank you, Fusion.",
        "Me: I just want to be your friend \nBendy: I'm just a baby",
        "no shade but the animation is just really choppy",
        "As fusion gamer said in the beginning root beer is the best and no one can tell me otherwise I will stay on till tomorrow at 6 AM",
        "13:32 \nFusion: Oh, welcome home.\nHim saying that made that feel very eery. That felt like that was meant to be there.",
        "its been so long since I heard anything about bendy so its nice to hear about him again",
        "What ever you want (you said put whatever you want lol)",
        "fusion: why is she being so cautious about it\nThe door with big ink letters that says Caution, keep out: am i a joke to you?",
        "I'm so excited!!",
        "I've been waiting for this game for so long. I'm so excited.",
        "Fisher his name is fisher\nEdit: “I still want to punt him across a field” just killed me",
        "Henry in BATIM (sees the bendy cutout) “ Who put this here?!”\nAdury has the same experience “Who put this here?”\nMe: reference?!?!",
        "I want a bendy game and an ink wife",
        "So glad this game is finally out, I was upset for a while because of how long had passed with little communication from The Meatly or anyone. But now that it’s here it’s a very exciting day!",
        "metal door with \"CAUTION\" written on it\n\"Why is she being so consions about this?\"",
        "Wilson is the person who we were in the frist game and that’s why he said that he got rid of the ink demon",
        "i would like to say this is my 2000 youtube video",
        "17:29 Is that Sans?",
        "Yo",
        "everyone in 2018 bendy in the ink machine is so cool\npeople in 2020 when in dark revival coming out\npeople in 2022 ITS FINALLY HERE",
        "Man missed a chance at milking dark revival’s release, he could have replayed bendy and the ink machine ‘for the lore’ and just milk the hell out of the dark revival release…",
        "Fourth member of the Butcher gang",
        "No matter what Fusion’s videos will never disappoint even after years. Keep up the great work mate.",
        "Can't wait to see what happens!!",
        "It's amazing how you still record for us even while your sick! (Hope you get better soon!)",
        "Your videos are awsome",
        "God YouTuber",
        "I've been so excited for this for a long time",
        "Hey Fusion, I hope your enjoying the game! I can't wait to see the next episode! ",
        "I love it when Fusion grinds on new games like this! I was amazed during security breach and here we are again! keep goin dude!",
        "Mmmm",
        "Hmm.. without killing a single monster and just banish them.. \nWhy does this giving off an Undertale pacifist ending...",
        "Waited so long for this second bendy game, finally happy",
        "I want a bendy",
        "Fusion:I don't even know why we would need stamina!\nFuture fusion:runs out of stamina running from the ink demon and screws himself over",
        "LETS GOOOOOOOOOO!! \nReturning after watching, really loving how it looks so far. It feels like Bioshock but still it's own thing. Looking forward to more ️",
        "I liked subbed  and did what you told me  so yea all I have to do is whate",
        "I laughed so hard when he met bendy just \"come here little fella\" Swings aggressively",
        "Dang I missed this game",
        "This is so cool",
        "As somebody with flu fusion saying he’s spreading the virus is funny",
        "Can't believe it finally released despite the controversies. What a great game.",
        "You are Awesome Fusion Z. gamer",
        "This is my first time watching your videos, but I love your energy!",
        "This is the first video I've seen of fusion in months and he talks so much faster than I remember.",
        "I've been waiting for so long. It's finally out boys.",
        "Cant wait for the next part",
        "Hii",
        "wowww i got so scared of batim LOL",
        "So thankful for fusion his dedication to uploading and keeping us entertained, specially since lot of YouTubers upload a day (which is kinda annoying) it’s so nice",
        "please give me more bendy and other content i love it!",
        "Fuzion ur definitely some of the fastes gameplays for good horror games I feel like this game is so cool could you hook me up? I want to play batim dark revival for my self can you help me out?",
        "The banishing ability is very similar to the Bioshock saving little sisters ability. Heck the picture talking about it looks like a little sister!!",
        "Glad to see the game finally out! Can't wait to see you continue the series!",
        "I’m excited to watch the full series!",
        "So excited for this",
        "I’ve been waiting ages for this game! This is awesome!!",
        "Dink",
        "Fusion I agree with you, Root Beer is the best.",
        "Heh",
        "I thought bendy was done forever",
        "2:52 agreed, rootbeer is THE bomb, it's my favorite soda, and I even have rootbeer chapstick that I don't even remember getting",
        "3:05 Look who it is Dr Phil.",
        "I don’t know why baby bendy is so adorable. “Come back I wanna punt you across a field!” That had me dying",
        "not picking root beer is INSANE",
        "average day in ohio:",
        "41:45 r.i.p fusion read too hard",
        "You told us to say anything you want",
        "This is the best series ever they finally finally released the sequel to bendy and the ink machine",
        "i love your reading! it reminders me how much is miss my teacher",
        "ooga booga",
        "I am a banana look at me move ya ya×5 banana power×5 all of it×3",
        "I love your videos!",
        "I can't have the game but always I can watch it love your vids",
        "Finally someone agrees with me fusion! 2:47",
        "40:05 “get looted”",
        "Bro you are the reason I love every game you play",
        "my luck is terribly :(",
        "When you saw the radio, roblox actually used it as an exclusive hat when you redeem a robux card",
        "8:16 I like how 8-BitRyan in the corner says he is playing the same game! ",
        "I’m happy that it is actually here now, and thanks for the great video Fusion.",
        "IPhone",
        "The title makes me think you are berndy",
        "Have you realized that the person audrey was talking to at the machine was our old character in bendy chapter 1-5",
        "I am OBSESSED with Baby Bendy!!  He is TOO CUTE! I just wanted to run after him ",
        "This is going to be a great game",
        "Pov a cartoon studio in ohio",
        "I love u  u always cheer me up and u do games i never had the guts to play ;) thank u ",
        "The banish ability reminded me of shadow of war banishing the nazguls",
        "I watched all episodes I enjoyed them",
        "I love the dedication to video production without losing quality.",
        "Save",
        "I miss the good old bendy",
        "It's so funny to see matpat the game and he won't stop taking about the lore ",
        "I loved bendy",
        "i love your vids",
        "This is so nostalgic i used to be a bendy and ink machine fan and i watch bendy and ink machine video im happy that they finaly released a new bendy and ink machine game",
        "I know why the game took so long, and it's cause of how good the game is put together.",
        "Honestly its pretty cool to see this new bendy game and how it works now.",
        "I love this game so much",
        "Him: i think we can trust this guy\nAlso him: i knew u shouldn't trust this guy",
        "pov: left behind loot",
        "You have good videos",
        "This game is surprisingly realistic. As the weapons available are the only logical way to deal with spiders.",
        "I love your vids",
        "Wassup man?",
        "One of my favourite intros I’ve seen so far",
        "19:32 the person is humming the absolutely anything song from CG5",
        "24:38 The way he just says ok and walks off",
        "Love your vids! I always come to you when a new game comes out.",
        "I'm more of a dr pepper guy but root beers good to",
        "Look at the bottom right corner of the screen at 8:14",
        "they’ve made bendy so cute. i love it. also i like how they upgraded the game style but made major changes for the better!",
        "i want that game also you,re a good yt sub now",
        "You, me best friends now because I  love root beer",
        "creepier media! excited to see where this game takes us",
        "Ben gan",
        "I would like to get a copy of this game!",
        "The old Willson guy reminds me of, boris (r.i.p boris)",
        "Just watched it all it was amazing",
        "THIS SO FREAKING COOL",
        "7:07 yep my guy sounds like moon from fnaf sb on crack and the fact he said follow me sounds like william to me.",
        "I love all your videos, This is amazing! I was really excited that all of the parts were posted in one day. Now you made me binge watch all of them!",
        "Honestly Bendy has truly made it far after all of these years. After the many occurrences of Dark Revival being delayed or even cancelled it feels like a breath of fresh air to finally see the game released. I remember the day Bendy first came out and to this day I am still a very huge fan of the franchise. I remembered playing and enjoying the game back then and while yes their were a lot of issues that didn’t stop me from playing and enjoying the gameplay and figuring out all of the lore. And seeing Dark Revival, it manages to kind of fix the problems that Ink Machine doe and managed to make it better. Overall seeing Dark Revival I am still legit excited to see how this game continues to go, also Cartoon Bendy is the most adorable thing I have ever seen fight me.",
        "Let's go!!!!! Keep up the amazing work FusionZGamer!!!!!️️",
        "I wanna get pet monkey",
        "This new Bendy game gives me mixed vibes, it's like a combination of BioShock and We Happy Few, the atmosphere is very reminding of both games. I'm really excited to binge this let's play in a night!",
        "This graphics are SO BETTER THAN chapter one",
        "I",
        "7:45\nSILLYVISION\n\nSillyvision is a cartoon that developed by Joey Drew that allowed for animated cartoons to be completed more efficiently by streamlining the pencil and inking stages and allowing for last minute adjustments to be made directly on the film stocks itself. The film was chemically coated to allow for a specially formulated ink to be applied by an artist working on a magnifying table. This allowed for adjustment, action enhancements, or even whole new characters to be added after the cartoon had been photographed. Mr. Drew intended for  the format to be used some day to create 'interactive' experiences where the cartoons could be custom altered to fit the occasion or audience.",
        "I litturaly was so happy when i saw it out like omg",
        "i need to get it pls",
        "She has powers and is scared but Henry had nothing and still would just run up in there",
        "How you doing",
        "we where waiting for this so long time and this is so cool and worth to wait tbh",
        "BATDR is so well animated, props to the game developers for taking their time in creating an amazing game",
        "Yo I would love to play this!",
        "root beer is literally the best unfortunately i don't have any so i'm just casually snacking on some BBQ pringles and drinking mountain dew and watching this series",
        "THAT THUNDER SCARED ME!!!",
        "I love your Vids",
        "I missed the old bendy and the ink Machine games",
        "They end bendy the ink machine that’s the first game there’s the second game \nBendy  the dark revival",
        "this game is going everywhere on youtube and on the internet",
        "The old man sounded like popeye- XD",
        "Thank you for giving out this game. I don't want it, but someone had to show their appreciation.",
        "Good idea that you probably do if you really hate it that you keep paying you and then try to banish them",
        "Around here, it's just best to stay out of sight.\n\nDon't ever go running into some place if you don't know what's in there!\nIf you attack a problem head on, you're going to find yourself in trouble.",
        "I love your videos ",
        "it's been so long, Love ya Fusion! You deserve the world man keep on your feet man! ",
        "Ima need that game copy slime",
        "WOW. And here I thought this game was abandoned. Seeing absolutely immense jump in quality, with the extra animations, smoother renderings, wider color palette, etc., just shows how much EFFORT has been put into this one. No wonder it has taken so long! Well worth the wait!",
        "They took as long as they did to insure a good game for there true fans and I respect it",
        "Pc",
        "Hii I love bendy games",
        "It's Ben a wile",
        "Whatever you want ",
        "Why is nobody commented in this video? Anyways, I do kind of like Mindy. It's one of my. I'm kind of getting obsessed with it.",
        "I love ur channel fusion gamer!!",
        "bendys eyes almost made me cry",
        "21:59 LIKE MY DAD",
        "Willson sounds like the gman",
        "I love how he totally was like “A Wolf wow I wanna see it!” ",
        "But also I think Audrey is alese angle",
        "So glad they continued to make these games ",
        "Finally release!!!! Can't wait for gameplay part 2 <3",
        "Im so glad that bendy's back i loved the first game and this one looks amazing!!",
        "HI",
        "2:53 I agree",
        "Ive been wanting to get the game and now I'm below excited for it",
        "Hi!! I love your vids!",
        "Legend",
        "When Bendy started crying my heart just broke. He's too adorable. :(",
        "The animations are so good!",
        "Whatever you want",
        "Root beer is one of the best drinks. Mountain dew is the first",
        "rescued ",
        "I love the game bendy and the dark rival",
        "I’m pretty sure that the ones who created the first game created the second",
        "I've been so excited for this game and now that its out I can't believe the improvement from the original. I am so happy right now",
        "I just love how similar to bioshock  this game is!",
        "Fusion: root beer is literally the best\nMe: you are now my favorite youtuber.",
        "bro i really wanna wim but i htink my pc cant run it",
        "Lets be honest- Ian and Sigils are an awesome team- they make up like two of the brain cells out of the three that the group gets when they put their brain cells together. :/",
        "from what I've heard the reviews for this game wern't all that great saying that the game would be forgotten after a few days\nim glad they were wrong",
        "Wow bendy looks sickkk",
        ":D",
        "2:51",
        "I love Bendy and the ink machine bro I can’t believe they made another one",
        "What's funny is funny her name's Audrey then my nickname is Aubrey",
        "Man finally bendy and the dark revival is here also Wilson walks as slow as the development of this game",
        "i want the game.",
        "Finally it’s out! I remember playing the first game it was so fun.",
        "Xbox",
        "Me scared for my life:\nFusionZgamer just being cool ",
        "Olalalal ",
        "I'm new to the bendy games so I know nothing",
        "Really Appreciate the work put into pushing these vids out, Props to you!",
        "LEZ GO BABY ROOT BEER",
        "liked",
        "I’ve never had a game before that’s Bendy and the ink machine related but can I get it in a disk",
        "OMG ITS FINALLY OUT IM GONNA CRY THIS WAS MY CHILDHOOD",
        "he really got banished to the shadow realm",
        "Cartoon Bendy is so cute but terrifying at the same time!",
        "Moooo",
        "Already rewatching this game cause I love it so much",
        "\"This is a dream come true.\" -Fusion\nWell, dreams do come true or atleats that's what Joey says",
        "HE IS SO CUTE",
        "This man never misses a new game, its unreal-",
        "Br",
        "I haven’t been able to play a bendy game yet watching ytbers play it seems fun",
        "This is so cool!",
        "I just realized one of the notes the name was Sammy Lawrence is that the Sammy Lawrence from the first game chapter 5 I forgot which chapter since I haven't played that game in forever",
        "BENDY? THE INK MONSTER? AUGHHHHHHHHHHH",
        "Have you noticed that she's been commentating just like Henry in the last bendy and the ink machine game",
        "Whatever you want… Haha just kidding I really like your vids fusion I’ve been watching for a very long time I remember when you played with your face cam on a while back and when you played all those fnaf games and stuff.. and I just want to say your content makes me happy.",
        "Cus I love it",
        "this was 7 days ago",
        "I've been excited for this game ALL DAY!!!",
        "I love your vids I been a sub for a while now",
        "So awesome!",
        "love your vids FG",
        "Brad the old man probably be having speech problems and just throw hurts that happens to me all the time",
        "36:31\n\nHope this helps.\nYou cannot collect an item like that, nor hide (unless it's a Miracle Station) whenever you're in combat, either being chased or fighting something.",
        "It reminds me of bioshock",
        "I want the xopy of the game",
        "Ay I want a copy  <:)",
        "I missed Bendy ",
        "ih",
        "hi i am you BIGGEST FAN i love watching your videos and please give me a copy of the game ",
        "22:44 when u said \"oh my gosh I'm beautiful I'm so pretty look at me\" was my favorite part best part to me and don't kick or hit bendy",
        "I have strep throat while watching this.\nI respect the people who live the 2020-virus.\nThis is bad with strep throat to me.",
        ":O",
        "I love root beer it is the best drink",
        "Amazing!",
        "Good day",
        "love your videos",
        "Hello",
        "My cousin loves your videos️ so much that he watches them everyday, I gotta agree with him but not every day cause of school",
        "#RootBeerIsTheBestSodaNo SodaCanCompete",
        "19:18 ah yes a guitar definitely looks like a banjo.",
        "I can’t believe they actually added the song “Anything” in this \n\n(Inspired song from CG5 (I think thats what he’s called, you can hear the humming of it at 19:30",
        "who here remembers all the nostalgia from bendy and the ink machine while just watching this video",
        "I like how the Ink Machine basically create an entirely new dimension of Muntant Cartoon-Human hybrids, it is a very cool idea!",
        "his hand rejected something adorable...now bendy about to tattle tell on him.",
        "Fusion: awwwwwwww\nAlso fusion: I still want to punch him",
        "Hiiii",
        "after a long wait dude for a new bendy game it finally comes out been waiting since 2018 XD",
        "Cool",
        "Another great series! Great video Fusion!",
        "Really cool series so far, I'm a little bit late, though.",
        "Me when I see good bendy: Awwwwwww. He's totally going to morph into a horrifying monster isn't he.",
        "Yes!",
        "Noice",
        "Ur right root beer is the best",
        "I rlly want to play this and make a video on it but it cost too much money ;-; I'm glad some ppl get to enjoy the great game after a long wait. The one thing I also like that normal bendy's face changes from his emotion which is a very cool design",
        "Respect for the giveaways!",
        "yay",
        "Rooter is the best",
        "Why do u sound like my uncle?",
        "The hand powers def gave me bio shock vibes",
        "Imagine playing this at 3am",
        "Imagine Wilson is henry",
        "Yes, root beer is the best, but so is cream soda",
        "I think Audreys a lefty. She picked up the keys with her left hand",
        "Can't believe that by the time I manage to get to the video you've already released eight episodes. Are you okay?",
        "i like your vids so i will keep woching your vids",
        "I like potatoes",
        "“Whatever you want”",
        "#BALDKREEK",
        "Nah bro what you say 🫣🫢 38:30",
        "I HAVE WAITED SO LONG, THIS IS SO COOL!",
        "Why did the alarm in the elevator sounded just like the alarms in bioshock or when a machine spots you and is it just me or does Joey drew looks like Andrew Ryan from bioshock",
        "ive been waiting for so long for this its great to see this.",
        "Yes, root beer is best",
        "ive never drank root beer actully.",
        "Im so happy that BATDR is finally out! Its been years and I remember watching your videos about it all those years ago. Thank you for all the memories and the fun experiences!",
        "You don't give game's or codes",
        "2:47 Never had one",
        "I've been doing school work for 16 hours I'm glad to watch this and relax",
        "This video is very scary and cool",
        "I agree root beer is the best",
        "I enjoy watching your videos everyday! My sister and I get home from school to watch your videos. It was funny, one time my sister said, “you should make a YouTube video for your channel on this game.” And everytime, I tell her that would be a good video!",
        "I love it",
        "I love your videos but I can’t always find them",
        "Bendy is so cute!",
        "M",
        "The game looks so amazing, I'm very amazed by the work they've done and as always Fusion is one of the first people to post a vid on a new game, the vid was honestly overall amazing, good job Fusion and thank you for making the vid so quickly and I know they won't see this but good job to the creators of the game",
        "W game W youtuber",
        "YESSIR ROOT BEER SUPREMACY!!!",
        "I'm a big fan of you",
        "22:41 just...what??",
        "Pls me I need this copy for my brother he is begging for it",
        "Yoo finally my childhood is coming back",
        "Creepy dude, creepy voice. Yup he evil  . I feel my skin crawling",
        "I LOVE THIS",
        "LETS GET PIPED CMON",
        "I love this part",
        "This game is like a whole day long",
        "Bro wanted to kick the cutest thing in the world",
        "The games graphics are insane, the game deserves the hype it gets, also the lore is revolutionary, it is not too confrontational but definitely leaves questions to be answered",
        "BENDY'S BACK!!!",
        "2111",
        "This is gooooooo",
        "deez",
        "My man goes COME ON YOU WANNA GO",
        "Fusion literally started the game the minute it dropped. It's barely 1am in my time so this dude is committed XD Great video man!",
        "I absolutely  love and enjoy your vids! I never seem to get bored of watching your vids.",
        "I loved this gameeeee",
        "i saw my son playing this game. i watched your video on this many years ago. the times were fun when i was still a stupid teen. i asked him what he was playing and he said he was playing bendy and the dark revival. i told him a few years ago there was another game called bendy and the ink machine. he said hed try it out",
        "The first part is me searching for my remote when it's in my hand",
        "OH SHIT !",
        "I love you",
        "Bird",
        "im so glad they didnt post these chapters ear by year and that the just posted the whole game in one. Saves us a lot of time.",
        "37:15\nTHIS IS FINE.\nBurning dog reference ROFLMFAO!!!! ",
        "What a nice fellow ^-^ (talking about Wilson) Reminds me again never to work here",
        "Mew",
        "Can’t wait to binge this right now!!! My most anticipated game ",
        "he is not in danger, he is the danger",
        "Me? You? Idk.",
        "Kinda feel bad about bendy with a toy",
        "Hi I am a fan of you",
        "You know, this game was nothing like I expected, it was so much more",
        "This game looks amazing! Im glad they didnt stop with the bendy games",
        "Hi love your vids",
        "The wolf is Boris",
        "I still wanna punt him across a field tho has gotta be the best quote I’ve heard",
        "It’s a better time now",
        "I needed this I was crying with joy when I found out this game came out the style the scares is what I loved about this game I needed to see this…",
        "She didn’t know how to get an upgrade she’s just so angry that she punched the ink the thing that changed her",
        "I think it would be hilarious if they did a horror game with a character with Wilson’s voice but he is like a totally chill dude who just helps the player",
        "47:16 this part got me",
        "hi ive been watching since 6years ago sadly my account got deleted i jsut got a new one (one that has email) and now for the first time in 6y i am subbed",
        "If I get the copy, thank you and have a wonderful day",
        "Very Good. Very Nice",
        "Not me who was here when he played bendy and the ink machine the first one",
        "My name is Robbie",
        "All begins here",
        "You got rescued be Bendy? Nice!",
        "eeeeeeeeeeeee free game",
        "man this looks amazing",
        "Root beer is good",
        "Hi I'm a big fan!!!",
        "ThAtS oNe LeAp Of FaItH i DeFiNiTeLy WoNt MaKe ",
        "Your videos always put a smile on my face",
        "hello big fan",
        "Ok",
        "I've been waiting for this game to come out for so unbelievably long. It's been so hyped up and I'm ecstatic that it's finally here.",
        "This game gives off major Bioshock vibes and I love it. So far it feels so much faster than the first installment!",
        "I really love that you're always the first one to play a (new) horror game when it comes out",
        "The sun and moon show said the exact same thing about how it’s like BioShock",
        "Crying Bendy is probably one of the cutest thing I have ever seen",
        "Oh my goood! I cried for Bendy!",
        "I’m so glad that this game is finally out! I really am glad to see baby bendy!",
        "I cannot wait to see what the inky depths have in store for us this time. Hopefully I can still manage to get any work done this week while trapped in bendy hell lol\n\nThe banjo in the display case.. i wonder if it belonged to sammy? im so excited that sammy finally mentioned jack in any way, for people who were supposedly very close partners, he sure never mentioned him at all",
        "Yeah I’m gonna go to uhh floor down yeah",
        "did you drink a lot of coffee or do you just talk this fast usually",
        "Ahebdudnah",
        "NGL I wanted Willson to say \"sheep sheep sheep it's time for sleep, rest your head, it's time for bed\"",
        "game.",
        "Bro the ink guard is so stupid you cannot even see you when you're hiding is that the ink guard needs to find the map to find you LOL",
        "You this is cool",
        "Yay more bendy!!^^ I've been subscribed to u for along time^^",
        "nopase ro peo la jase",
        "Its so great to see such a classic game return!",
        "Whoever voices Audrey is the perfect voice she deserves a raise",
        "This game looks so dang amazing! Well worth the wait and looking forward of getting to play it myself soon",
        "Bendy and the dark revival seems interesting...",
        "Where’s Henry",
        "wow cool video!",
        "Nyoom",
        "Yesssssss!!!!!!!!!",
        "NOICEVID",
        "Also, Wilson just talks and acts exactly how I talk to girls",
        "I'll drink most sodas but it's definitely root beer if I have the choice",
        "Your coughs had jumpscared me and ik im pretty late but i appreciate you just uploading all these videos when you should be resting! AND I LOVE ROOT BEER AS WELL glad im not the only one",
        "I love that this game is inspired by bioshock it brings good Nostalgia",
        "I believe there is two versions of Bendy. The ink demon that is actually evil and wants to actively kill people, and the real Bendy that’s just…chilling.",
        "The spider is strider",
        "Let's descend into the ink machine once again with Fusion.",
        "this game is still incredibly unexpected and i am genuinely excited to see how this plays out",
        "Was it just me or did I hear whispers at the elevator at the start?",
        "This game is very cool holy",
        "It feels like five nights at Freddy's root beer",
        "I am so excited to play this game once i finally play BatIM",
        "14:09 star wars music intensifies",
        "Glad they finally made a new game, I would choose coke over root beer though.",
        "wilson :mind if i....step in?\nme: ............closes elevator door on his face.\ngoes on whith life",
        "I want Dark Revival",
        "Mad respect",
        "I'm a big fan",
        "It's so good to see bendy come back and how much the Batim team has improved. It's absolutely wonderful.",
        "We just wanted a cup of coffee",
        "Me: Deez nu-",
        "Awesome",
        "So excited to see a new game! but is it just me or does this game look a lot like bioshock? either way I LOVE IT",
        "Wassup man I’m playin fall guys and eatin mints ",
        "It's unbelievable, and I think they deserve a lot more than that",
        "19:08 actually scared me jump scare",
        "19:30 \"i can hear you calliinngg, calling out to meee\" love that they included that little hum of the song",
        "Love the entire Siri it’s been so great love it so much it’s just awesome in fact I love all your videos ",
        "I am eight",
        "19:06 MAN I GOT FUCKING SCARED LOL",
        "Your videos are so good",
        "It’s a banjo not a Guitar fusion ",
        "It got me in Corona virus ",
        "I wan'tr the game",
        "I ",
        "I forgot how good the game was...",
        "Root beer it’s amazing!",
        "I can't believe that there is a new Bendy game",
        "Oh my goodness this game is so beautiful. I can't wait to play it on the PS5! squeals like a child",
        "I want it",
        "yes this is the best bendy game so far",
        "Oml this is crazy",
        "Let’s fricking Chimkon GOOOOOOOOOOOOOOOOOO",
        "Ive been waiting so long for this play through and of course fusion delivers it the fastest thanks to fusion",
        "The thing that you are collecting is food",
        "YESS I LOVE ROOT BEER SM",
        "37:33\nSpoiled cake ROFLMFAO!!!! ",
        "I've never had root beer",
        "This man seriously uploaded part 2 an hour after the 1st part, unlike any other youtuber. That's just pure respect.",
        "Wow never thought id find content lke this! 1:03",
        "we did it bois its here",
        "AYO BRO SAID LETS GET PIPED BABY AYO?",
        "I was having alot of flash backs to the old bendy game",
        "I'm so happy the little bendy ended up being an actual friend. I was guessing he would become an enemy like boris.",
        "that jumpscare got me i jumped up and allmost spilled my drink",
        "You can see the hard work the devs put in this game. Props to them!",
        "Already subbed xD",
        "IM A FANNNNNNNN YOU ARE THE GAME KINGG!!!!",
        "I've been really hyped for this game, the artstyle is unique and it seems like tons of fun already!",
        "You are always so quick to play the newest games",
        "I finally know what the plushies and action figures are of the dark revival I didn't know of it until a few weeks ago and didn't think about the plushies and action figures I thought they were from a fan game but as soon as u went into the mirror it clicked",
        "After five years my friends,Welcome to the dark revial",
        "Wooo bendy is back",
        "A",
        "BENDY AND THE DARK REVIVAL",
        "Just imagine how hard it was to make the game",
        "38:29",
        "It's been a long time since the first bendy game came out, pretty happy it's finally launching the second",
        "Root beer is good it taste good",
        "22:40\n\nFusion fangirling over Audrey just made my day ",
        "It's so good to see bendy aging and my sister has a bendy comic book since the comic books came before the games and cartoons and the cartoons came before the games",
        "ive been so excited for this game",
        "19:30-!9:40 the song being hummed is \"Absolutely Anything\" by CG% and someone else whose name I don't know",
        "Hello! I really love the games you play. Where can I get them?",
        "Yeśsssssss",
        "Baby Benders is SOOO cute!",
        "I really want to game",
        "The fact that he manages to miss almost everything is honestly impressive and incredibly infuriating to watch",
        "Me love Root Beer",
        "It would be nice if you could slid",
        "I have not played the first bendy game in forever but I’m going to play this one",
        "Wilson kinda makes me think of Trager from Outlast",
        "Yay root beer",
        "I'm so confused on how he misses almost every tape from hear on out:",
        "I have been watching your videos for all my life",
        "Hi",
        "41:34 bros sweating as hes reading and he choked ",
        "Bendy",
        "Dam this feels nostalgic.",
        "me: just casually watching \nme again: sees in the corner: 8bitryan is playing bendy and the dark revival\nme: LES COMMENT DAT\n35:33",
        "man i would love to play bendy again after five years",
        "I can't wait to play this!",
        "MatPat at 3:15 DID SOMEONE SAY LORE????",
        "Its been a very long time since the first bendy came out, pretty happy that its finally made its second game",
        "i really want this game",
        "Why does nobody have comments? Like seriously?"
    ],
    "comments_disabled": false
}