{"video_id": "lWVZOzSzhfE", "comments": ["Lil Tjay never disappoints ", "This guy got shot 7 times and is still releasing music while trying to recover\nThat is absolutely astounding. \nPush through Tjay", "Lil tjay always comes with bangers ", "Tjay always got new things for us. ️", "Proud of you TJAY and anyone that reading this, it’s not easy battling the shit we battle but we do it all as a family no matter if we know each other or not.", "Lil tjay o melhor voa você merece ", "Tjay on top!!! NEVER DISAPPOINTS!!", "Song was fire Can’t wait to see what the video looks like! Good bless you big G!", "TJAY NEVER MISSES ", "Lil Tjay never dissapponints", "tjay never disappoints ", "LETS GO BRO, KEEP DOING YOUR THING G", "lil Tjay never disappoint", "This is going to be a hit song", "tjayyyyyy never disappoint. this man issa blessing to the world despite the shooting all he still pusshin and giving us the best. keep it up bro . from GHANA", "Can't wait for this I know this is going be fire", "TJAYY is such a great INSPIRATIONBro’s fr one the main reasons I began making music myself lmao, I’m praying rn that we gon’ one day be able to make a hit together brotha", " I love seeing it every time ", "Can't wait for it to come out ️", "I’m scared for the video tbh  my heart is gonna be broken  But I really can’t waittt… so proud of you Tjay  You’re the G.O.A.T fr ", "I love this song so much I always listen to it every day love u", "I’m scared for the video tbh my heart is gonna be broken But I really can’t waittt… so proud of you Tjay You’re the G.O.A.T fr", "Been having this on repeat since yesterday", "I love you Tjay !", "Exciting to see what Tjay does next", "started from the bottom now you r on top, dawg, we r with u", "Love it ", "Good have you back bro been missed in music  RIP all fallen soldiers in last few years to many legends gone to soon", "been listening to T since 2019 ️‍ no misses ever", "LOVE ITTTT️", "This gon' be a classic.", "LIL TJAY LEYENDS ️️️", "TJAYY is such a great INSPIRATIONBro’s fr one the main reasons I began making music myself lmao, I’m praying rn that we gon’ one day be able to make a hit together broth", "Yesssirrr Tjay keep up the grind bro drop this shit now it’s already a banger", "Love this ️‍", "True fact: the Lil tjay-ocals are not jokes. His/her or her\n\nThe voices are masterpieces. ", "What I need is for you to be happy in whatever you want for your life! It is not all about me! If it is not me that your heart so desires. I wish you the best yet to come.", "Damn this go hard ash damn god blessed this with talent ", "So hype for this seen u grow from that lil kid in 2017 to now keep goin big bro", "Commented before, this song is 100% fire made from 100% legend", "This joint gon bump", "Love you lil tjay", "This will be fire ", "Let’s go my boy tjay ", "THE MAN IS BACK ", "TJAY YOU ARE THE GOAT ", "Dis bout to be fire", "Guessing this will be another banger", "MUSIC VIDEO GON BE ", "CANT WAIT", "So happy about this", "Yes sir keep going man nothing ever stopping you", "homie got shot 7 times and is still recovering mentally and probably physically too and still out here dropping bangers", "Hit  us wit that banger cuhhh... Much love from VA champ keep doing ya thang", " can’t wait", "Always legend ️", "STAY BLESSED GOAT ", "Love you tjay", "As a beat maker , I can't wait to hear it", " I basically Noooo the whole song  already. And your verse from Eastside  ", "Bro your songs are fire", "Love the song", "Let’s Gooooooo Baby ! ", "Love it", "I can't wait any more ", "Tjay music videos always goated", "Always love from INDIA 🇮🇳", "I wish this gonna be dropped whereby sooner", "We've been waiting for this one right here", "This going to be fire", "keep going ", "This fire ", "Boutta be fire", "You never miss broskiii", "that's right keep going ", "Yes lil tjay do your thing your a king of the city  ", "So ein traum ein mal an seinen Konzert dabei zu sein", "Bro I can’t wait to see the full one bro", "Lil Tjay fire ", "This looks so good", "Tjay with new banger ", "El mejor del Planeta", "Who else is Waiting", "Tjay deserves all those girls", "G.O.A.T ️‍", "Another banger !!!!!!!", "Cant wait.", "you the best in the game", "Please have a concert in south Africa pleaseeee ", "this about to be fireee", "I can’t wait", "Fire ", "LIL TJAY LEYENDS ", "I hope he‘ll release his unreleased songs like adios or woah", "Love you Lil tjay", "Neva disappoint welcome back tjay 🫶", "Another fire song", "Hype from whole brutheren for this tjay ", "G.O.A.T", "reminding me the ex that broke my f*cking heart"]}