{
    "video_id": "M89aatieb6A",
    "comments": [
        "west Michigan here! Allegan County.\nLoving the snow!!!!  A foot tomorrow and through Saturday \nMuch love to all and ty Ryan Hall!",
        "Gonna be alot of Buffalo babies in 9 months I'm thinking lol",
        "I loved winter as a kid, now not so much. I walk into my garage and see my BMW motorcycle just sitting there.  Sigh.",
        "Oh yeah, got hot soup for all you stranded motorist's, it happens every time!",
        "As a person who lives in watertown, our snow plows clear roads within a matter of hours (like 2-3 hours).  If there is one thing NY does well, its move snow off roads.  Im more worried of the building collapse risk.",
        "2 feet and counting in Eden, NY southern suburb of Buffalo. Let’s go!!!!",
        "@buffalo New york, you are in for a serious snow storm, stay warm",
        "Is this cold wave coming to the EU too? \nAlso, stay safe everybody! I hope everybody comes out of this okay.",
        "I live in West Seneca, NY about 15/ 20 minutes from bills stadium in orchard park",
        "Well I survived the blizzard of '77 in Buffalo NY with the 152nd Eng. NYNG for 12 days.  I guess I'll survive this little speedbump here in Orchard Park NY.  Pick up my Buffalo Chicken wings, and six pack of beer now I'm prepared,  bring it on mother nature.",
        "Love your Content and I am a fan and watch all your stuff but you don't need the click bait thumbnails it turns folks off IMHO",
        "I feel bad for New Yorkers and anyone else getting dumped on right now :( hope you all stay warm and make sure to put portable heaters under your pipes so they don't freeze and you continue to have running water. ",
        "Benn in Georgia for 2 years and I do miss snow storms!",
        "Folks.... please go and check on your elderly neighbors... right now. Make sure they have any supplies they may need BEFORE these storms hit. If they need help you can't provide (meds, safe heat, etc) there are social services that might be able to help. If you have outdoor pets, please make sure they have a warm and dry place to be (if you can't bring them in for a couple days).... and make sure they have drinkable water at all times.",
        "Thank you  Ryan",
        "Hi from Carthage NY near the tug hill.",
        "Stay safe Buffalo! ️",
        "I wish snow would make it down here in south east texas",
        "Orchard Park is where the Bills stadium is! Hope they choose safety and reschedule the game (as much as I want to see them play in a snowstorm lol). Stay safe, western NY!",
        "I’m in Niagara Falls and so far we have about 2 inches or so right now. My brother however is in downtown Buffalo.",
        "sorry but I think the y'all o meter isn't tall enough for the snow you're forcasting.... If I lived there (wish I did) I would just poke a hole in the 5' of snow and say, yup y'all, we got snow, the meter is down there.",
        "I'm from just east of Buffalo, praying for a snow day from work.",
        "I should have bought a yallometer. I'll have pics.",
        "Man are any ski resorts going to get some of this snow? Whiteface?",
        "As a Buffalonian we’ve seen worse we’ve got this. Go Bills!",
        "How much snow does an inch of rain equal? Like is it typically 2\" or 4\" if it would have been an inch of rain?",
        "Wow!! I can’t even fathom that amount of snow!!! ",
        "Just moved to Buffalo (Amherst) and this is going to be the first snow for me in whole life,  and it's going to be crazy like this. I am feeling excited as of now because I don't know about the bad effects. But I am prepared with groceries.",
        "This is impossible with global warming. Hottest past 8 years in history my arse",
        "On my way to post this into several online gaming communities in discord. I have people up in the snow area.",
        "Omgoodness everyone please stay safe. Thank you Ryan for the updates ",
        "Me in Fort Wayne consistently missing all severe weather like a boss",
        "I’m that guy in Colorado lol. . But it’s still interesting to see and here. I just learned about the lake effect that’s insane.",
        "Grew up not too far away in Rochester, NY, so this weather outlook has my interest from my memories of Lake Effect Storms past (including 1977). I currently live in Colorado, so your comment had me laughing. Be safe, all those impacted.",
        "So glad we don’t live in the northeast!",
        "Better have food and heat its gonna be a long week for them. Snowed in thanksgiving",
        "thanks Ryan, I watch your weather forecast all the time, even though I'm in southern Ontario, on the Bruce Peninsula, so lake affect is pretty normal here. I thank you again truly, as I've mentioned before, I wish we could clone you for an all Canadian Ryan Hall ! keep up the fantastic work you and your team do for all of us.\nbest wishes,",
        "Stay safe truckers",
        "Thunder snow is a truly awesome weather event to watch. I have only seen it a few times, but once seen it's something you never forget. Also a bit dangerous, so that's something to keep in mind.",
        "Someone do a Snow Dance so New Mexico gets some snow! I have groceries,  2 winter's worth of wood, and lots of TP....so we are prepared for being snowed in for weeks! So far, Ziltch, Zero, Nada \nOur white lab is old enough now to be trained to pull a snow disc and we have no snow!  Give me the name of the person I need to discuss this with because I'm not happy!!!   Be patient you say??? I have been waiting for years! ",
        "End is coming.",
        "I use to live in Watertown years ago when my late husband was in the army stationed at Ft. Drum . Talk about Cold ! I Think its reported that Watertown gets the most snow in the continental USA. I would not live there now.Nice area ...love Sackets Harbor and the 1000 Islands area ...but to live there again? I will stay in southeast Ohio thank you . Thanks for the update Ryan.! ",
        "I can confirm in NW Lower Michigan 40 miles west of Lake Michigan early for sure 7+ inches.",
        "We’ve been getting dumped on the past couple of days but especially today in west Michigan.  And I’m sheltered at home with my husband who has Covid.  Yay.",
        "We had one like this in 2014.  Six feet of snow.  It was difficult to keep up with, but if you didn't want to be trapped in your house you definitely had to keep up with it.",
        "We got hammered overnight in Far NE Ohio wife said we have over a foot and a level three snow emergency today fun has begun",
        "i remember watching you when i was 8 and i came back and im happy yall are still working hard O:-)",
        "Where I grew up in NE IL we call it thundersnow",
        "I can't even fathom 4 ft of snow, let alone 6ft. I also can't fathom hearing thunder during a snowstorm. Hope everyone stays safe.",
        "Snowblower is greased, fueled, with fresh oil and belts… ready for YOU Mother Winter ️",
        "West Seneca here",
        "BUT BUT it can't be Snow what about Global warming  ROFLMAO   lololololololol",
        "You lucky folks in buffalo!!!! Man I wish I lived in buffalo lol",
        "Just finished with playing snowball with my doggo outside! Grand Rapids has too much snow right now!",
        "I live in Watertown, NY.. I just moved back home last year after living 25 years in Arizona.  There's parts of me that are excited to see this snow again because I remember the snows and blizzards we had when I was a kid but I'm 66 years old now and I don't know if I have the energy to work through any issues that we might experience.  I hope everyone heeds the warnings and stays safe. Please don't go out on the roads. Take care and be well.",
        "I just subbed. Looking at your predictions for Buffalo take place right now!",
        "I see Meadville ",
        "Father God I pray you watch over all the FOLKS who are in in the path of these s snow storms and help them. In Jesus name I pray. Amen. Praise you Jesus.",
        "So such thing as too much snow.",
        "Oh joys! My last snow season in the NY, it began snowing this time of year. It snowed every Sunday afternoon and snowed every day until late Friday night. It stopped just long enough for you to find pavement, porches, decks walkways, and driveways. Clean off your roof too... It continued that pattern for the entire winter and into mid spring. We amassed a snow pile between our deck and driveway that was well over 14 feet tall. ",
        "One of my besties from SUNY lives on Grand Island.  I'm'a gonna worry, but I did share your video.",
        "Who cares about the East Coast anyway I live on the West Coast and the weather here is beautiful this is in the way I like it not freezing cold I don’t concern myself with Baccis the weather I know it’s always cold never has changed it gets cold and stays cold all winter",
        "Milk n bread time",
        "What happened to your teeth?",
        "I'm  in buffalo,last seven foot storm a few years back was survivable and will be now,we are a hardy bunch here ",
        "This is why you prep. Hopefully you have enough food and water. Get it now if not!! The electricity can go out during this..have something to heat yourself without electricity!!\nGood luck. I'm in Florida it never snows here. We just die from the heat!! 50 inches of snow..holy cow!",
        "No obvious views of the headbutt destruction I saw in this video.  Hope you are feeling ok and get it fixed soon my friend!",
        "Notice the weather avoids Chicago totally. Cowardly",
        "Hey Ryan!  I live in Darien, NY.  20 miles east of Buffalo.  Usually right in the LEF line.  I'll send you some pictures if I get a chance.",
        "Ryan is a weather prophet. Just saying.",
        "we just had thunder here in Orchard Park NY in the beginning of the blizzard",
        "Awesome, I didn't know you had a youtube channel as well. Been following you on tiktok for a while. Love your content.",
        "Number 28 on trending! Nice job Ryan you have come a long way",
        "Will this be like the blizzard of 1977?",
        "Boy am I glad I live in the sun tropics now. I’d rather hurricane threats than snow.",
        "Wow! That’s a lot of snow! The only time I have seen that was when we were stationed in Germany. We literally had to dig our self out every 2 hours since the snow was up to the roof. If you didn’t dig out you suffocated.",
        "Lynda from rural Maine, And they have to get all that snow off of their roofs.  Good luck, praying for you.",
        "Watching 4 days later. I only got 4' 6\"",
        "even if my day is the worst, cookie's videos always cheer me up. you never disappoint us\n\nedit: hope u feel better soon and that the medicine doesn't taste that bad",
        "Ryan you underestimate the snow removal technology we have here in Buffalo. The best in the world. They will be prepared for it. Travel will still be difficult though.",
        "I'm right in the middle of it .I can't wait for it to really kick off ️",
        "ya trending buddddy nice!",
        "Love watching you, do you think there's anyway you could turn up the volume, mic up, please thanks , God  bless you and yours ️",
        "I don't think Cory realises how many people watch his videos till the end  B-)",
        "Wow!!  Weird weather!  Can anyone say global warming?  When is something be done?  When all the glaciers melt, we'll be under water!!  Not kidding.",
        "I live in SE Michigan and feel like we haven’t had a winter with a ton of snow in a while. I’m hoping we get hammered this year!!",
        "Will be cold here this weekend in Central Florida (relatively).  It was 50° this morning, but luckily it was sunny. For us being in the mid 60s for a high is cold. But it's a nice change. My prayers for all of you up north. Lived in Denver for 35 years and we had 5 ft snows in the foothills. That is tough to dig out of",
        "I am just east of syracuse and we will probably get 1 inch while watertown and buffalo are going to get feet of snow. Seems way to early for this . And so starts the winter in the Great Lakes.",
        "I split the rest of my wood today, ima be warm for this :)",
        "I live in Buffalo. It's crazy here now and it's only gonna get worse, but it's Buffalo this is our winter.",
        "Weather Service office to get the most reliable and up to date weather information as possible.",
        "I Live in Clarence in buffalo and it’s about one and a half feet of snow at one but I won’t see it for myself because I’m going to Florida for the week but I will say the flight was cancelled so I had to drive out to Rochester to get a new flight and it’s snowing but it’s only around 3 inches and everyone else in buffalo I wish you luck ?",
        "You're right Ryan, a snow plow can't move 6ft of snow very fast.... That's why our plow drivers & DPW crews end up with 90-100 hrs a week in this. They'll start plowing when there's 3 inches & only sleep 4 hrs a day till the storm stops",
        "️ I am that colorado guy ",
        "People from Long Island..\nGet ready..get your shovels out..\nAnd if you use mine..\nPlease put it back where it belongs.",
        "Currently staring at 5ft of snow outside here in Buffalo",
        "I got to university at Buffalo I’m hype for some snow, can’t wait to go skiing",
        "Can you like just not do that face or any faces I think a more artistic thumbnail would be more interesting",
        "I am inside safe and sound, but hit hard with snow.",
        "“I gotta get the bread and milk! They said SNOW!!”",
        "I grew up in the Thumb of Michigan and 3 years in Plattsburgh New York; these storms are incredible and this guy does an incredible job of talking about it!!! Really, really good stuff! ",
        "The app is $8.99 before downloading, and the reviews state that there is a subscription to get most of the features unlocked.",
        "Horse hockey,  everyone knows that go bo wamming dried up the great lakes in 2000",
        "Most of the northern tier states have very good snow removal plans. They wouldn't wait until the storm was over to remove the snow, they would be going around the clock in shifts to keep the main roads open. The real danger comes from having that amount of snow (6' if the forecast is accurate) on top of buildings and homes. That's quite a bit of weight, more weight than can structurally be supported, and there are going to be buildings destroyed by this. North and South Dakota had a major blizzard in the 1990's, that caused 10' snow drifts across the roads. Traffic moving through these areas had a literal wall of ice and snow on either side of the road, that stretched for miles.",
        "Global warming ,  enjoying ",
        "Thanks Mister.",
        "It is bad her in jamestown ny",
        "For everyone in Buffalo, be safe break out that Yall-o-meter!",
        "Hiya Ryan. Yes we have alot of snow already here in West Michigan.",
        "Talk about bread and milk....",
        "SW Michigander here, and we are planning to just have a lazy weekend. My kids are excited for the snow fort they are going to make. Buffalo is going to have it ROUGH though.",
        "I have my Ya'All O Meter outside and ready to measure. I am 85 miles southeast of Buffalo right below the huge snowband....I think! So I will be sending pictures!!!!",
        "One thing about the weather, there's nothing you can do but wait it out! I do not envy the people who have to dig out of this mess, but their used to it because this isn't the first time it's ever happened nor will it be the last!",
        "Hello from West Seneca NY ( Suburb of Buffalo). Just want to let ya know that most of the area is back up and running. The Temps are in the 40's and the snow is already melting. A good amount of the  snow should be melted away by the weekend.",
        "If any city knows how to dig out.. it’s Buffalo.",
        "Got over 5 ft. here in Watertown NY..the reporting comes from the airport..lower than actual...woo hoo!",
        "It has begun and all I can do a laugh! Buffalo is about to get Smoked!",
        "LOL poor buffalo That’s an insane amount of snow",
        "Live in Buffalo, get snowed on.",
        "People can access live cameras on YouTube to watch  Watertown",
        "Get yourself ready, then you can just kickback and relax while you wait it out. Stay safe.",
        "Send that snow to the Southeast, please. We have not had snow below Atlanta in 10+ years",
        "Ryan im in downtown Buffalo and white out . we are seeing the snow piling up already. it started at 730 and i see and 1-2 \" already.",
        "I live in Dunkirk NY. It's pretty bad",
        "Ugh why can’t I snow like that in Washington State. I love the snow.",
        "Syracuse gets more snow than Buffalo, but they never get the severe lake effect snow storms that Buffalo does.",
        "Show us them teefies Ryan  I’m sorry I couldn’t resist ",
        "It's called \"Lake Effects\".   relax chief!",
        "I'm in kingstion ontario were ready for the snow, same as we are every other year. this is nothing new i have seen worse. the only people who will really be affected by this are people who are not preped for it. should have at least a week of food in winter just in case we get a few days of heavy snow.",
        "\"Look at this, are you looking at it?\" Caught me off guard ",
        "Thx for taking about southern Ontario, we're expecting snow over the next 3-4 days. Blessings ️",
        "Y'all are going to have to make a y'all- o- meter ladder  at this point to measure the snow depth...  Geez. I hope everyone can stay safe..",
        "Thank you Ryan",
        "i LOVE being a native Buffalonian living in Hamburg! ️️ LOVE THUNDERSNOW and Blizzards! i was outside in the snow for 3 hrs last night making sure preparations have all been made with everyone in my extended family! Grocery stores, gas stations, drug stores were packed last night!  been a fireman for 18yrs n storms get me so excited!  we're all prepared! bring it on Mother Nature!",
        "I subscribed, love your passion for snow and passion for all things related to weather it is a fascinating thing to learn about indeed!",
        "i get to try out new snowblower...just got my nokian tires put on and ready",
        "Its never too much snow 🥹",
        "Fudge I live in Depew",
        "Kentucky here. Check in on us if you can please when it comes up. Ty.",
        "LAKE EFFECT SNOW, THAT AREA IS ALWAYS BEEN THE MAJOR SNOW BELT. IT'S A NORMAL YEAR FOR ONCE.",
        "Woohoo ready and waiting in southwest Michigan. Will be outside playing with my dog .Staying home .",
        "Everyone going all crazy over a little snow. It's just snow, relax.",
        "Ryan, this is LAKE EFFECT snow and it happens every year.  WE appreciate the heads up, and places like buffalo are the exception.",
        "Whooo Fife Lake Michigan! I’ve been playing in the snow with my rc crawlers allll day! I’ll tag ya Ryan",
        "Roof loads, yikes! ",
        "So I’ve only ever lived in Texas and I’m curious - to those who live there, obviously y’all bunker down, but is there anything done to alleviate the potential damage to your home in the middle of it? Hell, how do you ensure you don’t get trapped inside? Or is it a full on crank the fireplace and see what happens?",
        "let’s go on a rescue mission",
        "I'm in West Seneca... Its gonna be a wild weekend. Giving me blizzard of 77 vibes  ",
        "The great white buffalo",
        "Ryan - I count on you for where my son lives in Alabama and the tornadoes - now I depend on you as we live in a suburb of Buffalo - TY so much for all you do!!",
        "I live in the WNY suburbs, but currently I am in Dallas, TX for work related meetings. Tomorrow, I plan fly home and hope to land at 6pm ET in Buffalo. I really appreciate the updated video!",
        "Thank you Ryan! I’m in New Jersey please keep us updated thank you again ",
        "“No more snow”\nAl Gore\n“Global Warming “\nAl Gore",
        "I've been through alot of thundersnowstorms in Minnesota.",
        "Global warming?",
        "Reminds me of that ice storm decades ago. Prepare to blanket openings and gather in a room with a heat source.",
        "Ryan Hall is \"America's Meteorologist\" and with the best personality too! He makes all the boring details..........fascinating!",
        "I enjoy the snow. Love from MI! I’d appreciate one dry day though, the lawn needs one last trim\n\nHopefully NY and other places will be alright",
        "Rochester, NY here  I'm so happy this is missing us!!",
        "Awww, poor Easterners can't handle snow.  Never have.  Now about that global warming issue.....",
        "You are better than most weatherman..lol ",
        "Thanks for the update for Western Michigan.  Hanging out in Cadillac",
        "All I can says is .....HOLY CRAP  keep it away from Massachusetts !",
        "Dood I'm in Lockport (just North of Clarence) looks like this weekend is going to be interesting",
        "Are the Bills playing at home on Sunday ? You will not find the stadium.....",
        "Hi Ryan! On dark sky I am seeing a pretty big yellow blob in the gulf if I fast forward to Sunday Monday. Can you tell us what’s going on down there?",
        "Blech.  Looks like the algorithm strikes again in regards to the thumbnail.",
        "What about Maryland?  Seems like you stay away, need to know for us",
        "As someone from Central Ontario couple hours north of Toronto thank you for including us",
        "RYAN...YOU ARE THE MAN!!!",
        "This is just the beginning as our  magnetic Shields weaken we will start getting 12-ft storms I believe",
        "Greetings from Buffalo where our natural disasters just melt away... For the record, you CAN'T plow 6 feet of snow. It has to be picked up and trucked away....",
        "I love snow",
        "Syracuse seems to narrowly escaping, what snow we did get is gone already. Thanks Ryan!!️",
        "Good they can have some more, mocking God.",
        "This aint nothing. Buffalo can handle it. Snovember 2014 was fun I was on my bike when it started. it was great jumping of the front porch to shovel the door open. Shout out to the National Guard for helping us",
        "Hey Ryan. Been hanging out over at Brandon's and Vince's. Kinda missing you and Barry Bones and the rest of the y'all squad ",
        "Believe me, the people living in the Southtowns below Buffalo are VERY well aware of what is coming.  My husband grew up (and we lived there for 20 years after our marriage) in the Jamestown, NY, area and had 109\" average snow fall every year.  Buffalo gets more.  You had staples in the house.  You had snow shovels ready.  You had clothes for such things.  The snow removal crew (plows, big tractors, dump trucks, etc.) are some of the best in the nation (I wish all southwest OH snowplow drivers had to go train there in Western NY.)  The high school in our little town there regularly had kids riding snow mobiles to school.  It rarely closed, either.  This storm would suffice to close schools, though!  lol",
        "Tell mother nature to send some down to metro Atlanta ",
        "I live in Hamburg and it’s weird thundering e we have the hatches battened travel ban schools closed we are waiting",
        "I was in Buffalo in mid March, spent a couple nights there, not this year but..... They were mowing green lawns.  I asked about the snow bands and how much snow they get.  I was told a couple times that its NOT Buffalo that gets that amount of snow.  .They said the storms always miss them and hits another close town.  They said weather reporters use Buffalo because people know where it is and not the other area that it actually hits.",
        "Ryan I recently came across your main channel and now this one aswell. When I was younger storm chasing and meteorology was a very big interest of mine and your channel has really revived that interest. I like how you explain things and you make it easy to follow and interesting to watch. Thanks for doing what you do!",
        "im just gonna pray ............",
        "I’m in Buffalo now we are getting hammered right now",
        "Had a 4 day weekend thanks to this storm!",
        "F’n CANADAAAAAAAAAA",
        "If the wind comes from the NW, Ithaca will get snow bands.",
        "Yes!!!!,!!!!!!,",
        "The trajectory of the snow bands looks like Jack Frost is peeing on Buffalo in the projected forecast",
        "Idk why, but this makes me miss living in Buffalo",
        "I am in NY State North East of Buffalo and South of Lake Ontario we are prepared if we get large amts of snow after all we live in NY State",
        "Browns bills is gonna be some great television",
        "GO BILLS!!!!!! ",
        "Are these extremes caused by climate changes?",
        "I want to see a thunderstorm blizzard with lightning and ice tornadoes.  Minnesota here has not been what I remember.",
        "OMG! Be safe everyone!",
        "Please, what about  North Central Texas (Fort Worth Area?) Bad news first then good news, I hope.",
        "Meh. Lived in the Sierra Nevada for a few years. 5-6 feet of snow wasn't a shocking event. I'm sure Buffalo is used to this, as well. Things shut down for a few days and then you get back at it again.",
        "I’m from Colorado, I care ",
        "Guess I’m not going outside lol. Last night we had thunder snow. Stay safe Buffalo.",
        "4-5 feet will shut down a city and take awhile to dig out, if its heavy (and it will be) it can also knock your power out so get prepared if you're in the region.",
        "Thank you honey. Colorado is watching.",
        "... 'too much' yeah because the drought isn't the main issue in some parts of the west",
        "You gonna have the storm chasers in the snow?",
        "Can't wait! Gonna be an awesome snowy opening day of gun!",
        "Had our first snow in Missouri a couple days ago. You predicted our first snow wouldn't be until mid-late December. You're definitely on track for being a meteorologist. Lol",
        "Out on long island I want a whopper storm this year, 48 hours of snow would be awesome.",
        "Yes with cold coming from the north mixing in with the swirl and all that open water of the Great lakes some areas are going to be in trouble ... Can't believe you mentioned my hometown Ryan Watertown New York thank you",
        "Sir, your relay of information has indeed broken hearts. Not your fault at all but it happened.",
        "My heart goes out to these people I could not imagine this happening in my life right now this is like a hurricane of snow think about it without the horrible winds but 6 feet of snow that’s where roofs collapse and then if they get a warm  that snow becomes tons of weight and yeah it’s gonna be really horrible in fact it’s going to be. Preacher PaulD",
        "I told this cute girl about this happening and she’s from the Deep South so she hasn’t seen real amounts of snow belore. So she asked, how to they get out of the house. I replied to her that they don’t if they let it get bad enough. She was astonished it was adorable lol. \nI pray for them.",
        "You were wrong when you called for Chicago’s first snow fall on the bean.  You said December 6th would be the first day but 2 days ago there was enough to cover the Bean.",
        "Out of all the people vanoss played  with, I wasnt expecting to see Velocity again. Nostalgia hit me really hard.",
        "Shout out to all those north of Watertown to Alex Bay be safe be prepared. This looks like a wicked storm from back in the 90s which shut down everything including power for weeks.",
        "Well Blizzard if 78 snowed us in for a month",
        "You were correct prediction of first snow. Urbana iowa,15th Nov. you said 16th. Close enough.",
        "The 12z HRRR had 70 inches just south of Buffalo, NY. That is just wild!",
        "Got my first inch of the snow I’m expecting 3-4 more feet",
        "I live in southern Ontario near lake huron and looks like I'll get hit by a Decent amount",
        "I'm disappointed S.E Michigan isn't getting any",
        "Awesome video Ryan",
        "My prayers to all my loves in Upper Michigan. 3-4 feet snow drifts are common with the lake effect combined with winds. Crazy to imagine 5-6 feet in one storm. That's too much indeed. Worry worthy. Many prayers to all in the cross hairs.",
        "I live between Buffalo and Orchard Park, picked up about an inch and a half in Lackawanna over the last 25-ish mins.",
        "lake effect snow. 20 miles south and nothin.",
        "You should talk about preparedness including, NOAA Skywarn, and ham/gmrs radio use. Maybe pair up with Josh from Ham Radio Crash Course on how radio can be critical in weather/enviromental disaster. I'm both an amateur radio operator and Skywarn spotter, and participate a lot with emergency communication groups and [FEMA] CERT.",
        "We here in NH just got our very first snowfall in Manchester minutes ago! It didn't stick, but the flakes were big and heavy.",
        "What about Hawaii?",
        "You need to make a video about the resources you use.",
        "Thank you for the info.. Michigan..philly.. Florida..family everywhere..got it..amazing..",
        "wild",
        "My son and daughter-in-law just PCS'd from Hawaii to Fort Drum. They were really excited about snow.....YIKES!!!",
        "Eastern Québec we will have more snow in Décembre that we had on the last 10 years this is bizzard. Hope it doesnt hit Montréal. Please incluse us you are better then our prédication. Merci",
        "hahahahahahahahahaaaaa!!!!! XD",
        "I can remember my uncle telling me about when he was a kid he grew up in the state of New York and one winner they had to go in and out of the house through the Second Story window.",
        "yep im between erie and buffalo.  everything is already getting closed for tomorrow",
        "Im from Hamburg, i can't wait",
        "I live 20 minutes south of Buffalo, New York. I'm right smack in the middle of it. It's like training rain but training snow that wavers. Lake Eire 52 degrees. Eden 46\"?  I bet I see more?",
        "2014 that snow storm was brutal. Went to work on Sunday night and never came home until Friday afternoon and I was lucky to make the drive as they had most major routes shut down. Got a hotel room and remember looking out the window at a wall/curtain of white towards the south for days. The Lake was angry and took it out on the Southtowns lol. Good times.",
        "Global warming",
        "Snownadoes?",
        "I live in the snow belt in northern Michigan, we aren’t getting much at all, 2” on the ground. \nWHERES OUR SNOW?",
        "Don’t say we never give you anything",
        "Really like your channel, would like to see more about my good ‘ol rocky mountains in Idaho.",
        "Live right in the direct hit area of the 2014 storm 7ft, live right in the the area of this one …it’s Buffalo not the first won’t be the last It’ll be fine.",
        "I absolutely love snow, I'm honestly a bit jealous as a Mid-Wisconsin weather nerd.  Although, with extreme snow events like this there is a significant danger to life, especially while driving, so I hope everyone stays safe. Please prepare yourself and don't take unnecessary risks. ️️",
        "My home town of Buffalo",
        "Some people stock up on bread and milk when bad snowstorms are predicted. I get wine and snacks.",
        "I bot radar omega",
        "There's no such thing as too much snow",
        "I live in CNY and I'm old enough to remember the blizzard of 93. This reminds me of that. Hope everyone in the Buffalo and Watertown regions are ready.",
        "Good luck buffalo . Stay warm",
        "It’s been snowing for three days non stop here in iowa",
        "Thank you for keeping us informed.",
        "Get snow tires if u can, and drive slow and smooth.  Don't be afraid to stay home, if u feel like it's too hairy for ya.",
        "Im from NiagaraFalls, but work in buffalo so this should be fun lol",
        "There was thundersnow in Minetto, NY (just outside of Oswego) this morning.",
        "In Rochester, NY....hope it misses us",
        "Blizzard started 11:15 PM EST.  9:11AM EST  we have 20 in. plus in Orchard Park, you only see about 50 ft.  Parts of Hamburg and West Falls NY has lost power.",
        "Hit casper wyo today, almost a foot. Cold as all get up. Glad my job is an outside one lol.",
        "Will any of this precip eventually reach the Misssouri-Mississippi watershed?",
        "Buffalo is well equipped to handle a snow storm.",
        "Blowing snow here in Grand Haven, MI...right on the shores of Lake Michigan! Kids are praying for school closings tomorrow!  Be safe and drive safely!",
        "YOU COULD MAKE THE BIGGEST SNOW MAN EVER!",
        "And yet some (crazy) people want this.️",
        "I'm in Tonawanda and I hope it stays south like it usually does. Unfortunately orchard park is where the bills play so that game may not be here this weekend.",
        "I’m close to Philly bring some snow ️",
        "It was sad here in the lower ends of Indiana we were supposed to get one inch of snow and we got zero go figure Cincinnati from what I hear got the same boat.",
        "Structural damage will be a reality with 6 feet of snow on roofs.........",
        "Stay safe out there, everyone",
        "Send sum snow to Canada please. We just have a dusting.",
        "I live in Buffalo and I was a kid during the Blizzard of '77. All I can say about this is \"so what!\" It's winter in Buffalo; grab a shovel. Snow is essentially a frozen flood. I would much rather live in a region where we can move our flood from the driveway to the front lawn than in an actual flood zone. There are no forest fires, no earthquakes, no hurricanes, no tornados... Let it snow!",
        "Blizzard of 77:  Hold my beer.",
        "I’m in Rochester NY and I’m soooo happy that we aren’t getting the nut-punch this time.",
        "More than 6 ft .\n. Watch",
        "i blame this coldness to north korea...the misil....USA is not talking ..when they should...this is what i know....",
        "I bought one of your Y'all - 0 - Meter 2.0 × 1 recieved it and set it up, but one problem, it is not tall enough for these stormes. LOL 48\" isn't tall enough for this part of the country.",
        "More snow, the merrier!  Nothing like snow slushies!",
        "This Bills game this Sunday is going to be insane if it even happens",
        "Closing the thruway at 7pm and hunkering diwn till it's over.. This ti shall pass.. Been through it time and time again..  Again you will see why Buffalo is the city of good neighbors. They will dig each other out and get it all back online... I moved ti SC 2 years ago.. The National Guard is on standby and ready to go.. Go Bills",
        "I live in WNY dude we are READY for it ",
        "maybe don't assume we know some things-newer viewers might not get some old references. Great vid, love your stuff.",
        "Too much hype.  Get yourself a 12 pack and ride it out.  Always look in the background of the news caster doing the weather outside and you will see cars and people going by.  We do a terrific job a snow removal.",
        "Its Called Thunder snow and have seen it here a few times , once a few years ago it was snow and was outside cleaning the driveway off with my 2 sons and it lightning and thunder at that time and looked around and both was running to the front door neither one came back out the rest of the day . LOL",
        "Thanks Ryan. Sorry to hear about what Echo did.",
        "You're right Ryan, I don't live in Colorado and New York so I really don't care about them communist state's but it's fun seeing how the weather treats us all on every corner of the country.",
        "We're  snowmobile riders up here. Tug hill plateau is our riding area. Let it snow",
        "Thank you Ryan for keeping everyone up to date on the weather.",
        "Buffalo and Rochester always get hit harder with snow storms!",
        "From a person who gets 6ft of snow yearly:  yall need to set up your blizzard box!! be prepared to ge self sufficient for at least 2 weeks. Be prepared to have no power or gas!!! 2 cans of food, 1 gallon water At least 2 jackets/ blankets PER PERSON! Flashlight, magazines or books, and know where your \"bunker zone\" is.  I define a bunker zone as the warmest room in your house away from windows and doors that you can stay in just in case the power and heat goes off.  You can use blankets to make a room if you need.  Warm teas and hotcoco go along way, but make sure you have food that doesn't need cooked as well as your power outages could make it impossible to cook. I recommend adding a camping stove to your \"blizzard box\"",
        "Damn Ryan, your YouTube vids make me want to put together a storm chasing stealth camper.",
        "Ryan how can I send a video. We caught lightning in the lake effect snow this motif lake Onterio . Crazy lake effect now by Oswego",
        "Would you rather have 12 hours of 150mph winds and rain?\nHold my beer...Hurricane Ian",
        "Lol i'm in southeast AZ, i'm used to being ignored by Ryan.",
        "I've been called into work to head up towards Buffalo N.Y. in prep for snow removal.",
        "I live north of syracuse  south of Watertown.  We woke up to 8\" heavy wet snow, snowed all day. Chickens are pissed.  We take what we get because no one really knows what the tug hill is going to end up like. Prayers for my friends in Buffalo NY and Watertown.  STAY SAFE AND WARM!",
        "rip everyone",
        "Jamestown NY. we already got more snow then what they were calling for and its still coming down ;(",
        "I sure am glad we got a nice cold weather streak goin on here in the panhandle of FL, wish that snow would make it's way here ",
        "I will update",
        "I like the radar view starting at 3:20. It almost looks like I'm looking at steam rising into the air and being blown away.",
        "Don’t forget Erie PA! A portion of I90 from Erie to Cleveland was closed yesterday and will likely close again",
        "Sean Ford Federer",
        "Getting nervous here on fort drum I love snow but this is too much",
        "I live in Mississippi and I swear that thunderstorm comes every year",
        "Sometimes I dislike living south of Buffalo in Angola, This weekend is not going to be fun.",
        "I’m in Buffalo area,  I live in Amherst just North of the city and we usually\nDon’t get the most snow in this area, but these snow totals worry me!",
        "Everyone in newyork better stock up on milk and bread. Stay safe people.",
        "YOU HAVENT SEEN EXTREME SOUTHERN STORM which would change your mind about UN narrative !",
        "Brit in Michigan.🇬🇧🇺🇸 Doomed to horrific winters here.",
        "Hopefully people are smart enough to get food/water alternate heating options in place prior to this. Hopefully.",
        "If you're in the north you should be used to snow that's what winter is about snow storms",
        "These snow amounts remind me of northern Indiana in 1978. A huge snow plow truck got stuck on our road. I don't know how many inches we got but no one moved for days.  It was crazy.  Stay safe everyone and please prepare - just in case.",
        "I used to live in orchard park/west Seneca area. When snowvember hit we got 6-7 ft while my family was in Cheektowaga and they had a little dusting. That belt is no joke. Hope everyone stays safe with the storm",
        "My roommate literally just arrived in Buffalo for Thanksgiving break",
        "Currently just south of Buffalo at my house this morning was 1 ft",
        "Ryan im in hamburg",
        "Yikes",
        "I heard they moved the Buffalo game to Ohio",
        "I wish the rocky mountains could get the snow like Buffalo. I would love it.",
        "If I can't look over all the snow, we've got problems (context: I'm 6' 2\")",
        "I live in Orchard Park.  Believe me, we know.",
        "Appreciate the shout out to Snyder where I grew up!  We do get the big lake effect snows but as you point out usually south of the city.  In the big blizzard of 77 (January) we had 6 feet of snow, 60mph winds and didn't leave the house for a week!  Welcome to Buffalo!",
        "Is this related in any way to the weakening of the polar jet stream or nah?",
        "Hey Buffalo do you get a snow day?",
        "Hi Ryan... My mom was always talking about your posts and how you were doing better than our local weather forecasters... Her handle was Sagesdragon, she finished her battle with leukemia and has gone home to the Lord... Just wanted to thank you for all your hard work putting these posts together",
        "Living on the coast of Lake Michigan, send help",
        "Be Safe everyone up north. We are saying Prayers for all of you. I am from FL and we just went through 2 Hurricanes. Luckily we are Ok. Thanks to \"Ryan and the Y'all Squad\". Love y'all!!",
        "Find the money you gave to the man and woman, that lost everything from Ian. May God bless you! May God bless you to do more good works! Very kind",
        "I live in Watertown. Schools shut down for tomorrow around 6 PM tonight, before it even started snowing. That’s pretty rare around here. Should be an interesting one.",
        "I’m in lower Michigan around Grand Rapids area on the west side of the state and it’s been snowing hard on and off probably got three or 4 inches since last night and it’s still coming down",
        "Won't snow in DETROIT REST OF 2022.  RIGGED.",
        "By the way we got snow already here in southwest ohio",
        "I like the reports , & I like your videos but my thing is I live in Philadelphia, PA.  A band from that storm shows it's going to move through here as the one north was . Why did you skip Pennsylvania? You could've gave us at least a short briefing of it.",
        "My daughter works in Watertown NewYork just shared this ",
        "Better get the \"bread and milk\"",
        "In Lackawanna, NY immediately south of the City of Buffalo.   Between 7:11 pm and 9:11pm, we went from NO snow to 4 inches.   30 mph gusts?? Nah, the gust are faster than that.   If the were sustained, this would be classified a blizzard.   It stopped snowing for about an hour, and now @11:30 pm it's coming down pretty hard again for the last 45 mins to an hour.    And let me tell you about the ThunderSnow! Firstly, if you live in WNY, it's NOT rare, but I honestly don't remember having THIS much thunder and lightning during a snow storm.  Not even the October Surprise 2006 or Snovember 2014(when there was 6 feet of snow on my street).  Long, sustained thunderolls. Bright lightening flashes.  Blinding whiteouts.  It's NOT fun here.",
        "A Ryan hall y’all video being too long?! No such thing!! Actually wouldn’t mind it being longer lol y’all squad always on fleek ",
        "I live just south of Buffalo, and it’s an intense storm. It’s snow, thundering and lightning right now.",
        "Bring it on in the 716",
        "i’m just north of buffalo! Excited but nervous for this storm",
        "When clouds of iron gather nigh, blackening the winter sky\nStorms gather fury from the lake, best hurry home and refuge take\nFor soon the worst will come to pass, and ice will turn your routes to glass\nWhile in the north the beast awakens, from his year long slumber taken",
        "This is not a new type of event. In lake effect snow areas lets say in Buffalo N.Y.  Look at any 70+ year old house. And you will find what is called a snow door. a door on the second level of the house that seems to go to a upper level porch but there is no porch. a Door to nowhere lets say. but when you would get these types of storms  more often in the past the door came in handy.",
        "Too.Much. Snow.\nI'm sitting here in west Michigan planning on being stuck in my house for the next few days. \nThank you for the update, as always!",
        "I Love my truck",
        "Buffalo says, “No problem. 10 feet? No problem. Postpone Bills game? That’s a problem.”",
        "Hey Ryan when we get that much snow up north they pull the plows off the roads and use earth movers to plow the snow. Just FIY",
        "Let go Buffalo!",
        "I had heard a saying once that there is no such thing as too much snow",
        "Seminole County wind speeds or nuts",
        "this was small as 1977 was concerned!",
        "Glad I live south and some  miles from Lake Erie . Still got snow!! Good for snow men. I'd say 6 to 8 inches so far. Drinking a Tim Hortons  peppermint hot cocoa  while I watch this WNY people I highly suggest you get one ",
        "Them plow trucks better be running all day.",
        "I live north of Watertown  that stretch on 81 to Syracuse is white-knuckle driving",
        "And the Bills and Browns have to play a football game in this good luck to them.",
        "Well, there goes thousands on Reddit fighting the DUMB FACE thumbnail epidemic on Youtube. I'll be hitting DO NOT RECCOMEND CHANNEL.",
        "Hey y'all! We're having thunder snow right now! ☇!Hunkering down in West Seneca.  Looks like we're near the bullseye again.  Stay safe everyone!",
        "I live in buffalo and my dad’s birthday is nov 18 and 2014 snovember I felt bad he was shoveling for like 3 hours ",
        "I live in Ontario, and the term lake -effect snow makes me break out in hives. Someday I will spend my winters in Florida. Canadian storm chasers are already in Buffalo.",
        "Go Bills!\nWe're going to get smacked hard with this one. One local TV weather guy was saying blizzard like conditions",
        "Everyone around the Great Lakes needs to prepare. Stock up on all the essentials! This is gonna be a hard next couple of days for y’all!",
        "Glad I live in CALIFORNIA!",
        "Hey Ryan , thanks for another great report . I live in western Mi. and its about 2 pm here. The thunder snow storm that you are predicting is just now comming upon us. It is beautiful ! I always keep a well stocked home so I'm just enjoying the wood stove and the beauty of the season. I hope everyone out there is doing the same.",
        "Stay safe. Stay warm.",
        "Looks like the NFL made the right desicion to move the Cleveland Bufallo game.",
        "Come on Ryan , work your magic and make that six ft fall in Greenville michigan lol I want 6 ft not 6 inches lol",
        "The 2014 storm was fun so I think we'll be alright this time. I think we're more prepared for this storm as well.",
        "now can we stop paying carbon taxes and start drilling again?",
        "Zane: \"I think that is enough farting for one day\"",
        "How do I buy Y’all o meter?",
        "I live in Chardon Ohio we had a storm on veterans day in 1996 got 77 inches of snow basically same snowbelt as buffalo we didn't get hardly anything from this current storm now asthabula ohio did get 20 inches from this",
        "Will georgia see snow this coming year",
        "checking in from Derby NY, we'll keep ya posted!",
        "An inch of snow is too much for me. I’d never survive up in Buffalo",
        "My cousin lives in Buffalo and I told her to get to me in Indiana if the weather poop hits the fan. After watching you, I'm cleaning out the spare room ",
        "It's winter in the northeast",
        "I live about 1 hour away from Watertown ny so I know we will get som snow",
        "What about binghamton an Endicott ny",
        "living in buffalo im not concerned 2014 was bad but not as bad as a hurricane.",
        "Can it move south a little? I live in Ft.wayne Indiana and i want some more snow.",
        "Northeastern US enjoying the last autumn month\nCanada: EMBRACE THE WINTER STORM",
        "Cant wait fot the game in Buffalo",
        "Buffalo should cover the spread sunday.",
        "I am in the mountains of Oregon & I need to get that much snow",
        "5 feet of snow by ironwood mi.",
        "It's getting out of hand little too much prayers.",
        "The southern suburbs always get more snow. That'll be fine.",
        "the fact i really want to play with them some time makes me so happy",
        "I’m 20 miles south of buffalo in Aurora. Five inches last night.  Two inches now. It’s 842 pm",
        "My GF in CNY just told me that they have five inches on the ground already. I hope Syracuse and East of that doesn't get hit too hard. Lots of my peeps! TYVM Ryan !! \nBuffalo is indeed an epicenter for lots of snow. I pray their infrastructure is really ready to handle this. Word : the Bills are supposed to have a Home game Saturday! Rut ro! Thank You Ryan and Team! ️️",
        "When can we see this in the sierra nevada mountain's?",
        "Wow!  I am now in Michigan and it has been snowing off and on all week.  Too early for all this snow stuff.  Glad I’m not in Buffalo.  Crazy!",
        "West mi is getting a lot of snow too, not nearly as much as Buffalo but I'm still super excited!",
        "Been watching your show fora cpl years and You've gotten quite better. Excellent episode and my peeps in GR,MI are feeling it as we speak",
        "That part of the country has not changed at all they get all that cold air and that comes down from Canada Michigan has always had a lot of snow in 1981 I was living in Sparta North Carolina in a little town and Allegheny County in 1981 we had 37 inches of snow was nothing on usual I think you’re liking the calamity how about the weather and New York and all that north is always been freezing frigid cold in the winter nothing ever changes it that’s the way it is and it’s nothing you can do to change it",
        "As our dear neglects to talk about why our weather is so rapidly changing, here it is: we are pumping heat energy (about 1.8 Zetajoules/yr.) into our oceans due primarily from burning fossil fuels.     This increases water vapor and the energy in these low pressure systems, hurricanes, tornadoes, cyclones, winds, wave action, etc.     Thus, these lows are pushing more moist warm weather north, and pulling Arctic frigid weather all the way south as far as Mexico.      Too many humans, using too many natural resources, and producing too much pollution.     Get the picture?     If so, there are only two solutions: CONTRACEPTION and REDUCE CARBON FOOTPRINTS.     Stress R Us",
        "so much for that so called global warming.",
        "Sounds like there might be some roof collapses!  Wow!  I pray everyone will stay home cuz if they get stuck on the road in that deep of snow, they will freeze to death before they are rescued.  This sounds bad.  For those who clean off their roofs often, they might spare themselves a new roof and lots of cold air coming in from a collapsed roof.  Ohhh, I'm glad I'm in the south.  I'm in the right spot, no hurricanes, not tornadoes, just a few thunderstorms every now and then.  Praying for those in Buffalo!",
        "groundhog day lol",
        "see who can build the biggest snow man",
        "Yeah Reed had video  this morning. He was still in Alabama  heading  north",
        "I remember as a kid in the 90s we had a huge snow storm that was like 5+ ft was pretty wild",
        "This was WAY more useful than our local news here in Buffalo. Thank you",
        "Love it for the for the snowmobilers ",
        "what about VA is there any snow comin our way?",
        "Upstate NY, can handled it. A reminder to make sure to clear your outside vents on your home's. 6 ft is nothing Oswego holds the record at 14 ft.",
        "In Erie Pa it's been snowing since yesterday morning. We already have a couple feet of snow.",
        "Get in and stay in people",
        "Can we get  forecasts for the PNW???",
        "When it's an hour of Jev you know it's gunna be a good night",
        "Looks like buffalo and Watertown areas are snow town",
        "LOL. Greetings from Tucson, Arizona.... Stay safe.",
        "GEEEZ STAY SAFE EVERYONE",
        "Litterally in the middle of all this chillin at home like its another day and its funny how we had great weather litteraly high 70s then the first time it snows its snow thunder with 6 feet that's great ill he at work tommorow",
        "I used to think those that told the weather were just glorified liars. Then Ryan come along to prove me wrong. I'm in SW Michigan. I do not like what you are saying here.",
        "Do you think that all this crazy weather is the result of Geo engineering ?",
        "Damned global warming",
        "I have lived in Michigan my entire life, it has been  a long time since I have seen this much snow before Thanksgiving.",
        "Ryan Hall like the ufc fighter??",
        "Thundersnow",
        "If your boss calls and asks if your coming to work in 5 feet of snow. Quit your job.",
        "If they can walk rooftop to rooftop after the snowstorm  you know it's bad.",
        "I thought it was kind that you gave that couple $5,000 from Florida. They lost everything in the hurricane, and I was pulled over by your kindness and their response.",
        "I live right in the band about to be hit. Isn't the first time, won't be the last we've had that much snow. My concern is still going to work as I am a healthcare worker so we don't close down.",
        "48\" is 4 feet; 40\" is a meter; for those of you who can't visualize in inches....",
        "I dont know what you did with tour audio, but now I have use closed captions to hear all words spoken.",
        "but I thought the world is warming up :(",
        "SIX to TEN feet, Bucko...",
        "The state of Michigan looks like a mitten,  how appropriate,  LOL",
        "Did ya here we is a getting flash frozen turkeys for Thanksgiving.",
        "Thank you Ryan for all you do to keep us safe and informed. My thoughts and prayers ️ are with those folks up north. From down here in little  Cloverport, Ky. ",
        "This could not have came up in my recommendations. I live 30 min from Buffalo and this is my first year plowing. looks like fun lol",
        "Will be interesting if they can rival some of those February 2007 totals",
        "DEAR BUFFALO : \"YOU STILL AINT SWIPING OUR GOLDEN SNOWBALL AWARD\" Love, SYRACUSE",
        "I live in West New York Alhamdulliah during Friday Prayer it was a lot of snow. Inshallah it will be at its highest during thanksgiving.",
        "Yah we're gonna feel this one lol GO BILLS",
        "I can't imagine Sunday when the browns play the Bills in Buffalo",
        "Must be all that global warming ",
        "I’m watching from Colorado , yes I do care I have family in Michigan n New York.",
        "So far in west of Buffalo where I live only 6 inch",
        "Thanks Ryan for another great video full of IMPORTANT INFORMATION to keep everyone weather aware, PREPARED AND SAFE!!! You're doing a great service and we appreciate all the work you and the team put in to SAVE LIVES ",
        "I’ve lived in Buffalo my entire life, lived in the village hardest hit for Snowvember, and it looks like we’ll be up there for this one as well!  This will be a crazy storm, but nothing we can’t handle!  There will be some people who try to go out, but the same thing happens with people trying to ride out hurricanes!  There probably will be damage, but come Monday, it’ll be life as normal!",
        "Hi guy's I'm in west seneca, ny a suburb of Buffalo, ny not far from Bill's Stadium in Orchard Park. It started to thunder & lightning and about 7:20pm. It is now 8:40 pm white out conditions w/ winds. I'm safe inside but this storm is here and intense.",
        "Buffalo resident here. I have a concert in toronto on saturday. I swear to god i will fight this storm if i have to",
        "It’ll take 2 days for Buffalo to dig out…. Upstate New Yorkers can handle it ",
        "To think about it, 6 feet isn’t that much. I’ve had 4 before, and i never sank.\nMaybe i did a couple times",
        "Bro I can’t wait waiting for the snow ️",
        "I won't be able to recollect no mind doesn't matter",
        "so buffalo is going ti get 4-4.6 feet of snow, then later on a warmer weather and a rainstorm? let the floods begin.",
        "I wouldn't be a cashier at a grocery store in Buffalo right now for all the money in the world.",
        "I’ll never understand why love snow so much. It’s wet, it’s cold, and it’s an inconvenience to a lot of people. Some people could be in danger because of this. BE CAREFUL WHAT YOU WISH FOR. It will end up biting you in the ass.",
        "Looking very similar to when south Buffalo got absolutely buried.  When was that 2014 or so?",
        "We need a warm up in WY. Not cool to have December/January temps for so long in November.",
        "To all who will be hit by this incredible weather front, watch yourselves. Even in Kentucky where the winter is basically a crop dusting I follow the forecasts for Buffalo and surrounding areas.",
        "Best weather information on the planet.",
        "RYAN CAN YOU PPEASE SEND SOME IF THE TO GA???  We haven't had some since the '80's!",
        "It'll be a slow dig out, but this region knows snow. I was living in Lakewood NY in 2000 when that area got between 5 -14 feet of snow. The people will get out their snowmobiles/atv's and have fun first, then clean up.",
        "How about the South Eastern states this winter??",
        "Buffalo is supposed to be hosting Cleveland Browns on Sunday... NFL is stupid enough to try and get the game in too... we shall see what happens",
        "I read  in early September Almanac Calendar predicted snow and lots of it or as you put to much d I es look like come true ️",
        "Just wanted u to know that I sub to u guys and just went on to check weather and it showed that I didn’t so I sub again",
        "Never too much.   Bring it!  Not uncommon for I90 to shut down along the Erie PA to Buffalo leg.",
        "Ironwood is Michigan not Wisconsin lol",
        "It looks better than what I have in Florida right now , it's beautiful ️ not the first time this has happened. As a kid we loved it .",
        "Thank you for all your hard work you are my go to for the weather",
        "That’s so interesting. extremely visible lake effect snow on the radar. I’ve never seen it that visible but I’m pretty new to this",
        "I live an hour south of Buffalo and it’s already starting. We got 8 inches overnight",
        "Thank you for mentioning Southern Ontario. You also showed my city. Lol.",
        "Do you believe Georgia this year will get snow?",
        "Brrrrrrrr........  blessings to all  and be safe ",
        "Be safe everyone.  from Florida",
        "Go Bills!",
        "Just a reminder that many corporations do not care about your well-being, so please don't risk your life for them traveling in dangerous conditions.",
        "I'm in WI, I think I need to move for more snow.",
        "It's,  it's glow bull warming!! LMAO",
        "this snow could stay for 180 days",
        "New York City is going to be next.  When Buffalo gets all that snow, normally New York City will have a blizzard.",
        "Buffalo to Mother Nature \nBring it on",
        "I'm as prepared as I can be, I was five years old during 77' blizzard. As a kid it was neat. As an adult \nI live in southtowns area in suburb outside of City of Buffalo, NY.",
        "I wonder if I could get there in time for my brithday",
        "I lived through the Blizzard of 1993 in Syracuse.  It was nucking futs!  I had to dig out my Dad's car, twice!  We went from no snow to over 6 feet a day and a half.  Snow drifts were 12+ feet!  That was in March as well and a few weeks later it melted and our basement flooded so badly it was 2 feet deep!",
        "Hey, y'all! I'm in Colorado and I still care if for no other reason than No. 1 kid is in Massachusetts. Keep the weather news coming..... Snowing out here too but nothing like that.",
        "About mid 90s, I was archery hunting in northeast oh, it started snowing on sat afternoon,it didn’t stop till Tuesday morning \n18 inches around, that storm put my area on the Weather channels Map, no Bull , it gonna be one of those",
        "Sunday will be an interesting Buffalo Bills game.",
        "I find it interesting how Niagara Falls is dodging all that snow... Should i still be prepared if I'm from that region?",
        "Looks like there may be a threat of flash floods for areas affected by the Bolt Creek fire in the PNW as well.",
        "Aww .. man .. no discount on the radar app?? You need to rattle some cages at the developer’s HQ … JK .. THANKS for the heads-up!",
        "When people asked why I moved from buffalo to Milwaukee, I say the weather. They laugh, but I'm not joking.",
        "Thanks so much!",
        "I live right in the bullseye of this storm, we'll see what happens. I've lived through the hype of huge storms only to have a dusting.",
        "On the Anniversary of our Buffalo SNOWVEMBER here we go again..... but the thunder and lightning while it's snowing is so neat",
        " my family is in Watertown/Carthage area of NY. My uncle is supposed to be coming down here for Thanksgiving...maybe he should have already left!!",
        "I live in north west GA and I would love to get any snow not just slush",
        "But my family wanted my things and with the help of someone else family they took my stuff n hurt me",
        "Yeah I think this is going to be like November 2010 to December 2009 winter weather of 2022 North US states like Kansas-Nebraska Wyoming South Dakota North Dakota Minneapolis Montana Idaho Iowa Missouri a little bit down south I think of snow for this year I don't know that's what I think",
        "@9:26 that looks BOOM!!!!  KABOOM!!!! Ryan.",
        "When the blizzard of ‘77 hit, the city was crippled for a week so we grabbed our shovels and cleaned the streets ourselves. The snow clearing equipment today is much more advanced and if everyone stays off the roads things will get back to normal. If not, my neighbors and I will fire up our snowblowers and take care of it.",
        "As an upstate NYer --Lake affect snow is much more fluffy than say snow from a noreaster type storm so roofs can take more of the fluff than \"regular\" snow.",
        "The radar looks like Smoke coming off the lakes",
        "i am about 50 miles from buffalo south of roc ... wonder how much i will get",
        "Buffalo is going to be buried.  Stay safe everyone."
    ],
    "comments_disabled": false
}