{"video_id": "M89aatieb6A", "comments": ["You go well above and beyond! This is what the Weather Channel used to be when I was growing up, but it’s not the same anymore. So, thank you again for your content!", "Yes, in Buffalo, we call it Thunder Snow and it always surprises people to learn that you can have thunder during a snowstorm.", "I grew up in “the southtowns” of Buffalo and lived through some major snowstorms (including snowvember 2014). The city and surrounding towns know how to handle this. The only risk is people not taking it seriously which does happen since we got major lake effect snow threats all the time that ended up being basically nothing. And when those crazy snow events actually happen, it’s usually not well predicted. Everyone I know has their milk, bread and beer stash for this one though.", "This was WAY more useful than our local news here in Buffalo. Thank you", "I live just north of Buffalo. The last time we had a storm like this was in 2014. In the areas that were hit, people had something like 8 to 10 feet of snow on the roads and their roofs. This storm is slated to hit the same area again.", "I live in CNY and I'm old enough to remember the blizzard of 93. This reminds me of that. Hope everyone in the Buffalo and Watertown regions are ready.", "Ryan you are like my go to \"weather Bible\" Thank you so much for not only what you do but how you do it. I love that you \"explain\" the weather. My grandson watches with me and he just love you too. He's thinking me might want to be a weatherman too when he grows up lol. I just came across you one day on you tube and never left. Thanks again Ryan. You ROCK!!", "I used to live in The Rochester NY area and I learned that anytime you get more than 2 inches an hour they cannot keep up with the snow. I drove up to Rochester to pick up my kid one year and there was walls of snow 20 feet of snow on the thruway south of Buffalo that went on for 20 miles. Check out the thruway cameras to see it.", "Thank you so much Ryan! You are the absolute best!️", "Ryan I recently came across your main channel and now this one aswell. When I was younger storm chasing and meteorology was a very big interest of mine and your channel has really revived that interest. I like how you explain things and you make it easy to follow and interesting to watch. Thanks for doing what you do!", "My prayers to all my loves in Upper Michigan. 3-4 feet snow drifts are common with the lake effect combined with winds. Crazy to imagine 5-6 feet in one storm. That's too much indeed. Worry worthy. Many prayers to all in the cross hairs.", "Be Safe everyone up north. We are saying Prayers for all of you. I am from FL and we just went through 2 Hurricanes. Luckily we are Ok. Thanks to \"Ryan and the Y'all Squad\". Love y'all!!", "I lived through the Blizzard of 1993 in Syracuse.  It was nucking futs!  I had to dig out my Dad's car, twice!  We went from no snow to over 6 feet a day and a half.  Snow drifts were 12+ feet!  That was in March as well and a few weeks later it melted and our basement flooded so badly it was 2 feet deep!", "I absolutely love snow, I'm honestly a bit jealous as a Mid-Wisconsin weather nerd.  Although, with extreme snow events like this there is a significant danger to life, especially while driving, so I hope everyone stays safe. Please prepare yourself and don't take unnecessary risks. ️️", "I told this cute girl about this happening and she’s from the Deep South so she hasn’t seen real amounts of snow belore. So she asked, how to they get out of the house. I replied to her that they don’t if they let it get bad enough. She was astonished it was adorable lol. \nI pray for them.", "Thank you Ryan for keeping everyone up to date on the weather.", "I live just south of Cleveland, Ohio and we got a few inches of snow overnight from the bands that are making their way to Buffalo. Our \"snowbelt\" region in Ashtabula County got SLAMMED! Looks like they almost got a foot. ", "We had one like this in 2014.  Six feet of snow.  It was difficult to keep up with, but if you didn't want to be trapped in your house you definitely had to keep up with it.", "I love being able to watch a fellow weather weenie get excited from storms. ", "Thanks Ryan. One of the storm chasers is already in CNY. He was in my hometown of Parish, NY this morning with 17\" overnight.  He headed to Pulaski, NY for breakfast. \nMy daughter lives in Watertown, NY and they will get hit overnight tonight and tomorrow. We are canceling a birthday party for my granddaughter.", "Hey y'all! We're having thunder snow right now! ☇!Hunkering down in West Seneca.  Looks like we're near the bullseye again.  Stay safe everyone!", "Thank you Ryan for all you do to keep us safe and informed. My thoughts and prayers ️ are with those folks up north. From down here in little  Cloverport, Ky. ", "Got this recommended after the tragic events. You really made literally millions of people laugh and feel entertained, maybe after a long days work or something like that. Thank you, dude. Rest in Peace =3:)", "Thunder snow is a truly awesome weather event to watch. I have only seen it a few times, but once seen it's something you never forget. Also a bit dangerous, so that's something to keep in mind.", "Hopefully everyone stays safe. There’s no way I could live up north in this type of weather.", "Thoughts prayers and meditation for the population of those places affected. Don't be scared be prepared! If it missed you this time it may not miss you next time", "Syracuse seems to narrowly escaping, what snow we did get is gone already. Thanks Ryan!!️", "Everyone around the Great Lakes needs to prepare. Stock up on all the essentials! This is gonna be a hard next couple of days for y’all!", "Thank you for the update for those affected regions Ryan. I AHVE been sharing and even guiding some of my work clients to your channels, hoping they will prepare for this. Most of the people I know in those areas are saying they NEVER HEARD OF THIS COMING. They might all be avoiding news outlets, but still. \"Just some Lake Effect Snow\" they have been told. That's bad enough but this? 4+ feet of snow dumping nearly constantly is not a joke. Have or get a generator, and be ready to shove snow off the roof in the morning and at dusk. If that snow up there freezes, you'll see a huge risk of that roof collapsing.", "Thanks Ryan for another great video full of IMPORTANT INFORMATION to keep everyone weather aware, PREPARED AND SAFE!!! You're doing a great service and we appreciate all the work you and the team put in to SAVE LIVES ", "Thank you for keeping us informed.", "I’m not in NY, but in Oklahoma. Just wanted you to know, a couple of weeks ago you predicted it would snow ️ somewhere in the state on 11-15, you almost had it, it snowed all day on 11-14!!! You are Good!! God Bless to NY stay safe. Out there!! Thanks Ryan!!", "Thank you!\nI live in the lake effect prone area of NWPA, I appreciate the in depth information.  The windward fetch across the lake, and timing is everything!", "I live in Watertown, NY.. I just moved back home last year after living 25 years in Arizona.  There's parts of me that are excited to see this snow again because I remember the snows and blizzards we had when I was a kid but I'm 66 years old now and I don't know if I have the energy to work through any issues that we might experience.  I hope everyone heeds the warnings and stays safe. Please don't go out on the roads. Take care and be well.", "Reminds me of that ice storm decades ago. Prepare to blanket openings and gather in a room with a heat source.", "Omgoodness everyone please stay safe. Thank you Ryan for the updates ", "From  southwest Michigan less than 2 miles from Lake Michigan I can tell you its already a few inches. A life lived mostly near the lake, one prediction/forecast is always the same. The lake does what it wants, when it wants to. We can get buried without warning or get nothing at all when a warning has been given. Love your content and will continue to watch !!", "I grew up in the Thumb of Michigan and 3 years in Plattsburgh New York; these storms are incredible and this guy does an incredible job of talking about it!!! Really, really good stuff! ", "Be safe, I recently lived in a snow heavy region for 16-years, with some years having more than others. Those heavy snow years are brutally dangerous!!!", "Ryan you are an earth Angel! Thank you Thank you Thank you for your time and energy in what you provide us!!! Love your channel so much!!! Be safe to you and yours and to  everyone during these crazy weather patterns coming up!! ", "I pray all will be safe.    Absolutely way too much snow !", "I'm in Niagara Falls, I was 12 when the Blizzard of 77 hit, Thundersnow happened and I always compare storms to the one in 77 , my grandpa use to say Niagara Region was the banana belt, missed so many storms / summer and winter/ and Lake Effect is very Normal for Western NY and Southern Ontario . stay safe and warm everyone .", "The Harry Potter quote and saying she can do what she wants now has me crying, seeing how relived and free she feels. In a world so full of bad endings I'm so happy that, by the looks of things, she got the good one <3", "Yeah, you gotta really keep an eye on this climate warming!! \nSeriously Ryan, I trust your assessment of the weather more than any other! Thanks !! Stay safe guys!", "Hey Ryan , thanks for another great report . I live in western Mi. and its about 2 pm here. The thunder snow storm that you are predicting is just now comming upon us. It is beautiful ! I always keep a well stocked home so I'm just enjoying the wood stove and the beauty of the season. I hope everyone out there is doing the same.", "As a person who lives in watertown, our snow plows clear roads within a matter of hours (like 2-3 hours).  If there is one thing NY does well, its move snow off roads.  Im more worried of the building collapse risk.", "I’m from western ny. Something like this happened in Buffalo a few thanksgivings ago and certain lake central areas got 6 feet snow over a couple days. I some areas you could literally see a line of feet of snow and no snow. Luckily then and this time it did not reach my area a couple hours south of Buffalo, I’m so grateful it’s not supposed to this time to but I wish everyone in surrounding areas the best.", "I can't even fathom 4 ft of snow, let alone 6ft. I also can't fathom hearing thunder during a snowstorm. Hope everyone stays safe.", "My GF in CNY just told me that they have five inches on the ground already. I hope Syracuse and East of that doesn't get hit too hard. Lots of my peeps! TYVM Ryan !! \nBuffalo is indeed an epicenter for lots of snow. I pray their infrastructure is really ready to handle this. Word : the Bills are supposed to have a Home game Saturday! Rut ro! Thank You Ryan and Team! ️️", "Can’t see the broken teeth, Ryan. Hope Echo’s head is ok. As always, thanks  for all you and crew do! ", "If they happen to be out and about, when it occurs,  you might have to do a live stream guiding them through it Ryan.", "Believe me, the people living in the Southtowns below Buffalo are VERY well aware of what is coming.  My husband grew up (and we lived there for 20 years after our marriage) in the Jamestown, NY, area and had 109\" average snow fall every year.  Buffalo gets more.  You had staples in the house.  You had snow shovels ready.  You had clothes for such things.  The snow removal crew (plows, big tractors, dump trucks, etc.) are some of the best in the nation (I wish all southwest OH snowplow drivers had to go train there in Western NY.)  The high school in our little town there regularly had kids riding snow mobiles to school.  It rarely closed, either.  This storm would suffice to close schools, though!  lol", "Ryan love your show , thank you for the real weather.", "Ryan - I count on you for where my son lives in Alabama and the tornadoes - now I depend on you as we live in a suburb of Buffalo - TY so much for all you do!!", "Praying for all those in it's path! Times like this I'm glad I live in the South. Stay safe all storm chasers heading towards this monster.", "Ryan, thank you for the update! Something that came to mind while watching is with 50\"+ of snow, a RAINSTORM less than a week later, then another freeze-up, that spells big big trouble!", "Will be cold here this weekend in Central Florida (relatively).  It was 50° this morning, but luckily it was sunny. For us being in the mid 60s for a high is cold. But it's a nice change. My prayers for all of you up north. Lived in Denver for 35 years and we had 5 ft snows in the foothills. That is tough to dig out of", "even if my day is the worst, cookie's videos always cheer me up. you never disappoint us\n\nedit: hope u feel better soon and that the medicine doesn't taste that bad", "I like the radar view starting at 3:20. It almost looks like I'm looking at steam rising into the air and being blown away.", "I subscribed, love your passion for snow and passion for all things related to weather it is a fascinating thing to learn about indeed!", "I used to live in the Northeast and I just couldn't take the winters.  The anxiety of having to get up early and scrape the snow and ice off my car, shovel the driveway and then driving to work in that mess kept me up all night.  Now, I just sit back and love watching these winter storm videos from my home in Phoenix, AZ.  ", "Woooo  !  TY Ryan .  Everyone  stay warm and safe", "Good luck Buffalo.  I am on the North Western shore of Lake Superior and we are getting snow as well but nothing like all you people . Ryan you never take to much time cause the more we know the safer everyone watching.  Snowshoes do work well when you figure them out . Take care.", "I used to live in orchard park/west Seneca area. When snowvember hit we got 6-7 ft while my family was in Cheektowaga and they had a little dusting. That belt is no joke. Hope everyone stays safe with the storm", "Thank you for the FRESH REPORT, Ryan Hall! God bless you, Sweetheart. And all your beautiful family and Team.", "Too.Much. Snow.\nI'm sitting here in west Michigan planning on being stuck in my house for the next few days. \nThank you for the update, as always!", "Hi Ryan... My mom was always talking about your posts and how you were doing better than our local weather forecasters... Her handle was Sagesdragon, she finished her battle with leukemia and has gone home to the Lord... Just wanted to thank you for all your hard work putting these posts together", "Been watching your show fora cpl years and You've gotten quite better. Excellent episode and my peeps in GR,MI are feeling it as we speak", "Had our first snow in Missouri a couple days ago. You predicted our first snow wouldn't be until mid-late December. You're definitely on track for being a meteorologist. Lol", "I'm in MN, it started snowing lightly Mon night and it's still snowing on & off.  We had NO snow when it started but we have plenty now and this won't melt until spring.  And I'm sure we'll have many more snow falls between now & then!  ", "Mark's persistence in designing his entire refurbishment around the misconception that he will get eggs from all those seagull nests is simultaneously hilarious and infuriating. =3:) :*", "I'm in Rochester. They're calling for less than an inch for us. This shows how localized lake effect can be!", "not too long at all! i love everything you publish! thank you!!", "These snow amounts remind me of northern Indiana in 1978. A huge snow plow truck got stuck on our road. I don't know how many inches we got but no one moved for days.  It was crazy.  Stay safe everyone and please prepare - just in case.", "I actually teared up what a supportive woman, mother, and she feels and sounds so war when she says so loudly AND YOURE MY SON! Kai was so excited and so was his mom. Im so glad that they could celebrate like that. I hope they have a long and heartfelt life going forward. :/ =3:)", "This genuinely made me smile. I love this, it makes me feel 12 again and back in 2013.", "Prayers for these places getting this mountain of snow. You would literally have to dig tunnels just to take your dogs outside. I cannot even imagine!", "That future radar looks eerily similar to snowvember 2014.", "I’ve lived in Buffalo my entire life, lived in the village hardest hit for Snowvember, and it looks like we’ll be up there for this one as well!  This will be a crazy storm, but nothing we can’t handle!  There will be some people who try to go out, but the same thing happens with people trying to ride out hurricanes!  There probably will be damage, but come Monday, it’ll be life as normal!", "I live in Buffalo and this snow storm was like nothing I've seen before.  I live in the city, but went down a place called Hamburg south of the city to help out some friends who live there and ended up being stranded there. As of Saturday November 19, 2022 in the morning 62i nches were reported to have fallen. This is crazy, and some more is expected to fall Saturday night to Sunday, maybe about 1 foot more. What this man says is true. I am living it.", "I'm in Colorado, but I'm still interested in the Buffalo storm as I have some friends here in CO that are from Buffalo. I'm jealous of the storm though. Colorado has had many years of lack luster winters. The last major, city shutting down blizzard was a week before Christmas 2006. The city of Aurora had to send Bulldozers through the neighborhoods to clear out snow. There have been some storms since, but they haven't shut the city down for almost a week.", "Your work is life-saving.  Thank you.", "Grew up not too far away in Rochester, NY, so this weather outlook has my interest from my memories of Lake Effect Storms past (including 1977). I currently live in Colorado, so your comment had me laughing. Be safe, all those impacted.", "Hi Ryan! I am in Cheektowaga New York which is about 10 minutes from Buffalo and our snow started right on time at 7:00 p.m. as predicted And it's coming down cold and heavy at times. Wanted to let you know that we have lightning right now and I'm sure you wish that you could see the thundersnow. I know you have said that before lol . Thanks for all you do, you're great!", "I feel bad for New Yorkers and anyone else getting dumped on right now :( hope you all stay warm and make sure to put portable heaters under your pipes so they don't freeze and you continue to have running water. ", "Blowing snow here in Grand Haven, MI...right on the shores of Lake Michigan! Kids are praying for school closings tomorrow!  Be safe and drive safely!", "thanks Ryan, I watch your weather forecast all the time, even though I'm in southern Ontario, on the Bruce Peninsula, so lake affect is pretty normal here. I thank you again truly, as I've mentioned before, I wish we could clone you for an all Canadian Ryan Hall ! keep up the fantastic work you and your team do for all of us.\nbest wishes,", "Thank you Ryan! I’m in New Jersey please keep us updated thank you again ", "Ryan, 1 year while I  lived in Cattaraugus County, NY - we had 45 days straight of snow.  Drive?  No - walk, snowshoes and snowmobiles.", "Hopefully everyone is stocking up. Stay safe everyone! ️", "I have lived in Michigan my entire life, it has been  a long time since I have seen this much snow before Thanksgiving.", "A Ryan hall y’all video being too long?! No such thing!! Actually wouldn’t mind it being longer lol y’all squad always on fleek ", "That’s so interesting. extremely visible lake effect snow on the radar. I’ve never seen it that visible but I’m pretty new to this", "Number 28 on trending! Nice job Ryan you have come a long way", "Hiya Ryan. Yes we have alot of snow already here in West Michigan.", "2014 that snow storm was brutal. Went to work on Sunday night and never came home until Friday afternoon and I was lucky to make the drive as they had most major routes shut down. Got a hotel room and remember looking out the window at a wall/curtain of white towards the south for days. The Lake was angry and took it out on the Southtowns lol. Good times.", "My heart goes out to these people I could not imagine this happening in my life right now this is like a hurricane of snow think about it without the horrible winds but 6 feet of snow that’s where roofs collapse and then if they get a warm  that snow becomes tons of weight and yeah it’s gonna be really horrible in fact it’s going to be. Preacher PaulD", "I remember as a kid in the 90s we had a huge snow storm that was like 5+ ft was pretty wild", "Ryan is 100% correct. A similar event here in Buffalo back in November 2014, we had a 12 hour long thunderstorm with snow. It would not stop thundering. Ended up with 60\" in less than 3 days. This Lake Effect Snow band looks to be similar.", "I'm in kingstion ontario were ready for the snow, same as we are every other year. this is nothing new i have seen worse. the only people who will really be affected by this are people who are not preped for it. should have at least a week of food in winter just in case we get a few days of heavy snow."]}