{"video_id": "MgxyLV31-vM", "comments": ["AHHHHHHHHH IM SO EXCITED!!!! I hope you guys like the finale!!! I'm so proud of this video and this unexpected journey. I hope you enjoy it as much as i do!!! <3333", "Anyone else got emotional with the repurposed shades, realizing that part of the second Shane palette has always been with us without even knowing it?", "I was going through major depression when the first series and pallet came out. Watching these two interact got me through the toughest times. I’m beyond heartbroken.", "Watched all 3 in a row and cried. Shane and Jeffree saved me from so much depression. Here’s to new beginnings ", "tell me why i started crying when it changed to the shades being repurposed in other JS palettes and especially when people who were reviewing them were LOVING those specific shades. literally SOBBED. it made me so emotional to think of how much effort Shane put into perfecting each shade for the Doomsday palette and then never getting to see people be obsessed with all the shades + how creative someone could be. i want the palette even tho the shades have been used in different releases ", "Aww Shane, the fact that you looked at your Doomsday pallet with so much pride and probably thought to yourself “what if” breaks my heart. I’m\nSo glad you got the closure you needed with this series and got to show us all your beautiful creation!\nYou’re so incredibly talented, and you don’t need validation from any one to know how amazing and creative you are. You’re capable of so many more creative endeavors! I will continue to be a loyal fan, but I hope you reach that self love we all need with in ourselves and you become you’re OWN GREATEST FAN! I wish endless happiness ", "Can we just stop for a minute and say how adorable Shane looks in a cowboy outfit. And how happy Jeffrey looked and sounded. I live for it. May they have loads of happiness.", "I think the pandemic taught us ALL to slow down and reevaluate what’s important. Sometimes peace and happiness is so much more valuable than a 20mil house and fame. I’m proud of Jeffery", "I don't care if they have to be reused. Can we PLEASE get this pallete all in one?! Im obsessed and pretty sure a lot of people would pay good money for this pallete. Well done with the series. I pray this isn't the last one yall do together ", "The End of an Era. From the first episode to this Series has been my stress reliever. Thank you so much Shane and Jeffrey  All the way from Philippines.", "This would have been the best colour story of a JSC palette we've ever seen. Such a beautiful piece of art. It's sad it was never released but same time we have some of the best shades of it in Blood Money and Blood Lust. \nThanks to both of you.", "The level of friendship and love you guys have for each other literally gives me so much hope and faith that people aren’t as shit as I think. We ALL needed this series ", "This was so incredibly sad. I'm happy that Shane and Jeffree are in happier places, but I'm really upset about Al the changes. It feels like a death. I don't want the Shane and Jeffree collabs to end. I'd buy any new Collab Palletes from these two. I still use the conspiracy pallete every single day! I hope there will be ways to continue this friendship, for us to enjoy online, at some capacity.", "It would’ve been so cool if they renamed the pallet “RESURRECTION” to make it more happy. Shane and Jeffree have both learned to love themselves again and to put passion first. They have resurrected themselves by creating hope in a world that seems to have lost so much of it. Love you Shane and Jeffree!", "No matter what, im so glad Shane has someone like Ryland. His emotional maturity is so inspiring. Shanes chaos needs the calm and im happy Ryland gets to be that for him.", "Let's just  appreciate how much work he puts in these videos to make our day huge respect!", "Man, I'm sad but happy that you both found a new path. I HATE to lose Jeffery on YouTube. I have been a dedicated fan on this channel of BOTH of you.", "Shane please don't quit YouTube. On some of the darkest seasons in my life you were always someone who brought laughter, love, and happiness into my heart when I watched your videos. I am so sorry the world can be so cruel but you have an army of people behind you that love and support you genuinely. You both are my favorite duo on YouTube and I wish you both nothing but happiness. May God bless you both and your families.", "I didn’t want this to end  beautiful series Shane.", "Honestly this is actually sad if your someone who’s been watching them from the start. The pairing of them together was iconic and the makeup they created was great.", "I have been watching them both since 2009 they have gotten me though the hardest moments in my life. When all I could do was turn over in bed and open YouTube they were what kept me going even if I smiled for one min it helped me keep going. Hell it still does. I don’t want these moments to go away I would listen to them talk about bullshit for an hour it’s the friendships. Thank you Shane and Jeffree ", "i literally cried at the repurposing shades part  just knowing yall worked so hard and put your hearts into something, and it not being whole anymore.  idk, just really got to me.  but i’m still happy that they did get repurposed and consumers are still able to enjoy them.  it’s a conflicting feeling lol but i love yall so much 🫶", "Watching Jeffree thoroughly enjoy that bread was really secondhand satisfying  loved the series. Sad to hear Jeffree sound so beaten down about YouTube, but also nice to see him at peace ️", "I always loved their energy together throughout both series! It’s a sad end to an iconic era but I’m glad to see Jeffree is content and at peace with his new journey ", "Shane I’m laying in bed trying to keep my emotions together. Your videos along with rylands give me something to look forward to in life. I know it’s pathetic but you guys are my only feeling of friendship and family. As someone who lives in a part of the country alone without knowing anyone in the same state as me—It makes such an impact being able to join you and rylands lives for short moments and feel like somebody is actually talking to me. Thank you so much.", "Ryland is literally the best. The way he was talking to Shane and helping him navigate his feelings is exactly what you want in a partner!", "Jeffree coming to the realization that he doesn’t need to put himself out there on a platform where people don’t respect him and think he’s the villain and it’s not healthy mental is SUCH a healthy decision and I’m so happy for him. Good for him!", "Watching the shades going into other palettes.... htg could make me cry. Shane deserved to have a second palette... happy that you all have moved on and are living your best lives rn though and just in a  better place mentally. The internet is so toxic.", "I  understand how Jeffree feels when I left Maryland to move to Wyoming I felt so much happier and fell in love with the nature and the slow pace life. Wyoming will always be my home away from home. I was so sad when I had to move back to Maryland cause my dad fell ill.  I miss it  so much. One day I want to take my husband and our kids there so they can fall in love with it as much as I did.", "I love how Jeffree and Shane and everyone interact. Sad to think they might not film more videos together", "I was so full of emotions watching this. Shane I want to thank you and Jeffree you both saved me when I was in a dark place. I’m sad that this chapter ended but I’m so happy to see you and Jeffree at peace. I love you both.️ thank you for the series. And sharing your creation.", "I don’t think Shane and Jeffree understand the impact they made in our lives from their series together. It is so bittersweet but I’m happy for both. I will never forget this ever.", "These series have got me through so many dark times. I can't thank you both enough for being your true, genuine selves. Watching you both grow has been incredible. ♡", "Not gonna lie I came to YouTube again just to watch this series,  love you guys ️ and everything makes you happy,  GO FOR IT! I'm a rockie and been fan since like 2006 so thanks for everything and still here for us somehow. ", "You two are just Iconic, if you were a makeup shade it would be a pearlized iridescent shade of pure epicness, you two and your crew were the voice of makeup and conspiracy theory content that shaped a new generation, you two are living your best lives and I am here for it, whether you make long videos or short ones, you have a grand audience, more power to you so stay frosty out there! Peace!", "Could watch you two together every damn day  Seeing and feeling the difference in Jeffrey just makes my heart sing, (I only have YouTube and watch his videos all the time so would be sad to see him leave) I hate what the both of you have had to deal with and if this is what Jeffrey needs to live a happier and healthier life then more power to him, you will always be a Queen  Hope your life continues to elevate to Shane x", "A beautiful series yet again congratulations on being this iconic true fans are still here and have never left love to this friendship", "YouTube is absolutely NOT dead and gone. I LOVE feature length videos, and I  appreciate the effort that goes into entertaining us so much! Thank you for this series Shane. Don’t ever stop doing what you’re doing ️", "The color concept for this palette is seriously beautiful. So proud of you both!!!", "I’m so happy for everyone the growth focusing on their mental health and everything love it all even the sad parts", "We need a petition so we can get this pallet. Even if it's single shades because this pallet is gorgeous and I've never seen anything like it ", "I have never cried during one of these series but this one I did you both made a major impact on so many people's lives. Such a moving impact I'm so sad it is ended and everyone is moving on to new adventures but will cherish what it once was ", "I could have never imagined this friendship. But it’s the friendship that we needed. They needed. It’s sad but we don’t grow and learn if we stand in the same spot. Onward and upward. ", "this video made me feel sooooooooooo emotional, they’re so great together! Sometimes changes are needed, I just really hope they’re all happy with their lives honestly…and I hope Jeffrey knows he’s still very relevant!! Without these two the internet wouldn’t be the same, freaking love them!!", "I love how she gets inspired by moviess, animes, and all types of popular tv shows to just keep us entertained. We love you Jesss", "The ending made me cry <3 I will miss you Jeffery. This was a great/sad series. Can't wait for more.", "Ryland is the perfect complement to Shane - his words of wisdom really seemed to pinpoint exactly what Shane was struggling with and needed to hear, which I loved", "Literally crying listening to Jeffree say “why would I be on a platform where everyone thinks I’m a POS”  NO JEFFREE millions of us love you!! You saved my life. So did Shane. Your videos transported me to another world and got me through some dark times. I LOVE YOU!! So much!! Don’t let the haters win  Jeffree you are loved  and Shane you too ", "I am bawling my eyes out watching this video. I have been a fan of Shane forever and only knew Jeffree from MySpace, but fell in love with him when Shane did the first series. Being able to experience the creativity, the hype, and the unity during the first series was extremely special. The pride and joy I felt for these two guys during that time was unreal. ", "Still finishing this last episode. I keep watching little by little each day because I don't want it to end ", "I don't want it to be over .. I love you guys and I am sorry that the internet has made this place such an uncomfortable place for Jeffree", "That scene where Atreus ran to Kratos to hug him actually brought me to tears. The way they portray his confusion and his fear, him finding comfort in his father's arms is so goddamn well done. My father passed away in 2020 due to cancer and since then, it's been hard to find any comfort that even compared to that of my father's love. I'm so glad they made such a huge deal about it here and I can't wait to see what's in store for these two next. God bless you Santa Monica.", "Ugh I really want this palette now ugh it’s so good and y’all should do it as a final goodbye together and call it end of a era  y’all are the best friendship I’ve seen in a long time and I’m glad the drama never stopped y’all. ", "I’d love to see it used and renamed Revival or even Resurrected. The color story is so beautiful. Shane and Jeffree’s stories are beautiful. Y’all truly helped so many people through dark times and don’t even realize it. Thank you for being here this long. Much love to you all", "This literally ripped my heart out watching this! I have followed this story since the very beginning and this just feels like the complete end. And we will never see Shane & Jeffree together collabing or even on video again. I can't live in a world where there is no Shane x Jeffree collabs or videos, yes there not perfect but who the hell is?!? All I know is these videos or any of Shane's content to that fact bring a small amount of happiness to my quiet lonely life.", "We need a part 2! Loved how raw and real this was.", "Crazy to think this series really made me cry! Still holding out that it's not actually the end of such an iconic era", "I love you both so so much. Shane I've watched you for over 10 years and I'll forever support you. It was hard holding back the tears watching this. Whatever happens next I'm here for the ride ️", "Didn't realise how much this series was needed to close the chapter we didn't realise needed closing. An absolute end of an era, and the emotions were high for this one. Goodbye, Jeffree and Shane, such a wonderful end to their creative partnership ", "Oh man... when Jeffree said \"Everyone treated me like I was a piece of shit and I know I'm not...\" That hit me hard. Just his tone and the way he's telling that story. It all makes so much sense. I'm glad that he's going to do what makes him feel happy and fulfilled.", "Not me crying while watching this beautiful video, I’m so happy for the both of you", "Y'all both seem so much happier. As a long time viewer, I am so grateful to watch you both grow as I do.  Doomsday was such an insane coincidence with the first one being conspiracy btw tho lol.", "This genuinely made me smile. I love this, it makes me feel 12 again and back in 2013.", "Watching other people try on Shane's shades as part of jefree's pallettes and not even knowing, made me really emotional. Letting go of dreams is so difficult and I'm glad he at least got to show it to the world.", "I think that the fact that shane changed his life for good and jeffree did as well, it is just a level of goodness that they and the world actually, should pursue not ONLY when the darkness comes but in your good times youre also tryn to remain in peaceful environments, so AMEN to that", "At the end of the day all that matters is all of your happiness! Everyone is in such a better place now then where they were emotionally before. I'm so happy they finally got to show off their palate that they put so much time and love into and the fact that the colors were used in other palates and that they were so loved without even knowing that the colors originated in the doomsday palate! Y'all put so much of yourselves out there for your fans on a daily basis, I'm so glad that you all are taking a step back and doing what you needed to do for your own mental and physical health. It is sad to see such loved long time icons of youtube leave the platform even if its just for a hiatus, but it's more important that you all are in a happy healthy place. You guys have given so much of your time love and life to us over the years, we thank you and want nothing but love and happiness for all of you!", "I almost started crying when they started pointing out where the shades were re-purposed! I though that Shane Glossin’ looked familiar, but I wasn’t sure. I love this! So well done too!", "Honestly I don't really understand why they got cancelled, it's all a huge mess of they said this and that. I'm sad for them, they had a huge hit and the impact, great impact it had on them both, fans and family was astronomical. I hope we do see another collaboration together, they are a great team. I love these Jeffrey series, it's fascinating.", "Jeffree is just such a beautiful reality that makes sense where we go and where we do grow in different paths and so understanding that,  Shane keep doing what gets yourself to happiness because we’re here for it. Everyone really does just have their own journey, and that’s really what life is. Is what ourselves make it. Love everyone so much. Thank you for this video. ", "Awe man, of all the palettes from this brand, this is the one I would have bought. I'm sorry this didn't work out the way you planned, but the universe shows up for us in ways we don't know until we reflect on it. 'Doomsday' looked ominous for sure! I'm happy to see everyone doing what brings them the most joy. Good Luck *hugs", "I am not crying you're crying and jeffree we love you and wish you all the happiness in the world ️ this series was amazing", "This is a special but sad journey of you stopping YouTube I hope it's not for ever and you find it in your heart to come back love you Jeffrey ️ ️    ", "Happy to see them together again... Love you Jeffrey and Shane... forever in my ", "My heart sank when I saw their shades in different palettes. That was a beautiful palette guys, the world would’ve loved it.", "Thank you for this  surprise series. I have so many thoughts and feelings, I wish I could tell you all in person. You both are still so very loved! Hey, if you put out the pallette in a positive ️ light, call it REBUILDING ! in lieu of your positive big life changes, just an idea. Also, props to Ryland. Loved seeing his more supportive and wise side on camera. ️", "Jeffree getting into food is amazing. I love that he isn't afraid to get into new ventures. He could easily have ridden makeup and skincare to the death but he's expanding his horizons instead. I love to see it.", "This video made me way sadder than I thought it would  I've followed jeffree from the sidelines for years. I was never like #1 fan but I always admired his growth. I remember watching him preform in 2012 on the scene is dead tour and then watching him start a makeup line. Then Shane's docuseries the chemistry they had made me just so happy. Thinking that we will not see them together on this platform again makes me really sad. I wish you both the best.", "Who's cutting onions! Such nostalgia watching the second half of this episode. Please continue making these series' Shane.", "i missed you guys so much! This series was beautiful!", "Jeffree using some of Shane’s shades in a couple pallets and speaking so highly of them made me cry. He’s such a good friend to Shane I’m glad they’re both finding what makes them feel whole and happy now even if it mean we see less makeup or series. you can’t hold on to a moment forever but you can look back fondly", "I am sad the palette isn’t coming out I actually really think the color story is beautiful. And I don’t care if some colors already came out either.", "Shane, you are probably the reason I stay alive. Thank you. I love you and Jeffrey so much.  And Ryland you just the glue that holds the pieces together. And Maddie and Chris. Thank you for sharing. ", "We are part of another big “organic” marketing campaign guys! Wake the f* up, believe me, this whole “finale series of JS world” is not but another marketing campaign in order to target two things: \n* Restore Shane Public Image \n* Sell the product associated with the “undone doomsday palette” like this hoodies…", "The two of you together is iconic. The first series was so good - I loved the content! It was really sad for me to see you both go through it when you were “cancelled.” I’m happy to see you both looking happy and really being away from all of the BS that seems to be LA. Thank you for making this series, though I am really sad that it feels like the end.", "I literally just want to give Jeffree a hug. I’m happy he’s happy, and I will 100% miss his long-form videos, but he needs to live his truth and it sounds like he knows what he wants.", "I care and love jeffree star and his 20 minute long videos :'( YouTube will not be the same without him and it really kills me", "I hope this truly ain’t the end. Another great series though ", "Mick clearly shows his passion in everything he creates, even 14,000 word  PDFs describing his shitty situation. What an admirable man", "It’s sad hearing them saying their goodbyes but there will always be beginnings again. I hope they’ll be a lot happier than they did before. I’m saddened especially when Jeffree said he’ll stop doing youtube but I guess it’s for the better. May they be blessed a lot more. ️", "Shane you literally bring out the BEST in Jeffrey! You guys are the bestest of friends. It’s amazing to see", "I feel such immense sadness. Shane & Jeffree pulled me through my darkest chapters, yet this was a book I never wanted to end…", "Shane!!! Thank you for creating for us. Honestly the headspace you guys are in is exactly where I am also. I’ve been through so much and it feels like this is the time to heal and focus on being happy. I’m so proud of you both for getting to that place. ", "What I really like about Jeffree's palettes is that it is creative where ppl can use it in a creative way too. The shades are always beautiful and you can see the hard work they put there. I hope they can do the Doomsday palette soon.", "I love you and Jeffree together… I hope this won’t be the end… it can’t be 🇬🇧 Looking back really made me emotional. Love you both ", "I love that Jefree is such a great friend and indulges Shane. Jeffree has moved forward and it's so evident, and its clear Shane has not yet, but for Jeffree to do this with Shane and let Shane almost cathartically let go and acknowledge the past is beautiful. I love their friendship!", "I really can tell the change of attitude and perspective in Jeffree and it's amazing, I'm so happy for him, for what he's doing and how much he has grown. Living in the nature, with your animals, raising them at the same time you are still doing makeup... What a dream truly, wish one day I can have a house and a farm too hahahahha", "Watching all the colors be reused made me so sad  \nI know Shane was probably happy they were being used but had to be so sad watching all of the ones he worked so hard on just leave  losing little pieces of hope and the what if they released it. \nI’m so glad they were so open with each other though and the colors were able to get to be used because they are so pretty.", "I’m just crying. I’m so glad that everyone is doing well but the fact that the palette will never be released is super heart breaking", "I love you guys, and feel so proud of you. The growth, the happiness, the creative genius. ", "I remember the first time you both met and I already loved you as separate creators, to see you both come so far I’m so proud of you all. There’s so much more we could all say but just know we will cherish these memories this journey and your creations forever. You both saved so many of us in our own times of darkness as you did for each other and we’re forever greatful. Knowing those shades have been with us brought me to tears and I’ll cherish them! I hope we get a rebirth palette as a last hurrah but if not at least we have conspiracy forever! I love you both congratulations on finding your peace "]}