{
    "video_id": "MgxyLV31-vM",
    "comments": [
        "I think you guys could have put it out and call it reborn. You both are amazing together and you both have changed and live such different livez. The pallet is beautiful. I love you guys and I wish you both the best.",
        "The \"Reincarnation\" palette!",
        "I want this palette",
        "I'm sad :( Would have loved another JSC and SD collar pallete. You two create the best things and both have such beautiful minds that when they work together, its just pure magic.",
        "Resurrection (name for palate change)",
        "BIT H IF YOU DONT RELEASE THAT PALLETTE ",
        "Hmm why do I feel there will be an announcement soon of their new collaboration?",
        "I remember the first time you both met and I already loved you as separate creators, to see you both come so far I’m so proud of you all. There’s so much more we could all say but just know we will cherish these memories this journey and your creations forever. You both saved so many of us in our own times of darkness as you did for each other and we’re forever greatful. Knowing those shades have been with us brought me to tears and I’ll cherish them! I hope we get a rebirth palette as a last hurrah but if not at least we have conspiracy forever! I love you both congratulations on finding your peace ",
        "I love that we all collectively watch this and feel some sort of relief from the day to day ominous bulllllish! Love you all, thanks Shane for this hit of much needed inspiration on this shitty rainy Tuesday. ",
        "Well maybe you guys shouldn’t be commenting “I’m so happy for him even though I don’t know him” …. He’s literally just switching over to TikTok because TikTok gives him more views. It’s not that he’s taking time for himself . I love Jeffree but that’s messed up to just only be on one platform because it serves you better because everyone’s on TikTok nowadays it really takes a toll on the people that have watched him and were loyal all these years on YT . Like yes switch up on us because the times are changing . ",
        "Dayuumm.. I hope uploads sometimes.. I like watching longgg videos.. Like, Jeffery is a creative person.. I know n care nothing van out make up or whatever. But I do love the process of transformation.. I feel bad tht the negativity of ppl could mentally effect him like tht",
        "Shane Dawson, \nThank you for reminding us all of what a talented content creator you are. You know exactly how to hit right in the feels. I couldn’t be more proud of your comeback. I’m here for it! ",
        "i’m honestly so proud and happy for jeffree for putting his happiness and mental health first over social media",
        "Well I am heart broken there wasn’t a twist at the end of you guys releasing the palette. I love you guys. This series was amazing and just what was needed for so many of us. ",
        "I think a lot of us needed this series. As much as I’m heartbroken about jeff leaving YouTube, it’s bittersweet because I’m so glad he’s finally found peace and seems genuinely happy!️️️",
        "I literally want to hug Jeffree so bad! I really love him for who he is. Nobody is perfect we all make mistakes! He is human and people need to remember that. We are all imperfect beings!",
        "Lmao at Shane picking up the Yak poop ",
        "Shane Dawson's backwards cowboy hat is distracting",
        "I know neither of you will see this. But, this new series made me so happy and so sad at the same time. Like closure, almost? Jeffree was such a big part of my journey into playing with makeup and who really inspired me to be creative. Then Shane, you opening the door and allowing us to see the whole inside scoop was really amazing. After following jeffree since MySpace and seeing his growth throughout the years and then seeing this makes me genuinely happy for him. I’m really sad that cancel culture made you feel like you couldn’t release that palette, it’s truly beautiful and I really wish it could’ve been released. I’m really glad Jeffree never turned his back on you too as much of the internet did. I hope you both continue in your healing and creative journeys and have the most fulfilling lives ",
        "Ryland has really become my favorite. He doesn’t just hear, he listens and tries to understand which is all you can ever ask a person for. ",
        "I laughed so hard at the wasp part! Shane hollering \"IM STUCK!\" lmao",
        "The shade montage had me in tears. I’m so sad that it didn’t get made into a whole pallet. It is an end of an era. I’m 30 and still as invested in YouTube as I was when I was 12. Missed you both.",
        "Seeing the beginning part of this, I'm a Xenninal. So I see and feel the 'Gen Z-ers' are so much more impatient and in a rush for NO reason.... They need to slow the hell down and take a breath... take stock....and calm....\nAnd so... it seems the Gen Z-er's have the attention span of a gnat. Got It! Thank you TikTok!",
        "Awww C'MON MAN YOU KNOW WE'RE HANGING TO BUY THIS NOW ",
        "I waaaaannnnntttt that palet!!!! I love you guys so much!!! I just want you all to be so happy!",
        "I love how Chris was just chilling while Jeffrey and Shane were freaking out",
        "The Uber driver pulling up and Jeffree is holding a gun like ",
        "\"they did all embrace you and when they couldn't use you they turned on you\"",
        "Ryland is literally the best. The way he was talking to Shane and helping him navigate his feelings is exactly what you want in a partner! and i love you all",
        "I don't even need to see the finished product but I would've bought it",
        "Me grabbing my Blood Lust and Blood Money palettes like I've had some of these shades this WHOLE TIME?? This series has made me feel so many feels.. Shane you made us all feel like a part of your journey from the first series and now this feels like the true completion to the story. You all have my love and support and THANK YOU SO SO MUCH for providing us all with not just content but all the emotions that go along with it. Can't wait to see what you do next. ",
        "Shane would be the one to pick up some shit",
        "I am so grateful to you both Slay. Some of the worst points in my life and you both gave me life. Your friendship, your differences, your honesty to eachother. I wanted you palettes so much, and am so happy to see you finalize this. Peace. Friendship. The d. You both slay. Spread the tea babes",
        "I love Jeffrey",
        "I just wanna say this is so sad I enjoyed the long videos I started watch you 2 about 6 years old and I’d rather watch your CEO’s them actual movies\nSo this is very very sad to see you leave. I’ll continue to watch your videos over to Burger and that’s how I learned to do make up. What is watching you and I love your brand. I am really happy that you’re happy.",
        "Thank god  Looking forward to the day when Shane ends his cringy YouTube career lmao",
        "Oh my gosh. I literally teared up when they started showing the shades that Shane originally picked out that were put in other palletes I have  I couldn’t believe it , those ones stood out to me. Ugh, I wish we could’ve got the doomsday pallete,but I also understand why. Shane it was so fuckin beautiful. You’ve done so amazing. I’ve LOVED everything you’ve done an especially thing with jeffree. Thank you for showing us  this was a fuckin amazing series",
        " I’m so sad!!! Jeffffreeeee!!! Please don’t leave us!!!! Please  put out the Palette  ️️️️️️️",
        "If they called it New horizons they could incorporate the yaks and photo shoot with the sunset on they farm I’d buy it",
        "I love how Shane just comes back on YouTube like nothing happened lmao okie girlie",
        "have to be honest and say how much i love the realness of this series. i'm so glad that everybody in this series knows that they are safe here, that we adore that they came back and that we support the shit out of them. sending giant amounts of love to all of you, and thank you shane, jeffree, ryland and everybody else for making amazing content after all these years and for being a huge part of our lives. i will actually remeber my teens by you guys, which i think is incredible and beautiful. just know that our support doesn't have a limit and that everybody here loves what you guys are doing and that everybody is thankfull! lots of love, from a person who will always support you! <3<3<3",
        "You guys are pretty much the only reason iveever watched anything on youtube.  Loved watching it! This has been an amazing series.",
        "All great things come to an end and all that's left is the legacy created. You guys, through the ups and downs, good and bad, have left something behind that speaks to people. It's not just makeup. It's not just social media. I wish you luck and love for your futures.",
        "Jefree needs to make a social media app, something verry similar to bebo my space and MSN with a hint of tiktoks element !!! Something we can communicate on but share our fucking world while constantly being in regular communication with eachother followers and friends, we need personal pages that we can decorate express communicate and give love to and also receive love to ♡♡♡, the gap in the market is their and we need a new social media platform, something that's gona Impact us all respectfully and peacefully",
        "The drama of covid was intense. I do feel people displaced thier anger and it is so sad that mistakes were made into life changing events. However, everything happens for a reason. I am so happy and proud of both of you for finding peace for the first time. Cheers for finally being a peaceful happy and not a manic happy! Love y'all.",
        "I got my red bull, my blunt, my crumble cookies and my pumpkin spice Latte because I love Jeffree and Shane so very much!! I'm already gagging and I wish this series was longer because the two of you together brings me pure joy ",
        "I wanna fight with a Shane Dawson enabler but judging by the comments they all seem to be 13",
        "This video gave me so many emotions.. I’m heart broken that jeffree is leaving YouTube and that the pallete never came out it’s the most beautiful pallet I’ve ever seen and I would buy in a heart beat!!! Shane you are amazing at what you do plz never quit YouTube… so happy to see jeffree so happy I honestly think he deserves it… this whole series was a beautiful testimony to y’all’s friendship…",
        "who cares if some shades have been used! please bring out this pallet!!!",
        "Hear me out... call it the rebirth pallet",
        "I really hope Shane doesn’t quit YouTube. I have been in love with the amazing videos he’s put out the past 3+ years. Shane if you do decide this is not the place for you anymore, please just go right to directing movies and documentaries. You have such a creative mind/POV and I love to watch and part take in these journeys  you",
        "all great things must come to an end🫶",
        "Jeffree has grown so much throughout the years since their first series not just as a businessman but most importantly as a person. It makes me proud as a fan. Thank you for doing this series, Shane. Thank you for sharing all this with us.",
        "Shane acts like he doesn’t eat factory meat and slave coffee when he asks people if they feel bad for eating fresh ethically farmed animals",
        "Another sob story to sell nonsense",
        "I’m literally crying i love u Shane! When it was the montage of the doomsday shades w the og names then jefree’s repurposed names in new pallets made me cry like fuckkkk I love u Shane is all I can say",
        "Shane, you have a serious talent! You are so incredibly creative, comedic and real! Thank you for all of the effort you put into this series !",
        "I was in college when you guys started that series and pallet together. I hated my school so damn much and coming back to my apartment from classes on a Friday night after getting food from Chick fil a, taking a shower, grabbing a snack from the kitchen, making tea, and placing my laptop and goodies all on my bed, muting my phone with the lights dimmed so that I could sit back and watch the different parts of the series like a movie was truly what got me through. I LOVED the anxiety of waiting for you to drop the next part and the first reveal of the pallet, and don't get me started on my ass skipping my class so I could run online and try and get the conspiracy pallet for me and my sister...OMG the memories!!!!! We were obsessed!!!! Gosh, life is so different now for us all.",
        "I went to tiktok and stayed there for a year. Then I found out what those short videos to your memory and attention span. So Im back here and I feel like a lot of us will come back to youtube once tiktok dies out. And if it doesnt, so what? Your ride or dies are here.",
        "I'm so sad that people got Jeffrey to this point. People are so cruel but honestly I love the growth.  I love Jeffrey and Shane together. Please don't ever delete the videos. I rewatch them when I'm sad. Yall are funny asf ",
        "Why does he talk like that",
        "Hopefully one day we will get this pallet! It is beauty",
        "Music was too loud thru out the series..",
        "Shane making the model face in the mirror then looking at the photo after like wow what am I doing I'm not a bad btch wtf am I doing same Shane same",
        "Great Video",
        "Its so sad that them getting 'cancelled' & getting so much hate ruined their lives , They were my favourite YouTubers and it hurts that they’re moving on now … I just can’t get my head around it .",
        "Shane u need to find what is your passion if u lived ur series and YouTube u do u… if u wanna drop a pallet then u do that!! Do u!!",
        "I remember when Jeffree first launched his cosmetic line -- three liquid lips in shades Prom Night, Redrum, and I'm Royalty; when Jeffree revealed his bare face for the first time ever on YouTube; when I met Jeffree at Warped Tour and he only had a handful more lip shades, the Beauty Killer palette, and recently revealed lip scrubs. His Youtube journey was incredible to witness. There is no denying he changed the game for everyday, wearable makeup and other competition on and off the platform. It was a rollercoaster ride, but it's comforting to know he is at peace and can confidently admit YouTube is not fullfilling. Many other creators convince themselves no one cares, their content isn't good enough, the community is dying, but Jeffree rode the train and has found his stop. He knows when to call it and move on, a gift of intuition.",
        "I would have loved to see this come out\nYou both are so talented \nAnd I’m sad Jeffrey was so hurt by the people on YouTube\nI love you both I hope you do colab again",
        "terrible camerawork jfc",
        "I’m so sad!!! I didn’t want to stop watching them together ",
        "Im definitely going to miss watching Shane and Jeffree videos together!!! It’s crazy how their journey turned out! Time goes by so fast! ",
        "Mental health should be more important than anything. Even if it means disappointing loyal fans. Cause if they're truly loyal, they'd be asking for jeffree to take care of himself. \nKeep him close, Shane ",
        "I understand why Shanw is sad about Jeffree not being on youtube anymore. Because when we say youtube, Jeffree is one of the youtuber that will aitomatically come to mind. We are so used to seeing him when we open youtube and now that he would not be there, it is really sad...",
        "I felt sad when Shane said \"but I am not on TikTok so we won't make stuff together cus he is my favorite person to make stuff with\" their friendship ",
        "Please come out with that pallet so I know what I want for my birthday ",
        "The ads killed YouTube",
        "They can be friends outside of YouTube tho",
        "THE BARFING SOUND HAHAHAHA I guess me and everyone else rewatched that part half a dozen times.",
        "I'm sad. But I'm glad he's doing good. Maybe they'll put another pallet together later on. Hopefully,they will record time together once in awhile. Its so fun to watch them all together.",
        "I can't imagine that conspiracy is not around anymore does that mean I can't get it anymore because I literally was in tears because it sold out and that was literally just a minute ago I don't understand God has time flying like that without me noticing",
        "i'm so sad, the pallet is so pretty i wanna buy it",
        "Us millennials really don't like all this social media changes ",
        "People act like it's so crazy to raise and eat your own livestock and produce. Like..",
        "I miss3d this duo ngl",
        "rylands emotional IQ is incredible, you really lucked out with having him as your partner ",
        "I think I can speak for all of us when we say WERE SAD IT WAS NEVER RELEASED  but you guys are better for it, both are happy and thriving and that’s all we want ",
        "That would’ve been such an amazing pallet because the creativity is there. It’s a mix of both of them. I wish they would’ve came out with it. Automatically I would’ve had a two to cart one for me and one for my Bestie",
        "Lol at the sad music playing when talking about leaving Youtube... like nobody's died people.",
        "Shane. This series was so special. Please do not wait so long for another one- WE ARE READY! this has such a sad somber ending but it also feels like new beginnings are on the rise. The palette is beautiful. Although we won’t get our hands on it, you created a work of art and it should be treasured forever. What’s next? The tik tok life of jeffree star? The life story of Jeffree star from MySpaced to yakkin? We are here for anything. I’m so ready",
        "i’m embarrassed for jeffree that he made a slaughter house. like girl … what are you doing ",
        "you and Jeffree seriously have my heart Thank you for sharing these parts of your lives together with us. These series bring me so much happiness and relief, you can’t even imagine how much. ",
        "Please put this pallet out! Call it Rebirth or Renewal",
        "I hope you all know how much you mean to ALL OF US. Literally have grown up with you. Cancel culture is absolutely disgusting, and I am SO proud of yall for moving forward from all of it. ️ this was such a heart wrenching series. love yall!!",
        "I’m sad that you guys can’t release the palette, I think that this palette would be amazing as a reminder of what these past 3 almost 4 years have been, it’s even more crazy that you guys started creating it before the craziness even started!!! (All the shade names kinda make my mind explode ) That is definitely ICONIC in my head.",
        "I love watching your series with Jeffree star it made me excited to start my business and I watch them over and over again to continue to love doing my business",
        "Absolutely love you guys together there's no way he could be quitting you to I know I still watch YouTube and I absolutely still enjoy it",
        "many people could only wish for a friendship that strong like Shane and Jeffree's! I love them so much and their content always brings a smile to my face  Thank you Shane and Jeffree for enriching my life, I am truly blessed to be able to witness y'all ",
        "i love shanes youtube bc he posts long videos WORTH the wait.",
        "Title of the background music at the end of the clip?",
        "It's great to see how much you and Ryland come together and console eachother through hard topics, really inspiring. Helping eachother see different points of views on how jeffree is feeling and how to approach him. Love this series",
        "Jeffree moved on, Shane didn’t.",
        "I love you tube. Always will!",
        "It feels like the end of an era, but also a brand new beginning of something beautiful. The emotion this finale carried left me feeling sad, but also feel a sense of joy in the end. I’m so proud of you, and Jeffree. Thank you for taking us along on this journey ",
        "I can't imagine YT without Jeffree\n :(",
        "I love how humble jeffree is here. No makeup, no fillers, truly an icon",
        "Thank you for this Shane. It took me back to 2019 and how wonderful of a year it was. It will always be my favourite year in my life. I remember getting the conspiracy palette and crying because I’ve been with you since you started YouTube and it was so amazing to see what you accomplished. I cried when you revealed the Doomsday palette because I so badly was hoping from the first episode of this series this would be your reveal. And it was, just not the reveal we had all hoped for. It’s a beautiful palette and I hope one day it is released. ",
        "This was the Jurassic Park sequel I didn’t see.. Jefree Goldblum lookin real different",
        "11:21 has me DEAD\n25:51",
        "Jeffreeeyyyyy Star I think so many will miss your talks and honesty WHY bc in the fake culture we see everyday, is refreshing to see REAL PPL.  I think the ppl who make vids for views & $$ to cancel or speak lies showed be the ones to e canceled & rethink their lives hurting ppl. Know they are the 1& done & no one knows their name , but bc if your honesty & realness m, you won’t be forgotten.  The ppl who stick with you & know that those are the ppl I’d rather live this human experience with .  Not the fake loosers!  Hopefully a lesson in those ppls lives words cut deep, don’t speak unless it’s real & nice. Society is over assholes who tear ppl down . We all have real souls! Think !  BE BLESSED KEEP SPREADING LIGHT!",
        "They all have names.. #147, #293, #305  \nSustainable living is the best! People get mad we kill elk, deer, bear or catch fish out here in Oregon but they just don’t know what their missing!",
        "I care about everything you guys have posted. I will always support you no matter what your choice. It’s not fair to have people make you guys feel like shit. Do what makes you happy. NO MATTER WHAT",
        "This series was so needed and the raw emotion that is in this video is such a closure that I think we all needed. Shane thank you for making these series because they brought me out of so many dark places and I hope that you can understand how much of an impact you have on people. Thank you Shane you saved my life more than once and I don’t know what I would do without your videos<3.",
        "i NEED this pallete",
        "the way shane is wearing his cowboy hat backwards 🥹",
        "Why not a palette called Canceled?",
        "\"I feel even closer to you now than I did then...\" \"Yeah, absolutely.\" OMG i love you two forever and always. Thank you for your friendship and for being so real... I love to see how far  you both have come. Can we get that palette though? LOL",
        "Omg. Shane called jeffree daddy he needs a daddy not a ryland",
        "this is actually sad..",
        "Hi",
        "In regards to views, I feel like you need to remember that your fans are growing with you. I’m super busy now and have my first baby on the way - I can’t sit down and binge watch videos all day like I used to ️ It doesn’t mean we don’t love and support you guys, some of us just don’t have the time anymore.",
        "I get so upset every time creators talk about who nobody’s watching YouTube because there are some of us that are against the whole “ short attention span” and “instant gratification “ trend like myself and I literally would watch a day in the life of Jeffree over 500 tik toks any day:/ I don’t even feel compelled to download that app cause it’s just not my thing. And I know there are others like me.. I can’t be the only one.",
        "44 mins into it, I get it. I understand why Jeffree is so happy and at peace. This is so awesome, thank you for creating this series Shane ",
        "I just hope you and Jeffrey know how incredibly meaningful you are to your fans. I have been watching YouTube since I was in high school. I fell in love with you both while attending college. When Y’all finally made a collab and did full circle project. I was completely excited. It hurts to see two amazing creators have to rethink their careers due to drama/gossip. If anything it just shows how you have evolved. Be proud of being influencers who paved the way. Without both of you, this community would be nothing. Just another loyal fan. ",
        "tbh i hate the internet. people dont realize that theyre human too. people on the internet are so quick to judge and put down influencers because of their mistakes, but dont sit back and realize that they have also made mistakes in life and arent the best person in the world. like sit back and judge yourself before you look at influencers and judge them. nobody is perfect. everyone makes mistakes or does some wrongs. its life. this series makes me happy to see how much you guys have grown and how happy you guys have become. yall are amazing & deserve nothing but happiness in life. im super proud of you guys & what all you have done. ",
        "You know I find it to be the most saddest thing ever incorrect grammar whatever that Jeffrey's leaving YouTube he's hanging up his hat like in my mind I started as an adult becoming more confident in my makeup choices because of Jeffrey and I fell in love with Sheen and Jeffrey's friendship and the entire process that they went through and making the conspiracy palette so like my heart hurts a little like I've watched these people become these really good friends and it kind of shatters my heart that what in my brain ID the queen of YouTube which doesn't even make the right title it's not extravagant enough or anything what have we done so horribly that the Queens retiring crown and that's it makes me want to cry",
        "Shane and Jeffrey should switch lives for like three days and have to do what the other person does. Like Shane post on tik tok and Jeffrey do YouTube and podcast.",
        "They should have released the second pallet !!!!",
        "This video was very bittersweet, but I’m glad that Jeffree FINALLY found peace and happiness, and that both Jeffree and Shane are mentally good. Not gonna lie, I actually cried just seeing Jeffree seem so free from all the toxic shit. I hope nothing but for more mental wellness and tranquility for the both of you ",
        "OMG the wasp ",
        "This genuinely made my heart hurt...I feel like there should be a part 2 pallet to show the growth yall have had <3 it would be everything.",
        "I teared up at the end Feel so bad for Shane. Not releasing this beautiful palette he's so proud of and all because of this f***ing cancel culture. He's put his heart and soul into this palette, and it really shows...",
        " that pallet looks amazing",
        "Wow my mind is so blown when you talked about the 2nd pallet. It would of sooooooo sold out because what a timing with the pandemic",
        "I’m only a couple minutes into this part but it honestly makes me so sad because I am someone who loves long form content. Yes I love tiktok but I’m a YouTube girly through and through. I 100% respect the decision to leave YouTube but to say no one cares is upsetting. 1 million views is still so many views for YouTube. Maybe 1 million isn’t a lot for tiktok but YouTube it’s still a lot. And those million people are probably the die hard fans who have been there through it all. I respect anyones decision to leave YouTube but when they say no one cares and it’s pointless hurts a little as someone who’s been watching for literal years ",
        "If really been there from the start. Jeffree was one of the first people I discovered on myspace and continued watching him til now. I will miss turning on youtube and see a new video that will definitely make my day better. I'm so happy for all of you though and that's what counts. I'm sobbing right now lmao",
        " l absolutely love you guys. You have shown such a beautiful  tender humble  side of Jeffrey.  I am so proud of you guys  and absolutely love you",
        "I was going through major depression when the first series and pallet came out. Watching these two interact got me through the toughest times. Im beyond heartbroken.",
        "AGHH HE SWAPPED THE PALLET WITH THE POOPIE HAND ",
        "Please release Doomsday!! I still need the Conspiracy palette too lol",
        "This is the same hotel chain I worked for. I worked at the one in Grand Forks",
        "As soon as they started talking in the first video about the pallete i got very fucking excited and was waiting to hear when it would come out, imagine my fucking disappointment wheb they said it wouldn’t come out",
        "Let's just  appreciate how much work he puts in these videos to make our day huge respect!",
        "Its not that hard to pick some fucking shades this is like a little school project come on",
        "Shane…this is EXACTLY why you can NEVER QUIT making content! Whether that’s on YouTube or movies or whatever else! You made me genuinely feel so many deep emotions during this video and it’s basically about make up and your lives that don’t have much to do with me. I laughed, I got goosebumps, I felt sad & almost cried, I felt happy & proud, I felt nostalgic, and even mad. I don’t know many people that could do that Shane. That is fucking talent if I’ve ever seen it. I would literally cry and have a mini funeral if you stopped making content. ",
        "So Shane is sad not to be able to make zillions from pallets?",
        "maddie: people eat off their own land\ntheir business: the exact opposite of that",
        "We already know they’re coming out with a palette lol",
        "Shane, I am so proud of you!! After everything that happened you chose to do what you love to do, even though so many people have something to say about you/it. I had goosebumps watching this finale. SO PROUD!",
        "reincarnation palette",
        "I love you Shane",
        "Anyone know what song was playing when they got in the Polaris?? Went thru the whole playlist & links",
        "back in the day shane gave jeffree a redemption ark. who's gonna do the same for him?",
        "...Anyone else living for Diet Cola? Was that in the Wicked pallet?",
        "My heart is broken. I’m going to miss these two together ",
        "We need the palette we need the palette we need the palette ",
        "the second palette could be called ‘reincarnation’",
        "so so so many emotions going through watching all this, but one thing I know for sure is whatever they are doing it's my from their hearts, all love and postive vibes to you ️",
        "Jeffree coming to the realization that he doesn’t need to put himself out there on a platform where people don’t respect him and think he’s the villain and it’s not healthy mental is SUCH a healthy decision and I’m so happy for him. Good for him!",
        "I’m going to miss this duo. When I tell ya these two has brought so much comfort  over the past two series  I would rewatch it so many times and to see it end is really bittersweet.",
        "I would have bought that pallet no matter what! ",
        "Yeah I won't be following any creator to the black hole. I guess this is goodbye. Then again, it's hard to be into makeup when the world is ending.",
        "Honestly you guys should do a pallet called dream state and you could do a light and airy dreamy pallet and then a darker nightmare pallet showing the duplicity of each other and highlighting the highs and lows of your journey together. Wishing you all happiness. You deserve it and more.",
        "So we're ignoring Shane picking up a pile of shit and sniffing it ",
        "I do get why the colours were used but that’s quite sad at the same time! Like surely Shane should have some sort of payout for coming up with all those colours that went into all of those palettes!",
        "Thank you Shane & Jeffree for such a amazing series and a perfect ending!",
        "I needed this I love you all",
        ":D",
        "I’m bummed that this series is coming to an end but I’m so glad Jeffery has found something that makes him feel fulfilled and that Shane is back into making videos outside of the podcast. They both seem to be in such a better place and I’m happy for them. This series has been an an inspiring one, and makes me want to go out, try something new, and find myself in the process ",
        "Awe this made my night yay - ",
        "I know how upsetting change can b but I am so happy at the direction everyone's paths are heading.",
        "Omg... I'm honestly so happy for the both of you!!  I've been watching the both of you for so long and I loved watching you both grow. And even though the Doomsday pallette was never released... I hope you both can come together again to create something else from your healing and growing period. I have no doubt that pallette would be so much better than either one of you imagined before!!  Healthy and healing looks great on the both of you!",
        "Your guy's friendship is so special and amazing. I hope they continue to see each other more in the future. No matter what happens they need to stick by each other because they clearly go together. Much love you guys. ️",
        "Pallet names :\nRebirth\nThe transition\nTransmission ",
        "I love what you an jeffery do so much an no matter what I'll never unsubscribe from yall",
        "I feel a little discomfort watching your,video lately shane. The paning is too shaky. Hope chirs will find way to stop the video shaking too much discomfort to watch",
        "The fact that “Doomsday” was going to be the second palette right before the pandemic started is so crazy. Everyone would have thought that was some conspiracy or you guys read the future. \nThis series was awesome. Loved seeing you guys together again, and I’m so happy for you both! ",
        "Should have a pallet called renewal or renewed!!",
        "Jefree didnt leave. He just switched to tiktok like everyone else. Lmao. Still loved the series either way",
        "THOSE STORES WHO PUT THOSE PALLETS IN THE BACK NEED TO GIMME ONE",
        "Jeffrey should name his fast food place Yakkity Yak after the old 50’s song and more recently animated series — no longer running I don’t think.",
        "I just think it was so messed up to lead him on… like he used Shane in a way. So mean. :( Shane was so happy",
        "I am praying happiness for the both of you because you deserve it!!! And so so happy that you found friendship and comfort with each other! No matter what, I will always be a fan and support both of your endevours!!! Cheers!!!",
        "Put the palet out ...doomsday... to be continued we love all of yall!",
        "I literally need the doomsday pallet 🫶",
        "Hey Shane. We do dress like that, but for special occasions. So you're good!",
        "I would much rather smoke a blunt and get hungry rather than to get trash faced and not know who im hurting or offending.",
        "Mad respect for Jeffree healing himself.",
        "Morphe’s going bankrupt now anyway, right? Lol  awkward!!!",
        "The resurrection palette would be a great name ",
        "Not me, from South TX noticing at 41:06 Shane's cowboy hat is backwards  out of all things. God love him! ",
        "Omg please drop the pallet to the public! I’ll buy it",
        "Wow I wasn’t expecting to cry. I really don’t want to jeffree to leave. I’m so happy that we get to hold some of the repurposed shades after all. That’s really special and I’m happy to continue to support jeffree ️",
        "Loved this. ️",
        "Jeffree star is showing true growth and it makes me proud to have care from the beginning even our beloved Jenna marbles said goodbye bc it stopped serving her, physically and emotionally and that is totally understandable. Love you jeffree",
        "I died laughing when Jeffree was singing in a very manly voice “we’re sucking d again” turned into a scream because there was a wasp in the truck. OMFG.",
        "Being a fan of Jeffrey since MySpace days and Shane since he was doing food videos it's sad to see the chapters end. Also lovely to see them both settled in life and happy. I wouldn't worry too much about shifting social platforms, fans that have stuck by you will follow wherever you go and whatever life choices you both make. We all old now  The party isn't over, it's just more relaxed. Love you both heaps! Keep on doing whatever makes you most happy in life ",
        "jeffree needs to make a pallet of all the colors of his yaks",
        "Proud of you for never giving up! You were my childhood and followed me into adulthood. I hope life is treating you well ️",
        "I WANT THE PALLET",
        "Watching Jeffree thoroughly enjoy that bread was really secondhand satisfying  loved the series. Sad to hear Jeffree sound so beaten down about YouTube, but also nice to see him at peace ️",
        "OMG!! I want that palette SO bad!! I didn't love the conspiracy palette, and I usually don't even buy high end makeup, but I would definitely shell out the money for the Doomsday palette! It's absolutely gorgeous! \nIf anyone has the eye and the free time to figure out which shadows ended up in which palettes, please tag me, I would love to know! ",
        "I actually prefer the doomsday pallet over the conspiracy one I'm gutted it's not coming out ",
        "Can we please start a petition for them to make this palette!  I don't even care in the least if jeffree has already used some of the shades.  WE NEED THE WHOLE THING TOGETHER.",
        "Wish I could up and move elsewhere. Sucks living alone. Being alone. Especially when your dog recently died. Shit sucks.",
        "My heart sank a bit when I saw the colors in different pallets, I really did feel like there was no goodbye at the end of this and I hope you can still make YouTube content with Jefree even if he decides to leave his own channel. I'm crying at the end of this and that is something I did not expect. I loved seeing him living his new best life and it sucks he won't be sharing that joy with us online in the same way anymore. The pallet was STUNNING Shane, you both did such an amazing job and I will be looking back at this for a while. Idk what emotion I'm feeling right now, but I love you both ",
        "This is giving closure to all the fans who loved you guys thank you ",
        "i'm going to miss jeffree star",
        "I felt Jeffree’s peace through the video. So happy for him. Also. He should officiate Shane and rylands wedding",
        "Great Skill you have dude!!! Woooow",
        "Thank you for creating some amazing stuff together , I watched you guys when I was very unwell in and out of hospital . And I looked forward to you both . \n️️️️",
        "The love you guys share is truly extraordinary.. going to miss seeing it",
        "Okay, but the pig with the gasmask rendering was AWESOME. Great imagination, Shane!",
        "Shane needs to do a documentary about Kanye West.",
        "do a pallet called rebirth",
        "The rebirth ",
        "Nice video ",
        "Ok, so you’re perfectly fine eating factory farm meat where the animals are tortured, abused and neglected but make such a big show out of eating a humanely raised source of food? Like are you just trying to be funny?",
        "I feel such immense sadness. Shane & Jeffree pulled me through my darkest chapters, yet this was a book I never wanted to end…",
        "I hope Shane made some of that blood money money",
        "I'm sure Shane and Jeffree will make more videos together....",
        "Idek call this the pallette reveal, like. I need this in my life so- I've been watching Shane for 10+ years (since skit days) and followed Jeffree since the fruit loops MySpace pic.... like two worlds collided when this original docuseries dropped ON Jeffree. And when the makeup collection came out I was in a financially abusive relationship... I wanted and PINED after the collection bc I was working 2 full time jobs to pay the bills bc my \"man\" at the time would rather play Xbox than hold down a job. When I finally was able to I bought the BRING IT BACK mini version, the conspiracy, the collectors lip set and the lime green pig mirror. Unfortunately 2 years later I found myself in a physically abusive relationship that resulted in law enforcement being involved and me essentially becoming a ghost and in the midst of that, my conspiracy pallette was sacrificed to a grave of forever living in the truck of the psycho who tried to kill me. And the first thing I spent my \"free\" money on, as in- my bills are paid and my dogs and myself are fed and I still have spending money- was on replacing my conspiracy palette and I still to this day hold each piece of that collection as if it were gold. Guests don't touch it, but get shown. I visit it often and use it almost everytime (on the rare occasion) I wear makeup. It's everything ",
        "If its for your mental healths then by all means.. i understand... its time you think about yourselves and not about what people say about you!! All the best!! Much love!!",
        "Shane I’m laying in bed trying to keep my emotions together. Your videos along with rylands give me something to look forward to in life. I know it’s pathetic but you guys are my only feeling of friendship and family. As someone who lives in a part of the country alone without knowing anyone in the same state as me—It makes such an impact being able to join you and rylands lives for short moments and feel like somebody is actually talking to me. Thank you so much.",
        "Put it back ",
        "This made me cry so much.  When the first series came out I was in a 5 year relationship, depressed, not healthy. Prom Queen spoke directly to my soul. I can't tell you how many times I cried to that song. I got the conspiracy palette the minute it released. I  remember sitting in my fiance's bed refreshing and refreshing and refreshing. Since then so much has changed. I've moved, I'm single, lost 50lbs. Got into spirituality. I've just... changed. I don't do makeup the same, I mean. it's all just so different. Hearing Jeffree talked about leaving YouTube and being so happy about it while Shane was still hanging on it to it really spoke volumes to me. I've been the person who has let go and moved on, and I've also been the person wanting something to stay.  But Jeffree said \"I evolve and shed my skin so quickly, maybe more quickly than others\" it really resounded with me. I have changed so much since the first series, I'm still me, but I am so different also. So much has changed and we have all grown so much. I really loved this series, I missed it. it was nice to get a taste of my old life back. I miss it sometimes.",
        "I love you Shane! Thanks for sharing this journey with us!",
        "If we all know anything, it’s that Shane is FULL of surprises. I believe this won’t be our last time seeing these two together again. I love both of them & I’m so proud to see how far both of them have come. Thank you for letting us take this ride with you. ",
        "Even if everyone once hated Jeffee ive always loved him so much. Yes he’s done some fucked up shit but fuck is he inspiring",
        "Why is the reveal feel like euphoria where they are in the desert as cowboys,",
        "The biggest fear of shane is not to be ever alone",
        "Watching this series was amazing! I’m sad the Doomsday Pallet never came out, but I understand why. Shane and Jeffree are the sole reasons I began buying makeup pallets (from Jeffree Star Cosmetics obviously). It helped my boyfriend be able to be more himself. Now I’m on the journey of playing with Makeup myself, and it’s all thanks to you Shane Dawson and Jeffree Star! Thank you guys so much for being inspiring and the light we all needed!",
        "I’m so emotional I love you guys I would always watch your videos to distract myself",
        "WE NEED THIS PALETTE ",
        "Not Shane wearing the hat backwards, ",
        "I don’t remember the last time I have sobbed for so long and so hard. I have so many emotions running through me right now it’s hard to comprehend  I love how throughout the whole journey they made every fan involved, showed us every moment, so it felt so much more important when it actually came out. There’s so many reasons why I love Shane, but the more and more he makes content and hear him speak from his heart just makes me love him more. I couldn’t get enough of this series, Shane, and their friendship ",
        "Can you please release this pallet I would pay top cash",
        "I am so going to miss jeffery he got me on YouTube and gave me the inspiration to be me!good luck ms star ️ an amazing person and has so much love from your fans ",
        "I started crying half way through and just finished and I’m bawling. You too are amazing people. I’m sorry the pallet never came out. But I’m glad you both are taking time to really work on your lives outside the camera. Continue on your path and you’ll be be amazing. You both are diamonds",
        "I have to comment my experience of the conspiracy pallet to get it off my chest. I have watched your videos since I was 8 I’m 21 now. No one In my life has ever paid attention to the specific things I adore truly. When the conspiracy pallet was launched I kinda figured I was too late to order it because I’m usually to late to get things or don’t have the money too. My boyfriend of 6 years knew how much I love Shane Dawson and for my birthday that year he surprised me with the pallet. I wish I was lying when I say I cried for 30 minutes straight to have something from someone I love so much and the fact that he knew how much it meant to me. It was an emotional break down. I love you Shane and I think I can speak for all of your supporters when I say we need someone like you when days are rough. Thank you",
        "Ryland and Shane’s relationship is so beautiful. They both are so open and able to talk through things. Communication is key and they have mastered it.",
        "I don’t think Shane and Jeffree understand the impact they made in our lives from their series together. It is so bittersweet but I’m happy for both. I will never forget this ever.",
        "Please please please never quit Shane. I grew up watching you over the years & idk what my life would be without you posting . I’m 23 now & you were one of the first YouTube videos I ever saw next to Glozell lol but please never quit. You’re such a big part of my life. Love you forever Shane Lee Dawson!!",
        "I absolutely love how much Shane loves and cares for his friends. It’s so refreshing to see that. His love and care is very evident in this series! Thank you Shane for this! I loved ever bit of the series!",
        "More content on the star yak farm with Shane family and Jeffrey Star!!️️️",
        "What about \"new beginnings\" ya know...cause it's a new beginning for u both...make a few new shades...for the ones he's used...who knows....it might be better...",
        "Next series, Jeffree visits colorado?",
        "The ending was so abrupt! We want more! Even bloopers! And especially the palette! I don't care if the colors are used in the other pallettes. The more the merrier, especially those shimmer shades.",
        "I’m so sad we didn’t get the pallet it would’ve broke the internet again. I’m so glad y’all are doing well and happy!",
        "OMG I LOVE the colors in the palette ",
        "So sad that the Doomsday palette didn't come out. This is exactly the palette I've always wished for. It's classy, it's playful, it's exciting and still coherent :(",
        "Why can’t they put it out now though? I feel like Shane was hoping Jeffree would suggest that and it was just awkward when he didn’t…I don’t understand why Jeffree knows his own reputation isn’t the greatest and is happy to associate with Shane but won’t do another palette with him…",
        "The flash backs had me crying! Jeffree not on the Tube is heart breaking! But I also get him needing to make sure his sanity is good. ",
        "One of the best things is that he never takes credit for himself when he achieves something. He always respect us, the audience, and his team, and he is always polite in all of his videos. We congratulate ourselves on this achievement. More to come and everything to come :(",
        "I am saying this before I watch this....please dont release the pallet. It's done darling...let it go.",
        "The Reincarnation Palette. So proud of you both for living your best lives. I’m inspired to find my own peace. Thank you, Shane. Truly.",
        "Jeffrey looks so genuinely happy.  Seems to me like he’s finally found himself and he knows he doesn’t need to put a show on for anyone anymore.  He’s just being himself and it’s INSPIRING.  Good for you baby!!",
        "You can tell Jeffrey is so over Shane. Shane seems sad that his money cow has set his own boundaries. Just because Jeffrey doesn’t want to do YouTube anymore doesn’t mean Shane has to stop, Jeffrey is an adaptable entrepreneur who goes where the new $ is and enjoys it. Shane will always be a slave to YouTube.",
        "Why am i crying ",
        "Everything comes to an end.  Feel like I watched all of you grow into adulthood.  Make yourselves as happy as you've all made your fans.  Hugs to Jeffree, Shane, and Ryland",
        "This will always be my favorite series on youtube. There is just something so comforting about Shanes series",
        "Yes pls make us good fast food that don't make the tummy hurt",
        "WE NEEEEED THE PALETTE.",
        "I want more podcast ",
        "Lloré al saber que Jeffree se irá de esta plataforma, siempre he apoyado su contenido, al igual que el tuyo Shane, ayer terminé de ver (por séptima ocasión) los dos documentales pasados tuyos con Jeffree. Me encanta verlos juntos, me hacen reír y llorar... Los amo!  🇲🇽 ",
        "I would’ve paid an arm and a leg to have that palette if I’m being honest. It’s absolutely beautiful. It is so nice to see the shades spread out throughout other palettes jeffree has let out since you guys made this.",
        "10:43 same shane , same",
        "QUICK!! Everyone come up with a happy name to use so we can have this pallet!!!!!!!!!",
        "when I was watching the series 3 years ago, I was also at the highest point of my life just like you two but had also my downfall during pandemic. now, just like what you two are doing, im trying to heal and be happy with what I have. I guess we are in sync like that. it's kind of sad but change is the only thing constant in this world and this is the new era.",
        "I cried but it was happy tears because you both have done so much for us as fans and you guys as friends that I see how happy you guys are outta the city life.  I’m so glad y’all are doing better and y’all are happy ",
        "Favorite part of the video: 6:07\n“You’re not giving it up, you’re saying goodbye.” \n\n(Just kidding Ryland, love you).",
        "I couldn't have imagined how amazing this series would be. It's so beautiful to see how happy Shane and Jeffree both are. I've loved watching all of their videos together but this was something special. How much you've grown is amazing. Seeing Shane say \"I'm happy\" just pulls on my heartstrings because it's like he finally got his happy ending after everything that's happened to him.",
        "I just hope that Jeffree’s last video is filmed by Christian, he was the OG cameraman, he filmed Jeffree’s first reveal and swathes video for JSC, and hundreds more through the years.",
        "Ummm please release this pallet!! ",
        "Tiktok is so annoying with all the lame lip syncing etc. I'm sure unlike youtube it will be a fad that quickly disappears",
        "i’ve always stood by Jeffree, but i respect him so much more now. I love him and you so so much.",
        "Shane you’re an amazing and creative storyteller. I love all your video creations,  from the series you make, scary videos, documentaries, and even vlogs. I can see how you portray the care and effort behind them in every edited detail. Thanks for being on YouTube and more I never stopped watching your videos through all the “drama”.",
        "Shane, please never stop making your long videos. They bring me so much joy, d laughter. I’ve loved watching you videos since I was in middle school, which was a long time ago considering I graduate college in may. I was so happy when I seen you were making them again.",
        "I'm so sad this can't be the end ",
        "Release this palette and name it survival!!!",
        "The pallette is immaculate and I can see how much effort you guys put into it. I am happy you are both in a more positive place.",
        "Looks like he love to laughs",
        "",
        "this is everything. As someone who is following both of you since the earliest days, this made me so happy but also kind of broke my heart. Thank you  ps. Jeffree please start making music again please",
        "I think the thing I appreciate the most about this series is the realness and relatability of being in our 30s and still figuring things out. To see people with this level of success still working out what the right path is is overwhelmingly comforting. I’m 30 and the army has been my life for most of my adult life. But now I’m facing potential medical retirement and it’s scary not knowing what’s going to happen or what the right answer is for my future. ",
        "Shane you were put on this earth just as much as Kathy Griffin was put on this earth. You have made so many people‘s lives and days and help people not commit suicide and get into deep or depressions because of your jokes regardless, if they’re morbid or if they’re not, they’re amazing jokes and they’re funny and they have got me through and my friends are very hard times in our lives and I wouldn’t know what I would do without you if you weren’t on here so you deserve everything you want in life and if that’s making a pallet you guys should make a pallet again maybe not just stock up so much this time and start a little of work your way up",
        "I love your energy when you’s are together.",
        "Twitch would be phukin amazing to see you guys do some irl there",
        "Don’t leave!!! Please! I’m only a mom telling you this, but we love you so much!",
        "I have so many things I want to say! This was such a bittersweet ending to an epic series! I’ll always cherish getting the chance to watch y’all together. Watch y’all create. Watch y’all entertain. It was fun for you as well us for us! During the time you were “canceled” was a dark time for me. I lost my father during that time to lung cancer. Not having the person who brought me joy through videos was so hard. 2020 was just a rough year for a lot of us! I really couldn’t imagine being in the public eye for millions and going through what y’all went through. I’m proud of you ALL! I know it hurts to look back on what could have been. But like you said Shane, your in a better place now. And sometimes it take reflecting and taking a moment or year to focus on yourself! I am so so so proud of y’all! I really hope to see Shane x jeffree videos in the future! And I wish y’all nothing but the absolute best! Much love from this Knoxville, TN girl!! ",
        "The flashbacks to the first series made me so emotional… kinda wish we could go back to how things were ",
        "I honestly wish it did come out I Love those colors together ",
        "Truly the end of an Era  I've been following you both for sooooo many years and was so proud when yall came together. This is heartbreaking I'm sure for all of us who grew up watching the two of you. I wish yall both so much happiness in life. Even if you never read this comment. Thanks for making my teenage years bearable Shane with your laughs and skits. Jeffery you inspired my love for makeup long ago. Ughh, I love you guys!",
        "Honestly I think you should just release it!!! We all want it!!",
        "Jeffree instead of 'beheading' snakes, maybe just leave them alone and walk away?",
        "I think it would be cool to see Jeffree and Shane do the masked singer",
        "️ ",
        "He never drank with a bat fuller than any pub I’ve been to behind him ?",
        "I am also of the days of myspace, etc....but I will never regress to Tik Tok....EVER.  It will be so sad saying good bye to JS, but he needs to do what makes him happy, and I'm grateful for the content he has given us.\n\nEDIT: Maybe rename your next palette 'Rebirth'.....or 'Phoenix'.....both of you have grown and reinvented yourselves - AGAIN...",
        "So your saying if I buy the other pallets I can recreate the sd 2 pallets that didn’t happen ",
        "YouTube is absolutely NOT dead and gone. I LOVE feature length videos, and I  appreciate the effort that goes into entertaining us so much! Thank you for this series Shane. Don’t ever stop doing what you’re doing ️",
        "Nobody in my life understands how much YOU and Jeffree have impacted my life. Im sad to see him go, you both are the only reason I go on Youtube anymore",
        "Why am i crying?",
        "Omg this video made me so sad  love you and Jeffree so much, your friendship is just amazing ",
        "I love that he named the yak Diamond Dawson! ",
        "All the flashbacks to the first series had me in tears. The full circle moment and seeing these two flourish in their new lives is amazing. I'm so proud of them both for all the growth. Absolutely devastated about the pallet that didn't launch but understood the reasoning behind it all. The friendship that these two have created throughout this entire experience has been so heart warming. I love you both. Thank you for getting us through the toughest times and sharing this incredible journey with us. ",
        "I would love for them to not be done with YouTube I love the videos  they are hilarious together",
        "Literally feel like I’m watching my besties reunite after years of being separated. I am praying to the Lord above that they continue to make content somewhere.",
        "this was SO EMOTIONAL!!..and that pallet!...id buy that in a heartbeat...even if some shades were already released <3 it has so much meaning behind it",
        "As a person who doesn't drink.... people constantly asking me to drink, what will it take to get u to drink, etcetc....its annoying.",
        "Full on cried during this especially when the repurposed shades were shown. Really gunna miss jeffree on here. Losing Jenna marbles was sad but losing jeffree made me cry. The end of an era. People love feeling nostalgic though so hopefully he will be back one day ",
        "YouTube will never be the same without you! I’m so happy that you found peace tho and I hope that all is well!!!! I love you so much!!!! ️🥹",
        "Didn't we hate Shane???",
        "I’m so sad you didn’t release this pallet, it’s so beautiful ",
        "I love you all. You both together are amazing, this can't be the end ",
        "I like some of the individual colors but I don't think it looks good all together. I feel like the colors that were picked don't compliment each other the way they should",
        "I feel like I've been smiling the entire video ️",
        "The palette is so beautiful. It reflects the beauty within Shane and Jeffree  I can only dream of the creations that would’ve come from it. I wish everything turned out differently so we could all experience the pallet. Thank you so much for sharing it with us! This video is raw in it’s honesty from Jeffree to Shane, Maddie, Ryland, Chris - everyone. I want to dive through the screen and give everyone a hug. You’re all such wonderful people. Thank you for sharing this part of your lives with us ",
        "why am I crying tho... stop. I don't want long form content to be over. It helps me get through my life, all my hard days, all my lonely days, it's what I look forward to. This was so nostalgic but in the saddest way. Revisiting their journey also brought me back to the time in my life when I was watching those documentaries and I miss that time. I guess we all have to move forward. Let's keep long form content alive though okay? Promise?",
        " ᵖʳᵒᵐᵒˢᵐ",
        "These flashbacks and seeing the colors repurposed literally made me cry. I remember crying so much in the conspiracy palette series seeing Shane being loved and shown he could be accepted as himself. And then the world hurt him all over again. It just fucking breaks my heart.",
        "I totally would have bought that pallets. The colour story is beautiful!",
        "Hey love ! Please if you see this don’t post stuff like this on the internet:(! There are so many creeps out there and just over all bad people! You will regret it in the future.",
        "Ima go cry brb",
        "You can just tell how much Shane loves Jeffree and how Jeffree loves Shane, mutual love in friendships doesn’t come around very often but when it does you hold on to those friendships with your life and never let go, both of your futures are so bright no matter what it looks like it’s bright. Love you both endlessly<3",
        "never thought I'd cry watching these two",
        "I fully thought the palette was going to be call CANCELLED and I would have still bought it in a heart beat. I’m so thankful for this series and being able to watch the friendship and love grow between you, Shane, and Jeffree. Thank you for sharing with us. We all appreciate it! ",
        "damn….. i rly love the doomsday palette……",
        "“So are we not gonna make stuff together anymore? He’s my favorite person to make stuff with” \n\nLiterally had me in tears.",
        "I'm so sad to see Jeffree go but I really love seeing him happy and at peace. I grew up with Jeffree on MySpace and friendster. Thank you for your videos. Shane, thank you for everything.",
        "Watching this series, it seems like Jeffree has really grown and you can see that in many ways Shane hasn’t because he’s still asking the same questions.  Jeffrey’s answers have so much more gravity to them and aren’t as vacuous and acquisitive as they once were.  You can see that they are still close friends but in many ways Shane is still doing the same shit.  Good on Jeffree for giving the  to you tube. This is the first long form content I’ve watched since the summer and all the YouTube creators are doing the same shit over and over again.  It’s played out.",
        "Shane’s videos are a work of art. I’ve never seen another YouTuber put in as much energy into a single video and Shane does it all the time!",
        "Okay but watching the first episode of this series literally had me READY to buy the palette & now I'm disappointed.  But we love you both. Happy growing ️",
        "Omg if you don't release this, at least release the shades as singles so people can rebuild it! This is such a beautiful palette and such a beautiful friendship. Love you two",
        "Very interesting",
        "Please keep making makeup Shane. When you guys come together you have such great ideas that you need to share with the world!!",
        "Remember when jeffree was talking shit about kylie for not making synthetic brushes and now he kills yaks",
        "new pallet name- Redemption",
        "I will never get bored of these documentaries, I love you Shane we are all on our own path and no one knows what gonna happen next.",
        "I wish i had this palette so much. I’m so glad y’all have grown and still have such a strong friendship. I love you both so much",
        "This makes me so sad! That palette was so amazing! They were flying so high after the conspiracy palette and then everything came crashing down. I admire how much they have both grown as ppl and also how caring their friendship is ",
        "I WANT THIS PALETTE. It’s so pretty!!! The way my jaw DROPPED!!!",
        "Honestly this is actually sad if your someone who’s been watching them from the start. The pairing of them together was iconic and the makeup they created was great.",
        "i literally cried at the repurposing shades part  just knowing yall worked so hard and put your hearts into something, and it not being whole anymore.  idk, just really got to me.  but i’m still happy that they did get repurposed and consumers are still able to enjoy them.  it’s a conflicting feeling lol but i love yall so much 🫶",
        "This is the saddest and most proud video I have ever seen from Jeffree and Shane and ryland. You all have made me happy in my darkest times and I'm so sorry YouTube couldn't be that for you at times. I want you all to be so happy and fulfilled in whatever that is. I'm glad you all cherish each other outside of your careers. Thank you so much for all of the years of beautiful content and love from your hearts. I will always watch every and any video all of you post and will support you even beyond that!",
        "The way Shane just picked up the poop ",
        "I wish we could buy this pallet, like a limited edition release. There are so many of us that love and would support it. Really awesome to see this come full circle and that your both doing so well and happy.",
        "This makes me so sad! That palette was so amazing! They were flying so high after the conspiracy palette and then everything came crashing down. I admire how much they have both grown as ppl and also how caring their friendship is",
        "Oh fuck me...why does Jeffree look just like Aaron Carter?? This is NOT good. I am kinda freaking out. Jeffree has a deep voice and is acting manly! Maybe I need to watch from episode one? Eek",
        "This makes me so sad. And watching the shades be repurposed almost made me wanna cry. What a beautiful series! Thank you Shane ️",
        "Pallet name: Resurrect",
        "I’m sad because i thought the reveal at the end was they were going to announce they were launching the second one",
        "As a long time subscriber of both Jeffree and Shane, and also a long time watcher of YouTube makeup videos, this is sorta a closing chapter for me, and so many others, I’m sure. - It’s sad, it’s worth mourning, but 2020-2022 has really reshaped us all for the better. ️",
        "What a beautiful portrayal of friendship, the journey & growth",
        "I NEED that palette!! How about naming it, \"The Peace ️ Palette\"? Since you & Jeffree have both found peace in your lives! ️ I think we could all agree that this crazy world we are living in could use some more peace & love in it. That palette is way to beautiful to sit on a shelf & collect dust somewhere! Please give us the gift of that palette! ️ I mean you're dressed in what someone could view as an astronaut outfit, so let's get ready for takeoff & launch this palette ",
        "I am said that palette isn't happening. It would be cool to make it anyways and call it Rebirth instead of Doomsday",
        "YouTube is dead. I watch maybe not even 5 mins worth a day.",
        "I use my conspiracy pallet everyday. I will never forget how exciting it was as each episode dropped. Oh and how crazy it was trying to order that pallet. Your friendship is so much fun thank you for sharing it with us.",
        "Anyone else got emotional with the repurposed shades, realizing that part of the second Shane palette has always been with us without even knowing it?",
        "i will stand by jeffree no matter what he chooses to do and i love his tiktoks but he seems unhappy doing that and yes im sad hes choosing to say goodbye to youtube i grew up w him hes why im so happy and confident now but as i said i will stand by jeffree no matter what he ends up choosing to do",
        "This was so bittersweet to watch, my love of makeup is because of Jeffree and all of the incredible makeup collections he's made and I've laughed until I've cried for so many years thanks to Shane. You 2 together have been unbelievable, you guys created something that I don't think any other beauty brand can ever top. You had the world waiting to see what was going to happen next while creating the Conspiracy Palette, my step dad who knew absolutely nothing and didn't give a shit about makeup was glued to the TV watching you create a historical collection. Thank you so much Shane for letting us all see the many sides of Jeffree through your series with him. And thank you Jeffree for so much inspiration, iconic moments and fabulousness while being on YouTube, you will go down in YouTube history! Can't wait to see both of your next adventures! 🩷",
        "It’s so unfortunate to see that the internet ruined such a beautiful thing. We’re so lucky to have been able to experience someone like you two in this existence. The internet has become such a cruel place. You both are amazing and always have been. I’m so glad you both have found happiness and wish that for you, forever. Don’t let anyone ruin that for you.",
        "Was the outdoor swatching after the poo? shanee",
        "This actually made me so sad I have been watching both of you from the beginning and I hope this isn’t a true end. The return will be diabolical.",
        "The  song playing as y no I left the inn, with the montage - epic",
        "Erm excuse me I need that palette and you two!! Don’t break my heart ",
        "Not jeffree singing before the chaos. This had me laughing for a minute, just when ryland started screaming. 38:36 ",
        "I'm literally so heart broken right now. that's all I can say. if it wasn't to SD, I would never love JS",
        "Shanes hat backwards the entire time hahahah I can't",
        "i did NOT expect myself to cry over this, but here i am, crying. gosh i love you both so much, it’s heartbreaking to hear about jeffree leaving, but it’s amazing seeing how far you two have come",
        "“people don’t like long video content anymore” me sitting in the same spot after watching 3 hour long shane videos in a row ",
        "I’m crying “And now that we’re at TikTok I wanna *ill myself”  is it just cause we’re getting older?!",
        "I quit watching Shane bc I stopped finding him funny but Jeffree will always have a place in my heart because of how real he is and seems to care ab his fans",
        "Are You shane Dreams Older Brother?",
        "Thank you so much for this chapter closing second series. I would have loved for the second palette to come out as the colour story is just so beautiful.. I understand that Doomsday in the current climate would not be the same BUT.. the shades are so reminiscent of the colours of Wyoming in this video!! I could definitely see this being the « yak palette » or something similar!!",
        "\"it's like I'm eating ass, it's so fluffy!\" ",
        "What’s sad is that I totally would buy that palette today, but I’ll never be able to :(",
        "The scene where Shane revealed the palette and talk about Jeffree using some of the shades in his recent palettes made it cry, knowing this beautiful palette will never come out made me so sad, but I’m still so glad your hard work didn’t go to waste and the world still got to see and use some of them. I hope someday you guys come out with a new palette, your creative minds together make such amazing work #rebirth ️️️",
        "Everything comes to an end. Feel like I watched all of you grow into adulthood. Make yourselves as happy as you’ve all made your fans. Hugs to Jeffree, Shane and Ryland",
        "“Maddie how’s that yak cause you know them more “  I can’t lol",
        "i love how jeffrey got 800,000 views and he’s like “look, no one cared.”",
        "OK. So…… WHEN ARE YOU DROPPING THE PALETTE? Y’all don’t realize we need it? ",
        "I could watch Jeffree and Shane together all day and never get bored! I'm hoping that Jeffree and Shane make a come back! I need a conspiracy part 2!",
        "WE WANT THE PALLET!!!!",
        "What ",
        "Can we… get the doomsday palette still? ️",
        "Shane this is so sad I literally cried!! The series made me very happy while I was going through a hard time so thank you!! And now that it has finally ended it’s so sad but I really do wish the best to you and Jeffree ",
        "seeing the originals for me dying makes me legit wanna cry. jenna now jeffery, youtube will be for real dead for me",
        "You both bring joy to my heart. Your friendship is so genuine and I’m so glad to see y’all together again.",
        "Shane, this is the best video. At 36 minutes I felt full of emotions for you. I'm so proud of you and the passion you put into your friends.",
        "I still can't finish watching the last minutes of this video because the music is so freaking sad and nostalgiccc I can't take it but i need to watch",
        "I understand that Shane didn’t want anything to do with the new pallet and told Jeffery to repurpose the shades, but considering how excited he was, considering the GLOW in his eye creating the shades; i really wish he got recognition for his hard work. It hurts my heart that cancel culture and the hatred in society penetrated their mentality’s. even the rich and famous can be bullied into submission. Cancel culture tends to do more harm than good.",
        "This guy still makes videos?",
        "God, I'm actually crying!  The emotion you can show in a long form YouTube video is something that will never be available on TikTok... I think I'm getting old.",
        "Rebirth! Do a new one with Shane called Rebirth",
        "What song at 43:45?",
        "The new generation has such a short attention span they don’t even want to sit through a 20 minute video. I loved this series. Hope to have more updates on your friendship in the future.",
        "Jeffree using some of Shane’s shades in a couple pallets and speaking so highly of them made me cry. He’s such a good friend to Shane I’m glad they’re both finding what makes them feel whole and happy now even if it mean we see less makeup or series. you can’t hold on to a moment forever but you can look back fondly",
        "Lol jeffree eating??? I'm shook",
        "After everything you guys have been through this is still so sad to hear. Everything that Jeffree said that people aren’t into anymore, I am here for. I love long videos, watching YouTube for fun, and coming home after a long day excited to watch your videos! Please don’t stop making videos Shane, a lot of us are still here",
        "The saddest thing ever, watching Jeffree talk about being villainized . I still love all of you ️! You bring so much joy and laughter to my life, and that’s what it’s all about! Thank you!",
        "This is sad, it was also my best time of my life lol you guys made it better I wish you guys released the palette as a goodbye, it’s bittersweet wish you guys the best ",
        "New happy name. Content!",
        "The Perseverance Palette ",
        "They made people who don’t even use makeup wanna buy makeup lol this is bitter sweet but I’m happy all parties are in better places in life! Much love ️",
        "As a 23 year old female I have to say, I'm a bit sad that everything is all tiktok now. I'd much rather watch a 25 minute long vlog then a 10 second clip of a makeup case closing with someone transitioning into a full look. It's cool for people I don't watch but if it was someone I'm subscribed to I would just end it man.",
        "We need the Donkey Punch palette ",
        "Hey Shane is your account still demonetized?",
        "WOWW, literally speechless. Thank you for being vulnerable and sharing this docuseries. The shades are GORGEOUSSS!!, Would you guys ever create another palette? regardless super proud of your growth!",
        "MAKE THE PALLET",
        "I always get the vibe Jeffrey doesn’t like Rylan",
        "Hey Shane dawnstar new begging palette",
        "I mean... A feel extremely sad knowing JS is leaving YouTube. To me he's a true king... I could watch his videos for hours!!!! Thank you for all these years man  gonna miss you",
        "I miss JS make up reviews",
        "Ryland is such a keeper.",
        "You’re all good people with big hearts and you all deserve to be happy. Thank you for the amazing content. And Jeffree deserves to do whatever makes him happy. He’s such a cool and awesome good person",
        "well I didn't think I would be ugly crying on a Tuesday night but here I am. such a BEAUTIFUL series, seriously. ugh I miss Jeffree so much but I'm so happy for him. I feel like I have spent so many hours watching him I feel like he was there with me through so much. His videos always gave me light in my darkest times. Shane this series was perfection. Hands down some of the best YouTube videos I have EVER experienced. When does Vlogmas come out again? I miss you and Ryland already.",
        "Sorry to double dip but JS is a LEGEND, he created the Beauty community. He’s made a big stamp of approval for us I appreciate you guys so much. Thank you ",
        "Hearing everyone complimenting the shades is making me so emotional.",
        "I love their friendship, its so beautiful to see",
        "yeah no i need that pallet im so sad it wasnt released",
        "So proud and happy and relieved for Jeffrey doing what makes him happy and what’s healthy for him but Shane…. Your not allowed to go to we can’t loose everyone",
        "Did anyone else have a little hope this palette would come out?",
        "Jeffree should do a Star Yak Ranch palette!!!!",
        "Shane please do a series on Gabbie Hannah",
        "️️️",
        "NAME IT REBIRTH   \n\nI HATE IT WAS NEVER RELEASED UGH, AND IM. GONNA MISS JEFFREE IN YOUTUBE. \nLiterally every new pallets that I'm interested in, I go to YouTube to watch him swatch it",
        "This is promo to get people interested. They'll launch it..",
        "This series was quality and deep, evoked so many emotions, awesome job Shane, Jeffree, Ryland & Chris",
        "I’m now so sad that the shades weren’t all on one palette ",
        "If I had the money to buy all the makeup pallets I would.. I do have both of theirs together and a pig mirror I love them..",
        "Next series needs to be with Gabbie Hanna!!",
        "The way I would have used the top row every day",
        "I am honestly speachless! I have the exact same mixed feelings as Shane! I will miss Jeffree soooo much! His videos,his humor and most of all the best example of how to become successful from nothing! He is soooo inspiring words can’t describe it! I loved every single thing u guys put out together ! So yeah I’m very sad…but happy that he is happy! I wish the world wouldn’t have been so cruel to you guys! Honestly! I do hope that both of u will find happiness and have the life you wish for! I love you Jeffree and Shane!",
        "Wow just wow.. what a journey!!",
        "I was getting so emotional watching the clips of people using the shades that were distributed into different palettes.  i would hands down buy that right now!!! Jeffree should have them all available as singles and let us make our own palettes.",
        "I shed far too many tears over this ;( It's such a beautiful way of saying the end of an old era and the beginning of a new one <3 Amazing job shane <3",
        "What even was the point of this “series”",
        "As a person from the country I literally never thought jefree would be the type to love the country. There is something so free about being in nature. I get grounded when I go out in the woods or pastures. Animals have a special way with people and helping them heal. I really enjoyed this series!!!! Thank you Shane, Ryland, Chris, and Jefree for this awesome content",
        "The problem with series like this is that it always leaves me wanting more. But, this was a beautiful video series about growth and friendship and I am here for it!",
        "Been in depression for about a couple of years. Its then when i found out shane and jeffree's channels . Too much of people they let enter their lives made the dramadisaster. To be in rage, its suprising how the social media affected my emotions how the other influencers made me feel disappointed to these two. 2023 is coming. We should forget and spread love.",
        "Such a pretty pallet… so sad it didn’t come out",
        "This feels like a perfect goodbye for Jeffree. The circle is now closed. We got to see Jeffree's journey through Shane! It was amazing!",
        "Omfg I just laughed HYSTERICAL at the wasp part. Holy shit ",
        "This was the finale? I didn't even know",
        "How about naming it \"New Chapter\"",
        "AHHHHHHHHH IM SO EXCITED!!!! I hope you guys like the finale!!! I'm so proud of this video and this unexpected journey. I hope you enjoy it as much as i do!!! <3333",
        "Why not just release the pallet who cares if the shades are in other palettes",
        "RELEASE THIS PALETTE :(((",
        "The internet is cruel, but the fans who really loved you never really left. It was so sweet and nostalgic watching this series. Conspiracy is still one of my favorite palettes. I loved Jeffree since MySpace and you since the beginning. I wish you both the best on your adventures",
        "u n jidion should collab",
        "Love you Jeffree will miss u.",
        "The Rebirth Palette ",
        "SHANE MAKE MORE MYTHS VIDEOS",
        "I’m so sorry for what happened to you both. Naturally, I started to tear up at the sight of the doomsday palette. It’s such a shame that such a beautiful collaboration was wasted because of cancel culture. I know you both made mistakes, but no one should be bullied to the extent that they want to give up. I love you both. I’ve been watching you both since I was 13. If you guys see this, I’m happy that you two can find peace ",
        "This video hits my heart in so many different ways ️ all I know is I love you all and want you all to be happy and have the absolute best experience life can offer ️  I’m so incredibly proud of you all! Currently sobbing … just know you guys are so loved and thank you for being there for me when I have been low. Always have y’all’s back ️ I cannot believe that some of the colors I adore in those palettes were going to be originally in y’all’s part two. My literal heart",
        "REBIRTH should be a new pallet name",
        "Jeffree figured it out people have changed.",
        " The use of Narrowhaven’s STUTTER is perfection here ",
        "It does break my heart about Jeffree saying that about YouTube is like millions of people are still watching but it’s just not 30 mill or whatever, it still is 1-3mill. Idk I still watch and I love channels like Sam and Colby but they also have like subscription service like everyone is behind a pay wall. It’s hard but tiktok is so easy to find things you love and smaller videos. Idk makes me sad, I don’t wanna grow up anymore. I remember in highschool YouTube was my safe haven and now it’s like empty…",
        "Jeffree is YouTube! It is JeffreeTube.",
        "What about instead of doomsday, you called it gayday. You wanted something happy and you are both so happy and content. Im really happy for you both.",
        "It's so sad to see Jeffrey or any other youtuber feeling like their content is not worth it. I LOVE long term content. By shortening the content you put out you shorten the viewers attention span. Jeffrey, Shane, you guys rock and do what makes you happy because f other people's opinions. An opinion is like an a hole, everyone's got one...",
        "I loved everything about this, besides the separation, but it is not really a separation, maybe just a change. Change can always be good. Much love from Argentina.",
        "it made me cry. You have been the biggest part of my life forever. I’ve watched you since I was like nine years old and I feel like I’ve grown up with you. You’re the big brother that I wish I had. Thank you for being such a big part of my life, I wish I could meet you. That is my biggest dream in life. I love you Shane.",
        "I love that you have each other ️ your friendship is pretty",
        "The thing about \"doing a Jenna Marbles\" is that it really affected people in a terrible way.  I was completely devastated by her leaving and am still heartbroken and miss her terribly. I understand people need to grow and do what's best for them but the other side of that coin is the loyal audience who actually loves you.  It's a very unpopular opinion but I also actually have some resentment toward her for it. I LOVE her, of course, and I think that's where the resentment stems from.",
        "Genuinely sad. I adore JS, and so sad he’s leaving YT.  Thank you Shane for another epic series!  Please don’t you leave too…….. xxx",
        "Awe man, of all the palettes from this brand, this is the one I would have bought. I'm sorry this didn't work out the way you planned, but the universe shows up for us in ways we don't know until we reflect on it. 'Doomsday' looked ominous for sure! I'm happy to see everyone doing what brings them the most joy. Good Luck *hugs",
        "the way I would actually buy that pallet so fast",
        "Put the pallet out its so stunning don't care if the colours are used in other pallets🥹🥹 do the collection please ",
        "I will nebar",
        "Jeffree has changed so much. He seems so centred & grounded. I love that for him. Thank you guys for making this. Shane & Jeffree will always be the most iconic duo ",
        "I do not like Shane Dawson with makeup on. I don't know why. And I think JS looks better with the shorter hair.",
        "I cried  I feel so depressed after watching this.. I love seeing them together.. and why not make another pallet? Shane you loved doing it… and you’re not cancelled anymore. Those who are still here, believe in you. I’ve been a fan of yours since the early 2000s and never gave up on you. ",
        "i am in tears. i can't believe it is all coming to an end. what you both created had such a big impact on me. it is sad to see it all go, but i am glad you are both happy and coming to terms with everything. thank YOU shane and jeffree. thank you for creating something we will never forget. ",
        "Don’t let the door hit you on the way out",
        "I would rename the pallet “Light of Day”.",
        "I love everything about this series! ️",
        "I’m so proud of you Shane",
        "Please do make more videos together tho, I love you two so much the series on the pallette was such a joyful time jeez those vids made me happy af. However I totally support the decision coz cmon people life is so fuckin short and social media is often such a negative place like get off your phone and start living ♡",
        "I’m ngl I would’ve loved to still have this palette it’s so beautiful and I love it but ofc up to you guys but I’m sure we would all love to have this palette",
        "Wow I can’t imagine watching the shades get repurposed. That scene made me so emotional. :(((",
        "Shane!!! Thank you for creating for us. Honestly the headspace you guys are in is exactly where I am also. I’ve been through so much and it feels like this is the time to heal and focus on being happy. I’m so proud of you both for getting to that place. ",
        "I think Jeffree is suffering from depression ",
        "I’m so sad it’s not a pallet I’m obsessed I need it. I would buy it if y’all decide to bring it fully out.",
        "Grow your hair out again Shane",
        "Today I officially unsubscribed I miss the old Shane Videos these ones aren’t my tea which is such a shame I would’ve stayed subscribed but why Shane do you have to do so many videos with Jeffrey star so disappointed!",
        "The Evolution Palette ",
        "I love this version of Jeffree. I hope more people have these same realizations. Filters, Hollywood, and the media aren’t good for the soul ️",
        "️🥹",
        "It breaks my heart to see that all the work they put into that 2nd palette ended up getting broken up, like the end of an era. That copper shade was so beautiful. I'm so sorry that people couldn't take a shining star and had to dim its light. I'm glad you've both found your light again.",
        "Create a new pallete called REBIRTH ️",
        "I'm also sad it never made it to peoples hands .. I would have loved having that color story !",
        "I think the pandemic taught us ALL to slow down and reevaluate what’s important. Sometimes peace and happiness is so much more valuable than a 20mil house and fame. I’m proud of Jeffery",
        "Im only 3mins in but i feel like Jeffery only cares about who’s watching. Theyve lost all care for the fact that it should be or used to be fun. I feel like Ryland and Shane do YouTube because they love it and you can see that through their videos. Thats why I still watch because you can see the care and love that gets put into it all.",
        "YouTube isn’t dead. Long content isn’t dead. You are just not a part of it anymore.",
        "While I’m happy that you’re all in a better mindset and content in your lives, this is heartbreaking. The impact you both have on us together and individually is unmatched. Following Jeffree since MySpace days and following Shane since the dawn of YouTube makes me realize how much you’re both a part of me. You’ve both got me through my darkest times and watching you both be real and transparent is what I needed. I’m excited to see where you all go from here and can’t express how proud I am of all you’ve endured and accomplished. No matter what, we will be here to love and support your journey. Just know that I, amongst many others, will always love and cherish every moment you share/ shared. Bless you all. On to the next chapter, on to better things. ",
        "Thank god",
        "Such a good series. Loved  seeing both of y'all together again."
    ],
    "comments_disabled": false
}