{"video_id": "mMaBVfIedFw", "comments": ["Micheal is the only person who can start a video with an illegal pooping selfie and everyone just immediately accepts it", "I'm just grateful that Michael is one of the few Youtubers who never thought he had outgrown his original format and style and that I can still enjoy the content and quality as I did 10 years ago. Hail to Vsauce, Veritasium, Captain disillusion, Steve Mould and other Youtube giants.", "I hope he understands how much we appreciate the consistent use of Jake Chudnow music. I hope it never goes away", "Is no one going to question how Micheal just invents the word \"Ussy\" out of thin air? Love this man", "I love how these photos make the past feel so much more real and the people more human. You can see personality in their faces. The ones with someone and a friend or a partner are just too cute, they saved a moment of joy that we can see over 100 years later and still relate to. Damn photography is one of the coolest things humans ever made", "Michael is truly one of a kind. Thank you for still making this content", "It's the annual Vsauce treat!", "Michael is the only person that can take a boring subject like selfies and make a 25 Minute video that is interesting the whole way through", "This is the Vsauce I missed, that I've been craving for years: Beautifully diving into a topic no one has ever thought about, but doing it in a way that makes us all incredibly interested in it. Keep it up Michael, we love you!", "I love how Michael still uses Chudnow's music, the 145 Poodles at 5:01 is to me THE Vsauce-music. Makes it feel so nostalgic ", "Michael is one of the few people I’ll immediately drop everything Im doing to watch when I see that he’s uploaded", "How Michael is able to take a silly, seemingly random topic such as \"Who took the first selfie?\" and turn it into a 25 minute, excellent, thought-provoking social commentary is so wonderfully inspiring. I've always loved how VSauce videos take so many tangents that are all related to each other yet make a very entertaining and informative video. Michael, you're a genius.", "Can always count on Vsauce to turn a simple question into a 25 minutes history lesson.", "The longevity is unreal. VSauce might never end", "I feel like I'm in middle school again watching a new Vsauce video (attending college now). The music, the presentation, and even Michael's appearance haven't changed at all. Really brings me back", "Any time Vsauce releases a new video, it's a great day.  Man I freaking love this channel. Michael you are the best.", "Honestly the fact that this video is almost indistinguishable from his older videos in style and editing is amazing.", "One thing is sure that vsauce never fails to give you existential crisis at some point or sometimes throughout the video.", "Micheal openly confessing to a federal crime to start a video is actually completely in character", "Real ones know Corys humor is high tier also rest in peace Stanley", "Imagine taking a selfie a few years back then seeing it again in a vsauce video.", "I've been watching him ever since he started. He still blows my mind with how much is out there to be understood or talked about. Just how much is out there is enough to make you crazy. But with someone like him explaining some of it makes everything worth listening to.", "Michael, I think I can speak for everyone when I say that we're thankful that you're still doing this kind of content. It's captivating as always.", "I wish there was a way to capture the feeling I get seeing vsauce dropped a new video. Nostalgia, happiness, and a small bit of unexplained sadness just got me like a 10-ton truck. Seeing this like a month before deploying hits different. Thank you, Michael.", "I love how Michael’s videos now feel exactly the same as they did 10 years ago.", "Thank you Michael for giving us the old school Jake Chudnow - going down such a great vibe to the old school classics from many many years ago. so thanks again for bringing it back and for hitting nostalgia :)", "How did that dude stand in front of his opera glass camera for 15 minutes without blinking? Honestly, that’s one of the more impressive parts of the video", "it always feel surreal when we look at old pictures because we're just so similar. I can't see the people of the past who created self-portrait paintings as vividly as someone who took photographs.", " We are blessed to have Michael here with us through all these years! Dang, time is flying. ", "I can only imagine how deep Michael went into the mathematics rabbit hole but it seems somehow he found his way out", "These classic style Vsauce videos will always be loved. Thanks Michael!", "Man i miss these vsauce originals. Im soo glad you're back at it!", "It's always a pleasure to see new video's from Vsauce!", "I just can't get over how good your videos are. They always have been and always will, thank you Michael.", "Man VSauce be pounding out vids this year. Michael, keep up this insane pace and I sense great success in your future.", "Michael admitting to crimes and hearing \"ussy\" within the first 2 minutes is just splendid. Pure gold.", "I love that instead of being a professor of philosophy at some exclusive, expensive, and pretentious university exclusively for equally expensive and pretentious uni students Michael has been consistently one of if not the biggest gems youtube has ever offered.", "The amount of excitement I felt when I seen vsauce posted for the first time in a year is indescribable", "Vsauce videos are a rollercoaster of emotions every time, and I dig it", "The craziest thing about this video is how he managed to stay on one topic for 25 minutes", "I love how the sight of techno strikes fear into anyone who sees him, Rest In Peace Alex", "There is something incredibly sad about hearing 14yo Anastasia Nikolaevna, who took goofy pictures of herself and sent them to friends, then hearing how she was executed in a revolution. If you read it in a history book, you would have no feeling. It would be \"There was a royal family, they were executed\", but actually seeing her photos, and seeing her be a 14yo girl and then hearing about her execution. That is so much sadder. She was just a kid.", "Glad Michael is finally back to his old style of videos. Love you michael!", "Always love Vsauce for quality, interest and entertainment. Keep them coming please. Even after long breaks they are a delight.", "its never really just who took the first selfie with Michael, its always way more complicated.  And I love it!", "Another thing about Bek that seems to have been overlooked in recent times is just how good his fifth studio album, Odelay, was.", "Michael is one of like 5 youtubers uploading consistent, high-quality, videos that are interesting for more than 10 years.\nEdit: Ok, yes it's more than 5.", "seeing vsauce again is like christmas, a pleasant time which comes once a year", "I wish Michael was my teacher. He literally taught me FAR more stuff than my other teachers.", "I love how Michael explain these all, and always wonder is he ever published his foundings like this in a form of a journal articles?", "Whenever Vsauce uploads a new video it feels like an early Christmas present", "Wild that a channel can be so good that it releases an episode once every Haley’s Comet and still produces amazing content and gets high views", "Michael is the only person in the planet that can post one video every 10 years and still keep his followers happy! ", "thank you for staying so great at these kinds of videos over the past decade. ive been watching since 2012 and love every video you make. makes me so happy to hear that tone when the video starts every time :)", "I would love to see more space or science videos as those were my absolute faves. Or even ones about time!", "The fact that his 10 year old videos are as high quality as these is amazing", "I think Vsauce and Michael is the only YouTube channel that never fails to amaze me, no matter what. Whenever I see a new upload, it's such a special treat and I can re-watch the older ones again and again.", "I love the classic Vsauce music. It feels so nostalgic these days. Glad it's still being used ", "You know it's a good year when Michael uploads", "Thank you so much for still making these videos. It was so nice to hear the classic Vsauce Video music again", "we love you so much michael!!!! almost 8000 comments so you will never see this, but you know it. I grew up with you michael. you provided me comfort and dare I say SAFETY when I was a kid struggling to find myself. you gave me information that I never knew I wanted until you gave it to me. I have always enjoyed your videos and I will continue to do so until you stop making them. I love you so much and thank you for doing what you do <3", "Only Vsauce can get me interested in a topic I never cared about and end it with the weirdest question but make it sound philosophical", "Absolutely LOVED this video. Social history across 3.5 thousand years. Thank you Michael.", "Another example of a perfect explainer video.", "I actually love these animations, they are so unique and adorable. Im honestly a huge fan!", "I really like how Bek portrayed himself as a dumpy potato boy and idealized his wife into a beautiful woman, he had free reign to portray himself however he wished but he saw himself as a just a regular guy who lucked into the most beautiful woman ever.", "Vsauce is genuinely the only channel I will instantly watch a new video of when I see its been uploaded. Can always guarantee top quality content.", "The 'classic' Vsauce style is irreplaceable.", "I missed all that selfie stuff.  Thank you for your insightfull catch-up.  No one else ever came close to explaining this in such depth; AND you're easy on the eyes yourself!", "Honestly wasn’t expecting another full-length video so soon, Michael blesses us prematurely!", "I like how Bek unashamedly gave himself a big beer belly. He keeps it real.", "Michael is one the pioneer of \"Video essay\" genre", "Vsauce videos always make my brain smile", "These videos still goes hard even after 10 years…", "Can we just appreciate the fact that he never disappoints us with his content : ^_^", "It doesn't matter how much time passes between Michael's uploads, he's always gonna look the same.", "Man, I miss the good ol day when we always had new vsauce to watch and new stuff to learn.", "I am unable to tell the difference between a vsauce video from a decade ago, or a video from yesterday. I thought this was years old until I saw when it was posted. Truly amazing", "Shout out to Kodak for helping push photography forward through personal cameras!", "You know it's gonna be a good day when you see a  new Vsauce video ", "Every single one of the vintage “selfie” selfie photos was delightful. Also The Grand Duchess Anastasia Romanov took a selfie with novelty teeth and sent it to her friends?? Incredible.", "Vsauce is basically random thoughts or questions that pop up in your mind but backed by research", "I never take selfies cause I find it weird to have photos of me on my phone but watching this makes me respect the whole concept more XD", "I love Micheal so much. I hope he never stops making these fascinating videos.", "The way he pulls out facts; definitely,  makes all forms of journalism, surveys and mass media compilation worth it.", "Micheal is the kind of guy who would talk like this to the cops if he's pulled over.", "Man it's so good to see Michael's face again.  I'm really glad this dude exists.", "Anatasia's selfies are so interesting to look at, because they really do look exactly like something that would be taken today. People don't change, it's the world that does, and we may adapt with it, but deep down we're all still the same. It's an oddly comforting thought.", "When that Vsauce music kicks in, feelings of nostalgia kick in as well as goosebumps.", "I was the one to take the first modern selfie, in 1999 in Florence. I did not know how that would be called a few years later. I could not see what I was framing, but the result was near to perfect, with a nice background too. When I asked my friends \"who do you think took this photo?\", they ALL said \"your wife\". Nobody wanted to believe that it was myself.", "A legend never truly die, because as long as his videos are still around, we have something to keep him alive. :'(", "Let's go they recognized him!  So glad to see Smii7y making such close connections to the people that make the games he plays. :-", "As always Micheal asking the serious questions ", "I love how this channel has been going on for 12 years and the music hasn’t changed since and still gives me goosebumps haha", "Oh my goodness, I love this game! It gets really hard as you go along, but here's two tips:\nPay attention to abilities. All the pets have different ones, and you can make really good strategies with them.\nAnd scaling. Pets with scaling abilities make their allies stronger, and in turn, make winning battles easier. The giraffe, monkey, poodle and dragonfly are all good scalers. Also, when you combine pets and they level up, a random pet of the next tier appears in the shop. Hope this helps!", "I really like how close this feels to old VSauce!", "I love these videos I’m so glad you put one out. Years ago I binge watched all your videos and I still go back and watch them from time to time they are just so good.", "I loved the light hearted tone of this one. Thank you so much for all of your videos!", "I wish all the sauce channels went back to full-time frequent uploads. Some of the best YouTube content out there. Luckily Jake is making his comeback so hopefully the others will follow.", "This is probably the first time that Michael didn't go off topic at all, he explained everything about this topic,  from introduction to body to conclusion and still left us wondering with a very important questions in the end "]}