{
    "video_id": "mMaBVfIedFw",
    "comments": [
        "I love how Michael’s videos now feel exactly the same as they did 10 years ago.",
        "Still waiting on that episode about Xenophobia Michael.",
        "23:06 \n\nWell to be fair, Mike Tyson has been calling it that for years. ",
        "I know this is a little thing, but I can't describe to you how fun it is to analyze the 'before and after' of the various shots you posted. Thanks for including the papers of historic shots along with the 'selfie' version, and the photo/painting of the gentleman in the first 5 minutes. Really adds another layer to the production!!!",
        "I love those selfies starting around 9:15",
        "The pictures taken by the Tsar's daughter are so fascinating. I've never seen anyone from that time depicted in such a human way that's similar to how we take pictures of ourselves now, as opposed to a photo of them sat down blank faced where they seem so far from human that they could be robots. It genuinely makes it so much more real when Michael then goes on to mention how her and the rest of the family were killed by Bolsheviks shortly after.",
        "16:58 Hi Vsauce, Prisoner here..",
        "12:50 I propose we call this, the \"Elsie\".",
        "So happy he’s making videos on this channel again",
        "Seeing that another Vsauce video came out today really boosted my mood. I've been watching Vsauce since about early 2012 when I was almost 14. I'm now 24 years old. It's amazing to think I've been watching this channel for a little over 10 years now!",
        "Did the title of this video change as i was watching it.",
        "Did he call a selfie with more than one person an \"ussie\"? Is that a thing?",
        "\"... are humans a selfie since God created us in his own image?\"\n\nThis is why I watch Vsauce.",
        "Does anybody know who is the woman at 5:36 ? Or where does that picture come from ? She looks identical to my mom, I would love to find out more it’s so funny, like she traveled in time haha !",
        "The icon in the title... I had to paste it and blow it up to like font size 40 to see what it was.",
        "When the world needed him the most, he came back.",
        "I always feel like there's a deeper meaning to all of Vsauce's videos",
        "Did you know, the term \"Selfie\" came from Australia",
        "7:56 It blows my mind how she wrote \"Я!\" over her nose on the photo, which means \"me!\" in Russian. And used a  instead of a dot in the exclamation mark. It's like a typical selfie on Instagram, but 100 years ago.",
        "There's a real beauty in self photography from the past; the emotions and context are super candid because the subject is usually alone",
        "Michael sinking into the Vsauce and the putting of his brain food into my grey matter mouth was the most possibly unhinged way he could've ended this video. Thanks Michael!",
        "I’ve missed you Michael!",
        "I enjoyed Michael's 25 minute long selfie of himself.",
        "A blessing! It's completely mind-blowing to me that Michael is still making videos like these. It feels like a dream, I don't know why, maybe it's because of the way I discovered Vsauce, but it's fascinating to say the least. In any way, I am thankful for Michael's existence.",
        "micheal at 17:02 just chillin in prison",
        "4",
        "I never expected to learn about the Bekussy today",
        "Yesssssss more content",
        "This video feels like a Vsauce classic... a bunch of information not some complex concept that's impossible to understand. The music helps to make it feel like the old videos. It jumps back to your face and I expect to see 2013 Michael. Strange.",
        "This is legendary, thank you Michael, so glad the world has you",
        "Forget the channel name.......search 'bald guy science'....here i am......",
        "This was great. I love all the Grand Dutchess Anastacia Romanov selfies. I saw them years ago, and she is why I am learning the Russian language. I also look a lot like her. She’s one of my favorite people from the past. ",
        "Mitosis was probably the first selfie.",
        "He returns...",
        "I really like how close this feels to old VSauce!",
        "YO ITS THE SAUCEEEEEEEEEE!!!",
        "My favourite guy on utube, pls keep creating amazing mind bending content",
        "De elves make elfies?",
        "vsauce  where days no uploads on days it months",
        "I love these videos I’m so glad you put one out. Years ago I binge watched all your videos and I still go back and watch them from time to time they are just so good.",
        "at 19:06 I was anticipating POGGERS",
        "omfg i love you vsauce so much",
        "Vsauce is basically random thoughts or questions that pop up in your mind but backed by research",
        "Michael admitting to crimes and hearing \"ussy\" within the first 2 minutes is just splendid. Pure gold.",
        "Knowing that I live in the home country of the word \"Doggo\" makes me very happy",
        "i can't help but feel so nostalgic while watching this",
        "This made me oddly emotional",
        "6:12 that's... heart breaking and I don't know why I didn't think of that\n\npeople can forget your name but can find what you've left behind",
        "Man, I miss the good ol day when we always had new vsauce to watch and new stuff to learn.",
        "I'm not that much of a good looking person, therefore, selfies it is something that I tend to avoid, or I'll make them for my own use and then I'll delete them. So much so that I dig up my old posts with selfies on the social media and purge them out of existence as something to be ashamed of. It is easy to be a selfie model when you in fact a good looking object for that. Otherwise, not so much. Just sayin'. Peace!",
        "Someone keeps changing the thumbnail. Not happy with the views on this one? 1.6M in 6 days not enough? smh youtubers.",
        "Cant wait for Bussy become world of the year",
        "When he said thanks Obama I laughed for real .. and still am",
        "waw, how could you sewed in the polar bear comparison i have no idea ",
        "Had to be an Aussie who invented \"selfie\"",
        "Never end to amaze me how Michael can go from \"who took the first selfie\" to \"this girl and her family was brutally murdered in their basement\" in just a few minutes in the same video.",
        "How do you find the first recorded uses of specific terms?",
        "Michael is like that one uncle who always tell you about the best stories he can find. Not too often but quality over quantity.",
        "I'm just glad he didn't pull a donut out of the toilet this time.",
        "Good to see the old OG Michael back, love the videos ",
        "I never really thought about the social implications of something such as this, it's actually really existential to think about the human condition through self-portraits. I wonder if anthropology has much to say on this academically?... something to look into.",
        "This video was uploaded 4 days ago, and its indistinguishable from the ones uploaded 9 years ago.",
        "1:13 Ussy? O///O",
        "Ussy",
        "The term was coined partially as an abbreviation of Self Portrait but it had a tinge of judgment.+\nIE Girls are obsessed with their looks and the ones who love themselves the most take the most pictures of themselves because they're conceded .",
        "Can we have regular VSauce videos now, please? Millions been waiting for years!",
        "If Michael was a history teacher, none of his students would ever fail!",
        "Vsauce releasing a video will always stand out as a highlight of my life, thank you for such awesome videos!",
        "I am totally loving these new old style Vsauce videos. If time's arrow, Michael is one of my favorite trajectories.",
        "The best youtuber out there fr",
        "9:46 This pic goes so hard",
        "9:26 that really looks like doctor traveled to the past to take a selfie. Weird.",
        "You've got a knack for taking seemingly mundane subjects and turning it into something I could listen to for hours.",
        "Love the content, Michael.",
        "Should we start calling D-pics Delfies?",
        "Only Ogs remember the old title.",
        "The real selfies were the selfies we selfied along the way",
        "Joseph Byron?\nHmm....",
        "Great video. you've remind me of what someone once said️  Making money is an Action, keeping money is behavior, Growing money is Knowledge. I once attended seminar and ever since then i been waxing strong financially, and i most tell you the truth.",
        "Bean’s, rice, jesus christ, and BYRON",
        "You aged very well",
        "\"People like looking at themselves.\"\n\nNever have I felt less human and more alien than when this was repeatedly said by Michael.",
        "Excellent research and presentation as always my dude",
        "I audibly gasped when I saw this video was posted. This is the content I am addicted to.",
        "Makes me curious what fifth wave selfies could be. How much better can we get? Drones?",
        "Where were u ️ after covid year u just started selling your beard then one vid 4 months ago and now u are here are u busy/fine or just lazy ️",
        "Vsauce videos always make my brain smile",
        "\"And this is the first ever ussy\"",
        "did anyone else think churchhill was in the thumbnail?",
        "I love how this video has the same style and energy of his older videos",
        "Absolutely LOVED this video. Social history across 3.5 thousand years. Thank you Michael.",
        "What about...A Cornfie?? ",
        "This video really takes me back to the old Vsauce videos! Great video as always.",
        "Loved the video as always. By the way, i would really enjoy if you make a video talking about the  Baader-Meinhof Phenomenon (frequency illusion), which is pretty interesting. Love your work, Michael",
        "Weirdly related to the anacronym. Kids now make the hand signal for phone differently than us.  they hold a flat hand to their ear(like the modern phone)",
        "joseph biren",
        "I haven't watched your content in a long time as soon as that @0.47 music hit came in, it was like a warm blanket, carefully heated from the radiator near my bed.\n\nNever change Michael.",
        "never say Usy again please",
        "I dislike taking pictures of my face, but whenever someone asks me about what I'm doing I just send a picture of my surroundings.",
        "Causally mentions a family being slaughtered then moves on like nothin",
        "Michel is one of the constants of the Universe",
        "Missed this so bad",
        "Hey, Vsauce! Micheal here. Your home security is great…\n\n\nOr is it?",
        "He only made this 25 minute video to tell you about the stupid belfie thing then hot you with the bad felfie joke. The hustle, the determination, the balls of this great man.",
        "PW\n\n5 hours ago\n\nMichael, I think I can speak for everyone when I say that we're thankful that you're still doing this kind of content. It's captivating as always.",
        "This was absolutely fascinating! It's got me thinking about selfies and self-portraiture in entirely different ways.",
        "I must be the only person on earth that doesn't like or take pictures of myself",
        "0:47, yes, the music I had been waiting for!!",
        "All I learned is that in a parallel universe somewhere people are taking selfos",
        "Is this the guy from breaking bad??",
        "“Certain famous historical photographs”\n\nShows Wills & Kate’s wedding",
        ">posts video with underrated title\n>confesses to federal crime + getting away with it\n>refuses to not elaborate (and digress) further\n>leaves for a decade",
        "This is dark but... Bolsheviks tryed to stop them selfies.",
        "i was very surprised michael didn’t mention george harrison’s selfies in india tho. those look very modern even tho they were taken in 1966.",
        "a week ago a made a comment about how the the thumbnail wasnt vsauce enough but because of this title change the thumbnail no longer matters",
        "Old classic Vsause....love it",
        "It’s crazy to think that I was watching Vsauce when I first started watching YouTube as an 11 year old. I’m 21 in 8 days",
        "13:44 \n\"But then... something happened in Japan\"\nscary music plays",
        "Gotta love the statute of limitations.",
        "Omg vsause i never saw your channel ",
        "Honestly wasn’t expecting another full-length video so soon, Michael knows when his viewers need a Vsause upload",
        "easily your most boring video",
        "Mr Stevens, I have maintained 2 Curiosity Box subscriptions for my grand-daughter and nephew for several years now, but recently there was some sort of update that cause both to be shipped to my grand-daughter (who lives several states away from my nephew).",
        "\"If a selfie of your butt is called a belfie then shouldn't a selfie of your face be a felfie?\"\n\nThis has bothered me as a guy who is a nurse. People say I'm a 'murse' as a portmanteau of 'male nurse.' But if I'm a murse then all of my female colleagues should be called 'furses'",
        "Brilliant as ever",
        "I love how this whole video is an ode to humanity. We really never change. All of us want to be remembered. All of us have some amount of fascination at our own image. All of us want to communicate across space and, as it turns out, time. Personally, I find this moving. From handprints on cave walls, to teens sending silly pictures to one another, the only real differences are in the ease, ubiquity, and product quality of the ways by which we record our lives and selves.",
        "Michael, I think I can speak for everyone when I say that we're thankful that you're still doing this kind of content. It's captivating as always.",
        "Everyone knows it's Mr. Bean",
        "This video in particular really penetrated my soul. It's beautiful to see pictures that make people of the past seem so real and human. It seems that grainy, black and white daguerreotypes automatically lead us to view the subjects as stoic, distant, and different from us. Colorized photographs and teenagers taking casual mirror selfies in 1915, smiling and posing like real kids that lived and laughed, just changes things.",
        "am i crazy or he changed the thumbnail then changed it back?",
        "Who watches this whenever Michael changes title?",
        "I really love how waiting for some weeks for content doesnt apply to vsauce.",
        "Where are those science videos\nWe want them back again",
        "I'm really glad you mentioned Vivian Maier, she is relavilty lesser-known but is a shining example of a \"true\" artist; one that creates for the sake of creation and expresses for the sake of expression.",
        "When the music kicks in at 15:07 you know you're getting to the answers",
        "Thank you",
        "Shouldn't a nude then called Nelfie???",
        "I watched the 1,2,3,4,5,6,7,8,9,10....video and you talked about not needing to count 2 dots or 3 dots we kinda just know.\nI was wondering if that were true with signs we read. Like do we actually read \"S-T-OP\" on a Stop Sign? Or do we recognize it the same as the counting of those dots...",
        "Also admitting to it because the statute of limitations has expired ",
        "I was the one to take the first modern selfie, in 1999 in Florence. I did not know how that would be called a few years later. I could not see what I was framing, but the result was near to perfect, with a nice background too. When I asked my friends \"who do you think took this photo?\", they ALL said \"your wife\". Nobody wanted to believe that it was myself.",
        "Czar Nicolas was a big photography fan as well.",
        "At 7:32 my first thought was \"There is no way he is 14, he looks much older\"\nThen I realised Vsauce just recently made a whole video explaining this exact phenomenon.",
        "I just came here for the answer but ended up with anachronym.  That's deep man",
        "This video gives me like existential vibes. Now I'm curious if I can find my first selfie",
        "man, vsauce is like the nerdy but cool kid that shares a bunch of useless but interesting facts and talks a lil too much",
        "gonna take a delfie real quick",
        "Welcome to the this quarter's (or should I say, this half-year's?) vsauce banger",
        "It's funny, I don't think I really care who took the first selfie, but it's a vsauce, so i know I won't be disappointed",
        "As always, worth the wait! Thank you!",
        "I absolutely love that after all this time you are still uploading and educating. I started watching this channel when I was 13 about 10 years ago now. I can’t wait to see more videos in the future. I will never stop watching ",
        "Not me, it was Johnny.",
        "Some say that the Shroud of Turin ( or should I say The Sacred Selfie of Turin ) is the first third-wave selfie ( or, at least the holiest selfie )!",
        "crazy thought that the human organism simply observed images until deciding to be one. I wonder if the becoming of a sign is what produced the subjective self i.e territorialized reality.",
        "\"Image of the self made by the self\" I love that",
        "selfies",
        "Damn, I knew he was old but Joe Byron taking selfies in 1909?",
        "I used to wonder so much yesrs ago why youtube never suggested anything like vsauce, turns out because there's nothing like it really.",
        "6:26 Joe Byron?",
        "6:25 There's no way that's his actual name.",
        "About time vsauce made a new video lol",
        "The Anastasia story is so sad. She brought a form of happiness that didn't exist before. People had such a hard time appreciating themselves. A hard time looking in the mirror. They still do. But to be able to express your emotion because you are the subject and director in your story. It's just so special.",
        "A selfie of a person’s own self should be called a “sselfie”",
        "Good to see you back, Michael. Surprised you didn't bring up that \"Noah took a picture every day for 6 years\" video that got really popular 15 years ago. It nicely encapsulates the idea of Visual Self Documentary.",
        "Why do they keep changing this video's name/thumbanail?",
        "woah woah woah... New Vsauce Michael?!",
        "The self-portrait of those men in suits were marvelous tho",
        "New vsauce video!\n\nClick",
        "As an Indian I can assure that, Dhinchak Pooja and her hit single \"Selfie maine leli aaj\" Is the actual reason for the  major wave of selfies in the Indian subcontinent",
        "Özçekim.",
        "michael really missed the chance to say 'Delfie'",
        "What does this say about people like myself who cringe at the thought of taking a selfie?",
        "not only did hbomberguy upload and defunctland but vsauce too ? this is a TREAT",
        "PЯӨMӨƧM ",
        "Tbh I could imagine the fifth-wave selfie being something like us taking a full 360° picture of ourselves",
        "I'd be thrilled to see what the metrics were from the original posting of the video, and after you changed the thumbnail. I can imagine it works changing the thumbnail after a few days, but to what degree?",
        "12:49 coolest stuff",
        "bruh\n \nthis guy keeps changing the title",
        "bro made history by pooping",
        "How Michael is able to take a silly, seemingly random topic such as \"Who took the first selfie?\" and turn it into a 25 minute, excellent, thought-provoking social commentary is so wonderfully inspiring. I've always loved how VSauce videos take so many tangents that are all related to each other yet make a very entertaining and informative video. Michael, you're a genius.",
        "What the point of changing thumbnails over and over again I always wandered",
        "It’s crazy to think I grew up watching vsauce, and now I’m graduating today! thank you Michael for always keeping me entertained! good timing for a new video haha :)",
        "Gotta say, used to be a selfie hater. Still don't take any myself. That said, you have successfully brought me around on their use and advantages. That is some super power you continue to have. Any other unfairly unpopular things you'd like to cover? Always enjoy having my perspective expanded and you do a great job.",
        "Idk",
        "Hey! B-Sauce! Bichael here.",
        "Vsauce just admitted to an actual crime on youtube.",
        "Anatasia's selfies are so interesting to look at, because they really do look exactly like something that would be taken today. People don't change, it's the world that does, and we may adapt with it, but deep down we're all still the same. It's an oddly comforting thought.",
        "And now millions of young girls help keep vanity alive and thriving with Instagram selfies.",
        "\"proto Instagram\"",
        "If only he knew it was I, who took the first photo selfie…",
        "Hello. Have you really played game \"Super Mechs\"?",
        "Michael:\n“I think you die at least three times, [one of which being] when your name is spoken for the last time.”\n\nWhy did this man just make me pause the video and question my philosophical beliefs in a video about the first selfie?",
        "It needs to be said that the character \"Selphie\" from Final Fantasy VIII(released 9/9/99 in the US, 8 months earlier in Japan) took selfies in the game, and would upload them to the network in the academy at the start of the game. Nathan Hope might have played it, and that could be where he said he heard it before, and where the term originated from. The game sold around 8 million units on PlayStation 1.",
        "Selfies are incredibly cringe...5th wave will be AI generated selfies of people?",
        "JOE BYRON?",
        "I don't care for the definition. Those are important. Is a leaf that grew next to a similar one a selfie, and which one is it a selfie of? A selfie would be more like \"a usually artistic reflection or personified recording created by an organism for the purpose of later observation or collecting of that organism or others\".",
        "I love getting stoned watching this shit. Its so trippy love ya vsauce",
        "1:15 - We now have a clip of Michael saying \"-ussy\", and yet I have yet to see any memes using that.",
        "Hey vsauce, 2023 here.",
        "7:12 Oh what a nice young lady, I wonder what happened to her. Wait...",
        "Vsauce is that guy that comes ones or twice a year, but still makes us watch his videos with pleasure.",
        "Selfies are 4th person perspective photographs.",
        "13:45\neerie music starts to play\n“Something happened in Japan”\nUH OH",
        "i see michael found the password to the main channel",
        "Michael Stevens is a modern day philosopher.",
        "Still get just as excited to watch vsauce as I was over a decade ago when it was just funny photos and cool nerdy gagets in short form videos! Glad youre still releasing things!",
        "Always nice to see he's still alive and thinking about weirdly interesting things.",
        "To see a mythical and mysterious vsauce upload within the first hour feels special",
        "16:48\nMichael, it do go down!!",
        "ahhh... Old school Vsauce videos... feels good... they don't make a lot of those nowadays, it's a shame XD :P",
        "Missed you Michael!",
        "The real question is, if he is saying \"michael here\" that means he is talking to Vsauce... So who is Vsauce...?",
        "Nice",
        "Is a single celled organism dividing a selfie?",
        "Can’t wait for those fifth wave selfies",
        "Hmm. Big chungus.",
        "Seems like the video cut prematurely, I was hoping he'd address that Belfie never caught on. Come on Vsauce don't get lazy on me!",
        "I am always amazed at the content uploaded by Michael for all of us Vsauce.",
        "The most normal Vauce vid.",
        "This video is changing every day.... the title and the screenshot are in constant flux",
        "goated",
        "Ahh I miss regular Vsauce uploads, please please pleeeeaasseee feed us more of your greymatter thought processes on anything! PS...I have NEVER heard the word Belfie before now!",
        "I can not describe how much i love your content. Keep doing what you do best, Michael.",
        "delfi",
        "Why are vsauce videos always scary to watch home alone at night?",
        "He's back! WOO!",
        "6:57 ️",
        "00:23:37 that is exactly what i thought that you were going to say.",
        "Joseph Byron is my great great grandfather! Fascinating to see my family involved in photography history. My folks take great pride in that photo Joseph took.",
        "thanks for changing the thumbnail back :)",
        "I love that Michael always uses the same couple of songs in his videos. There's something nostalgic about it",
        "This reminds me of the earlier vsauce videos, I really love that the original style videos are back now that mind field has run it's course. Mind field was really spectacular too however.",
        "Michael, the curiosity is all fun and games until I had to pull out the credit card which I don't have. Either add Paypal so I can get it or stahp teasing me with awesome stuff that I can't have.",
        "The doom and gloom music following the \"felfie-question\" perfectly encapsulates the psyche of post-ayahuasca Michael",
        "I'm just grateful that Michael is one of the few Youtubers who never thought he had outgrown his original format and style and that I can still enjoy the content and quality as I did 10 years ago. Hail to Vsauce, Veritasium, Captain disillusion, Steve Mould and other Youtube giants.",
        "Vsauce is still one of the greatest YouTubers ever,the only one that can ask a question and the answer is an absolute outstanding history lesson. thank you Michael.",
        " We are blessed to have Michael here with us through all these years! Dang, time is flying. ",
        "also, gpoy was a thing \"gratuitous pictures of yourself\" but it was a dumb acronym that didn't catch on.",
        "As an enabler and mover in my son's existence, and his continued upbringing. Am I \"creating\" for myself, an image of myself in my son.",
        "I appreciate your research. I've learned so much from this video. Having researched topics important to me, I can relate to the effort and time this video took you to produce. Good job. Thank you.",
        "How many people have died taking selfies?",
        "Vsauce is the best educational/informational YouTuber. A combo of philosophy and history. There’s sooo many new historical YouTubers now that try and fail at this. It’s especially cringey when you see a teen or early 20s kid trying to inject his philosophy into a documentary style video, it’s always so forced and bad.",
        "It's always a pleasure to see new video's from Vsauce!",
        "4:25 look at the search bar",
        "I miss this so much, please, more insightful videos!",
        "if paris hilton is not mentioned in this vid imma be mad",
        "Hey vsauce how do I cook and egg?",
        "I never take selfies cause I find it weird to have photos of me on my phone but watching this makes me respect the whole concept more XD",
        "I wanna see if the word distribution of this video is zipfian",
        "Crazy to look back at myself going from a teenager watching these vids as they came out weekly, having them be part of my routine. To now in my late 20s getting a rush of nostalgia from hearing the vsauce jingle play. Thank you for being part of my life for the last 13 years Micheal ️",
        "Thank you for all your content Michael, very enthralling.",
        "Michael just wanted to brag abt his selfie",
        "man i had missed you, please upload videos regularly",
        "I wanted to take a felfie but took a belfie because I'm selfy",
        "i fucking miss you man!",
        "7:06 - that is a beautiful human. look at his eyes, nose, moustache, beard? That it a beautiful man.",
        "I think Michael is (if not the best) one of the best explainers in the world",
        "2:07 This statement becomes more powerful when you realize that SOMEWHERE on this planet must exist a preserved image of a human's torso who accidentally fell over in the mud while walking with his family.\nIt is clear to me now people, we have a mission as man kind, find not just ancient petrified footprints but the entire or partial outline of a man/woman's torso next to it. It has to exist. Search.",
        "Michael is truly one of a kind. Thank you for still making this content",
        "Y'all better brace yourselves for 5th wave selfies",
        "he really took an illegal selfie of himself and publicly admitted it",
        "If the limited edition box was sold out why did you wait so long to tell me?!?!?! Loljk great video as always.",
        "8:22 Micheal you cant just say that like that!",
        "I love it, that he stays to jake chudnows music - „shona“ is such a great song!!",
        "According to his definition feet pics are selfies. \n\nSend me a selfie, Michael.",
        "What a good content creator. One of the best ever.",
        "Next video: the first femboy",
        "995K views in 2 days!!now that's what you call 'Nerdom'",
        "I believe that the fifth generation of “selfies” is going to come directly trough our eyes.",
        "It was a date date, Michael. It's time the people knew about us.",
        "Ahh I am 4 days late for the biannual VSauce seminar",
        "As a fellow old OG youtuber, I’m glad you got to go to the white house and meet the best president ever ",
        "It's the annual Vsauce treat!",
        "Technically this video has around 35,000 selfies if you count each frame Michael's face is in. I guess that means the first person to record themselves was secretly the first record holder for most number of selfies taken",
        "I first learnt about giving a name to this sort of photography when I started learning Korean over a decade ago. They're called 셀카 (sel-ka) in Korean, a shortening of \"self-camera\". For about a year or so, this was the only name I had for them. Until suddenly \"selfie\" appeared in English and was absolutely everywhere. I have never liked the term \"selfie\" but I think some of that has to do with the fact that I learnt 셀카 first so it's what I think of first. ",
        "Oh Michael how I've missed you lol",
        "19:57 now I know what to say when people claim the earliest furries were ancient Egyptians lol\nThanks!",
        "Idk how he does it, but its been forever since the golden age of vsauce videos and these still have the same energy and style",
        "I love how Michael still uses Chudnow's music, the 145 Poodles at 5:01 is to me THE Vsauce-music. Makes it feel so nostalgic ",
        "Wasn't Xerox the first widely accepted medium for the \"Belfie\"?",
        "this video is a selfie",
        "V sauce is the most highly respected channel on YouTube",
        "Great Title.",
        "11:34 I wasn’t prepared for that Michael…",
        "I always thought that the guy at 3:16 was Tobuscus if he time travelled",
        "This is the Vsauce I missed, that I've been craving for years: Beautifully diving into a topic no one has ever thought about, but doing it in a way that makes us all incredibly interested in it. Keep it up Michael, we love you!",
        "10:22 and a monke",
        "this video brought tears to my eyes because of how profound the idea of the evolution of self portraits into selfies is despite being such a mundane thing. I don't know why but I get emotional over learning to look at things in a whole new way. I remember how I always had just memorized that pi is 3.14 etc but I never conceptualized what it really meant, I just sort of knew it as something used in geometry involving circles and got by with just plugging in the number in equations but then I started watching match videos on youtube and getting more interested in math stuff and then feeling such a joy in understanding how pi is the ratio of the diameter to the circumference, like I had heard that phrased that way before but never really conceptualized what it meant, that a circle with a diameter of 1 will have a circumference of pi, that if you take that circle and lay it out flat the line you would get would be 3.14 units of that 1 unit diameter circle, and when I finally really grasped that for the first time I was just amazed and wanted to share it with everyone else cause it felt so astounding of a revelation to me at the time. And looking at selfies in this whole different way has also brought me to that feeling of revelation, granted maybe not as much but still. It's always just so amazing to see something so simple taken to such detail and to come out of it able to see it in a new light.",
        "Two videos in less than half a year? What a blessing!",
        "Vsauce is the only channel that I also really watch what he is selling or sponsoring . and agree with it ",
        "I love the art of photography. Selfie is a disease in the body of this art.",
        "Heartwarming to see the og in traditional form.",
        "This video changed the name and thumbnail like 4 times so far lmao",
        "9:54 the first case of \"influencers in the wild\"",
        "Oh yes. The Pisa pushers. They think they're so unique. I can't stand them.",
        "i am impressed by all the research you did here! great video",
        "I appreciate this! I don't think selfies are as cringe now inherently!\n\nI'll leave it up to context now",
        "absolutely love these \"historic\" selfies \nthey make history feel more alive, makes it more believable that those times actually happend",
        " so good",
        "I always think about how philosphers from the past would react to Michael. Our modern philosopher",
        "Vsauce may not have been the first one to take a selfie, but he is the first one to make such an in-depth analytical video about the history of selfies.",
        "“Made in the image of God, that’s a selfie” — Jay Z",
        "I have a selfie of my Grandfather taken in the 1940's that is quite often mistaken for me. My grandfather looked quite a lot like I do.",
        "Michael, WHERE HAVE YOU BEEN?",
        "Bro keeps changing the thumbnail",
        "I think what made 2006 special, was that this was in a time that digital cameras were not only highly accessible, but also more portable than before. As digital cameras succeeded film cameras, people could take more photos without wasting film, delete instantly to recover space, and view them after taking to check how it developed.",
        "15:27 \"people love looking at themselves\"... yeah not all of us",
        "It's cool how you can simultaneously prolong the onset of your second death by having a picture taken of you holding a sign saying \"My name is (name)\" and hoping someone might read it outloud when they see the picture after your first death.",
        "The legend is back!!!!!",
        "Hiromix seems to have been pioneering the lewd at the same time as the selfie",
        "isss Vsauceeee",
        "Its quite strange listening to michael talk about jut one topic for a whole video. Usually the topics are all over the place",
        "I know I won't score any points for this, but 16:50 was taken near New Elvet bridge in Durham. Why does it feel so weird knowing Michael's been somewhere I used to walk past almost daily? Feels almost ethereal lol",
        "23:37",
        "it was me. i did.",
        "vsauce music makes me feel nostalgic now",
        "Hah!  Right when you mentioned it was an Australian who coined the term \"Selfie\" I thought to myself: \"yep, checks out.  They love that style of contraction.\"  Then you went on to explain the same thing.  Love it!",
        "Can I buy some of your spit in a small tupperware container?",
        "what is it about old photographs that is so god damn horrifying",
        "whats the story behind the background music?",
        "19:56 anachronism?",
        "i did",
        "We truly live in a society",
        "The random \"ussy\" caught me off guard ",
        "Late GenXer here, comparing social and cultural developments from when I was a teen and they were historical in nature to those that teens of today use, that I lived though the birth and development of, gives real mind bending perspective to what my parents went through raising children.  Not sure if it made sense, but it's fascinating.",
        "My photo printer is a Canon Selphy. I wonder if that brand came before or after \"selfie\" became a word. Ironically out of the thousands of photos I have printed on it, NONE have been selfies!. I fact I only have ONE selfie and it predates the term by decades. It's one I took with a Kodak 100 Instamatic (126 film) in around 1976 (It was an old camera even then!). The photo is a \"classic\" one arm outstretched seflie shot that could have been taken today, LOL.",
        "fifth wave would be to feel the same as the person felt when the selfie was made",
        "I've been watching him ever since he started. He still blows my mind with how much is out there to be understood or talked about. Just how much is out there is enough to make you crazy. But with someone like him explaining some of it makes everything worth listening to.",
        "What have we done to finally deserve a VSauce upload. I'll gladly feast my eyes, ears and brain on any content you provide tho. Keep em coming",
        "Why does the title keep changing?",
        "I loved the light hearted tone of this one. Thank you so much for all of your videos!",
        "This dude is like a relic of YouTube’s past and yet he still hits nothing but grand slams, like the world he entered in has vanished and yet he remains eternal, god bless Michael",
        "keep up the vids bro, I  really enjoy them",
        "In a way a selfie is the middleground of photography; a photo taken of you by someone else is third person, a photo taken by you of someone else is first person, while a selfie is second person perspective which is our least familiar and why every one feel so weird.",
        "Michael, thank you for continuing to provide us with engaging and thought-provoking videos. I always enjoy them!",
        "LOVE",
        "Was really hopin you were going to talk about Baurdillard, especially when you began discussing images in the last third! \nThis is defo one of the more light-hearted ones you've made! I loved your video about time!",
        "Thank you so much for including Vivian Meijer! I did a final art project on her. Her life was so interesting. She was a live in nanny. She would take the kids on walks and take these photos then.",
        "Miss your videos  only 4 in the last year. Where did you go?",
        "omfg this music is so nostalgic and makes me feel so happy and warm inside, its been a while since ive watched a vsauce video",
        "Generally, things in ordinal categories would have a higher stage;112th [object], 113th [object], etc. What would it take for a \"fifth-wave\" selfie to exist? Does it have to add to the current criteria of the \"fourth-wave\" selfie? What type of device or method would it take to be considered a \"fifth-wave\" selfie?",
        "what happend to the title",
        "“If a selfie of a butt is called a ‘Belfie’, shouldn’t a selfie of your face be called a ‘Felfie’?”\n\n- An important question to society according to Michael Stevens",
        "He is the only guy who can can rarely post a video and get the millions of views he does. Hats off to you sir",
        "Honestly, the question \"What even is a selfie?\" is just not that deep. It's all about the intention of the one who's taking a picture. If it was intended to be a picture of yourself, and taken with any kind of photo camera, it is a selfie :)",
        "What about self-paintings? Michelangelo painted a realistic portrait of himself in the 1400's through a tin mirror I believe. j/k, anyways, I wish people like Mozart, Michelangelo, DaVinci, Martin Luther King, King Tut, Ghangaskan, Sitting Bull,  and even people as early as Einstein and Tupac-Changes. I really think that every single one would be Absolutely Amazed yet disappointed for a reason we could never understand.",
        "Words cannot describe how happy I feel to watch a new vsauce video!",
        "1:11 WORLD'S FIRST -USSY CONFIRMED??",
        "\"and yes, even... doggo\" - thank you, Aussies, Internet appreciates your efforts",
        "I can't get over how hard that thumbnail example is! He looks incredible!",
        "“Fore example”",
        "Phenomenal video. I love how you're able to wrap science/technological history, art history and human history into a well told story. ",
        "I love how the sight of techno strikes fear into anyone who sees him, Rest In Peace Alex",
        "It was super interesting to hear about the \"selfie pose\", because my dad and family have messed with that idea for years, consistently doing our own quite different pose of terror at taking selfies.",
        "Me, i did. Next video.",
        "Real ones know Corys humor is high tier also rest in peace Stanley",
        "Naser al-Din Shah Qajar of Persia took many personal selfies of himself and his wives",
        "There's something just unbelievably amazing about the apollo photo and the fact that you're looking at earth from the moon",
        "Oh man, in hindsight it's SO obvious the term selfie was coined by an Aussie",
        "Seeing the selfies Anastasia took was so surreal. Hard to believe they were taken over a century ago. \n\nMakes me wonder what pictures we might’ve gotten if selfies like today were a regular part of the 19th and 20th century.",
        "Guys! I just did a delfie!!",
        "Bro imagine it took 15 minutes to take a photo",
        "I love you.",
        "My favorite part of the video was the part where he didnt go off track and talk about how the french revolution ate beans.",
        "I remember back in the mid-2000s when there were cameraphone ads on the radio and people thought they were just unnecessary. Unrelated to that but still related to the video, pretty much the only time I ever took pictures of myself until more recently was if the cat was on me and I wanted to show exactly where the cat was, usually when she was sleeping; didn't really help that I thought even looking in the mirror was vain because it's called a vanity mirror; still made videos like short films including myself, though, which doesn't make much sense. The fact that it only became extremely popular as a word in 2013 explains why the Lumia 520 and a few others lacked a front-facing camera, even if it could've included a really low-resolution one, like say VGA.",
        "An image of the self made by the self... by that definition, God made the first selfie.",
        "I can now admit I was ignorant to technology back in the day.",
        "I love you",
        "07:30 That's Kylo Ren",
        "Let’s all thank Jake Chudnow for making much of the music that helps bring Michaels videos to life ",
        "Ffs get off the podium america..\nRingo Starr was the very first",
        "Why change the thumbnail",
        "i love the half-life soundtrack music that plays in vsauce videos",
        "Did you meet Big Mike too (Michelle Obama)?",
        "\"Just me looking at you\"",
        "One of the only people I know that could spend 25mins captivating us on selfies. Very impressive!",
        "Ah yes good to see another video from Micheal",
        "Let me just further my earlier comment.  I know you need to market your wares but there is no need to be cruel and manipulative in the worst way.\n\nYou created a FOMO (fear of missing out) that already happened:",
        "23:10 subtitles are Reddit material",
        "This is the most focused video he's ever made. I kept expecting him to use this as a spring board for another topic.",
        "vsauce sticking to his youtube roots even in 2022. respect",
        "what a quirky little video",
        "20:27 the first “Boyband” Had me rolling on the floor ",
        "6:26 Joe Biren???",
        "So, according to the anthropic principle, humans are basically selfie cameras.",
        "22:38 In October of 2013, Kim Kardasian posted this image\n\nAh yes, I remember well",
        "0:30 I believe, in the same way, Michael will admit doing human experiements in his basement.",
        "I had a vape pen on an airplane before it was illegal.",
        "Did he stoped minefield?",
        "only michael can make me feel emotional by talking about selfies.",
        "That’s a vsauce video",
        "Can't be the only one who used friendster back in the day.",
        "Paris Hilton. She invented the selfie.",
        "We've missed you man, missed you so much. Thanks for being around sometimes.",
        "01:15 it's only a matter of time before this bit is clipped",
        "7:33 nah that's just Adam driver",
        "Ok but who will take the LAST selfie",
        "what is the point?",
        "The internet feels different now in so many ways from games, social media, browsing, but Vsauce still has the familiar glow from 10 years ago.",
        "did i hear ussy?",
        "These classic style Vsauce videos will always be loved. Thanks Michael!",
        "im always impressed by sauce the fact Ive been watching since when YouTube looked so different and i was so young with horrible Internet and bad old tech oh the old internet",
        "Stunningly to-form",
        "90% of his hair is on 40% of his head",
        "9:20 thats Dr Who..",
        "YouTube brought video replies. Cool but a guy with a nice beard is under the description",
        "I've seen the title and thumbnail change 5 times in 7 days so now I have to watch it",
        "with definitions this loose you might as well say that because we are always radiating infrared radiation weather we're alive or dead, you could say that you are projecting a selfie continuously from conception till the heat death of the universe.",
        "2:47 they always said that cameras add 10 pounds to one's nose",
        "@20:54 “Are humans a selfie?” Oh Michael, you have no idea how long I’ve missed your videos. I love you so much.",
        "Micheal why'd you change the title from \"who took the first selfie? \" To: \"\"",
        "wait i thought this was an old vid",
        "I wonder if someone could consider the 5th Wave the potential of individuals using artificial intelligence to create images of themselves that look like selfies in a variety of contexts. \n\nCould I take a picture from my childhood and use AI to have a selfie made of myself in an inauthentic past? We already use filters and everything for selfies.",
        "Technically the reverse selfie contains only 50% of everyone but yourself since half of everyone will be on the side of the earth facing away from you.",
        "Ok so you changed the video title",
        "Only og fan would know the thumbnail was changed\n\nEdit: Welp he changed it back, nvm",
        "\"It's just me... looking at you.\" Creepy Michael.",
        "Man that Anastasia one really hit me. Just such an interesting look into the past that shows you she was really just a kid.",
        "5:32 is no one gonna talk how hard that pic goes?",
        "Make more content please",
        "Only 4 months, bravo vsauce",
        "Fun fact, actually (here) in Brazil people says \"self\" without the \"ie\" but write with the \"ie\"",
        "Kardashian's butt even on Vsauce",
        "what about Fredrik Carl Mülert Størmer? he did a selfie holding the camera earlier than 1909 i think",
        "This is still the best youtube channel ever",
        "I love how so many things are older than we realize, from unexpected sources. He also made this video easier to follow, very cool! Nice to know Australia gave us so many slang terms.\n\nA bit of history repeating itself, similar human and other interactions in the universe echoing forward in some way, however modified or different per instance or variation. Reminds me of a great antidote against existential dread that I saw recently: \"we're a pinnacle of 14 billion years of evolution, the waking universe looking back at itself.\"",
        "20:58 there's smthn legendary about this screenshot.",
        "Vsauce is like santa, comes once a year but it's awesome",
        "I need one of those star lamps. I demand yu release it stand alone",
        "Vsauce videos are a rollercoaster of emotions every time, and I dig it",
        "Michael is the only person that can take a boring subject like selfies and make a 25 Minute video that is interesting the whole way through",
        "All vsauce videos should start with welcome to the matrix. These remain soo long but we still get engrossed and time passes by like nothing.",
        "I just told my 10yo daughter “you should watch this dude’s channel”—her reply: “what kind of name is Vuhh-Sauce???” ️",
        "It's heartwarming that squatting in photos is at least as old as the stick",
        "he changed the thumbnail this is so epic",
        "So, Anastasia Nikolaevna was the first instagrammer.",
        "I feel like I'm in middle school again watching a new Vsauce video (attending college now). The music, the presentation, and even Michael's appearance haven't changed at all. Really brings me back",
        "Someone got to open a startup company \nAnd call it selfi-sh\nTo print a photo and your self information on a non compostable material which will stand the external forces of nature so you won’t be forgotten *ever*.",
        "For a 5th wave selfie would you have the ability to physically see someone else's self thought? And would a 6th wave selfie to be able to actually experience a self thought almost to where it's real life to dream state??",
        "It’s always a good day when VSauce uploads his annual video",
        "The longevity is unreal. VSauce might never end",
        "It is you, by you.",
        "Can we take a moment to appreciate Micheal's great looking beard",
        "Vsauce I have a question,  what do u do to never age? I've been watching you since I was a kid now I got a beard and I'm like: VSAUCE IS STILL ALIVE?!",
        "Let’s go Vsauce video",
        "This feels like an old school Vsauce video, I love it very much",
        "You know Micheal you just got me curious on this",
        "I'd say the first person to take a selfie would the be very first person to faceplant into some clay or something and was like \"woah\", but this works too.",
        "00:55 that is some bs. Head and shoulders wasn’t even invented 3000 years ago.",
        "you know you like a youtuber when you enjoy watching his sponsered content.",
        "0:40 @SecretService",
        "1:14 the \"ussy\" is real!",
        "The hardest drop in youtube history 0:47",
        "Who else here remembers when Vsauce was just Michael showing us random stuff we could buy online way back in the day!",
        "The fact that the princess of Russia sent random selfies of herself to friends is very comforting to me. Teenage girls haven't changed for a hundred years.",
        "8:05 Needs some more lead-up or something. I feel traumatized. What a horrible turn of events.",
        "14:09 liminal space material",
        "7:46 wow, that got dark fast",
        "Only you could of made this happen the way it did.",
        "I LOVE this channel!",
        "When the world needed him the most, he: 23:20",
        "damn the thumbnail got updated",
        "William Henry Perkin is the most manly 14 year old ive ever seen",
        "Why did I not even consider that Australia came up with \"selfie\"? haha",
        "Where is my Summer Curiousity Box? My order is 87311 partially fulfilled. You sent bonus box but not the Summer Box.",
        "it's been 10 years and these type of videos still make u feel the same. michael will never make it easy on us",
        "Tjis is the worst vsauce video by far. Huge fan, true story. :(",
        "I love vsauce",
        "Victoria Chase from  Life Is Strange loves this video.",
        "A video from Vsauce is like a gift from the gods.",
        "i was not ready for that conclusion",
        "Literally the first time I've heard anyone say \"usie\". THANKS, OBAMA!",
        "Michael is the only man who can tell nonsense from scientific point of view for half an hour, confusing people more and more with every minute and yet he always makes sense",
        "okay okay Imma watch the video please stop changing the thumbnail and title pls",
        "NEW VSAUCE VIDEO? IS THIS A DREAM?",
        "I can only imagine how deep Michael went into the mathematics rabbit hole but it seems somehow he found his way out",
        "Been dying to have a video from Vsauce... It utterly is a real blessing seeing you Michael.",
        "I think this is the only Vsauce video that ends on a similar note to the initial point",
        "6:26 JOE BYRON",
        "How many times is Michael gonna change the title and thumbnail lol",
        "Vsauce delivers amazing content once again!",
        "I thought it was derrived from word selfshot",
        "Original format, original music....Man, brings back memories. Thank you!",
        "Belfie is the most 2013 word ever.",
        "be real is the 5th wave selfie",
        "Only this guy can make the concept of selfies sound profound",
        "A genuine genius of over-thinking.",
        "I hope he understands how much we appreciate the consistent use of Jake Chudnow music. I hope it never goes away",
        "since were all just admitting to crimes.\nit was me i killed him",
        "i dont need sleep, i need answers.",
        "Good to still hear you use ‘Shona’ ️",
        "I usually ignore these kinds of topics, but Micheal surely made it very interesting.",
        "19:06 Yeah you got me here",
        "I love how Michael still uses Chudnow's music, the 145 Poodles at 5:01 is to me THE Vsauce-music. Makes it feel so nostalgic",
        "Why change the thumbnail?!️",
        "Bro did he say USSIE or USSY I’m just wondering.",
        "OK, now what atrocious thing did Vsauce do on 27th of August 2016?",
        "nooooooooo this was a video for sam onella xD",
        "The selfie pose will be one of the most defining aspects of our era. For the majority of the future it will done by tiny drones taking the picture. No hands stretched out. We are experiencing history right now folks.",
        "Guys did he change the title and/or thumbnail of the video? Also, is this a reupload? It seems to me like this video is older than just 4 days (as of november 22. 2022.). Guys please tell me I'm not crazy, I begin to question reality.",
        " Brilliant upload Michael ️🇦🇺"
    ],
    "comments_disabled": false
}