{
    "video_id": "MWfuDeO9thk",
    "comments": [
        "No wonder mercedes f1 removed ftx from their sponsorship deal",
        "Wasn't there a case where two hackers stole Bitcoins, one of them a rapper calling herself something like Reptile of Wallstreet and the government then kept the funds to themselves as they found themselves unable to allocate them to the original owners?",
        "15:40 at least they're dating within their league",
        "Seeing Coffee going from 2020 to 2022 is just so inspiring",
        "I literally read a comment on your last video that it could very well be a fake offer basically. And they could just turn around and say it was too risky or etc lol. And boom! That person saw into the future.",
        "\"Welcome to the future! It sucks here!\".  Top quite of 2020s.",
        "I only just started watching this guy but the fact that he has every reason to be smug right now and chooses to just present the facts honestly makes me like him.",
        "thank you coffee ️",
        "Look into Alameda's NFT investments. Yoots would be a great place to start.",
        "That million dollar studio making your left ear glow in a sort of disjointed, ethereal manner ",
        "You’re my favourite YouTuber now, keep up the awesome work chief",
        "“Welcome to the future. And it sucks here” made me giggle",
        "Nope, you just think you did.",
        "So they literally were a crypto-federal reserve. And since there’s no regulation, they could do whatever they wanted",
        "So here’s the real question: is there a fast buck to be made by shorting all cryptocurrencies on different trading platforms whenever one of these scams is found out and hits the media? I feel like that’s a more sure bet than betting on an initial coin offerings or the crazy returns promised by these poorly run exchanges.",
        "Sounds like my ex wife. I thought I could trust justice, but they work too slow. If you have a lot of crap that might come out, put on some more so no one understands. Such people believe they are smart, it’s criminal",
        "Dw that money is safe with me",
        "They had stolen the money.",
        "Coffiezilla is addiction ",
        "Fantastic work, this is more detailed than all of the other coverage I've seen YouTube or mainstream.",
        "Next video about Garry Gensler , and CArolines father ... the rabbit hole goes deep ! They will accuse crypto of needing regulation when sam did what a banker would do , nothing decentralised at all !",
        "Several  years ago I purchased $200.00  in bitcoin. I was able to locate the very long string of numbers and letters but couldn't figure out how to purchase the item I wanted. There wasn't anyone to ask . They had my money and no one could tell me how to gat it back or use it. I never got my money back and ever since I have been hoping that it was a bubble and that all the people who invested in Crypto would go broke. Looks like finally these \"geniuses\" are getting what they deserve. I hope they end up broke.",
        "how are people still putting their money into crypto LOL",
        "If you trusted your money to a guy who looks like he has a room full of Pokemon collectibles, you might be making a poor financial decision.",
        "Your take and critical thinking is on point. This is a great work!",
        "Bottom line... investing in an unregulated currency was always a dumb idea.",
        "\"-Such that no one knew...\" \ntrynna sound smart af while explaining how the 2008 crisis was his inspiration",
        "no such thing as worse or sad or lose or experienced or mistake or not, cpeuxuax, outx, can outx any nmw and any s perfect, mx or not etc doesn matter",
        "You are like our detective from the 70s who just wouldn't let shit go until the truth is told, incorruptible, and needs some sleep.  Get some sleep brother, we need you later.  Bless and love ",
        "I like this kind of channel. It will help ordinary folks discover fraudulent activities. Instead of listening to those so called \"financial gurus\" who promoted FTX, I think you need to subscribe to this kind of channel. As the saying goes, prevention is better than cure.",
        "\"I didn´t know that is illegal\" ... \"Ohh btw can you program this backdoor so we can move finances without alerting anyone\"\n\nSo as to the point he didn't know they were leveraged, I call that BS also. You know you're leveraged because someone is charging u money to cover.",
        "Why do people do crypto?",
        "Even if Alameda won with their casino bets, it was theft, isn't it?",
        "Being evil is super beta male energy",
        "All of the thieves involved have one thing in common but i just can't put my NOSE on it. Hmmmm... Kanye was right btw.",
        "Love this coverage",
        "It is decentralized, that's the hook. No regulation let it crash and burn.",
        "Funny how he said he can donate 1 Billion to Democtratic party and now after mid terms 1 Billion is missing Hahahahaha",
        "Be your own bankrupted bank.  Difference is, you do not get a bailout from the government.  Been blasted many, many times when suggesting long ago that crypto should take a lesson from regulated markets, even suggest settlement periods.  In regulated markets, it is against the law to use user's funds as company assets (see. MF Global, et. al.).  Cue the crypto bros screaming.",
        "everytime a coffezilla video shows up, i pick my popcorn, because every episode feels like a good movie. completely hypnotic with so much high quality information.",
        "If you are a generous billionaire, I think you would keep that to yourself",
        "The minerals on SomoreBanksterFraud lecturing congress on the superiority of his exchange......",
        "FIGUREHEAD. SBF is likely a figurehead",
        "The Guv-ments plan just fell apart",
        "Yea, she said that, but AFTER millions went to her Boss-Man and all of his minions!!",
        "Gryla's words are even more savage when you realize that Angrboda is mentioned all of once in the Poetic Edda.",
        "I trusted FTX more then the vegetables in the white house",
        "FTX basically went leveraged long bitcoin",
        "This is Blackrock throwing their puppet under the bus to get that juicy crypto dip",
        "oi vey",
        "There’s a very simple explanation:\n\n‘Fools and their money are soon parted.’",
        "The most terrifying take away from all of this is that banks don't have your money either. Not even the 10% that used to be the standard. How bad will the inevitable equities crash need to be before the big boys doing the same shit get exposed and this happens in traditional markets. Over or under, 36 months. I'm going under.",
        "They kept everything in house. All the makings of a billionaire 'hills have eyes scenerio'.",
        "The clip of him shitting on the investment banks from the 2008 crash was fuckin mind blowingly hypocritical and deceptive.",
        "\"I've never seen a CEO take accountability before.\" Wait, did this guy not remember when the man, the myth, the legend, Satoru Iwata cut his own pay in half to save his employees when he admitted his Wii U idea was a failure and took responsibility to prevent any layoffs????",
        "Is SBF's mom who they say she is?",
        "How many other crypto exchanges offering the same 7-15% of return on the deposit ? How many of them will have the same/similar issue?",
        "Bankman-Fried has to be the best name at the heart of any financial scandal I've seen!",
        "It's not hanging in the balance. It's gone",
        "NO, YOU DON'T UNDERSTAND, IT'S TIME TO BUY NOW",
        "This was the biggest heist in history. Someone’s on a yacht right now partying .",
        "invest in eternal life... ave maria mutual funds... ^^",
        "Absolutely INSANE that he claims he was the only guy who was supposed to monitor the leverage employed by FTX?! Clear governance was non existent. This is going to be a way bigger wipeout and fallout than we think.  once you start using customer funds you are on the wrong side of the law. SBF and Co are going to jail.",
        "Binance is cornering the market",
        "Biden FTX Ukraine, what do they have in common?",
        "Si quieres tener éxito, la mayoría asume la responsabilidad de tus emociones, no echas la culpa a los demás. Además de hacerte sentir más culpable por tus defectos, señalar con el dedo a los demás solo servirá para aumentar tu sentido de responsabilidad personal. Siempre hay un riesgo en cada inversión, pero la gente todavía invierte y tiene éxito. Debes mirar hacia afuera si quieres tener éxito en la vida.",
        "\"robust risk framework \"  what a bullshit artist, get this man to jail.",
        "When the democrats money launder through FTX",
        "You guys realize... the github commits that were mentioned.. Hold on, man. You guys realize... you can view all the changes that were made on his repositories? That is, you can literally view if he did or did not add anything in there that would contribute to any of this. Why in the world are you guys jumping to conclusions on \"this person made a lot of commits\" if you can find this out WITH those commits on a factual basis? MY GOD, WHAT IS WRONG WITH THE WORLD",
        "The real question: How can someone named Bankman be this bad at banking? It is crazy. Is nothing sacred anymore in this world.",
        "Hmm, I wonder how much of the current inflation have been blown up by all the crypto",
        "Alameda went A la Peda",
        "Word on the street is Ukraine took some of the billions given them and invested it back into FTX. Of which then SBF became a Democrat megadonor with",
        "Cryptocurrencies is not cryptocurrency two different things",
        "Me looking at all my money still secure in my bank laughs in dollar bills",
        "Looks like a takedown from Coinbase and Binance",
        "10:50 you are incorrect dude, he just said no one knew how much that was worth and how much risk there was, and then he said that does not happen with ftx. and he is RIGHT, he knew it was worthless and the risk was infinite\nso technically he DID NOT LIE",
        "\"I can't just give you gold...\" \n\nno please, I'll take the gold",
        "RIIIIIIIGHTEOUS",
        "Pump The STock $ZILLA",
        "The government better not bailout these companies.",
        "What are the odds the Binance is in the same boat as FTX? I don't keep up with crypto, was just curious?",
        "Sending my appreciation to the heat of the coffee. It’s been steaming the whole videos. I want that coffee with everything happening, it’s needed.",
        "It seems crypto investors love getting ripped off…",
        "bruh this is literally what happened in the great depression",
        "Next pump and dump is called “paradox” all the youtubers are promoting it like logan paul and ishowspeed",
        "Another  from 🇨🇭",
        "That's insane that the criminal CEO can casually flee to another company while this all is happening. Such allegations (especially while filing bankrupcy) should put the CEO at travel restriction to see if he is found to be guilty of fraud.",
        "How about we talk about Ukraine and the democrats",
        "Must be those darn Russian hackers again... (not)",
        "Amazingly, the number one spokesperson in the country can’t get through a single sentence without referring back to her notes. Affirmative action, makes us look so foolish.",
        "I remember when Bitcoin first came and my opinion was that the same thing will happen to it that happened to the banks. We need to address our relationship with capital rather than the medium of capital.",
        "Hey, I'm just a random guy... I'm just as honest as the next guy... or a federal reserve bound by law with a phone number and address! Lol\n\nThe fact that people made a conscious choice to roll over a substantial amount of their life savings into crypto and random crypto at that... will never be any less hilarious to me than it always has been.",
        "you are a legend dude. excellent work you are doing.",
        "Good vidéo, Hope that next time you will talk about suscipcious on Gary Gensler (SEC), it seems that it's more bigger than we thought.",
        "Not only That his name is bankman but fried bankman? You can't make this stuff up. Matrix script playing out.",
        "immaginary stuff with not real value sure i must be stable everyone that lost money u deserved it",
        "Everything is a game coffee especially in gambling like stocks and crypto. The entire stock and crypto market are games of chance.",
        "Need to bring up the New York Times puff piece where not once did they mention the words \"criminal\" or \"fraud' but just made sure we knew he was getting enough rest while all this is happening.",
        "What a fun story. \"You can't trust the system, man... give your money to this random dude instead. Trust me bro.\"",
        "Anybody want to explain and or expand on how or why there was 5 billion withdrawal on that Sunday ?  It’s significant, no ?",
        "Its so nice seeing krew plays games! More often",
        "If this a Group of AAs is a gang, If it's a group of Italians it's a mafia. But if it's a group of Jews it's a coincidence and you should never question it!",
        "Financial scams are my murder mysteries..",
        "What's so crazy is the connection being shown with SBF, Caroline and Gary Gensler now and how this might be more organized and orchestrated then first shown!!!",
        "this whole situation gave the government a reason to regulate",
        "Coffeezilla is the next generation of investigative journalism",
        "He's so \"generous\" that he likes to give your money away especially to himself. What a nice guy.",
        "The owner of the FTX  He wants to play dumb and act like oh I didn't know what happened to all this kind of stuff but at the end of the day if there's anybody in the world in your company or outside of your company that would know absolutely everything about FTX and what it does and doesn't do it would be user the owner of it CEO. He would go around speaking and tell him people how it works and how it doesn't work that's because you know more about it than anybody so at the end of the day you should be held accountable more than anybody",
        "\"Welcome to the future, it sucks here.\"\nHonestly that would be appropriate no matter the timeline.",
        "Bill Ackman backing up CEO dbags is his common practice, just like he did after the Valeant Pharmaceuticals debacle unfolded.",
        "You forgot to mention how much money he gave to the Democratic Party. There’s more to this than just liquidity issues.",
        "'it got so much worse' is exactly what I want to hear, gimme that sweet juicy content, baby",
        "I'm so glad I realised last year that he is just a rich scammer...",
        "Coffee videos go hard man! REALLY...!!!",
        "Never, never ever trust a fully grown adult who is a Harry Potter fan with your life savings I really wish I didn't have to tell people that but, here we are.",
        "Crazy",
        "With all due respect to Caroline Ellison, it seems obvious the reason Sam BF dated her and made her CEO etc was to have that connection with her Dad, who was the former boss of the current head of the SEC....draw your own conclusions...",
        "No wonder Kanye wants to go Deathcon3",
        "Hrmm, No mention of FTX's partnership with Ukraine's crypto fundraising foundation and the fact that SBF was the second largest donor to the Democratic Campaign which likely secured his impunity in all this? lol",
        "Never forget this: Putin is right and we are wrong. Never forget that.",
        "This is so much more intense than I thought it was, coding a 'back-door' into financial reporting of your own company is the most sus thing I've ever heard anyone at a company do, holy crap",
        "not into finances/crypto or whatever BUT this subject had caught my interest and i jumped into the YT rabbit hole and i have to say out of all the stuff i have watched you have covered this shitstorm better than anyone including multi million dollar international media organisations! like your unbiased factual approach and the way you admit when you don't know something to be 100% factual.",
        "Loving every minute of this - I love how the crypto and NFT markets show exactly what humanity is like to the world.",
        "its hard to believe this scam FTX live as second top cryto, all this time.\n\nthink about it.",
        "Love the studio my guy",
        "The sad reality is the crypto exchanges are going to inevitably be consolidated even more than they already are in order to keep the public trust. While this may help in certain instances ultimately this creates the same exact issue that we are currently facing in modern banking.",
        "A guy from Netflix: \"Let's make a documentary about FTX.\" I think it would be huge.\n\nAnother guy from Netflix: \"But Coffeezilla has covered it so extensively.\"",
        "The news channel to a horrible service by being news channel. These scammers can just watch the news, be aware of what people know, and pull a “oh I know, why don’t we just tell them we got hacked. We can do that ourselves and claim we don’t know the individual that did it”",
        "My Wallet is since 2 Days at zero and i also dont see an history. what does that mean?",
        "100% whatever the guy below me said.",
        "Hope he gets serious jail time . Sick of these A holes getting away with this shit",
        "You are the man. You pointed out SBF ponzi scam 6 months ago. Thanks",
        "SBF/FTX = BitConnect  ",
        "Coinbase safe?",
        "Don’t expect someone to take care of their business if they can’t even take care of themselves.",
        "I think my comment on that big FTX video was \"If he's generous he's not a billionaire\"",
        "What about the Ukraine funds? What the stolen elections..",
        "has anyone thought about this dudes last name? Bankman-Fried sounds like bank man freed did he just make up his last name?",
        "I SEE YOU ️ZILLA!!  Growing by leaps and bounds! Your info and Chanel are on FIRE! Who knew HIGH DEDUCTIVE REASONING SKILLS would WIN OUT after all out here in sheep society… \n\nBRAVO MY MAN",
        "CZ .. the master of Death Blow tweets :D",
        "10:58 I don't like both especially the left one. Totally asenine!",
        "And so ENDS the final Chapter of \"As Crypto Scam Turns\". :)",
        "A dumpster fire of global proportions",
        "To be fair, and in my honest non-qualified opinion. The involvement of the Binance CEO feels like it was a calculated play to smash their largest rival.",
        "Bitcoin only and put it on a hard wallet that is open source like Trezor. Don't keep your Bitcoin on an exchange. Problem solved.",
        "I think SBF should now be \"FSB\" as \"FRIED Sam Bankman\" ",
        "13:20 Does FTX not have an  FP&A  team or employee who would be in charge of this? Does FTX not have a CFO?  What about an executive committee that would understand their current leveraged position & liquidity as well? I find it very hard to believe FTX's CEO's comments, and find it also very distasteful that he is digging himself up in what seems to be another lie. I agree with your sentiment completely, if he would have known their levered position, it would be criminal to continue on as if nothing was wrong!",
        "Crypto \"wE fiGhTiNg zE sUiTs!\"\nalso Crypto \"well, we got your money and its gone now\"",
        "I hate to see some poor fool's wealth evaporate in the blink of an eye but, at the same time, I'm comforted that common sense has, once again, prevailed.",
        "My homeboy just hipped me to your channel. Immediate subscribe.",
        "The dramatised series on this dumpster fire is going to be ",
        "Do Kwon: Welcome to the Club, SBF.",
        "Government regulation is not necessary. Let the market decide which companies fail.",
        "How many users did the $5B in widrawals? Who was the largest?",
        "I have a feeling binance is doing the same think with their bnb token. The funny thing is our own financial system would collapse the same way ftx did if there was a bank run. The amount of leverage that's used by financial institutions is criminal. Its almost happening right now with bonds and it happened in the UK with bonds forcing a government bailout.",
        "The 'hack' is 100% an inside job. Even if their codebase got hacked, the hacker would also need to have access to their Apple & Google accounts in order to push the update in the app stores. I'd imagine only a number of people would have access to those e.g. SBF, CTO and other technical people very high up on the chain",
        "Just a reminder: this will happen to every crypto currency and crypto exchange\nnot today, not tomorrow, but death is certain",
        "Do a story on the YouTubers that pushed all these companies. Like when FTX was crashing and they promoted blockfi",
        "Reef finance would be laughing by now",
        "Might be difficult proving criminal intent in court on this. Also, her said he's sorry so that automatically is a jail-free card, right?\n\nyeah, right",
        "He's sorry though, oh all good.  his bad",
        "Securing a loan against yourself is like plugging an extension power cable into itself and expecting it to generate energy.",
        "Holy crap the steam on the cup isn't real",
        "Fried: \"OK look, I'm gonna make it up to you right now!!!!\"\n(Draws a picture of a bored ape)\n\"I believe this should cover the damage\"",
        "You’re so stylish, such a neat well-rounded product. I hate it.",
        "Nas daily exposed",
        "glad i not ever got into bogus bull like crypto",
        "You omitted the fact he was the dnc's second largest donors with the funds he raised",
        "Crypto can be much better but not with him incharge",
        "damn with this much popcorn I will get so fat  ",
        ">Sam Bankman-Fried",
        "It's not that he stole from the average Joe like you and me it's that he stole from the rich famous and Powerful that there's  comeuppance",
        "ill betcha caroline has the money",
        "So glad I never invested anything in crypto",
        "People not trusting the banks and then giving money to a guy named \"Bankman\" is something else",
        "the funniest thing about the crypto scene is how it's literally just a speedrun of the history of scams and fraud, it's like the tiktok version of last century's economy",
        "Where is the follow up video? Can't find it",
        "It's not a \"hack\", if it was built in from the start. It's a backdoor. There's a livestream of it happening in realtime here on a channel on YT. We all know who it is...Every. Single. Time.",
        "I wonder if her wants that 38 billion he spent on the midterms back.",
        "you need your own netflix series bro",
        "He has to be sick.....",
        "This youtube channel is becoming more and more important.",
        "Bugger me.. dont hold back Coffee!",
        "Aren't these modern t-shirt no-comb crooks so much more environmentally friendly than the garden variety Wall St white-collar crims and RICO gangsters!  Wasting paper and ink printing funny money is a thing of the past, bless them",
        "It´s the same flight of the Nazi Soup!",
        "I did a Science Bowl last year called Prometheus and Sam was the guest keynote speaker. Dude literally showed up in bed high asf lmaoo",
        "I was told his firlfriend was the one running alemeda!",
        "Is the Democrat party going to give all their donation money back?",
        "Please dig into SBF’s and Caroline Ellison’s families and their political ties. \nThey are connected to Gary Gensler.",
        "He was so generous, he gave away his customers money!",
        "FTX and Alameda were hip thrusting each other.",
        "Haha why does the Alameda Research company look like an 8 year old?!",
        "Saddest part is most of those investors invest way more money they can actually afford to lose.. people should really learn to get actual financial advice from a real expert before anything",
        "At times I think SBF believes this is a real-life (video) game. He loss. Now he's waiting, expecting to re-spawn to play again .  The kid has No Clue!",
        "Why hasn't the SEC hired you yet? You are the man Coffeezilla!",
        "Coffee videos go hard man!",
        "Why didn't you mention Joseph Carlson?",
        "It wasn't me",
        "Welcome the next Chairman of the Fed, SBF.",
        "When will u guys learn?\n\"Not your keys, not your crypto!\"",
        "They have non liquid assets though. The headline is misleading. Hopefully those can be sold off and users can recover some funds",
        "damn u did your research",
        "It's not too hard to be generous when it's someone else's money.",
        "And yet people put there life savings in an unregulated market. i have sympathy but this was predictable",
        "Coffee gunna become a live streamer keeping up with the latest calamities from SBF and co ",
        "This was kinda inevitable. The government was going to get its hands on crypto one way or the other",
        "comment",
        "Only Binance will prolly be standing in the long run",
        "Binance is next.",
        "How incestual can it be when Alameda's CEO is SBF girlfriend!",
        "Coffee, our savior from all the crypto and financial influencer(s) madness!",
        "SEND YOUR BALANCE ALWAYS TO A HARDWARE WALLET",
        "You’re an absolute gun coffee! The history you’re preserving through these videos will be taught in schools one day",
        "If you say “you don’t trust banks” and leave your crypto on exchange, then you played yourself.",
        "I saw FTX is a sponsor of the Gumball 3000. It is a supercar rally being held in the middle east this year.  I wonder how much they put in to be decals on all the cars.",
        "I like how they are going to use a Money Laundering scheme they utilized.. to regulate crypto.",
        "All ya had 2 do was hide it like Celsius unbank urself by giving us ownership of ur assets. All your bitcoin are belong to us.",
        "Wolf to wall street stuff here",
        "He also donated TONS of money to politicians",
        "Am I the only one that's NOT DUMB enough to listen to these influencers? Haven't lost a penny!",
        "karine pierre is literally the worst secretary of our times",
        "What if Elon musk is the UBO of this ftx fiasco? Ftx, twitter, twitter buyout. Elon musk. Lol",
        "This is fanastic",
        "\"Earn to give.\"",
        "Are you doing a Ludwig impression? Or does Ludwig do a Coffeezilla impression? ",
        "numotthenummy ",
        "If you want to know, how to loose money on a casino you own, eventually bankrupting the whole shabang, all you gotta do is ask this Mr. Trump. He managed to drive two casinos straight into the ground…as well as the American democracy, but that’s a different story…or maybe it isn’t? Who can tell anymore…",
        "Kraken nexo only 2 exchanges that did and passed 3rd party audits. Binance probably fine.",
        "Get some sleep!",
        "@Coffeezilla investigate Binance. Their end game is BUSD dominance and reliance and will conduct market manipulation like what happened last week to get there. Crush the market and come out the hero. Look into it please.",
        "Really great summary",
        "Only found you after ftx collapse. Your channel is awesome! Hope many people find you and that way avoid scams",
        "Where's the damn \"donate\" button when you need it?",
        "\"give a man a gun and he can rob a bank give a man a bank and he can rob the world\"",
        "Bankmanstein sounds like a joke name.",
        "Wikipedia specifically points out SBF's league of legends win record as \"average to bad\". \n\nI find this hilarious",
        "We’re living in a time of financial incompetency led by child CEOs made legit by wannabe financial advisors with cameras  bless this comment with a like Coffeezilla!",
        "To anyone who is “on the fence” about cryptocurrency, DO NOT invest in crypto first, and then “learn as you go along” \nLEARN FIRST!!!",
        "Coffee is a GOAT ",
        "He really confirms certain stereotypes about his group huh ",
        "On a lighter note... has earned the right to own this moment. ",
        "You haven’t seen hell. Yet. ",
        "They wrote a IOU to themselves lol tf. Try that out mentally",
        "1.5x speed is a must",
        "Welcome to the future, it sucks here.",
        "you know. We all do mistakes in our jobs. I do in my courses. Coffee here does in his videos. We just put some correction. And somehow, this situation with FTX makes all of us look so dam good at our jobs",
        "Sam was so genereus that he brought a lot of people to bunkruptcy",
        "I need a netflix show of this ASAP!",
        "SBF learned well from his uncle, Bernie.",
        "1bn Assets with 9bn liabilities tell me how much assests does a bank need. Isn’t it like 0, something percent?",
        "Admitting that you made a mistake is not taking responsibility.\nShouldering the damage of your mistake is taking responsibility.",
        "Scammers, Fraudsters and gullible are not a good mix",
        "Imagine if he was a republican donor. \n24/7 breaking news.",
        "Man I'm so glad crypto is going to die",
        "I like how SBF is wearing his bug out bag during the influencer video",
        "I love how everyone calls him sbf like he's a James bond villain",
        "First , I LOST ALL MY LIFE SAVINGS",
        "You love to see it folks. Nothing makes me happier than crypto bros losing everything.",
        "If SBF is coming to my country Argentina, he´ll be dissapeared forever, local authorities are inefficient, corrupt and cheap to bribe.",
        "As hard as it is to believe, this is only part of the story, and not even the darkest part. Look into his relationship with Tether and Nikolai from MakerDao, may he rest in peace.",
        "never trust anyone who says that their framework is robust",
        "I sometimes regret not getting into bitcoin because I thought there had to be a con there somewhere. Collapse of ftx makes me feel a bit better. All of the crypto bro\"s crying sounds good.",
        "damn",
        "Politicians ruin everything",
        "There are rumours going around the internet \nThat you maybe also the winner in a boxing match \nWith Spence",
        "He isnt telling you about the fact he became the 2nd biggest donor to democrats and funneled dark money through Ukraine.",
        "Um...love when our government's press secretary represents our country by saying ummmmm",
        "Considering how deep some of his connections to the Democratic party go the White House was absolutely obligated to weigh in on this.",
        "I can imagine Tom Brady laser eyes burning Bankman's face. I am glad Tom is protecting us.",
        "10% to the big guy",
        "This feels very much like a pre planned contingency",
        "Your suspender clips are uneven.\n\nThank you… and you’re welcome",
        "What really sucks...is your background music. Lose it, or I cannot watch your videos with it.  Real Shame",
        "If only coffeezilla wore that get up on the streets... It would be epic seeing that dress code in the real world",
        "Congrats on the work on this topic. You have a new subscriber!",
        "Woah, Bill Ackman calling it as well as Jim Cramer, only right once.",
        "Buy honest Dave’s carbon credits!",
        "chapter 11.... sounds like investors get screwed and we'll see SBF in a couple years with another multi-billion dollar exchange that can't fail. These guys file chapter 11, lay low and pop up again like nothing ever happened",
        "Hello, can you keep in mind this project: Uniqo. They are launching their project soon, and seems like they are related with an exchange called Swych, which belongs to Titano. Uniqo team says that they will be incubated by Swych, but the strange thing is that they have same website colors, similar domains, almost launched at same time, the only project to be incubated is Uniqo. Coincidence?",
        "Most generous Billionaire in the world.\nguess thats why he isnt a billionaire anymore..... or free.\nwheres Trump's \"Lock [Insert gender pronoun] up\" chorus when you need them ?",
        "the post-mortem you are doing after the FTX fiasco . It just shows how much you want to capitalize on the thing that you didn't promoted them\nAnd I'm loving it..Keeop it up..",
        "it's a joke its him",
        "It was a liquidity squeeze alright, but it was a different liquid and a different squeeze.",
        "The more and more I hear about this story, the more and more I am just dumbfounded at how human ego and vulnerable gullible people are a horrible mix.",
        "What you explained just sounded like how our banks function. Fractional reserve banking. They don't actually have the funds.",
        "You and Spence save me a lot of money with your exposure of the Crypto scammers, love the channel",
        "Craftee will never disappoint us since subscribers are never angry to unsubscribe!",
        "Coffee Zilla man you came a long way from a few years back! Your in the prime fr!!",
        "What kind of liability is Tom Brady facing in helping to bring in millions of investors? ",
        "This should help bring down inflation, right?",
        "On an aside and notwithstanding the great content....is it wrong of me to be really bothered by the uneven suspender clips? Sigh...",
        "A lot of crypto investors are finding out the hard way that investing in something with no inherent value or protections is a fools gamble. They don’t seem bright - some goober on the FTX subreddit infested 2k of their 6k net worth. If you’re making those kinds of decisions, you’re not ready to be a millionaire lol",
        "Dudes name is Bankman....cmon",
        "Don’t talk about the Democratic donors and back room dealings with the super pacs his parents founded. You’re bias af, even the ceo of citadel was willing to point some of it out.",
        "Finally a video longer than 4mins!",
        "Honestly watching silicon valley may be the best thing to do before starting a tech company",
        "these marathon coffee videos are the top tier of entertainment",
        "Not your keys not your coins. RH and Hexicans tried to save you.",
        "Every crypto exchange that works like a bank, offering interest, leverage etc will crash because they work just like a bank without the ability to print crypto unless they print their own \"stablecoins\" which are all scams. Binance will fail too, they all will.",
        "Clearly Coffeezilla takes himself so seriously that he can’t appreciate a little metaphor..? What else would you call competition between the 2 largest exchanges in the world, that isn’t a literal fight to the death? A sparring match. Duhhh  ",
        "I truly appreciate his insight and research. Well done!",
        "Major Crimes, Technology Crimes",
        "Absolutely loving the ** show ",
        "razzlekahn in prison fuming she isnt the top crypto thief anymore",
        "There isn’t a great enough need or great enough difference to switch the majority of the financial system to crypto",
        "Genzler was prof. at MIT while Bankman was student. Genzler took over position from Glenn Ellison who is father of Caroline Ellison at Allameda who is f-buddy with Bankman......Every. Single. Time.  Were you given a multi-billion dollar company when you were 20-something and looked like a bum? .....Every....Single.....Time.",
        "Either way, crypto currency wouldn’t be crypto anymore, there is going to be regulation. Through out history it’s been always time and time again, when a system is broken (finance or buisiness) gets exploited and scammed. Huge amount of people loose their savings or income. Into thin air, of course people will be mad, and government agency will take it serious",
        "Not your keys, not your coins \n\nIt is a shame so many must become victims to learn",
        "Argentina has does not allow extradition of hackers from what I recall.",
        "I don't trust banks and I trust crypto even less",
        "LOL  I love watching people learn about Cryptos the hard way.",
        "Do Kwon in your area. You are Kwoned by SBF",
        "I always love the production quality of your videos. Brilliant.",
        "why you dressed like 80 year old man?",
        "At this stage, you must be willing to lose all crypto you have otherwise do not buy any at all.",
        "its funny how some of the same things that seem insane and criminal in crypto are common practice in traditional finance",
        "My god, it's just dawned on me that Coffee is actually at this point a serious journalist. \n\nHe gets insider knowledge, he gets scoops and he does the work. ",
        "9:54 \nwhat a goober",
        "This commenter illustrates the problem with crypto- ignorant talking heads using words they don’t understand. Binance didn’t cause FTX’s problems, casino’s can easily lose money, and suckers who buy crypto aren’t “investors”. That’s only the first few minutes of this comedy routine.",
        "You better chug that coffee to stay awake during all this dank drama",
        "But is it as bad as a grown man wearing suspenders and calling himself “Coffeezilla”?",
        "Binance is savage. They knew exactly what they were doing.",
        "Even if the United States cant get to these criminals. I bet the billionares can :P",
        "wait a minute. does coffeezilla have a fucking wardrobe where he always dresses up like a 1950s detective on his job, every day?",
        "Great stuff Coffee! You deserve a years worth of sleep once all of this has unfolded ",
        "Coffee you know what’s another massive scandal? SBF investing $500m into Sequoia’s funds. Sequoia was the lead investor of the rounds of external capital financing made by FTX. massive conflict of interest",
        "Call me old-fashioned but I like having real money backed by the us government, not crypto, not FTT tokens, not shares in a failing tech company.",
        "Props to CZ to uncover this fraud, he would just keep stealing users funds.",
        "Because billionaires were invested in it. That is why the Whitehouse mentioned it.",
        "Glowiecoin Saga",
        "This is all going to be a really good movie in about 5 years or so",
        "Funds aren't safu",
        "It would be a real shame if their servers got wiped, erasing any proof that their clients' accounts ever existed in the first place. I mean, maybe the app cached some data that you can use to prove your account existed, but they already told people to uninstall the app due to the hack. Just a theory.",
        "Seeing these crypto coins use economic and banking terms to sound more legitimate just sets off red flags.",
        "Mr. Bankman is \"Fried\".....",
        "Somebody needs to take a closer look at Bill Ackman  from Central Casting!",
        "Coffeezilla, we need more people like you on youtube. Keep going my man!!!",
        "Impossible to keep up with this drama lol",
        "Wow... Just wow... I was in the camp of thinking someone high up in ftx or Alameda messed things up, but that the US company would be fine. Looking more and more like this goes all the way to the top! Holy cats, this is huge! Lots of very large players were investors in ftx. This is going to have ripples in the real economy too.",
        "The people who called this guy the next Warren Buffett are the same people who called Elizabeth Holmes the next Steve Jobs.",
        "Nice",
        "bullions of dollars",
        "No hacker got that money that shit was him. Ray Charles can see that.",
        "I'm beginning to believe that \"those who cannot remember the past are condemned to repeat it\" is actually wrong. People seem to remember and just think, \"Well, it's different this time! It won't happen to me!\" Well, up until the gravy train stops, at least",
        "Kanye was right",
        "Karine talking about crypto regulation might be the only wise thing the Biden Administration has babbled.",
        "I feel like binance will really regret their decisions leading up to this. Not that FTX isn’t massively corrupt and deserve to be caught, but FTX collapsing is really gonna fuck the market and the entire idea of crypto.",
        "Anybody thinks it’s possible these schemes/scams may be “false flags” essentially to demand regulation to the supposed non centralized crypto market? Just asking?",
        "OMG ppl lost a lot of money. Is it all gone? Will lawyers eat it all?",
        "I absolutely love the reporting you do on these things.  I keep thanking my good fortune that I’m too old and dumb to think cryptocurrency is a good way to invest.  I’m too chickenshit to be enticed out of my FDIC insured savings account.",
        "4:14 ask DT. His casinos went bust. How. Fraud.",
        "funny how the biggest beneficiary from a crypto scam is also the biggest proponent of crypto regulation",
        "FTX set us back years smh",
        "Finding Nemo was the hardest one to hold my breath in man I barely made it through",
        "Warren Buffet warned us about crypto.",
        "FTX should just issue a token",
        "The hacker known as 4chan",
        "I can't wait to see the TV show they make out of this",
        "we actually have to have specific skills to steal other people's money back then, nowadays its you can just say \"we crypto, you money\" and people willingly split from their hard earned cash at a heartbeat. \nbrilliant time.",
        "I love me some Zilla with the drama!",
        "Of course this is a game, and people should not invest their money into financial markets because it only profits a few and drains money from the masses ...",
        "Can u make another video already. I need to learn something new. Ur videos are pure education. Thks",
        "It's like every time a online or crytop exchange is about to fail their customers , they claim to be hacked....",
        "SBF being bad at his job is the most reasonable theory, why else would he escape to Argentina? Source: I'm Argentinian and have SBF's same net worth",
        "Gotta know the difference between CEX & DEX. Banks are built exactly like FTX, different is people decided to withdraw all at once which caused FTX to fuck up. Banks do everything possible to not allow that to happen. Fractional resurve banking is what causes these ‘bank runs’.",
        "15:46 adderall is amphetamine many people are prescribed adderall and it surely heightens your sense of awareness \neven jet pilots take it on long missions\nits all about the dose and addiction",
        "\"trust me bro\" -FTX",
        "I'm blown away with how many anti-semitic and right-wing comments there are here.",
        "9:12 Referring to it as an Incestuous Relationship really got me LMAO",
        "Love your vids Coffeezilla!  You expose the scammers!",
        "I’ve just got a liquidity problem, my money’s tied up in blockbuster.",
        "Not your keys, not your crypto. Simple as.",
        "You nailed it.  The whole thing was a con.",
        "as a software engineer, that GitHub \"\"\"\"\"evidence\"\"\"\"\" sounds like what someone would come up with who knows what GH is, but not really used to getting their hadns dirty with coding",
        "@coffeezilla killing it as always! Been watching since 2020 love this channel ",
        "“Hey we have the money.”\n“We need to fundraise nearly the exact amount we owe people.”",
        "I don’t know he is pretty generous, even giving away his clients funds to others!",
        "Funds are SaFu",
        "The guy says: don't trust banks, and is called Some bank-man fraud?\nDefrauds you with his \"not a bank\"?\nAnd he's jewish!?",
        "We understand the ack of sleep Coffee. Good videos like these take a long time to make, especially when new info comes in by the hour.",
        "I know coffee probably won't ever read this. I just hope he knows how many of us truly appreciate all the hard work that goes into these videos. PUMP $ZILLA",
        "He's good as........fill in the blank",
        "Elon talking smack about this guy robbing people seems a little too ironic to me.",
        "\"Generous billionaire\" is an oxymoron.",
        "Throw the book at him",
        "I hate how people like him view running a company. A company is not a game that you can win at, their is no successful finite end to a company. A company has no clear ending, and the only thing to be done is get a better quarter than previous; expanding to the future to benefit in the development of a better quarter is imperative",
        "Hacked? $600mm \"lost\"? That's a good one.",
        "Is this the way gov will use to regulate crypto?",
        "I'm sure he hack the last of the money to go hide out",
        "What I don't get is how he can file all of his companies under Chapter 11 in the US when only FTXUS was licensed in the United States . I wonder if they spoofed trades to hide stealing the money.",
        "1:20 hey I'm from Argentina! we love corruption here I'm sure they'll be just fine",
        "money is never gone, it‘s just that someone else has it.",
        "I’m old school, I liked that when a Wall Street dude is robbing me they blow my money on cocaine and prostitutes whereas crypto bros date nerdy looking girls and drink detoxing shakes…. I mean they both are robbing me but you can’t beat cocaine and prostitutes ",
        "Hue, this was pretty much expected 3-4years ago that one of big crypto companies will fall\nNow we just wait till next crypto falls\nToo many pyramid scams and alot different scams plus shenanigans is destroying crypto",
        "Dems just lost their #2 donor lmao",
        "look deeper",
        "Uh why tf is he not in prison",
        "Ahhh that's where the \"sex orgies\" comment comes from ",
        "\"Imprisoning the people of your village and forcing them to work is generally frowned upon.\" is quite possibly the funniest thing I've ever heard Mumbo say >:-(",
        "The difference between Robin Hood and Sam Bankman-Fried is Hood stole money from the rich whereas Bankman-Fried stole from rich and poor.",
        "Where r u kanye",
        "White house addressed it because he was their second largest donor",
        "He didn't even steal people money, he lost it",
        "How much......i can be gullible if its profitable  14:11",
        "Few things in life are easier to lose, than other people's money.\nThis circus keeps getting better and better.\n:):)",
        "Laundered through Ukraine to the democratic party",
        "It's always a WEJ..",
        "The steam from your coffee is fake. You can see the loop",
        "Scam Banker's Man Fried, did not build this tree of companies, his Dad did he knows how to build shell companies!",
        "We need a Coffezilla Tom Cruise laughing meme. HEAVILY deserved.",
        "What happens to the crypto that is held on these exchanges?  Do they just disappear?",
        "i need to drink a beer with this guy",
        "how hard does the retention fall when you put KJP on the fucking screen lmao..",
        "Honestly, I’m just waiting on the FTX version of the fyre festival documentary to come out on Netflix and Hulu",
        "Anyone think this was engineered so they have an excuse to push through crypto regulations.",
        "Kratos voice cracking at 39:55 is so good. Mans cares about his son so much",
        "$FTTC Classic community want justice",
        "White House is a Joke now.",
        "When FTX reached out to me to sponsor my videos I knew it would be a bad idea to work with them. So I didn’t. Lol",
        "Honestly think it’s a set up to roll out the cbdc. I betcha no matter what Sam walks",
        "I take it back. Journalistically, if that's a word, you're the best in the business. There'll be more shitstorm to come and looking forward to you covering it. In the meantime get some sleep Bro!",
        "Imagine trusting some guy that looks like he can't even clean his ass right. Scammers come in all forms and shapes, but this dude looked sus af.",
        "I'm betting Sam gets into a situation where he doesn't kill himself.",
        "They're gonna \"regulate\" crypto, they got what they wanted.",
        "Who will be Suicide 1st",
        "man can i just say i love to see frauds being exposed?",
        "Chapter 11? That usually implies a reorganization and reorg funding. Chapter 7, liquidation, seems more appropriate here, just a thought.",
        "The number of bank haters who don’t know that you are legally secured up to $250,000 if they fail (because of the Great Depression) are the people repeating history in unregulated crypto exchanges right now ",
        "Always great to see a new video up. \n\nSide note - when watching your older content compared to the new content, your green screen/lighting has really improved.",
        "We are really grateful to you coffezilla, you are one of a kind.",
        "SEC Chair Gary Gensler’s old boss at MIT was Glenn Ellison. His daughter Caroline Ellison is the CEO of FTX sister-company Alameda Research (and Sam Bankman-Fried’s lover apparently).\n\n\n\nThe GC of FTX used to be lead counsel to Gary Gensler when he was CFTC Chair.",
        "15:39  YIKES! Imagine That coming at you, high on crank, demanding some Smush-Smush...lololol",
        "The only moments when the press secretary doesn't stutter, is when she ends every segment with \"therefore we need to give more power to the government\"...",
        "I love when krew plays diner games its so fun!! =O:)",
        "How about the CEO of Alameda's dad is the former head of SEC and is best friends with the now head of the SEC",
        "You're such a smart guy I just wish someone had taught you how to properly wear suspenders, I can't stop looking at how loose they are in every video",
        "I'm sure most of the money is sitting in an unknown account somewhere. He knew what he was doing. Both of his parents are lawyers.",
        "I think the saddest part is people still think crypto is the future of finance.......",
        "From the beginning, OG crypto nerds have been telling us bitcoiners to control our own private keys rather than leave funds on shaky exchanges.",
        "It's always sunny in Philadelphia covered this lesson in Dave and busters",
        "White house addressed it cause they just lost their cash cow lmfao",
        "This guy is the modern day Sherlock Holmes.",
        "Lesson of the day: Keep ya money in ya mattress kids",
        "This needs to be a movie at this point.",
        "The real drama begins when Congress hauls him in, and Coffeezilla appears as an expert witness.",
        "I judge how bad a situation is from the number of times I say \"I don't know\"........ which means this FTX business is going to be unforgettabley bad.",
        "Ryan Gosling talking crypto fraud. Love this channel.",
        "I don’t know what you are talking about",
        "Coffee always covers the fall guys, not the guys behind the scene.\nI want to see more of the behind the scene Coffee",
        "How nice to have hunted that short",
        "Good coverage. There is a small rectification. When Alameda gave them shared of their own token, it doe snot mean it's nothing. Those shred swap hands and now belong to FTX. In other words, they can now sell, burn, hold, trade or else.",
        "He visto youtubers haciendo publicidad a FTX con más seguidores que este canal. Es una locura...",
        "FTX was the BIGGEST donation giver to the Democratic Party. THAT should be a video",
        "The familial relationships of the people involved are worth note too",
        "No wonder dude at Binance was trying to sink him",
        "imagine investing in crypto XD",
        "Why isn’t he being prosecuted? Crypto is such a joke",
        "Hoping this opens peoples eyes to the entire crypto scammery.  It’s a pyramid scheme.",
        "Great fan game, hope the real sonic devs make a game soon!",
        "1:13 \"Flights to Argentina\", sounds like some other people, after the 40's",
        "Is this guy an actual elf?",
        "That guy of one minute clips or whatever is literally a pawn and sponsored by WEF",
        "I felt kinda dumb when I sold all my crypto like 2 years ago but now lol",
        "Okay, I am more convinced of stuffing physical money under my bed.",
        "Most generous billionaire huh? I like to think of it as give this shit away before I can get charged with it as well",
        "15:46 To be fair she's probaby referring to ADHD medication there.",
        "This is Mtgox all over again.",
        "donated to the Democratic Party, knew that Fetterman was worth the $100M+",
        "Speaking of glass houses, this generation biggest con man Elon Musk mixing in is something else...",
        "This must be the best journalism I’ve seen in recent history. Greatest youtube recommendation ever",
        "Man Nas Daily has become such a meme",
        "“In retrospect, the currency backed by memes was bound to be less stable than the one backed by aircraft carriers.”\n\n-Anonymous",
        "To be honest, 10% of holdings vs 100% liabilities is about the same ratio as traditional banks would have. The only difference being that banks operate a bit safer - and get bailed out.",
        "Your tax dollars -> Ukraine-> FTX -> Democrats",
        "Biggest donor to the Biden campaign",
        "Can you do an update video in Terra plz?",
        "I am an outsider of crypto. But really, this is a great piece of journalism, thank you so much.",
        "Scammers",
        "Move/roll over Bernie Madoff/Charles Ponzi",
        "Memo to Coffee\nIf u owe me Cash but  u own Gold ?????\nThat is not an Liquidity Crunch..............",
        "This is one hell of a story. Between this and Musk tanking twitter, we're absolutely getting a show, this week!",
        "And Tom Brady losing his life savings of $650 million.... WOW",
        "\"I can trust him, I mean he drives a Corolla\" probably said by someone... ",
        "I haven’t slept alot nice jab bro",
        "Coffeezilla you got 930k views in less than 24 hr, my hats off to you! Such a good Channel!",
        "The guy really talks fast. He's a genuis!",
        "From the things I'm hearing, you need to have like a daily episode update on everything going down.",
        "Why are you not talking about the Ukraine money laundering ?",
        "I mean people went into this knowing it was unregulated. Now they can learn the hard way why all those fiscal laws exist.",
        "He put the “missing” funds into the swiss bank accounts",
        "it's unbelievable how big crypto has become and people still hasn't learned what is probably the most important crypto rule: \"not your wallet, not your coins\"",
        "Regulations of crypto means cryptos turn centralized, and after that has no more reason to be. Because are centralized and regulator (2 guys with a chief at GPM) can do whatever.",
        "12:35\n\"I don't know any of the facts, but let me smush my opinion all over the internet with unjustified confidence\"\n\nPlanet earth is so fkd",
        "He is just a plain old crook .... enough said.",
        "I do hope that people will take a good look at Binance next. They outed FTX by starting this whole mess but I wouldn't be surprised if they turn out to be doing exactly the same. They're just better at it.",
        "I disagree the two options are that SBF is either a crook or bad at his job. I think there's a third option, that he's a crook who is also bad at his job.",
        "To be fair, I wouldn't trust Binance with a bargepole either.",
        "Why zero coverage of the Democratic Party shillings and donations? Why no coverage of the money laundering thru Ukraine?",
        "We NEED to investigate SBFs donations from Ukraine and to the Democrats"
    ],
    "comments_disabled": false
}