{"video_id": "MWfuDeO9thk", "comments": ["The \"you trust the banks? lmao\" crowd funneling their money into the pockets of random strangers will never not be hilarious to me.", "The oldest rule still holds true: the easiest way to rob a bank is to own one.", "He's so \"generous\" that he likes to give your money away especially to himself. What a nice guy.", "The more and more I hear about this story, the more and more I am just dumbfounded at how human ego and vulnerable gullible people are a horrible mix.", "My god, it's just dawned on me that Coffee is actually at this point a serious journalist. \n\nHe gets insider knowledge, he gets scoops and he does the work. ", "It’s just so wild how all these famous people got on board with them.. it’s like Fyre Fest x 1,000", "People not trusting the banks and then giving money to a guy named \"Bankman\" is something else", "\"That is not a 'poor judgement call', it is theft and fraud.\"\n\nCoffeezilla telling it like it is.", "He was so generous, he gave away his customers money!", "I just can’t even breathe thinking how something like this can happen to people and how people can even do this to others. So sad. So much shame.", "Seeing Coffee going from 2020 to 2022 is just so inspiring", "“Hey we have the money.”\n“We need to fundraise nearly the exact amount we owe people.”", "This is so much more intense than I thought it was, coding a 'back-door' into financial reporting of your own company is the most sus thing I've ever heard anyone at a company do, holy crap", "I pray coffee Never gets caught in something that’ll cause him to leave YouTube . Literally every good YouTuber has somehow gone down at some point in their career", "\"I've never seen a CEO take accountability before.\" Wait, did this guy not remember when the man, the myth, the legend, Satoru Iwata cut his own pay in half to save his employees when he admitted his Wii U idea was a failure and took responsibility to prevent any layoffs????", "The real drama begins when Congress hauls him in, and Coffeezilla appears as an expert witness.", "I feel like Coffee deserves his own series on Netflix.", "The 'hack' is 100% an inside job. Even if their codebase got hacked, the hacker would also need to have access to their Apple & Google accounts in order to push the update in the app stores. I'd imagine only a number of people would have access to those e.g. SBF, CTO and other technical people very high up on the chain", "Don’t expect someone to take care of their business if they can’t even take care of themselves.", "You are like our detective from the 70s who just wouldn't let shit go until the truth is told, incorruptible, and needs some sleep.  Get some sleep brother, we need you later.  Bless and love ", "You and Spence save me a lot of money with your exposure of the Crypto scammers, love the channel", "Just saying “I’m sorry” isn’t the same thing as being accountable", "This why you never take sponsorships or financial advice from YT or influencers. It’s in their interest not yours. Due diligence always", "Just saying “I’m sorry” isn’t the same thing as being accountable absolutely", "Si quieres tener éxito, la mayoría asume la responsabilidad de tus emociones, no echas la culpa a los demás. Además de hacerte sentir más culpable por tus defectos, señalar con el dedo a los demás solo servirá para aumentar tu sentido de responsabilidad personal. Siempre hay un riesgo en cada inversión, pero la gente todavía invierte y tiene éxito. Debes mirar hacia afuera si quieres tener éxito en la vida.", "I am an outsider of crypto. But really, this is a great piece of journalism, thank you so much.", "The people who called this guy the next Warren Buffett are the same people who called Elizabeth Holmes the next Steve Jobs.", "What's so crazy is the connection being shown with SBF, Caroline and Gary Gensler now and how this might be more organized and orchestrated then first shown!!!", "Coffeezilla is one of the only honest YouTubers left on the platform", "Great reporting. Honest about facts. The biggest fault the masses have, is not being able to separate what they KNOW, from what they BELIEVE", "Wow, I just realized that term \"glass house\" has completely different meaning in Poland vs English-speakers due to a book called \"The spring to come\". In Poland glass houses refers to a Technological Utopia (from migrants point of view). You can learn so much stuff from this channel!", "Those criminals NEEDS to go to JAIL !", "This whole story is becoming the conversation between the optimist and pessimist. The pessimist says, \"it can't any worse than this.\", but the optimist replies, \"Oh, yes it can.\"", "This is one hell of a story. Between this and Musk tanking twitter, we're absolutely getting a show, this week!", "Loving every minute of this - I love how the crypto and NFT markets show exactly what humanity is like to the world.", "Great stuff Coffee! You deserve a years worth of sleep once all of this has unfolded ", "Coffee you're the only one tracking this stuff at such a high quality. Thank you! He ought to go to prison.", "Gotta love how SBF's tweet is structured exactly like an \"I'm fine. Everything is fine.\" meme", "Sending my appreciation to the heat of the coffee. It’s been steaming the whole videos. I want that coffee with everything happening, it’s needed.", "Never, never ever trust a fully grown adult who is a Harry Potter fan with your life savings I really wish I didn't have to tell people that but, here we are.", "the funniest thing about the crypto scene is how it's literally just a speedrun of the history of scams and fraud, it's like the tiktok version of last century's economy", "As hard as it is to believe, this is only part of the story, and not even the darkest part. Look into his relationship with Tether and Nikolai from MakerDao, may he rest in peace.", "On another note I've been thinking that it might make more sense to limit the amount tokens their particular company can hold or individual or both saying two to three percent", "Your take and critical thinking is on point. This is a great work!", "\"1 billion in liquid assets, 9 billion in liabilities\"\nPretty much the story of my life.", "It’s unbelievable how fast you can pump out these videos. \n\nThis story dropped earlier today and you’ve already banged out a 20 min piece that brings it all together. Legend.", "I don't know how I stumbled upon you a long while ago.. but I am really glad I did.  Disclaimer: I hate crypto and capitalism as a whole. Crypto isn't anything I personally partake in or agree with (environmental reasons), however I do agree with a lot of your morals, ethics, & opinions. \nYou are the one of the only people who can hold my attention in relation to anything financial in this sense. You present things almost like a puzzle that you're piecing together,  like a natural storyteller. The research is always fantastic as well. You and your team, production, audio engineers, fact-checkers, & everyone involved are amazing. I very much appreciate you all. Thank you! :)", "Honestly watching silicon valley may be the best thing to do before starting a tech company", "Coffeezilla is the next generation of investigative journalism", "It's all sort of tragic but it's very amusing. What were these people expected going to happen. They bought into something they did not understand.", "That's insane that the criminal CEO can casually flee to another company while this all is happening. Such allegations (especially while filing bankrupcy) should put the CEO at travel restriction to see if he is found to be guilty of fraud.", "Wow... Just wow... I was in the camp of thinking someone high up in ftx or Alameda messed things up, but that the US company would be fine. Looking more and more like this goes all the way to the top! Holy cats, this is huge! Lots of very large players were investors in ftx. This is going to have ripples in the real economy too.", "I like this kind of channel. It will help ordinary folks discover fraudulent activities. Instead of listening to those so called \"financial gurus\" who promoted FTX, I think you need to subscribe to this kind of channel. As the saying goes, prevention is better than cure.", "It's not too hard to be generous when it's someone else's money.", "Love your vids Coffeezilla!  You expose the scammers!", "This guy deserves more! Amazing job coffeezilla!", "He put the “missing” funds into the swiss bank accounts", "I mean people went into this knowing it was unregulated. Now they can learn the hard way why all those fiscal laws exist.", "There is a reason why YouTubers are starting to get paid the real BIG BUCKS. The amount of effort and research power that goes in videos like this is legendary. More power to you my man.", "Enjoy your rest, dear Mr. Coffee. You earned it.", "I don’t know he is pretty generous, even giving away his clients funds to others!", "goes all the way to the top! Holy cats, this is huge! Lots of very large players were investors in ftx. This is going to have ripples in the real economy too.", "Be careful out there coffee, no doubt you're ruffling some feather's with this. Love your work nether the less, your advice definitely kept me away and I'm sure lots of others from crypto, nfts etc.", "Glad to see you getting huge", "I only just started watching this guy but the fact that he has every reason to be smug right now and chooses to just present the facts honestly makes me like him.", "imagine that, bill ackman rushing to the support of a \"fellow criminal.\"  how heart warming", "What a fun story. \"You can't trust the system, man... give your money to this random dude instead. Trust me bro.\"", "You should get a falcon (or a snake hanging in a fichus) that occasionally flaps and stretches, to be the final complement to the background action production.", "Reminds me of Enron using its own stock as collateral to hide its own debt", "13:29 \"Isn't it awfully convenient that you're suddenly bad at your job, when it would be criminal if you actually knew?\" - this is exactly the sort of thing the prosecution is going to throw at him. There is no possible way he can get away with this.", "One thing I highly recommend: reading John Ray's (the guy who restructured Enron) bankruptcy filing. My takeaway was: what else is there?  Is there another shoe waiting to drop?", "It's amazing to see all these real life, unfettered, unhindered by government interference, experiments in libertarianism show us exactly what the libertarian world looks like in real life.", "HONESTLY\nMAKE MORE VIDEOS!!!!\nI took a few month break from your videos from busy at work and I’m almost through all of your recent videos", "I do hope that people will take a good look at Binance next. They outed FTX by starting this whole mess but I wouldn't be surprised if they turn out to be doing exactly the same. They're just better at it.", "What a hero! Stay safe Coffeezilla, i feel many people want to shut you up.", "I enjoy your content. A bunch of others try to do the same thing you do and the reason I don’t watch them? Is because you? You are smart, you are a good investigator, I’d go as far as to say you may be one of the most brilliant minds I’ve seen in this era. You don’t take stupid excuses, you investigate and bring hard evidence of what it really is. You have to be really smart to uncover all of these Rug pulls. I hope you make it where you want to be in life, I hope you accomplish every goal that you set out, and I hope all these idiots know not to mess with coffeezilla.", "They always fall back on \"we screwed up' and then add \"we promise it won't happen again so give us more money and power.\" It's the typical bankster excuse whether from the FED or from other financial institutions.", "I SEE YOU ️ZILLA!!  Growing by leaps and bounds! Your info and Chanel are on FIRE! Who knew HIGH DEDUCTIVE REASONING SKILLS would WIN OUT after all out here in sheep society… \n\nBRAVO MY MAN", "Folks with degrees in chemistry sometimes go on to fulfil such amazing roles completely unrelated to chemistry: Margaret Thatcher, Angela Merkel, Frauke Petry, Dolph Lundgren, Coffeezilla...", "On the tweet about Gary's github activity and him being behind the hack, I wanted to say he likely wasn't that stupid, but then I remembered the rest of this story lol. It is possible.", "\"Oh look, we got hacked, all the money is gone\"\n\n- CEO of exchange going insolvent.", "You're an excellent journo and commentator.. Keep it up!", "Really like the fact you are giving FACTS! And explaining concepts that many, many people don't understand.", "Craftee will never disappoint us since subscribers are never angry to unsubscribe!", "\"Welcome to the future, it sucks here\" No truer words were spoken.", "\"Imprisoning the people of your village and forcing them to work is generally frowned upon.\" is quite possibly the funniest thing I've ever heard Mumbo say >:-(", "SBF was worth billions and gave it all away. He really is the most generous man in the world", "There is a reason you use to hear the blockchain community repeatedly say \"DON'T PUT ALL YOUR MONEY INTO EXCHANGES.\" No matter how trustworthy they claim to be.", "That guy knew all along what he was doing. He figured out the Banks got away with it in 2008 and did it in an even more complicated manner. It just caught up to him. It will be interesting to see if they can ever recover the funds stolen and whether or not he goes to jail. I'm sure he figured if the bankers got away with it, he can too", "\"I can trust him, I mean he drives a Corolla\" probably said by someone... ", "This is hillarious. I love hearing about crypto bros losing their internet coins.", "The industry: \"This cant get any worse!\"\n\nThe narrator: \"...And then it got worse.\"", "Thanks a lot brother...when it comes to exposing financial and crypto fraud...you are the man Coffee Zilla :)", "This was the biggest heist in history. Someone’s on a yacht right now partying .", "You are the man. You pointed out SBF ponzi scam 6 months ago. Thanks", "rest up king, doing good work on the front lines", "My favorite part was when sonic was running and then he was stopped by an invisible barrier. Great throw back to the comics where he only ran where he felt he needed to go. 10/10", "Just saw Spencer's video on this whole situation and Coffee's resulting comment. Pretty disappointed in Spence, feels like his POV is a bit of coping that some of his friends made a decision around promotion. Appreciating how consistent Coffee is when holding people accountable. Still undefeated.", "From the things I'm hearing, you need to have like a daily episode update on everything going down.", "Honestly, I’m just waiting on the FTX version of the fyre festival documentary to come out on Netflix and Hulu"]}