{
    "video_id": "N3QHb-202gg",
    "comments": [
        "So Cod MW2 just became  PAY TO WIN  .. seeing as you only get those weapons with the battle pass...",
        "can't invite friends what the heck",
        "Not sure if i like the sound of the new battlepass system",
        "Richocet isn't working at all was that just a gimmick?",
        "Finally.. Hated to play solo on warzone 1, hope this one will feel somehow better :D anxiety........",
        "So they keep copying Fortnite lol",
        "You gave us 60% of a multiplayer, fix it. Now.",
        "don’t us vault edition owners have the battle pass for free?",
        "does unused tokens go over to the next season?",
        "L COSMETICS",
        "ayo but wb about the staff from the first warzone? Do I get to keep my skins or is it all a fresh start?",
        "Who here is ready for the mass chaos of shipment",
        "Uninspired, like everything that comes out of Activision Shanghai.",
        "Change for the sake of change, niiiiiice (no)",
        "\"Battlepass trailer\". Welp everyone pack up. Gaming's dead",
        "a form of fortnite’s new battle pass interesting activision",
        "I like how they dub the announcer",
        "Hopefully there's an option for us to change the receiver of Victus XMR (AW50) to AWM in .300wm or .338 lapua",
        "Oh yeah I’m 100% not doing the camo challenges anymore if there’s gonna be cool ones similar to the existing ones",
        " ｐｒｏｍｏｓｍ",
        "“Including new functional weapons” this game is a joke",
        "It's funny I watched this a  few hours ago wondering when COD would make an official post.",
        "At least they're finally giving us cod points back",
        "most boring cod ive played in years",
        "love it ",
        "Bruh all I want are skins for like ghost and soap and price ain’t no way I’m buying that shiddy vault edition",
        "Please make it without glitch",
        "I was not expecting them to copy Deep Rock Galactic's battlepass system, but it's certainly a welcoming change.",
        "ngl battle pass that pays for itself is the best thing they included, then if you want additional skins just buy them. I'm 100% down for that for warzone, lets hope the gameplay is amazing but i really love mw2 now after thinking it was a dud originally.",
        "Mobile",
        "Can we take a moment to appreciate how much time and effort he puts in the videos for us",
        "This looks phenomenal! Can't wait honestly!",
        "They still haven’t fixed excutions. Ridiculous",
        "I can't wait to complete this battle pass to achieve total victory! ",
        "DMZ FREAKIN BLOWS BIGG TIME",
        "WE WANT REBIRTH AND PLUNDER IN WARZONE 2!!!!!",
        "this is so much better ",
        "Can you guys fix the base game first? Crashes every 2 or 3 matches.",
        "Wack",
        "I just want gaz lol",
        "the ilusion of free choice",
        "is battlepass free and added in game?",
        "They buffed gus's mustache",
        "To all u bums who didn’t buy the full game enjoy war one ",
        "battle pass on a 70$ game",
        "Why don't you guys bring rebirth back but charge for it. You would make millions and millions and sleep with each other you goofs. You have one of the best maps of all times and you just took it away for this garabge.",
        "That looks like the battles pass",
        "fix the DirectX error",
        "Looks more complicated than I'd like",
        "Can’t believe cod mobile is more detailed than this game lol but I’m still enjoying it",
        "It did not give me finishers that I’ve already bought",
        "all that and yall still can't add combat record",
        "Can you please fix the game before releasing new studf",
        "pretty cool ngl",
        "Let's go, these skins look sick. Give us more milsim vibes!",
        "So like DRG or Cavern Crawl.",
        "ya lets add a bunch of useless named operators nobody gives af about for the battle pass and leave soap, price and ghost locked behind a $30 paywall still what a battle pass",
        "Narrated by master chief",
        "Que vuelva el modo saqueo",
        "Cool thx",
        "This game gon be such a sucess ",
        "ah yes camping simulator 2 battle pass",
        "beta was the gamma\nlaunch is the beta\nfull game in few months",
        "So glad not be playing in WWII in 2022 anymore.  The modern skins look pretty nice too",
        "Can I expect same BP for warzone mobile?",
        "Did my guy at the end just do the finishing move bane does to Batman to break his back ",
        "FIX IT SO I CAN PLAY WITH MY FRIENDS........ jezzzz so annoying.. everytime i click on ''social'' it doesnt work.... man its been 24 hours. get it together....",
        "DMZ is by far the worst game mode the children at COD have created",
        "So copying Fortnite lol",
        "Can't wait to see reddit complaining on how super complex the battle pass is",
        "Nobody buy this game they won’t fix Xbox problems can’t even play multiplayer",
        "FIX THE FALSE-BAN ISSUE. PLEASE STOP IGNORING IT. r/Activision has a TON of people experiencing this issue. #cashmererhino",
        "Glad I got the vault edition and will get 50 of those tiers instantly unlocked",
        "Well that looks just plain convoluted",
        "I hope u guys fixed offline mode for multiplayer and gunsmith also operators",
        "Look. Basically, I'm just not gonna buy COD Modern Warfare 2. UGH... I KNOW, I KNOW! It's just that I'm not buying it is all. Hahahaha!",
        "Yo boys can you pre load the update?",
        " My entertainment channel ",
        "BINGO!",
        "Can’t wait for my level to disappear after I grind countless hours ever season ",
        "This game won’t be complete without some cat ears and some generic anime camo skins.",
        "Man im desperately crying right now ..why cant i afford it .i wish i could enjoy the moments .",
        "I’m so hyped!",
        "i can’t wait till they make a cod where you get the satisfaction of prestiging again",
        "Where is the crossbow?",
        "I hate battlepasses for forcing you to play like it’s your job; this is a very nice redesign for the feature. Hats off to whoever had this idea",
        "definitly gonna buy",
        "So more changes nobody asked for, fantastic. Because everyone is already loving all the changes cod has had in recent years. \nJust release remastered versions of the old games please and stop wasting everyone's time with these \"new and improved\" pieces of trash you release every year. You make me hate this franchise.",
        "Did you know this comes with over 100 rewards ",
        "Why buy a battle pass if when they launch warzone 3 you cant play with the skins you paid?",
        "Put 1 shot headshots back on some snipers! The games so sluggish and boring without it, the maps big so snipers are the obvious choice but they are underpowered just like warzone one",
        "Does anybody else remember the time when games used to release with all of their content available and complety finished titles. Or is it a dream that ive made into reality.\nWhats with games releasing now with empty shells for content and we have to wait weeks for content that we should already have. Some of these game developers should be making their games whilst wearing balaclavas as they have become thieving c***s.",
        "Why'd y'all remove rebirth",
        "def going to be a system crash the first couple of hours",
        "Can't wait to log on and already see players complete it by paying",
        "I believe he is the only one who never disappoint us with his content️",
        "Does anyone still have error code 0x887a0005 and is there a fix or patch",
        "We want skin challenges back",
        "I wonder how much we have to pay to get the full game",
        "What about prop hunt? How do they expect to get more girls to play this game??!?",
        "They did not add rose ",
        "Sadly I'll be buying it ",
        "It is so entertaining just watching the chaos that occurs when they play with each other.",
        "RANDOM COMPLAINT!",
        "Aint it time battle passes were out of fashion by now",
        "Next Is: Warzone Mobile can't wait for this",
        "Again the footstep audio is completely horrible in this game. You here 4 footsteps which means it's nearly inpossible to react. How is this possible in every game you make?",
        "Looks so cheap",
        "Its a joke, a JOKE!",
        "SIIIICKK",
        "You have the courage of your convictions.",
        "Ich könnte langsam nur noch kotzen. Jede zweite Lobby ist ein Vtol am Himmel wo hingegen die verbesserte Drohne so gut wie unerreichbar ist bei dem gecampe. Schrittrichtungen sind verbuggt spawns sind besonders auf shoot house frech und headglitches vorhanden so weit das Auge reicht.",
        " 50 tier skips hype",
        "i can’t wait to play tomorrow ong",
        "wow this is pretty cringe",
        "This looks more complicated than it needs to be. Why didn't they put all this effort into making the base game have all the features that mw2019 had and actually work!!!",
        "yea so when are the innocent players getting unbanned?",
        "Do I see Shadow Company skins? If so, I'm hyped.",
        "Warzone 2.0 ",
        "Where is raid",
        "I like the new concept, now I can choose things that I want to unlock first, amazing, can’t wait to try it",
        "always wanted something like this because everyone unlocking the same items at the exact same time got old FAST",
        "the skins look ehhhhh",
        "We need to be able to shoot while we are skydiving, we shouldn’t have to wait to shoot because we did a knee slide, we shouldn’t have to stare at our radio for 7 seconds to call in a UAV, it takes 9 attempts to mantle over a wall sometimes, footsteps are absolutely broken in buildings.",
        "Sick",
        "This is very confusing. Oh well, I’m sure I’ll get it as time goes on (especially since I got 50 skips when it comes out",
        "I feel sorry for anyone who still buys any of the COD’s",
        "I still don't understand what a battle pass is. All I know is I'm not paying $70+BP (mp tax).",
        "How will the 50 or 55 tier skips you got with the vault edition work now?",
        "It going to take 25 hours just to play war zone 2",
        "All I want is an FN FAL",
        "Please don't forget about multiplayer , a lot of us still love playing that instead of warzone , and it's kind of sad how you all focus so much on warzone that you just let mp die",
        "Where’s my 50 tier skips?",
        "Where the fk is Nikto???",
        "I spend money for nothing i love the old warzone",
        "So, here's a thought...The guy with the helmet, could he be in the same squad or faction as Fender? Their helmets are almost the same? Also, I wonder if we'll get plunder or aircraft to fly like in Vanguard",
        "a non linear approach with teirs....hmmm interesting",
        "Should've just kept the same tier system",
        "Enjoy the first seasons boys. It will be the most fun",
        "Can’t wait for this I got the vault edtion just for this lets goo",
        "Be very interesting to see we always had the old system which works but very interesting",
        "55 Tier skips here we come",
        "I have a question. We learned that October 16 is the time to download Warzone 2, but at any time is it in 12 am, 12 noon or 7 am, please reply?",
        "Devs really took a look at the map in Ghost Recon: Wildlands and said \"We should do our Battle Pass like that!\"",
        "Are maps like terminal rust etc ever coming back in this mw2 ?? Well if not im disappointed and cant call this game mw2 its just another cod with the old name of mw2",
        "I hope Modern Warfare 3 Remastered is going to release in 2023",
        "So basically the fortnite battle pass system from chap 2. Season 7",
        "Another aim assist game, gg",
        "This is literally fortnite",
        "Please, don't make the same mistake twice and keep the content in line with the base game (no bizarre, out-of-context weapons and over-the-top cosmetics) and focus on improving the actual gameplay to keep it interesting for the whole playerbase.",
        "Please Activision, launch a league system for multiplayer instead of skill-based matchmaking, and give us the option to play the game with the traditional matchmaking system",
        "WOOOO FINALLY, MORE CONTENT",
        "Can't wait for the 2pac operator bundle!",
        "So there’s no skins for the 141 characters? Weird that you guys would lock the operators from campaign behind a 40 dollar paywall that you can’t even upgrade to",
        "I cannot wait man",
        "Would be really cool to see the game preserve older battle passes. Making them unavailable after the season ends basically removes content ;_;",
        "Can't wait to get the MIL-SIM skins!",
        "Jesus Christ MWII so far is literally “If It Ain’t Broke, Don’t Fix It”: The Game",
        "Oh no roze is back",
        "Give us Alejandro and Valeria!",
        "I just hope the MCX is not scuffed.",
        "I'm so happy for Shadow Company being mil-sims again. I'll be buying the pass just for them.",
        "They should make this series an hour long -_-",
        "No Price?",
        "Just hoping for a Ghost skin in the battle pass so I can unlock him that way.",
        "1:15 they really stole that finisher from For Honor ",
        "THE NARRATOR ",
        "So instead of buying a single battle pass, we will have to buy now multiple tokens to unlock each reward separately?",
        "The fact warzone 2.0 is only 23GB on steam is kinda sus since the last warzone was 200GB",
        "they turned battle pass into a mini game",
        "Amazing they couldn't come out with a trailer like this for DMZ before they dropped all of the aimbot warzone streamers into a match and neither they nor anyone else watching knew what was going on or how to play it.",
        "This looks like a commercial call of duty has so much money, but they release a trailer like this for us",
        "get my comment to the top so i can say something racist",
        "Banned",
        "Can we first talk about that game is barely playable in its current state on PS5 and PC before pushing content. Needs a hot fix ASAP for the game crashes and net code issues.",
        "Activision, why can't i play warzone 2.0?",
        "Havnt grinded Cod since BO3. But I have been really addicted to this new MW22 and enjoying it. Unfotunatley the base maps are terrible.",
        "Hey activation call of duty can you plz add the AS VAL plz plz plz plz",
        "This is gonna be great! Activision is going dark!",
        "Zud is the only one who found a way to escape the matrix",
        "Those operator skins look horrible",
        "Do I still get the tier skips if I'm not level 55?",
        "É call of duty como reativar o modo call of duty MW3 por favor modo Multiplayer para conta nova por favor reativa aí por favor",
        "This game is absolute trash and I regret that I bought it.",
        "Its cool and all but Shipment and Shoothouse shouldnt be considered new maps",
        "Please no wacky comestics",
        "The fact that they had to explain how the battle pass works seems to brain dead. Instead of giving us a video to show how the battle pass works they could of been working on getting us more content.",
        "This seems complicated af. Infinity ward should learn from the saying if it ain't broke don't fix it ",
        "I hope we RU community will be able to play without lags and without vpn =)",
        "Make clash permanent",
        "how do i buy on pc?",
        "great",
        "why isnt the world 1 day ahead ? honestly i cant wait 24 more hours",
        "i think mw 2019 / warzone 1 was the best fps i ever played and i think mw2 is unplayable so you obviously did something wrong",
        "Goofy ahh battle pass. We want skins for Ghost",
        "Hey Fortnite like how your Battle Pass has been looking for a while now, be a shame of someone copied it.",
        "Its different, so I'll take it",
        "Other than sbmm the game is fun af.  Wish there was more casual pups without having to to tank",
        "Just came back to say that this game is a complete disappointment and threw away what og warzone players loved",
        "Is an item on the battle pass Reduced SBMM?",
        "I lost my  id because of you codm",
        "Ngl I’m excited for wz2",
        "I like how different it is! looks very interesting",
        "One of the best things is that he never takes credit for himself when he achieves something. He always respect us, the audience, and his team, and he is always polite in all of his videos. We congratulate ourselves on this achievement. More to come and everything to come :( =)",
        "W",
        "Lol only kids and YouTubers got time to level up in this game . By the time I unblock the sights, the next cod will be out  . Time to return this ",
        "bring frog man udt out ",
        "This game is dog water. All motion blur off (still get sick). FOV at 100 (can’t see past my gun). The progression system in this game is absolutely hippo stool. You fumbled this whole game. ️",
        "I don’t play games anymore. Wasn’t it nice when you bought the game and you owned it and it was complete from the beginning instead of having to pay a fortune to be able to play it over time.",
        "Great Job call of duty fr",
        "This is one of the battle passes of all time",
        "New functional weapons \nyeah i sure hope they do",
        "Exactly like Fortnite’s battle pass.",
        "Where Is the barracks and the Prestige?",
        "Wow I can't wait to see how long this takes if you don't buy tier skips.",
        "This battle pass system is legendary",
        "Warum gibt es warzone 2.0 nicht für xbox one  x",
        "So if I don’t get all rewards in a tier, will I still be able to complete it after the season ends?",
        "They are right to change this map to the previous warzone",
        "Hey! Why S1 says to me reached max token \nWhen i go only for 54% of AO map with this? .... :( :(",
        "Them 55 tier skips bout to be hella nice ",
        "So I did not buy the new Call of Duty yet due to priorities but until the mean time I’m excited that the new warzone is coming out. My birthday is on the 17th and I plan on getting lit asf while playing it ",
        "Basically fortnites battle pass",
        "Is that frost?",
        "Can't wait to unlock the Battle Bass!  0:58",
        "Warzone 2.0 gonna have the same bp as mw2?",
        "Me: spends £70 for MW2 \nAlso me: spends the rest of the year playing free warzone 2",
        "Basically a spin on fortnites battle pass",
        "Let’s hope the progression is not a drag like current warzone.",
        "Unlock tokens to unlock the 4 unlocks and then unlock the special unlock to unlock the next unlock. ",
        "Can't wait to see Messi sniping",
        "Aye Anybody Else Have To Buy MW2 To Play Warzone2? Bruh Itz Free To Play Tf? ",
        "Am I the only one who  wants to see Andrew Lincoln and Jon Bernthal as operators or important characters in MW 3?",
        "Already don’t like it",
        "Y'all gonna finally fix the finishing moves??",
        "REMOVE SHADOWBAN SYSTEM HOLY",
        "The trailer made it simple to understand",
        "Then what about the 50 tier skips promised with vault edition?",
        "Roll out new maps frequently please. Can we get a Pipeline and Bloc remake?",
        "Goat ",
        "same battle pass in warzone mobile?",
        "In Payday 2 (released in 2013) there was this thing called \"Infamy\" (prestige basically). There you needed to get \"Infamy points\" that you will later spend in an \"infamy tree\" that had a lot of rewards, this Battle Pass literally copies that lol.\nThe funny thing is that Payday actually changed that \"tree\" system for a linear system, replicating the one in Warzone of the 100 tiers. Now Warzone 2 is doing this, lol. Would love to think what the devs of that other game think.",
        "Can't wait to get 50 tier skips :)",
        "Can't wait to spend 5 hours just to unlock a single reward",
        "Can we get best plays back",
        "Sounds like Fortnite with the map",
        "Happy to now play as shadow company",
        "So basically 6v6 modes are now \"cancelled\".",
        "",
        "Great, time for IW and Activision to pool everything they have into Warzone and completely neglect anything other than that",
        "Mientras tanto call of duty mobile , Tencent regresa pases viejos para sacar todo el billete a sus jugadores antes de que salga WZ mobile y empiece con sus pases",
        "I wonder if 3 person mode is gonna be in warzone too so I can see my other skins",
        "I miss lootcrates low key the battlepasses system isn’t it we only get 20 items and the rest are locked behind a pay wall at least with loot crates I’d get a massive variety of items that would be unique to me I wouldn’t see my friend or 50 other players with the same item it added variety and all u had to do was play the game it’s your choice and your money if you wanna buy the in game currency to buy the lootcrates but I remember modern warfare remastered did it perfectly it kept me playing",
        "Whose brilliant idea was it to make a Battle Pass convoluted??!!",
        "If only I could actually play the game without crashing",
        "Ofc roze gets a skin. Cant wait to see roze luna ghost farah and price \"movement gods\" ",
        "Fortnight",
        "Graves should be an operator",
        "BRO THEY DID THE SAME THING WITH THE FORTNITE BATTLE PASS️️️",
        "looks meh honestly",
        "BRO, i paid or the most expensive game battle pass in call of duty history and i have to go and look for objectives to earn what i already paid for? What a rip off.. !",
        "battle pass looks like something out of COD Mobile",
        "I think this is definitely a unique way to do a battle pass, I’m honestly sick of the system by now but this one is at least different enough",
        "''This content is not available at the moment'' this popped up after I tried to play the game, can anyone help please? System is PS4, I tried to restart console, restore licenses, parental options, nothing worked, and Activision's support is pretty much useless.",
        "please fix the menu ui and it freezing on pc",
        "Brooo i can't wait to buy it ",
        "Why do they have to have the honey badger at tier 100 ",
        "Kastov -47",
        "I can't wait for them to completely ruin the fun.",
        "you can see they invested the most manpower in creating a new battle pass system. wow..",
        "Just when you think they couldn't make their in-game systems more complicated, they drop an RPG talent point system for something as simple as a battle pass. ",
        "I was wondering if you could help me with a bug I am experiencing it says to play warzone 2.0 I have to buy modern warfare 2 and it let me play yesterday",
        "I like this system, Plants vs Zombies do thus and it just works really well  looks awesome and can't wait",
        "That Rose skin is a W",
        "Okay, that's fine but how long do I have to grind for one token?",
        "bout to be ",
        "I know it sounds boring, but I wouldn’t mind playing FFA on Shoothouse all fraggin’ day!",
        "Bring back plunder!",
        "Beautifull. Please youtubers and toxic community (big part of that) don't ruin this game as you do with wz 1. Understand it's a NEW GAME!!!!",
        "Cant wait till the new lazer gun 5000 is getting added",
        "Bane operator Breakin backs",
        "I'll be seeing all of you in the Gulag ladies & gentlemen",
        "So is it free? Or is there no free tiers anymore?",
        "I will come back tomorrow to look at it",
        "1:20 For every like this comment gets I'll do one pushup and post a video of it",
        "Your game is so broken that I lost interest on buying bundles , fix your game",
        "Just don’t add the roze skin from mw2019",
        "If they try to force me to play WZ inorder to unlock a reward, I'm going to be very disappointed.",
        "Bring back roach",
        "That Bane VS BATMAN take down at the end ",
        "Can’t wait for the entire game to freeze after each map while it struggles to load my battle pass ranks",
        "great job developers this game is by far your best.",
        "sux",
        "This sounds grindy af.",
        "PLEASE focus on Multiplayer with the amount of love and care you put into Warzone",
        "did this man jus break his back as a finishing move ??  i like it",
        "Wath is gonna hapend whit the old operator's???",
        "please warzone 2",
        "Nobody cares about Joe Biden ",
        "DMZ, AI needs to be toned down. They are better than the human players. I'm ducking in the train, and the AI can somehow see Mr and are able to shoot and down me through multiple pieces of cover. They don't lose you underwater. It's a terrible experience solo, but it's even worse with randoms.",
        "That finisher at the end was pre cool",
        "When does it come out in Australia?",
        "that's a pretty neat new way of progressing the pass I guess.... Now if more people would just follow Halo infinite's design and have the passes never expire.",
        "This is a huge step forward. Once again. Thank you IW for leading the way",
        "If I'm a Vault edition owner, Can I not use the 50 tier skips included with this edition? Because I want to grind at my own pace. also I have 1000 CP in my old Xbox. I want to sell the Xbox so before doing so I planned to spend those 1000 CP buying the Battlepass tier 0 in Xbox (warzone 2) to then re-earn the 1000 cp back but in Steam. The problem is that the Vault edition says it will give me the BattlePass in season 1 + 50 tier skips. Does anybody know how will that work?",
        "I will stream the game during the launch, cant wait.",
        "If games handled themselves the way cod mw2 2022 , people wouldn’t be mad about battlepasses and online stores .",
        "Gonna cop it",
        "Please fix the slow pop in and lag in Warzone for PS4 players ",
        "Wow! You mean I can earn BattlePass tokens to unlock content? Then I can Upgrade my BattlePass to be even more BattlePassier? Can't wait to grab and ice cold Mtn Dew and bag of Jack's Link Beef Jerky and drop in and SQUAD UP! Then hop over to Warzone 2.0 and try out the new Hummer EV vehicle and watch my favorite streamers on Twitch TV!",
        "Fortnite copy smh",
        "STOP ZE CRASHINGS",
        "Fix the slimline pro optic glitch where people that already have lachman sub cant unlock it",
        "Victory is in my hands.\nSBMM: ️🫦️",
        "how cross progration going to be?",
        "Other than sbmm the game is fun af. Wish there was more casual pups without having to to tank",
        "Here yall go complaining, \"dont add sci-fi or robot skins\" well duhh its mw2 not cold war or vanguard. This is mainly made by infinity ward. Which they had the best looking skins for mw2019 so ik they will make the skins for this one even greater. And warzone 2  will always be the same unlike wz1, why ? . Bc all the studios worked on this one unlike warzone 1 which was only made by infinity ward, later cooperating with treyarch when rebirth droped and then with sledgehammer games wen caldera or wtv droped. Yall can cry all you want but i know infinity ward has it all under control, they always keep their skins grounded. I just hope treyarch or sledgehammer dont try any funny stuff ",
        "Is this game going on sale during black friday? or only items/dlc'\ns",
        "Why are they called skips, you aren’t really skipping it. Just call it a tier unlock token…",
        "#WZFORRUSSIA",
        "100% warzone 2.0 will die and they will have to bring back verdansk or Rebirth.",
        "Already completed 55 tiers ",
        "The Elden Ring GOTY",
        "Unspielbar als normaler Gamer, man spielt in einer guten Lobby und bekommt danach den Rest des Abends nur noch Lobbys mit 24/7 Schwitzern ohne Fitness, Job oder Hobbys.",
        "Muito bom ",
        "Campaign was woke garbage.",
        "New map every season? Wicked",
        "Can't wait for Multiplayer to be neglected and have all the time and effort be put into WZ.",
        "This game is trying a lot of new things and I like it.",
        "1:16 WWE fighting coming to COD?  isn’t that a special move for one special man!!",
        "This ain’t it",
        "I'm sorry Battlefield, but Call of Duty is doing it better.",
        "First different battle pass in like years",
        "Take out sena crossing, put in terminal, favela, hackney yard, gun runner, quarry, and shipment. 2v2 3v3 mode and this cod will be amazing.",
        "Can y’all make a male version of the shadow company",
        "Can't wait to pay for stuff of a 80$ dollars game!",
        "WE WANT MORE MULTIPLAYER MAPS AND A FUNCTIONAL MENU SYSTEM PLEASE",
        "Only thing I care about is that back breaker execution ",
        "PLEASE DONT GET CARRIED AWAY BY WARZONE THIS IS THE BEST MULTIPLAYER COD WEVE HAD IN YEARS DONT MESS IT UP PLEASEEEEEEEEE",
        "Why can't I preload Warzone 2.0 on BattleNet?",
        "The narrator voice makes it feel like I'm back in the early 2000s watching a trailer lol",
        "Can I get a HOOOOYYYYEEEAAAHHHH ",
        "Activision: If it ain’t broke, watch me break it.",
        "That looks tedious",
        "After paying 70 bucks contents are still locked behind battle passes. LOL.",
        "Awesome I’ve always loved the call of duty franchise but this game was awesome and still is",
        "I wanna be able to preview iron sights on blueprints. Most of the times it's why I buy the gun",
        "Can't wait to pay $70 for the story dlc in 2023.",
        "Please fix the crashing on ps5",
        "MedMen Stock Is Moving Up Now! Insiders Buying more stock! Most Recognized Name in the Marijuana Industry.  Buy MMNFF today.....",
        "when i thought the ui couldn’t get any worse",
        "Let's goo ",
        "I genuinely hope people who payed for the game dont have to buy the battle pass atleast the first season. It wouldnt be fair in my honest opinion",
        "Hope y'all start doing some really cool collabs soon, kinda like how cold war or vanguard did, it honestly has changed how much fun cod is because of it",
        "Love the battle pass trailer is dropping!!! Can you also patch the elevator glitches and floor texture and lobby audio lagging and game crashing and spawning and set a max frame rate for online matches so it’s fair to play gross gen.. thanks",
        "Your new menu layouts are a mess and awkward to use.",
        "Anyone else seen the shadow company with sunglasses i hope there comes operator challenges so you can get the one with Night vision like mw2019",
        "This Battle Pass going be very great",
        "Can’t wait for the dope skins down the line",
        "Lolololololol",
        "Can’t wait",
        "i mean i did pay an extra 10 dollors for the game, idk why you coulndt make one battle pass free",
        "Can’t wait to see how the blueprints will look in a closer view through the battle pass! Also can’t wait for the combat record tomorrow!",
        "Not looking forward to this new system but maybe it's more simple then most people actually think it is.",
        "Best COD so far in recent years!",
        "The battle pass is like Fortnite's pass  :D",
        "Why do I get a feeling that Soap will be locked behind the BP\n\nThe skin in the Vault Edition, to me that ain't Soap. It ain't MW19's \"Shampoo\", it's someone trying to do their best trying to cosplay as Ghost",
        "Can PC players actually play this yet or is the game still crashing and hitching???",
        "probably gonna be trash like the first game. this is basically the mw version of \"ow2\" lol",
        "still wondering why some attachments are locked with no explanation",
        "as a pve player with disability i stopped playing cod since black ops 2 and now its full of hackers and cheaters and campers and toxic players and cyberbullying . wish this game as more pve modes.",
        "COPY ! Sir",
        "My favorite part about cod is how my shots are clearly on the enemy but somehow miss, yet people can shoot me through my legs and somehow it counts as a head shot",
        "Man I absolutely cannot wait for the overload of multiplayer content. Like there's no way that my $70 game is going to be totally overlooked by a free one... Right?",
        "So what happens if you have bought the Vault edition of MW2, how do the 50 tier skips work",
        "About £70 just to play call of duty mobile",
        "Let's just  appreciate how much work and time he puts in these videos to make our day, huge respect!!  :]",
        "What about @Warzonemobile will this bp abm available on wzm?",
        "We dont care about stickers, skins, calling cards whatever",
        "1,400 COD points. Packs will cost 1,600 tho ",
        "I miss old cod",
        "I wonder how will this work in coldwar and mw 2019?",
        "You can tell how much support they'll be bringing to multiplayer based on season one drops. TWO maps??? Both reskins? And one isn't even releasing on S1 launch day, it's releasing midseason? You've got to be kidding me",
        "0:45 Shadow Company contractor on the bottom left. Looks like a Mil-sim skin.\n\nEdit: It is a Mil-Sim.",
        "Surely this \"upgraded version of battlepass\" is absolutely free for Vault edition owners. Do not make the mistake of asking us for more money for at least 6 or more months... I think you need to work on this MW2 beta a bit more before asking for money.",
        "LET'S DO THIS",
        "Hopefully we won't get only one or two maps per season for 6 vs 6 multi-player,  it's less than a month and I've already grown bored of the same maps over and over. At least just add a shipment 24/7 permanent Playlist for those of us that just want to enjoy some chaos from time to time, is that really too much to ask for?",
        "Ok cool! But if I compete a sector of the battle pass it better put those points into the next sector of choice or something. I don’t wanna be in a situation where I forget to select the next sector to level up and lose out on rewards.",
        "Of y'all don't have any shadows its not worth it",
        "Will I finally get my CP when the battle pass comes out ?",
        "finally a more rewarding BP system",
        "Are double xp boosts not working? I can’t find a countdown timer anywhere and didn’t notice any extra xp after each match.",
        "It's been fun.. I love the ground war stuff.",
        "Bruh the Execution actually feels like Executions ",
        "I just want a masked special forces  MilSim for the SpecGru team .   The default KorTac skins are awesome.",
        "Just add 1 decent map to the game, just 1 at least",
        "So getting the vault edition with 50 tier skips, does that mean all the item are unlocked and usable or do we need to play to get the battle tokens to unlock them? It has a similar system as fortnite with the stars you earn by playing",
        "will yall be adding more gilli suit operators in the games.",
        "Fix your game!!! Bad optimisation!!!",
        "I play shoothouse on ps5 and it kicked me and freezin screen 2 Times in 1 round... pls Patch that Bugs!",
        "My game crashes when launching on steam. I'm having a headache about how to fix it. SMH. I need help",
        "WOW...what a nice game...thx 4 creators...",
        "please Call of Duty no more goofy characters and weapon skins...\n\nI want immersion!\nI don't want to feel like I'm playing My Little Pony...",
        "mas que disgraça",
        "Cool so progression is like Fortnite",
        "what about caserma rhino bann sup with that",
        "Seeing Smitty freak out is one of my favorite things  >:-O",
        "They fr copied fortnite's battle pass and said :\"Don't worry I'll change it a bit so they don't notice I copied your homework.\"",
        "Game not even released ",
        "Uninstalled it ,crossplay lol F it off",
        "Is that shoot house I see?",
        "Make the maps wider lol them things are arms length lol seriously",
        "эй лицемеры почему для русских варзон недоступен?",
        "Can’t find any codes for the outfits since everyone steals codes off beef jerky. Is there gas stations that sell it or is it just Walmart?",
        "Worst campaign yet, literally I’m used to playing on veteran and realism. The fact that I can barely push forward without being shot is really concerning, like last modern warfare went through it on realism. No problems, now it’s like you jumped back in time, to where you have to be just as fast a computer again. Like your developers really messed up in my opinion, the enemy is supposed to be acting like humans not poor A.I. driven robots. Dark water major fail too btw ",
        "This is truly ground-breaking stuff! Now I can pay to unlock the same things everyone else is unlocking but in a slightly different order! Fascinating!",
        "Hermanos q vicioooo! Joder",
        "Day 1 of commenting on this channel until I get noticed by call of duty: what would happen if you put a fully funny Australian in the game\nIt would be crazy and hilarious",
        "Please fix error cod 14515",
        "Game is so broken countless issues \nCan't see friends list nothing ",
        "Will it have combat records and prestiges? The game still isn’t finished",
        "So they're going the Fortnite route with how their battle pass is set up. Ngl I like it",
        "Welp! This seems to have more in 1 season than 2042 has had in 1 year. As a long time BF fan, 2042 killed it for me.",
        "Will there still be free weapon blueprints in the tiers like in MW19 BOCW, and Vanguard?",
        "Downloaded it today and have been playing since this morning. Loving it so far.",
        "Where is anime skin? I won't pay anything till anime skin show's up.",
        "I CANT WAIT WARZONE 2 SHOULD COME EARLY! I ALREADY PRE-LOADED IT!\nAlso, does the MWII meal work on warzone 2.0?",
        "Its basically fortnites new battlepass system of a shop grid. Once you do challenges to get stars, you spend those on available rewards until you have enough to go to the next page. Its a better system as it allows you to choose the rewards",
        "Can’t freaking wait can tomorrow be here already",
        "Please don't fully focus on Warzone 2 exclusively and also pay attention to us Multiplayer fans who paid $70, thanks",
        "Maaann is my operator going to look fresh tho?",
        "Sbmm out!",
        "I can still unlock everything in the battle pass or no?",
        "Who is ready for warzone 2.0",
        "All fun and games till the complaints come rolling in after the first season, say I'm lying..",
        "Can someone please let me know if we can transfer all our skins from warzone 1? lol",
        "Sounds like fornite",
        "How can you AGAIN release a buggy game? \nYou made it more boring by not being able to buy a loadout which means something less to fight for. Cars move slow, operator moves slow, loot system is again bad by not picking up what you want etc. How can you make the same mistakes in a new game man? I really don't get it.",
        "Nothing gets me more excited for a new game than knowing I have to grind out 100 levels of a battle pass. Let's go!",
        "Fortnite battle pass",
        "The end of the video slogan says it all. PAY TO WIN",
        "fix your game",
        "just make warzone and mw2 2 separate games, so you dont HAVE to download a whole game you are never gonna play",
        "Death race commentary, nothing better ahah",
        "Garbage game ",
        "I'm off work Thursday....gonna mill into this",
        "when fortnite got this huge update going into chapter 2 and also with 3, you kept all your purchased cosmetics, that game is free and to this day i have everything i ever earned on my account. \nNow it gets interesting...",
        "Nerf bots in dmz pls",
        "Roze with actual Shadow Company Gear? Sign me the freak up",
        "Give me my Lazer guns already",
        "Fix the offline multiplayer I'm tire playing the same boring map",
        "Looks awesome can’t wait",
        "So how do the 50 tier skips work?",
        "the more i play the multiplayer (tier 1), the more i get angry about the game. As beautiful and exciting the single campaign was, congratulations on that, but the multiplayer was definitely better and smoother to play in 2019. latency, feedback and the menu are... bad. thats not developed by infinity ward - they know better. too bad.",
        "Tomorrow we all gonna be playing wa4zon 2",
        "These rewards and the mobile layout look soo boring",
        "Is it just me or are battle passes just getting more and more annoying just makes the game more grindy which I guess from Activisions side is what they want...",
        "ill never buy another call of duty ever again.",
        "Please don’t start adding cartoon characters.",
        "They gotta make Valeria as on operator",
        "Are the guns free still?",
        "need a new voice actor for sure",
        "What about mobile ",
        "Finally a breath of fresh air coming from the circus called vanguard",
        "nothing has changed except the way they display the battlepass lol it's not horizontal anymore. what a change, wow. much new. so effort",
        "Brilliant idea.",
        "I really hope that the price for battle pass stays the same (1000 CP)",
        "70% of rewards are business cards and emblems",
        "The fact we can choose our paths now on top of not being forced into doing challenges to progress like other live service games is great. \nI want to progress from playing and nothing more. This new pathways system makes it all the more comfotable.",
        "this will finish fortnite best of luck",
        "Are you sidelining the main game for Warzone 2.0 as well like 2019? Because the game is in a broken state right now",
        "Think I just came everywhere",
        "Do you have to play warzone to unlock things on the pass?",
        "Why call them \"battle token tier skips\" and not just \"Battle tokens\"?",
        "In a WORLD...",
        "What a cool system I thought they were gonna copy fortnite but not to much of a copy",
        "Графика ужасная в этом игре !!!!!!",
        "when does it expire please answer",
        "Fortnite kids: STOP COPYING FORTNITE BATTLE PASSES!!!!!!1!1111!1",
        "So BANE joined COD",
        "They shouldve used one of the cod characters to say the words instead of an ai wouldve made it better",
        "Beautiful game yes  ️️️️️️️",
        "So, it's like Fortnite's battlepass system.",
        "Can’t wait for Xclusive Ace to break this down in a language 99 percent of gamers can understand.",
        "At least they're trying something different with the battle pass system, i will give props for Infinty Ward for that. Just stick to grounded skins please no goofy ones",
        "Love the looks of this. I was SO sick of the previous system which was nothing but a playtime tracker, that was not satisfying at all and near impossible to finish for casual players. Looks like there is still some filler to go through in this pass system but at least it should feel faster and more rewarding for gameplay.",
        "Battle pass in a non free to play game is crazy",
        "“Instead of being able to unlock everything you have to choose a path just to make sure everybody doesn’t have the same thing so you keep spending money” anybody falling for this deserves it",
        "I just hope the countless bugs get fixed at least",
        "I just posted Mortal's Bane unlock and play. check it",
        "Do our cod points from vanguard transfer over ?",
        "So I have to do math",
        "REMOVE SBMM",
        "Iam so bad",
        "Can I still get the battle pass if I only have the new Warzone and not mw2?",
        "Seeing that cod is taking ideas from fortnite I hope they make the map have dynamic real time events. Such as the map slowly changing like poi’s",
        "THIS IS SO EPIC !!!!!",
        "The only reason to play multi player is to level up guns for warzone. And multi player is boring af.",
        "I may actually upgrade to vault edition",
        "Need MORE MULTIPLAYER MAPS"
    ],
    "comments_disabled": false
}