{"video_id": "N3QHb-202gg", "comments": ["Can’t wait to see the progression from actual military looking soldiers in the first seasons, to alien robots in the last seasons.", "PLEASE focus on Multiplayer with the amount of love and care you put into Warzone", "One of the best things is that he never takes credit for himself when he achieves something. He always respect us, the audience, and his team, and he is always polite in all of his videos. We congratulate ourselves on this achievement. More to come and everything to come :( =)", "I can't wait to see the HUGE amounts of MP content. No way will they push MP aside for Warzone and DMZ to encourage people to spend money on overpriced skins. This is a developer and publisher with the utmost integrity and best interests of the fans at heart!", "The fact that this man can derive humor even in the most peculiar circumstances shows how goated he truly is :-)", "battle pass system is truly.... a feature of gaming today", "This really is one of THE battle passes of all time.", "Welp! This seems to have more in 1 season than 2042 has had in 1 year. As a long time BF fan, 2042 killed it for me.", "Can’t wait to see how the blueprints will look in a closer view through the battle pass! Also can’t wait for the combat record tomorrow!", "Can't wait to unlock the Battle Bass!  0:58", "Hopefully the actual grind of earning those tokens isn't too long because this already looks far better then the normal battle pass system", "Nothing gets me more excited for a new game than knowing I have to grind out 100 levels of a battle pass. Let's go!", "As a loooong time Battlefield player, it is great to see CoD doing so well with its playerbase. Unfortunately it's not my type of game but I wish it raises the bar further and further.  In BF2042, it took us months until they announced season 1... gosh", "Other than sbmm the game is fun af.  Wish there was more casual pups without having to to tank", "I actually love this idea. I can choose what path to take without forcing to choose things I do not like first.", "We havent even gotten the full game we paid for but now we should already pay more for more content. ITS LIT CALL OF DUTY!", "that tier 100 skin takedown tho in the end", "This actually looks sick. I'm always down for something new. 1st time in a while that I'm actually excited to play MP agian.. and now that warzone 2.0 drops tomorrow I'm even more pumped. ", "Love the videos! You put so much time and work into them and they make my day better", "I mean, the battle pass idea is interesting. Can't wait to see how it plays out.\nAlso, I need to get that press backbreaker finisher move so I can make Bane quotes to my victims during executions.", "Very excited to see what is in this Battle Pass and cant wait only a couple hours away really gonna play all day tommorow", "CAN’T WAIT FOR SEASON 01 TO BEGIN ALREADY!! ", "Love the looks of this. I was SO sick of the previous system which was nothing but a playtime tracker, that was not satisfying at all and near impossible to finish for casual players. Looks like there is still some filler to go through in this pass system but at least it should feel faster and more rewarding for gameplay.", "Hmm this setup seems interesting and unique, almost like a skill tree. Be interesting to see it tomorrow with how the 50 tier boost works for all those who got that edition.", "1st season: real soldiers fighting\n3rd season: clowns and minions fighting with rainbow weapons", "7:15 that timing cannot be any more perfect XD\nI love Coryxkenshin so much, he just makes my day!", "The fact we can choose our paths now on top of not being forced into doing challenges to progress like other live service games is great. \nI want to progress from playing and nothing more. This new pathways system makes it all the more comfotable.", "Let's just  appreciate how much work and time he puts in these videos to make our day, huge respect!!  :]", "I would love for you guys to focus mainly on Multiplayer and Warzone just like you did for mw 2019. Please focus as much as you did for mw2019 if not BETTER", "I like the new concept, now I can choose things that I want to unlock first, amazing, can’t wait to try it", "I like this system, Plants vs Zombies do thus and it just works really well  looks awesome and can't wait", "I like the new system, it allows you to choose the ones u want i.e the ones with xp or weapons rather than skins or stickers ", "Each season brings new maps. What they meant to say was they will make more warzone poi’s mp maps", "Muito bom ", "Season 1, is already here, and I am hyped! Cant wait to drop in tomorrow! Into the warzone! Season 1 here I come ", "To come back to this after what happened to him and all his journeys hits so different. This series will go on as one of the best series of all time and will go down in his legacy", "This looks phenomenal! Can't wait honestly!", "It's been fun.. I love the ground war stuff.", "As a melee player , I NEED THAT BACK BREAKER EXECUTION", "man i hope the game is finished in season 1! beta 2.0 has been crazy!", "I will say I have been enjoying MW2R and I do like how you can choose what you want in the battle pass.", "I’m excited not for the battle pass but for an actual update that’ll hopefully complete the game maybe now we can look at the gold challenges and calling card and emblem challenges", "All I ask is that they have some badass mil-sim operator skins like mw2019 I love just playing as a grunt soldier hopefully they have more shadow comp outfits for mil-sim as well", "Call of duty will always be loved….forever", "Nice weapon camos, and the final skin is ", "My favorite part about cod is how my shots are clearly on the enemy but somehow miss, yet people can shoot me through my legs and somehow it counts as a head shot", "I really like this new style of battle pass progression. The old 1 to 100 tier grind was getting a bit old.", "Always liked this concept of being able to pay for each season BP by actually playing the game and earning ingame currency. No real world money involved after the initial game purchase unless you want to buy cosmetic bundles.", "To be fair this game surprised me. Was very sceptical but end up loving it.", "This is a huge step forward. Once again. Thank you IW for leading the way", "Anyone else seen the shadow company with sunglasses i hope there comes operator challenges so you can get the one with Night vision like mw2019", "Can’t wait for the dope skins down the line", "This is pretty interesting.  Reminds me of the Final Fantasy X sphere grid.", "Let's go, these skins look sick. Give us more milsim vibes!", "Ok this looks interesting, excited to see how it actually works out.", "Awesome I’ve always loved the call of duty franchise but this game was awesome and still is", "I think this is definitely a unique way to do a battle pass, I’m honestly sick of the system by now but this one is at least different enough", "I love how Roze couldn't resist putting back on the Shadow Company uniform even though it's not as bad the 2019's version.", "Excited to see how the sector battle pass system will work", "I can't wait to complete this battle pass to achieve total victory! ", "Can't wait for the 2pac operator bundle!", "I like the battle pass system. You pay to get the ability to unlock items if you lvl up enough instead of traditional paying for content and unlocking it then an there.", "Season 1 will feel like the OFFICIAL release of this game. Ive had a lot of fun thus far but can't wait for the new content to be added in!", "I wanna be able to preview iron sights on blueprints. Most of the times it's why I buy the gun", "I like how different it is! looks very interesting", "Just hoping for a Ghost skin in the battle pass so I can unlock him that way.", "I hope we can play the game just like before because my brother is worried you'll have to complete challenges in different modes to get the tokens and that might get annoying if true", "always wanted something like this because everyone unlocking the same items at the exact same time got old FAST", "I’m so excited to play warzone2, just hope I like it when I’m playing. I will not hate on the game before I have try it!. ", "Wow this battlepass system looks insane.", "New map every season? Wicked", "You have the courage of your convictions.", "Eager to see how would they implement these battlepass in warzone mobile.", "We need more maps", "I don't play Warzone but i will try Warzone 2.. Multiplayer mode is the game for me, fast, funny, and S&D.. Add demolition mode ", "This is a developer and publisher with the utmost integrity and best interests of the fans at heart!", "Best COD so far in recent years!", "This game gon be such a sucess ", "Can't wait to spend 5 hours just to unlock a single reward", "0:26 looks like the gold completion version of the Zeus operator mentioned on the website. Impressive ", "Okay, I kinda like the idea of being able to choose what to work toward. That is kind of neat.\n\nBut that can be done better by challenges like Halo 3's armor customization unlock system. Just saying...", "This Battle Pass going be very great", "Im so excited to see the shoothouse map and the new weapons", "It is so entertaining just watching the chaos that occurs when they play with each other.", "It's funny I watched this a  few hours ago wondering when COD would make an official post.", "When is the official release? Can't wait for it.", "This is one of the battle passes of all time", "Be very interesting to see we always had the old system which works but very interesting", "I love how everyone remembered the last random roles and thought you were doing the same plan. Well you work you just did it in a different way!", "Looks awesome can’t wait", "\"Victory is in your hands if you pay $10 dollars\"", "Only thing I care about is that back breaker execution ", "So instead of going through tiers you can get what you technically depending on what you play? Interesting but can't wait man hope this will maje me relive the early days of warzone the best days.", "Devs really took a look at the map in Ghost Recon: Wildlands and said \"We should do our Battle Pass like that!\"", "So getting the vault edition with 50 tier skips, does that mean all the item are unlocked and usable or do we need to play to get the battle tokens to unlock them? It has a similar system as fortnite with the stars you earn by playing", "I would settle for the rest of the game if possible.... you  know the full game ....me and millions of other players have paid for", "Não vi o Price, Ghost, Soap nenhum desses aí . Devo me preocupar?\nSerá que vão vir só por pacotes na loja, aí e sacanagem.", "Would be really cool to see the game preserve older battle passes. Making them unavailable after the season ends basically removes content ;_;", "My body is ready! PLAYTIME'S OVER MATE, YOU'LL GO INTO THE WARZONE! 1 MORE DAY BOIS ", "I took a whole week off work to grind on the battle pass even though I’m skipping half the tiers at launch. I’m excited AF!!! Let’s GO!!!"]}