{
    "video_id": "NHA_7hzhBng",
    "comments": [
        "",
        "0:54 - 1:33 Dale un like si quieres que sacen esa rola ya.\nFuerza Regida x Natanael Cano \nPorto Los Collares",
        "SALUDOS DESDE TEXAS COMPAS",
        "First pa dm me",
        "Que desmadre montaron  pero que placoson estar en esos desmadres 🫶",
        "Ojoo",
        "BORREN EL PEDAZO  D3L KNPA NATA MINUTO 13.45",
        "I’m not really a fan of this dudes but to be honest this ninja really deserves all the success get it my dude.. much love from the BAY AREA...",
        "What’s the name of the song they played in the beginning",
        "Saludazo para Armenta bien rifado ese compa!",
        "La rola que se echan al final esta bien vergaaaaaaa",
        "Primero saludos",
        "Yall look weird in the concrete jungle",
        "Primero bro",
        "Saludos de gdl",
        "I will never understand Latin culture and their need for alcohol, vanity and standing in a parking lot next to your car with all the doors open",
        "️‍",
        "Los amo️️️️",
        "Ablen en español no se entiende nada",
        "Literalmente el 99% de las personas ignoran este mensaje: “Dios guarde a tu familia y a ti de toda enfermedad !.",
        "Hagan muchas rolitas juntos por favor 🇲🇽",
        "Primer canción que cantaron en el video?",
        "El Nata sacando los prohibidos ",
        "Soy Argentino y pienso que Mexico tiene la cultura mas potente del mundo entero!!! Saludos al hermano pueblo mexicano. Respeto y admiracion.",
        "se rifaron plebes .arriva el chicanage.. y galesen otra ves pa  South central L.A",
        "Hola, gracias por venir a Washington !!! Me encantó el concierto !!! Soy súper fan! Los quería ver en LA too but sold out! Voy a estar aya desde el 21 this month! Oseaaaa que sad  pero bueno por lo menos los vi una vez.. y la verdad espero que no sea la ultima  btw love this vlog",
        "Yo la más fan ",
        "Yo quiero boletos JOP  mi amor ",
        "Fucken mayito has me weak lit ass vlog tho street mob shit",
        "J.o.P cuando pa chi town ? que tengo un don julio 70 que me esta llamando.",
        "Cual es esa cancion",
        "You got the prius pa",
        "Como se llama la musica que cantan en el minuto 13",
        "Fuerza I saw you at sac mento but you didn’t even took a pic with me I said your name but you ignored me and now they saying that you don’t like me bruh.",
        "111M llevo viendo 111 a diario",
        "Finally!!!!",
        "Alguien sabe como se llama la primera rola que cantan?",
        "Alguien sabe como se llama la canción que sale al principio ?",
        "13:33 cómo se llama la canción",
        "World wide con el compita nata   ",
        "Nataaa",
        "Como se llama la rola del minuto 12:34",
        "VENGAN A TIJUANA ",
        "amo a estos videos pura Fuerza REGIDA!",
        "Cómo se llama la rola",
        "That's right",
        "Let’s go keep the vlogs coming",
        "Wtf was that nata 7:07",
        "Pero parte de todo se van pariiba! \nNo aye duda! Animo",
        "12:50 song name?",
        "Se viene algo bien, puros corridos tumbados",
        "FINALLY A VLOG!!! WE NEED MORE JOP",
        "Come on fool  a concert on a Wednesday night no mames people work!!Pongase pilas pa",
        "La rola del min 00:56 se llama porto los collares pero aun no sale",
        "Lo volvieron a subir",
        "jesus guapo soy tu fan # 1 !!  <3 XOXO",
        "Bro come to salt lake city there's alot of fans out here now...",
        "Y’all posted this yesterday",
        "Yes, sir",
        "Wtf I live like 2 blocks away from that rancho  SALUDOS Compa JOP",
        "Soy yo oh dice JGL en el minuyo 20",
        "???",
        "Cano canta horrible",
        "I fuckin love yallll",
        "vi un comentario de un argentino y yo, también argentino coincido en lo que dice. viva mexico su cultura sus corridones y sobretodo la gente somos hermanos 🇦🇷🇲🇽",
        "AW HELL NAW THAT FOO SAID A MONRE CARLO NAW HOMIE THATS S BUICK GRAND NATIONAL!",
        "Como se llama la rola on 0:56 ? Gracias!",
        "Does anyone know the name of the song 0:57-1:33?",
        "Como se llama esa rola minuto 1:00",
        "Sete subió te falta humildad",
        "Nata,Jesús,y legado7 los mejores",
        "Pura Calle24🇲🇽 puro estado grande alv!",
        "Para que vrg invitan ese shit",
        "El grito de tu primo el mata párese que le apretaron el culo al pollo",
        "La canción que sale al principio cuando sale o como se llama?",
        "Why is that lady want a picture with the baby in her arm. Smh  that's dangerous.",
        "Alguien qué me diga como se llama la cancion del minuto 11:20 ???",
        "Me cae mal, si lo ves en la calle ignora a la gente y no te da un autógrafo, en cambio ví a Bad Bunny por los angeles California y es bastante amable el conejo malo,.  no esté mequetrefe que se cree mucho a ver cuánto te dura tu flamita famita",
        "Como se llama la cancion que cantan al principio? Cuando queda 14:27",
        "Donde estan las vijas?",
        "Ya'll got to bring him on again. \nNeta Ya'll so funny .la Tegana\nThere's nothing more sexy un ombre en Tegan pero Mas cuando el ombre es chulo",
        "Como se llama la cancion del minuto 1?",
        "Me gustaria un chingo escuchar la cansion que dice \"Otra vez en la misma cantina, mis amigos me encuentran tomando por que quiero arrancarme del alma, esta pena que me esta matando. Cantinero sirveme otra copa, para ver si la voy olvidando\" en la vozarrona del compa JOP con la Fuerza.",
        "Compas despues de un video o un concierto deverian de mandar un mensaje positivo hacia los jovenes hacerca de el pisto y las drogas.  Ya que la mayoria de sus seguidores son jovenes.",
        "Que pinxis ganas de estar ahí !!!!",
        "Damn moi couldn’t pick some pointier boots he got the hat with the biggest rim and cup too god damn  someone help my boy out",
        "Q rollo mi raza! ",
        "My future husband right there ",
        "Fierro ",
        "No hables ingles wey muy ahuevo entiendo mi propio idioma",
        "Crema y nata",
        "El lil mecos",
        "No mamen. Gringos van a escuchar sus músicas???",
        "Pensé que se estaba aguando 7:05",
        "Wat a waste of blue label kids",
        "Calle 24 ed hardy",
        "Así como se juntan a pistear juntencen para sacar canciones! ",
        "Pura fuerza regida !!!!!!! Saludos desde Stockon califas!!!!!!!!!! Arre copas !!!!",
        "No mames escucharon el gritón de nata ",
        "Ah chingao espiki da ingleesh mayo ",
        "Como se llama esa rola del principio",
        "Como se llama la cancion that they sung at the end ?",
        "Smells  the weed.. ahh",
        "I was born in LA but have 22 years in Vegas now I gotta go down there n visit my family west coast baby LA stay lit",
        "That foo said the shit is bigger than his shoe. ",
        "Cómo se llama la rolita del minuto 1:00?",
        "My 2 favorite artist",
        "Como se llama la canción que cantan al principio?",
        "Que perro me isiseron reir estoy en una puta cama con covi y mi jefe con 4 quebradas en el pie pero riendome con el cororreo del nata y pura fuerza regida un dia me va a tocar conozerlos viejones",
        "Los Tumbados ",
        "Awesome experience to hear you guys bump in the back of my house. A Toda Madre, I knew it was you guys. You guys should come more often to Hp.",
        "529 ! ",
        "Apoco el mayito ya voltio bandera con Mario el cachorro",
        "Jalados viejo es",
        "Acá tmbn los keremos a madres viejones...",
        "Los mejores alv",
        "Saludos, como se llama la canción que cantan al principio del vídeo ?????",
        "Jaja pisaste a nata o por qué chiyo así pa jajajajajaja saludos banda puro cotoreo espero me saludes en algún vídeo me dicen el chelelo de Veracruz",
        "Hihihihi haja",
        "Yeee",
        "Pura wuasa con el compa jop quería mover los carros ALV jajajajaja arre",
        "Ese Sammy looking fly",
        "Cómo se llama la última canción que canta Jesús y Nathanel?",
        "Como se llama la cancion del principio",
        "Hey wey hagan una rolita con Esteban Gabriel estaria con madres",
        "Y pura pinche regida alv ",
        "Hi cano family Juan z cano veteran in Lubbock Texas USA",
        "Dos grandeees juntos 🇲🇽como me encantan",
        "Como se llama la rola que cantaron??",
        "Como se llama la canción que cantan casi al inicio del video",
        "Un dúo diamantes estaría perro",
        "song at 0:55 ??!!",
        "Hold up when’s the concert?",
        "Fuerza regida y nata son una vrga juntos ️",
        "Antes del millón",
        "Como se llama la rola que canta?\n1:00",
        "Mandame saludos",
        "Saludos de Chicago ",
        " not the bad bunny song ",
        "Cómo se llama la canción del minuto 0:53?",
        "12:33 como se llama esta rola?",
        "Ey anyone know if they strict at crypto arena with the whole covid vax card or covid tests? Wana go see Fuerza Regida ",
        "Jop is the chalino sanchez of milleniala",
        "Alguien que me diga cómo se llama la rola del minuto 12:33",
        "Jesus,pa cuando con marca registrada?",
        "Let’s goo",
        "Saludos desde Palmdale California ",
        "Song? 12:35",
        "Ya salio ayer",
        "love you guys",
        "Teamooooi",
        "Como se llama la canción que canta sentado en la sala  con el nata ?",
        "Que rola es la qué pasa en el minuto uno? Alguien sabe raza",
        "Nata y fuerza = ",
        "7:06 ",
        "Lmaooo  I love y’all ️",
        "Nombre de la canción del minuto 1:00 por favor",
        "Algo bien ",
        "Come to my daughters 15 on Saturday gop!!",
        "🫡",
        "What song is that at 12:50, that slap was sounding fire",
        "Jesús Ortiz y natanael juntos? No me la creo ala vrga....\nEspero que sea para un álbum son unos duros.. Nmms bendiciones ️",
        "The guy with the pink Es Hardy hoodie looks Goffy Asf",
        "Como se llama la canción que sale en el minuto 1",
        "Al millon",
        "Mi amorcito jop sera un sueno realidad para concerte in Chicago but I can't go I was crying  que mi padres no mi quiere lleva to finally meet you I'm super bummed that I can't go I just wish you can make my day special for me cuz I'm a fan of you guys  I never been to a fuerza regida concert plz hook me up with vip tickets por favor it would be dream to meet you jop mi amorcito",
        "0:55 \n\nCH y la Pizza - Nata x Fuerza regida",
        "Saludos desde Madisonville, Texas",
        "Xq la borraron ayer  .todavía ni la termine de ver ..pero bueno ya esta de nuevo..",
        "Ei ei pero si le entiendes o no",
        "Algo bien.",
        "City boys trying their best to be country, interesting .",
        "La verdad Fuerza regida ya tomo el trono e escuchado a nata pero no sé cómo q el trap no le quedó  pero la música regia fue mejor 🇲🇽",
        "Por qué borraron el video ayer?",
        "Cómo se llama esa Rola",
        "Yes sir I got them tickets Foo but daum I wish I would've worked that day you recorded that clipi would've seen you right there",
        "This Is Not Even JOP Nomore. SMH ️",
        "el 23 de noviembre es mi cumpleaños :)",
        "Dam chris!  Qpaso carnalito! \nLo bueko q aye feria!",
        "Otro vlog Al puro cien",
        "Buen video\nCómo se llama la rolita del minuto 0.55??",
        "Watching it before they take it down maybe is too Lit aha",
        "Alguien sabe donde conseguir la gorra de nata?",
        "Calle 24 deserves more respect ily baby !!",
        "Como se llama la rolita que ponen al empezar el video?",
        "como se llama la cancion del minuto 1:00",
        "Those cars are fkn bad ass!!",
        "Como se llama esa canción que cantaron que en gabacho se parte el queso pa la ch",
        "Lmaooo when JOP was dancing like he had a mullet",
        "buchana ",
        "Got my tickets!!!! Can’t wait for Nov 23rd….",
        "Cómo se llama la canción del minuto 0:56? ",
        "Cuando sale esa rola?",
        "Los gritos de nata son lo mejor",
        "Agan un paro caudo vengan a chicago",
        "Imaginate que le Haiga jerrado cuando estaba tocando la tambora",
        "Alv k feo se echa los huacos el natanael jajaja",
        "Pa cuando el rolon ese seria exito total",
        "Ootroo pedoo viejon",
        "🇲🇽🇲🇽🇲🇽",
        "Que pedo con el grito del nata jajajaja ",
        "Natanel We missed you sigues siendo el mero mero de los corridos tumbados  te ves mucho mejor espero asi sigas ",
        "All im gonna say is \"it’s gonna crack\"",
        "Ayer mire este video . Que paso",
        "Hay que sacar ésa rola con el nata",
        "El Mayito  tiempo sin verlo en videos y el viejillo bien pilas #Otrooooo_Pedooooo ",
        "Otrooooo pedo",
        "Porque no avisas con deperdida 2 horas se anticipacion q van a estar en tal lado para ir a verlos!!",
        "Fuck yeah! I thought there would be no more vlogs ",
        "Saludos desde Tijuana ",
        "SALUDOS DESDE DOMINICANA ",
        "Como se llama la rola en el minuto 0:57",
        "I’m trying to buy the tickets for nata and I can’t find anything on the tickets",
        "Fuego El Video Compa",
        "Primeritaaaa",
        "Cual es la cancion que cantan en el minuto 1:00",
        "REGIDA SALUDO DESDE NEW JERSEY DOMINICANO ",
        "Fuck yea!!!! Keep that dope shit up 🇲🇽  Nata",
        "Saludos JOP you are the best!",
        "Bruh no mms dnt tell me yall doi g your nails tooo?? Ya valio verga",
        "Alguien sabe el nombre de la canción de minuto 12:35 ?",
        "12:33 cómo se llama la canción?",
        "Arriba la mota",
        "El compa mayito",
        "como se llama a cancion del 1.6",
        "Alguien sabe como se llama la canción que suena cuando están en la camioneta? O apenas va a salir?",
        "Los gritos del nata xDD",
        "We missed u in Dallas Tx ,  You need to come more often to DFW Texas !!!",
        "Como se llama la rola que están cantando al principio algui q me diga porfa",
        "Badass my boy",
        "Alguien sabe, de casualidad.. si la canción que está cantando jop en el seg. 55 ya salió y como se llama saludos!",
        "Alguien me puede decir donde será ese evento que mencionan en el minuto 9",
        "Fuerza regia asle un hijo Ami bieja",
        "Como quisiera cantar con Ustedes viejones es un sueño bien perseguido.",
        "I went to your Austin show and put a sign on my phone that it was my birthday and you never saw it ",
        "Como se llama la rola que le cantan a Jimmy? Esta perrona!",
        "28 seconds ago",
        "️",
        "Xd",
        "Se me antojo Un Pase y un Wishkilucas",
        "En donde se puede comprar la t shirt que trae el compa juanpa?",
        "Compaaa jesus estilaso que tiene unico,cuando tenga dinero con el favor de dios me hare de un sombrerito de los que usa un sueno",
        "️️️",
        "Minuto 10:56 -Tu date morro",
        "7:06  el grito de bátale cano oh era una gallina",
        "Love that he has the hood vibe of IE buts also Mexicanoooo 🇲🇽",
        "missed the vlogs",
        "0:58 como se llama la rola?",
        "Hablen en español locos.. Chingo de Mexicanos y latinos que no entendemos el Inglés ",
        "It would be cool for you to go to a town in Texas (Terrell go there high school lol)",
        "What were they drinking out that bottle",
        "eyyyyy ese nata ta wey ",
        "AAYYY ",
        "Cómo se llama la primera canción que estaban cantando?",
        "Ey ey pero si mandan saludos o no ?",
        "Hola",
        "Fierro",
        "Pasados verga ",
        "Cuál es la rolita de los collares?",
        "como se llama la cancion que pusieron al empezar",
        "Estuvo a todos dar la neta compa ",
        "Reupload",
        "First",
        "7:58 poor little girl  and the lady asked too.",
        "Nata la caga",
        "Here fr",
        "Song 13:33 ???",
        "W habla en español cuando hablas ingleison nomas sonrío ",
        "Alguien sabe cómo se llama la rolita que inicia en el segundo 00:56",
        "What’s that song called 0:59",
        "Awebo ese pinche nata así se ve mejor a toda madre",
        "I swear Fuerza Regida gonna make a collaboration with Bad bunny maneeeeeee lol \nFuerza REGIDA X Bad Bunny ",
        "Que canción es la que traen ??en la troca en el min 1:00 empieza",
        "🇺🇸🇲🇽🫡",
        "Cómo se llama la última rola",
        "Como se llama la canción 00:56?",
        "12:33, name of the song? To drop soon or what? Vamonos! Mexico!",
        "Gosh, JOP love your personality, not so much the drinking.  Anyway, first generation camaro is the way to go usa muscle baby",
        "You going to be in LA live on  26 is it for free or you need to reserve tickets?",
        "Es todo pura fuerza regida. ",
        "Nata y Jimmy juntos?",
        "Alguien sabe como se llama la primera canción que canto fuerza regida la primerita cuando empezó el video casi, si alguien sabe me puede decir el nombre",
        "Xq hablan en inglés si su música es en español??",
        "Whats the name of the song in 1:04",
        "Cómo se llama la rola que está casi a lo último, ",
        "Name of the song ? With nata",
        "Todo estaba bien asta que llego el nata xq lo invitaron guacala",
        "Ese nata como baila ",
        "1:00 Como se llama esa Rola ??",
        "Alguien sabe como buscar la rolita del mimuto 11:20 ??",
        "13:17 como se llama la rols",
        "Fuerza Regida vengan a Luisiana",
        "Primero",
        "Saludos cordiales",
        "Como se llama la rola que tocan en el minito 12:39",
        "7:05 when you mentally challenge you laugh",
        "Padrino toys ",
        "Como se llama la rola 1:05?",
        "Y Pura fuerza Regida y Natael Cano uaaa     ",
        "7:05 ",
        "Esa rolita va estar con todo",
        "Ahuevo la unidad es mejor Arriba Mexicoooooo",
        "Como se llama el canción 1:00",
        "Yo I watched this already what’s going on",
        "I think they’re performing on November 23rd at the crypto arena, not sure ",
        "Esto tiene que salir ",
        "Que canción es la que cantan al principio ?? Por fa",
        "Lo volvieron a subir vrd?",
        "Que perrona la rola pa",
        "Mexican hasbula",
        "Fire video",
        "Ami niño le encanta  FUERZA REJIDA Y NATANAEL CANO .. ..  le encanta cantar , es un niño especial . Le encantan sus canciones , y en mi casa somos del AMERICA Y YO  por el los conosi",
        "Que ch1ng0n sonó árboles de la barranca de mis rollonones favoritos ️",
        "Donde va estar en el 26 ?????",
        "Enfoquen bien con una buena camara no mamen tanta plata",
        "Desde mi bella Colombia....viva MEXICO  Hey tú, el que está leyendo este comentario con la mente, que Dios te bendiga siempre y que nunca les falte comida y agua, Amén ",
        "Pura fuerza regida compa🇲🇽",
        "Me gusto El grito de nata se olle como cuando le pissan El pie Al perro",
        "te amo nata",
        "00:55 song name?",
        "El Corrido de Chuy Y Mauricio  Junto a NATANAEL CANO con vídeo así como el original pero ACTUAL quedaría mamalon",
        "Que cancion es la que cantan en el min. 1:00 ???",
        "Que onda con el grito de nata  ",
        "Them boys always lit and active haha  Natanael cano ",
        "Saludos",
        "Both concerts were fye ",
        "Standby for Diego Nata and JOP to really cook them songs boy\nThey ain’t ready",
        "Love you babe ",
        "We up there nov 23",
        "Los amo y arriba los corridos tumbados",
        "Más blogs así ️",
        "brother natanael cano and fuerza regida  a good collaboration los 2 cantan muy bien apa",
        "Y pura fuerza regida otro pedo",
        "Cómo se llama la rola que cantan al último",
        "Nada vale puro cheetos",
        "Los sigo desde Uruguay, desde que me levanto hasta que me acuesto ️🇺🇾️",
        "Y si me regalan una gorrita por ser fiel seguidor",
        "on meeeee this video came out yesterday lmaooooo",
        "Como se llama la camcion que cantan al principio?",
        "…",
        "Un foto jaja  7:55",
        "Lost in the sauce poor dude he doesn’t even know what to do",
        "Como se llama la canción al principio",
        "Ayyy",
        "These foos went from making their own songs to being cover artist",
        "El que piso el perro es nena",
        "Pinche cano se la mamo con el grito Al @ 7:07",
        "Nombre de la rola minuto 12:33",
        "12:32 y’all better finish an drop",
        "Algo Bien ",
        "Esa pinché rola , va a pegar macizo!!!",
        "Q ganas de ir a un concierto de fuerza regida pero no hay con queso ",
        "Alguien que sepa el nombre de la primer rola que cantan?",
        "BENDICIONES HERMANOS DIOS los  BENDIGA      y les de salud para que sigan asiendo música que en estos momentos es lo único que me sube el autoestima Dios los proteja siempre ",
        "Que buen video ",
        "nombre de la rola de 12:35",
        "Fuerza Regida out there living the life! much love homies! que le siguen con mucho exito!  still waiting for yall to come to Florida! we waiting for yall",
        "Los gritos del nata jajaja saludos bro ",
        "13:40 anda periqueando el Nata?",
        "Como se llama la rola que estaban cantando en la cullinan?",
        "Todo lo que le han echo ganar al himmy",
        "Estaria perron una rola de calle 24 y natanael cano",
        "Wtf?",
        "12:33 when does it drop ",
        "Los gritos de nata haha ",
        "Love your guy's vibes!! Al Cien 100%!",
        "pa buenos los santos...",
        "7:09 , bro wtf come on nata ",
        "Con razón llegó alterado al MTY jejeje",
        "Uf esos jordan del nata me gusta tener unos pero valen entre 3,000 a 2,000 dólares",
        "el DIEGO de calle 24 aperillando al NATAEL diciendole MORRO JAJAJAJAJ alv",
        "Almost time !!! Driving 4 hours to see u guys  peda seguraaaa",
        "Son la mera mera avena EEEAAAA pura lumbre compa jop y nata",
        "what song is that??? en el gabacho se pata el queso????",
        "The fuerza is strong pa!",
        "Sheeesh I got my ticket already counting down the days hours minutes and seconds. ",
        "Compa nata",
        "Eres mi fan número uno",
        "Cómo se llama la canción del minuto 57?? Porfavor",
        "Nata bailando ",
        "Nata is chill he came a long way respetos al compa nata",
        "Me encantaría visitar México, saludos desde RD 🇩🇴!!",
        "Si es un video para mexicanos, hablen español",
        "Cómo se llama la primera rolaaaaa.",
        "Soy de jalisco pero tengo ya mis años aquí en ciudad Juárez Chihuahua pero me gusta mucho su música ánimo amigos y bendiciones siempre...se la rifa como cantas amigo bendiciones...",
        "Cómo se llama esa rolita que cantan en el minuto 1:00 suena perrona ",
        "Saludos desde Houston ",
        "️#JOP️‍COME TO LYNWOOD CA",
        "Botas y un sombreron perro corridon",
        "Saludos desde la o para mi compa Jesús aquí tamos pa lo que sea fierro mi regida ️",
        "Omgggg finally they do a volg I miss these. . He use to make my dad better",
        "Marketing fucking genius puro san berna",
        "Saludos desde tepa Jalisco",
        "La peua b........ pura fuerza regida #1 saludos desde Southaven Mississippi compa",
        "Fly me out for my birthday, im in texas🥹",
        "When are y'all coming down to the rodeo Texcoco, don't forget about us on this side of Mexico",
        "love seeing sammy more open and talkative , the man is a beast on the requinto",
        "7:05 Natas grito ️",
        "El regreso del sombrero y botas 🇲🇽",
        "Cómo quisiera que volviera a Aguascalientes 🇲🇽",
        "What’s the Song name on  12:34",
        "Eso significa que la rola ya  no tardaaa",
        "Por qué Moisés es tan tímido para hablar en cámara? Jaja\nSaludos desde Colombia 🇨🇴️, siempre escuchándolos",
        "Nombre de la rola \n00:54",
        "Yeeee first like let’s run it from SFV 818",
        "Gritazo del compa Nata 7:05 ",
        "Y el Ovi onta?",
        "Yo compre mi boleto el dia despues del Anaheim show en chingaaa ️Floor seat and I’m going by myself!! PURA FUERZA REGIDA Y STREET MOB RECORDS!!",
        "Como se llama la rolita q ponen en el min 11:20  alguien sabe xfr",
        "Minute 7:05 nata seagul Mexican grito",
        "That's right homie.... Keep making them sick ass ROLAS my boy ️",
        "Cómo se llama la rola del minuto 1:00 ?",
        "Can’t wait to see you on the 23rd . Spending my dads 3rd  heavenly bday watching you live. Instead of home crying I thought it was best to go see you guys. Pr04 row 1 seat 13 I’ll be there",
        "primero",
        "Que Royo",
        "Need some tickets  for Fresno dec 10 please it’s my birthday  🇲🇽🇲🇽la manzana ",
        "Nombre de la canción min 1:00 🫡",
        "Y el Junior H???",
        "Santería que casi nadie trae - alguien sabe el nombre de la canción?",
        "Voy hacer como que no lo he visto ",
        "Nata sounding like Kawhi Leonard cuando se hecho el grito  still love him though",
        "Como se llama el corrido del inicio 0:56?",
        "Y el Tony Herrera onde lo dejaste jp",
        "Jopppp",
        "como se llama la cancion del minuto 0:58 al 1:32",
        "Can’t wait Chi-Town December ",
        "I miss the jop vlogs",
        "5:48 aaaaaYOOOOOO",
        "Como se llama la canción que estaban cantando al principio del video en la RR",
        "Saludos desde Guatemala mi compa",
        "Alv los piso a todos",
        "Y PURA FUERZA REGIDA  OTRO PEDO",
        "Again",
        "Hora j o p que rolo",
        "Tomando blue label como shots ",
        "Esto va a hacer tendencia número 1 ahuevo viejon que si",
        "El mas duro pura boca regreso a rancho y jop pa volver a oirse",
        "Jop pa u needah hurry up and put 911 on Spotify mah boi",
        "Me encanta este chavo cómo promueve su honda!",
        "regálame unos tickets pa cuando vengas al El Paso viejonn ,#purafuerzaregida",
        "Damn missed you when U all were in TXin October, from the I.E. (Rialto) y todavía no se me a hecho el Gusto en conocerlos  one day though",
        "Deberían de hablar español somos mexicanos no gringos",
        "Alguien sabe cuando sale esa rola con nata?",
        "Shut out to Adrian the moro you saw in the streets of HP PA 3:36 put him in one of your videos he got carisma.",
        "La rola que suena en minuto 0:55 como se llama",
        "La clica is in the house",
        "Otroooo pedo",
        "This guy tries way too hard in my opinion",
        "Re upload? Or am I having dejavú??",
        "Qpedo porq no abla español solo para comer de la musica latina",
        "Who knows what kind of hat JOP has",
        "Austin Texas!!",
        "Noooo lo he visto y ya se que será un videazoooo! ️‍",
        "Yoooo first",
        "Ah ta mas malo que la brg... el.nata jajaja Cagado de risa",
        "Come to south Dallas pa",
        "Póngale subtitulos",
        "Holaaa, primera, saludos. ",
        "11:33 el baile del nata ",
        "What song is 12:37 ?",
        "Pura fuerza regida viejon... Que machin esta todas las rolas ....Desde aqui de Tucson viejon",
        "Saludos Desde KansasCity Fuerza ",
        "Saludos desde TJ al compa Mike Armenta",
        "XK arman algo en México ",
        "Vine a ver a Compa  Nata",
        "Todavia no sale esa cancion? 12:35",
        "Yo tam bien cunpro Ayos emelim cunpro el 7 de noviembre",
        "You've been such a good boy smiity sometimes i wonder how much of a good boy youve been lately",
        "0:58 la canción ?",
        "El pelón llevo a JOP con el babalawo pa que le pusiera los collares",
        "I love your music/life videos please post at least 1x per week. We miss JOP blogs but these blogs are fire too ",
        "So I’m wanting to start listening to music like this. Not sure what genre this is considered but any suggestions on Mexican artists I should listen to??",
        "Clowns ",
        "Otro pedo",
        "Pura pinche plebada de ambiente Pura lumbre plebes un saludo a todos desde Reno nevada ",
        "Esta muy perra la rolla ",
        "Mucho vato y ninguna morra .......",
        "Cual es la canción que suena en el min 1:00",
        "Al compa mayito nomas le falto su compa \"mario el cachorro delgado\" ajuaaa ",
        "Saquen esa rola se escucha de awevo",
        "Esa de JGL estaría bien con la doble P",
        "Se vienen corridos re buenooos",
        "Necesito la gorra del compa nata ",
        "Alguien sabe cómo se.llama la canción que cantan en el minuto 12:35",
        "I need a ticket and leave alone to his concert lol too bad in far away in Texas",
        "como se llama la rola? 1:11",
        "Nata",
        "jop start vloging on ur youtube channel again",
        "Long time no see jop",
        "Habla más español we, somos más  latinos los q vemos tus videos vato",
        "Buen ambiente",
        "Greetings from Mexico Jesus  Pura fuerza regida otro pedo.!",
        "Como se llama la canción del s55?",
        "Wtwwwwww viejon",
        "Marketing at its finest like it",
        "Que viva Mexico cabrones ",
        "Ta perro el nata pa echar gritos",
        "Puro cara de NOPAL hablando inglés, que curiosa es la vida. "
    ],
    "comments_disabled": false
}