{"video_id": "NHA_7hzhBng", "comments": ["Soy Argentino y pienso que Mexico tiene la cultura mas potente del mundo entero!!! Saludos al hermano pueblo mexicano. Respeto y admiracion.", "0:54 - 1:33 Dale un like si quieres que sacen esa rola ya.\nFuerza Regida x Natanael Cano x Juan Salazar x Calle 24 ", "Hey wey hagan una rolita con Esteban Gabriel estaria con madres", "Estuvo a todos dar la neta compa ", "Desde mi bella Colombia....viva MEXICO  Hey tú, el que está leyendo este comentario con la mente, que Dios te bendiga siempre y que nunca les falte comida y agua, Amén ", "Así como se juntan a pistear juntencen para sacar canciones! ", "Esto va a hacer tendencia número 1 ahuevo viejon que si", "Hagan muchas rolitas juntos por favor 🇲🇽", "El Nata sacando los prohibidos ", "Es todo pura fuerza regida. ", "Me encantaría visitar México, saludos desde RD 🇩🇴!!", "Esta muy perra la rolla ", "Los gritos de nata son lo mejor", "Dos grandeees juntos 🇲🇽como me encantan", "Cómo quisiera que volviera a Aguascalientes 🇲🇽", "El regreso del sombrero y botas 🇲🇽", "Noooo lo he visto y ya se que será un videazoooo! ️‍", "Pura fuerza regida compa🇲🇽", "amo a estos videos pura Fuerza REGIDA!", "BENDICIONES HERMANOS DIOS los  BENDIGA      y les de salud para que sigan asiendo música que en estos momentos es lo único que me sube el autoestima Dios los proteja siempre ", "Los amo y arriba los corridos tumbados", "Soy de jalisco pero tengo ya mis años aquí en ciudad Juárez Chihuahua pero me gusta mucho su música ánimo amigos y bendiciones siempre...se la rifa como cantas amigo bendiciones...", "Almost time !!! Driving 4 hours to see u guys  peda seguraaaa", "Pura fuerza regida viejon... Que machin esta todas las rolas ....Desde aqui de Tucson viejon", "love seeing sammy more open and talkative , the man is a beast on the requinto", "Pura pinche plebada de ambiente Pura lumbre plebes un saludo a todos desde Reno nevada ", "Hola, gracias por venir a Washington !!! Me encantó el concierto !!! Soy súper fan! Los quería ver en LA too but sold out! Voy a estar aya desde el 21 this month! Oseaaaa que sad  pero bueno por lo menos los vi una vez.. y la verdad espero que no sea la ultima  btw love this vlog", "Que desmadre montaron  pero que placoson estar en esos desmadres 🫶", "Esto tiene que salir ", "Love your guy's vibes!! Al Cien 100%!", "Los sigo desde Uruguay, desde que me levanto hasta que me acuesto ️🇺🇾️", "Pura fuerza regida !!!!!!! Saludos desde Stockon califas!!!!!!!!!! Arre copas !!!!", "Más blogs así ️", "se rifaron plebes .arriva el chicanage.. y galesen otra ves pa  South central L.A", "Awesome experience to hear you guys bump in the back of my house. A Toda Madre, I knew it was you guys. You guys should come more often to Hp.", "Que pinxis ganas de estar ahí !!!!", "Y Pura fuerza Regida y Natael Cano uaaa     ", "Jesús Ortiz y natanael juntos? No me la creo ala vrga....\nEspero que sea para un álbum son unos duros.. Nmms bendiciones ️", "Son la mera mera avena EEEAAAA pura lumbre compa jop y nata", "Me gustaria un chingo escuchar la cansion que dice \"Otra vez en la misma cantina, mis amigos me encuentran tomando por que quiero arrancarme del alma, esta pena que me esta matando. Cantinero sirveme otra copa, para ver si la voy olvidando\" en la vozarrona del compa JOP con la Fuerza.", "El Mayito  tiempo sin verlo en videos y el viejillo bien pilas #Otrooooo_Pedooooo ", "El Corrido de Chuy Y Mauricio  Junto a NATANAEL CANO con vídeo así como el original pero ACTUAL quedaría mamalon", "Algo Bien ", "Yo compre mi boleto el dia despues del Anaheim show en chingaaa ️Floor seat and I’m going by myself!! PURA FUERZA REGIDA Y STREET MOB RECORDS!!", "SALUDOS DESDE DOMINICANA ", "That's right homie.... Keep making them sick ass ROLAS my boy ️", "FINALLY A VLOG!!! WE NEED MORE JOP", "World wide con el compita nata   ", "Los gritos del nata jajaja saludos bro ", "Que buen video ", "Nata is chill he came a long way respetos al compa nata", "Ese nata como baila ", "Fuerza Regida out there living the life! much love homies! que le siguen con mucho exito!  still waiting for yall to come to Florida! we waiting for yall", "Fuck yea!!!! Keep that dope shit up 🇲🇽  Nata", "Saludos JOP you are the best!", "Esa rolita va estar con todo", "Saludazo para Armenta bien rifado ese compa!", "Eso significa que la rola ya  no tardaaa", "Q ganas de ir a un concierto de fuerza regida pero no hay con queso ", "Gritazo del compa Nata 7:05 ", "Se vienen corridos re buenooos", "11:33 el baile del nata ", "El mas duro pura boca regreso a rancho y jop pa volver a oirse", "Let’s go keep the vlogs coming", "Sheeesh I got my ticket already counting down the days hours minutes and seconds. ", "Lmaooo when JOP was dancing like he had a mullet", "Por qué Moisés es tan tímido para hablar en cámara? Jaja\nSaludos desde Colombia 🇨🇴️, siempre escuchándolos", "Greetings from Mexico Jesus  Pura fuerza regida otro pedo.!", "VENGAN A TIJUANA ", "12:32 y’all better finish an drop", "Saludos desde Tijuana ", "Them boys always lit and active haha  Natanael cano ", "Nata y fuerza = ", "Más blogs así", "regálame unos tickets pa cuando vengas al El Paso viejonn ,#purafuerzaregida", "Y pura pinche regida alv ", "Se viene algo bien, puros corridos tumbados", "Omgggg finally they do a volg I miss these. . He use to make my dad better", "Lmaooo  I love y’all ️", "Pinche cano se la mamo con el grito Al @ 7:07", "La peua b........ pura fuerza regida #1 saludos desde Southaven Mississippi compa", "Esa pinché rola , va a pegar macizo!!!", "Acá tmbn los keremos a madres viejones...", "Saludos Desde KansasCity Fuerza ", "La rola que se echan al final esta bien vergaaaaaaa", "Saludos de Chicago ", "Cómo se llama esa rolita que cantan en el minuto 1:00 suena perrona ", "Fuerza regida y nata son una vrga juntos ️", "Saludos desde Houston ", "The fuerza is strong pa!", "Nata bailando ", "Love that he has the hood vibe of IE buts also Mexicanoooo 🇲🇽", "Saludos desde Palmdale California ", "Can’t wait Chi-Town December ", "Got my tickets!!!! Can’t wait for Nov 23rd….", "Pura Calle24🇲🇽 puro estado grande alv!", "love you guys", "🇲🇽🇲🇽🇲🇽", "Jalados viejo es", "Algo bien "]}