{"video_id": "Nqq_XJ2kVkU", "comments": ["Huge thanks to Alpharad: https://www.youtube.com/@Alpharad\n\nand Sarah: https://twitter.com/sarahnatochenny\n\nARE THERE ANY GIBLE PRONUNCIATION TRUTHERS IN THE COMMENTS", "Ash finally learned how to evolve his Pokemon and immediately won the Championship, he was just holding back his own overwheming power to give others a chance what a nice guy", "Can't help but agree. The fact he won with his new team and not his last one is just an insult. He should 100% have won back then", "Ash’s Snorlax is so versatile it can use more than four moves in a battle!", "An interesting fact about Ash's snorlax is that it is his only pokemon with a positive  K:D ratio, meaning that it has knocked out at least one pokemon every time it's been used.", "Your editor is actually insane, all of those lil edits, memes n stuff sprinkled ontop made this analysis of ash's team so much more enjoyable. Give them a raise LOL", "That Alpharad guy seems so smart and full of good ideas, what a guy. Ash's Lily of the Valley team was Infernape, Gliscor, Staraptor, Torterra, Buizel, and Pikachu. Tobias battle was more of a \"how can I beat Darkrai\" kind of team. Would definitely have wanted to see that as part of the analysis although feel as though it would be at the same rank. And it may be helpful to note that Ash's Pikachu has the unique defensive quality of being almost totally immune to ground and rock-type moves, because it can just jump over them", "Ash becomes world champion only after Mr. Fish becomes a part of his team.\n\nCoincidence? NO. ", "I wish you would have included the Orange Islands team. It was his first full 6 Pokemon team, and he had Tauros in Gen 1. Plus, he actually won against an undefeated champion in Drake. Sound familiar?", "I’m really curious where you’d put Ash’s team against Paul, since that was the team he used through the majority of Sinnoh and the battle with Paul was by far the most important battle in the entire season", "After 25 years, ash finally become the legendary winner, what a great hero.", "His Pokémon in indigo league conference isn't only those Pokémon, he used many different teams that contained Pokémon like Muk and Kingler, and those help a lot so if you forgot about that then there you go.", "It's a shame the team he used for his exhibition match in Alola wasn't counted as the battle against Kukui felt like the actual \"championship\" match. I think it would have been his strongest or at least a very close runner up. Melmetal, Naganadel, Incineroar, Lycanroc (and Pikachu and Rowlet yes).", "Seeing all of Ash’s Pokémon in pikachu’s vision was so heartwarming, could’ve teared up seeing the first 6 together", "I feel like this should be redone using the strongest team from each region, rather than the team he lost/won with. Because a lot of the time there's much stronger teams he used in previous battles in the tournament", "Ash winning 3/8 tournaments he enters is not bad at all.", "The way Wolf just... butchers names is unreal, Nibble Bite and Chomp, but the man says Guh-EYE-bul", "Judging from the stats of his league teams, Ash's playstyle focuses on speedy attacks.", "You forgot to mention that Ash's Swellow, in particular, doesn't have the species normal weakness to electricity, in fact it seems to have a resistance to it if Ash's Thunder Armor strategy was anything to go by. The reason he caught it in the first place was because it took Pikachu's Thunderbolts like a champ!", "Your delivery in these scripted videos has gotten so natural. I feel like you've really nailed the balance between the personality that made your older videos so appealing and a more focused structure that gets your point across concisely. I will always be an hour-long bagel intro fan, but it's been amazing to watch you grow as a content creator over the years.", "Great video.\nNow I find myself wondering what it would look like if Ash ever made his ultimate team, the best of every pokemon he's ever owned. I'd love to see a video analyzing what could be his perfect team comp.", "It is amazing you actually got Sarah to do a bit of a cameo in your video. Also this video is amazing and I really enjoyed it. It almost seems like low hanging fruit to do something like this, analyzing Ash's teams, but you really did your research and gave some excellent reasons and all that, and because of that I couldn't take my eyes off the screen.", "The fact when wolfey pronounce gible as JAYBEL, had me choke", "Words cant describe how much I love this collab :-/", "It could be seen as him maturing as well: he's able to evolve his pokemon because he himself has grown and evolved.  In Kanto he had the potential but not the fully devolped skills or knowledge to go too far.\n\nEight (and a half) regions later, however, he is far better and more able.", "Who else died inside when Wolfey said “Gai-bel”", "05:35 Let's just appreciate how much effort and time he puts in these videos to make our day huge respect!", "Congratulations Ash Ketchum, you are finally the best like no one ever was.", "“A level 100 pikachu can still lose to pigey” killed me", "Honestly, I would've ranked Alola's team based on his full party of 6: Pikachu, Rowlet, Torracat, Lycanroc, Melmetal and Naganadel. After all, even if the final was a 3v3, the REAL final battle was the 6v6 against Kukui. I think that would be more fair as a whole, especially considering that he draws from that team of 6 when battling in a 3v3 anyway.", "my boy went from using 2 unevolved starters to becoming the strongest trainer IN THE WORLD. What a beast", "Honestly would've preferred it if you used the team he used against Kukui instead of the one he used against Gladion.", "Now you’ve got me wondering what the best possible team was that Ash could have assembled every league based on all his Pokémon caught (and mostly favoring ones from the region he was in)", "I think it would be cool to see how these rankings would change if Ash DID fully evolve everything. Pretty sure world team would still be the best since ya know, MR FISH, but still. Nice vid wolfe!", "The editing on this video is phenomenal. You deserve every one of your subs Wolfey.", "I think that evolution in the anime works more similarly to the real life evolution, where a Pokemon evolves under extreme situations\nWhich might explain why Ash never evolved some of his pokemon", "How much different would this be if he had all his pokemon on the squad that he had in the region? For story purposes he wasn't able to use all of em. Ps. favorite gible moment was shuckle draco meteor", "I feel like you should have used the team ash used against Paul than the one he used against Tobias. It's by far his most iconic sinnoh team", "Wonderful as always! One thing I'd love to see is you going through Ash's box and making your own best team.", "this video came at such a perfect time. I was just having a debate with my friends about ash's teams throughout the years. Love seeing the channels growth Wolfey", "Really cool to see how Wolfe has grown as a YouTuber. A year ago this would be a non-prepared 40 minute VOD of him scrolling through Serebii (which has its own charm tbf). But in traditional YouTuber standards the vids have gotten so high quality recently ", "Ash winning was so wholesome!", "This is a cool idea. I would love to see a similar video about teams Ash used in his final rival battles of each region.", "Bayleef getting compliments defensively from wolfey was what i needed to hear today", "Nice to see someone appreciating torkoal. I've tried coming up with turtle teams in the past and torkoal has always been a solid choice.", "There’s an alternate universe where the Wolfey Bayleef is a humongous meme in the Competitive Pokémon Community", "I loved the editing on this video so much, my one small suggestion is when you bring in cutout wolfeys, its very disconserting that their mouths dont actually move. I loved how much everything moved and flowed, the jokes hit and I was never bored overall loved the editing, keep up the great work!", "one of the best thing about dude is that he never takes credit for himself when he achieves something. He always respect us the audience and his team, and he is polite in all his video's we congratulate ourselves on this achievementvh", "I think a video on how you would improve each of Ash's teams without fundamentally changing them too much would be really cool, like you hinted at at the end of the Unova section.", "I think Ash's teams are indicative of his focus on speed and attack rather than bulkier defensive postures.", "I'd be curious to see if any of these rankings change if we go only off of the moves and abilities the Pokémon actually had during the matches, although I know we're not always given all of that information. If what I remember from the anime is anything to go by, Ash's Pokémon tend not to have the most...balanced movesets.", "Alright, but what is the best Ash COULD have brought to each championship battle?", "For the Manalo Conference, what do you think about Ash's team that he used in the Exhibition Match against Kukui? It consists of Pikachu, Rowlet, Incineroar, Lycanroc, Melmetal, and Naganadel", "You should do a video about theoretical sets using Terastalize. One Pokemon I'll definitely use is Aurorus. Another interesting one I heard about is Fire types Gastrodon.", "What makes the Alola cup kinda funny is that while yeah Melmetal, Pikachu, and Lycanroc were in that final team, his backups were also Incineroar and Naganadel. Wow ground just wrecks that team", "If we ranked it based on ashes full alola team vs kukui it'd be a landslide. Rowlet is simply too powerful", "I recently subscribed as your delivery and content has matured over the years and I appreciate the professional approach.  Good luck this generation Wolfey!", "Editing is top tier. Loving the content!", "Love to see Ash FINALLY WIN! Great content Wolf!", "use ash team and get rank 1", "ngl i really like how ash doesn´t just have the best possible team with max. evolved mons. like you see those enough playing the games so it´s cool to see other pokemon getting some love", "Can you do a video about the tools you use to compare these teams. Your videos are awesome and there are some screenshots in this one that are unique to team building, and I'd love to see some of the tools the upper echalon of pokemon players use to quickly and effectively compare something like this.", "Ash really liked waiting for a long cutscene and pressing B for every level earned for almost every Pokemon back in the days didn't he?", "The pilot reference and the slaking when talking about swallow was great I’m surprised I didn’t see anyone else mention it", "You probably get this comment a lot but your singles commentary videos are fantastic and I'd love to listen to more of these. As someone dipping into the toes of competitive its much easier to digest your commentary and your breakdowns than someone like PokeAimMD for example. Not only are these well edited, they're funny and have great scriptwriting behind them which I really do appreciate and wish more Youtubers would follow through with", "I’m curious what you think about some of the other teams ash uses in earlier rounds of these tournaments like his pikachu, infernape, torterra, staraptor, buizel, and gliscor team in the lily of the valley quarterfinals", "Loved this,  would've liked an even deeper analysis including move choices/critiques.", "That swellow pilot cameo was amazing. Especially considering slaking took him out. IYKYK", "Wolfey and Alpharad's seemingly random friendship over Mr. Fish existing has blossomed into a rad Memeship. Now when do we get Wolfey/Alpharad Co-Op Nuzlocke challenge together in Scarlet/Violet?", "I love the content and I start to love competitive pokemon now wolfe.", "To the Alola League one, you could have used the one from the battle against Kukui, because it's a full team, it is almost part of the league and it kinda has Inceneroar", "A video of you using all of Ash's teams would be cool!", "It's a pet peeve of mine when someone says ash doesn't evolve his pokemon. Like... Its weird how people seem to completely ignore the fact the pokemon arent forced to evolve in the anime, or really in the games unless you use a stone or trade item or whatever. The pokemon have a choice wether they want to evolve or not, and in the game mechanics you have the option to not allow then to evolve because its just built in that they do at a certain stage (for the most part)", "Holy crap the Slaking coming for Pilot the Swellow had my dying. Truly perfect.", "Video idea: how competitive Pokémon battles would be if every Pokémon had same stats (no stronger or weaker Pokémon)", "I have an idea. How about you build the best possible team from all pokemon Ash ever used? It's up with you if you want to use pokemon he didn't actually captured.", "Props to Wolfey for actually adding a segment for Ash's latest league team despite recording this video months before it even existed", "Corphish has 80 base attack and adaptability boosted aqua jet so it’s actually not completely worthless as a revenge killer, you can even slap a choice band or focus sash on it", "So 2 questions. How much would these teams change positions if you consider the moves that Ash had on his Pokémon instead of just what they can learn?\n\nWould you do a video about Ash's best battle frontier team?", "I started re-watching the series and I am now in BW and that is when I remembered that all of his Pokemons at that time were weak. Also, I do not know why but almost all of Ash's Pokemons evolve, not because of getting EXP, but because of survivability. So his Pokemon during the BW series did not experience tragic situations where they need to evolve.", "Even though the Indigo league was 3v3 matches, Ash used all his pokemon troughout the tournament, you should 100% have gone over them all as a team instead of just 3. Same with Alola.", "i'd love a short vid on your second channel about why unfeazant is the worst! sounds interesting and it was always on my black and white team as a kid lmao", "I'm just still in awe that he finally did it. I'm just so happy he finally won and became the very best like no one ever was. From the vision pikachu had of all of Ashs pokemon to the first ever theme playing to Ash turning his hat backwards. The best episode of pokemon ever. Made me cry like a baby.", "If alolan ash had his whole team it would be incredibly good", "You forget Ash can just attack the environment and change types of any Pokémon as well give himself a field spell boost", "Including all anime leagues, there should also be his Orange Island team of Pikachu, Bulbasaur, Charizard, Squirtle, Lapras and Tauros. I'd estimate it'd probably make it either just above or below his Silver League Conference team (largely dependant on how we're factoring in the prominence of Gen 1 Tauros based on the rules).", "What would be the most competitively viable team of 6 out of all the Pokémon Ash owns or have owned?", "this breakdown was interesting but the problem as far as his team wasn't because he refused to evolve them, they just chose not to but the wrong choice he ever made was including them in the league battles.", "I really think for Kanto and Alola teams the versions of full battles (vs Drake and vs Kukui) should have been used", "2 months of casually watching videos from you. Finally subscribed  definitely earned with great content", "I used to use his Orange Islands team on Pokémon Showdown, it's pretty solid; except for Squirtle and Bulbasaur not being evolved.", "I love the JN team. His best team ever ️", "Corphish was a beast in Hoenn. It won Ash a lot of important battles.", "Could definitely use Ash's final team on the ranked ladder for some free content.", "Looking back you could recognise some growth in Ash teams during the last 3 seasons/leagues, aside from Rowlet and Pikachu everything was evolved 6-7-8 and his placings being second-first and first. Ash has reached his peak finally and now needs to catch Ho-oh", "Now I want to see an analysis of the teams that Ash lost to.", "Ash's Masters 8 team gets even better when you realize that not only does he have Dragonite, Sirfetch'd and Dracovish but also Mega Lucario, GMax Gengar and Gmax Pikachu/Zmove Pikachu", "Lilly of the valley you should have used the team Ash used against Paul. That's the team he used throughout the gyms and the most iconic team for that generation.", "Wait did Gible just attack Shuckle but make itself faint?! 18:20\nI'm here for this Shuckle Supremacy", "4:20am... I would LOVE to see Wolfey do a full stream at \"4:20am\""]}