{
    "video_id": "Nqq_XJ2kVkU",
    "comments": [
        "Great wideo!",
        "\"NO ONE WILL CHECK IT TRUST ME!\"\nThat one kid: ......",
        "Unova",
        "I love videos that I didn't know I needed",
        "Guy-ble",
        "I never understood why Ash don’t evolve his certain pokemons",
        "Ash Unova region team is weakest",
        "Did you decide the teams based on the last battle of the league, given how the teams were changing constantly throughout most of these leagues.",
        "The fact when wolfey pronounce gible as JAYBEL, had me choke",
        "You know Pokémon is for kids right…..",
        "It is not “jyble” it is “Gible”",
        "so what i learned is that ash was lucky to not face diantha",
        "bro said Jyble",
        "What she had mythical Pokemon that's stupid bro",
        "Bayleef getting compliments defensively from wolfey was what i needed to hear today",
        "\"I think Gen 6 was his best because of Ash Greninja, that is all\"\nCompletely agree, the cool factor on top of the strong factor makes for a great Pokemon",
        "Loved this,  would've liked an even deeper analysis including move choices/critiques.",
        "Gible??? Guy bull.",
        "My dude rating a gen 2 team with snorlax number 4 hurts, like it’s the single best Pokémon in gen 2 bar none by a large margin. It entirely defines gen 2 competitively and it uses on literally every single competitive team in gen two(not saying it automatically it makes the team competitively viable and strong just cause it has lax, but saying it automatically makes it better than any team without a lax, which I would imagine makes it stronger than all the other teams just by nature of having the single most busted Pokémon of the generation on the team)",
        "13:42 I know there were \"anime reasons\" why Ash didn't get Mudkip, and it went to Brock instead, but if he had at least a Marshtomp (cuz lets be real, Ash was barely evolving anyone during Hoenn nevermind fully evolving them), he might have done better in this league.",
        "Jaibel ",
        "GIBle. Like Nibble. Not GUYble like a Guy...",
        "Also your editor is good at stuff. They need raise",
        "15:19 nice Pilot reference.\n\n If you know you know.",
        "Gi b let.",
        "The way you say Unfezant is… unpleasant. 2:46\n\nEver Grande? Didn’t they just say “Grand” in the show? 12:50",
        "WHAT DID YOU JUST CALL GIBLE?",
        "Which website/app do you use to view pokemon stats and moves?",
        "I mean gen 8's team also had a mega, 2 gmax's and a z move in it's arsenal",
        "I'm just glad Hasbro is not part of this ",
        "Hot Take: If Ash's Bulbasaur evolved it would in his Top 5 Strongest",
        "“Guyble”",
        "wolfey wolfey wolfey id like to point out that u atucally havant seen him iv or ev train his pokemon and and and U HAVANT SEEN HIS MOVESETS HE TAUGHT GENGAR FIRE PUNCH FOR ARCUSES SAKE at least ingo and emmet have competitive ev ivs and stats(ingo and emmet on top) yeah:)",
        "As if you don’t bring back the OG story Charizard for the winning team. What a huge story let down",
        "I don’t agree with ur criticisms of the Alola team icl. Ur completely picking it apart for defensive reasons but anyone would use it hyper offensively. Grounds are threatened by the teams coverage, waters lose to pikachu + Melm and Lycanroc coverage (ect.) \nYou even used a really weak example on showdown for a criticism too imo. With this team you’d literally almost never hard swap you just pick ur best lead and try to break through from t1",
        "Jyble",
        "This is a good video for sure but I think many Pokemon in the anime shouldnt be ranked by competitive usage but it's overall feats in the anime more",
        "Is unfezant not meant to be pronounced like unpleasant?",
        "One thing that bugs me about Ash's Unova team is that why didn't he use Krookodile and Leavanny, at least those two are fully evolved. Like swap Boldore for Krookodile and Snivy for Leavanny, and maybe Oshawott for Palpitoad.",
        "Ash has been microdosing his pokemon's food with ground up everstones.",
        "Ashs worst team is the one where he used pikachu",
        "Jai -ble?",
        "Hello thanks for the amazing content you put out!",
        "Alph; when old people dress like 12 year old children to appeal to their audience",
        "ayo you said Gible wrong",
        "Bro exactly ash greninja that is all",
        "Ofc, New Team is The Best team has 1 Z move, 2 Gigantamax, 1 Mega 2, Dragons , Gen 6 team was the best until the new one came around, sadly your are not taking the point of moves they have in the anime that change how the teams are made",
        "I knew immediately that you would put ash greninja at the top. He was just so good. That’s the only season of Pokémon that I have watched and it also made me very emotional when he left",
        "I would be curious to see if Indigo and Manalo teams were full 6v6, if they would change in the rankings. It would be hard to define for Indigo because Ash did a bunch of switching, but at the end of Manalo he had exactly 6 mons (which seemed to be a theme they kept from Gens 6-8 in order to build better relationships with them).",
        "Him saying gible like that only slightly hurts me",
        "Unnova worst team",
        "2:45 remember Pikachu refused to evovle even when given the option.\n4:35 Unfezant replaced with Braviary",
        "Corphish was actually very strong in the anime no cap",
        "I believe that ash's worat  team was unova\nAnd i commented before he said it",
        "Gieble?",
        "Wait unova was one of ashes series where he caught more than one pokemon. Later on replacing boulder with palpatoad, and unfezent with krukadial.  He also caught swaddel which did become a levani  so you can’t say he didn’t evolve them, more like he evolved the wrong ones.",
        "Yawn.\nDont rank it competitive gaming wise.\nRank it agaisnt the competition he is competing against.",
        "Worst team was Unova, only krookodile was semi-decent, the rest were baby stage 1 pokemon",
        "i wouldn't be surprised if kanto was his worst since he had two unevolved starters and a pigeotto",
        "Love the video, but in the end: \n\nAsh’s Bonds between his Pokémon > Stats",
        "SECONDS BEFORE YOU STARTED THE RANKING I SAID GEN 5 HOLY MOTHER OF MONKEY MILK I WAS RIGHT",
        "The pilot reference and the slaking when talking about swallow was great I’m surprised I didn’t see anyone else mention it",
        "I feel like this video would be way more interesting if it actually took the generation’s meta and game mechanics into account. I.e. at 16:58, Wolfey forgot about the physical special split and used Gen VIII’s move set for Sceptile, not its Gen III move set.",
        "How about the Masters tournament what would you rank it?",
        "It said that he was asked the question by alferade at 4.20 a.m",
        "Is the pronunciation really \" GUY-BLE\"? Not \"GEE-BLE\"?",
        "Y",
        "unova is his worst team\nalthough bss (ranked singles) might be the closest \"official\" format for judging ash's teams in competitive\n\nnow that ash also has the world champ difference, it would be cool to see wolfey's 2016 team against ash's world coronation team",
        "Dude he uses septile not grovyle",
        "Wait wouldn't smart + smart = genius",
        "The fact that one of the cons of Ash's Unova's team was having Unfezant is too true",
        "3:53\n…this is the ANIME we are talking about\nWhere a Bulbasaur beats a MEGANIUM and a Turtwig beat a Chimchar",
        "Ash had better team against Paul than against the legendary spammer",
        "Did you just say gyble",
        "Didn't realize Ash was such a beautiful woman.",
        "Where infernape ",
        "If we make the Point in the Pikachu/Squirtle/Charizard team that that was in the Time that Charizard didnt listen to Ash. This means that the full pressure will lie on the shoulders of both Squirtle and Pikachu. And a Electrical attack is critical to both Squirtle (who was unexperienced) and Charizard (who doesnt want to fight) so that leaves Pikachu against 3. Not the best odds.",
        "To be fair is sun and moon team is basically cheating",
        "My favourite \"good pokemon?\"-factor is lechonk",
        "15:23 we will never forget you pilot",
        "Since Wolfe didn't discuss it, do y'all think Ash's signature Sinnoh team (Pikachu, Infernape, Torterra, Buizel, Gliscor, Staraptor) ranks higher or lower than Ash's Kalos team? Despite my bias for Kalos, I think Sinnoh ranks higher simply because it has less overlapping types. Kalos has 3 flying types and 2 dragon types while Sinnoh has 2 ground types and 2 flying types",
        "I get evolving but in the anime evolving don't actually matter it's all about the skill of the pokemon and trainer",
        "gen 5 sucks",
        "Editing is god-tier",
        "That hacked five move snorlax was probably Ashes best Pokémon.",
        "why you say gible so weirdly.....",
        "Props to Wolfey for actually adding a segment for Ash's latest league team despite recording this video months before it even existed",
        "I think it would be cool to see how these rankings would change if Ash DID fully evolve everything. Pretty sure world team would still be the best since ya know, MR FISH, but still. Nice vid wolfe!",
        "I’m still confused about how Ash lost the Lumios conference.",
        "Ash finally learned how to evolve his Pokemon and immediately won the Championship, he was just holding back his own overwheming power to give others a chance what a nice guy",
        "I agree that his strongest team was generation 6",
        "how about the best possible six?",
        "The writers ROBBED ash in the XYZ saga. A greninja, a water type, losing against a Charizard, a fire type.",
        "If u count alola aka Gen 7 then u gotta count the orange islands so it’s 9 technically",
        "Every time he says “Gible”… ",
        "Kinda surprised that ash didn't use his chimchar for gen 4",
        "Ash's pikachu can't evolve if it evolve it will not be the same ;c",
        "Why all ash needs to do is increase there sp.def",
        "4% gang ",
        "Did bro say gi ble",
        "Ash's worst team is probably the Kanto/indigo League team. He didn't really use any fully-evolved Pokémon except for charizard (i think, it's quite some time ago since i've watched his indigo League team get defeated).",
        "Ash winning was so wholesome!",
        "\"So there I was\" I am so happy to hear this again :D",
        "In that case 0:53\nLET’S GO",
        "Wolfey u have to use Ash's PWC team and get to rank 1 now.",
        "to this day I think Noctowl is Psychic/Flying",
        "Cool video, but why not judge base it on singles format?",
        "I can't wait to be able to finally use my Ash-Greninja again. I was constantly bullying my friends with him lol.",
        "What would be his peak VGC team though? (considering his non-evolved pokémon can evolve)",
        "would of preferred If u used ash's team with infernape that he used against Paul",
        "\"Oonfuzaunt\"",
        "guy bell",
        "wait im little lost here. do you mispronounce names so terribly to mess with poeple or thats how you think its meant to be said??",
        "Guy-ble.",
        "What the fuck? Did the orange islands mean nothing?",
        "Ignore wolfie statements regarding rotom. It’s an amazing Pokémon with great utility in singles. He makes vague statements regarding certain Pokémon without telling you that’s it’s specifically good or bad in doubles or singles. Mostly because he’d rather you guys take the Vgc pov regarding certain Pokémon even tho a majority of players play comeptitive singles.",
        "It's Gible not Gaible",
        "Ash-gren to sweep. None of his opponents have access to this broken 'mon.",
        "there is no way u pronounced Gible like that.",
        "The way he says Gible hurts me. It's gIb-il not gibe-il",
        "15:19 Nah, Wolfey, that's disrespectful lmao ",
        "Is Gible pronounced somewhat as Gy-bal or Ge-bel ?",
        "How has this guy managed to get so many subs ? These Pokémon virgins are fierce",
        "Was I the only one who got a tiny bit salty about how he mispronounced some names like Unfezant and Gible? ",
        "I really think you should have jugded some full teams instead of 3s and Ash's vs Paul team.",
        "Gayball? ",
        "So glad to see someone else notice the true value of bayleaf, and the chikorita line as a whole. Surprisingly good pokemon that need more love, honestly.",
        "Did anyone noticed the swellow meme.\nSwellow being Pilot eliminated by slaking.\nReminds me of Pc's Emerald kaizo nuzlcok where pc nicknamed swellow as pilot lol",
        "my boy went from using 2 unevolved starters to becoming the strongest trainer IN THE WORLD. What a beast",
        "This isn't relevant to VGC, but Snorlax only has a 50% winrate in gen 2 OU (Competitive singles.)\n\nThis is because Snorlax is on every team in that format. It's also arguably better than Mewtwo in Gen 2.",
        "Ash becomes world champion only after Mr. Fish becomes a part of his team.\n\nCoincidence? NO. ",
        "synthesis",
        "bor i am so angery on you, ypu put alola on no5 brugh that insain you lost your mind",
        "Gible is the funniest rock setter to run on a team.",
        "A Sarah collab? Super pog",
        "What about the team Ash used against Paul ?",
        "15:19 dope reference lol",
        "How Wolfe pronounces Gible makes me shiver",
        "I think that evolution in the anime works more similarly to the real life evolution, where a Pokemon evolves under extreme situations\nWhich might explain why Ash never evolved some of his pokemon",
        "Vertress Confrence is the worst I'm calling it.",
        "I'm gonna guess Johto was his worst and Kalos or alola were his best teams",
        "Who tf is guy bull",
        "Am I the only one who noticed the Pokemon Challenges Emeralrd Kaizo reference in 15:19?  It was literally Pilot getting wrecked by a Slaking",
        "4:20 am seriously wolfey? Please, have some dignity, there are children here. Lmao",
        "What the hell is a gyble",
        "why does he pronounce gible as \"jible\"?\nIt's clearly gible - Gabite - Garchomp (nibble - bite - chomp)  \nEven gible sais \"gee-bull\" -.-",
        "I love using agility on sceptile then it gets hit activating its focus sash and since it's item has been useded it's ability activates doubling it's speed once more making it faster then scarf eleki.",
        "You said gible WRONG but grovile RIGHT ??????",
        "These all only stats but I like Pokémon for emotions as if stats are everything then it is all over and Ash’s journey ends before his first tournament :(",
        "05:35 Let's just appreciate how much effort and time he puts in these videos to make our day huge respect!",
        "The only complaint i have for this video is that he called gible, jyble",
        "it's un - fez - ant",
        "I personally prefer grovyle over sceptile",
        "You forget Ash can just attack the environment and change types of any Pokémon as well give himself a field spell boost",
        "I think you should have also mentioned Ash's original team in the Lily of the Valley conference, I think they're pretty good too.",
        "Its sad how ash's sinnoh team never came into the picture.\nInfact I would say that was his best team.",
        "I loved the little Nod to Pilot the Swellow. That was REALLY cute <3",
        "17:05 this is from sinnoh league right? \nI think you should have discussed ash vs paul battle Pokemon over this pokemons\nThey all got injured before final match",
        "oon-fez-aunt",
        "Sarah coming in with an extremely based choice as always",
        "Why does he say Gible like that",
        "Pilot! <3",
        "Lol Dragonite, Gengar, and Dracovish? The other teams didn't stand a chance even if the gen 6 team was respectable. Lil bro really came a long way from just using whatever Pokemon felt right",
        "This video\nPros: gives deep explanations and time put into this\nCons: has unfezant",
        "1kalos\n2Journey\n3Sinnoh\n4Alola",
        "Only problem I saw here was why would Hoenn Ash use Jhoto Heracross instead of Glalie ?",
        "17:35 \nA level 100 that can still lose to a pidgey ",
        "Did I miss the gen 4 team? I thought he used infernape on it and I didnt see infernape…",
        "I would really love to know where you would place the \"actual\" generation 4 team Ash used (the one with infernape ti be clear)",
        "In my opinion his teams were never the problem it was always random cheating from the plot or lack of skill on his behalf.",
        "I'd really like it if people would stop acting like evolution works the same way in the anime world as it does in the game. Ash isn't mashing some metaphysical B button. There are no levels or experience bars. In the show, evolution is arbitrary and dependent on the whims of the gods of marketing.",
        "Imagine ranking the Sinnoh Pokemon and picking the team without Infernape",
        "16:26 jible",
        "His worst team in my opinon would be Gen 2 because a lot of his Pokemon were either not fully evolved or just underwhelming in performance",
        "Some teams I wonder how he even won",
        "why do you say gible like that  (no hate)",
        "I wasn't expecting you to cite the team that Ash used against Tobias. Which is an shame because the original DP team that he used against Paul was an major powerhouse in its own right.",
        "Did you just say Jible?",
        "Ash has been through a lot over the years",
        "I know pronunciations of names vary and it's silly to comment on them usually but \"guy-ble\", come dude it's based of the word nibble.",
        "u forgot, about the Manalo, Ash have more pokemons on his team he use,\nRowlet, Naganadel, and Torracat. those are seen in Manalo Alola Pokemon league,\nalso Ash uses all at the final, against Galdion.\nalso He uses it against Prof. Kukui, ",
        "Bruh don't ever butcher Gible's name again. This is worse than people mispronouncing Arceus.",
        "What would you consider his best possible team given all of his pokemon he has available to him?",
        "aint no way this dude said jybull for gible",
        "Ngl u should've also put the full Alola team he used against Kukui. That battle was to see if Ash could retain the title of champion.",
        "can Ashs Pikachu be concidered as the Partner Pikachu in Lets Go?",
        "can u please get top 1 with one of ashes worst championship teams??? sword and shield",
        "Do you purposely pronounce pokemon incorrectly for video interaction or do you actually pronounce them incorrectly?",
        "bayleef is avtually better off unevolved since eviolite bayleef has more bulk then meganium",
        "Orange islands happened btw back in season 2 ash won the orange league and beat the champion, he also beat the battle frontier which is somewhat similar but orange islands had gym leaders and a champion",
        "Ash’s Snorlax is so versatile it can use more than four moves in a battle!",
        "Where's infirnape",
        "Ash had more than 3 pokemon in alola",
        "uun feazant lol",
        "I wish Heracross was my dad.",
        "It was 4:20am watching this video",
        "Corpfish was probably the worst one Ash didn’t evolve. He missed out on a decent dark type. And without the added strength, it really left him vulnerable in battle.\nBased on the personalities of his Pokémon, I think his ideal team would be: \nPikachu (He has to be part of the team)",
        "Mat Pat is that you?",
        "wait, where's the Dpp team, the one where he used quilava?",
        "without his recent team, it was obvious the lumios conference team was his strongest one. Like everybody agrees on the question \"Whos the stongest  Champion in all games? (Piano playing)",
        "I thought Melmetal is a Mythical",
        "“Guy-bell”?????????\nGUY BELL??? \n\nThis pronunciation of gible has me on the floor",
        "What team did ash use with his infernape against Paul was that not in a tournament",
        "stop bullying the best bird unfeazant",
        "So you do realize 'unfezant' is a wordplay on 'unpleasant', right..? Unless you pronounce that as 'oonplessant' as well...",
        "How can i watch this series? How many episodes? Only last one i believe it was master. Journey",
        "Is wolfey mispronouncing pokemon names on purpose? I genuinely can't tell",
        "In terms of overall Pokémon quality it still would do worse than Sinnoh Alola and Johto",
        "Why does he pronounce Unfeazant like that?",
        "Can we appreciate Ash built his Sinnoh team around countering Darkrai? Sleep talk Heracross and rock smash Gible was smart",
        "It's a pet peeve of mine when someone says ash doesn't evolve his pokemon. Like... Its weird how people seem to completely ignore the fact the pokemon arent forced to evolve in the anime, or really in the games unless you use a stone or trade item or whatever. The pokemon have a choice wether they want to evolve or not, and in the game mechanics you have the option to not allow then to evolve because its just built in that they do at a certain stage (for the most part)",
        "About the \"Ash forgets to/doesn't evolve his Pokémon\" thing, it's inaccurate to say so.\n\nHere are some points as to why :",
        "is it a joke that Wolfie \"deliberately\" gets pokemon names wrong?\nJy-ble? that's just horrible...even when the anime says Gi-ble",
        "I felt like you should’ve done more on there in anime feats",
        "if The Rock was a pokemon what would its stats, ability and moves be?",
        "Can you rank the Sinnoh team that Ash used against Paul, please? Just to remind: Pikachu, Infernape, Torterra, Buizel, Gliscor and Staraptor.\nThanks",
        "I really hate how you put on ash \"forgetting the Evolution mechanic\" \n\nHE LETS HIS POKEMON CHOOSE IF THEY EVOLVE OR NOT-",
        "can you please make a video about the best competitive pokemon of each type. other videos on th esubject of best of each type tend to focus on design. but based on stats and moves, etc, what is the strongest of each type? maybe don't include legendaries or megas, cuz then it will look like a lot other lists already made and be too predictable",
        "torcoal vibing (8hrs)",
        "I know ashs tobias team was technicly his final sinnoh team.... but i still wanted to see the paul team ranked. My personal favorite.",
        "are you pronouncing unfezant like that on purpose to annoy us or what",
        "video starts at 4:54",
        "Eww why did you say gible like that",
        "Lily of the Valley team was Infernape, Gliscor, Staraptor, Torterra, Buizel, and Pikachu --> Tobias battle was more of a \"how can I beat Darkrai\" kind of team. Would definitely have wanted to see that as part of the analysis although feel as though it would be at the same rank.",
        "Every time he called gible \"guy bull\" I lost a part of my soul",
        "Tapu koko claps ashs kalos team",
        "0:04 that comment instantly gets you a thumbs up.",
        "agreed! his Kalos and most recent team are his 2 best competitive wise. also think his Sinnoh team used vs Paul was strong as well. great video!",
        "I honestly think this video would've been better with his entire roster from the respective regions, or counting Ash's fight vs Kukui instead, or even Ash vs Paul. The alola team just feels so screwed over by this, plus I just think it makes more sense. When you go to worlds you don't look at the only 4 pokemon you bring, you look at all 6. I also think it paints a better picture of Ash's journey as a whole to look at it like this.",
        "I think Ash's team against Kukui and against Paul need to be analyzed as well. Both are arguably more balanced than his others teams from their respective gens and you miss powerhouses like Infernape and Incinaroar (ohh now I know why you didn't use it)",
        "I think you should look at this more from an anime perspective than a game perspective. How strong is Ash's Pikachu? What other Mons did he beat? Remember, he's made an Onyx faint with Thunderbolt lol. And maybe use MatPat's \"What level is Ash's Pikachu?\" video to help. I'm pretty sure it goes over what level Pikachu would be for each tournament that Ash had been in by the time MatPat released it, at least. Should only have to do some guess work for 1-2 after that. But, you know, try the actual Power Scaling stuff that people like SethKage and SwagTheProgrammer do. (Oh wait, I mixed them up again? Lol)",
        "Really think he should've put the team against Paul instead of Tobias as that was his actual Sinnoh Team and the team against Drake in Orange Islands",
        "It is stupid that the Orange Islands isn;t counted.",
        "Music list?",
        "I, too, sit around thinking about my hatred of Incineroar. And Cindrace. And Greninja. I have a lot of Pokémon grudges.",
        "Ash winning 3/8 tournaments he enters is not bad at all.",
        "the one with unfezant",
        "Wolfey; you’re a god damn handsome man. Idk if anyone has told you that recently.",
        "glalie glalie glalie glalie glalie glalie",
        "Did Ash use Tauros and Muk in the indigo league? It's been a long time since I saw the episodes so I might be misremembering",
        "Seeing all of Ash’s Pokémon in pikachu’s vision was so heartwarming, could’ve teared up seeing the first 6 together",
        "Wheres Pokemon jounrneys team?",
        "I can't get over Wolfe pronouncing Gible as Gybell. That's not how it's said. You say it to rhyme with Jiggle. (Though still with the hard G)",
        "Giable? Is that how you pronounce gible?",
        "i am writing home about this video today",
        "So what is his ultimate team? Every pokemon he owns at his disposal?",
        "Loved everything except your pronunciation of Gible.",
        "Guy-ble????",
        "You should rate the pokemon adventures' mc teams",
        "Dude really pronounces Gible like Jie-bul. WHY? It's Gib-Bul, with a hard G.",
        "stop saying guyble",
        "i actually guessed unova was the worst one",
        "That Gible pronunciation completely caught me off guard I had to pause the video and process it",
        "omfg say the names right dear lord",
        "\"Pikachu should've been fully evolved.\"\nThe Marketing Department: So you've chosen death.",
        "And he is still 10 years old, it's almost as if it was yesterday I saw him crying like a B about how he let go of a pokemon he promised to visit, only once he became a world champion after 6 regional championship fights, 1 single victory on a first time championship on a few islands and a world series out of the power of friendship. And now we see what Skarlet and Violet series will have I guess, maybe he will finally grow the flip up",
        "It may be helpful to note that Ash's Pikachu has the unique defensive quality of being almost totally immune to ground and rock-type moves, because it can just jump over them",
        "I think you forgot the Orange islands",
        "I started re-watching the series and I am now in BW and that is when I remembered that all of his Pokemons at that time were weak. Also, I do not know why but almost all of Ash's Pokemons evolve, not because of getting EXP, but because of survivability. So his Pokemon during the BW series did not experience tragic situations where they need to evolve.",
        "Serious question because I'm kinda new here. Does he mispronounce Pokemon names on purpose?",
        "I'm not a fan that you ended up using Ash's team against Tobias instead of his team against Paul. His team against Paul was obviously his main Sinnoh team, so it should have been the team you should have analyzed for this video. \nOther than that, great vid!",
        "WHAT THE HELL IS GUYBIL",
        "Isn't Lucario a steel type as well so wouldn't that be good against Fairy pokemon and a safe switch in?",
        "I like Ash’s Alola Team over Kalos by the way\n(I don’t like Kalos",
        "how do you hate incineror, got such a sick design! even its z-move is cool af!",
        "I really think for Kanto and Alola teams the versions of full battles (vs Drake and vs Kukui) should have been used",
        "Clodsire is the new Dracovish counter",
        "I felt like I missing a team",
        "Guy-bal",
        "I knew Unova was the weakest because there is nothing notable about it",
        "O",
        "What is the point of this video explaining the anime with game stuff?",
        "You spoiled the last episode I haven’t had the time to watch it I’m in subbing",
        "I think that ash should replace his Unfezant with his Krocodile",
        "heh oonfuzant",
        "Editing is top tier. Loving the content!",
        "What about orange islands",
        "This is Pokémon, not yugioh",
        "Why are you pronouncing En Passant like that when it should be Unpleasent?",
        "16:26\nI'm sorry, did he just pronounce it as \"Jeyeble\"?",
        "Great video and all, but dude, Corphish has 80 base attack and Adaptability. It hits like a truck. How can you say that even Gible is better? (Let alone saying that it has a better ability in Rough Skin lol)",
        "wolfeyVGC why tf do you pronounce gibles name like that, like literally how do you do that",
        "it would be interesting to see a \"what if\" of all of ash's pokemon teams like what if all of his pokemon in unova were at the best possible state it could be with all of the pokemon fully evolved and how it would be rated then",
        "You made a pretty obvious oversight in this video by only ranking the teams that Ash lost each tournament with, instead of analysing the pokemon he used overall. A lot of your criticisms about team compisition can be completely dismissed when you realise Ash built each team to battle a specific opponent with.",
        "Poor Guy-bull…no good even with Draco Meteor",
        "With this new scripted format, maybe you can re-do an old video; help Ash team-build for VGC, using the Pokémon he's already caught! For the sake of being thorough, maybe consider doing it twice; once where he's under the same constraints as everyone else, and once where Ash does as Ash does and breaks the rules in half, in this case bringing along Mega Evolution, his Z-ring (giving Pikachu 10,000,000 Volt Thunderbolt, an Electric Z-move that canonically ignores immunity), his Dynamax Band, and/or potentially his Ash-Greninja.",
        "His Greninja has the best plot and story and if there’s a pokemon that should have won the Championship it should have been the Ninja.",
        "Corphish was a beast in Hoenn. It won Ash a lot of important battles.",
        "im stopping watching because you pronounce unpheasant as uuunfezaant, its un-pheasant",
        "I feel like instead of just doing Ash's team that he battled with last in the tournament, you shouldve done the team was considered his strongest and gave him the win of his Highlight match of the tournament. Ash vs Kukui for example, or Ash vs Paul",
        "part of the 4% gang",
        "I know you were only ranking the FINAL teams he used in the Indigo Cup and what he used in Alola, but, let's be honest, that is not really what we viewers want to see overall.  As those two leagues allowed switching and using multiple different teams of 3.  And his actual final battle in Alola, while basically nothing more than an exhibition match, had him use six Pokemon.",
        "When I saw Dracovish in Ash team in the championship, I knew he has the best team.",
        "My guess for worst is any team with Basics, besides Pikachu. Evolve your mons\nworst team has all three of the gen's starters, two as Basic and one Stage 1\nThis is why he loses",
        "why wasn't Infernape included in the Sinnoh team?",
        "'gyble'",
        "He used all 3 in aloha",
        "Did you just say Gible instead of Gible?",
        "The Depressed Greninja-Lover XY Anime fans club members would never Accept that the Galar team is the strongest. Not even in their top 3 lmao.",
        "RIP pilot",
        "Oh Lumiose conference \nThe one with the most shared weaknesses in typing\nFor weak to Fairy\nThree weak to Electric",
        "How dare you disrespect all of Ash’s Pokémon  I hope your channel falls one day",
        "I'm old ....... I've loved it for a few years or am I satisfied, it's true that this story is my favorite Wish you luck, not what you do ",
        "worst team might be either unova or kanto?",
        "Your delivery in these scripted videos has gotten so natural. I feel like you've really nailed the balance between the personality that made your older videos so appealing and a more focused structure that gets your point across concisely. I will always be an hour-long bagel intro fan, but it's been amazing to watch you grow as a content creator over the years.",
        "Jible???",
        "the way he pronounced gible no",
        "Evergrande Conference could be 2. Corphish is a fear. It can have sash, endeavor, aqua jet. Also, since it doesn't use quick attack, more people expect it. Also, Corphish can learn utility moves for a follow on.",
        "Man \nYou trick no one\nYou hava an incineroar body pillow, don't you",
        "Unova ash is so dumb that he left out the single strongest Pokemon krookodile for the cameron fight",
        "Looks like I found a New Hidden Gem\nI subscribe immediately + Keep up the great work/editing",
        "Oh wow, I used to watch alpharad when i was in high school, 2016ish. I had no idea you were friends",
        "Now All I want is ash’s rivals final battle with ash and ranking them competitively",
        "I think it’s gonna be Ashes Unova team it just seems bad",
        "Spending three minutes describing why evolved pokemon are stronger than their un-evolved form. followed by a request to subscribe.  Ugh.",
        "singles  players seething at the rotom slander\n\n252+ Atk Choice Band Adaptability Crawdaunt Crabhammer vs. 248 HP / 252+ Def Torkoal in Sun on a critical hit: 288-340 (83.9 - 99.1%) -- guaranteed 2HKO",
        "I wish he talked about his sinnoh team he used against Paul rather then the team he used against Tobias.",
        "I will never sub until you say unfezants name correctly",
        "RIP to the real Sinnoh team, which wasn't mentioned bc Ash used it against Paul and not against Tobias in the finals. Would have loved to see were it would have ranked, especially bc it had heavy hitters like: Infernape, Staraptor, Gliscor and Torterra. Maybe in a future video.",
        "Guybull",
        "I'm sorry, what did you just call Gible...!!!???",
        "Ash was just exemplifying how to play Pokémon the fun way. Set arbitrary challenges that increase the difficulty. Its a subtle cue from Nintendo admitting that the games are criminally easy.",
        "Unova is my favorite generation but my least favorite Ash team. Bro was strait inting.",
        "The editing on this video is phenomenal. You deserve every one of your subs Wolfey.",
        "Jible",
        "I’m really curious where you’d put Ash’s team against Paul, since that was the team he used through the majority of Sinnoh and the battle with Paul was by far the most important battle in the entire season",
        "My list\nUnova \nKanto (with Orange Island because it’s a full team)\nKalos (Fairy exists remember)",
        "How is it 6 its the team that got a number 1",
        "8:00 assuming the Ground Type outspeeds",
        "gen 4?",
        "16:26 jible ",
        "TEXT ME NOW ILL SHOW YOU HOW!",
        "Ash's Gible was certainly a wasted opportunity, they introduced it but then remembered ash had a Monferno/infernape and it was supposed to be his ace for the region. They could've easily pulled a Aipom with it and had it go with him to Unova and have it evolve into Garchomp along the way. To me it probably would've been a more interesting story than Krookodile. You could already see it's passion for battling during the Sinnoh league. It would've been interesting to see it evolve and fully awaken a aggressive passion for battling. But no, they wanted ash's Charizard to return for a time instead.",
        "I still think his Sinnoh team was champion-worthy.\n\nDamn Action Replay-using Tobias",
        "I think I would treat his pikachu as if it was holding a light orb.... or else it wouldn't make sense with some of the feats he's done with that pikachu xD",
        "Guyble?",
        "It's a shame the team he used for his exhibition match in Alola wasn't counted as the battle against Kukui felt like the actual \"championship\" match. I think it would have been his strongest or at least a very close runner up. Melmetal, Naganadel, Incineroar, Lycanroc (and Pikachu and Rowlet yes).",
        "I think you did left out the sinnoh league team",
        "I still can't understand why ash didn't use krookodile in his last battle in the unova league. Although maybe in alola I would have picked the team he used against kukui since it was the stellar battle of the season but I understand the champion tema tecnically is the 3v3.",
        "You should have looked Ash's full team of 6 against Kukui in Alola, but I understand why you choose the team he technically won the conference with. Thanks for the video. Come at me comment bots!",
        "and sinoh team?",
        "HEH how is gen 6 ash weaker then gen 8 ash???",
        "Wolfey I just found this video and I was gonna leave, I thought you were gonna say sinnoh for #5",
        "Why does he say some of the names this way lol",
        "Shame his Orange League Championship team wasn't taken into account for this. It's got a gen 1 Tauros on it.",
        "Putting this down for my own review post watching the video - \n\nWeakest to strongest teams:",
        "Good video! \nThough you pronouncing it \"Guy-ble\" is the worst part",
        "ya know what would be funny? a pokemon game with its 1st gym leader being a dragon leader, and said dragon leader only has 1 Deino, that is all. have a nice day :^)",
        "maybe you forgot infernafe..",
        "You forget that everyone stopped watching pokemon after they gave ash a lobotomy",
        "his unova team had so much potential and it got wasted. i believe the main reason gen 5 is hated on is solely due to how ash was in unova and how the anime put his journey",
        "Wonder why Ash’s Swellow has such a bad record",
        "I think a video on how you would improve each of Ash's teams without fundamentally changing them too much would be really cool, like you hinted at at the end of the Unova section.",
        "15:20 don't remind me about Pilot the Swellow ",
        "I think Ash's teams are indicative of his focus on speed and attack rather than bulkier defensive postures.",
        "if the team aigenst garry instead of harrison where would gen2 have landed?",
        "Ash starting to lose leagues i was 7-8... he finally won one! im 32 now... -.-''",
        "Pls make a video of his best possible team using all his mons",
        "7:27 i thought he was gonna say hoenn",
        "The way you pronounce gible is criminal 16:25 & 17:40",
        "Kalos should NOT be in the top three at all!",
        "The way you said Gible almost made me unsub lmao",
        "Gible as in the word “nibble”",
        "Kanto",
        "Pokémon Challenges Easter Egg at 15:20 talking about Swellow and showing Slaking knocking it out ",
        "Pikachu is literally a gigantamax Pokémon means can’t evolve.",
        "The fact that ash used gible over krokodile its... it hust blows my mind and not in a good sense xd",
        "if ash evolved Gible into Gabite and Gabite into Garchomp that would have been the strongest Pokemon on his team and the best Pokemon there that isn't a legendary",
        "You forgot to mention that Ash's Swellow, in particular, doesn't have the species normal weakness to electricity, in fact it seems to have a resistance to it if Ash's Thunder Armor strategy was anything to go by. The reason he caught it in the first place was because it took Pikachu's Thunderbolts like a champ!",
        "Ash looking at water type Pokemon: yeah, that's not worth evolving...",
        "His Pokémon in indigo league conference isn't only those Pokémon, he used many different teams that contained Pokémon like Muk and Kingler, and those help a lot so if you forgot about that then there you go.",
        "can you make a team out of 6 of any of the pokemon ash has owned?",
        "I hope torkoal gets an evolution so I can use him with an eviolite",
        "jy ball",
        "You forgot to apologise for your pronunciation of competitive as well",
        "Who else died inside when Wolfey said “Gai-bel”",
        "this editing is so unbearable please go back to those 40 minute long stream of consciousness style videos",
        "After 25 years, ash finally become the legendary winner, what a great hero.",
        "I wish you would have included the Orange Islands team. It was his first full 6 Pokemon team, and he had Tauros in Gen 1. Plus, he actually won against an undefeated champion in Drake. Sound familiar?",
        "I'd say the worst team is his Best Wishes team.",
        "Great video, just wanted to point out gibble is pronounced like nibble, but with a “g”, because, well, ga*BITE*, and gar*CHOMP* is its evolutionary line",
        "Loved the vid, but hearing you try to pronounce Unfezant nearly gave me a stroke.",
        "Corphish has 80 base attack and adaptability boosted aqua jet so it’s actually not completely worthless as a revenge killer, you can even slap a choice band or focus sash on it",
        "Ok I feel for sinnoh you should have gone with the team he used against Paul. Basically means you neglected his actual team",
        "Guyble 17:41",
        "Where am I in the wrong? Did Wolfey skip over Ash's gen 4 team???",
        "I think the Manalo Conference team should be placed higher, while yes, the defensive synergy isn't great, but the team is still capable taking a lot of hits, assault vest Melmetal can survive near all attacks in the game, and retaliate with insane and most likely, super effective damage, and after Melmetal goes down, the rest of the team can easily clean up, focus sash Lycanroc can be especially good.",
        "I am not that much into pokemon anymoore, but when u ranted about his indigo team ( I think, not sure), did u compare them to all pokemon in generell, or to the pokemon of that generation?",
        "Ash's team in Sinnoh should be the one he used against Paul, what the hell.. The one he used against Tobias was backup.\n\nDid you just jump straight into the last match of the league?",
        "16:33\nthe way he Pronounces Gible two different ways. It has to be on purpose right?",
        "The only thing I'm confused about is Ash's team in sun and moon arc. He had 6 Pokemon not 3...lycanroc, melmetal, Pikachu, rowlet, torracat (who evolved right before fainting) and Naganadel...why didnt you include the last 3? Adding them makes him team a lot better. And his indego league also had kingler, Tauros and muk.",
        "The mitochondria is the powerhouse of the cell",
        "Was not expecting Bayleef to get so much praise!! Good it's a good green lad <3 it deserves it",
        "You better be worried about grimsnarl now. That thing is gonna be a demon",
        "Finally he wasn't dumb for one time \nLike the dude doesn't care about evolving one of the key things you do in pokemon",
        "It's a crime that Ash didn't use his Krookodile during the Unova league",
        "Noctolwl to me feels more like a psychic flying instead of a normal flying",
        "Showing viewer stats is exactly what convinced me not to subscribe.",
        "Great video Wolfey! I definitely agree that the newer teams have been getting better, it's such a shame what he did with his Unova team though :(",
        "It's a shame the team he used for his exhibition match in Alola wasn't counted as the battle against Kukui felt like the actual \"championship\" match. I think it would have been his strongest or at least a very close runner up.",
        "Why does he hate incineroar again ?",
        "That Alpharad guy seems so smart and full of good ideas, what a guy. Ash's Lily of the Valley team was Infernape, Gliscor, Staraptor, Torterra, Buizel, and Pikachu. Tobias battle was more of a \"how can I beat Darkrai\" kind of team. Would definitely have wanted to see that as part of the analysis although feel as though it would be at the same rank. And it may be helpful to note that Ash's Pikachu has the unique defensive quality of being almost totally immune to ground and rock-type moves, because it can just jump over them",
        "I’m still here asking, “how the hell is Melmetal a legendary?”",
        "had this going on in the background and it took me a good bit to figure out he was talking about gible",
        "I’m sorry, WHAT did you just call Gible?? Jyble?? I am appalled",
        "(No sarcasm) Unfezant is the best regional bird. Fight me",
        "Isn’t it pronounced Jib-Lay?",
        "Would say, Sinnoh evaluation should be based on Paul team since those Pokémon got frequent use in tournament but didn't realise how much his team against Tobias was similar to his Hoenn",
        "Ash Ketchum sucks as a character. Instead of replacing the main protagonist every season like in video games, anime creators made the stupidest jerk. Sad that really good characters like Red, Ethan, Lucas, Hilda, Nate, Victor never appeared as main protagonist. 25 years we had to watch to Ass Ketchup.",
        "Hoenn team weakest",
        "All",
        "How dare you besmirch the name of Totodile?!",
        "Haha he said gible like Guy-Bowl it's hilarious",
        "GIEBLE?!?",
        "Can someone count the amount of times Wolfe said something that meant \"could be better\"?",
        "Kids:Kalos is weak as charizard and infernape isn't in it, \nMen:The Johto team is weak ngl many pokemon are not even fully evolved or even evolved\nLegends:Unova, none of them are good or evolved",
        "Guyble",
        "#1 in the world with specs snorlax when?",
        "Great video, would have liked your opinion on Ashs team vs Paul instead of his one vs Tobias, but hey if that is the only thing I can criticize.",
        "Gih-ble, not Gi-ble. (This legit hurts too listen to… )",
        "Ash's actually gen 4 team would of been a better pick then his Tobias team.",
        "Including all anime leagues, there should also be his Orange Island team of Pikachu, Bulbasaur, Charizard, Squirtle, Lapras and Tauros. I'd estimate it'd probably make it either just above or below his Silver League Conference team (largely dependant on how we're factoring in the prominence of Gen 1 Tauros based on the rules).",
        "What about Ashes Sinnoh Team……",
        "3:17 What Pokemon?",
        "How much different would this be if he had all his pokemon on the squad that he had in the region? For story purposes he wasn't able to use all of em. Ps. favorite gible moment was shuckle draco meteor",
        "Vortess is bad",
        "Ok, but Infernape tho",
        "11:00 MR. STAKE!",
        "I mean tbh corphish and totodile aren't as bad as they could be and I would say corphish is better than gible, corphish gets adaptability and totodile gets sheer force, and they also get one of the most terrifying setup moves in my opinion, they both get dragon dance. Granted the main problem with all of this is when in the world are they going to get to set up with their terrible hp and defenses, but if they did they'd be okayish kinda. And also granted there isn't a world where there's any reason to use them over crawdaunt or feraligatr other than they're cute xD. Also fully agree his team for the world coronation series was absolutely busted comparatively to all the others, overall great video ",
        "I haven't watched Pokemon in a decade. But isn't there a region or team that has Chimchar on it?",
        "Unova was the worst team",
        "swellow has guts...the fvcking thunder armor was a twisted guts activation or am I trying to make sense off of bs? i always thought about that.",
        "Really cool to see how Wolfe has grown as a YouTuber. A year ago this would be a non-prepared 40 minute VOD of him scrolling through Serebii (which has its own charm tbf). But in traditional YouTuber standards the vids have gotten so high quality recently ",
        "Wish would talk about his Pokémon team for the region and not just one team he uses in one battle",
        "His Unova team also included Leavany a fully evolved grass/bug type so you were wrong there even if it was a 4x weak to fire & flying types.",
        "It could be seen as him maturing as well: he's able to evolve his pokemon because he himself has grown and evolved.  In Kanto he had the potential but not the fully devolped skills or knowledge to go too far.\n\nEight (and a half) regions later, however, he is far better and more able.",
        "Is no one gonna talk about how Wolfey said “Gible”",
        "\"because ash greninja\" is the most true statement i've ever heard",
        "Okay, but can we talk about how my boi pronounces “Unfezant” and “Gible”?…",
        "bro who says guyble",
        "Am I the only one that's not a fan of this Game Theory style editing?",
        "At 3:24 the description of Neutralizing Gas is just \"While the user is on the field, the effects of all other abilities of other Pokemon that are currently in battle\" ..... WHAT ABOUT THEM WOLFEY?? WHAT HAPPENS TO THE EFFECTS???",
        "wtf GUYBLE?",
        "So 2 questions. How much would these teams change positions if you consider the moves that Ash had on his Pokémon instead of just what they can learn?\n\nWould you do a video about Ash's best battle frontier team?",
        "Is Unpheasant really pronounced like that? I thought it was supposed to rhyme with Unpleasant but be a pun ",
        "remember, sirfetched always and i mean always crits.",
        "Who's Your Favorite Pokémon from Ash's Teams. All Generations are Allowed",
        "“A level 100 pikachu can still lose to pigey” killed me",
        "JAIBLE\nWHY ",
        "I'm sorry what did you just call Gible",
        "Wheres Sinnoh?",
        "16:26 GI - BLE\nNope it’s Pronounced Gible\nGIB-LE",
        "Gible....like nibble but with a G ",
        "Yh",
        "Guyble lmfao",
        "Whats wrong with unfezant? Seemed decent in the card game lol.",
        "The worst team is definitely gen 5. Holy shit is it bad. My mans has one fully evolved pokemon, and its the regional bird, alongside two completely unevolved starter mons. 3 of his pokemon could compete in LC (little cup) for crying out loud.",
        "What about dimond and pearl leauge",
        "Don’t even remind me about black-and-white that show is atrocious one of the worst animes I’ve ever seen just ever",
        "\"Hey! Ash team! Good?\" Has the same energy as Nemona's \"You! Me! Rivals! Yes?\"",
        "I’m curious what you think about some of the other teams ash uses in earlier rounds of these tournaments like his pikachu, infernape, torterra, staraptor, buizel, and gliscor team in the lily of the valley quarterfinals",
        "some of these points kind of just seem like they are made under the same engine (even if the pools are restricted), in which case it makes more sense, but I think the teams do kind of play around differently in their own respective engines, but it doesn't show a big difference.\nI'd say that the gen 4 team felt like it was phrased the way it was for time (Ash used multiple teams in that one) and was ultimately judged on the version of the team which lost, and that team was more picked for its similarity to the gen 3 team, which feels dishonest because the Vs. Paul team vibed as a fair bit stronger. But that might also just be me misremembering. If it's judged by the \"all same engine\" method Wolfey might be right though, who knows.",
        "Some gotta teach how to pronounce gibal Gib- bull",
        "You didn't use the sinnoh's real team. It was so broken that it needed a team full of legendary to take it down.",
        "I fucking hate that unfezant's stats are so bad, I fucking love unfezant",
        "2 months of casually watching videos from you. Finally subscribed  definitely earned with great content",
        "What if you took into account the exact same moves Ash had on those Pokémon though..",
        "You pronounced Gible two different ways throughout this video, and somehow still managed to mispronounce it each time.",
        "wheres is Orange Islands?",
        "You should totally make a video on what ash’s best competitive team would look like in vgc. Not including any Pokémon he had temporarily or released, but everything he currently has either on his journey currently and back at Oaks lab. I’d love to see something like that from you!",
        "that torkoal vibing tho",
        "“G eye ble”",
        "Before finishing watching this video, I feel like his weakest team has to be Unova\n\nEdit: Called it",
        "Cons of Ash's Unova team:\n\n-Poor Offense\n-Weak Defense",
        "Ash could have brought Krookodile instead of Unfezant as his fully evolved Unova pokemon. Krookodile was his strongest pokemon in Unova, it's a shame he didn't bring it for this battle.",
        "I really do wish you would've ranked Ash's team against Paul... but I'm happy the Sinnoh team got so far anyway!\n\nmaybe you could analyze it in another video?",
        "Took him damn long enough",
        "editing goes nuts fr",
        "Honestly I think my favourite battle to this day is still Ash VS Gary and Ash VS Paul, those episodes were so tense, now that I think about it I’ve never done a Paul Playthough team that would be so fun",
        "Gaible !!",
        "Interesting way to pronounce Gible.",
        "Do a video power ranking every world championship team since 2010 or something maybe then you'll actually have a good video. You're welcome for the awesome idea. Take it mate, I know you don't have many on your own.",
        "I hate Ash team in Black/White, is such a constant reminder who much it sucked",
        "Oh man, I'm so disgusted about what you said about corphish how dare you, that's your opinion I guess and it's absolutely NOT valid lmfao. Been using corphish for years competitively, corphish with adaptability, aqua jet, endeavour, knock off and dragon dance and he is the perfect sweeper with a focus sash, he is also OP in the anime!",
        "Unova is the worst team",
        "20:50 HEY NOW PIKACHU DOESN'T COUNT after the WHOLE start of the video  hey well technically if you used the Kukui Exhibition Match team it would be No. 0, Journeys would be No. 1 and Kalos would be No. 2 \nBUT it was after he won so it still quote on quote ain't his league team so yeah no complaints",
        "15:17 rip pilot",
        "COREPHISH SLANDER IS NOT APPRECIATED",
        "No, Seven Leagues is accurate. He never competed in the Galar League, he competed in the world coronation series. It's more akin to a tournament.",
        "Black and white is his worst team",
        "Please stop calling it guy-ble\nIts gib-ble",
        "With art anime from after XY, I don't think this is the same satoshi ",
        "Brooooo that Gible pronunciation is a CRIME! It's pronounced like nibble because Gible, Gabite and Garchomp are nibble, bite and chomp!",
        "GUYBLE?",
        "although it is an interesting video i think the team selection really was not that good. for gen 4 you should have used the team ash used against paul, for gen 5 vs cameron and for gen 8 vs kukui",
        "\"Guybull\"",
        "Now you’ve got me wondering what the best possible team was that Ash could have assembled every league based on all his Pokémon caught (and mostly favoring ones from the region he was in)",
        "You guys act like ash didint fight Mr.action replay guy with his hacked 6 legendary mons ..",
        "U can't tell me kalos team was the second best in competition battle it's only need two Pokemon end the whole career of that kalos team . alolan team was the best competitive team ever",
        "I love totodile "
    ],
    "comments_disabled": false
}