{
    "video_id": "nvTM03_8elE",
    "comments": [
        "Best one yet, don't try to go above this, it'll be difficult lol",
        "I LOVE YOU !!!",
        "These videos have reached another level",
        "This.Was.Incredible.\nThe amount of work put into this video looks insane and it came out so incredibly well!",
        "Love all of the content, has been a fav of mine for years. All I ask, can you please release the frenzy no zip hoody in black? It would make my DS drip complete",
        "Insanely good",
        "Ah, Morgott. The Lord unworthy of Leyndell or Grace, he deserved far more.",
        "I feel like I need to get movie tickets for each Vaati & Mispap release!! ",
        "The cinematography here is simply amazing. You’d almost think all these shots were from in-game cutscenes",
        "Morgott my love <3",
        "The latest videos are absolutely incredible! I love the cinematic style, and and you pull it off so nicely.",
        "One of the greatest prepare to cry.... Artorias, Gehrman and now the Dung eater those are the masterpieces... the ending is beyond flawless... likes and  subscribes not enough for this it needs more",
        "What armor pieces are you wearing in the video",
        "anybody every considered that dungeaters seedbed curse is kind of like what that amygdala in Bloodborne speaks of?\n\nif you don't no what I'm talking about, I'll just type the voice line here: \"Curse the fiends, their children too. And their children, forever true...\" ",
        "Only 1 episode left tomorrow! I hope you guys are ready :-D",
        "This masterpiece could even be showcased in cinemas.",
        "Broooo this is amazing",
        "To those asking what armor...\nBloodhound torso, nox bottoms(99% sure), and leather gloves.",
        "yooo vaati, this video is far beyond marvelous. The editing, pictures, scenes, sound effects, script, timing. You definitively polished your videos. gz!",
        "your storytelling has evolved and improved by leaps and bounds over the years, and we're all the better for it...\n\nthank you for all that you do and keep doing, vaati...",
        "oh man, great artwork",
        "Goodness these videos are amazing ",
        "7:36 what pieces of armor is this, I really like the look of it, and I just restarted a new game so I could go for some better armor pieces",
        "Seeing Briars of Punishment emerge from the seppuku ash of war sent chills down my spine. What an absolutely beautiful idea.",
        "A ELDEN RING has anointed its Storyteller",
        "Vaati really takes the quality and just ups it each time",
        "Comment",
        "Can we take a moment to appreciate how much time and work he puts into these videos for us ",
        "Order is not peace nor is it prosperity. Order is Order, regardless of the form it takes as long as things are structured, placed and controlled Order has been achieved and the Greater Will does not distinguish motive. Melinia could bring about the Order of Rot and that’s fine, the Golden Order could be restored and that’s fine all that matters is that chaos doesn’t thrive.",
        "Tbh I feel both good and bad, to be able to watch this for free with this much quality, time and effort put into this it's just  wow",
        "The tarnished in this video is wearing my exact fashion in game. Down to the monk legs and hairstyle.",
        "Damn that was cool. Congratulations on trending, Vaati and co.",
        "I love how the sight of techno strikes fear into anyone who sees him, Rest In Peace Alex",
        "Awesome being here during the premiere, the art be John Devlin at the beginning was amazing! You’ve outdone yourself again Vaati!",
        "Vaati showing off his builds in these videos goes to show just how deeply he digs into these games on all possible levels",
        "outstanding content, as usual",
        "Another Stellar Video Vaati. What a way to celebrate our GOTY winner   Elden will always have a special place in my gaming memories and these videos just make me fall in love with it all over again. Fantastic voice overs, editing and it helps bring my favourite gaming World to life ",
        "i find it incredibly intersting that although the dung eater was embracing defilement, in a way you could see that he was actually trying to revert life to its primordial state, rebelling against the modern faith yet embracing the roots of its origin, in which the truth of the primordial crucible was twisted to spur the upbringing of a new religion.",
        "This was amazing to watch, cant wait for you to tackle the other ending as well. I love how the dung eaters curse mantra is a call back to the Baneful Chanter from Bloodborne, \" Curse the fiends, their Children too, and their children forever more.\"",
        "Very funny how the automatic English subtitles calls Marika \"Queen America\"",
        "Elden Ring GotY",
        "I'm 20 seconds in and the art is already insanely impressive! This is going to be a good one :)",
        "Dude, the quality of that video......just amazing ",
        "Love your work",
        "This is the first thing to make me want to go for the Age of Despair ending",
        "One of those rare games where you can watch every \"storyteller videos\" and will get no spoilers at all about the in-game storyteller. Lol...",
        "\"Morgott tried to be the Erdtree's protector. He was never loved, and should never have learned love. But nevertheless, love the Erdtree he did.\"  \n\nThat's the line that did me in. That's the line that made my tears flow.",
        "Incredible",
        "Who's the npc from 15:47 ? never heard this dialogue before",
        "grabs popcorn\n\nNOT NOW WOMAN I AM LEARNING LORE",
        "26:28 Very Pathologic 2-esque.",
        "Blackguard is actually a pretty cool dude.",
        "i am blown away by the quality and care put into these videos everytime, thank you vaatividya for blessing us with your voice, and video making skills <3",
        "the quality just keeps getting better and better over the years, truly happy to watch you over the years <3! keep up the fantastic work you and your crew do!",
        "Now this is a video im going to enjoy  ^_^",
        "There is no wrong answer when picking a class in a from soft rpg, but the correct answer is faith.",
        "You and your team put together an amazing piece of work here, Vaati. This is really top shelf stuff. \n\nThat said, Dung Eater can get stuffed. Prawn Bro for life.",
        "@Vaati, bro i think it is safe to say you should release an official audio book with complete elden ring lore, in a manner similar to silmarillion",
        "Your videos have always been great, but somehow they keep getting better. Excellent job as always.",
        "This could be its own indie horror movie",
        "What armor did he wear during the video?",
        "This is so neat!",
        "In past fromsoft games they’d have made someone like the dung eater a misunderstood character. However I like the idea of someone being hated by everyone and when you finally meet him your realize that everyone was right.",
        "You are too generous to share with us this content for free. This is a cinematic masterpiece",
        "What’s with this strange new style of videos",
        "\"Have it written upon thy meager grave... felled by king morgott, last of all kings\"\n\n-Morgott the grace given",
        "One of the best lore channels on youtube fullstop",
        "VaatiVidya is the fallen leaf",
        "I cannot just watch this entire video and not praise the insane production value in it. You guys really go above and beyond with every video",
        "Honestly I love the video and a hats off from me but what’s perplexing me the most, is WHAT ARMOR YOU’RE WEARING like is leyndell knight like what is that armor?",
        "Wtf is this quality, keep up the good work.",
        "I swear at this rate his video on Goldmask is going to be classified as a feature length film (40 minutes+)",
        "Everytime I play, the dung eater dies in the sewers. Bogart must be safe.",
        "Mohg looks so sad at the end of this video.\nHis coming age, the Mohgwyn Dynasty, usurped by the Dung Eater of all people.",
        "This has to be one of my favorite lore video",
        "Vaati really said \n\"Who just reads the wiki? who does that?\"",
        "Ah, good, more fuel on my \"fuck the Golden order\" bonfire. \n\nAnd I had no idea about the Cut Dialogue for the noble, but he just adds to my dislike of Leyndell. The place always felt oppressive to me. All the gold and marble might look nice, if you're into that (gold is far too gaudy for me regardless, but the Marble is nice), but the place has an air too it that I can't stand. I think it's the Erdtree, to be honest. Its like living with a judgemental god breathing down your neck, watching every move. All while knowing there are people who's only crime was being born 'wrong' living trapped beneath your feet.",
        "Didn't expect to hear RicePirate here. I want to see FromSoft actually bring him in to voice in the next Armored Core.",
        "This is the intro From software needed for this game.  Thanks for explaining so well",
        "You have some of the highest quality content on youtube",
        "world class editing",
        "I have a few questions, not related to this video, but still related to ER. \nWhy are there so many runes found in cemeteries? Why are there specific names for some runes?(Lords rune, hero’s rune, numen rune) and why when you lose your runes to dying, they look like little sprouts on the ground before you pick them up again? I just wonder if there’s any special or lore reason.",
        "Fantastic work Vaati. Amazing content",
        "Holy production value batman",
        "Well done to everyone involved in making the prepare to cry videos, they are incredibly good.",
        "goatse vidya",
        "I'm just going to continue to link Vaati's videos to people that try to say Elden Ring doesn't have a Narrative.",
        "I'm only 5 minutes in, but this is already insane quality! I'm absolutely stunned.",
        "Dung eater main character",
        "Just when you think it can not be better you release this. Bravo my friend bravo",
        "The content in general is just becoming more and more elaborate/gorgeous. The cut content throws me off a bit because I wonder if I missed something but it's still so cool to see!",
        "I had thought the dung eater had buboes, but its not, its cut horns...",
        "You should be proud of this video man. Wow.",
        "I love this. But I miss the old style lore videos.",
        "Whoever directed  and put together this trailer with the music needs a commendation",
        "Seriously these videos should get nominated for Grammys etc",
        "dude the production is insane. Bravo mate bravo",
        "I still wish Malenia and Miquella had their own ending tied to them, maybe if you defeat Mohg before Malenia it'd be interesting to be able to offer something to Malenia at the beginning of the fight, you could lead her to where Miquella is, I think it'd be quite interesting to see what an ending like that would be like",
        "Slight correction: GODRICK'S rune is the anchor ring, not Morgott's.\nGreat video. Slightly too long, but you can tell real effort went into it!",
        "this video is very good already",
        "What a beautiful video",
        "Piece of art",
        "I love this new cinematography format",
        "What is that armour you use through out this video?",
        "I hardly finish any Netflix episode, but this! This make me nail in place until the end.",
        "Great video!",
        "At 22:15 what does the dung eater scream?\nSounds like 'bless you' but that makes no sense",
        "Simply beautiful",
        "This was fucking incredible",
        "I was actually hoping to see the original Morgott cutscene. The 1.00 version had way different effects on the breaking sword that I think matches his dialogue better.",
        "Masterpiece",
        "The cursed ending is clearly the ending that leads to the dark souls universe. Just me?",
        "Wow, absolutely great video",
        "I got a question tho. If the omens were a product of the Crucible and the Crucible was the primordial form of the Erdtree, why does the Omen Curse damn souls away from the Erdtree and banish Grace?",
        "And yet people say, that ER stories are boring, graphics are bad, fights are not interesting...",
        "Love u man , u make me play this game again and again and agian with different view",
        "This was absolutely amazing, I loved every second of it. The cinematic shots along with the artwork and animation and the music go so well together. All explained with a calm and soothing voice along with images so the viewer doesn't get lost. It was incredibly entertaining to watch, from the beginning to the end! Props to everyone that worked on this, your work is extremely appreciated!",
        "I can't even begin to describe how much amazed i am. It was just so beautiful thanks again for this quality !",
        "Do you think that Seluvis's potion would have worked had it been used on a demigod who's soul wasn't circumstantially unbound from it's physical form. I always felt like his one miscalculation is that he asks you administer it to the one Demigod who doesn't rely on the corporeal form she resided in. He was trying to turn a puppet into puppet from what I gather.",
        "damn",
        "Your piece returning to Artorias brought me to humbling tears, overwhelmed by a well-told story bravery and sadness.  Here, a grown man, my eyes wide, I dared to wonder like a child.",
        "FINALLY A NEW ONE WE ARE WAITING FOR YOUR CONTENT <3",
        "The production value is just insane! Felt like a movie. Great job and please: MORE!!!",
        "Doc's natural instinct is to get involved and I don't think that will ever change. However, there were times where the comms, tactics & decision making as a duo with Courage were on point, and those were the games he fried.",
        "These are all just beautifully told. \nA golden age of lore :)",
        "Amazing work as always! Can’t wait for the next video!!",
        "Made me cry in the first few minutes.  That’s a new record by far and its cuz of the absolutely amazing art and setup.  Holy crap man this is awesome!",
        "I really don't say this lightly, but this art is amazing... Really, its rare that I am so blown away by artworks. This looks like it came directly from Fromsotfs amazing art-team. Really, wow...",
        "The only \"good\" ending.",
        "Time for crab! Perfect timing actually. I’m eating crab Mac and cheese.",
        "This feels like a DLC. Insane production! ",
        "Holy shit",
        "Man, too much Dragonball, too little lore :(",
        "Masterpiece! And my favorite Topic Dung Eater is the Best",
        "You forgot the bit where grace is leading Godfrey to the player.",
        "You get such amazing footage of this game. Seriously over the top. Well done. Yet another awesome video",
        "Best ending",
        "This is some next level editing holy moly",
        "So what ending do you get if youve done the dung eater, the madness & rani's quest to completion? I will finish the game one day and get my answer I guess lol",
        "This reminds  me why I love Elden Ring  and such games. A love for the misunderstood  and outcast. Reminds me some of  the Dominican  Art style.... no wonder I love it too.",
        "Great music in this episode!",
        "If Elden Ring doesnt win Game Of The Year, it will be the biggest robbery in the history of gaming.",
        "I've developed a strange admiration for Morgott \nhe's a warrior comparable to his father, has skill with sorcery after his mother, and a king who is truly devoted to a path he thinks is best for the world.",
        "Cry a lot... check.",
        "Was the choice of using the new animation for Morgot's blade reveal a conscious lore related one or more of a thing that just happened because current patch was used to record?",
        "ER was the best game for me but the story's n lore do nothing for me",
        "I find the story of Dung Eater so hauntly wonderful yet so vile that i could not bring myself to do it. Thanks for the amazing video Vaati!",
        "I think a very ambitious and gutsy direct sequel to Elden Ring would be to make the Dung Eater ending canon. Then play as one of the cursed and misbegotten in a rotting Lands Between trying to rise up and end this broken Tarnished who took up the Seedbed curse and blessed this land with despair for thousands of generations",
        "so \ngood",
        "That one got me, I’ve always felt bad for Morgott. I’ve been watching your channel since dark souls one it’s crazy to see how much the content has changed.",
        "the first song is so beautiful",
        "My guy rollo, been rolling in the deep",
        "Hardly comment on anything, but this might be the best video on a video game out there. The combine talent and passion of the people that made this happen... just amazing!",
        "What's the lore behind Margit not appearing if you kill Morgott but the one in Leyndell does?",
        "UNBELIEVABLE video, such a wonderful wonderful, what a creator, what a community",
        "You've really, really outdone yourself. This is insane production value and tugs at all the right heartstrings, while telling a complete story. amaaaaaaazing work. much love always\nmy favorite moments:",
        "You should be hired to be a narrator to a whole game fromsoft or not, such an amazing work, such an amazing talent, greetings from Mexico Vaati.",
        "Perhaps Serosh was akin to the omen, as if the power of the crucible (life itself and the great beasts it creates) was the true spirit in the body of  a man. Meanwhile, the misbegotten and omen are merely the outward fusion of life and men, to varying degrees. In the end, all are human but the hubris of sight plagued lyndell. To shackle the beast and force him to be a man before condemning all whose crucible blessings could not be covered was to doom Leyndell and the Greater will.",
        "Notifications set: ALL\nVAATI!!!!! THIS IS EVEN BETTER THAN YOUR LAST VIDEO DAAAAAMN",
        "Great GREAT video ",
        "A lot of work was put into this video , congratulations to all of you it is indeed a spectacle to watch , I even got goosebumps,  trully amazing Vaati.",
        "Ok just waow",
        "That is the best content you've ever made....wow...the quality....",
        "(In Marika's own words.) My Lord, and thy warriors. I divest each of thee of thy grace.\n\nWith thine eyes dimmed, ye will be driven from the Lands Between. Ye will wage war in a land afar, where ye will live, and die.\n()Then, after thy death, I will give back what I once claimed.",
        "The work that went into this....",
        "FUCKING AMAAAAAAAAZING GOD BLESS YOU VAATIVIDYA",
        "Wow you really stepped up the visuals for this one. Incredible video Vaati. Vaati and Miss Chalice crossover, when? Prayge",
        "Might be like top 10 videos on youtube tbh",
        "Dungeater seems like a fighter against the outer god. His curse may not be as terrible as people are led to believe to be by the Greater Will.",
        "The best so far\n1. Lord of Frenzied flame\n2. The blessing of despair \n3. Boss lore",
        "This is another level. Thank you Vaati and all who worked on this masterpiece.",
        "I noticed the crucible knight wing attack at about 35 mins, is that from the garden of eyes mod?",
        "How does he make videos this good? This is game footage for gods sake.",
        "after watching this , i don't even know how god of war ragnarok can compete with Elden Ring",
        "You're really a creative force of your own, yet I think what makes you stand out amongst YouTubers is your determination to pull together lorehunters, artists, hackers and editors to string together these remarkable tales. I'm so impressed at how you tied all these disparate threads together - this coulda just been a Morgott 'Prepare to Cry,' but you've really tackled so much in one go!",
        "Thank you for this amazing good night story",
        "Wait, the story is happening thousands of years after the shattering ? I though it was not so long ago",
        "Gorgeous! Amazing work!",
        "These games are more like books than anything else encompassesing a whole world with such deep and hidden struggles from soft is truely amazing im so thankful we get to see a studio actually deliver beyond expectations",
        "why are there omen if the erdtree denied the rebirth if them. ither its a curse from souls being rebirthed or the golden order is falsely determining what the erdtree will or will not be rebirthed into the lands between",
        "This is great, how dose he make those ingame videos I know that you can record yourself playing but, it is like there is another camera recording him while he is playing. I am not video editor so my knowlage is limited but this video peked my intrest because it is that good.",
        "Man, the sound effects and music synced with the footage here and the structure of the entire thing is just incredible, can't lie. Very impressed, the Margit part gave me chills",
        "Hot dang, you're really going all out huh?\nAnother cracker of a video, bravo to everybody involved!!!",
        "Oh, the dung eater's armor is meant to resemble broken horns? I just thought it was meant to look like giant bits of corn in a turd, you know cause like...well, you know! ",
        "This is top notch production.",
        "Damn mate, you made a masterpiece here :)",
        "Didn't realize that Agent Ward was Freyr",
        "Dung Eater has a point if you consider the Erdtree and the Golden Order to be the unnatural influence of an Outer God. There's nothing inherently wrong with being an Omen, they are just cut off from returning to the Erdtree and shunned as a result. It's the only ending that rejects the Greater Will without destroying everything like the Frenzied Flame.",
        "Godfreys tenderness towards Morgott presents him so well. I believe he had accpeted the aspects of the crucible from the beginning. Fighting side by side with the crucible knights. Teaching them to shatter the ground with a mere stomp and leading them to victory against many great foes. Godfrey himself was a tool unfortunately. Tamed by Marika and forced to abide her will, the will of the golden order. When he held morgott in his hands, it must have been painfull to him. Seeing as to what the golden order has made with his very own flesh and blood. And knowing that he was powerless to the very end.",
        "You missed this beautiful quote ,\"If the order is defiled entirely then defilement is defilement no more\".",
        "WOAH! I have just two words to describe this:' Holy S%#@!' One of the most impactful, that I have EVER seen! Genius, a work of art! Keep it up!",
        "Elden ring in a nutshell:\nMan with horns: cursed\nMan who has grafted hundreds of limbs to his own body:I mean he’s fine",
        "What's the dung eaters accent? And... why? I'm no good at accents so it sounds either Australian or South African or like... Whatever accent that was in the original Fable game that called you 'chicken chaser'",
        "I liked the soundtrack and animation \nIt is amazing",
        "amazing",
        "this video is so well made",
        "kinda disappointed there wasnt any of mohg, although, getting a lot about morgott was still very awesome",
        "this is a masterpiece",
        "As always Vaati you and your team have done an absolutely amazing job.  From the beautiful cinematic shots, to the absolutely stellar lore friendly fight scenes. I have watched your videos since dark souls 3 and you have always left a wonderful impression. It's great to see how much your content has grown!",
        "I'm thinking I misunderstood the dung eater's questline",
        "Wonderful work, Vaati!",
        "wow \ni didn't even know there was another ending",
        "This is edited so well. Thank you. I wish game companies would makes movies like this.",
        "i'm just at minute 5 and a thing came to my mind: why the flying heck cant we never ever trade SOME sentences with those Lords? Like telling Melania where we found her brother, offering salvation to her misery ... these things would lift immersion again to another level. Maybe in another FROMSOFT game ;)\nok i keep on watching now",
        "God damn dude.",
        "Absolutely stunning. I wish FromSoft didn't hide so much of the story and lore from more casual players. I'm currently halfway through my first play through and it's so easy to miss the details of this wonderful setting. It saddens me that much of what went into building this world will go unnoticed by most players.",
        "What armor is that at 7:40?",
        "36:20 go hard af",
        "4:52  when I’m down to my last piece of gum and my friends want it",
        "This honestly felt like a movie of its own. Bravo",
        "This was an incredible production. Thanks for the all the hardwork to everyone who participated in this. Souls community it’s really something else.",
        "Excellent work, i really hope you do more, i especially want one about Ranni's ending (Iji, Blaidd, Seluvis...) and Fia's ending (|Both D's, Gurranq, Godwyn, Fortissax) , maybe even Goldmask (Cohryn)",
        "26:58 another awesome shot ",
        "Tremenda obra maestra 10/10, goty, oscar, pulitzer, nobel. Denle todo.",
        "I don't care how righteous people try to make the Dung Eater look. He's a monster and I will not let him defile my mate Big Boggart",
        "Dude you’re amazing",
        "I missed the premier, and I'm not even finished the video yet, but this is easily one of the best looking videos you have ever made, and I'm so excited to see the future of this channel",
        "Finally I feel like this will give people a better understanding of Morgott’s tragic story, the dung eater, and the age of despair ending. I’ve always loved Morgott’s character and many people don’t even know his story so I’m glad it’s been told in such a amazing way.",
        "holy wow, this art is amazing!",
        "This video is incredible. The music is fantastic. I was glued to the screen. Well done to everyone who worked on this masterpiece.",
        "You guys did an amazing job on that Bravo",
        "Maybe the greatest single summary of the game’s lore ever recorded. And to be done with such production value. Quite an achievement indeed. Bravo, Vaati. This one is for the books.",
        "Poor prawn guy ;-;",
        "Such a good quality video",
        "Nice to see you are progressing instead of staying stagnant.",
        "34:55\nthe amount of time i spent trying to find this attack. and then discovering that its the one Crucible knight attack you cant get saddened me deeply. my whole shtich was being Holy. Double scythes as wings and holy spells to boot with blessed weapons.",
        "I had a cold when Dung Eater invaded me, had to sneeze and was surprised he responded by screaming \"BLESS YOU!\" at me. \nI know I had just misheard it but it was so funny that just couldn't hate him after that, I ended up using the Doll potion on him and rock him as my main summon.",
        "Banger",
        "god damn that was well made",
        "Anyone know what armour set the tarnished is wearing in this video",
        "this explains so much. isn't it interesting how Morgott's cursed blood is amber? maybe even the same amber which bleeds from the Elden Beast? and how fascinating that the Three Fingers exclaim their despair over the mistake made by the Greater Will, a mistake it wishes to wipe clean from the Lands Between in a cleansing fire that would melt it all back to its primordial essence, the Red Gold of the crucible.",
        "I am having a really hard time getting into the story/lore of elden ring. Hoping Vaati can help ignite my intrigue.",
        "Such a beautiful story and a truly well made video",
        "very pretty",
        "Game of the Year",
        "Hey Vaati - I love your content and want to make my first gaming video on my channel. I have one question! How do you know what music from the game you can use and how much you can use? I mean without getting a copyright strike. Would love some info on this. Cheers! Ryan",
        "Excellent and beautiful",
        "you should make a video about godwyns story. its so insane and theres some theories that it also links to the crucible",
        "Day 1 of asking Vati to make a side channel for reading bedtime stories. Something about your videos and voice is just so peaceful and calming even with such dark and disturbing source material",
        "Wow the art work on this is beautiful",
        "Holy shit\n\nThis was absolutely amazing Vaati!",
        "Yo that animation at the intro sequence was legit pretty fantastic",
        "I feel like Morgott and Mogh weren't locked in the sewers always. I feel like Morgott was in fact out of the sewers way before the Shattering. The hammer he uses is the Giant Crusher. A hammer used in War of the Giant and later fell out of use which leads me to believe that he was out of the sewers way before the Shattering. Not to mention Morgott already having an order of knights by the time Godwyn was killed which we see in the trailer, the way he talks about his siblings as if he knew them personally (He is respectful with Radahn, hateful towards Rykard, mournful for Ranni, nostalgic for Miquella and Malenia and even uses Godrick's actual title), his way of speaking of them felt WAY too personal for him to just know of them by hearsay and I think he did know them and may have been loved by some of them, maybe by Miquella who loved the deformed ones and Godwyn who was ready to befriend Dragons. Not to mention that Morgott also created Sentry's Torches which means at the time Godwyn was killed he had to have authority over Leyndell's army. Not to mention that Mogh would have to know of Miquella's existence to even get to him and know where he was.",
        "Morgott is easily my favourite boss in Elden Ring. Not for his fight or the presentation or even the music, but his constant presence throughout the game. The Fell Omen, the Night's Cavalry, the scene with Godfrey holding his body and all inbetween. He's one of the few noble souls, fighting for what he believed in, who retained their sense of self all the way to the end.",
        "14:53 uh who is this character?",
        "Some of your best work yet.",
        "Please consider being a director.",
        "Yo this is sick af this like a movie ",
        "What is that dodge in the fight against Margitt holy",
        "the level of production is insane",
        "This was....amazing!!!!",
        "This is fucking fantastic. Like a movie.",
        "This channel was built on finding out lore, not re-telling is what the game already gives us. Recycled content",
        "I think we're on the same page lore wise got me hype",
        "i always wanted to know more about the blessing of despair! dung eater is my favorite, but i never knew anything about his \"blessing.\"",
        "top tier vaativideo!",
        "a perfect horror",
        "The video is very well produced but the interpretation of the in game lore is wildly inaccurate and honestly kind of triggering that you are presenting this as correct. You literally do not understand how to interpret the lore. OnLy mIqUeLlA sOuGhT pEaCe, lol tell me you have no idea what's going on...",
        "So much effort put into this by your team, I'm sure from software will be happy for this community for the effort they put, keep up the great videos guys..",
        "Dude what the fuck is this production value are you kidding me???? incredible work",
        "@Vaati what kind of build are you running in this video? I’m more talking about the faith incantations earlier in the video, looked like a lot of fun to run",
        "Wow .",
        "king shit",
        "Vaati The Lore-master, knower of all, teller of stories. Guide us with your triumphant voice of passion away from the shackles of ignorance, and into an age of knowledge.",
        "Each video more beautiful than the last, really impressive\nNice job guys!!",
        "The quality of your videos is outstanding.",
        "Wow this is awesome",
        "The Blessing of Despair is one of the most interesting endings to me, it's a true change of the status quo and stands out as really unique among the other \"basic\" endings.",
        "Wake up babe, a new VaatiVidya video dropped!",
        "I think that the reason for the hate towards the Crucible can be laid at the feet of the Greater Will, I imagine that the Greater will despised the Crucible,  because it was something that it could not control, it could not manipulate it, or guide it, or shape it, and that worried it. Here was something able to give people powers that were beyond those of any normal people, powers that if harnessed correctly, could come to pose a quite serious threat to its design for the Land's Between, and it was something that already had followers and belief vested in it, all things the Greater Will wanted for itself and it's Golden Order. ",
        "these videos are so beautiful",
        "Man how's the artistic",
        "Incredible editing and footage Vaati you just keep getting better, can’t wait for the Edwad lore version",
        "One of the very best Vaati videos I've ever been fortunate to watch. @Vaati, they talent befits a crown!",
        "I really love how you do story telling..\nAmazing video as always.. thank you !\nMakes my day a lot better..",
        "Viss count... Vie count",
        "Elden Ring lore has really brought out Vaati's potential for concisely putting together relating questlines into cinematic stories. These new Prepare to Cry videos are the closest thing we will get to Elden Ring the animated series. I'd love to see you go back and do Dark Souls and Bloodboune with this level of work. Return to your roots so to speak.",
        "So much time, money and effort goes into this series. It is just amazing and it really pays off",
        "I absolutely love how cinematic you make these videos. Fantastic job!",
        "The story is so beautiful I did cry",
        "please have the artist for this episode do every single one.  hire them full on.",
        "Gotta say the documentary type editing is so good vaati. God tier stuff, really loving your concepts for content and storytelling!",
        "I see now that the real problem with this ending its the marketing. Change \"despair\" with \"fun\" and the guy who sells it to \"Flower Eater\" and we got something here.",
        "\"Willful traitors all.\"\nBefore Malenia was my favourite of the Demigods you fight, then Radohn. But now I can say that Morgott is my favourite. His story is just perfect.",
        "Hard question, are you able to do the Age of The Stars ending quest while doing the dung eater quest? I'm so interested on doing this.",
        "Damn it! I'm subbed for all vid notifications but I missed this one!",
        "So, are the \"hollow\" people even produced eith corpse uptake through the erdtree's roots? If so, is becoming  disconnected from that cycle of rebirth as an omen (yeah, the crucible's blessings may be as sketchy as the puter will's) necessarily a bad thing? Being a composite form doesn't seem that bad as opposed to being endlessly reborn mindless",
        "i love you Vaati. Amazing video as always",
        "I am speechless.",
        "I have one question: was the Dung eater himself an Omen? Or did he just wear an armor that looked like an Omen?",
        "Let me speak for everyone when I say “nobody wants your videos to be shorter.”",
        "Great video as always! I was curious what mod was used to pull off the crucible wings? I've been wanting to tinker with a crucible knight build and those would be perfect!",
        "Who/what tells you that Godfrey is leader of crucible knight?",
        "Do a prepare to cry for duskborn or age of stars",
        "well done",
        "The clips the intro the art the sfx the visuals it’s all so well done. Bravo Vaati! Bravo!",
        "im a pretty princess",
        "Just realized that the song that plays at 22:35 (when Morgott enters and trashtalks the other Demigods) is a somber remix of the main theme/Final Battle, and I’m here for it. \n\nIncredible stuff, really.",
        "20:16 Geez, that's a pretty horrible thing to say... You do realize the game confirms in no uncertain terms what he does affects people who haven't been born. People who have, by definition, committed no wrong. \n\nRegardless of what is being done to the Omen, the Dung Eater is one of the few NPCs in FromSoft's library that is truly evil. He is causing pain and suffering for its own end, potentially denying people their afterlife, and he does so recklessly and without regard for anything or anyone. There is no moral framework in which his actions can be justified or viewed as rational or reasonable.",
        "Truly the best content on Youtube. All who worked on this must be more than proud of this beautiful Eye-blessing",
        "Bravo. Brilliant piece of cinematography and storytelling!",
        "I love your lore videos. Keep up the good work sir.",
        "This is amazing work! ",
        "23:55 This sequence is amazing, and really shows off the great diversity and variety of characters, with all their insane traits, looks, characters, flaws and so on...\nGrafted monstrosity, weird infant egg, scarlet rot ridden swordswoman,  rot-madness stricken, gravity controlling warrior general, noble devoured by huge fucking snake, and princess who killed herself and moved into body of 4 handed doll to continue her plans...",
        "Damn, really well done.\nAs a bonus: I never have to get this ending to enjoy it because bleargh.",
        "Love this! The cinematography is just beautiful\nGot a question tho, anyone know armor was the tarnished using? it looked so cool",
        "this is some insane production value. Its amazing to see how this channel has grown.",
        "Awesome",
        "Man this one was truly epic, the music, the editing, the narration...  Another reason why watching your vids has become an integral part of every souls game...",
        "I thought that the last video was hard to top, but wow ",
        "Can we have sliders for your character?? She looks so cool and menacing! Such an amazing video, thank you Vaati and all who were involved!!",
        "Thank you for being appreciative of a fan keeping the VODs and not pulling a Soviet Womble, and deciding only what you think is good content is being shown. Long content is nice to have watching or in the background. <3",
        "So Godfrey is cursed and Marika exiled him for this and made Radgon to have a pure bloodline... but how Godfrey became caused at first place???",
        "I like the slow transformation of your Tarnished from noble warrior to a creature of hate and rage.",
        "Do you speak Russian?",
        "The art is WONDERFUL. Another masterpiece that makes the wait worth it.",
        "The visuals where so striking that my food went cold",
        "It's interesting that both Godrick and Morgott have anchor rings, and by way of standing in between you and Godrick as Margit, Morgott protects both.",
        "These paintings/animations are top tier, the script is excellent, all brought together by Vaati’s incredible narration. I wasn’t expecting this today but I’m glad it happened. Thank you, Vaati. You’re a legendary creator whose name will be known, even many many years after you stop making content. Thank you for everything you do and the other creators you bring together to make content like this.",
        "Why no one points the parallel between the dung eater and the old hunters from Bloodborne? I mean, even their quotes are similar \"curse the fiends, their children too, and their children forever true\" referring to the defilement caused by the old hunters, defilement which resulted in the curse of the hunter's nightmare. Just like in Bloodborne, Elden Ring gives us a new curse caused by defilement, just with some different tweaks.",
        "Always funny to me how much that tree looks like the Evergrace tree.",
        "RADAHN WON AGAINST MELANIA AND SHE DOES KNOW DEFEAT",
        "9:35 Anyone know what this song is? I can’t seem to find it anywhere",
        "This is beautifully done ",
        "Why is it so hard for me to get into this? I’ve played it so much, I watch all of these and yet, I’m indifferent.",
        "blimey. that was a ride. Brilliantly put together",
        "Absolutely exceptional video, even by your own high standards. Explains so many little things about the game for me. Thank you so much for pouring yourself into these videos, they are masterful",
        "This is Hilarous",
        "No one loots old stuff that one guy joined the chat him: its my time to shine",
        "What an amazing amazing feat and video. Second to none. Our true Elden lord ",
        "I know there's novices to the souls series complaining about the lack of story and say this game doesn't deserve to be nominated, they just don't know people like you exist to do the research and tell it and Those that are too lazy to read it and just wanna play the game. (I'm guilty of this second one) you are by far the best and only person to tell it. The tone you set to tell it is phenomenal! I've been subbed to you since Bloodborne days and you never miss a beat. I'm glad someone such as yourself exist to go through the muk and grime and unravel the mysteries in these series.. you're incredible man. Thank you.",
        "What an incredible game. The stories GRRM and Miyazaki created are uniformly excellent, but also meticulously hidden from the player, leaving amazing folks like Vaati to piece it all together. It’s a singular achievement belonging to fromsoft, truly in a league of their own",
        "Elden Ring anime would go so hard",
        "Wait, where do you get the wings???",
        "You have the BEST Lore Videos PERIOD!",
        "-30 seconds in, already looking good",
        "for some reason, it's Solaire, crestfallen",
        "Considering what he did to Miquella, his own half brother, yes, Mohg was reeeeally far from grace",
        "There is an absolutly wonderful trilogy of mods for Skyrim, Vigilant, Glenmoril and Unslaad. These three mods are very much inspired by the soulsborne games but keeps everything within the Elder Scrolls universe and lore. The two main antagonists are Hermaeus Mora, daedric prince of knowledge and a mysterious figure known as the Anatomancer and it is astounding how close the themesbof the Anatomacer and thr Dungeater alligns even though the mods came out first. The Anatomancer is essencially the culmination of every single bad choice the player could have made durring the trilogy and is in a way us, the player. Both him and Mora wants to use the phenomenon known as CHIM/AMORANTH for their own, vastly different, ends. For those that dont know the Elder Scrolls universe is canonically a dream of the mind of the so called Godhead. Very few people in universe are aware of this and typically finding out yelds three different results: the most common is called \"the zero sum\" where you realize that you are fictional and your mind cant accept it and you are erased from the world. The second is called achieving CHIM, it is essencially lucid dreaming where you stand by your existance though sheer ego allowing you to change the dream around you (people who hs achieved this includes Tiber Septim/Talos and Vivec). Somewhat related to this is Amaranth where you fully accend and become a/the new Godhead. The third option is very rare and has arguably happened only once (fans specualtion includes more cases), the Sharmat, a person who does not believe they are the dream but instead the dreamer or the Godhead itself (Dagoth Ur is the only concrete case we know of, although fan speculate that Miraak could be another if only theme-wise).",
        "Wow, what an amazing video, like a movie, insane work! Cheers from Germany ",
        "There's a reason Vaati is my favorite soulsborne lore content creator, while other talk about the lore, you tell a story that gets us invested in these games, I played these games way before I found your channel, I liked them but not that much, I didn't even know these games even had good stories or lore, and because of you Fromsoftwere games are my most favorite games of all time and I enjoy them a million times what I did before.",
        "I have so many positives about this video that I can’t fit them in one comment.",
        "You've outdone yourself with this one, Vaati. Brilliant work, mate, well done.",
        "one of these days, vaati and team will really pull up with a whole animation or something. these videos are getting crazy in production  value.",
        "What is this recommended video?",
        "wow this new animation is beautiful. really ads immersion to your video. thank you very much,.",
        "Whos the NPC with the rulers mask. I never seen him and i never heard that dialogue",
        "Vaati is the Morgan Freeman of soulsborne lore",
        "Fantastic vid! Love the animation!\n\nDoes anyone know what build they’re using against Margit here?",
        "Wow this video and the cinematic are incredible!!",
        "why not do one for the age of order ending",
        "how sad",
        "Bro I got to pay more attention when I play",
        "Amazing video! I am just a little confused though, because I thought to be cursed by the Dung Eater he had to defile your \"corpse\", meaning after you have died. And I assumed that by killing Boggart ourselves we prevented him from being cursed because the Dung Eater was not able to complete the ritual. Is this wrong?",
        "Giving birth to an omen would not be very pleasant with thise horns…",
        "Damn how is he keep getting better.",
        "In game editing looks good but I think you get carried away at times lol I miss your more subtle approach to things.",
        "your videos are a piece of art! Music, Editing, the script.. just awesome! looking foreward for more of your content :)\nGreetings from Berlin",
        "your best ER video so far. and one of your best videos of all time. very well made. very cinematic and showing once more why this channel is the lord of all fromsoft lore channels.",
        "Beautiful",
        "Man this is awesome. no words...",
        "Vaati, hope you know that I ordered your book 3 months ago and still haven’t gotten it. Honestly I want it but man it’s bull how long it’s taking",
        "The curse that passes down to their children sounds like the bloodborne hunter's dream curse",
        "Wow...",
        "This makes me want a Ranni-style alt ending for Morgott. The poor guy deserves a break.",
        "Latin lyrics actually make sense, which makes the song even more beautiful. Thank you Vaati for your awesome work.",
        "the dung eater quest line was the most engaging part of the storyline for me....",
        "Na idk what you're on about bro.\nSaying radhan lost to malenia is like saying level 20 me with a +2 weapon is stronger than the godskin apostle in caelid tower na I used rot.\nAlso radhan was holding back the stars.",
        "Miquella is going to be one hell of a boss in the Dlc",
        "Anyone know what's the armor the Tranished is wearing at 7:41? Brilliant production as usual, Vaati.",
        "These videos are cool af but I wanna learn lore. Not watch a cinematic playtrough",
        "the production on this video is insane. Keep up the good work work chap",
        "the dung eater's head is next on my list now :I",
        "just hearing ur voice brings me an urge to play a souls game much love to u and the team",
        "Yo this is absolutely next level dude - congrats to all involved. Brilliant",
        "it would be nice if someone took all the crumbling ruins, degenerated creatures, dank palaces...and restored them to what they would have looked in their prime.",
        "Where the hell do yall find this lore? I've been playing this game for weeks and don't know shit",
        "The editing, animation, artwork, voice acting, it is all so great! This is really good and I love how well these video are being made!",
        "This episode was amazing and I think one of the darkest you've ever done. But also one of the best made. The art, music, storytelling are all top notch!",
        "4:57 \"Foul tarnished! In search of the elden ring\"",
        "This was absolutely stunning",
        "Thanks for this.",
        "I love how you give each Tarnished in your Prepare to Cry videos such personality and character!",
        "VaatiVidya i found something on a little fun fact. But I saw one of your old videos on bloodborn where you looked at a book in the hunters dream that was titled or call (how to Pick up fair maidens) i just thought it was funny since we as the player in elden ring er call maidenless ",
        "Love this long form collaborative work you have been shifting towards. Truly quality stuff.",
        "I sorta dislike these long action cinematic scenes",
        "absolute masterpiece of a video. Goddamn Vaati, you legend.",
        "Loving these videos. Can't wait for the other endings too.",
        "I wish there was more narration rather than cut content. I understand why it’s there, but I’d rather hear Vaati. Still watched and enjoyed though.",
        "Can you do a prepare to cry about the deathroot?",
        "If I am not mistaken, the voice actor for Morgott is Simon Templeman, probably my favorite voice actor of them all. He has a penchant for characters with twisted destinies, and really lends a sense of something that could have been noble and beautiful, but through a twist of fate, is made into something dark and accursed.  Fallen nobility so to speak. I think he did this role justice.",
        "This is incredible. It feels like seeing a great documentary tbh, amazing work <3",
        "Massive cinematography, you really step up the level in this one, really nice to see!",
        "you should voice audio books",
        "I love your Elden Ring videos! Thank you!",
        "Is that a modded in weapon art at 34:44?? Cos I need it if not. \n\nOnce again blown away by the production of this video. The cinematography and... Dare I say choreography?! Were both amazing",
        "Vaati would go incredibly far as a film director",
        "The art, amazing!",
        "This is so beautiful. My favorite one so far",
        "Magnificent",
        "HOLY SHIT THIS WAS NEXT LEVEL",
        "Have you ever heard that the theory for all the cursed children was because merica was sleeping with her son. I'd like to point out that Ratigan and merica are the same person so it's impossible to have kids. Instead I forward that the perfect son who died in the night of black knives was sireing all of his siblings. He could probably shape shift like his mother so he mothered the last 3 children. This is the reason that miquella rebells when he finds out and tricks his sister into killing his mom. Yet his mom was a shape shifted gorick the golden.",
        "I love how he can never disappoint us with his content :/",
        "these are genuinely insane",
        "I love how people are trying to think of roundabout ways to prevent Dung eater from killing crab guy when you should just kill dung eater because he’s an asshole ",
        "This video is insane",
        "The dung eater talking about, how he was going to defile each corpse so that their children's children will inherit it forever more, reminded me of Bloodborne and the Old hunters' curse.",
        "From the beginning I was looking for actual G.R.R.M. signs in the story;  there were some small things here and there, but this video really highlighted some of them for me. The Erdtree is clearly an allegory for Feudalism, the larger state from outside controls the raw materials of the conquered state, but due to the parasitic relationship, the entire thing inevitably falls apart at the seams. It's a pure mythological fantasy representation of reality. This perspective filtered through the lens of a genius game director from Japan and his infinitely talented team still leaves me in complete awe at the endless well of human imagination.",
        "is that crucibal wings sort of ashe of war at the end of the godfrey fight, or anything similar, actually usable in game?",
        "The one thing I regret while getting the Despair ending was Big Boggart's death... He just wanted to enjoy his seafood.",
        "Just have to say, Marika must be one hell of a woman to birth two horned babies. God or not, that's got to hurt. Fascinating that even she couldn't control her children born with the Omen curse.\nEdit: Also died laughing at that shot 7:33 great work as always Vaati",
        "I have never come across the viscount guy before",
        "Great story, too bad it's so obtuse to the player when they are actually playing. I thoroughly enjoyed the game, it's a visual masterpiece of art and the gameplay is just challenging enough, but you really don't know ANY of this shit unless you watch youtube videos of people like Vaati putting it all together.",
        "Which armour sets does the tarnished protagonist use throughout the video?",
        "And they were saying Elden Ring should not be nominated for best narrative ??!?!",
        "Is cut content even considered canon? Would using it in lore videos be cheating?",
        "incredible",
        "Wow…. Vaati really took this “Prepare to Cry” video to the next level with the animations, sound effects and soundtracks. This is his best one yet!",
        "pls continue your work, thought you couldnt top ds3 content , but this... even the frenzied flame video is absolutely amazing",
        "Geez man… your videos are just getting so much more amazing as you’ve progressed over the years. The quality of the content and the editing you’ve been using lately. Really really impressive. Keep it up.",
        "Thank you for such an amazing video!",
        "Vaati, I need you to do one of these for each ending. These are INCREDIBLE works of cinematic and storytelling genius. I, no, WE, need one for each ending. They will forever be cemented as legendary. Doing this kind of content shows other content creators what they can achieve. It’s an inspiration to another generation of content creators, and I FIRMLY hope you do one for Fia, Goldmask, and Ranni. This was incredible. This is something I’ll be coming back to on a regular basis.",
        "Damn, love the little artworks on it, this series has advanced! Started this series in ds3 and have been binging over the years and this is the best episode so far. Godspeed, Vaati!",
        "I love the poetic justice of turning Dung Eater into a puppet and making him fight for the Golden Order",
        "Put these foolish ambitions to rest!",
        "A beautiful narrative and art style!",
        "I can't believe how amazing this video isµ. I got literal chills watching this masterfully edited and narrated story. Thank you so much for that!",
        "The animation and artwork holy crap, this is next level quality and compliments your storytelling wonderfully",
        "What armor peices are those?",
        "I think that Miquella's kidnapping happened before Malenia went on her campaign south. I think she went south specifically because she wanted to find Miquella, even though it would mean spreading the Scarlet Rot.",
        "HOLY FUCKING SHIT!\n\nThese videos are getting better and better! The first two minutes brought tears to my eyes. Absolutely beautiful!",
        "This is amazing.",
        "wow these production values have skyrocketed. this? this looooooook goooood.",
        "that was incredible",
        "That went hard af",
        "Why did fromsoft cut out that npc from Leyndell? It is my favorite area but it feels like it really is missing something. I just can't wrap my mind around why they would do that.",
        "We don't know if thousands of years passed since Marika shattered the Elden Ring do we?\n\nRegardless, amazing video, music and photography especially",
        "That was a fuckin movie quality!!!!! Holy fuck such a great job, thx to everyone who has been involved in this master of work",
        "Do we know by whom Morgott was placed there? Does he rule in name of Marika or Radagon? Depending on the answer his role would change by a lot.",
        "Your cinematography never disappoints, you are such a gifted storyteller!! Never stop being amazing at what you do Vaati!",
        "6:08- I love the stealthy snarking here: “Warrior blood must TRULY run in thy veins.” Says the dude who’s dad is Godfrey…",
        "Holy shit man,\nYou and your team of collaborators are making art out of art and adding some art on top.\nEntertained, impressed, inspired. ",
        "The rise of Belzaubob...",
        "4:50 ... i got chills",
        "Can someone please remind me what the name of the top dude is? The one that’s Marika’s husband / part of Marika. Marika’s male form. What’s his name?",
        "Where is cc for english-turkish",
        "Morgott is such a hater",
        "I cannot even cry, I'm just in awe at how much work went into this. I especially love the instrumentation of the Song of Lament!",
        "As a Latinist I greatly appreciate that the Latin lyrics actually make sense, which makes the song even more beautiful. Thank you Vaati for your awesome work.",
        "Die Stimmung die du mit deiner Stimme rüber bringst ist genial. Wunderschöne Gedanken über die Meisterwerke die From Soft uns gibt. Vielen Dank für deine Videos!",
        "Just a straight up cinematic masterpiece. I've already heard this lore a dozen times, but the way this was presented really took my by surprise. An excellent watch from start to finish.",
        "this was phenomenal",
        "Love this. Wonderful work!! ",
        "the quality of this is insane!",
        "Another video, another masterpiece",
        "I was waiting for this video, honestly. I love seeing what you come up with regarding the lore!",
        "if i understood correctly. its kinda interesting that  with this ending, the crucible comes back in a pretty major way. granted maybe not the way it originally was, who can even guess how THAT era started. but a few generations, and horns probably arent gonna be called curses anymore.",
        "This was absolutely amazing.\nAre there plans for the other endings as well?",
        "Outstanding production value. This video was a joy to enjoy. Thank you !",
        "I wanna know all the incantations he used  I must be the only comment like this",
        "this edit is so good this is really what it feels like your first time through the quest. truly amazing thank you",
        "I came to be sad and cry, not creeped the hell out.\n\n\nStill an amazing video!",
        "Someone help me, the attack at 35:00 cannot be performed by a player, or can it?",
        "Visually stunning and we'll narrated.\n\nChills, bro!",
        "BRAVO BRAVO!!!!!",
        "Bravo!",
        "Vatti, your production value is absolutely off the charts. Hats off to you and everyone who helped put this together!",
        "lol I hear Mick Lauer",
        "I don't even play souls like games, but I will absolutely stop what I'm foing to watch Vaatis videos. THAT'S how good they are!",
        "Omg the best video I have seen in years bro absolutely quality",
        "This was truly amazing work. I can't even imagine how long it took to plan, research, write, film, and edit. I felt like I was watching a full length film. And it is only one story of many in ER!\n\nWhat blows my mind is that these soulsborne worlds are so deep/complex it requires a scholar like yourself (and the community) to uncover it all! Hats off to FROM to continue creating these stories to be discovered.",
        "Age of order ending plsss",
        "This is... bizarrely professional. Good freaking job!",
        "Amazing, just amazing",
        "Brilliant work!",
        "\" The Dungeater, his sword is fashioned from the backbone of a malformed giant, his armor resembles a noman, but with its hornes cut of, his form reflects the landscapes of his mind, AND his face mirrors the likes of Distortion2 \"",
        "Prepare to cry lady maria when?",
        "Anyone else thought Morgott was voiced by DC Douglas? He sounds so much like wesker",
        "wait. who is the guy at 15:00 . I have never seen him!",
        "This was mind blowing! Well done to all those involved!",
        "Thank you for you hard work. Keep them coming.",
        "Honestly didn’t even know you could make a mending rune with the dung eater",
        "This, is amazing.\nThank-you.",
        "Always look forward to every video made. So much passion for the lore/games. Epic!",
        "Godammit Maxor you ruined the Margit cutscene XD",
        "Shout out to you man, Great Video! You have really upped the ante ",
        "Did they add additional story??? i don't remember Godfrey holding his son talking about him when we first fight him, nor do i remember there being a shriveled up morgott we can talk to???",
        "The production quality on this is beyond impressive",
        "This channel deserves so much more love than it has.",
        "Wow just wow! Such amazing work here! Great job to everyone involved! I feel like I should be paying to watch this.",
        "So practically it means despair from golden order perspective right? It’s just returning to the crucible age.",
        "Vatie’s characters always have the drip in his videos! Does anyone know what armor the character is wearing in the Margit fight?",
        "just one contention about this time line here, Malenia was in a coma when her cleanrot knights brought her back to the halig tree and never even knew her brother was removed from his tree. she's blind and nobody told her what happened so she's just sitting there waiting for her brother to come out not knowing he was stolen by mohg.",
        "dude you made my skin shake",
        "Love me some VaatiVidya. But i don't know. Ds1, Ds2, Ds3, Bloodborne, Sekiro... They all have better story's for me and interested me more than Elden Ring. Its amazing don't get me wrong",
        "This video has a better narrative than the game does",
        "Wonderfully animated, expertly narrated... gave me chills.  Just a great job all around.",
        "does anyone know what armor the tarnished is wearing?",
        "These videos really are next level ",
        "prepare to cry...                                   ´cry alot..."
    ],
    "comments_disabled": false
}