{"video_id": "nvTM03_8elE", "comments": ["Because people are probably wondering - the Shanehaight NPC has cut dialogue, and while we had the text, we did not have the narrated lines. So I asked @ricepirate to help bring the character to life.", "The way that the main character transitions esthetically from a majestic Golden warrior to a bloodied , sickly looking omen curse user it's just amazing. It complements the narrative of this video perfectly. You realy outdid yourself this time man goodjob.", "one of the best things about dude is that he never takes credit for himself when he achieves something . he always respect us, the audience, and his team, and he is always polite in all of his video. we congratulate ourselves on this achievement more to come and everything to come\"\" Let's we all just appreciate the content this man and his crew makes it's just a masterpiece imagine what's he's gonna doing the future I hope this channel never ends and keeps spreading happiness. =(", "The cinematography here is simply amazing. You’d almost think all these shots were from in-game cutscenes", "Dung Eater legit scared me the first time.  He has that incredibly unsettling air about him, and the feeling that he will do something genuinely terrible to you, or to the world, if you talk to him or do what he wants. Something... unforgivable, something you can't take back.", "This is just incredible. Please make one for the other endings. At least for Ranni. Incredible....", "Wow…. Vaati really took this “Prepare to Cry” video to the next level with the animations, sound effects and soundtracks. This is his best one yet!", "Thank you for you hard work. Keep them coming.", "As a Latinist I greatly appreciate that the Latin lyrics actually make sense, which makes the song even more beautiful. Thank you Vaati for your awesome work.", "\"Have it written upon thy meager grave... felled by king morgott, last of all kings\"\n\n-Morgott the grace given", "Excellent episode. I really appreciate how you did Prawn-Bro's sad story justice, wasn't expecting to feel that level of emotion from seeing him bloodied and battered again like this.", "24:24 I feel like the VA perfomances are so underated in ER, the way his voice changes depending on the demigod is subtle yet meaningful, just listen how spiteful he sounds towards Rykard.", "The one thing I regret while getting the Despair ending was Big Boggart's death... He just wanted to enjoy his seafood.", "Take an effing bow. I really hope everyone involved in the making of this and the rest is getting their talent recognised in the right places for jobs. Peak excellence", "Can we have sliders for your character?? She looks so cool and menacing! Such an amazing video, thank you Vaati and all who were involved!!", "You are too generous to share with us this content for free. This is a cinematic masterpiece", "I cannot begin to state how freaking incredible this video was, from soundtracks, to visuals, to narration, everything was executed flawlessly.", "I love how you give each Tarnished in your Prepare to Cry videos such personality and character!", "Morgott is easily my favourite boss in Elden Ring. Not for his fight or the presentation or even the music, but his constant presence throughout the game. The Fell Omen, the Night's Cavalry, the scene with Godfrey holding his body and all inbetween. He's one of the few noble souls, fighting for what he believed in, who retained their sense of self all the way to the end.", "You're really a creative force of your own, yet I think what makes you stand out amongst YouTubers is your determination to pull together lorehunters, artists, hackers and editors to string together these remarkable tales. I'm so impressed at how you tied all these disparate threads together - this coulda just been a Morgott 'Prepare to Cry,' but you've really tackled so much in one go!", "I find the story of Dung Eater so hauntly wonderful yet so vile that i could not bring myself to do it. Thanks for the amazing video Vaati!", "These games are more like books than anything else encompassesing a whole world with such deep and hidden struggles from soft is truely amazing im so thankful we get to see a studio actually deliver beyond expectations", "This was amazing to watch, cant wait for you to tackle the other ending as well. I love how the dung eaters curse mantra is a call back to the Baneful Chanter from Bloodborne, \" Curse the fiends, their Children too, and their children forever more.\"", "The production quality on this is beyond impressive", "Vaati, I need you to do one of these for each ending. These are INCREDIBLE works of cinematic and storytelling genius. I, no, WE, need one for each ending. They will forever be cemented as legendary. Doing this kind of content shows other content creators what they can achieve. It’s an inspiration to another generation of content creators, and I FIRMLY hope you do one for Fia, Goldmask, and Ranni. This was incredible. This is something I’ll be coming back to on a regular basis.", "You tell these stories so beautifully. Some incredible editing to string it all together like a short film. Man, you’re incredible.", "Feel like I just finished watching a movie. Amazing storytelling. Thank you for making these!", "Amazing work! The edits are so good, narration too. Hell, everything here is perfect!", "I am absolutely speechless. This was a god damn experience...", "Holy shit, the production value of this is through the roof. Have been a lover of the series since DS1 and seeing where we have gotten in animation, sorry telling, sound and everything gives we goosebumps. <3 for you and everybody involved", "This is nuts. Honestly, Vaati really does top himself with every video, congrats to him and to everyone who worked on this", "A lot of work was put into this video , congratulations to all of you it is indeed a spectacle to watch , I even got goosebumps,  trully amazing Vaati.", "Your cinematography never disappoints, you are such a gifted storyteller!! Never stop being amazing at what you do Vaati!", "I feel like I need to get movie tickets for each Vaati & Mispap release!! ", "Truly the best content on Youtube. All who worked on this must be more than proud of this beautiful Eye-blessing", "The animation and editing in this video are simply amazing! Definitely the best of your videos so far!", "Anyone remember at the end of the last Prepare to Cry episode, that I said I would release a shorter episode next time?  so about that..", "I love your cinematic flair that separates your content from everything else.  Your editor does an amazing job of really crafting the music and shots to bring the most out of the recordings.  Great work and thanks for the content.", "Just got into this over a year ago, the story telling is crah crah!!", "This video is incredible. The music is fantastic. I was glued to the screen. Well done to everyone who worked on this masterpiece.", "Wow, this video is outstanding! All of it, the animated arts at the beginning, the editing, the camera angles, the narratives, ALL OF IT!", "So much time, money and effort goes into this series. It is just amazing and it really pays off", "Yo this is absolutely next level dude - congrats to all involved. Brilliant", "One of the greatest prepare to cry.... Artorias, Gehrman and now the Dung eater those are the masterpieces... the ending is beyond flawless... likes and  subscribes not enough for this it needs more", "I am actually so amazed at these. Not just the production, though that is amazing. What stands out to me the most is the Tarnished designs. This team has a real talent for making very recognizeable and unique MC Tarnished designs for these videos. I actually wish i could look this cool in-game. With the mask/ponytail/cloak look. It looks so classy!", "What an amazing amazing feat and video. Second to none. Our true Elden lord ", "I absolutely love how cinematic you make these videos. Fantastic job!", "\" The Dungeater, his sword is fashioned from the backbone of a malformed giant, his armor resembles a noman, but with its hornes cut of, his form reflects the landscapes of his mind, AND his face mirrors the likes of Distortion2 \"", "Astonishing production. Calls back to the passion that a game, such as Elden Ring, carries with it. One thing is for sure, this team's flame of ambition is far from meagre, extinguished even less so. Bravo!", "I'm eager to see how your videos will be from this point on! Prepare to Cry is by far one of the greatest things you've made and it just gets better and better as the years go by. Keep it up Vaati, ye lore master!", "Can we take a moment to appreciate how much time and work he puts into these videos for us ", "Can we talk about the amazing artwork that went into this video? Holy hell.", "Wow! The animation for the intro was incredible, I wasn't expecting it. Happy to see you're expanding and delegating in a thoughtful way.", "Tbh I feel both good and bad, to be able to watch this for free with this much quality, time and effort put into this it's just  wow", "Oh my... can we expect more from you like this Vaati? A masterpiece...", "Literal goosebumps... What an incredible work!", "Man this one was truly epic, the music, the editing, the narration...  Another reason why watching your vids has become an integral part of every souls game...", "This makes me want a Ranni-style alt ending for Morgott. The poor guy deserves a break.", "This episode was amazing and I think one of the darkest you've ever done. But also one of the best made. The art, music, storytelling are all top notch!", "This was mind blowing! Well done to all those involved!", "This.Was.Incredible.\nThe amount of work put into this video looks insane and it came out so incredibly well!", "this is some insane production value. Its amazing to see how this channel has grown.", "Man, the PTC series got to another level, now i see why it took so much time for this PTC be lauched, now im just waiting for a PTC for the golden mask and corhyn, i like those characters so much and I would love to see more lore about them", "Seeing Briars of Punishment emerge from the seppuku ash of war sent chills down my spine. What an absolutely beautiful idea.", "your videos are a piece of art! Music, Editing, the script.. just awesome! looking foreward for more of your content :)\nGreetings from Berlin", "Gotta love how much effort Vaati puts into his videos. He's come a longer way since Dark Souls then any of us could imagine", "This is incredible. It feels like seeing a great documentary tbh, amazing work <3", "This production, narration !!! The ammount of effort put into this amazing work.\nlike god damn man THANK YOU for this !\nI wish I could rent a movie theater to watch this video", "All the incredible lore I know from this game, comes from your beautiful stories.", "I feel like Morgott and Mogh weren't locked in the sewers always. I feel like Morgott was in fact out of the sewers way before the Shattering. The hammer he uses is the Giant Crusher. A hammer used in War of the Giant and later fell out of use which leads me to believe that he was out of the sewers way before the Shattering. Not to mention Morgott already having an order of knights by the time Godwyn was killed which we see in the trailer, the way he talks about his siblings as if he knew them personally (He is respectful with Radahn, hateful towards Rykard, mournful for Ranni, nostalgic for Miquella and Malenia and even uses Godrick's actual title), his way of speaking of them felt WAY too personal for him to just know of them by hearsay and I think he did know them and may have been loved by some of them, maybe by Miquella who loved the deformed ones and Godwyn who was ready to befriend Dragons. Not to mention that Morgott also created Sentry's Torches which means at the time Godwyn was killed he had to have authority over Leyndell's army. Not to mention that Mogh would have to know of Miquella's existence to even get to him and know where he was.", "The despair and downright defeat Ian shows when he drops his bow Id so relatable", "This narration is on a new level! I loved how you used actual quotes from voice lines or trailers ️\n\nMuch love from Vienna", "A thoroughly excellent video, incredible to see art I love so much expanded upon and brought to life so vividly. Thanks to everyone involved for all the hard work!", "Not sure if you'll ever see this comment, but I just wanted to say that you and your team do an absolutely incredible production with these lore videos.  They bring so much more emotion to a typically Spartan experience with this game.  Thank you so much for everything you do!!", "This honestly felt like a movie of its own. Bravo", "6:08- I love the stealthy snarking here: “Warrior blood must TRULY run in thy veins.” Says the dude who’s dad is Godfrey…", "Oh my goodness. THIS is how you make me want to play a game. All the elements of this story were pulled together so coherently that it was practically its own feature film. This really makes me want to buy Elden Ring so I can make my own story.", "Fist of all, that was one of, if not the most cinematic and well put together videos I have EVER watched. I was absolutely enthralled the entire watch. \n\nSecondly, your approach to lore vids is out of this world. I love seeing the actions of player characters act out and mimic lore plot points. It does wonders to help illustrate what’s happened.", "The quality of this video is astounding!! What a joy to cry over such an immeasurably high level production of a video. Thank you for the great effort and for this extremely entertaining episode of Prepare To Cry!", "This series is truly another step in quality from you, really looking forward to the Age of Stars edition for this.", "Prepare to Cry has aged like the finest wine. The production value of this series has reached heights worthy of AAA media. Love the action sequences, love the length of the recent vids, love the soundtrack, love it all. Especially the vasectomy given to Godfrey lol. Thanks, Vaati and friends. Been watching since DS1 and will continue to do so until Elden Ring III or beyond <3", "The animation and music recently has been exceptional. Shout out to your team.", "This is what I come to expect from Vaati. Well done, phenomenal video!", "I love how he can never disappoint us with his content :/", "Truly amazing video. The editing the music the narration all came together so well on this one, it really felt like a movie. Congrats to you vaati and everyone who participated in making this great video!", "Holy moly, this is just unreal, the music, the visuals, the voiceover, all of it comes together beautifully. Phenomenal work everyone involved!", "Vaati, this was easily your best work yet. Kudos to you and everyone else who contributed to making this absolutely perfect work of art.", "i am blown away by the quality and care put into these videos everytime, thank you vaatividya for blessing us with your voice, and video making skills <3", "Incredible work. You just set the bar for machinima storytelling. You ought to create a guide on your tips to capture those momments.", "This is peak entertainment cinematography and story telling. Absolutely perfect.", "Man, the sound effects and music synced with the footage here and the structure of the entire thing is just incredible, can't lie. Very impressed, the Margit part gave me chills", "That Shanehaight quest seemed so real, I legit thought I'd missed it in 6 playthroughs. Well done to ricepirate!", "Geez man… your videos are just getting so much more amazing as you’ve progressed over the years. The quality of the content and the editing you’ve been using lately. Really really impressive. Keep it up.", "This is the most gorgeous creation I have ever seen I would consider this a most beautiful movie and it isn’t even an actual movie but it is absolutely wonderful", "one of these days, vaati and team will really pull up with a whole animation or something. these videos are getting crazy in production  value.", "You've really, really outdone yourself. This is insane production value and tugs at all the right heartstrings, while telling a complete story. amaaaaaaazing work. much love always\nmy favorite moments:", "The Omen Curse adds so much to the story of the game. The complexity of Morgott and Mogh's duality, the contradiction of the Golden order, the DUNG EATER. I mean, how does a simple concept as a birth defect end up driving so much of the conflict in the world!? It's incredible and simple.", "I love the detail that Lizzie stopped her shady business once she saw that Scott was the next customer, since his yellow eye can detect magic and he would immediately realize that there's no magic in those 'magic items'!  i love subtle lore >:( :o", "Incredible editing and footage Vaati you just keep getting better, can’t wait for the Edwad lore version", "Morgott is my favorite boss, not to fight perhaps but the lore about him and surrounding him is so insanely interesting, same with Mogh. So happy to see this video come out! Going to watch it right away  You do the lords work with these videos"]}