{"video_id": "nzPMa-k3E9o", "comments": ["My God the 70s had some television, stage, and comedic icons just  walking around like they were regular people. Tim was so darn funny, naturally funny", "Tim Conway and Johnny Carson doing that silence bit is comedy timing at it's best.", "I love Tim Conway, the famous “Dentist Sketch” still cracks me up", "Tim with Harvey Corman were hysterical on the Carol Burnett show.", "RIP Tim...a true legend in comedy", "Tim Conway was probably the only comedian in the world who could make an entire audience laugh and get a standing ovation by sitting in a chair with a straight face. without saying a word.  ", "Kids and Teens enjoyed Tim in the 70's, his appearances in 80's and his apperance on Spongebob in the 90's into the 2000's. A well missed man...", "Only two legends of comedy and entertainment could make an awkward silence hilarious.", "Tim was a great actor, made us laugh. Sad that he is gone but not forgotten.", "Love how Tim catches Ed off guard when he ran to the chair! ", "Carson was the king if late night for a reason...the man was a comedic genius with impeccable timing", "Tim is hilarious, way under estimated, he's just brilliant. This was Great.  Thank You.", "Tim was a comedian genius. Gone but never forgotten.", "Everytime I watch this series I'm always so impressed by Techno's creativity, ruthlessness, and dedication to achieve his goals. Even after his passing his ingenuity continues to have an impact on Youtube and its creators. Rest easy, King. TECHNOBLADE NEVER DIES:_TechnoSalute:", "Only Johnny and Tim could make silence hilarious.", "Brilliant comedian.. Always a treat watching Tim..Cheered you up no end", "I miss Conway. The funniest of the Burnette crew.", "I love how this classic clip is trending. Tim Conway was one of the best!", "Tim was a comic genius!!!! Loved the dentist bit with Harvey Korman", "The man gets a laugh before he’s even sat down. Unreal", "I am so sorry for missing this bit in my time. Carson was a great piece in my young life from the 70s into the 80s.", "The Star Wars fight at 10:28 got me WHEEZING from having the high ground to underestimating his power, and then the straight-up lava death, absolute gold right there.", "The 70s had great TV personalities that were unbelievable.  Thank God for Carol Burnett and her co-stars because they made watching tv so much fun!", "Hard to believe that all three of those present are no longer with us.", "Can we take a moment to appreciate the effort and hard work they put into making videos for us =O:) :-(", "I loved Tim Conway ! He was a funny man !", "It’s a shame that these 2 are funnier, not saying anything, than most comedians doing their act.", "It must have been a lot of fun for the cast to record this scene with the Nornir. The actresses who play them sounded like they were reading the scene directions directly from the script.", "Back when lat night talk shows were entertaining.  Carson had class.", "He had that sad puppy dog face. R.I.P. Tim love you. His son is funny. He has a radio station on am 640 in CA. ️", "Tim was quite sensible in true life. Just paid to be a character. Played the perfect Ensign Parker on McHale's Navy.", "This is missing entirely from todays evening talk shows. The tonight show now is a comedic dessert.", "Sometimes the funniest thing you can say is nothing at all ", "What I love most about the Zoren kill counts is how they have such a different style and vibe to the James ones. Same when Chelsea does one too. They don't just feel like a different person reading a James script. They all feel unique to the person hosting it.  That's awesome. =O:) -_-", "I never really liked many Minecraft content creators, but I gotta admit that I grew up watching him...even if we were the same age. And I guess that's what makes it hurt just a bit worse for me. I can't even imagine what that must feel like, being so young and at death's door, but still smiling through it all and telling everyone that everything was going to be okay. The countless days I would come home stressed and upset from everyday life, just to pop up one of his newest videos on my laptop with some snacks and just laugh at all the countless jokes and shenanigans he and the rest of the crew would get up to every day. The countless times I would repetitively re-watch 'The Great Potato War', in which I totally was not doing upon finding out this heartbreaking news. Alex was one of the top-tier creators that I feel proud to admit to have been a loyal fan of throughout all these years. Someone I looked up to, who could make me smile even on my absolute worst day. ", "None of the hosts and only a very few guests nowadays could pull a stunt like the silence here. Brilliant to see real stars at work. Not to forget King Don of course.", "rewatching these videos makes me grateful that no matter what he was going through, even before cancer, he always uploaded videos for us, his viewers, to watch.\n\nRest Easy and in peace Techno, thank you for everything you did.", "Love ️ Tim Conway", "Both legends.", "I sure do miss all of the folks that appeared on the legendary, \"\"Tonight Show\"\" with Johnny and Ed. Sadly, these days and many of the stars who were guest are forever gone from this realm.....peace to all....", "Tim running out was great! ", "So thankful they post these clips.", "I met Tim on an episode I did on Coach,  I said,  Nice to meet you Mr Conway, you look younger in person.  he said.  I am younger in person.  LOL", "Love Tim Conway and Johnny Carson. RIP.", "Goodness, I was getting ready to graduate from high school when this aired in May 1982.", "Carson had a special talent: when a gag bombed, he got better.", "Dorf was the greatest basketball player of all times . (For an athlete with no legs that is ).", "I remember the 1st time l ever watched the Johnny Show. I was 19 and was so Sheltered l had No Clue what he was talking with Cuurent Affairs. My friends were laughing and l was like who is this Guy? ", "That was great but now I really want to see the Willie Nelson segment.", "Great comedian!", "God, I miss that time in America so much.\nIt was long ago and far away and so much better than it is today. Meatloaf", "Carson makes the current crop of late night pretenders look silly", "Tim was a funny funny man", "Saw Tim live at Pat Joyce Tavern in Cleveland 1966.He was with Ghoulardi, local Cleveland tv “nut case”. Have never seen any comedy as good anywhere since then!", "Comedic genius.", "Tim Cleveland is so proud of you!!!", "1:53:07 Jack missed a pretty big King Arthur reference here. Nimue was the name of the Lady of the Lake, the Fae entity responsible for raising Lancelot like a son and both forging and gifting Arthur with Excalibur... hence the \"talented with a sword\" line. Calling her a lake nymph is their way of keeping it from being too obvious.", "I love Tim Conway", "CLASSIC!!! Love this bit!", "I love his name!  Great actor!\n\nI really need to see a dentist.", "Johnny Carson is the gold standard for late night TV hosts... Nobody like him", "They should just rerun all of Carson's Tonight Shows instead of showing new Fallon episodes.", "When I went to see Johnny Carson live around in 1978 or 79 , Tim Conway was on his show that night, and he was talking about how he was getting a divorce and he was living in his car..", "I miss both of these guys", "That was his fastest entrance since his honeymoon..", "Thanks for the memories ", "this is when late night wasn't political so refreshing", "Johnny Carson…a time when night time talk show hosts were actually funny and interesting and not political hacks.", "Great stuff \nMiss them both", "Johnny's so cute and dorky.", "That was the awkward pause before Craig Ferguson did the awkward pause on his show.", "I live in a town very close to Salem, and a lot of people probably know this but because of the whole Salem Witches thing, Salem will get so much tourism and festivity starting as soon as October begins. It is literally almost impossible to even travel through Salem around then and I have seen whole highways backed up at the Salem exit.", "They talked about going back into the early history of commercials, 30 yrs. previous, as if that were a long, long, time ago. This show aired 40 yrs. ago!", "Reminds me of Ferguson and his awkward pause ", "The original Craig Ferguson awkward pause.", "greatest awkward pause in history", "Here I am watching this from my desk in Chagrin Falls, OH, and Tim mentions he's from Chagrin Falls. I had no idea - how cool!", "Craig Ferguson has said this is where the awkward pause he used came from.", "Heaven must be rolling in the aisles ", "Craig Fergueson did not start the awkward pause. Johnny had already invented it.", "Love that he mentions Chagrin Fall, Oh grew up there....Real life Mayberry..The River", "...LOL....   Tim's got ACRES of forehead to 'explore' this kind of facial inter-play.  ......  Johnny seems to have forgotten that....", "The line about Willie Nelson not needing any money, In a few years the IRS would beg to differ", "Anywhere to find the Willie Nelson part? (What a show!)", "I miss the 60's and 70's", "03:38 - I'd trade a Willie Nelson for a Tim Conway and Johnny Carson any day of the week.", "He was so comical", "I am out of breath from laughing.", "i want to see that special that they spoke about.", "No fear of silence....learned that from Jack Benny.", "As good as this is watch the elephant sketch from Carol Burnett Show!!", "Can I take your car? ", "I thought you say that you have nothing to say .", "The times wen u can just pull out a    n do as u please", "TV used to be funny.... now , not so much.", "What a shame we couldn't see the commercial clips", "Aww, I wanted to see the clip!", "I wonder what clip they showed about vintage commercials maybe it was Ajax laundry detergent is stronger than dirt or the man from Glad or Solvo the giant hand that comes out of the washing machine ah yes I remember them well.", "Is this where Craig stole the awkward pause?", "well well well, lets see Craig Ferguson, awkward silence segment? ! yep johnny did it first <3"]}