{
    "video_id": "nzPMa-k3E9o",
    "comments": [
        "",
        "Here I am watching this from my desk in Chagrin Falls, OH, and Tim mentions he's from Chagrin Falls. I had no idea - how cool!",
        "I used to love watching Johnny Carson with my mom, we used to laugh so hard together, as I think of those memories, I think I enjoyed watching my mom laughing too.",
        "And thus was created the Awkward Pause, which Craig Ferguson would later raise to an art form.",
        "Aww, I wanted to see the clip!",
        "I'm 45 love watching these videos of my favorites durning their Hay day for lack of better words. When I come to love and appreciate most of them they have either passed away or special tv events. Born to late I always told my mother lol!!!",
        "What I love most about the Zoren kill counts is how they have such a different style and vibe to the James ones. Same when Chelsea does one too. They don't just feel like a different person reading a James script. They all feel unique to the person hosting it.  That's awesome. =O:) -_-",
        "Gee thanks for the ad a full one minute and 40 seconds into the segment. Good grief🫥",
        "Tim is one of the best. Just the look on his face can crack me all the way up!!",
        "I met Tim on an episode I did on Coach,  I said,  Nice to meet you Mr Conway, you look younger in person.  he said.  I am younger in person.  LOL",
        "Sometimes the funniest thing you can say is nothing at all ",
        "As good as this is watch the elephant sketch from Carol Burnett Show!!",
        "He was so comical",
        "This is missing entirely from todays evening talk shows. The tonight show now is a comedic dessert.",
        "The times wen u can just pull out a    n do as u please",
        "Saw Tim live at Pat Joyce Tavern in Cleveland 1966.He was with Ghoulardi, local Cleveland tv “nut case”. Have never seen any comedy as good anywhere since then!",
        "Seinfeld made millions coping this bit.",
        "This is trending? Great, and all, but, I mean, 90% of the commenters don't know who any of these (overused word alert) legends are.",
        "8:06 \"Willie Nelson, who doesn't need any money\" ... uhh, weeellll.",
        "So thankful they post these clips.",
        "This is Where Craig Ferguson Got His \"Awkward Pause\"  Bit On His Show. Great Show as Well But If Your Gonna Steal a Routine, Got To Steal it From The Masters.",
        "I miss late night TV.  Now it is just total garbage.",
        "TV used to be funny.... now , not so much.",
        "Tim was a comedian genius. Gone but never forgotten.",
        "Tim was a funny funny man",
        "comic genius both men",
        "Always loved Tim Conway",
        "I miss Conway. The funniest of the Burnette crew.",
        "Dorf was the greatest basketball player of all times . (For an athlete with no legs that is ).",
        "Heaven must be rolling in the aisles ",
        "What happened to the commercials they were going to show!? :-(",
        "Tim was quite sensible in true life. Just paid to be a character. Played the perfect Ensign Parker on McHale's Navy.",
        "Comedic genius.",
        "How dare Johnny assume Tim's stolen car went south from LA and could be in Vallarta. If he wasn't dead , the woke jokes would get him.",
        "No fear of silence....learned that from Jack Benny.",
        "I am so sorry for missing this bit in my time. Carson was a great piece in my young life from the 70s into the 80s.",
        "CLASSIC!!! Love this bit!",
        "Thomas Daniel \"Tim\" Conway (December 15, 1933 – May 14, 2019) was an American actor, comedian, writer, and director. From 1966 to 2012 he appeared in more than 100 TV shows, TV series and films. Among his more notable roles, he portrayed the inept Ensign Parker in the 1960s World War II TV situation comedy McHale's Navy, was a regular cast member (1975–1978) on the TV comedy The Carol Burnett Show where he portrayed his recurrent iconic characters Mister Tudball, the Oldest Man and the Dumb Private, co-starred with Don Knotts in several films (1975–80), was the title character in the Dorf series of eight sports comedy direct-to-video films (1987–1996), and provided the voice of Barnacle Boy in the animated series SpongeBob SquarePants (1999–2012). Twice, in 1970 and in 1980–1981, he had his own TV series.",
        "I miss both of these guys",
        "Carson makes the current crop of late night pretenders look silly",
        "They should just rerun all of Carson's Tonight Shows instead of showing new Fallon episodes.",
        "Tim Conway voice sounds similar to Chevy Chase.",
        "Loved Tim Conway and Harvey Korman on the Carol Burnett show!\n\nBoth of them cracking each other up...",
        "That was the awkward pause before Craig Ferguson did the awkward pause on his show.",
        "I love how this classic clip is trending. Tim Conway was one of the best!",
        "His son Tim Conway Jr has his normal upbringing from his father who was just a normal man he according to Tim Jr was more inclined to talk to just regular people and was not one for being around  the Hollywood world.  I listen to Tim Jr every night on kfi he has a program from  6 to 10 during the week.  And the way he speaks about growing up in his father house they were just a normal family  he had two Hollywood friends  one was Mike Conners  and McClean Stevenson  and both like Tim Sr were just regular guys that enjoyed horse racing and  just regular things.",
        "So this is where Craig Ferguson got the awkward pause idea from",
        "I loved Tim Conway ! He was a funny man !",
        "There was one episode where Tim was on with Richard Pryor.  It was just as insane as you could imagine.",
        "i want to see that special that they spoke about.",
        "What a shame we couldn't see the commercial clips",
        "Love Johnny Carson",
        "Over 40 years???????",
        "Tim was a comic genius!!!! Loved the dentist bit with Harvey Korman",
        "It’s a shame that these 2 are funnier, not saying anything, than most comedians doing their act.",
        "Why did they cut out the clip??",
        "greatest awkward pause in history",
        "Anywhere to find the Willie Nelson part? (What a show!)",
        "Johnny's so cute and dorky.",
        "I remember the 1st time l ever watched the Johnny Show. I was 19 and was so Sheltered l had No Clue what he was talking with Cuurent Affairs. My friends were laughing and l was like who is this Guy? ",
        "Tim was a great actor, made us laugh. Sad that he is gone but not forgotten.",
        "Is this where Craig stole the awkward pause?",
        "I am out of breath from laughing.",
        "They talked about going back into the early history of commercials, 30 yrs. previous, as if that were a long, long, time ago. This show aired 40 yrs. ago!",
        "Tim Conway is an American icon...I loved him in McHale's Navy and The Carol Burnett Show...the latter was a show that my mom and I watched together...we bout split our sides laughing...those were the days.",
        "Tim Conway could have played Biden, blunders and all",
        "I have to pause during the silence.",
        "why in gods name is this trending in the top 25?",
        "The elephant joke",
        "Tim is hilarious, way under estimated, he's just brilliant. This was Great.  Thank You.",
        "Boom in frame. Boom in frame. Boom in frame. Boom in frame. Boom... aw the hell with it.  ",
        "Two Masters of Comedy at work!!",
        "Tim Conway was probably the only comedian in the world who could make an entire audience laugh and get a standing ovation by sitting in a chair with a straight face. without saying a word.  ",
        "He had that sad puppy dog face. R.I.P. Tim love you. His son is funny. He has a radio station on am 640 in CA. ️",
        "lol... 5:28, Ed McMahon laughing.",
        "No one even close to being a good as Johnny was. The late night show hosts today are not funny at all.",
        "So this is where Craig Ferguson's \"Awkward Pause\" originated.  Mouth organ, big cash prize, or an awkward pause is how Craig would end his time with guests.  I guess this was it's birth?",
        "Love Tim Conway and Johnny Carson. RIP.",
        "I love Tim Conway",
        "Johnny Carson…a time when night time talk show hosts were actually funny and interesting and not political hacks.",
        "well well well, lets see Craig Ferguson, awkward silence segment? ! yep johnny did it first <3",
        "RIP Tim...a true legend in comedy",
        "Only two legends of comedy and entertainment could make an awkward silence hilarious.",
        "I thought you say that you have nothing to say .",
        "I never really liked many Minecraft content creators, but I gotta admit that I grew up watching him...even if we were the same age. And I guess that's what makes it hurt just a bit worse for me. I can't even imagine what that must feel like, being so young and at death's door, but still smiling through it all and telling everyone that everything was going to be okay. The countless days I would come home stressed and upset from everyday life, just to pop up one of his newest videos on my laptop with some snacks and just laugh at all the countless jokes and shenanigans he and the rest of the crew would get up to every day. The countless times I would repetitively re-watch 'The Great Potato War', in which I totally was not doing upon finding out this heartbreaking news. Alex was one of the top-tier creators that I feel proud to admit to have been a loyal fan of throughout all these years. Someone I looked up to, who could make me smile even on my absolute worst day. ",
        "Craig Fergueson did not start the awkward pause. Johnny had already invented it.",
        "Johnny Carson is the gold standard for late night TV hosts... Nobody like him",
        "I agree that they should replace other shows with Johnny's shoe.  Je is missed.",
        "Tim with Harvey Corman were hysterical on the Carol Burnett show.",
        "When I went to see Johnny Carson live around in 1978 or 79 , Tim Conway was on his show that night, and he was talking about how he was getting a divorce and he was living in his car..",
        "Tim running out was great! ",
        "Kids and Teens enjoyed Tim in the 70's, his appearances in 80's and his apperance on Spongebob in the 90's into the 2000's. A well missed man...",
        "These 2 clowns don't have to talk or say one word and the crowd goes wild! 2 of the best right here folks. Rest in peace guys, till we meet again.",
        "Craig Furgeson used to do this bit on the Late Late Show on CBS almost every night. He called it the Awkward Pause. Obviously Carson had it before anyone. Great stuff !",
        "The line about Willie Nelson not needing any money, In a few years the IRS would beg to differ",
        "1:53:07 Jack missed a pretty big King Arthur reference here. Nimue was the name of the Lady of the Lake, the Fae entity responsible for raising Lancelot like a son and both forging and gifting Arthur with Excalibur... hence the \"talented with a sword\" line. Calling her a lake nymph is their way of keeping it from being too obvious.",
        "I just want to understand how THIS happened after the beautiful job done with Sword and Shield? This has to be the most embarrassing launch for Game Freak, ever LMFAO.",
        "Nobody cares about Joe Biden ",
        "Both legends.",
        "Genius. They just sit there, and laughs happen. Wow. ",
        "Rap, without all the sillyness... that's rap for you, nigga.",
        "The 70s had great TV personalities that were unbelievable.  Thank God for Carol Burnett and her co-stars because they made watching tv so much fun!",
        "Brilliant comedian.. Always a treat watching Tim..Cheered you up no end",
        "Love how Tim catches Ed off guard when he ran to the chair! ",
        "Everytime I watch this series I'm always so impressed by Techno's creativity, ruthlessness, and dedication to achieve his goals. Even after his passing his ingenuity continues to have an impact on Youtube and its creators. Rest easy, King. TECHNOBLADE NEVER DIES:_TechnoSalute:",
        "Thanks for the memories ",
        "My God the 70s had some television, stage, and comedic icons just  walking around like they were regular people. Tim was so darn funny, naturally funny",
        "They cut the clip???? WTF????",
        "->  Maybe We're The 1st Spiritist* Pop-Metal Or Rock Band In This World..\n\nBut Don't Pay Much Attention To Our Neanderthal English, HaHa  HaHa\n\n*NOTE:\n\n-> Spiritist is who professes Spiritism, the Gospel continuation",
        "These two had such great chemistry together. I’m sure JC is doing a talk show in heaven, and TC is still making everyone laugh. Missy them both.",
        "Always a class act.",
        "this is when late night wasn't political so refreshing",
        "Great comedian!",
        "Love that he mentions Chagrin Fall, Oh grew up there....Real life Mayberry..The River",
        "New. and then hes from infinity warfare",
        "Tim Cleveland is so proud of you!!!",
        "carson reruns would completely dominate all of today's comedians. but he was not woke enough to be allowed on air by the execs",
        "Tim Conway and Johnny Carson doing that silence bit is comedy timing at it's best.",
        "I loved Tim Conway. One of the funniest ever.",
        "Can we take a moment to appreciate the effort and hard work they put into making videos for us =O:) :-(",
        "hard to get enthused about tim conway",
        "Can I take your car? ",
        "...LOL....   Tim's got ACRES of forehead to 'explore' this kind of facial inter-play.  ......  Johnny seems to have forgotten that....",
        "Tim was the simple man of Hollywood, a comedy genius. Tim Conway junior lives on and his Dad's comedy lives on with him.",
        "It must have been a lot of fun for the cast to record this scene with the Nornir. The actresses who play them sounded like they were reading the scene directions directly from the script.",
        "Further proof of why Carson was the king of late night. And all others pale in comparison to him.",
        "Love ️ Tim Conway",
        "Only Johnny and Tim could make silence hilarious.",
        "I love Tim Conway, the famous “Dentist Sketch” still cracks me up",
        "Conways ability to keep his composure is legendary. what he did on Carol Burnet was amazing, to bust up Harvey Corman like he did and stay in character isnt easy to do",
        "When is Willie's segment coming out?",
        "May of '82 High School graduation. Here they are talking about 30 years prior ('52 ish). If they saw the _ we have to view now they would have freaked the _ out.",
        "JOHNNY CARSON\n\n23 DE OCTUBRE DE 1925\n23 DE ENERO DE 2005 ",
        "03:38 - I'd trade a Willie Nelson for a Tim Conway and Johnny Carson any day of the week.",
        "That was the idea behind Craig Ferguson and his awkward pause.",
        "Goodness, I was getting ready to graduate from high school when this aired in May 1982.",
        "Craig Ferguson has said this is where the awkward pause he used came from.",
        "Would love to turn back time because everything was better in America back in the 70's 🇺🇲️",
        "I miss the tonight show. That was good television. Now it’s all ",
        "Hard to believe that all three of those present are no longer with us.",
        "Why couldn't we see the clip ?\nThat was really weird and awkward for the rest of the video really really weird why they did that.",
        "That was his fastest entrance since his honeymoon..",
        "So THIS is what inspired the \"awkward moment of silence\" with Craig Ferguson!!",
        "I sure do miss all of the folks that appeared on the legendary, \"\"Tonight Show\"\" with Johnny and Ed. Sadly, these days and many of the stars who were guest are forever gone from this realm.....peace to all....",
        "The man gets a laugh before he’s even sat down. Unreal",
        "Reminds me of Ferguson and his awkward pause ",
        "The original awkward pause.",
        "I love ️ Tim.  Watched Johnny regularly.  Miss them both.",
        "Carson had a special talent: when a gag bombed, he got better.",
        "Where’s Harvey Korman",
        "God, I miss that time in America so much.\nIt was long ago and far away and so much better than it is today. Meatloaf",
        "None of the hosts and only a very few guests nowadays could pull a stunt like the silence here. Brilliant to see real stars at work. Not to forget King Don of course.",
        "I wonder what clip they showed about vintage commercials maybe it was Ajax laundry detergent is stronger than dirt or the man from Glad or Solvo the giant hand that comes out of the washing machine ah yes I remember them well.",
        "Wish they take out the film clips...",
        "The original Craig Ferguson awkward pause.",
        "Great stuff \nMiss them both",
        "Carson was the king if late night for a reason...the man was a comedic genius with impeccable timing",
        "At 1:42 I see where Craig Ferguson got his awkward pause Inspiration ! ;-)",
        "bust out that willie nelson interview..",
        "Tim was wonderful. RIP..  Only one of him.",
        "Awkward silence",
        "I love his name!  Great actor!\n\nI really need to see a dentist.",
        "Back when lat night talk shows were entertaining.  Carson had class.",
        "Sadly Tim Conway Born: December 15, 1933, Willoughby, OH\n\nDied: May 14, 2019, Los Angeles, CA",
        "I live in a town very close to Salem, and a lot of people probably know this but because of the whole Salem Witches thing, Salem will get so much tourism and festivity starting as soon as October begins. It is literally almost impossible to even travel through Salem around then and I have seen whole highways backed up at the Salem exit.",
        "It's over, we have known the apogee of our time. The corrupt government will overthrow this country like Rome did. My condolences to anyone approaching retirement, you may be wondering if your retirement capital is sufficient to meet the rising cost of living. Bad energy policy, bad foreign policy, bad regulatory policy and insane tax policy",
        "When coke was legal.",
        "The Star Wars fight at 10:28 got me WHEEZING from having the high ground to underestimating his power, and then the straight-up lava death, absolute gold right there.",
        "I miss the 60's and 70's",
        "I grew up with that show and it was the best there ever was.He had EVERYONE on and never belittled anyone or took sides. No agendas ,just FUN !",
        "McHale's Navy",
        "rewatching these videos makes me grateful that no matter what he was going through, even before cancer, he always uploaded videos for us, his viewers, to watch.\n\nRest Easy and in peace Techno, thank you for everything you did.",
        "Don't forget Tim as Barnacle Boy!",
        "That was great but now I really want to see the Willie Nelson segment.",
        "I was standing outside of the roxbury and a guy in a ferrari drove up and handed me his keys and said, can you take this? But i didnt!"
    ],
    "comments_disabled": false
}