{
    "video_id": "O5myIiXLqug",
    "comments": [
        "2:52 it sounds like Pokémon music in Mega Man X style.",
        "포켓몬울트라비스트",
        "Anyone else see the Celebi?",
        "Good animation",
        "How is no one talking about how when Poipole is inside Stakattaka and its pitch black, the watermark is gone, as if its also in the dark",
        "No matter who wins, remember: \nLECHONK IS LOVE, LECHONK IS LIFE.",
        "for me, kartana win because it's so good",
        "i love how my favorite 3 ultra beast made it to the last 3",
        "Yes a Space Core Quote!",
        "1:30 so that's how Moondrop was created",
        "Where is Nebby? It's line are Ultra Beasts too.",
        "03:06\nWhy Is nobody talking about HOW THIS PART IS SO COOL \nXURKITREE: TUN TAAAAAN\nThis scene is weird and beautiful at the same time ",
        "Geno in 0:55",
        "I don't know enough about the Ultra Beasts to understand a lot of this, but that's what the explanation videos are for and I still legitimately laughed out loud several times. Special shoutout to the Transformers transformation sound, Blacephelon's entire existence, and Kartana doing the Undertale attack thing. Thank you so much!",
        "Awesome",
        "I love the Point that I dont know a single one of These... Damnit have to Catch Up. Still stuck in Gen 4",
        "Poipole necame yoshi",
        "Blacephalon: Hiya, Georgie.",
        "Hey @TerminalMontage just an art question but as a design choice how come you made naganadels head more like the actual model for a frame then switch to a different head? Was it just a preferred way to animate him?",
        "I love it when Jev is actually having fun.",
        "You should do if your Pokemon region had a battle royal",
        "Wtf Venom>> Metal?????????",
        "Next you should make Paradox pokemon battle royale for pokemon scarlet and violet.",
        "3:33 bro just casually removes the Pokémon and yeets it to the moon",
        "Well made bro",
        "Make the Battle Royale Shiny Pokemon",
        "Poor buzzwole …. can’t trust these ratchets man",
        "Feel like kartana's steel typing being immune to poison would be a factor, but I'm not sure due to his defense still being too low.",
        "Pokemon Ultimate Battle Royale",
        "Its wednesday my dudes",
        "FINALLY another amazing pokemon battle royale video from terminal montage! So excited to watch this and I was hoping that a vid on the ultra beasts would drop soon, looks like Christmas arrived early.",
        "And mega Aerodactyl???????",
        "Interesting that all of the first encounters were from their games counterparts. (With the exception of poipole but they’re in both so whatever)",
        "I chuckled when Kartana tried to save Pheromosa only to cause her more pain.",
        "If ultra beast are Pokemon from another universe deoxyes could be the rotem of a another universe",
        "Okay okay how about that?\nSuper smash bros ultimate battle royale?",
        "hey, terminal montage, this video is amazing! can you do a pokemon battle royal only with starters? i know its hard. But you can do it?",
        "Guzzlord scream ahhhhhhhhhhhhhhhhhhh",
        "I like how Blacephalon, Xurkitree and Nihilego, who are my favourite Ultra Beasts but are often overlooked, get just as much respect as they deserve.",
        "I am actually obsessed with all the references that came with stakataka.\n\nTransformers Lego and Doctor Who is basically my entire childhood.",
        "Buenardo ",
        "Glad to see this being continued. Excellent work as always.",
        "Guzzlord is sans confirmed",
        "Love the celibi nsut chillin",
        "Dude, pheromosa is my waifu. You can't draw she better? =))",
        "i really thought dat paper churikin wins\nhe was my favo all of the ultra beast",
        "Man, the pokeballs até made out pra of some game tho",
        "Each of the sounds and other references were on point! From the scene from “It” to the “It’s Wednesday my dudes” scream, they fit so well.",
        "I'm not very familiar with the lore of the Ultra Beasts so this episode was even more exciting to watch not knowing who would win. Loved the Buzzwole, Kartana and Pheromosa.\n\nWill it be possible to create a glitchmon battle royale? There isn't any lore so maybe combat can be based off of their stats and typing?",
        "Mario",
        "I would watch a whole show starring Kartana and Pheromosa... even if they didn't end as well as expected :(",
        "Pheramosa: kills Buzzwole for saving her from getting her brain taken over\n\nAlso Pheramosa: teams with little origami man because its cute",
        "Kartana is really just a living \"High Frequency\" Shuriken... That's all I really got from this.",
        "In the future I want a Battle Royale of all Paradox Pokemon, Battle Royale of all 1,000+ Pokemon, and the Battle Royale of All Gimmicks.",
        "I’m surprised Kartana lived for so long and I liked how Buzzswole and Pherimosa were just vibing until Buzzswole touched her to get off the jellyfish",
        "I love how you included parts from the anime. That makes this soooo good",
        "The \"Exterminate\" sounds familiar you know :)))",
        "As someone who was rooting really hard for Guzzlord, that fakeout was heartbreaking, but this fight was really well done as always.",
        "3:17 Xurkitree: Alright, MY TURN.",
        "I only just now realized, but at 1:18 is Buzzwole specifically mimicking the poses of the wrestler from Rhythm Heaven Fever's Ringside? If so, that is just some extra icing on top of the amazing cake that is this video.",
        "My favorite part is \"BUZZ BUZZ BUZZ BUZZ\"",
        "Xurkitree got done right\nAs well as Kartana",
        "yaa teh dragon winsssssssss",
        "I flipping love these videos. The art style and animation just brings joy to my heart.",
        "This was filmed on a Wednesday",
        "The first shiny I ever caught was a ultra beast.",
        "2:09 Ah yes, the nostromo",
        "Something about sonic frontiers next?",
        "WE STAN TERMINALMONTAGE ",
        "Stakataka won in all our hearts.",
        "May this series strech into infinity, it never gets old!",
        "Can’t wait to see what you do with the Terra type battles for Scarlet and Violet.",
        "It it wrong to want a 1 hour loop of BUZZ BUZZ BUZZ BUZZ",
        "Now I’m waiting for only Starters",
        "3:10 I think that laugh was of skull kid in majora mask",
        "miltanks and celebi are just chilling it's so adorable. Also that poscredit scene!!!!",
        "Awesome and fun video, where's Necrozma?",
        "Every scene with Nihilego just had me dead",
        "I love the anime inspired scenes like the Xurkitree and Blacephalon showdown, Kartana speaking in reverse and Celesteela going to the moon",
        "I almost forgot sun n moon was removed of Netflix…. Wonder why",
        "Pls do terastalize battle royal",
        "Kartana really said “Omae wo shinderu”",
        "0:43 where’s pikachu",
        "xurxitree vs blacephalon reminded me of the anime",
        "Now there is only starters, regional, and paradox Pokémon",
        "Kartana seriously being every single main anime protagonist by doing a sick landing when he's defeated his opponent, simping for the female character, serving for her and fighting till his death.\n\nedit: But i guess he's a \"Main\" villian. Because kartana cuts off pheromosas leg. Still clueless.",
        "Where is ultra nekrozma?",
        "Nice, jeremy",
        "Do Mario Galaxy",
        "Pokémon Ultra Beasts is of Pokémon UltraSun and UltraMoon",
        "You forgot dawn wings necrozma,dust mane necrozma and ultra necrozma those three are ultra beast",
        "A cool BR would be the regional forms of all games",
        "6:15 my favorite part by far",
        "Where is a solgaleo and lunala",
        "Ayo what the celibi doing",
        "I loved this battle, each Ultra Beast got a little time to shine and this animation gave them all a little fun personality or quirk to make them feel unique and  it was very funny. Very good stuff!",
        "you know you're in for a treat when you hear the words \"loud sound warning\"",
        "Ok, now starter Pokémon battle royale, children has an exclusive one, why not the BIG BOYS",
        "Gen 7, my favorite generation. This does it a LOT of justice. Thanks Terminal for an amazing animation as always.",
        "I really like the sub story you create between episodes. Can't wait to see where it will lead to.",
        "This was a great thing to wake up to :] \n\nLoved the use of the classic Transformers sound effect over Stackataka, Ridley’s up taunt scream for Naganadel, and the Dalek voices for Stackataka as well. Such a smaller cast than normal, but still so funny! Great job working with less for more, if that makes any sense… Anyways, way to go, Jeremy!",
        "6:19 I got a Oreo ad bro…",
        "5:25 I need to know where this sound is from, I always crack up whenever I hear it in these animations.",
        "I also had this idea a while back",
        "Celesteela was literally just trying to leave and got both her arms cut off for it",
        "2:51 I HAVE 70 ALTERNATIVE HEADS!",
        "Ultra beasts have to be one of my favorite moves from recent Pokémon games. It introduced such cool gameplay and strange Pokémon. I’m probably biased because I started with sun and moon though.",
        "YOOO Blacephalon turned into a IT reference",
        "Maybe you could do a pokemon battle Royale  with pokemon scarlet and violets  new prehistoric and future pokemon",
        "Even if those starta getting less atwntion ı hope you wont stop doşng those those are the beauty of my life",
        "Time to space guys",
        "kartana shouldve used genji reflect bro",
        "I feel like Cortana should’ve won because I feel like paper would just fly away and a flesh big have you explosion coming from inside of his body would probably die wait are they made out of flesh because they’re ultra beast are they still made out of flesh let’s just say they are",
        "Kartana is now my favorite Pokémon.",
        "Top 10 anime battles",
        "Why is nobody talking about Stakataka being a bunch of Daleks? i loved that scene!",
        "Thank you for putting my favorite pair(Pheromosa and Kartana) together. Never thought that I would see them as fitting partners for each other.",
        "terrastalizing pokemon when?",
        "Maybe he will do the fusions",
        "1:20 … LIGHTYEAR TO THE RESCUE",
        "l think Karatana is very cute when flying/spinning.",
        "Soy yo o el final me recuerda a hades vs quin?",
        "Absolutely loved the entire animation and outcome but I wish we kinda got to see more of Pheromosa and Buzzwole working together before Buzzwole kicked the bucket. Adored the Kartana and Pheromosa team up at the end tho!!!",
        "Historic moments",
        "We need a something about Breaking Bad.",
        "<------ ",
        "Buzzwhole is my favorite ultra beast, literally the gigachad in a pokémon",
        "Mr president, a kartana has cut the second tower",
        "5:06 this scene be like Pennywise",
        "Kartana's lines, unreversed:\n4:22 \"Mind if I cut in?\"\n5:48 \"Nothing like a sword fight under the cherry blossoms!\"\n\n5:59 \"Uigh, the smell!\"",
        "I bet this is final Pokémon video",
        "Lol that 'It' reference was a good one",
        "코스모움은??",
        "Guzzlord scream be like:\nÆÆÆÆÆ-ÆÆÆÆÆÆÆÆÆÆÆÆ",
        "4:53 \"We all explode down here\"",
        "Can you do a battle royal of starters",
        "Hmmm….\nSo that’s how those crop circles are made… 3:48",
        "Honestly I thought kartana won",
        "where is solgaleo & lunala in this",
        "Idea batalla de generaciones \n\nUna pelea de equipos de pokes de cada generacion peleando con pokes de otra",
        "Blacephelon",
        "excuse me, Terminal? uh, my Pheromosa said that she's afraid of my Kartana, which is me thinking that this is in reference to this-",
        "After Scarlet and Violet come out you could do a gen 8-9 battle royal since the original legendary and normal battle royal was before gen 8",
        "BUZZ BUZZ BUZZ",
        "This may be a dumb idea, but I though about what if you made one of these, but it was all the Psuedo-Legendary pokemon? Dragonite, Metagross, Hydreigon, etc. I'd love to see it honestly, anyways I love your stuff, it's always awesome!",
        "You forgot the two box legendaries but I guess that might’ve been unfair",
        "Would've loved seeing Buzzwole spamming Jet Punches referencing its dominance in the TCG",
        "4:12 blacephalon hiding in the sewer got me dead",
        "UB BURST crawling into the drain gave me chills ",
        "I have a idea idk if u already did this but pseudo legendary Pokémon battle royals or starter Pokémon battle royal",
        "Really stacktaca is still here so the fight isn't over its just their stuck",
        "Best Moments:\n- Stakataka transforming with Transformers' sound.\n- Amung Us reference.\n- Celestila reming me of Elon (SpaceX), it goes down. Well so does Elon (Twitter).",
        "Dang cool vid!",
        "When kirbo asmr?",
        "I heard xurkitree Speaking",
        "What a magnificent battle. Too bad they didn't continue with the Ultra Beasts concept, I thought it was really cool. I wonder if when the ninth generation arrives you will do a Terastal battle or even with the ancient Pokémon",
        "i love how the katana is just jetstream voicelines backwards",
        "who else thought the miltank was gonna win",
        "nih-hill-leggo. Also -- Ark-kay-uhs",
        "2:30 Not the evil waifu laugh.",
        "I feel like this Guzzlord's voice is more accurate. It is Guzzlord, my dudes.",
        "paper cut is always super effective n critical, painful af",
        "i love how pheromosa is just so unbothered",
        "The dalek scene with Stakataka and Poiple  was probably the hardest I've laughed in some time. Please continue making funny references like that lmao.",
        "5:57 JimmyHere's screech",
        "I knew kartana was my favorite ultra beast for a reason.",
        "Xurkitree is statistically the best ultra beast imo.. has balanced stats overall...others have atleast one of their stat butchered pretty bad by the Devs.",
        "I have been waiting so long for this video and it did not disappoint, want you should do next is region battles",
        "Okay the buzzwole turning into the weakened form of All Might was great",
        "What was that song you used in the sonic vs Mario I like what song is it",
        "5:26 ",
        "All I wonder is... what are you going to do to continue this series? Use the mechanic in Scarlet and Violet or do legendary battle royale pt 2?",
        "I love the extra detail of how they all fell on Alola specifically.",
        "finally happened, i still remember writing down in legendary battle royale comments: \"ultra beast battle royale\" lol",
        "You gotta do regional form battle royale",
        "what next, gen 9?",
        "I have a request! Can you do dynamax pokemon royale?",
        "Could u make 1 for middle stage forms off pokemons? For example off what i mean wich middle stage pokemons: charmeleon pikachu haunter and alot off others.",
        "Guzzlord:snorlax eating on steroids",
        "I like how some Ultra Beasts were actually trying to fight each other and some just wanted to do silly things.",
        "I don't recognize any pokemon other than the Miltank.",
        "Buzzwole: BUFF BUFF BUFF BUFF BUFF BUFF",
        "Request \nPlzzzzzzzz do Something about Minecraft",
        "I'm sorry I'm late also I hope you reach 4M!its SO CLOSE BRO!!\nand it's cool the video is so cool and animation is Derpy XD I REALLY LOVE IT! XD",
        "Maybe u can do shines next ?",
        "Can you make a video of splatoon is very funny and the story can have addded many memes",
        "TerminalMontage always puts a grin on my face from ear to ear. At this point these videos and Lockstin&Noggin are the only reasons I’m still a Pokémon fan.",
        "come on kartanana had a 10/10 performance, shuold have won",
        "Where is ultra necrozma, solgaleo and luanala?",
        "Hello I have idea for a next battle there will be two teams in the first team will be regional forms of pokemon and in the second team will be not regional forms of pokemon and which team wins it is better team \nMy English is bad sorry",
        "I bet the last Pokémon battle royal is gonna be every pokemon in existence fighting and the final boss will be lockstin himself",
        "Hell yeah",
        "The purple dragon beedrill, trying REPEATEDLY to stop Blacephalon from growing a new head, was HILARIOUS!",
        "lol kartana just burned up",
        "No salazzle ;-;",
        "hello Terminalmontage I love your vids",
        "Wtf did I just watch",
        "I would love this video if Kartana won ahah",
        "It’s an ALIENNNNNN!",
        "マッシブーン可哀想に",
        "bro poipole brutal death",
        "Shiny battle Royal?",
        "Kartana make me feel like vagineer from tf2freak",
        "I took out half of them in competitive with a pikachu",
        "Jeremey should post more about the something about series it's amazing/hilarious",
        "Hi, um can you make a something about metal gear rising?",
        "Spaaaaaaaaace",
        "2:20 why didnt it try to paint the brick like when it try to do before ? (sorry if i type it wrong im not good at english)",
        "No entendí",
        "I have an idea maybe G-max battle royal for the next?",
        "Justice for my man Kartana",
        "Never thought this series will continue.\nGlad it did ",
        "EAT",
        "Ohio be like:",
        "Can you do a Pokémon tournament of Pokémon from Scarlett and violet plz",
        "6:36 basically the last part of genocide route in Sans' fight",
        "BE FREE LITTLE COUSINS!!",
        "Ever thought about doing Battle Royals for each type? Would be cool to see who's the best of each one.",
        "7:46 SNUGOOI!!! OwO Our precious baby slug. <3",
        "4:38 I love how this is the highest quality explosion in the entire series followed immediately by one of your usual low quality explosions",
        "I always ugly laugh with your videos!\nThank you ",
        "Video was great but I do remember in the game the evolutions of Cosmog, Type: Null, and Necrozma being referred to Ultra Beasts. Can I have an explanation of why they weren’t there?",
        "That Sans reference was perfection.",
        "5:52\n\nMan: 1'70\nWoman: 1'70",
        "1:28 I love Blacephalon’s taunt here, it’s really satisfying to me for some reason",
        "How has no-one noticed the messages from Professors Sada and Turo at the end of the simulation about some Paradox Pokemon discovered in Paldea? I mean, since S/V haven't come out just yet I can only guess that this has some deep TerminalMontage-based lore involved that will be given another hint and then never elaborated on in the \"Terastallized Pokemon Battle Royale\" video coming out sometime near the tail end of 2024.",
        "I never expected them to do Ultra beasts I'm going to be honest. But what are they going to do next, I mean they could do variants of pokémon from alola, Galar and whatever Scarlet and violet is.",
        "Ultra Epico",
        "Can you do one about yomi hustle, doesn’t have to be long just a quick one.",
        "3:41\n\nPheramosa: Who said you could touch me you vile cretin!?",
        "can you do punch out Wii in an animation?",
        "The blacephaleon hiding in the sewer part was one of the most hilarious things i saw in weeks. I expected everything but not it becoming... well... IT.",
        "I love this how blacephlon and naganadel and at first I’m like oh stakataka is going to open up because of a random thing but out of no where stakataka kills poipole ima sub I really liked this",
        "Even though I only recognized like 3 of those Ultra Beast pokemon, this battle royale was remarkable! They’ve always been my favorites!",
        "Can you make a backrooms video pls?",
        "I have an idea for a next video which is a pitched battle but of fossils",
        "The fact that the poison doesn't affect Kartana because he's a steel type is actually so much attention to detail.",
        "What does the outro mean",
        "Pheromoaa is my fav ub",
        "It’s absolutely incredible hot much effort you put into these videos, between animation, dex entries, etc. Greta job!",
        "İS THAT CHARA HİT",
        "Habían muchísimas referencias, me encantaron",
        "9:28 I think the cricket(une) is chirping in moarse code, can anyone translate?",
        "Good idea",
        "I get the reference",
        "Interesting that you didn't even attempt to do the eggs to the face joke with Pheromosa... I wonder why...",
        "Kartana: A steel type that loses to a poison type\nMe: Wait, that’s illegal.",
        "been waiting for this one lads",
        "1:57\nNobody:\nThat one fly in my room:",
        "Yo he's back",
        "I like when stakataka crushed poipoil it's kinda funny",
        "i think buzzswole will win",
        "Blacephalon performing for the miltanks was so pure",
        "The next one is paradox?",
        "The third kirbo Christmas",
        "idk what a ultra beast is but this was still entertaining. \"getting old\"",
        "I grew up on Doctor Who. My favorite movie is Alien. I am a huge Star Wars Nerd. Needless to say STAKATAKA ENDED ME I LOVE IT I LOVE IT SO MUCH THANK YOU TERMINAL THAT IS THE BEST COMBO OF REFERENCES AND MY ABSOLUTE FAVORITE THING EVER IT MADE ME SMILE SO BIG",
        "hehe, big crab go AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA!!!!!!!!!!",
        "before video. my guess is on Guzzlord.",
        "Bro stakataka being able to crush anything inside of it is horrifying to think of",
        "Can you do a battle royale of hisui regional forms? That would be incredible",
        "I love Gen 7’s Pokemon lineup so much. I’d say it’s been the best we’ve had in awhile",
        "Katana is Raiden confirmed",
        "Please do somthing about bendy and the dark revival PLEASE it would be so good",
        "This art style is terrible it just shows that you can’t really draw so you make sloppy looking version of the characters",
        "Can we get type specific battle royals? That would be amazing",
        "Just a thought since the new game is out you should do future vs pass pokemon, ps these animation are fantastic I don't know how you do it",
        "What the heck was that post credits scene",
        "Nobody gonna comment on the awesome Sticth/Yoshi reference with Poypole?",
        "Since I haven't seen any comments on why stackatacka couldn't up I assume it's because poipole's sticky liquid got stuck inside of stackatacka",
        "This reminded me how much I bloody loved the Ultra Beasts. USUM really felt Game Freak doing whatever the hell they wanted because they knew it was the last DS Gen",
        "The attention to detail in these videos is always insane you and Lockstin make a great team",
        "As long as Game Freak keeps creating Pokémon gimmicks/new forms, this series will never die unless Terminal wants to. And I am completely fine with that.",
        "wow nothing can beat Legendary & Mythical Pokemon Battle Royale one.",
        "In the game UC are supposed to be terrifying unknown creatures from another dimension. In the anime they are basically living memes",
        "The danganronpa blood ",
        "How long does it take you to make these animations?",
        "Whenever TerminalMontage uploads a battle royal video. The week becomes so much better because I always find such entertainment in these videos.",
        "YO IT RETURNS!",
        "Baby Pokémon: get a tiny plot of land to train on.\n\nNormal Pokémon: Get arenas to train on.",
        "Where is Kirbo the undying Christian vs the god the slaying kratos?",
        "Nagarnadel and Kartana's battle is literally the epitome of \"never bring a knife to a gunfight\" but it was very close. Awesome battle royale! ",
        "I'm sorry why couldn't my boy Kartana win!?",
        "Now  that you've run out of pokemons, why not eping a Pokémon Trainer Battle Royale and make the trainers kill themselves in a friendly match?",
        "aren't solgaleo, lunala and necrozma ultra beasts too..?",
        "That was amazing... The \"It\" Reference and interactions were so funny...  But I say that I expected a different outcome....\nKartana is stronger than Naganadel and while Naganadel is faster...  And has fire attacks on the cannon Kartana is capable to cut through everything...  ",
        "Who does lecat Married By Le pew",
        "Lol, the clown in the sewer.",
        "How close are those 3 runaways to living Pokémon? We know of the game world incredibly technology to create creatures like Porygon, and the ability to digitize any Pokémon into the P...C..... \nWait.\nDo these fights use living Pokémon!?",
        "3:28 poor Buzzwole helps out Pheromosa. And how was it repaid, by being killed.",
        "\"Just got to click the magic link... oh its gone\" bruh... what's this wizardry?",
        "As someone who doesn't know anything about Pokémon, I have no idea what's going on",
        "There arent that much ultra beast",
        "I REFUSE TO THINK A PIECE OF PAPER GOT THAT FAR",
        "Kartana is Levi Ackermen in a nutshell during this battle XD",
        "Jimmyhere guzzlord",
        "When xurkitree died i actually just said \"NO, MY BOY!\" And when it apeared at the start i said \"My boy!\"",
        "2:19 EXTERMINAT TIME!",
        "BUZZ BUZZ BUZZ BUZZ Lightyear to the rescue ",
        "Poor Buzzwole, he was just trying to protect Pheramosa.",
        "I don't get the post credits scene",
        "대박",
        "terrastylise br next???",
        "Bate Royal telastalarion or pondya plis",
        "This ain’t the first time we see these Pokémon mega gengar thrown mega aerodactyl to the ultra wormhole",
        "1:52 half life is a good game",
        "Maybe you can do battle royal for each Pokémon type. Or battle royal for just starters.",
        "4:01 all might???",
        "Blacephalons voice was amazing. You could say this entire battle royale was “out of this world”.",
        "This guy deserve so much better ! I love it !",
        "This videos are the best",
        "7:13 RULES OF NATURE",
        "Pokemon Machine outplayed",
        "Poor Poipole, death via danganrompa execution. With the blood to boot!",
        "RULES OF NATURE",
        "I want see poppy time 1~2",
        "Me listening to Kartana's voice lines backwards: STANDING HERE I REALIZE",
        "All Deaths\n\n\nSpoiler Warning",
        "Gg kartana he was a real one",
        "Would have loved if Arin Hansen voiced Guzzlord. A common jab is it sounds just like him screaming.",
        "speed",
        "2:19 Absolutely Killed Me!!!",
        "5:14 best part ",
        "FAINALY YEEEES",
        "we all know necrozma is dead and alive",
        "그는 독에 면역입니다. :))",
        "Also why were there miltanks?",
        "I love how some his drawings are always meant to seem terribly drawn but their well drawn In His own way-animation",
        "Awesome. I always love these",
        "would have been cool if blacephalon just dies after it uses mind blown three times",
        "I WANTED KARTANA TO WIN THEY WHERE SO LOYAL TO PHERAMOSA",
        "im scrmed this video",
        "Priceless as usual. A pure pleasure at any time !",
        "you should do the fossil pokemon battle royale",
        "When is Lions vs Pokémon coming? Can’t wait to see the Lions get atomized",
        "The fact that guzzlord scream is technically accurate to how he sounds is the funniest thing to me for some reason",
        "I think a regional form battle would be dope",
        "maannn you didnt have to do buzzwole like this",
        "I feel a pity for Celesteela, he didn't mean any harm on purpose, he just wanted to go to space like every childhood dream",
        "I wonder what Poipole tastes like",
        "0:29 \"Blessed Arceus, it's full of stars!\"",
        "I bet that if the three legendary Ultra-beasts (Solgaleo, Lunala, and Necrozma) were n this, It would've ended in Necrozma",
        "I absolutely loved kartana urgently bouncing at pheremosa's feet lmao",
        "Kartana had a greater character development arc in this one video than Gengar in 3",
        "Buzz buzz buzz buzz",
        "could you please make one with the regional forms? Thank you",
        "Was on the edge of my seat the entire time, was not expecting a battle royale for my favourite legendary set in the franchise.\nSo well executed how they’re all given distinct personalities and an equal amount of time to shine, from Poipole playing essentially Splatoon to Celesteela’s nuclear implosion to the team up between the two dragons and the two protagonist-likes.",
        "I like how chill most ultra beasts seem~",
        "i found geno secret",
        "J'aurais aimé que cablifère gagne...",
        "References:\n\nIt - 5:00\nRomantic scene - 5:47",
        "Fun fact: What Kartana is saying are just some Jetstream Sam lines backwards.",
        "I wish pokemon battles were like this in game.",
        "Finally a WORTHY opponent [in Clown] \n\nThat.. That Just Sounds Like me...",
        "Eh you should make a terastalizing Pokémon video!",
        "Forgot that necrozma is infact a ultrabeast",
        "OWO",
        "If Ultra Beast Balls cost millions of dollars to make (confirmed in Sun/Moon by Looker, I think?), and you digitalize them into a simulation, does that make them NFTs or TF2 Unusuals?\n\nWeird jokes aside, neat animation. I vibe with kick bug teaming up with the lil' samurai origami, but question Guzz's cooperation ability. I mean, animation, so, difficult to read too much into it, but I swear all that UB did was emulate Kirby but with longer arms. No reasoning or what-have-you.",
        "0:50 Behold!\n Experiment 802 has landed!",
        "Let me guess what’s next. HmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmMMMMMMMMMMMMMMMMMMMMMMMMRMRMRMRMRMRMRMMRMRMRMRRMRMRMRMMRMRMRMRMRMRMRMRMRMNRNNRMRNRNRNRNNR",
        "we need a kartana redemption arc",
        "These Ultra Beasts really capture the feeling of Otherworldly creatures, meaning that they definitely don't look like they belong in Pokémon at all.",
        "Really glad seeing the ultra beasts getting well deserved love. I hope this battle royale series continues and that you and everyone involved is having fun working on it.",
        "An interesting concept. It's more than enough till we inevitably get a terastilized battle royal",
        "Amazing animations, references, attention to detail, just everything honestly. I’m so glad that this series exists! ",
        "I SAW THOSE MESSAGES FROM SADA/TURO",
        "I want you to play Gosanke Battle Royale",
        "@TerminalMontage You got sinnoh wrong in 0:45!\nJohto and, by association, Kanto is south of Sinnoh. Search up Sinjoh ruins in bulbapedia! \nLiked that you got the sea path right though.",
        "What about zeraora ",
        "List of Dalek sound effects:\nResurection of the Daleks \nRemembrance of the Daleks (Cliffhangers 1 and 2)\nDalek",
        "really really good one. i swore that solgaleo and lunala (or whatever) were ultra beast too, but i’m probably wrong ️",
        "Canon",
        "The way Kartana was jumping around around at 6:11 is so adorable",
        "I'm so sad for Blacephalon, it was my favorite in this battle royale until Kartana gets here",
        "You forgot solgelao and lunala",
        "Did Kartana or Naganadel win?",
        "you know its a good day when Terminal makes a new video",
        "I am from Thailand But i love you video and you channel now i subscribe you",
        "Also what happened to xurkitree?",
        "I know nothing about Ultra Beasts but I already know the clown with the exploding head is my fav",
        "until now, i havent really had any special feelings for kartana or blacephalon.",
        "Loved the undertale reference",
        "Omg i loved all the game/show sounds like the headcrab or dalek sounds",
        "i loved how the final explosion looked, nice colors and it just was animated very well",
        "Can’t wait for the paradox battle Royale",
        "Something’s wrong. There are no subtitles.",
        "And ayo Man, o istill cant barelly describe the overly well execution of your animations",
        "Quite comfortably convenient how every combatant gets to display their powers when there’s only 11 of them. ",
        "That was cool, and the first time I've straight away jumped to the explanation video. I was not expecting Naganadel to last that long cause it's just a shoot poison boi. Honestly thought Guzzlord or Kartana would take this one.",
        "Though I was sad to see Stakataka get taken out so early, it does kinda make sense. Keep up the great vids Terminal :) <3",
        "Excellent Pokemon fight as always. I wonder if an \"all starters\" battle royale is in our future ",
        "",
        "Kartana it's a simp",
        "Next paradox pokémon",
        "Can't wait for this to be clipped on the next JimmyHere If I Laugh video.",
        "What did poipole ever do to you",
        "Man, they did a Toshinori reference with Buzzwole, awesome work on the video TerminalMontage! And Good Game to all the Ultra Beasts, they fought well.",
        "Main character battle Royale??",
        "That was awesome. I was expecting Necrozma to show up, but I guess it would have been pretty obvious who the winner would be with them involved.\nSay, since no more Smash updates or DLC are coming around, would you and Lockstin be up for a Smash Battle Royale soon?",
        "4:30 Gonna tell my kids this was how Apollo 11 happened.",
        "Genuinely the coolest one yet! In terms of script, and showing off the pokémon lore, i mean the shot of kartana going up naganadel’s stinger was so freaking sick, I enjoyed this so much!! love my little kartana look at him go",
        "5:14  ",
        "Titanfall at fans at 0:16: flashbacks",
        "I'm counting down the days to the next Kirbo Christmas",
        "Always insane episodes! \nI love Ultra Beasts, I hope there will be new ones in the next generations!",
        "Buzzwole protecting Pheromosa like his gf but then Pheromosa doing him dirty. All the boys can feel him.",
        "Wait is a Fortnite",
        "the blacephalon translations were so funny",
        "BUZZ!  BUZZ!  BUZZ!  BUZZ!",
        "Did you do regional variants yet?",
        "Mini Katana boi",
        "why did i keep hoping kartana would eventually say genjis ult line",
        "I think the title changed. ",
        "6:37 IS THAT A UNDERTALE REFERENCE???????????",
        "I think this is the only battle royal where we get to properly see every pokemon fight",
        "Just     epic",
        "11 pokemon is total",
        "I honestly thought kartana was gonna win but I'm still thankful that it was naganadel that took the W",
        "\"Next is the ultra beasts one\" - me 3 years ago\ni guess i was a little off",
        "Yay, one of my favorites won",
        "As a Doctor Who fan, I love the fact that Stakataka is basically a Dalek. So funny",
        "The animation keeps improving. I found myself holding my breath during the last sequence",
        "Ficou muito irado",
        "I like how most of the Ultra Beasts are just kinda doing their own thing until they get bothered and/or destroyed by the final 3 survivors (and nihilego i suppose)",
        "There is something abiut this sound design that makes this video  million times funnier than it has any right to be",
        "Man, I thought Ohio couldn't get stranger but here we are",
        "#11 Poipole (Eliminated By Statakata)\n#10 Statakata (Eliminated By Guzzlord)\n#9 Buzzwole (Eliminated By Pheromosa)\n#8 Xurkitree (Eliminated By Celasteela)",
        "Damn thank you for making the video",
        "Now we can do a paradox Pokémon battle royale",
        "Watching this reminded me that I have to finish Okami",
        "buzzwole 4:01 looks like all might...",
        "Kartana god",
        "0:55 Geno",
        "Merry Christmas btw",
        "Guzzlord dying is an Undertale reference",
        "Can’t wait for paradox mons",
        "6:22 kartana: \"you messed up dick head.\" proceeds to get consumed \"OH SHI-\" it explodes \"oh cool now I get to fight this bee thing\"",
        "Cartana",
        "No drum or base :(",
        "I know his next pokemon animation idea it is pokemon Tera type battle royal",
        "Nice bro",
        "If I had to predict or guess a Battle Royale for next year (or next time), I'd prolly say...  Regional Variants Battle Royale, feels relevant enough to be done and there is a wide cast to choose from in there.",
        "I don't know any of the names for the pokemon, but jawbreaker head guy is definitely my fav ",
        "1:43:This Naga Sound?",
        "My favorite won yea",
        "I love how Guzzlord has just become the embodiment of the meme \"He screams for he does not know\"",
        "Epico",
        "9:22 sudowoodo’s a chad",
        "Very cool kartanas voice is like how it is in the anime!!",
        "Pheromosa is my personal favorite and my girl got done dirty :(",
        "Nihilego - headcrab\nBlacephalon - pennywise\nGuzzlord - perfection\nKartana - that guy I forgot name of but in reverse",
        "The Johnny Bravo Buzzwole was so amazing. Also I can't understand a lot of Kartana just from guessing, but pretty sure 6:22 says \"let's dance\".\n\nEdit: maybe the voice has been an inverted Jetstream Sam this whole time? Maybe.",
        "Me: I can’t wait for Kartana to defeat Naganadel!\n\n7:31",
        "I been playing Pokemon for 3 year but i dont nkow there are ultra beast pokemon",
        "its just unreal how many pop culture references and (forgotten) memes you can pack into your videos, incredibly well done.\nyoure a huge inspiration for me :)",
        "3:21 Buzz Buzz Buzz Buzz Lightyear to the Rescue",
        "I love how with only 11 pokemon, with two dex entries each, they managed to make such a long and intense battle royale, amazing \n\nKartana deserved to won tho",
        "Buzzwole: *Saves Pheramosa and tries to snap her out of trance*\n\nPheramosa: “And I took that personally”",
        "I’m so happy that one of my favorite Pokémon won :)",
        "now just mythical pokemon lessgo",
        "Where is Necrozma? He/She is no a \"ultra beast\"? o.O",
        "when will we get starter Battle royale",
        "GOD I HATE Shredder's Revenge \nI Hate Shredder's Revenge so much",
        "NOOOOOOOOOOO OOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO OOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO OOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO OOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO OOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO OOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO OOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO OOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO CARTANA",
        "Poipole: * sits on Stakataka *\nStakataka: OKAY FIRST OF ALL HOW DARE YOU",
        "Next pokemon battle royal idea, all regional form pokemon plus their extended evolutions",
        "I like Poipole evolve into Naganadel because that’s dragon pulse it’s awesome  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "TerminalMontage's animations are excellent and a lot of fun to watch.",
        "Man be eaten everything",
        "Blacephalon: finally a worthy opponent, out battle will be legendary!!!",
        "You never fail to please me with every upload you make!",
        "I have a feeling that the next is either gonna be Fossil Pokemon, Paradox Pokemon, or Gen 8-9 Pokemon",
        "I’m surprised mega aerodactyl isn’t here, considering mega gengar sent him to the ultra beasts",
        "Yo, I’d be really cool if there was a Something About Sonic: Adventere",
        "If I'm understanding right, Mawile and co. continuously went into the furthest boxes in the PC to create more boxes until the memory eventually overflowed and allowed them to modify the password/whatever memory they wanted? That's an amazing pokemon-oriented spin on a buffer overflow attack lol.",
        "Ok predictions. Who is going to win.\nTechnically: Ultra Necrozma. Becouse Obviosly! A Legendary Ultra beast. Safe Bet.\nHopefully: Pheramosa. My Glass Cannon of my playthrough.\nWill edit once watched.",
        "Its always a good day when terminal uploads a pokemon battle royale",
        "What if you do this Pokémon showdown, but with the regi’s and lockstin & gnoggins custom Regis for every type. I like every regi, so seeing this wil be amazing",
        "0:51 this is a reference to “Lilo and Stitch” when stitch crash lands on earth for the first time",
        "This is cap",
        "2:18-2:27",
        "Did that pile of alien bricks just do an ojou-sama laugh?",
        "Your animations are always very epic and creative and hilarious, and that is why I always love to come back and watch them especially ones with Kirbo.",
        "The fact that the pokeballs at start of each battle royale comes from their own gimmick (dynamax energy, mega stones) is a nice touch",
        "..........I have no idea what these things are",
        "Normal only?",
        "Where IS pieroteknik?",
        "I’ve been waiting for this but also you should do the crystallization thing river is called for the new Pokémon game",
        "Hopefully and the next one will be of regional forms",
        "u should make a bioshock & legend of zelda water temple & the rest of the horrer games that u named pls",
        "PLEASE ROBLOX DOORs animatoin",
        "그림을 잘그리냐가 문제가아니라\n얼마나 제대로 스토리와 재밌게 만들어야 하는지 이거였네 좋은영상 땡큐!",
        "The idea of Kartana just being able to be so sharp it can cut through almost anything means that this thing is honestly a threat to everything",
        "1. Naganadel\n1:43 - 7:33 (5 minutes, 50 seconds)\n\n2. Kartana",
        "Do a smash bros battle royale",
        "Great battle, my only accuracy issue is the idea that kartana could cut through guzzlord’s stomach, since it functions like a black hole kartana should be long dead or immobile, it feels like that one pokemon entry was overrelied on",
        "4:23 You even included the fact that Kartana only speaks in reverse from the anime!!!",
        "pretty sure nihilego is pronounced like ni-hee-lego (ni from ni-san, hi like he but hee and lego like the lego pieces)",
        "Here's an idea a something about mario cart",
        "I really love how stakataka is a dalek that was amazing lol"
    ],
    "comments_disabled": false
}