{"video_id": "O5myIiXLqug", "comments": ["Make sure you check out Lockstin's Analysis Video here: https://youtu.be/CyQkW1oTlMc", "The idea of Kartana just being able to be so sharp it can cut through almost anything means that this thing is honestly a threat to everything", "i love how normally Pheromosa sees everything with unamusement and disgust, yet Kartana manages to cut (get it) through her expectatives", "Don’t you just love it when the post credit scenes create an overarching lore, or potentially hint at future episodes?", "Absolutely love how kartana flips around like a paper Mario character at 4:22", "its just unreal how many pop culture references and (forgotten) memes you can pack into your videos, incredibly well done.\nyoure a huge inspiration for me :)", "Congratulations, you have officially made Stakataka scarier than Guzzlord. I am impressed.", "The idea of Nihilego being a Headcrab is terrifying, yet accurate to the lore.", "I've always loved the Ultra Beasts. The concept of seeing what Pokémon look like in an another dimension was a really cool concept to me. I'm so glad you made this video!", "This has to be the best representation of the Ultra Beasts I have seen thus far. Usually I’m not a Ultra Beast fanatic but this do kinda make me consider being one.", "Nagarnadel and Kartana's battle is literally the epitome of \"never bring a knife to a gunfight\" but it was very close. Awesome battle royale! ", "We need more strange/cool ultra beasts. Tbh I really love the concept of them and how they are supposed to be like aliens.", "Jeremey Chinshue, your content brightens up everyone’s lives. You never fail to amaze us.", "Kartana's lines, unreversed:\n4:22 \"Mind if I cut in?\"\n5:48 \"Nothing like a sword fight under the cherry blossoms!\"\n\n5:59 \"Uigh, the smell!\"", "God can we talk about the ANIMATION. Absolutely FANTASTIC work, man. Especially that final fight scene.", "Blacephalon performing for the miltanks was so pure", "I love it when Jev is actually having fun.", "One Idea I’ve seen before is all the prehistoric Pokémon in a battle Royal. Basically All Hisuian Forms plus the Fossils. Imagine how crazy it would be including the Galarian Fossils. That would even increase more due to Scarlet’s and Violet’s Roster! Still a banger battle royale", "Gen 7, my favorite generation. This does it a LOT of justice. Thanks Terminal for an amazing animation as always.", "The fact that the poison doesn't affect Kartana because he's a steel type is actually so much attention to detail.", "What a magnificent battle. Too bad they didn't continue with the Ultra Beasts concept, I thought it was really cool. I wonder if when the ninth generation arrives you will do a Terastal battle or even with the ancient Pokémon", "I love how Guzzlord has just become the embodiment of the meme \"He screams for he does not know\"", "Always excited to be a part of these! Thanks for having me on, and for making such an ULTRA-quality animation!", "That Nostromo alarm was perfect lmao. \"You now have 3 minutes to abandon ship.\"", "I was expecting a Vergil status with Kartana, but still, this was absolutely amusing to watch, really a nice work of animation too.", "All of Kartana quotes:\n4:24 \"Mind if I cut in?\"\n4:32 \"Ah! Wide open.\"\n5:48 \"Nothing like a sword fight under the cherry blossoms.\"", "As a massive fan of Portal 2, Celesteela being the space core was incredible", "3:37 Wait, is Buzzswole in this part a reference to All Might? The rapid pats to wake up their \"friend\" muscling up and then deflating to a skinny form with a triangle chin and sunken eyes? Cause if so, that's AWESOME!", "I love the extra detail of how they all fell on Alola specifically.", "Isn’t it weird how this guy can give us so much knowledge and make us laugh at the same time? Wait did I just explain a good teacher ", "Quite comfortably convenient how every combatant gets to display their powers when there’s only 11 of them. ", "The fact that guzzlord scream is technically accurate to how he sounds is the funniest thing to me for some reason", "Buzzwole just constantly saying ”BUZZ” whenever it flexes is perfect", "I'm hoping for the next mainline Pokémon game to center around exploring space because a Pokémon capable of space-transporting humans safely came to Earth. honestly feels like the most logical next step.", "the production value on these just keeps getting better and better, it's super impressive!", "I'm so glad Miltank got some attention in this, even for jokes :D", "Ever thought about doing Battle Royals for each type? Would be cool to see who's the best of each one.", "For reference as to why kartana made it so far is because of its Dex entry of \"It can cut through anything\" along with the TCG and games where it's considered one of the best ultrabeasts", "It felt like dalekataka was done really dirty, but I guess it makes sense in retrospect that getting Adhesive in the mechanism is going to stop things from working properly.", "May we please talk about how terrifying these things would be when made realistic?\n\nAlso how’s Nihilego is serious just a parasite", "Didn’t think this series would continue, nice to see it did though", "Yo can someone decode the Morse at the end? (The crickets are sus) Awesome animation+ secret", "This is just solidifying how much I love Ultra Beasts. Some of the most creative Pokémon around.", "2:02\n\nStakataka trying to avoid Poipole using Poison moves despite the fact it's a Steel type is kinda funny", "Fun fact: Ol’ Locky saying “Oh it’s gone” seems to be timed perfectly with the lil’ Snuggoey walking out of sight.\n\nAnd Jeremey, if you see this and it was not intentional:", "I love how Buzzwole turned super buff and then became All-Might's weakened form. Also Kartana went complete Jetstream Sam on every single one of his victims, and it was awesome!", "I love the anime inspired scenes like the Xurkitree and Blacephalon showdown, Kartana speaking in reverse and Celesteela going to the moon", "Love the videos! You put so much time and work into them and they make my day better", "Love that small Undertale referrence, where we think Guzzlord wins, Kartana literally one shots Guzzlord by doing a Chara move! Love it!", "I like how the kartana is so small and looks so fragile but it cuts everything and wins the fight, just epic", "I've reversed Kartana's little quotes in the video and here is a surprise, they're all Jetstream Sam voicelines which is amazing and I love it.\n\"Mind if I cut in?\" 4:22\n\"Nothing like a swordfight under the cherry blossoms.\" 5:48", "So cool!!! Was hoping we'd get another one of these.\nI died when the happy miltanks just watching fireworks and the whole guzzlord eats bit", "Genuinely the coolest one yet! In terms of script, and showing off the pokémon lore, i mean the shot of kartana going up naganadel’s stinger was so freaking sick, I enjoyed this so much!! love my little kartana look at him go", "I absolutely loved kartana urgently bouncing at pheremosa's feet lmao", "Woah! This was the first appearance of Snugooi in a Terminal Montage vid! Great job as always you two!", "I love how some his drawings are always meant to seem terribly drawn but their well drawn In His own way-animation", "I like how some Ultra Beasts were actually trying to fight each other and some just wanted to do silly things.", "I like how it has the Gen 3 super effective sound effect for the intro.", "I remember these guys. My gosh it's been a long time since I've watched Sun and Moon. I don't think I finished it all either because there were a few that I didn't recognize. Also, the screaming frog sound from that dumb video had me dying for a few minutes", "Gonna be honest, this battle royale made me like several of the Ultra Beasts more. Case in point, Pheromosa. I didn't care about it before, TerminalMontage's interpretation is by far the best it's ever looked. Favorite parts are Blacephalon vs Naganadel, Buzzwhole existing & Kartana being a badass but got charmed by Pheromosa. Great work, amazing collabs TerminalMontage & Lockstin~", "Aside from buzzwole being killed way too early, this was great to see ultra beasts getting love", "7:40 The machine got two messages. They say the same thing, \"Paradox\" Pokémon discovered in Paldea; but one comes from Professor Sada, while the other comes from Professor Turo. Pretty neat nod to Scarlet & Violet.", "Don’t know why I never thought Stakataka would be able to act like one of those horror movie tropes of the walls slowly closing in until you are squished. Terrifying and I love it.", "Now I’m just worried about Mega Arodactyle. Last time we saw him, he was stuck with the Ultra Beasts, so where is he now?", "Bro the lore in the end credits is building up so fast, I can’t wait to see what’s next!", "Half expected the Naganadel to do the Courage laugh, that wheezing laugh he does when he makes it out of an event that should have killed him, but didn't. \n7:25", "Not gonna lie, I was expecting Guzzlord’s screaming to be much louder", "you know you're in for a treat when you hear the words \"loud sound warning\"", "Can we just talk about how beautiful the thumbnails are and whoever draws them should be awarded the best animator honestly", "Whoever was Minors had me cracking up every time he was on screen, mans was hilarious.", "I love how the smallest ultra beast and the one who looks like the most fragile is the strongest one (but he still lost in the end)", "i loved how the final explosion looked, nice colors and it just was animated very well", "I only just now realized, but at 1:18 is Buzzwole specifically mimicking the poses of the wrestler from Rhythm Heaven Fever's Ringside? If so, that is just some extra icing on top of the amazing cake that is this video.", "I expected the Guzzlord scream and I was not disappointed. ", "I like that most of the Ultrabeasts are just vibing, doing their own thing, rather than going straight to violence", "Though I was sad to see Stakataka get taken out so early, it does kinda make sense. Keep up the great vids Terminal :) <3", "I love how Pokémon that share a type often teamup.", "As Sun and Moon being my first introduction to Pokemon, this is amazing.", "Kartana is my fav, I just can't get over that silly little spin he does when he flies around cutting everything.", "That was cool, and the first time I've straight away jumped to the explanation video. I was not expecting Naganadel to last that long cause it's just a shoot poison boi. Honestly thought Guzzlord or Kartana would take this one.", "The insane amount of accuracy is what's most terrifying about these Pokémon Battle Royales. ", "Kartana being like Zacian's behemoth blade move is cool", "how this is more then 4 minutes is beyond me but I'm all here for it", "I love the reference to Guzzlord just constantly screaming", "I don't think I've ever actually watched the analysis videos after these, time to go through 'em all!", "I feel a pity for Celesteela, he didn't mean any harm on purpose, he just wanted to go to space like every childhood dream", "I REALLY love how you made some of them use some of their anime characteristics, like Buzzwole loving to flex, Kartana speaking backwards, Guzzlord screaming, and Poipole being highly energetic! I also LOVE the Iron Giant reference and the possible reference to Goku Vs Kefla when Kartana was cutting up Naganadel!", "Would have loved if Arin Hansen voiced Guzzlord. A common jab is it sounds just like him screaming.", "I love Guzzlord's face at 6:37", "Remember: Kartana is sharp enough to cut things that can only be seen from the 4th wall; and also space itself.", "My favorite part of these is noticing all the references. I just didn't expect that Portal 2 reference when Nihilego was flying through the air.", "Interesting that all of the first encounters were from their games counterparts. (With the exception of poipole but they’re in both so whatever)", "cant we appreciate the fact that the whole battle isnt much chaotic like the past battles", "How can this man keep coming with more category of pokemon. I swear he will be inventing new ones", "I chuckled when Kartana tried to save Pheromosa only to cause her more pain.", "References:\n\nIt - 5:00\nRomantic scene - 5:47", "I honestly thought kartana was gonna win but I'm still thankful that it was naganadel that took the W", "Kartana having Jetstream Sam's voice is so based, whoever came up with that deserves a big fat tap on the shoulder", "I always liked the Ultra Beasts being from another dimension expanding on the Pokémon universe. Their designs are cool as well.", "this royale is very different to previous ones because there are only so few ultra beasts we know of and it made the royale itself a more costly one"]}