{
    "video_id": "oiKm0qo6U4E",
    "comments": [
        "Should ask Izzy what happens if he loses to Alex again .. 4 x nil would be game over or would it be up to light heavy.",
        "Extrem respect to see him show up",
        "Anybody else thinking the thing that he has to deal with that he's talking about,is that he's gay?",
        "0:00 Izzy dealing with loss very well \n2:46 physically how does izzy feel after the fight \n4:19 How was fight week like for Izzy \n7:11 Watching his teammates fight ",
        "Stoppage wasn't prematurely, Izzy was wobbled and each punch from Alex was dynamite. Izzy was 1 punch away from going to bed ",
        "So this guy that is saying that he wasn’t rocked and was aware of what was happening and said Pereira will still lives in a favela after they fight is the humble guy? ",
        "3:40 mentions dance background and while doing so makes a subtle subconscious hand gesture over face as if he had sweat or hair in the way... Human body language tells stories without having to speak in context. ",
        "@mmaguru showed great break downs of this fight. Izzy delusional\nAnd definitely rocked. And before you deny it watch the break down.\nAlex checked most of the kicks throughout the fight. And how he tries to explain waiting on alex to get tired his hands were down not in guard position. And perennial nerve would be instant not 4 rounds later ",
        "Well done Izzy. That was hard to watch bro.",
        "TBH is disturbing to see how many people are celebrating his fall and usmans just because they’re African, people are happily expecting Francis to fall next. Disturbing how retrograde some of our mentalities are.",
        "Amazing champion. You’ll bounce back.",
        "Damn. Much respect to how he's handling the loss",
        "Greatest champion I've ever seen losing a belt, and I've been watching this since it started (I was just a kid, but nonetheless seeing Royce doing his thing for the first time is unforgettable). No one has ever seen this more as a player than Izzy. Legend.",
        "He's definitely a better fighter, he might have loss the belt but he won a better version of a fighter he is.",
        "Love Izzy and appreciate the self-awareness, but the I had my head down and I am still looking at him is a bs argument, if you were looking at him why did you get hit with so many unanswered shots. Protect yourself at all times.",
        "I guess Izzy will mark this as his redemption arc￼",
        "5:53...The only possible lie, in an otherwise honest interview. Hope he comes back like the champion he is",
        "He is handling this loss like a true champion and I can't wait for the rematch. Redemption! Big ups to IA!",
        "man izzys performance was nnext level, alex got him good.",
        "Oh man, you're lying. Alex killed you and insulted your dignity",
        "We still love u Izzy",
        "Very talented and inteligent guy is Izzy. Could have done many things in his life and been sucessful. Chin up.",
        "Dude said \"I diss on ya\" at the end.",
        "He has controlled that's why.",
        "No chance he could see his hands. His head was way down. He was seeing his feet maybe his waist at best. He was dazed",
        "major props to Izzy  I guess most ppl expected him to act how they would if they were in that situation.. but you can tell he's genuinely good with it.. I respect the hell outta that  and I definitely think the stoppage was early.. Izzy deserved more time than Goddard gave him, but it is what it is, can't wait for the rematch ",
        "Always been a fan of Izzy, but man, the way he's handling this L (that IMO wasn't rly an L, he won 90% of the fight then got caught) has made him easily 1 of my top 3 favorite fighters. Inspiring to see someone lose on such a big stage and dust it right off like this.",
        "I think izzy is a beast an an active champ took his loss like a g he was winning the fight handily too but Stone hands is dangerous until the last",
        "Idk what video yall are watching but all im seeing is Izzy making excuses while giving backhanded compliments to Poatan. \"I wasn't rocked\" \"I only fell because of a nerve kick I got 15 minutes earlier\" \"it was an early stoppage\" \"I was waiting for him to gas out\" ok Izzy you definitely weren't seeing tweety birds with jelly legs and out on your feet while you absorbed double digit unanswered shots ",
        "Id be salty being saved by the bell ️ then losing the same way in a 3-0",
        "I never had a hero when I was a kid but as I’ve grown up this dudes really become my hero lol",
        "I also think the stoppage was early but not a bad one",
        "I thought he was fine live, I thought it was premature at the moment, then I watched the reply and thought it was a good stoppage",
        "Izzy is one of smartest fighters i every seen and his  Accomplishment stand on their own.... War on Champ!!!",
        "Izzy walking to the center of the octagon to bow to his fans immediately after getting stopped again and beaten for the 3rd time by his rival gave me chills. Like your world's crumbling around you but to still have the presence of mind to stop and tell your fans that it's ok. So much respect for both men but Izzy is just different.",
        "izzy watch the video and watch how you moved :D :D you were defending ? :D moving :D :D stop lie to yourself :D he even stop to hit u...it could be KO ,,,be glad it ended like this :D",
        "နပင့သ့ါ",
        "Your additud is what makes you the best you are still a champion",
        "When people say wrestlers will take Alex down easy I’m laughing my ass off like what if they can’t hold Izzy’s big strong ass how are they gonna do the same to a bigger man … izzy is stronger then he appears his weight during the fight is probably near 200 pounds",
        "This guy is awesome & a great dude",
        "why isnt pereira getting any media attention after his win?",
        "He handled that like a champ. I am a fan, now. I hope all is well, physically with him. Live long and continued success, Israel.",
        "Hands up even if your leg is busted.",
        "As someone who went to school with Riddell and seen his come up through muay Thai, I'm very proud of him and his career. How he's held himself through the process! Such a legend in the fight game. Hope to see you regain that fire ",
        "I took your lose harder then you I was sick but i still believe at full health you are the best of your class",
        "very impressed with his humility in defeat and can't wait for him to get the title back.",
        "Excuse after excuse and all I see is comments about how humble Izzy is and how well he's taking the loss LMFAO. Y'all really have this man lodged in your throats that bad, huh ? It's legit embarrassing lol.",
        "During the press conferences and his entrance i didn't feel that \"izzy confidence\" he didnt seem himself i think maybe he was too focused but knowing he was hurt explains a lot because usually izzy can evade way better than what he was doing alex just emptied the tank a the end but i didn't really care for the stoppage i have seen much worse",
        "IF IZZY STAYED QUIET AND DID NOT SAY “OH ALEX WILL BE IN A BAR TRYING TO PICK UP A GIRL” ALEX LEGIT CHANGED SPORTS AND KICKED HIS ASS AGAIN",
        "Mouth saying something but body language showing how depressed he is ..",
        "I think it was a good stoppage, because of the strength he had with the uppercut,you can easily lose an eye with a guy like that.",
        "Are we going to just ignore that Izzys recollection of that ending is off. He shows it with his hands up around his face going side to side bit that is not what happened. His hands started by his head but after another shot his hands went to his side. He was not protecting himself. He was not \"lucid\".",
        "He did not have his hands up at the stop… multiple shots where land and he wasnt defending, good stoppage",
        "Good man, always a fan. But know I’m learning from you as well. I’m no fighter but your ability to learn from the changes in life is what I love. God bless. Man you looked fast and accurate, but I did see you being more timid when engaging then any other mma fights I have seen you in. I have seen them all I assure you sir. I believe you are the better fight 7 times outta ten, and that is the opinion of a man that has watched a loved all combat sports since 96. Heal up, love life, and break the stigma my boy.",
        "Why do they hate him again?",
        "Izzy not lying. I feel I'm taking it in harder then him. Idgaf izzy still my champ. I love you bro.",
        "Izzy is damn good at what he does, the way he analyse fight during the fight is amazing. Just love you man.",
        "Imagine Adesnya gets knocked down a 3rd time... CAREER END!",
        "Izzy is a true Champion!",
        "I don't agree it was early, izzy would have got a knee to the face if it wasn't stopped",
        "This dude salty",
        "He’s a great Champion! That has shined through more than ever in his first UFC loss. His grace in defeat, is the way we should all accept loss. Win them like you lose them! He is definitely one of the greatest of all times! Thanks for the lesson Grand Master Israel Adesanya!",
        "Don’t get me wrong, I can’t buy that he accepted the loss truly.",
        "Izzy your owning the loss stop making excuses come on izzy you were rocked and going out my dude I'll get em next time that's all chin up.",
        "He’s going to win it back",
        "That fact that u keep asking y he is not losing it is super annoying honestly. This world so full of hyenas you don’t even know when you’re looking at a lion! He is a worrier, let it go.",
        "really like when Izzzy is being  simple honest  and not cussing.  such a cool n intelligent  guy",
        "I’m done with Ariel…",
        "Hey bro you don't lose if you don't lose in the head.better fight next time. I know you will be back.i want you to do it this time.",
        "Head of the cage ",
        "favourite fighter of all time, what a champion reign.\nIzzy will be back with a vengeance ",
        "A great champion we loved here in the Philippines! Please come back in the octagon, fight the Russians, they are good fighters like you!",
        "Izzy is hands down one of the best in Mma. But he has to own this loss because we all know he would of been high on his horse if he would of won. We wouldn't of heard the end of it. In this case HE MUST OF FORGOT about Alex lol. Was a great fight and we all know he had this won. I'm an izzy fan but that's the cold hard truth he has to own this and he's a G for doing so.",
        "Adesanya went to make excuses to the show that’s how I see it. He was waiting for pereira to gas out so vulnerable in that position",
        "Pereira to Adesanya is who Goku is to Vegeta",
        "“It’s the best I ever felt” then he says he had a knee issue & a bad camp all in the same video. Cmon Izzy.",
        "EXCUSES??",
        "Nothing but respect for Izzy. What a warrior",
        "He had the belt but he's not defined by it.",
        "I know it doesn't matter, but my respect for this man is beyond the sky",
        "“Here’s where breakdancing came into play “",
        "Please Mr Helwani, just ask him bluntly why Pereira turned him into a wrestler that night.",
        "L",
        "Izzy fans are delusional as he is, so they not here what Izzy is saying? Lies and excuses",
        "Straight up cap. I rewatched the finish 10 times. He was not looking at his arms at all. Straight up cap",
        "Full of excuses",
        "Israel \"perennial nerve\" addesanya ",
        "Izzy had me with handling the loss well, and then he ruined it by making excuses and ariel stroking his ego didn't help either.",
        "“swing and miss” Pereira landed every shot lol",
        "Izzy is actually the bad guy in this. He will lose again",
        "12:50 I saw him womble.",
        "I think this guy is such a liar",
        "Always keep your humble in fighting. Always stay focused don't get distracted or carried away your here to fight.",
        "Same year Usman Izzy dethroned in the 5th round. Its a nice change up but you know Dana isnt about having a Brazilian champion that can't  speaka the English",
        "Ok he’s got me back this dude is proper humble and respectful I just hadn’t noticed it before nice to see someone so amazing be able to teach all of us how to handle disappointments",
        "How is this not eating you up inside? \n\nBy lying through his teeth lol it is sad to think about the heartbreak that must come with losing your title. Especially after being so dominant. But he is lying lying lying at every turn lol",
        "Last time you did izzy the ref saved your Ass be thankful. And you can make more money in the rematch. If he puts you out cold. Maybe there is no big money rematch. Stay happy.",
        "It was the best stoppage Adesanya could have asked for. \nEarly enough some people will claim it was a bad stoppage and Adesanya could have continued (like Ariel himself). \nEarly enough he avoided getting knocked out and turned into a meme.",
        "Sometimes I wish Izzy would just leave the Sport, you guys don’t appreciate this man enough. He’s always chasing the toughest opponents, he always tries to engage in media, he always tries to give a show walkouts. He deserves better than MMA fans, hopefully he retires soon",
        "I Will 1 day meet The Last StyleBender",
        "No one on Earth with the magnitude and star power that Izzy has will do an interview after a loss like that. Props.",
        "“was it the fifth round?” lol his brain is mush",
        "as usual a lot of BS from his mouth...",
        "16:50 \"You know the PAIR-A-NEAL?\" Lol. He's been talking about this quite a bit like he's educated on it, but he can't even pronounce the name of it. It's the Peroneal nerve, and he showed no signs of drop-foot at any point in the fight. Even after he hit the canvas and rolled late in the fight. Peroneal nerve damage causes drop-foot. He was comfortably kicking and moving his feet without his foot dragging.",
        "Izzy went from killer to point fighter",
        "Shits sad. Denial is insane. You were 100% rocked and getting lit up. It was a phenomenal stoppage. Izzy was gone. 100%.. every single fighter analyst & even his coaches knew he was gone. He was outta there. He wasn’t fine. He can’t accept that this man has his number. It’s just what it is. This is getting embarrassing. Dude got hit with every shot pereira threw lmao if a knee came he would’ve gotten tranquilized",
        "U lost the match bro… just train for another. No more excuses.. You are a champ.",
        "Absolute class from Izzy. The way he’s handled this situation is what a true champion does.",
        "Lmaoo he really said “I was going to take him down and beat him up” boy you were going to get KOd",
        "Alex Pereira is like the end boss in Prince of Persia and Izzy is determined to beat the game.",
        "Izzy will learn from this. Nothing is guaranteed in this life, or this sport. He'll bounce back just fine.",
        "U no go rest",
        "Nothing but respect to Izzy. As a kickboxing fan i love the work of both these warriors. I went into this fight hoping for a minimum of three rounds and they delivered.",
        "I think there should be out of competition weigh ins. Like u can't walk around at 240 and then cut to middleweight or whatever. It's kinda defeating the purpose.",
        "I'm amazed at the fortitude of his character. He's still himself with or without a belt.",
        "How could he see his arms well enough to dodge when he's bent over like that? Like he sees them in the corner of his eyes? Legitimate question, not hating.",
        "Not a big Izzy fan — but won my deep respect, praise and admiration for immediately taking the fight, doing live press after the tko, and applying a realistic and honest analysis where he shows both tremendous sportsmanship, and an opportunity for growth, development & improvement. Alex is a scary assassin.",
        "Israel is pure Class Man, Great Dude!",
        "Definitely painful to watch em lose but I enjoyed every bit of the fight….u gotta love the sport. The adrenaline rush I had while watching every round up to the finish was a great feeling",
        "I'm not an Izzy fan ...but a Champion that had defended his title as many times as he did,..as a ref ... the challenger needs to knock him out, period.  That was a horrible stoppage.  Adesania has shown a lot of class.",
        "Love the words he has for young kids \"don't peak now\" Such wisdom.",
        "17:30",
        "The stoppage was a good call. It appears that Alex is Izzy's Achilles heel ",
        "I’m the biggest Izzy fan but cmon if his peroneal nerve was kicked in round 1-2 it would’ve gave out in round 1 and round 2 not throughout the last sequence before the stoppage which I feel was a little early compared to the Kelvin Gastelum fight cause he should’ve stopped tht the first time izzy dropped him in the 5th but either way he was winning the fight 3-1 and he got stunned against tht fence and jus couldn’t get away from them Shots from Pereira but it was early I’ll say tht but I don’t think anything was gunna go Izzy’s way if it went on much longer  But I still got my Man Izzy winning the rematch and gettin his belt back ",
        "Probably jus me as an Izzy fan, but seeing so many people say they are glad he’s more humble now doesn’t make sense to me.\n\nDudes always been the same nerdy dangerous geek, win or lose. ️ ",
        "I'm still hearing a lot of excuses in relation to the stoppage. He was ready to get blasted badly. Alex was on fire. Better prove it next time, or get ready to come up with more excuses.",
        "This guy was defenseless,he should be thankful the referee stopped the fight!",
        "Hope you get the belt back man You fought very well I thought you had that ",
        "Such a humble inspirational guy definitely someone to look up to",
        "Why didn't he get his nails done?",
        "Ariel \"ball hugger\" helwani",
        "Completely delusional. Dealing with the loss really bad and just plain lying. Go back and watch the TKO frame by frame, it wasn't your leg..",
        "Anyone believing Izzy was aware of what was going on during the finish you should go watch mma guru clips. He has the sequence in slow motion showing Izzy trying to grab at ghost with dead eyes. Might as well have been a flash ko. It's a shame he's trying to sell it as anything else.",
        "quick stoppage is rich. 10 unanswered strikes from a power puncher and izzy looked like he was trying to survive the entire time. great stoppage, ariel just a fangirl.",
        "He got humbled ",
        "How he acted in this interview and on the newest episode of Flagrant with Andrew Schulz shows why Izzy is a champ with or without the belt!!! I still rock with Izzy but Alex is a bad, bad man and a stone cold KO machine. Izzy was winning the fight before the KO tho to be fair to him",
        "dudes a true champ...humble in defeat.",
        "all i can hear is excuse after excuse, he's not taking the loss well, could've say he fought well and got caught at the last round again,but now comes the perinial nerve BS,if u get hit there you won't even be able to kick, if he had that coming into the fight he wasn't gonna be able to throw question mark kicks,adesanya still has the massive EGO he will never accept he was out on his feet",
        "Israel is the king.. You lose in the eyes of man is a win in the eyes of God.. What a champion",
        "People love to cite the incredible comebacks like Barry-Kongo, but the reality is 9/10 times the one stopped gets brutally KO’d or hurt badly.",
        "Alex POATAN Pereira 3 x 0 Frozen bla-bla-bla",
        "He got ko badly 3 times like wilder he will never beat pereira his reign is over period",
        "To me Izzy mostly looks incredibley relieved. If he keeps this attitude and wont develop some kind of bitternes, then its a pretty good reaction. Though there would be alot more dignity to it if he admitted that A - his left hook was after the bell, hence - dirty, and would've been dirty win if it won him the fight. And B - he was very much in chicken town when the ref stepped in and saved him from a potential future as a mumbling momo.",
        "Izz, there's no shame in losing, you can only loose when you take the risk to compete, and no one knows that feeling only you #stillafan, and you know what, you found your Apollo Creed! this is gonna be a trilogy man, i can feel it",
        "Every excuse in the world with this guy lol you lost fo & you will lose again. All this phony talk gets old, he's not even humble which is y u will lose again he acting like he won  I think usman handled it better this dude is just saying w.e to make him feel safe, he sleeps eats & lives thinking of the OG. 3-0 on him.",
        "Absolutely  stoked by the way you carried yourself after that huge loss,Hats off to you",
        "I thought he would lose. Only because I'm a huge kickboxing fan and I knew how long Alex has been training mma. That being said he handled it like a man and I thought he was going to take the W, but Alex is no joke",
        "Love you adesanya hope you brush Pereira teeth in the rematch",
        "Adesanya, you are my brother.  You literarily killed me. It is game/sports though. Talking about the lost, you lost that fight from your corner. Peirera won from the corner.  The coach at the last round warned him you are losing the only way out is a knockout. In all you are my brother.  God bless you bro.",
        "So grateful in defeat. I have a new appreciation for Israel Adesenya. Respect champ!",
        "Hows your dad\nthere was a violation",
        "12:13 Starts break dancing to saw theme music",
        "As long as you have handlers and you dont turn to GOD! NOTHING AND NOONE CAN HELP YOU!!! ONLY GOD CAN!!! ONLY GOD CAN!!! ",
        "Sounds like excuses too me.",
        "So humble in defeat lol ya right! So many excuses good lord dude just take the L you earned",
        "Izzys doesn't want the New Zealand police having a couple of tactical units that carry guns in the vehicles in high gun crime areas but he carries brass knuckles and has a private security team.  he doesn't want the public feeling safe .Classic case of do as I say not as I do",
        "That loss humbled his ass ain’t it",
        "Some pieces of that interview are perfect examples of a man lying to himself.",
        "I always appreciated how good Izzy is, but I have never really been a fan of his. I literally started becoming a fan from this fight and now after the fight he has instantly become one of my favorites. Dude handled himself like a legend",
        "Some People say he is cringe, some say he is arrogant. But what I see is one of the most genuine and authentic Athletes ever. What an example of showing how to deal with losing.",
        "True Champion ",
        "Izzy thought he had the fight he was winning he knew it then  Alex ancestors gave him strength and started throwing bombs and boom Izzy got brought back to the time he got knocked out and luckily the ref stopped the fight whew that’s what the devil worshiper gets hahahahaha",
        "It wasn’t over",
        "If Nigeria doesn't have a capacity South Africa does   https://en.wikipedia.org/wiki/List_of_indoor_arenas_in_South_Africa",
        "His hands were at his waist, not even close to his head. It was a good stoppage.",
        "What made Muhammad Ali great was his character outside the ring, just as much as his talent inside it. Israel has the same vibe. He’s already one of the best to ever do it. Can’t wait to watch him again. Mad love.",
        "Thank god Izzy lost",
        "The NEW DEONTAY WILDER  making excuses after excuse",
        "What a beautiful sport, beautiful fight and what an inspirational mindset",
        "Izzy may have been lucid but he wasn't dodging any of those hits nor holding a guard. He was swaying his head back and forth but Alex playing ping pong. The rule is intelligent defense and Izzy was doing his best Rocky impersonation.",
        "Mad respect fighting all the top men, I wanna see this in boxing, izzy has been a great champion, and his personality is so humble mad respect izzy",
        "Ariel, when will you have the new Middleweight Champion on your show?\n\nThat's the interview I want to see.",
        "0-3",
        "Izzy is an amazing fighter and will be champion again",
        "What a boss in any way - great as a winner and humble and gracious in a loss",
        "Izzy is lying and making excuses. He was done. Great stoppage.",
        "I new this dude was a lil liar after I got to know him more what a clown. Still a great fighter tho",
        "Wow, respect for Izzy going out and doing interviews when he lost to the guy 3 times now!! This interview really changed my view on Israel Adesanya respect!!!",
        "I think we should (and im sure izzy would rather) focus more on how well he faught the rest of the fight more than the loss itself. Cuz he was showin us all kinds of new skills was veryy impressed!",
        "L + fell off",
        "Seems like a good dude",
        "Izzys the man! And he's a better fighter than AP",
        "I think Izzy should drop to 170 and take that belt before a rematch.  Let someone else deal with Alex for now",
        "He’s literally spinning a web of lies and excuses, and everyone is calling him humble and gracious  grow up",
        "Omo if i hear say we no still dey ur back",
        "Didn’t like Izzy before and was hoping he’d lose I thought the stoppage could have went longer but I definitely didn’t see Izzy being able to survive whatsoever.",
        "izzy was out on his feet. He hit canvas got cracked like 10 times in a row. hands at his waist, no guard bent over, legs were gone. That ref saved him.",
        "Izzy is class personified, much respect and appreciation ",
        "Izzy doesn't  know what round he got k.o .lol",
        "Glad the fight was stopped when it did. Now the rematch can happen in 6-8 months instead of 10-over a year due to a vicious KO.",
        "Goosebumps, from how he describes the song.  Love it.",
        "Everytime he is burping on interviews",
        "The whole conversation about the stoppage was cringe af. Elsa took like 15 unanswered power shots to the head and was dropped to his knees in the middle of it lmao",
        "Hahaha premature ",
        "Big Fan keep your head up no matter what your time will come",
        "I respect him even more now",
        "His handlers??",
        "The champion has a name isreal adesanya",
        "After Izzy claiming it was too early, i wish the ref would have let Pereira knock Izzy out cold. Its not like the end of the round was near, he was defending punches wiht his face lol.",
        "Israel is a very likable guy. I like how he said I'm always being humbled. I hope he gets it back. Maybe it was stopped early but can't go back what's done is done.",
        "Ariel’s the only person that can have me actually root for Schaub lol",
        "Yo why the host look like perria the dude that beat up adseyana",
        "The “people who ride for him taking it harden than me” is accurate because, I def did",
        "Love You Bro IZZY",
        "I used to be a fan, now i am an AC. i just learnt an important thing in my life because this amazing guy. mad respect. thank you Izzy",
        "Everyone go watch mma guru’s video on this",
        "Izzy is the best",
        "Only fatty keyboard warriors made fun of Izzy but he is great fighter.",
        "Izzie is the GOAT of middleweights. Change my mind!",
        "Acting like he knew what was going on when he was getting pummelled  bro was 5 seconds away from getting a knee to thr face.",
        "What is with Ariel the way he asks questions he’s rude to people I don’t know how he is a name in MMA journalism",
        "16:30 What???\nDude needs to watch the fight again.\nAlex threw more then double the amount of leg kicks that Izzy did and most of Izzy's kicks got checked so that's why his legs were gone and also no he can be all proud and not admit but the stoppage was a great one.",
        "Perfect stoppage",
        "Very powerful gesture by Izzy to come to the show right after a loss.",
        "my intuition is on point... 22:15 He says their energies dont mix... got me thinking, im guessing Izzy zodiac element is Water and Alex is Fire... I WAS RIGHT",
        "Tbh I had gone off Izzy, but he’s totally won my heart with this fight. Even in the buildup, it was just like the process of watching a nice human being try to overcome something incredibly difficult. There is no shame in losing, he’s a true warrior.",
        "Say whatever you want about him, but he’s definitely got my respect, taking this loss as the champion he is, honestly very inspiring and definitely rooting for him in the rematch.",
        "Izzy Would Have Been A Meme If The Fight Wasnt Stopped  \n\nEdit: Izzy Fans , I Have Much Respect For Him And Love His Style But Let’s Be Real Here .",
        "I like how izzy is cool like he didn't lose he's belt that's a mind of the champ ",
        "Whatever izzy loses rematch",
        "I have alot of respect for the people whi risk they life to fight however I believe izzy should just not go back into it again with the guy it should be done and over 3 losses to the guy means he just has your number",
        "The ref did a good job at stopping that fight Izzy. You were about to get really, really hurt",
        "DELUSION DELUSION DELUSION",
        "Bro bout to be 0-4 ",
        "@ twenty four minutes, start there. Izzy is awesome. And you know what, he can beat Alex. It's just really difficult to. Haha! I wanna see him get that belt back! This is movie stuff, gang. Really is. How Pereira shoot an arrow into the ring and walks out like an unmasked Mike Myers to the ring or the cage. Classic rivalry/underdog story, but one where the underdog, I mean, dayum, the underdog is Izzy, who has a record of 75-5 in kick boxing and 23-2 in mma. I love this dude!",
        "Lol Izzy got rocked. I love how he’s handling the loss, but I can’t believe he’s trying to sell us on his legs giving out for the reason why he was wobbled. I don’t think letting Pereira waste his energy on Izzy’s chin is the best strategy. Marc saved him from getting meme’d like Usman. He was about to get kneed into the shadow realm.",
        "I love the interview however. We the public the fans want that rematch as soon as possible. I want to say let’s put these words to an end because Alex won the fight. Izzy we saw you were winning until you started drifting or being cocky. You would have one the fight clearly but I was disappointed that you let us down. Izzy my uso… you owe us the fans. We know you won 3 out of 1. We need that belt back around your waist uso. In saying that Robert will win if he gets a chance to fight Alex. Izzy you must bring that belt back home brother",
        "There is no land with name  israel . Its palastine",
        "You have to respect Izzy for the way he has carried himself since losing. \nI wish he did not refer to him and his mates as soldiers. They are not soldiers but I understand why he said that.",
        "Leadership is demonstrated in challenging times.  Very classy Izzy. A real pro!",
        "Izzy fans grasping at dust right now. Best loser ever!!!!",
        "You can see he is very smart!!!",
        "Still a huge izzy fan but he is definitely misremembering how that fight ended. He probably thinks he was covering up and parrying the shots, but when he watches it back he'll see that his eyes were on the floor, his hands by his sides and repeatedly getting cracked in the temple. Good stoppage.",
        "I never turned on Izzy like a lot of people. Huge fan, but seeing what a god damn man he is in handling the defeat and loss of his title makes me an even bigger fan.",
        "Would be better if iZZY ACCEPTS THE LOSS and the crazy knockout hahaha",
        "Such a powerful legend for still showing up after a loss. He went on Schulz’s podcast too. Absolute legend. Powerful Izzy.",
        "Izzy saying that he’ll enjoy watching the fight back just shows what a true fan of the sport he is - he means it. He will know the card was an excellent spectacle and he has shown grace in defeat - very respectful. True championship mentality. Respect.",
        "He doesn't look like he's even been in a fight at all wtf",
        "He’s delusional.",
        "Izzy will never beat Alex ",
        "He's still delusional and will probably get knocked out again.",
        "Izzy is lame",
        "Ariel stfup , your flow is all over the place ... \"you were more rocked in the gustlem fight\" izzy says \"gastleum i mean was rocked\" wtf ",
        "\"I was waiting for him to gas out so I could take him down and beat him up.\"\n\nPure delusion and the rest of the comments are feeding off it.",
        "Like Izzy said, the legs feed the wolves, and compromizing the footwork seems to have slowed izzy enough to land. Amazing champion and look forward to Izzy's future",
        "Izzy was about to sleep come on.",
        "The way Izzy handles this loss leaves him as a certified great",
        "Ariel is riding hard here",
        "Ain’t now way izzy saw Alex with his head down while he was concussed",
        "Smh the ref saved his brain he should be thankful smh",
        "Yes!!.....Izzy got more power when he felt Daddy Pereira s punches........jejejeje",
        "Such a beast and active fighter. All the best to the Middleweight division",
        "So glad Izzy lost. Felt like he was a disgrace of a champion for some pretty gay reasons.",
        "Izzy isn’t taking the loss well he’s making excuses tbh and he was out on his feet, but still respect",
        "NZ Izzy ",
        "I bet on Pereira, 2nd or 3rd round KO. I lost but if there is a rematch, I'm picking Izzy 1st round KO.",
        "Israel adezsnya ..eres el mejor y más completo pero perdiendo se  gana también ok..y sabes como es el juego así mejoras y tomas experiencia ..siempre te he seguido desde tu comienzo en el boxin.cuidate..bey",
        "I love Yu Ariel..But the disrespect Izzy had..I don't like him",
        "Izzy did get dropped lol. He doesn't remember because he got dropped.",
        "I'm sick of 5rd fights being stopped like that. It's a championship fight. Standing TKO? Come on, bruh. It's not like Izzy was 4 rds down.",
        "Crazy what a loss can do for somebody’s career. I feel a lot of us think that this loss was a blessing in disguise for Izzy. Belt will be his after the rematch ",
        "i like how he is manipulating he was knocked out coldand these kids believe him",
        "Izzy is super wealthy and rich either way. You can’t win them all. When Tyson and Ali have been beaten that’s all you need to know that even the best of the best lose a few. This dudes life is still better financially then 99% of ours so he is fine",
        "Izzy on the end of the first round you punch him after buzzer! That punch make a lot damage to him!",
        "Ariel has an incredible way of asking questions and connecting to the guests.",
        "Denial is a helluva drug, you  were not waiting to Gas him out, you were about to go to the shadow realm, the ref saved your life",
        "Bro, this loss, made me love him even more. Such a good human.",
        "Any man thats worth his weight in gold NEEDS a little bit of ego.",
        "Props to both men, such a sick fight.",
        "DELUSIONAL LMAO",
        "Humbled,",
        "He's just such a good , classy guy . I like Israel a lot, knowing he has ptsd like me and handles everything he does , you people don't know the half of it . The ts literally why during the staredowns he look scared but he's not . Just like me , we can't stare long it's a side effect from ptsd. The more we stare the more anxious we become . I'm very happy for Alex but Izzy you're the Man! ",
        "You see how izzy touched the wood respect",
        "HAHAHA what a bad loser... he was dizzy and almost out and keep saying he was 100% ok. Referi stop the fight, poatan almost in his corner with arms up and Israel was still swinging in front of fereri looking down. And try to lie saying that he use wrestle for the fans enjoy when the truth is he knew that this could happen if he didnt doesnt. That arrogance disguised as confidence is why really wanted the referi dont stop the fight to see Israel sleept again.",
        "He didn’t dance because he knew he would look stupid and lose",
        "If the referee didn't interfere adasanya is a dead man",
        "You people in the comments are a bunch of fangirls. He keeps making excuse after excuse and you people call him humble. I swear Izzy fans are on average 13 years old. I was actually feeling bad for him but now i want him to get sent to the ICU again by Alex, lets see him making more excuses.",
        "Haha Dana can dislike Helwani all he likes, he knows exactly how to interview the greats and the fighters like him, the ones that matter anyhow...",
        "The referee robbed him criminal type stop highly bidded illegally activity by the referee that was paid to stop match wtf he was ducking and weaving how the hell did he stop it that's illegal what they did to him I feel so bad",
        "It was an early stoppage not a bad stoppage. Pereira threw 20 punches and landed 15 unanswered, whether his nerve got hit or regardless he fell then received more blows.",
        "This guy always outmatches Alex, BUT Alex has always found a way to beat him. Alex's corner at the last minute,  told him, \"you have to knock him out\", same thing Kamaru Usman's last opponent's corner did; we could see Alex coming out saying, \"I am going to kill you\" and then came out Gun blazing. Izzy's corner needs to do a better job with killers like Alex and strategize in moments like that. I have a question; when Izzy had Alex in trouble, why did the referee separate them when Izzy moved in for a final Kill? This fight would have ended differently.",
        "Much respect to Adesanya. Hard to not like the guy for being himself and humble. Very well spoken too. I was sad for him in defeat, but after this interview, not only did I feel better but gained much more respect than I already had for him. He deserves the success he has earned in life and I wish him luck in his next battles.",
        "20:50 because he's only concerned with what he can control.",
        "Remember how his fans bullied Costa for excuses now Izzy making even more excuses and his fans sucking him off crazy ",
        "Helwani is such a weasel",
        "Excuse excuse excuse this ashame frfr like bro he’s on a excuse tour and Ariel just riding his nuts",
        "Absolute legend",
        "\"no one is gonna check it\"\nMe who always goes in badlands mineshafts: are you sure about that, Cam?",
        "Ariel knows how to play them. \nLooking at an ego right now. Says one thing means another.\nIzzy need to talk to Tyson Fury, if he came out the aggressor, different story.",
        "Adesanya shouldn’t even petition for a rematch with Pereira, he’ll lose again.",
        "MedMen stock Moving up! Mike Tyson coming to Las Vegas MedMen in November.  Most Recognized name in the Marijuana Industry. Buy MMNFF stock!",
        "The only reason adesanya came on the show is because he needed to give his excuses after he got his ass tko ",
        "What's with all the excuses? He's acting like he had guard up the whole time during the fight ending sequence lmao. \"I wasn't rocked\" blatant denial of what happened. Will lose the rematch with that attitude.",
        "lol! what!? xD",
        "I appreciate Adesanya so much more through this loss than in any other time. For one, I respect him for getting in there and fighting that monster. He did not run away. And I really appreciate how gracious he is in defeat. This authentic, transparent version of Izzy is so much better than the character he portrays in the lead up to most of his fights. This to me feels like more of a true martial artist and I could totally see myself becoming a fan of his.",
        "He's got a chin I forget that because he doesn't get hit much. But he took some from Jan to . He may have made it to the end of it could have been face down. This was a good ending",
        "Izzy was smashed and in Disneyland ",
        "Izrael is mentaly strongest fighter in UFC.They was how he took loss ,real hero",
        "I knew he would be like this. He's the guy that won't learn from a lose because he can't expect it. When fighter's don't expect a lose most of the time that's there downfall. There's a ton of fighter's that say what he said and don't except that they actually lose and it was no one else's fault they rarely come back. They fight again samething would happen because he's beat him 3 times and he knows he can knock him out. It will happen earlier next time.",
        "Izzy \"Hide the pain\" Adesanya",
        "'Chill Daddy' -Adesanya 2022",
        "How can anybody think they stopped it to early lol",
        "Izzy took the loss like a good sport on fight night and kind of won me over. Then he proceeded to go on multiple talk shows making all kinds of excuses about his leg, the stoppage, saying he wasn't hurt. Now I'm back to disliking him again. That didn't take long. What a POS. ...Goddard robbed us all of seeing Izzy face planted in the canvas. All we needed was 3 more seconds and that knee would have caved his face in.",
        "How can he not bothered by losing the belt? He’s a competitor. Coming into the Alex fight he sound very insecure and he still sounds insecure when Ariel ask them if he can beat them.",
        "Izzy I love you brother but you got him in the first he got you in the 5th  just looked really bad that your hands were not up like how your showing here bro I do believe your a better much well rounded fighter smart he’s a robot also very good in his ways you were rocked man so was he",
        "You mean I missed it! Someone finally has this guys number, oh the joy!",
        "He is 3-0 to u...he's like wtf.",
        "The fakest answers he could’ve come up with.  Dude you got rocked not nerve kicked lol",
        "I’ll say one thing, he’s a better loser than he is a winner. Not an early stoppage though, he was bout to be embarrassed again.",
        "I love izzy so much. As a former thai boxer i can understand some of the stuff he speaks about and i dont know after such a huge loss if i would be as care free as him. Its really admirable and he inspires me to not put so much pressure on myself if something doesnt turn out the way i wanted. We all should try to be a little bit more like him in that way. Things would be a lot better for sure.",
        "Can't understand how everyone is still brown nosing Sizzy after watching him cry about the stoppage. He should be thankful Goddard saved his life lol",
        "UNIONDALE !!!!!",
        "You are not use to standing to the cage , your mistake was your standing close and back on the cage … that’s not ur fighting style  you always use to move around and not stand one place that’s how he got you in the 5th Round … you made that mistake cuz you are already winning",
        "As much as I dislike Izzy, I give him mad credit.  He was a true champ.  He never dodged a fight and took on literally anyone and everyone.  He better get a rematch literally when he wants it.  The UFC owes him that much",
        "Dominique didn't sit down because his legs were so injured, but he tried to play it off like he's a gangster lmao",
        "This man talking about he doesn’t think of almost ko him in first round. Lies thats all this mAn talks about from there 2nd fight how he “almost” stopped him but got saved with an 8 count lol.. eugene should have ruled against this promo loss run lol",
        "Like him or not, this man is wise way beyond his years. We should all learn to deal with defeats this well. True inspiration. Much Respect.",
        "What a lucid guy. I am a fan, even I am beeing a brazilian. Great guy. God bless you man",
        "Izzy is not dealing with it well and would off ended up in the shadow realms off shadow realms so lucky the ref stopped it..jeez i wish he would just humble up. The perenal nerve stuff is not needed...Alex is just built on this planet to beat a guy like Izzy....",
        "Izzy - Burp  \"Excuse me I just did Hot Ones.\" Lmao",
        "Hope people don’t think this loss is gonna cripple this man  nobody else in the division will ever be champ again as long as these two are present",
        "I'm not a huge fan of his, and I think the fight was stopped just a bit to quickly. The man is a skilled champion, a talented human being, and the ref should have given him a shot; at least let him hit the matt before he stopped the fight. I trained fighters for two decades, fought myself in many fights. Adesanya should be a bit upset at that stoppage.  I think I may now be a fan after hearing him speak, being a gentleman. It is important man stays humble.",
        "RESPECT to you Izzy.  You're still the champion in my mind. You'll be back and I'm confident you'll make it official again. Stay well.",
        "Izzy is in such denial",
        "The way Izzy handled this loss....... RESPECT.\nIn this loss he gained a fan.",
        "People are saying he’s taking it well how ? He’s literally just making excuses lmfao",
        "Izzy still doing interviews after losing the fight is text book way on how to take an L. Still smiling unphased ready to rest then fight again. This man is Champ with or without a belt! I’m most def taking notes ",
        "The last clip is an A-team moment",
        " notingham forest logo in the background… so random",
        "Much more humble, and the fact that he explain everything thing in detail shows the change of energy from dominant to something else",
        "It was a bullshyt stoppage anyone who said it wasn’t it’s usually an Izzy hater period",
        "Lol izzy saying he stopped it when he was doing his head movement against the cage? The footage is outthere to show he was STILL getting clipped on the cage while he was doing his \"head movement\"",
        "He didn’t even accept the loss bahaha",
        "\"He's good. But I'M BAD\" Alex POATAN Pereira 3 x 0 Frozen Adesanya",
        "he's sooo brave ",
        "Whatever happened to Alex being some washed up fighter in some pub rambling about how he one time beat Izzy in some kick boxing fight and never amounting to anything?",
        "The more I find out about the details of the fight from Izzy, the nerve damage, the lucidity he had before the fight got stopped, the more pissed I get, but then Izzy's attitude keeps me calm. I'm confused, but satisfied. I kinda luv this dude.",
        "So how many times have they met and where they all MMA ?",
        "C'mon man that was a good stoppage. Pereira was hardly missing. He landed like a dozen SOLID shots, one after the other. Nothing was being thrown back by Adesanya and by the end of the sequence he was blindly ducking.",
        "I’m a big fan of Izzy’s honestly but wanted to see him in a real fight. The love he got at the weigh ins and in the arena spoke volumes to how he loved he is. Cant help but respect him for showing up after that lose. Fans want the rematch, it’s the only logical thing to do.",
        "Doctor Fred is an ambulance chaser bruh he got you on a $10,000 acid reflux script all day",
        "I don't think Izzy is in the right state of mind to review the fight on air so quickly. He's coping hard here which truly sucks I feel for him. This is not him being honest with himself, he needs accept the loss to the better fighter on the night. Take time to reflect and honestly review the fight before doing media appearances.",
        "Israel Adesanya you are an amazing human being bro. You are the best striker of all time. Luck has been on his side, that's been obvious from the first fight. That's the difference, that's all. You are clearly the best fighter. He's bigger and stronger. That's it.",
        "Izzy pretends to be humble, he aint, to much ego, saying it was a bad stoppage & he was ok, he was ''ready to die'' & Alex was ''ready to kill'' he is lucky the ref stopped it, i can tel he has finaly been humbled the way Khabib humbled Connor.",
        "I know a lot of y’all are here from Guru’s video but I was thinking the same thing even before watching it. Izzy constantly brings up imaginary scenarios that didn’t happen. Says he wasn’t that rocked when he clearly was, wasn’t defending himself like he portrayed he was, talked about the perennial nerve kick in the 1st but it conveniently only took effect right before and during the finishing sequence. He also claimed he felt the best he ever felt while also saying he hurt his leg in camp. He doesn’t really give Alex the proper credit for the finishing sequence and mostly just blamed it on the leg rather than the actual unanswered shots that rocked him. He claimed he was trying to gas Pereira out by letting him hit him even tho he was visibly hurt by the shots and didn’t have his hands up at all. Nothing is adding up to what he’s saying. He hasn’t accepted the loss, he’s accepted his own altered version of events to help cope. He is being utterly delusional while saying he’s “accepted the loss” and “doesn’t blame the ref.”",
        "Israel rubs me the wrong way but I gotta give credit and show respect that how humble and respectful he took his loss ..kudos to him and hope he gets the belt again",
        "Well try to take the fight. That guy Alex has more body physicality than Israel and he is as good as Israel.",
        "Still the best middle weight in the world in my eyes. Great Champ, Respect!",
        "I enjoy Izzy but I have had my own ups and downs as a fan. This interview for me thrusts him into legendary status. What a man and a warrior. Izzy take some time and heal up. You will be back - this is the ebb and flow of fighting. Ariel great interview mate. First class stuff.",
        "One thing I've admired about this guy is, tired or not, he'll stay active, and always face the crowd win or loss.",
        "Saying he was fine and it was an early stoppage ",
        "I love that Izzy lost but somehow he's still the main star",
        "Crybaby Izzy making excuses to another crybaby.",
        "Humility makes you take losses alot easier.",
        "He's such a awesome dude  he will be champ again",
        "Just saying  all the  great champions has losses (except for Kahn in)it makes them stronger  to list a few Mohamed Ali, Saint Pierre, setippe  what a story line that’s developing for Izzy",
        "Awesome fighter and champion",
        "1 on 1 this guy can kick 99% people on earth ass",
        "All his excuses proves  he was never all that.",
        "I used to literally hate izzy before the fight but now I realize it was for no reason and he's a really cool guy",
        "I like Izzy...a real champion is someone who knows how to be gracious in defeat as in victory.",
        "17:26 I watched the fight again to see if what he said was true, this is what happened\n\nIzzy throws a kick which Alex checks and that made Izzy tripped over himself, after that, Alex cornered him and catch him with a jab, then 3 punches more and the ref get closer to them, after those 3 punches, Alex hits him with a left hook and an uppercut, let's say he didn't get rocked but rather just have a bad leg, after he tripped (a second time) Alex connected like 11 clean shots on the head, the last two hit him right on the top of his head because of how low he head was hanging, so the ref decides to stepped in before it got any worse.",
        "That’s a lie. He wobbled because his head was taking damage. Be a man and just tell it like it is",
        "Was rumble vaxd??? ",
        "Some of the questions/statements that come out of Ariel's mouth kills me. He just has to insinuate something that the person clearly didn't mean/ Eg Chadwick Boseman's Cancer",
        "Waste my money… a lot of money on this guy ️",
        "Words from a true champion will regane his belt  pressure off his shoulders until the next step inside the ",
        "Basically, he beat Alex well sha",
        "Izzy saying that he was injured going into the fight yet he also says that this was the best he ever felt doesn’t add up ",
        "This is what humble pie looks like",
        "He always contradicts himself, he’ll answer “yes” then “no” Or say “probably definitely” classic signs of someone who’s lying",
        "Izzy oh i drank alcohol in round one and got drunk in round 5 thats why alex won",
        "That's true sportsmanship handling his loss very well we hope he will bounce back more stronger than ever ",
        "Izzy keeps playing it off like it’s breaking news but it’s looking more and more like him and Usman losing their titles are all part of the script for the Africa event. UFC or WWE",
        "Can we just appreciate the fact that he never disappoints us with his content =O:) 8)",
        "Man got on so much make up",
        "Fan of Adesanya for sure but to be honest, it's all about his ground game. He had Pereira on the ground almost an entire round and let's face it, Pereria's ground game looked no existent. That being said, as a purple belt, he should have submitted Pereira. Didn't even look like he tried a submission. Any real black belt would have EASILY done so. After watching two submissions in a row before his fight, this was so frustrating and sad to see. His JJ coach had to have been pissed.",
        "0:00 Izzy dealing with loss very well  agreed!",
        "AND YOU ARE THE CHAMPION. A CHAMPION MUST BE DEFEATED DECISIVELY TO LOSE THE TITLE. AND YOU HAD SUCCESFULLY DEFENDED THE TITLE 5 TIMES. BAD STOPAGE!",
        "If the fight had continued, he would have gotten kneed.",
        "How Izzy deals with adversity is truly incredible.",
        "I could not watch the fight because I could not watch him lose,, I saw the fight and I was suprise how good Izzy was against that guy he was very good",
        "Just take the L",
        "Brazilian power, Naruto boy.",
        "Why wouldn't Izzy enjoy the fight?  He dominated it... up until....",
        "Izzy is obviously talented...but...people think Izzy handled this so well. It is clear to see in some of his comments that it is hard for him to accept defeat and give credit to Alex for the body work and accumulation of strikes during the fight. He is still delusional to think that he was still in the fight. That is a fact. He definitely would have come out much worse if Alex's knee connected hard w his chin if Goddard did not stop the fight. Not to mention potential ground and pound if he hit the mat. Firas Zahabi said as much in his comments. Also, if he truly acted a bit more respectful of Alex's striking skills and honestly humble in defeat like some fighters, he would probably have more genuine MMA fans who appreciate his skills. Imagine if he won in the same fashion and Alex made excuses for the loss.",
        "I'm absolutely flabbergasted that everyone in the comment section is praising izzy and saying he's taking the loss well, like bruh no tf he's not, all I've seen is him making excuses for why he lost",
        "Hella excuses tbh",
        "izzy<3 never give up youll beat alex on day....",
        "Hard to see such a good dude lose his belt. No one else in the ufc is as chill/ nice as Izzy.",
        "I thought i almost win 400 dollors by 250 dollors",
        "I think for Izzy to beat Alex, he needs to go after him. Bully the bully. Alex uses his reach well to kick legs and bodies, flattening the tires in Izzy get away car. He needs to go at him, put him away",
        "He was one more shot from getting sent to the shadow realm. He owes Goddard",
        "Izzy has handled this 100x better than I could’ve thought, maybe better than anyone coming off such a big loss. I’ve always been indifferent on Izzy, but so much respect to the man for this past week",
        "Great Champ all class",
        "24:25 jjhg",
        "This may be the most sincere post-fight interview of all time. So much respect for Izzy!",
        "Guys an absolute stud and will be champion again and he performed amazingly on the night against a huge, powerful middleweight. Also he's brilliant to listen to in interviews",
        "Never been an izzy fan but his greatness is clear for all to see.",
        "Cry more",
        "Adesanya is delusional!",
        "I've been avoiding all of these interviews since he lost because I was one of those fans who took it to heart... So here i am now, having a listen",
        "Exactly what i said, same ref handled Gastelum fight . Why rush to end a championship fight when you didn't do same to Gastelum fight the way he did to this even after all the shouting \"END THE FIGHT\" plus bleeding. I will say for a championship fight, thats stoppage was quick considering the fact that you will want a champion getting defeated the way Isreal did to Whitaker.",
        "He’s Making excuses lmao",
        "like the positive energy ..no self pity wat'so ever, way to go ",
        "lol izzy",
        "“dealing with loss well” mans is absolutely delusional on the terms of this fight he got beat and he makin excuses",
        "Because he lost. So yeh Asye is like I’ve got to watch myself. And how this happen.",
        "This is how a true champion carries themselves after a loss, Usman too!",
        "Holly really broke Ronda. She was never the same after that even in the wwe.",
        "RESPECT TO IZZY! ",
        "I was always 50/50 with Adesanya but he seems more mature and the way he took loss shows he’s a genuine dude ",
        "Well said Cham.",
        "It wasn't 2 big shots, it was 10 unanswered blows and his hands were not up defending himself like he explains",
        "Be proud...you wwon that fight until the rocks in 5th",
        "0-3\nAnd new!!! \n🇧🇷",
        "I smell ",
        "living legend",
        "Iz almost had a KO at the end of the 2nd or 3rd round, Pereira didnt have any legs and was out on his feet. He's got a good attitude and I think he will become champ again soon.",
        "I was attack for saying premature",
        "So.. in the end he won.",
        "Izzy on the rematch (watching from the outside) invest in the legs  calf kick. He was struggling.  You need to neutralize his laft hook / hands.\n\nInvest in the legs bro.",
        "How can you not love this guy, what an inspiration to people. Even when you get knocked down to hold your head up",
        "Izzy is a good fighter but he needs to fix his chin or else he's getting knocked out again in the rematch",
        "@20:43 Ariel always like to stir up misery to people. He needs to get slapped one day.",
        "@Adesanya that was a delusional interview.",
        "Izzy was out on his feet. I just watched the stoppage frame and frame and my god was he hurt. He was waving his arms all around and looking off into lala land.",
        "The ref saved your life",
        "Izzy's a class act.",
        "I like Adesanya attitude and the way he is taking this loss he has shown that he does have humility and class. Thumbs ",
        "My mans really doing a losing tour. Wtf is going on ",
        "Nobody says it but Ronda Rousey inspired a lot of fighters to face the public after a loss",
        "I love how honest he is. What a great example. Be who you are always.",
        "I will always know Izzy is a great guy. In victory and defeat.",
        "Izzy full of chit saying he knew where the punches were coming from and he was going to take Alex down while he was dazed...LOL!!   He could barley stand and Izzy clearly tired himself out trying to wrestle as well. lol",
        "Izzy is a Legend!",
        "Does anyone really believe Izzy was wobbling just because of his leg?",
        "Bottom line is 3-0 ,Sad But True Izzy number don't lie",
        "Izzy Fan here but he needs to let it go Alex might be the better man. Move on from him",
        "Gotta be real... only after this fight have I truly come to truly respect izzy and even admire. He's the same post win as he is plot loss. Anyone who hates this man is a poor part of this sport. You can't hate people you've never met who put their lives on the line to entertain us",
        "The fact things seem to be going in a direction of her being happy and doing what SHE wants to do makes me happy, I really hope she continues this route and stays in a better place mentally, physically, and emotionally, this story has just broken my damn heart and its awesome to see some light in the end of it B)",
        "Izzy got humbled tho. Let’s be honest",
        "imagine he asks.. Izzy, how much do you like the movie frozen?  XD",
        "Izzy your the man but my brother the ref did a good job",
        "Me watching the fight he didn't look relaxed",
        "Izzy WILL have that title back",
        "hahaha Israel is delusional and in denial... I dont know why they keep pumping up this hype train,, this dude did not deserve that belt.. he ran in 50% of his fights based on MMA/Combat rules this dude should have been disqualified for \"timidity\" along time ago.. but Dana White and the UFC protect their hype trains only becaus he brings fans from 2 whole continents (Africa/New Zeland) but this dude should have been disqulified for running along time ago.. MMA rule #20: Timidity is defined as any fighter who purposely avoids contact with his opponent, or runs away from the action of the fight. ",
        "Respect Izzy",
        "If it wasn’t for the ref you would’ve gotten sent to the shadow realm man , flying knee or uppercut were incoming . Would’ve been a bad look",
        "I do wanna see them run it back. But.. he should fight Whitaker before he goes back to Israel. He had his shot and lost now it’s someone else’s turn. Robert is hungry.. I wanna see that one.",
        "He said he wasn't rocked but he looked like Frankenstein with his arms straight out",
        "Nobody ever like yeah he got the better of me. No, they go to blaming it previous leg injuries that were once never mentioned. Thank God for his dance background thag came into play. Lmao didn’t help you with that left hook. Had so much faith in this man.",
        "The wolf is coming brotha..",
        "Glad to see his spirit is still there.  He’s got so much great art to show us.  Let’s go stylbender!!",
        "Izzy is a Great fighter, but he’s Greater than just being a fighter. Respect.",
        "What a classy man,mucho respect for him",
        "Guess the undertaker wasn't the undertaker!!!    Guys attitude got his butt ",
        "And when Alex loses the belt all you fairweather fans will call him an insecure fighter and talk all this crap. Smh too many fake fight fans around",
        "IZZY is such a class act. Even though he lost, he is still a champ in my eyes. He was winning too up until he final round, but it was a great performance both sides!  Get the belt back in the rematch champ!",
        "Ariel:\n“So are you okay?”\n️️",
        "AP is the biggest weight cutter in the UFC. Only way he can compete with Izzy is being much bigger. AP has a HW sized head and a LHW/HW frame. Extreme weight cutting hurts the fight game tremendously.",
        "He's delusional acting like the stoppage wasn't legit. He thinks he took just two big shots before \"bobbing and weaving\", before the ref stepped in.",
        "Dosent matter how many times Izzy will fight Alex. Alex will always know he can knock Izzy out when he needs too",
        "Is it me or does he still look scared?",
        "Larry Rife\n0 seconds ago\n“Mad respect on Israel he’s taking this loss like a champ!’",
        "Izzy is still in denial. Alex has your number. Own up to  it. Probably a premature stoppage. Goddard is known for that and every time I see him ref, I cringe.",
        "Anyone who's still wondering if Izzy could beat Alex, should watch their fight again.\n\n Truly a man of his words  ",
        "Izzy is and always will be my champ because he is pure class in victory and defeat.",
        "I love how Izzy planned a world press tour for after the fight, sure he would win, then his entire press is just about him and how he feels after losing",
        "“I was gonna take him down and beat him up again”…. Haha he saved izzy from getting a knee to the head and going to the hospital…haha and he didnt fall cause of the cadge that alex out him against….. izzy wants a rematch he has to beat khamzat winner gets alex",
        "Izzy is such a special human being he knows he lost people can still hate but you have to respect this man he’s a champion he’s strong ",
        "You learn more from your losses than your wins! He will come back smarter and stronger. Keep it going Champ! ",
        "It was definitely an early stoppage with all things considered (huge rivalry, long-reigning champ, up 3 rounds to 1 etc.), but it's not an unjustified stoppage. You can see why Goddard felt the need to stop it even if maybe he shouldn't have. Ah well",
        "The reason Adesanya is \"handling the loss well\" is because he wants the narrative to be about how he was up on the scorecards and that he'll come back and easily win a rematch, not that he lost a championship fight against a guy who's now beaten him 3 times. Adesanya is doing a press tour because he can't stand not being in control of the narrative surrounding him. Izzy is flat out insecure.",
        "More than 14 power shots from Alex.. zero defence or attack from Izzy... That was a perfect stoppage",
        "You're a gift to those around you.",
        "Doing the media rounds after a devastating loss is savage",
        "Wasn't early stoppage, ref was hearing those thudding power hits, he knew a big knee was coming next.",
        "so delusional his handlers",
        "Alex The Man",
        "Izzy: \"I've always been humble\"  lmfao ok bud ",
        "8:41 that check hook something else huh? Lol",
        "Izzy é um monstro. Não fugiu da luta contra o Alex, mesmo já tendo sido derrotado por 2 vezes anteriormente. Embora eu pense que o árbitro agiu corretamente (para evitar danos muito sérios), gostaria muito de ver a revanche.",
        "Never was a big Fan but am now… Awesome to come on and great interview. Can’t wait too see rematch.",
        "Well done Israel this will make for a very relaxed inner self well done next fight Izzy will be much more ready mentally.",
        "Love & Massive Respect Izzy for showing up straight after a loss!! Don’t peak now, lots to come! Best advice ",
        "More impressed he did this interview right after hot ones",
        "A true champion right there, he's handling the loss just like a win, a true sportsman.",
        "At no point did Izzy take the loss well  he’s making excuses, his hands were not up, he was indeed rocked, that’s not how perennial nerve injuries work it would’ve been an immediate reaction when it happened not in the 5th round, had much respect for him after the fight with how he took it but now he’s making excuses",
        "It's not \"eating him up inside\" because he has so many excuses and justifications for everything that in his mind he won.",
        "Maybe if he spent less time painting his nails, he’d still be the champ.",
        "It was 20 shots in a row.... never threw back. Wasn't defending intelligently. Had his hands down.\nMan was wobbled rocked and knocked down \nCome on",
        "Love this interview from Izzy. The man has true character. That said, it was not an early stoppage. The ending sequence took 20 seconds from the left hook that rocked him to the final strike. The ref shouted at Izzy to defend himself 10 seconds into the sequence, then Izzy stumbled and fell. Nothing after that convinced the ref Izzy could intelligently defend himself, which is the criteria for ending the fight.",
        "He has said it before, he keeps the same energy .   Belt or no belt he's champion status .I thing izzy will have more fans now because of his demeanor  , I do think the stoppage was premature .",
        "love Izzy... pure class!",
        "I think it’s a good way to deal with a loss. Straight forward, realistic and fearless. Even though I believe Izzy plays down a bit that he really got rocked. Two more low hooks or one knee and he would have been knocked out.",
        "UFC should come to South Africa, we have arenas, we have everything, we are the USA of Africa lol",
        "Let's go izzy. ️Love ya ️.  Never seen u live and probably never will. But I'm a Fan for life ️️",
        "Still a walking legend. That’s all that matters.",
        "I respect all these fighter thier Krazy"
    ],
    "comments_disabled": false
}