{"video_id": "oiKm0qo6U4E", "comments": ["0:00 Izzy dealing with loss very well \n2:46 physically how does izzy feel after the fight \n4:19 How was fight week like for Izzy \n7:11 Watching his teammates fight ", "I know it doesn't matter, but my respect for this man is beyond the sky", "He’s a great Champion! That has shined through more than ever on his first UFC loss. His grace in defeat, is the way we should all except loss. Win them like you lose them! He is definitely one of the greatest of all times! Thanks for the lesson Grand Master Israel Adesanya!", "Izzy walking to the center of the octagon to bow to his fans immediately after getting stopped again and beaten for the 3rd time by his rival gave me chills. Like your world's crumbling around you but to still have the presence of mind to stop and tell your fans that it's ok. So much respect for both men but Izzy is just different.", "As someone who went to school with Riddell and seen his come up through muay Thai, I'm very proud of him and his career. How he's held himself through the process! Such a legend in the fight game. Hope to see you regain that fire ", "It was the best stoppage Adesanya could have asked for. \nEarly enough some people will claim it was a bad stoppage and Adesanya could have continued (like Ariel himself). \nEarly enough he avoided getting knocked out and turned into a meme.", "One thing I've admired about this guy is, tired or not, he'll stay active, and always face the crowd win or loss.", "Love the energy and his response(s)! There's no denying Alex's ability to recover - such a strong and talented striker. Already looking forward to the rematch, great for the sport. ", "I love izzy so much. As a former thai boxer i can understand some of the stuff he speaks about and i dont know after such a huge loss if i would be as care free as him. Its really admirable and he inspires me to not put so much pressure on myself if something doesnt turn out the way i wanted. We all should try to be a little bit more like him in that way. Things would be a lot better for sure.", "Bro most people would be hiding from the media after a loss like that. Glad to only see more of him. I love that dude", "It was a dark day but I feel so much better after watching him talk about it. I feel like I needed to see him tell us that he’s okay and everything is alright for me to not be sad anymore. I will always root for Israel and I believe in him with all my heart. He’s so inspiring and I’m so glad I came across him in this life time", "Greatest champion I've ever seen losing a belt, and I've been watching this since it started (I was just a kid, but nonetheless seeing Royce doing his thing for the first time is unforgettable). No one has ever seen this more as a player than Izzy. Legend.", "Lots of respect for a man who can face the music immediately after a tough loss. Kept his word to Ariel, probably didn’t expect to be coming in off a loss, and Ariel would have understood if he cancelled but he is a man of his word.", "Gotta be real... only after this fight have I truly come to truly respect izzy and even admire. He's the same post win as he is plot loss. Anyone who hates this man is a poor part of this sport. You can't hate people you've never met who put their lives on the line to entertain us", "Izzy had a hell of a run!! I think its beautiful to know that you can be humbled at any moment of your career. The rematch will be a banger!!", "Shows how secure Izzy is as an individual and how his identity is not just being the champ and having a belt. Man is truly grateful.", "Just goes to show, you don't have to win a fight to inspire people, hats off to you Izzy, you're more of a champion in my eyes now than when you had the belt.", "Much respect to Adesanya. Hard to not like the guy for being himself and humble. Very well spoken too. I was sad for him in defeat, but after this interview, not only did I feel better but gained much more respect than I already had for him. He deserves the success he has earned in life and I wish him luck in his next battles.", "I gain so much respect for this man during this hole process. I wanted him to win before, and i wasn't a big fan. But now that he said that he want to fight Alex even if Alex is not the champion, that shows his heart and character, so i want him to win even more. Respect.", "Very powerful gesture by Izzy to come to the show right after a loss.", "In life you gotta take losses just to bounce back even stronger ", "I was always 50/50 with Adesanya but he seems more mature and the way he took loss shows he’s a genuine dude ", "Izzy is damn good at what he does, the way he analyse fight during the fight is amazing. Just love you man.", "Eu sou brasileiro e todo respeito pelo Nigeriano. Acredito que essa derrota fez dele maior do que as duas últimas duas vitórias. Mostrou que ele é um verdadeiro campeão das artes marciais. Ele poderia ter corrido na luta inteira. Mas ele lutou como um samurai.", "Man its a lot of fighters who never would do a press tour talking about their loss. Respect Izzy, congrats Alex.. and thank you nosie Ariel, you are great voice in mma media.", "I didn’t like Izzy when I first knew about him but since then I have grown so much respect and admiration for his character. He could be the deepest martial artist alive. The only one coming close is Khabib and that is mostly because of his background and upbringing but Izzy is an entirely self made journey.", "I appreciate Adesanya so much more through this loss than in any other time. For one, I respect him for getting in there and fighting that monster. He did not run away. And I really appreciate how gracious he is in defeat. This authentic, transparent version of Izzy is so much better than the character he portrays in the lead up to most of his fights. This to me feels like more of a true martial artist and I could totally see myself becoming a fan of his.", "A new level of respect for Izzy. No risk, no reward.", "Izzy was out on his feet. I just watched the stoppage frame and frame and my god was he hurt. He was waving his arms all around and looking off into lala land.", "Big ups to Izzy, this is why he's such a big star.\n\nDoesn't shy away and gives the fans the content they want. He's gonna make a lot more money in this game, that's for sure.", "You humble Ariel, thanks for the interview. Seeing the Champ speak & happy makes it easy to take the lost", "Izzy is such a special human being he knows he lost people can still hate but you have to respect this man he’s a champion he’s strong ", "Izzy is class personified, much respect and appreciation ", "Nothing but respect for Izzy. What a warrior", "Man this one is rough...RIP to Anthony \"Rumble\" Johnson, definitely one of the most amazing fighters in the history of MMA.", "I think we should (and im sure izzy would rather) focus more on how well he faught the rest of the fight more than the loss itself. Cuz he was showin us all kinds of new skills was veryy impressed!", "The game looks so amazing, I'm very amazed by the work they've done and as always Fusion is one of the first people to post a vid on a new game, the vid was honestly overall amazing, good job Fusion and thank you for making the vid so quickly and I know they won't see this but good job to the creators of the game", "Izzy doesn't even look like he was in a fight. Can't wait to see his rematch. Hope he comes back stronger and I know he will.", "During the press conferences and his entrance i didn't feel that \"izzy confidence\" he didnt seem himself i think maybe he was too focused but knowing he was hurt explains a lot because usually izzy can evade way better than what he was doing alex just emptied the tank a the end but i didn't really care for the stoppage i have seen much worse", "“Khamzat says a lot”  I was at MSG and rooting for POATAN but heavily cheered for Izzy, true champion and great teammate. “I am Israel A-dis-anya!” Mad respect champ", "Love this sport, love Izzy's humility in defeat, love the honesty, love Ariel's camaraderie with fighter's. Its like two great friends having a conversation, both legends ️", "Respect nothing but respect for this dude. He’s definitely one of my faves.", "Dude is an inspiration. He trips over his own foot and it cost him.", "You have been one of the worlds favorite active champions Izzy, in spectacular manner as well! #Salute  I cant wait to see what comes of your future accomplishments! Einstein once said, \"A man who makes no mistakes is a man who does nothing.\"", "Great fight, great champions, inevitable ending, respect to both fighter.", "This is how a real fighter and professional handles a loss. Part of being a champion is to eventually lose like one. Izzy is awesome.", "Izzy became my favorite fighter when Silva passed the torch to him, but man, I’m even more impressed following this loss. What a champion in life!", "The fact things seem to be going in a direction of her being happy and doing what SHE wants to do makes me happy, I really hope she continues this route and stays in a better place mentally, physically, and emotionally, this story has just broken my damn heart and its awesome to see some light in the end of it B)", "I've always liked Izzy & MVP and respected Michael for his attitude after Lima and then beating him but after hearing Izzy talk, I can now say that I respect him. I'm 100% sure that Izzy reclaims the title. He got this.  I still want to see Izzy vs MVP...  The fight of a life time...", "I always appreciated how good Izzy is, but I have never really been a fan of his. I literally started becoming a fan from this fight and now after the fight he has instantly become one of my favorites. Dude handled himself like a legend", "I'm so glad he's doing good because I'm one of his fans that took it hard. I actually shed a few tears not balling like a baby just a few tears rolled down my face. Izzy's an amazing champion. He's got nothing to be ashamed of. He was winning that fight it was in my opinion  4 to 0 in rounds. Izzy won those 4 rounds. Anybody can get caught.", "I knew he would be like this. He's the guy that won't learn from a lose because he can't expect it. When fighter's don't expect a lose most of the time that's there downfall. There's a ton of fighter's that say what he said and don't except that they actually lose and it was no one else's fault they rarely come back. They fight again samething would happen because he's beat him 3 times and he knows he can knock him out. It will happen earlier next time.", "Izzy has handled this 100x better than I could’ve thought, maybe better than anyone coming off such a big loss. I’ve always been indifferent on Izzy, but so much respect to the man for this past week", "Love the respect this man is getting after going hard suffering a loss and still showing class.", "Absolute class. Great champion and human being. Cant wait for the next rematch", "Izzy saying that he’ll enjoy watching the fight back just shows what a true fan of the sport he is - he means it. He will know the card was an excellent spectacle and he has shown grace in defeat - very respectful. True championship mentality. Respect.", "It's actually quite inspiring to see Izzy's attitude.", "Mad respect to Izzy for talking about the loss so soon after the fight. Though it clearly hurts him, he pressed through it. ", "What a classy man,mucho respect for him", "Not a big Izzy fan — but won my deep respect, praise and admiration for immediately taking the fight, doing live press after the tko, and applying a realistic and honest analysis where he shows both tremendous sportsmanship, and an opportunity for growth, development & improvement. Alex is a scary assassin.", "Never was a big Fan but am now… Awesome to come on and great interview. Can’t wait too see rematch.", "Izzy did great in the fight!  He can and WILL win the rematch!!!  \n\nSuch a genuine person...  Izzy is cool af!  Super impressed by him over and over again.  Lets go BRUV!!!  We got the next one!", "The way Izzy handled this loss....... RESPECT.\nIn this loss he gained a fan.", "Such a powerful legend for still showing up after a loss. He went on Schulz’s podcast too. Absolute legend. Powerful Izzy.", "I used to be a fan, now i am an AC. i just learnt an important thing in my life because this amazing guy. mad respect. thank you Izzy", "Ariel.. what you said about rumble was moving.. shared it with your kids.. incredible my man.. as a Dad myself that’s cool as hell to hear!!", "That’s a good, and positive man right there. Kids should strive to act like him.", "Gotta love people who are easy to stand behind like this guy. What a role model.", "The more I find out about the details of the fight from Izzy, the nerve damage, the lucidity he had before the fight got stopped, the more pissed I get, but then Izzy's attitude keeps me calm. I'm confused, but satisfied. I kinda luv this dude.", "Im brazilian, cheered for Alex, but my respect for Izzy really got a lot bigger, truly martial artist, fought an almost perfect fight... Alex is just insane.", "So much respect for Izzy. His attitude, composure, and countenance is incredible.", "What A Champion You Don't Need a Belt To Be A Champion", "Bro, this loss, made me love him even more. Such a good human.", "Never been an izzy fan but his greatness is clear for all to see.", "I just love this guy! The way he supports his team mates is just exceptional ", "One of the most dominant champs, second longest reign in the division... Izzy has nothing to be ashamed about and respect for taking this loss like a champ ", "Izzy still doing interviews after losing the fight is text book way on how to take an L. Still smiling unphased ready to rest then fight again. This man is Champ with or without a belt! I’m most def taking notes ", "Adesanya, you are my brother.  You literarily killed me. It is game/sports though. Talking about the lost, you lost that fight from your corner. Peirera won from the corner.  The coach at the last round warned him you are losing the only way out is a knockout. In all you are my brother.  God bless you bro.", "Top of The Top. Champ of Champions. Absolutely 2nd too none. The Last Stylebender,,Is The Man. The definition of a Real legend", "The fact that Izzy's foot was compromised I still think he would've lost this fight. The good thing is, because of the early stoppage, it makes it look like Izzy still has a chance to beat him and recover for a rematch. Imagine if Alex dropped him with one punch then there could be a possibility we wouldn't see a rematch at all.", "Always been a fan of Izzy, but man, the way he's handling this L (that IMO wasn't rly an L, he won 90% of the fight then got caught) has made him easily 1 of my top 3 favorite fighters. Inspiring to see someone lose on such a big stage and dust it right off like this.", "I'm amazed at the fortitude of his character. He's still himself with or without a belt.", "I’m taking it better than Izzy but like he said, it’s been helping me these last few days seeing that he’s okay. This arrest situation was harsh though.", "Izzy may have been lucid but he wasn't dodging any of those hits nor holding a guard. He was swaying his head back and forth but Alex playing ping pong. The rule is intelligent defense and Izzy was doing his best Rocky impersonation.", "What an incredible inerview. Izzy may have lost the belt but he showed he is a true champion with the way he has handled this defeat", "The rematch is going to be huge, hope he gets it done the 2nd time. Would be a great story", "Much more humble, and the fact that he explain everything thing in detail shows the change of energy from dominant to something else", "Say whatever you want about him, but he’s definitely got my respect, taking this loss as the champion he is, honestly very inspiring and definitely rooting for him in the rematch.", "A true champion right there, he's handling the loss just like a win, a true sportsman.", "You could tell all over his face, that this loss hurts real bad. I give him the credit for taking this loss with no excuses. I’ll be rooting for Izzy now he gained a fan", "Saying he was fine and it was an early stoppage ", "I like Adesanya attitude and the way he is taking this loss he has shown that he does have humility and class. Thumbs ", "The double lose affected this fight mentally/emotionally for both men but and it showed but they both handled it. He was rocked but he was still OK haters and supporters can say whatever they want but we've seen that moment many times and we've seen the fighter in danger end up winning and we've also seen them get brutally KO. In this case the ref chose to use his judgment n took the fight (it is what it is). While witching the fight I felt like izzy should have stood his ground n be a bit more aggressive. All that being said I definitely wanna see another 5 rounds.", "My respect for Israel just skyrocketed.   This is how true champion should take a loss.  He took this fight very willingly.  He could easily told Alex Pareira to go thru the ranking before he could earn the title shot, but he man up and gave his nemesis the shot anyway.  He fought well and confident.    Credits to Alex; he made the most of it.", "Classic man. I see a high potential to be a narrator in the UFC. The way he carries himself,  talks and how easy he handles the loss with such maturity. I like this guy", "Like we’ve seen in the past most fighter would have gone into hiding depressed and “go threw it” but no lt Izzy he built different much respect 🫡 ", "Still a walking legend. That’s all that matters.", "Man I felt really bad for Izzy i’m not even sure did he win every round until the last one", "Wow! Style Bender, much respect Brother. You are setting a beautiful example for men to follow with this setback. We all lose in life at times. We fall on our faces but then we get back up. We dust ourselves off and keep our eyes on the prize. We live to fight another day! Stay blessed Legend!!!", "Doing the media rounds after a devastating loss is savage"]}