{
    "video_id": "oJca6zoI50E",
    "comments": [
        "Squads is for men you boys have fun dont let the 12 yard old calling you names make you quit, mama didnt raise no quiter",
        "One thing COD has always excelled in was making fire trailers.",
        "FREE BIRDS",
        "NAH THEY USED FREE BIRD FOR THE TRAILER ",
        "Fantastic ",
        "This looks like a lot of fun I really hope it lives up to all the hype",
        "so no building collapsing? no real effects and destruction no smoke in the sky? No Road damage, realistic Explosions,  no real time light and weather…so A reamp of warzone 1 let me guess 200gb for download? aside from the game",
        "GET READY TEAM!! WE HAVE NEVER SEEN A WARZONE LIKE THIS!!",
        "Freeee Biirrrrrdddd meme. finaly in mw2",
        "Rebirth",
        "Bro hearing free bird for me makes the game 1,000,000/10, man",
        "This No is free",
        "1:15 This is the funniest thing I've ever seen",
        "Now, if Activision could only deal with the cheaters and Cronus users, that would be great!!",
        "Least we won't have to put up with \"Roze skins\" now. ",
        "Free Bird in CoD?!?!?",
        "Y’all messed up for taking rebirth and plunder off of the normal warzone what y’all should take off is warzone 2 it’s such a trash game",
        "what a time to be alive",
        "Late to the whole video game scene, especially COD as I am a veteran and war type visuals typically did not go well with my psyche. Glad to be on board though. #latetotheparty",
        "i can only think about the low quality spinning rat when i hear freebird",
        "Nice video",
        "Makes me want to learn the guitar",
        "45:56* Lets just take a minute to appreciate how much time and work she put into these videos?* It's unbelievable, and I think they deserve a lot more than that",
        "the best game on years thanks activision for the mamories ;)",
        "Best game trailer I’ve seen in a while",
        "It ain’t illegal to fight when freebird is playing",
        "This is... probably the best trailer of history for Call of Duty. For Free Bird.",
        "Please put a mode like a private match that i dont need 20 other people to play just me and my friends",
        "no y would you do this i want rebirth back ",
        "remove aim assist u SHOCKERS",
        "I hope this is gonna be like quarantine 2020 so many memories, thank you call of duty for making my child hood",
        "NO WAY HORIZONTALLY SPINNING CALL OF DUTY TRAILER???",
        "GIVE THE MAN WHO MADE THIS A RAISE",
        "The new mw2 and this is the best in 11 years so glad",
        "“There will never be a Warzone like this” yeah probably because this franchise had the best B.R. Out there but ruined it and now trying to reclaim glory copy and pasting from 3 different games. But giving us the same characters so there’s “nostalgia”",
        "Just play this garbage game. 100% step backwards.  Why change all that they did u may ask. Because they don’t care what the players of the game really think.",
        "Can’t wait - will definitely be playing all day tomorrow",
        "The only reason I'm gonna play this game is Free Bird",
        "Free Bird alone worth a thumbs up. trailer is great. hopefully the game will be too",
        "I can download just Warzone or I need the all modern warfare 2 game?",
        "Vr when",
        "Who ever made this trailer needs a raise",
        "Not gonna lie but I thought Gus was just stabbing him self",
        "10 am this morning",
        "10/10 Lads ",
        "Can well all agree as a community that we need to bring back car chases/battles cause it feels like never did it in the first place",
        "Yeah back to fortnite",
        "Can we please have VERDANSK BACK!",
        "only i can say is BEST GAMMEMEMEMEMEME EVERRRR even tho i didnt played it yet VEEEEEEERRRRRRERERRREE",
        "Muito top o WARZONE 2.0  ",
        "at least one of the top 3 game trailers i have ever seen. can't wait to see how this turns out.",
        "NYC should be separate from Upsate NY, and Upstate NY should be separated from the democratic cesspool of NYC and Albany also. The trailer was ok....",
        "The amount of over looked issues is truly dissappointing, warzone 2.0 has at least x2 more flaws than additions. Billions of dollars ain't enough huh .\n\n\n\nGame crashes every couple matches.",
        "The hype is real",
        "Then ultra and low settings somehow gives you the same fps so far\nMight be fixed in a patch soon",
        "PLS Fix Servers ..... at 10 games 7 lag servers ....",
        "Bro Call of duty has come a long way and to see these newer versions of the game to be released makes me wonder what other ideas they got.",
        "Wasn't expecting this trailer would be more like a movie trailer 10/10",
        "se vienen cositas",
        "Gta san music",
        "Best",
        "This is an amazing quality trailer. Whoever they paid for this deserves what they are getting paid. Between the music/game fx blend and visual effects as well as the transitioning- I daresay one of their best trailers ever.",
        "00:28 sweet chin music lol",
        "This is giving me 2009 to 2011 nostalgic vibes from the old cods just the way the trailer is set up. Idk it just has that wild vibe we were missing from the old cod trailers",
        "Woohoo I can't wait to spend all my money ",
        "Nice trailer",
        "I’m in love ",
        "Map look amazing! Trailer look basic",
        "One word. Chills",
        "Thanks for putting it up on steam",
        "This is the most hyped ive been for a game in a WHIL",
        "0:56 gave me CHILLS",
        "I would like that in local multiplayer it allows you to be able to customize weapons like all previous call of duty and that it has at least like 3 more maps and more game options",
        "To everyone who is reading this “Have fun, be kind and stay safe.",
        "Nothing beats the first warzone.",
        "#WZFORRUSSIA",
        "in real will extract on dmz game is crash brrr",
        "Cod is coming back!",
        "I see the f**** Indian flag.That too on the character's chest",
        "Espero demasiadas cosas de este grandioso juego..",
        "This game better be free",
        "Anyone else saw the helicopters as the spinning rat? Only the cultured will understand",
        "So far this is more fun than warzone 2019, because it doesn’t have the skill level of high comp cs:go ",
        "same ol shot different map...",
        "The music, the synchronization,  the cinematics, the gameplay. Everything about this trailer is insane",
        "This is the most over the top game trailer I’ve ever seen and I love it",
        "They ruined warzone so we would be pressured to play warzone2.0",
        "Can't keep all my comments to one. Love the high octane footage to the fast paced music! One of my favorite things to do is hop in solo and blare music while I just go HOT. Also LOVE (at least at first glance) we are actually getting a dense diverse map for battle royale not just scattered groups of buildings and the occasional town/hotspot. Plus looks like dynamic tactical drops. Can't wait",
        "Honestly could see this being a top 5 cod at this rate especially after this update",
        "Very big map",
        "Mid trailer",
        "Oh boy here come the sweats to ruin all the fun",
        "this is quite possibly one of the greatest video game trailers since the introduction of the medium. this WILL be in stories one day;  chapter two of the loooong story of the warzone. stay frosty lads & ladies 🫡",
        "love the music, love the the trailer.\nfor a long time, I never been a COD multiplayer.\nI think now is the Time.",
        "Absolutely hyped for this and Warzone mobile",
        "the coolest trailer I've ever seen and fabulous️",
        "I realy like what they did by adding the new vehicles its gonna make for some crazy clips",
        "1:28 I know we saw it for 1 second but it looks like that executions gonna send fools flying!",
        "In 3-4 years this is gonna be nostalgic",
        "Lord I can’t change",
        "Okay everyone now just free up 600+ gigabytes of space and maybe and extra 400 for the first update",
        "This has the energy of the BO1 map packs. Love it. Free Bird rocks.",
        "Waiting to stream!!!",
        "Melyik játékbol vannak a felvételek? mert amit én tegnap ezen a cimen letöltöttem az nem igy nézett ki.",
        "The best trailer in man kind I salute 🫡",
        "cant stop watching this trailer ",
        "The pawer to tsuru",
        "And then when you load into the game it’s just the same warzone mode on a diff map with diff guns. Wowie!",
        "Can't wait to try out the new engine!",
        "Hummer EV! 0:36",
        "FREEEEEE BIRRRRRD YEAH",
        "What a day to be Alive. You guy are awesome, so generous and we love you. Also the editor deserves credit. This was awesome man ",
        "Nadia shaking right now!",
        "They really put free bird on it",
        "Call of Duty players drink beer, Red Bulls, and Monsters. ",
        "I really hope this game won't go down the goofy road that the first warzone did, I want a somewhat grounded experience similar to Verdansk in 2020.",
        "Give me refund",
        "call of duty choice of songs.... a solid 10/10",
        "I wonder if this'll be optimized like mw22",
        "Whoever made this trailer needs a raise",
        "We need Zombie Royale in every weekend in a dark night map!!!",
        "Does anyone know the name of the song in background?",
        "Come on home to Battlefield guys. It's getting better. ",
        "One of the best FPS trailer ever seen!",
        "You know they got money when they play 2 minutes of Free Bird.",
        "does anyone know which setting is responsible for the fact that clothes are wet after water?",
        "Fortnite may finnaly die!",
        "Pinche tráiler más hermoso",
        "Salut, on viens de sortir une video sur notre chaine n'hésitez pas a venir",
        "Anyone else's warzone 2 locked?",
        "The vehicle experience is better on battlefield",
        "Bad game, I missed the old warzone",
        "I am not at home tomorrow i will play",
        "esta mal optimizado de verdad estta mejor warzone 1",
        "I love the music!",
        "They've embraced the chaos that makes Warzone a unique experience",
        "Looks amazing!",
        "song name?",
        "its the fact that ive been watching this guy for over half my life, this dude has given me something to look forward too ever since i was young.. thank you so much ssundee",
        "Free bird...\nHungarian flag in thumbnail...\nWHAT ELSE U NEED BUZIGYEREK?",
        "Wow, great clip and awesome choice of music - Free bird, love this fantastic song.",
        "Боби котик снова купит себе очередную яхту,кто на что учился",
        "1:04 \" horizonrally spinning rat \"",
        "Rest In Peace multiplayer you will be missed",
        "FREE BIRD YEAH",
        "When wz mobile coming out",
        "Song is freebird",
        "I just played my last game on Caldera. I felt sad a little inside of me somehow it feels like im leaving something i like for  something unexplored but surely hopefully better than warzone caldera. RIP CALDERA",
        "Can't wait for all the cheaters  it will be a time must fun!!! Anybody know how I can become a member of the white list?",
        "Drecksgame...Die audio ist zum kotzen man hört null die Schritte von den Gegner....",
        "ghost is our announcer and thats all i care about",
        "I am too excited",
        "What about the framerate for ps4? 30/ 40fps?",
        "Does anyone know the name of the music?",
        "somebody watched to many warthunder tiktoks",
        "Hold my drink meets Mic Drop.. ",
        "Your honour \n\nFree bird was playing",
        "My new favorite intro to a game",
        "FREEBIRD FR",
        "where are my wz1 operators and skins?",
        "Sold with Free bird alone",
        "the last thing Mclovin heard before being charged at: 0:49",
        "I'm just here for the city poi",
        "Lets do co-op and get a lot of points ( if you know what i mean) . GnomoMágico#4620525",
        "NO WAY!!! Free Bird is such a banger, already hyped cause of that",
        "They 100% knew what they were doing when they picked free bird for the trailer.",
        "they just had to use free bird\nheh talk out kingsmen secret service",
        "this is going to be insane",
        "Anyone else who's thinking about that rat meme?",
        "I hope call of duty stocks go down and all that cause they lost 300 bucks from me and my friends we moving to battlefield they already bought it today they just waiting on me",
        "Woooooo!!!!",
        "uhhh me when gun",
        "Is this going to be a new download or an update?",
        "I’m hyped",
        "I hope there's a rebirth pt.2",
        "FREE BIRD LETSGO",
        "I wanted this Trailer for Battlefield 2042\nThank you, it's perfect",
        "️",
        "Man I never thought I'd see Call of Duty try so hard to be Battlefield and I love it",
        "I know gameplay will never be this crazy in actual matches, but the trailer and the music synchronization with the action is 10/10 ",
        "the song choice for the trailer fits perfect, especially the guitar solo",
        "Love how they make the trailer action packed but when you actually play the game it's just kids hiding in buildings lol",
        "dmz servers r worse than mp",
        "Bro where TF is my zero dark ops",
        "Do your job right get the game fully finished before release or don't release it",
        "Apex in trouble",
        "I wish we have random hostile NPC and if they see us with guns they'll attack orelse they'll will not do anything",
        "Play free bir... oh",
        "FREEEEE BIRRRRDDD",
        "I want cod to add destruction and to make the difference between IFVs and Tanks And add attack helicopter.",
        "COD never disappoints when it comes to trailers",
        "Why u wearing a hoodie at home",
        "how many times you watched this\n\nme: yes",
        "Low key looks mid but ima still play",
        "0:58 I know they won’t, but imagine if they had these battlefield style first person executions",
        "2 more days! And we are all dropping into the warzone! Cant wait hyped! For the 16! ",
        "Best video game trailer I’ve seen",
        "The Battlefield trailer better hit HARD if this is what Cod is capable of ",
        "Please don’t add forced cross play",
        "Il est trop lourd\nCOD met la nitro sur BAttlefield a fond",
        "I can’t believe there using this song this is amazing",
        "1:02 Can’t wait until Free Bird is the choice of music for peoples recordings of glitches at launch",
        "night operations and snow elements would be nice like a night vision only game mode",
        "You have the very worst patch system available in any title that has ever been on the market, trailer team rocks though.",
        "I legit have goosebumps watching this cause you used Free Bird and it just fits so well",
        "Another cod in less than a month from the previous cod? Crazy",
        "Wow - for them to use this song brings back memories for sure .\nI was 16 years old when this song came out in 1973 .",
        "lovely can't wait!",
        "I hope there’s not a campaign because lots of people care about story then multiplayer",
        "When games that are legit the game as the first one gets over hyped like it's a Michael Bay movie  we all know it'll be campers with broken load outs and the same exact thing as the first war zone but riding on top of cars n a pinch of new moves. Totally not a waste of money on 2.0",
        "\"There's a Freebird in all of us\"",
        "This trailer is going down in history like the kickstart my heart battlefeild trailer",
        "So fitting to have free bird playing as someone shoots a turret of a car at a helicopter mid air",
        "Best part is they put freebird",
        "it's so bad, many bugs, many errors, big input lag,  FPS decreased to 2x, unavailable old maps in Warzone 1.0",
        "The trailer and the song is epic. Hype level caped at 155.",
        "How many times have you watched this \nMe: yes",
        "This warzone thing never excited me one bit... Wish they could do something new, to me, warzone just looks like a Fortnite game with different assets, its making me sick",
        "Who would actually redeploy at the same time the turret respawns",
        "It's unbelievable how many people cheat and nobody can do challenges in Multi Player. \nBann people when we Report them or nobody want to play anymore this is nasty ",
        "free bird fits this perfect",
        "looks amazing well done to the team",
        "All we wanted was realism BF! I'm happy COD is giving it to us.",
        "This is not accurate to what battle royals are. It’s dead science running for 10 minutes. Then getting shot by a pixel 5 million miles away",
        "This is the game series that made me fan of PC games.",
        "\"Remember, it's always faster to switch to Free Bird solo riff than to reload your rifle.\"\n- Captain Price",
        "Ok but can finally uninstall Warzone but keeping MW ?",
        "Hello cod I’m asking a question why is it when I boot up worzone2 and try to play it it says  inner to install multiplayer dlc",
        "Cod",
        "Valroatn better",
        "Not the biggest warzone fan, but I’ve been absolutely loving MP and I’m excited for DMZ! Definitely still going to check out warzone 2, but even if it’s not my thing like the original, I still have MP and hopefully DMZ",
        "I’m gonna need a rebirth mode asap",
        "My mind lit up when the song came on.",
        "The fact that they actually used the song free bird made this trailing a 100/10",
        "My game doesn't update.  SOS",
        "This thing was such a waste of Call of Duty potential because it eats up so much gigabytes it's literally taking away opportunities to play other games because it needs the space",
        "Call of duty can you please give me a call of duty modern warfare two",
        "The trailer is so sick I’m excited for Warzone 2.0!",
        "Campaign Mode Activated \n\nhttps://youtu.be/PWvx7udo6wo",
        "Dude why is this giving me chills!!?",
        "I’m glad they used Free Bird",
        "Is there anyone who knows the song in the trailer?",
        "Trailer: \n\nActual game: ",
        "It’s November 16 and still can’t play it!!! It’s still locked ",
        "name of music please call of duty",
        "never thought i'd hear free bird in a call of duty trailer of all things.",
        "Only thing I noticed that was different was the side arm while still holding main weapon.",
        "This feels like a family reunion ",
        "Honestly if I does big map 50v50 or more then will officially beat battlefield at there own game. It's really sad the best battlefield map was probably verdansk",
        "please change the looting and gulag system they’re both worse than warzone 1",
        "so, how many ssd's im gonna need for this again??",
        "Can't wait to be killed by captain price dressed as one punch man using a cat suppresser on his laser gun",
        "I literally saw this trailer. And it’s so chaotic that idk if I’m finna play it jitt….bro so much nukes im finna get my head thrown off as i spawn.",
        "That A-Team movie reference at the end, but instead of flying a tank, they're flying a APC ",
        "🫡",
        "REMASTER BLACK OPS 2!!!!",
        "Nothing will ever make me download a single call of duty ever again.",
        "Same old game nothing new. Should have kamikaze drone attack , Marshall art ,",
        "BRUH!!! if I can't change my button config this is a Waste!  Cause who Dh!? Jumps with the X button ️️",
        "does warzone 2 support direct storage for more fps on pc?",
        "This Trailer was a W, Warzone 2 is going to be amazing!",
        "When ?? Time",
        "Imagine wz2 was launched in play Store and it's a premium game \n(If your a apple user and don't know what is that, Premium games cost money in other to play)",
        "When free bird kicks in. CoD capturing as many memes as possible. I love it",
        "I hope Warzone 2 will create as many happy memories as Warzone 1 did when it first came out",
        "this makes me extremely happy Freebird is such a bop",
        "What a trailer....music and action keeps rising till the end",
        "i would sacrifice myself to get a match that has a playstyle exactly like this trailer",
        "Super excited for this  I just hope they get a grip on the cheaters. I'm already coming across a few in team death match",
        "Free bird alone makes me want to play this ",
        "It’s the only game that giving different mode for the FPS players",
        "We are gonna enjoy it like the first",
        "Pls ad lil baby as a bundle pls",
        "Oi WZM open beta when ?",
        "Had me the moment I heard free bird. I love Lynrd Skynrd. They have alot of songs that are awesome and just don't get enough attention in my opinion.",
        "i love the fact that they added free bird in the trailer. it just makes it better",
        "E P Y C ",
        "Please add a first person view toggle for driving",
        "Where dem tracers nephew?? Come on sister take my munny",
        "We need codwarzone mobile",
        "1:31 I really love your content bro it makes my day better",
        "And at the same place:bojler eladó.",
        "I only don't like,be couse i can't play warzone now. Why? I played last night. On my ps. Say's game start's at november 28. And i can't play anything without Caldera?.",
        "Why does this trailer goes so hard man i watched it like 10 times now",
        "Trailer looks awesome but we all know it's actually going to be everyone sitting in the corners of buildings all game",
        "What an awesome video! Love it!",
        "That one friend\n\n“ I need to try other games “",
        "I’m not playing this. They took my rebirth away. I’m done with cod.",
        "Why do I need to sit through a 2 hour update for a gamemode I'll never play?",
        "If you go in with low expectations, then you’ll enjoy it a bit more than you would’ve expecting a lot of things.",
        "Só quero ver oque vai ser desse jogo",
        "Never thought I'd watch the most cinematic COD trailer ever to freebird...",
        "This is absolutely siickkk!!",
        "Nice video ",
        "But before you play we first gonna hit you with a 45 gig update",
        "Song personally hits home after listening to it constantly in GTA:SA",
        "I think this is going to be one of the most greatest war zones that we have ever lived to see thank you so much Activision and call of duty for the wonderful Warzone 2.0",
        "Bro where's my zero dark ops",
        "So nostalgic GTA SAN Andreas",
        "Boom Headshot |:{}(",
        "Expectation:\n\n\n\nReality:",
        "Please dont leave dmz in the dust",
        "Plot Twist - Factory Reset Your Phones It's 30GB ",
        "No wonder its the best shooting game  EVER",
        "Can't wait for the 200gig update : )",
        "I dont wan warzone 2 i wan warzone 1",
        "Is it more noobs now in the new warzone 2?",
        "Bro I've seen a short version of this on YouTube with Freebirdit was comedic gold with freebird",
        "\"Never seen a warzone like this\" gives 'It's Morbing Time\" energy",
        "I really like the \"Free to...\" Sequence! I think this will be great",
        "Ive never played warzone but this trailer is really well made, makes me wanna try it",
        "This game is absolute trash right now and has so many bugs, it should still be a beta. This better be worth it.",
        "I'm glad it got free bird theme in it",
        "i was already extremely hyped, but the fact they put freebird in this made me even more hyped 10/10",
        "Ok I gotta admit. I’m excited for it",
        "Wow.. such brave soldiers putting themselves in the line of fire. I want to make it known that I have thanked each individual soldier personally for their service!",
        "Warzone 2.0 is complete trash. I’ll play when the old war zones come back.",
        "They knew exactly what they were doing with the music choice! I freaking LOVE IT!!!",
        "One of the best trailers ive ever seen for a game ",
        "Wahymen",
        "Epic. This game will make gaming history ",
        "Please bring back plunder. I had the most fun playing that mode. Thank you",
        "Banda MS, Metallica, Free Bird. You gotta admit Modern Warfare nailed the songs",
        "Looks amazing, loving the vehicles ALOT! Finally looking like a REAL Warzone  ",
        "Bro this music made me bop my head, and the trailer made me cry tears of joy.",
        "They’re doing way too much",
        "Average gta5 server",
        "This is like seeing an ad for renewing my license. Yearly, predictable, boring",
        "Did anyone else see the guy hanging from the chopper lol",
        "It's really nice to see the whole community happy and not so disappointed",
        "the freebird music just makes the trailer even better",
        "The marketing team always does an amazing job",
        "When is it going to be on the ps store in est",
        "I am happy to see warzone come to moible",
        "Trailer- 10/10\nGame- 2/10",
        "1:47 that scene ",
        "I was expecting a real warzone 2 to come out not a multiplayer on warzone map like who thought of the idea if you went to the gulag and come back then find a self revive you can't use it you just die immediately don't even get a chance to be revived  there are so many things wrong with the new warzone I really hoped this would change my mind on how badly you made the multiplayer but I guess not",
        "U guys should do android own now",
        "Awesome trailer, this looks like so much fun and Skynyrd was perfect for this!",
        "Already overpopulated with hackers and campers#rip wz2",
        "LFG!!",
        "So nice video.",
        "Bad game",
        "FREEEEEEEE BIIIIRD!",
        "Putting Free Bird in the background was a smart decision",
        "Hummer EV ",
        "Ghost perk should be in every container in war zone 2.0 update #1!",
        "Aggiornamenti così pesanti da non voler mai più acquistare un titolo simile",
        "Holy",
        "I'm so happy I'm alive",
        "Please add a map filter so I can pick what maps I want to play because the whole community is tired of the border crossing map",
        "This is the first time I got chills watching a trailer since 2020!!",
        "2:42 that was so funny",
        "muito top activison! lancem a beta do warzone mobile de uma forma absurda!",
        "Don't know what the heck is Warzone 1. But quite excited to see what Warzone 2.0 is all about. First time player to the franchise, loving it because of 3rd person moshpit game mode. Let's see.",
        "I’ll play it if Cj’s in it",
        "love all the chaos and of course Free Bird with it",
        "Same background song in gta sa radio channels ?",
        "Salve meu brother passando pra deixa aquele likezão e me escrevi no canal Tmj ",
        "How many games do I have to uninstall to play?",
        "Is this a separate game or are they gonna add 100gb to MW2",
        "Cod warzone mobile is gonna be sooo lit!",
        "They did a great job of recreating the old vibes of the first warzone trailers for like verdansk. Just pure chaos, awesome maps, and mindless fun. Nothing too serious. Super excited for this!!!",
        "Too bad I can’t play MW2 2022… I don’t have the 70$ required, even if I did I have to move and my mom won’t let me get it once I am at her house…",
        "FREEEEE BIRDDD",
        "Buena elección músical Activision",
        "Cant believe they used Free bird as the music choice... i love it",
        "Отвратительный старт уже на этапе загрузки клиента игры. Дальше будет ещё хуже.",
        "And this bird you can not change ohwoahwoahwoah",
        "Goodness, has COD changed or what?",
        "Don't forget warzone characters vanguard mw4 cold war and others",
        "No one Talking about COD MW ️",
        "2.p F.irst P.erson S.hooting War zone",
        "Pa4 md ps5 free",
        "We want Warzone 1.0 Back",
        "Worrcicc",
        "Amazing!",
        "El juego es horrible. Lento en todo sentido. Es un PUG, un fortnite. Gráficos móvil (plastico). Un fracaso, la gente está reclamando el warzone 1. Facebook Twitter está a full con los hates",
        "please do not remove old content from the game like you did with Verdansk",
        "Isso ta com uma cara de batlerfield hardline.",
        "can you preload?",
        "Ooo.ooo9",
        "this new warzone is mega!",
        "Let's hope this warzone has an ACTUAL Anti-cheat, and is better than the first one",
        "song name pls?",
        "Why did they decide to kick Ghost at 0:28 ️",
        "Do i need to have mw2 to play this or its just like warzone 1",
        "This video is amazing.know gameplay will never be this crazy in actual matches, but the trailer and the music synchronization with the action is 10/10 .Thank you for sharing this video.",
        "it’s hilarious that they used Free Bird",
        "Whats the title of the music used in this ad?",
        "Verdansk will always be in my ",
        "I want it now!!! ",
        "Can’t wait for my pc to not be able to run this",
        "Perfect timing as we literally are preparing for WW3 ",
        "Very very cool! BUT THERE BETTER BE A 3RD PERSON MODE AVAILABLE FOR ALL OF THIS!!!!!!!",
        "Warzone 2.0 got a slow gameplay and totally boring",
        "Why does it say I to but mw 2 and I downloaded worzone for free",
        "Did they just...free bird?",
        "Verdansk will never be forgotten",
        "free bird music xd",
        "getting the m13 is corny",
        "Whats with the obsession with skull masks. Overused to a cringe degree.",
        "I'm already looking for the best camping spot",
        "That ending was some nice The A-Team stuff.",
        "ESTO, ES CINE",
        "That free bird",
        "I wasn't expecting an A-Team \"shoot the tank while parachuting\" moment. A+ Trailer!",
        "This trailer is epic!  But what’s DMZ Mode?",
        "One word...Awesome 10/10",
        "Imagine loving the song so much you bust like 15 times hearing it in a trailer, can't be be",
        "This looks so dope cant wait  ",
        "Trash servers ,  hacked lobbies . Seems another cod with zero anti cheat .. but its OK we got messi lol",
        "This trailer gives me goosebumps",
        "It would be cool if there is a death animation in gulag when you lose",
        "Cringe",
        "And happy to see warzone 2.0",
        "I'm ready",
        "Tbh looks so DOPE huge W",
        "Fix the laggy servers literally unplayable, what a time to be Alive in the MODERN GAMING era. Unbelievable",
        "I’m watching a movie holy chicken",
        "If only Warzone was as crazy as the trailers.",
        "I can't wait, the multiplayer is amazing so far and the campaign could not be more better.",
        "Looks better then warzone one",
        "Poopy poo poo game",
        "Waaawooo cool",
        "Still not available and its 16th",
        "Every time I try to play warzone 2 it launches the mw2 multiplayer. L",
        "The fact they used freebird made it so much better",
        "This reminded me of old Battlefield, I miss those days. ",
        "Queremos pantalla divididaaa",
        "Wait does a selfrevive count as drugs???",
        "SUPLEX CITYYY 1:42",
        "I wish I can customize my control keypad shutout tactic selection",
        "will never understand how its fun to just sit in one spot, people make cod so boring",
        "speeding listening to free bird\n10/10",
        "I’ve never been so excited for games in my life but MW2 and Warzone 2.0/DMZ have me so beyond happy.",
        "Over the past 10 years Battlefield and CoD literally just switched positions on gameplay and graphics. It's been wild to witness. I honestly think this phenomenon should be studied.",
        "This is the most hyped I've been for a battle royale since warzone",
        "Um is this DLC or something",
        "ANY LAWS DON'T APPLY WHEN FREE BIRD IS PLAYING",
        "terminal gets hit hard in 2 hours",
        "i have been LOVING mw2 and i bet i’ll love wz2!!! looks like there will be so many new layers to the game which has me even more excited!!",
        "I can’t wait to play this tomorrow! I’m playing as soon as I get home from school",
        "Way to let the Steamers and Content creators pull your ponytails",
        "I love how the gameplay at the start was so chaotic but the music was so calm",
        "Game is terrible feels like a game we should of had 5 years ago more bugs than holiday inn",
        "Oh cool, Battlefield",
        "Easily the coolest trailer of all time",
        "as someone who played day one vanilla 2019 Warzone and left shortly after, I'm so hyped to get back into Warzone with this right here, especially since at my new job I been adding people left and right",
        "1:49 can you actually jump in a falling turret and fire it that would be cool to make cinematic montage",
        "That analogy was Matts personal story",
        "It’s so beautiful, I’ve watched it over 100 times already",
        "Call of Duty feels more like battlefield every day and I’m here for it",
        "This will one day be nostalgic",
        "the beautiful chaos with free bird brings tears to my eyes",
        "Using free bird on the trailer sure hyped me up\nWell done Activision",
        "0:55 isso que é revolução. Puta que pariu",
        "Only except you're introduced to more campers and graphics not being similar ",
        "Comentando aqui 2 dias antes do lançamento, daqui 1 ano eu volto, vamos ver como vai ser esse ano com o warzone 2.",
        "After MW2 trailer with The Smashing Pumpkins I couldn't expect more. But I was wrong. Love this game.",
        "Hype!",
        "Squad up squad up \nLesss gooooo",
        "I hope it’s not overly competitive",
        "love this Im getting an og cod trailer vibe. Keep it up!",
        "End of an era + first",
        "\"HEY IM FRIENDLY LETS MERG-\"\n\n\nTheir M4's on their hands:",
        "This is the most hyped ive been for a game in a WHIL!",
        "I hope they add resurgence I love that gamemode",
        "Add free bird as a season 1 war track it would sell",
        "When even cod is better being battlefield than battlefield itself",
        "Copy and pasted ",
        "Get the hacks out of the game there must be a way or at least disable cross hack play \n\nWon’t be playing (buying stuff in the store) \nWhen there is a wall hacking no recoil fk around every corner",
        "This is what I’m talking about! Great trailer, great song, and many memories to make. Let’s go!!!",
        "I hope it'll be a fair game and not be taken over by hackers.",
        "Masterpiece",
        "How can I get this on PlayStation",
        "part of the community needs to stop being so amazed at every single release info of this Warzone 2.0, no one has asked the question of why their skins, guns and other cosmetics from warzone 1.0 are not being transfered over to warzone 2.0, we clearly know that they can transfer all that content as majority of the content is in their servers, it takes time and money but that is clearly not a problem being that warzone alone racks up a bit more than a billion a year, they clearly have enough money to implement all the content from WZ 1.0 and even if they had to update some  skins graphics they should do it as these skins and rewards take loads of time to achieve or complete the BP. but I doubt they will do it as this community mostly just smiles and nods just because there is a new warzone that will make you spend the same amount you used to spend before and all the skins you worked for in the first Warzone or bought in the store they are gone and all that money and time you spent is too. So be careful as you hype WZ 2.0 and spend your money on skins, as there most likely will be a WZ 3.0 somewhere in the future.",
        "I love call of duty but you guys need to take warzone off of downtime and why don't I have all my purchases from the first warzone I don't like it so far I think the first worzone is better",
        "This video will be nostalgic in 10 years",
        "They should really give the people who make these trailers a raise ",
        "I can't wait for the squad to come back and we get so unbelievably angry we say heinous things no human should ever utter.",
        "Fun Fact: The music in the trailer is called Lynyrd Skynyrd - Free Bird, it is also in one of the radio stations in GTA:SA",
        "Areeee... Maaa.a.a. daaaa...... R.r..... yeh kya bawal hey ree.... ",
        "It will be an update or we will have to re-download the whole game? ",
        "Nice \"The A Team\" reference at 1:49",
        "No Vanguard laser beams? Count me in.",
        "This has to be one of the best CoD trailers I've ever seen!",
        "PLEASE FIX YOUR GAME, ITS NOT FINISHED AND WE PAID A LOT OF MONEY!!!!",
        "When can UK play it's the 16th November",
        "Bad shooter for campers.",
        "Excellent choice of music - they made it fit a theme and it's currently a meme.\nGive that person on the marketing team a raise.",
        "Bring Alex Zedra back again!!!",
        "Add options to disable all hud please",
        "Prototype 3?!",
        "In the trailer it's awesome but in my irl game blow minded",
        "I am proud of this game",
        "Chegou arrepiar aqui esse Trailer ao som de Lynyrd Skynyrd - Free Bird literamente WARZONE 2 ''Um Pásaro Livre''  Lembrou tmb aquele GTA SA ksksks'",
        "Wrd we normalized driving quads in buildings wooooooow",
        "It looks great but I can't play it, mainly trash wifi and device can't run or even download",
        "Haha freebird"
    ],
    "comments_disabled": false
}