{"video_id": "oJca6zoI50E", "comments": ["When CoD is more Battlefield than Battlefield itself. What a time to be alive", "It would be cool to see a night mode and a weather cycle in DMZ, hope they add it.", "i was already extremely hyped, but the fact they put freebird in this made me even more hyped 10/10", "Whoever directed  and put together this trailer with the music needs a commendation", "The last clip is an A-team moment", "I know gameplay will never be this crazy in actual matches, but the trailer and the music synchronization with the action is 10/10 ", "I never thought I'd see the day that Free Bird would be in the MW franchise. Absolute 10/10", "They did a great job of recreating the old vibes of the first warzone trailers for like verdansk. Just pure chaos, awesome maps, and mindless fun. Nothing too serious. Super excited for this!!", "This is what I’m talking about! Great trailer, great song, and many memories to make. Let’s go!!!", "When CoD is more like Battlefield than Battlefield. What a time to be alive\n\nThis brings a sense of nostalgia to that music, like Warzone after all these years has finally grown to be better and I couldn't be happier. Congratulations CoD", "These cod trailers are always so action jammed and hyped! Love it.", "This was actually really well done. I got goosebumps at the end when he started firing on the helis. Excited!", "I can't wait to have fun in DMZ and Warzone 2.0. I remember when Warzone first came out and nobody was sweaty, toxic. Everyone just had fun", "Wasn't expecting this trailer would be more like a movie trailer 10/10", "Love the videos! You put so much time and work into them and they make my day better", "It's really nice to see the whole community happy and not so disappointed", "What a day to be Alive. You guy are awesome, so generous and we love you. Also the editor deserves credit. This was awesome man ", "I’m not even a warzone fan, but this trailer is absolutely insane!", "Trailer sempre vai ser mil maravilhas", "i really hope they keep going in this direction with the trailers, this is great", "The music, the synchronization,  the cinematics, the gameplay. Everything about this trailer is insane", "This is going to be absolutely amazing and out of this world. I am super hyped and cant wait to drop into #Warzone2!", "I absolutely love free bird in fact it’s one of my favorite songs and I will always love COD and Warzone but this trailer has hyped up my love for the two even more and all I have to say is thanks call of duty and that you ROCK", "Bringing back the same energy as Verdansk had, the community is proud. Well done.", "Congrats on a great game, I'm loving every minute of it!", "Love you Jev, grew up watching you and its crazy how far youve come. Humble man, much love", "I had this song stuck in my head all through work today, and now I have been blessed with this trailer. ", "This is one of the best Call Of Duty games I have experienced in a long time, SO FUN!!!", "I hope this is gonna be like quarantine 2020 so many memories, thank you call of duty for making my child hood", "I’ve never been so excited for games in my life but MW2 and Warzone 2.0/DMZ have me so beyond happy.", "Pure insanity \n\nThat’s why I loved this trailer.", "This is the best trailer for a game I’ve ever seen. So hyped!", "as someone who played day one vanilla 2019 Warzone and left shortly after, I'm so hyped to get back into Warzone with this right here, especially since at my new job I been adding people left and right", "This is the most over the top game trailer I’ve ever seen and I love it", "I love how the gameplay at the start was so chaotic but the music was so calm", "I never expected such a crazy song choice in their trailer! That was sick", "Gracias activision \nPor darnos un battle royale que tuve en mi manos vamos adelante y solo lo queda difruta el nuevo warzone 2.0 muchas gracias warzone", "This feels nostalgic with that music, is like Warzone after all this years has finally evolve to the better and I couldn’t be happier. Cheers CoD", "Looks promising.  I was hoping the water combat would be more prevalent in multiplayer, but it looks like it will be much more viable in Warzone.", "They honestly made a big improvement from the first game I like how u can now swim underwater and shoot up helicopters from the sky’s 10/10", "Excellent choice of music - they made it fit a theme and it's currently a meme.\nGive that person on the marketing team a raise.", "simplismente vai ser o melhor jogo ", "As a halo fan who also loved MW2, this trailer is freaking sick and I'm going to buy the game!", "Espero demasiadas cosas de este grandioso juego..", "Who ever orchestrated this trailer needs a raise", "They may not know how to make a finished game but they sure do know how to make a trailer", "What a trailer....music and action keeps rising till the end", "This feels like a family reunion ", "This looks epic! Can’t wait to play!", "I can't wait for the squad to come back and we get so unbelievably angry we say heinous things no human should ever utter.", "This got to be one of the best trailers ive ever watched for a game", "They knew exactly what they were doing with the music choice! I freaking LOVE IT!!!", "Super excited for this  I just hope they get a grip on the cheaters. I'm already coming across a few in team death match", "Can we take a moment to appreciate how much work he puts into these videos for us", "Dude the quality level of this trailer is insane.  definitely going to give warzone 2.0 a try", "El comienzo de una nueva era ", "This looks cool I can’t wait to play it ", "This is an amazing quality trailer. Whoever they paid for this deserves what they are getting paid. Between the music/game fx blend and visual effects as well as the transitioning- I daresay one of their best trailers ever.", "This is... probably the best trailer of history for Call of Duty. For Free Bird.", "This is the most hype inducing game trailer I think I’ve ever seen", "Can’t wait - will definitely be playing all day tomorrow", "The fact it was on the radio in the truck makes me think songs like free bird will be in. Also the fact they have the electric hummer In this is crazy", "The last clip is an A-team moment. Can’t get more badass than that.", "The perfect song for one of the best games to come out other than mw2019", "You guys did a really well job this year", "This is so beautiful i love this trailer", "This trailer gave me heat palpitations ", "\" We have never seen a warzone like this \"\nSheesh it gave me goosebumps ", "Bro Call of duty has come a long way and to see these newer versions of the game to be released makes me wonder what other ideas they got.", "1:38 This is why you're my favorite youtuber you make amazing content for us every day", "Honestly could see this being a top 5 cod at this rate especially after this update", "Can't keep all my comments to one. Love the high octane footage to the fast paced music! One of my favorite things to do is hop in solo and blare music while I just go HOT. Also LOVE (at least at first glance) we are actually getting a dense diverse map for battle royale not just scattered groups of buildings and the occasional town/hotspot. Plus looks like dynamic tactical drops. Can't wait", "I hope Warzone 2 will create as many happy memories as Warzone 1 did when it first came out", "That's it. I'm buying MW2, even if my PC can't run it. This is the best Battlefield release this year, and it comes with a new CoD game as a bonus! Also, Free Bird was the perfect song for this..", "The quick transitions at 0:56 to 1:00 gave me straight chills. Top tier trailer 10/10", "I love how the song (Free Bird) sync so well with the trailer", "Had to watch this more than once because of the hype this trailer gave me! ", "45:56* Lets just take a minute to appreciate how much time and work she put into these videos?* It's unbelievable, and I think they deserve a lot more than that", "This is the most hyped I've been for a battle royale since warzone", "Feels like warzone 1 all over again. And I'm hyped ", "Why does this trailer goes so hard man i watched it like 10 times now", "Still remember on 2020 Warzone 1.0  we played Quarantine time. Now 2022 Warzone 2.0 after quarantine, we hope this will be better than quarantine time! Lets drop in on this 16 November! ", "the fact that this is free to play is insane, just 5-6 years ago you would of never believed a free to play game would look like this", "Got WZ1 vibes from this.  For someone who hasn’t played consistently in a year, can’t wait to get back into it.", "Só quero ver oque vai ser desse jogo", "One of the BEST Trailers I have ever seen  Spot on, Keep it up Call of Duty", "My favourite part is when he said \"We have never seen a Call of Duty Warzone 2.0 like this!\", I cried my eyes out in the theatre and clapped until my hands bled dry after that one", "Are there gonna be emblems we can unlock through challenges? I think that’s all you guys need left in this game & maybe reticle color change & it’s solid", "Great trailer... I expect a lot from WZ 2.0", "This is so well synchronized with free bird! I love this trailer and I'm hyped for the release", "One of the best trailers ive ever seen for a game ", "Great job did not expect it to be this dope", "I hope it'll be a fair game and not be taken over by hackers.", "I feel the old-school Verdansk vibes coming back, it really was about the developers all along", "That tank twist was awesome  came to know about this 16 Nov. Dead excited ", "Whoever made that trailer needs a promotion. Couldn't have used a better song that was badass.", "call or duty never fails to make badass trailers", "Jev is the teammate you yell at that has 0 seconds on obj. Love you Jev, be you forever", "cant stop watching this trailer ", "Man I never thought I'd see Call of Duty try so hard to be Battlefield and I love it"]}