{"video_id": "oL0umpPPe-8", "comments": ["Bribing the president to pardon him for the bribing charges is definitively a master move", "As a Korean, buying Korean domestic products is not just because of the brand royalty. A/S is very fast. Because their market domination is large and there are so many branches, so when my  LG laptop, Samsung phone, or Hyundai car has a problem, I can fix it on the same day by visiting the brand shops at very low cost. I also used an HP laptop, and it took one month to repair. Apple is one of the few exceptions because many people use them to get the AS fast. and people like to buy foreign luxury bags because those things do not have repairing problems, usually. In conclusion, when people consider their budget, quality and A/S period, they usually conclude to buy the Korean product, even though foreign products seems to be better", "\"Corporations can't run countries.\"\n\nSam is gonna freak out when he finds out about United Fruit Company", "I am Korean and I am very amazed by how accurate this convoluted riddle was explained. Although I would say, it is bit exaggerated about all Korean people want to get into Samsung. It is a stable job with a good pay but that doesn’t mean it is the best.", "In some ways, getting employed by Samsung or any family-run multinational companies in South Korea is almost like becoming a worker of a stable public service job in some countries: job security and pensions are guaranteed as well parents will be gleefully happy & grateful knowing that their grown-up children are working in one of the chaebol companies that promises lofty benefits.", "This video is incredible. I actually was there in Korea as a teacher when much of this went down, but as a foreigner who only spoke limited Korean, I certainly didn't get the whole story. But what I did get was a lot of interesting \"trickle-down\" information from strange sources...", "This was one of the most interesting and gripping episodes you've ever made. The logistics of corruption tempered by pragmatism. I was glued to the screen. <3", "Chaebol is the romanization of 재벌 which means \"wealth clan\". This word can be written in the same characters as the Japanese zaibatsu (meaning financial clique), as both these words have Chinese roots. The Japanese zaibatsu (or keiretsu nowadays) were powerful monopolistic conglomerates of pre-war Japan, with four big ones. Sumitomo, Mitsui, Yasuda, and the most famous being Mitsubishi. They were broken up by the GHQ (General Headquarters; another name for the Supreme Commander for the Allied Powers during the American occupation) but later on loosely reconstituted.", "It really is a brutal moment when you realize that you have to keep something/someone even if they're bad or problematic because you need them.", "Actually, Korean National Pension Service is the largest shareholder in most of popular Korean companies, just as Samsung group subsidiaries. Like Samsung,  LG, Hyundai, and SK are facing same situations against Korean government. That's why Korean government has quite a lot of power to shake over 'chaebol' groups.", "I'm an American currently living in South Korea. It is insane how much brand loyalty there is here. Literally every phone in the country is a Samsung (I've never seen so many foldables in my life). Every single car on the road is a Kia or Hyundai. Every appliance is an LG or Daewoo. And Lotte and Kakao are everywhere too. I've lived all over the world and never seen a country so loyal to its own brands. It's actually kind of admirable.", "Samsung isn't just an electronics giant as many outside of South Korea view it.\nIt's in insurance, heavy engineering, real estate, banking and finance, recreation, healthcare, precision equipment, military technology, and so much more.", "Interesting topic. Not long ago I visited South Korea and I couldn’t help to notice how fast things are being built and how modern the country is. When I did a little research I was stunned when I found out how much Samsung has invested in the country.", "\"Corporations can't run Countries\" to which the Dutch East-India Company says: \"Hold my spice\"  \nHanwha is the new kid on the block. They're pretty old but recently have made huge gains in the market and closed in on the likes of LG and Samsung. They're not as close as Samsung's sister companies but their weapons production group dominates the market. They've also purchased Samsung's weapons and systems arm in the early 2010s. I think we'll see many scandals or controversies surrounding their operations for years to come. They basically have a chokehold on the south Korean arms market and even surpasses the revenue of Raytheon and Lockheed Martin etc. in some markets.", "What I felt while living in Korea\nTo the Korean people, Samsung has a strong image as a national team that represents Korea and earns foreign currency in the world market rather than dominating Korea.", "South Korea is an example of State Capitalism, when a corporation is too big that you can no longer distinguish it from the state it's depending on.", "Geographically speaking, all four \"East Asian Tiger\" economies should be poor. Yet Hong Kong, South Korea, Singapore, and Taiwan are considered \"miracle economies.\"", "South Korea's government directed industries are a pretty interesting case study. I was very impressed by their planned initiatives to evolve into a media powerhouse. SK is sort of a capitalist oligarchy with central planning and an insane focus on education.", "I recently watched the Vice documentary about the cancer victims at the Samsung Electronic factory and how Samsung, the government, the Ministry of Labour and the police all worked together for 11 years to take the victims to court and try deny what they did. Of course there was very little payment compared to hospital costs, court costs and labour fees paid (11m split to dozens of families) with no one sepping down or any change being made to stop corruption like that happening again.", "You realize how influential the Chaebols are when you look into just how much control they have of their respective industries in ROK. Sure we no longer have a better performing economy than the ROK, but we're still proud of what we have (like mineral wealth). Because we remind ourselves that we are simply protecting ourselves with our program, while others don't bat an eye when a corporation straight up controls a country. ", "Corporations this large make it easy to imagine what it was like to live in feudal times.", "I loved this video!  Living in Korea had such a deep impact on me and it was such a fascinating and frustrating experience. This video really explains so much about it's culture  - obviously not everything but so many key things. One of the things that struck me was the connection of NPS and the President to Samsung was so indicative to how the culture communicates. When I was a teacher, I NEVER heard any feedback directly from my boss or even colleagues that sat next to me. Everything was indirectly communicated to me through 2-3 people.", "The whole thing is predicated on their ability to predict their own deaths. They'll always be one heart attack/plane crash/stepped on a lego at 3am/rock in their shoe/wet sock/OD away from dissolution.", "one of the best things about dude is that he never takes credit for himself when he achieves something . he always respect us, the audience, and his team, and he is always polite in all of his video. we congratulate ourselves on this achievement more to come and everything to come\"\" Let's we all just appreciate the content this man and his crew makes it's just a masterpiece imagine what's he's gonna doing the future I hope this channel never ends and keeps spreading happiness.", "Samsung is legit too big to fail, not \"the country would be in deep recession if it fail\" more like \"the country as we know it WILL collapse without it\"", "As an expat, thank you very much for discussing my motherland's issues in this medium. You got to the real issue and told the story as it is which can be impossible when you are living in the situation.", "As an Indiana native, I appreciate this is the most famous our state will become for the next decade. Thank you", "Makes me curious what it would look like if Toyota and Walmart’s revenues for the gdp calculations were laid on top of South Korea’s gdp (raw numbers, no scaling)", "When doing the total for America, maybe include businesses like Amazon, Google and Apple. I'd prefer a total showing the top ten American companies personally. I think seeing that might put it more into perspective. Maybe I'm wrong but diversification is a hallmark of the American industry. So joining the group together would make more sense.", "Real Life Lore, Polymatter and Wendover Productions have a >20% influence on the gross domestic production of YouTube's world politics explanation videos, and their coalition should really be kept in check to prevent excessive dependence /s", "Chaebol influence in South Korea really does run deep, especially in the economic and political aspects. From what I have researched, 50% of South Korean Gross Domestic Product (GDP) consisted of the country's Top 5 largest chaebol conglomerates (Samsung, LG, Hyundai, SK Group, and Lotte). ", "Way better explained than any major news outlet. Props ", "Let's take a moment to appreciate how much time and effort he puts into his content for us. Love the videos! :*", "thank you for breaking it down!!With everything going on right now, the best decision to be on any creative man's heart is having a profitable investment strategy.", "Renewed my subscription to Nebula for a second year, this year.\nYour documentary Extremities has been a joy to watch. Reminds me of the Discovery I grew up with. Great job!", "Awesome presentation of the topic, clear logic and explanations. Thank you lots!", "As a South Korean:\n#1 very timely video. Tomorrow (Nov 17th) is college entrance exam day, which many will move on to prepare for the Samsung test mentioned. (GSAT) Samsung also has programs that recruits bright students from various universities.", "Wendover is one of the few youtubers that pulls me back to the platform, instead of rotting in Netflix purgatory.", "Samsung's contribution to South Korean GDP is mind blowing", "I'm currently living in South Korea, Samsung and LG make almost everything here. not just tech stuff, they make regular doorlocks, dustbins, plumbing fittings, you name it they probably make it.", "Really great explanation, I do find odd how monopolies are somehow seen as good things in asian dramas, might just be gaslighting the whole populace", "They're currently 4.5 hours into the stream and have reached 88% of the goal amount.  Good on Charlie for caring and doing this for Lance and his family.  Looks like they'll make the goal easily. :-O", "Its interesting how they hold so much power over politics in South Korea and yet they haven’t lobbied to have the inheritance tax removed or significantly decreased. I doubt most South Koreans would object.", "This was a great one man. Incredible how the \"SAT\" in South Korea is literally a corporate test. Says a lot about their grip on the country.", "Big ups to you guys at wendover once again. Such an interesting story I had no idea about prior to seeing this video. Thank you for the content!", "Hi, American living in Seoul here! I've been interested in this topic over the last year, since moving to Korea. Over here, it seems that this information is common knowledge to some, while others deny Samsung's connection with the government. We've heard \"it's anti-Korea propaganda\", \"Samsung decides who stays in office\", and anything in between.", "As a Korean, I can definitely say living and working for chaebol is much better than living under extreme poverty.", "Thank you this is another top quality wendover info dump and its much appreciated.  Now you should go teach Johnny Harris how to make a genuinely informative, factual and useful video about South Korea.", "Today's fact: The University of Minnesota is older than Minnesota the state itself.", "I was stationed in South Korea for 1.5 years. Wish I had gone there as a civilian to enjoy much more of the country. It took a little bit getting used to the population density but that was my only issue if you can call it one. While I enjoyed being able to get a haircut at 9pm I did feel for the people who work so many hours. Tough,polite, and efficient would be the best I can describe the people I met day to a day.", "There’s entire villages built by LG. Every window, toilet, screen door, concrete, elevator, and more … built by LG. Imagine living in a village where every stick, window, pavement was built by one company.", "I do love Samsung, reasonably priced with very high quality. I always try to buy Samsung.", "When you have a company that makes chips and tanks it'll be hard to break up.", "It would be fun to explore the similar Zaibatsu system in Japan along with the similar cross-holding structures between companies like Mitsui, Sumimoto, etc.", "“Corporations can’t run countries.”\n\nSamsung: Continues to run country.", "The quality of this content is too damn high! Love the work Wendover!", "I just love the bravado it takes to try to get out of bribery charges by bribing people", "It's crazy how Korea grew so much with nothing after wars and invasions. Respect!", "Amazing what being globally connected can do for a nation...", "As I watched tones of travel videos to Korea, especialy to Seul, I've realised that there is a huge disproportion between the quality of life of different people. The rapidly growing tech-country just can't change everything to higher level at the same time, and often enough you can see old almost abandoned house in 1 km from tall modern skyscrapers. Thank you for content!", "Actually, Lee Kun-Hee's son made 'a mistake' in one of speeches, calling his father 'my late father'. It was several years before Lee Kun-Hee's actual official funeral. Yes, Samsung requires necromancy to keep its house of cards.", "I think we can all agree this guy never disappoints us with his content :-o", "What I found is Samsung basically controls South Korea, starting from who becomes the government to how everything unfolds in the country. Its really powerful and diversified.", "the fact that you summarized the Korean War and it's aftermath without mentioning American intervention and investment following the war is crazy tbh", "That Samsung web is so confusing. You did great trying to break it down", "This video is very interesting and useful for understanding the idea of corporate rule that has deeply influenced cyberpunk and other near future dystopian settings in literature, film, and television. Great video.", "This chaotic stream was absolutely legendary. Magni was unstopable, relenthless, everyone got MAGGED, \"reformed\" Altare did clip worthy ACE plays, the toxicity and everyone was so freaking fun! TYSM for killing my sides guys. I could watch them play all day and i all for more collabs. GG", "This is fascinating. Excellent video and very informative. Easily my favorite so far.", "Really nice choice of topic and great, logical explanations here Wendover team!", "That \"I'm free\" quote at the end really hits different after his passing. Rest in peace, Techno. You will be missed dearly.", "Hey, this is the rare kind of Wendover video that is probably going to send me down a research rabbit hole as I absolutely need to know more :D", "South Korean mobile phones simply are what German manufactured cars are to the world: Most of them just work, and they do so exceptionally well at a high level.", "Interesting episode. \nSuggestion... would your channel do a cover on Twitter and the current fiasco within it?", "1. 1:13 from noddles to real life Arasaka... what a trip\n\n2. 11:42 I love how we are glossing over the fact they got their own hospital because at this point... is not surprising(?", "Not really important in the scheme of things, but it’s interesting to see how these Chaebol’s have impacted the entire architectural feel of a country. They build everything. From Gangnam in Seoul to Haeundae in Busan sometimes you feel as if you’re in a giant bank in terms of architecture. To me it’s great how convenient and modern everything is, but I’ve heard critics argue it’s making SK lose its heritage and charm. I was only living there for a year so I can’t make an informed comment on it, this is just stuff I’ve heard from friends and others.", "I sometimes half-jokingly refer to South Korea as \"Republic of Samsung Korea\"; likewise I sometimes half-jokingly refer to their presidential position as \"the President and CEO of Samsung Korea\".", "Those crates of microphones/transmitters for interviews are pretty neat.", "This reminds me alot of the effect or control that Arasaka has in Cyberpunk 2077. Or other corporations controlling fictional cities.", "Fascinating ! I liked it. Very informative. Well narrated. High quality !!! Thanks Wendover for the quality of this documentary.", "<3 takeaways from the video.>\n\n1. samsung and any other conglomerates are not the final destination for korean anymore. it's true they had been considered best place to work around 1990-2010, yet job seekers no longer look for jobs for priority there. since 2010, college graduates turn their first interests to IT tech and game companies like kakao, naver and ncsoft(similar to meta, twitter, blizzard and google etc.) which are paying the highest in labor mkt, not to mention another highest paying banking sectors for those with the best gpa.   ", "when being an employee is deemed the greatest success while starting your own business is deemed a failure... damn", "Kinda reminds me of cyberpunk, having a corporation have the power to essentially influence or even be a entire nation with the heads having this whacky control scheme over the entire thing.", "i REALLY love the \"if you enjoyed this, check out ____\" segment at the end! great video as usual, i had no idea samsung had such an aggressive hold on sk culture but it's terrifying. of course younger generations hate it. those who speak english might pick up our \"fkn tired of corporations being in bed with the government\" energy over here and add fuel. i hope they can untangle somehow without serious harm to the country, but it will inevitably happen sooner or later.", "I like those makeshift baskets of what appear to be wireless lavalier mics at around 11:20. For all of Samsung’s greatness, when you need to get someone on tape, it still comes down to journalists fashioning makeshift baskets for their mics.", "I cancelled my HBO and Hulu to get curiosity.. absolutely one of the best decisions ever.. thank you for creating amazing content", "The one thing and the most important thing you forgot (and a lot of the individuals who are commenting here about Korea's economy) was the amount of children that were exported through the industrial adoption complex in the late 70s to the mid 80s; which was also one of the top reasons the economy in South Korea thrived.", "South Korea is the perfect exemple that investing into education of the people is the most important thing for a State.", "Wow over 1.2 million views in just 4 days. Shows how much of great work u are doing in making this video.", "I recently played a Victoria 3 game of Japan and built my economy significantly by clothes exportation to France, it worked really well for a while and I got to build some really big clothes factories. At some point I tried canceling just this one export and my economy got hurt a lot because the sudden overproduction damaged the bloated supply chain beyond belief. ", "Since this was a Wendover Productions video I was surprised that there was no mention of the fact that the Samsung group also makes planes (Samsung Aerospace), and build airports (Samsung C & T Corp.) ", "Very good, informative and well-informed video on oligarchy!", "super interesting. the debate of whether chaebols are good or bad for the country rages on. subscribed ", "I'm surprised Daewoo wasn't mentioned. They aspired to be like Samsung but overstepped their bounds.", "I have tried to learn about this before, but it was too complicated to wade through.  I want to acknowledge that you made some judgement calls here, but only in the context of judiciously ignoring what is basically propaganda.  I never made a coherent understanding for myself, and I grateful that you made it for me.  Definitely a re-watch for me.", "Scary how they can just control the entire country and even have people believe that their dream is to work for them! Sadly many Koreans dont seem to have a dream to start their own companies etc", "THIS WAS HELLA ENTERTAINING appreciate the hard work", "I'd love to see a video like this but with other tech companies and conglomerates in general, I'm new here and this video led me to sub, amazingly gripping video!", "I love Samsung! They made my phone, fridge, washer/dryer, and the storage for my PC. South Korea could take over the world, and I'd be ok with that.", "As someone who only knew the gist of all of this... thank you. My Korean friends, girlfriend or her family wouldn't have been able to explain this nearly as well, and I've always been curious about this. Thank you. This was extremely interesting.", "Incredible job on this one. Loved the video man keep it up, you're a gem"]}