{
    "video_id": "oL0umpPPe-8",
    "comments": [
        "Dutch East Indies type beat",
        "I am watching this on my Samsung a32 wtf ",
        "So, when someone puts in your head he thought and that tought comes back, consider this story.\n\"Why bad things happen to good people\"....because they aren't.",
        "That samsung trend is quite old. I don't think gen Z would even remember. It's now 네카라쿠배 or something along those lines? I feel like I'm missing some companies. But it is basically Korea's FAANG is more popular with graduates finding a job these days",
        "It's a credit to Park Chung Hee not Samsung.",
        "The timeline at  5:40 repeats itself. Goes from 1995 to 2000 to 1995 to 2000 again",
        "Every corporate giant is a danger to us all.",
        "삼숭 Is Real ",
        "A lot of truth, but a lot of bullshit as well",
        "Atlas corporation but its real life, and in asia.",
        "Nothing like a daily dose of hypercapitalism, good god Samsung is quite the lion",
        "I won't even buy Samsung products. Everything but their phones are straight trash... Every Samsung appliance I have owned before has broke and had issues.",
        "This is the American equivalent of working for the govt or going into the military.",
        "Korea is a unique case of this level of economic success without utilizing the profits stockpiled from colonial conquest of other countries, how can you expect it to follow and use the strategies that are only viable to those colonial empires? There's a reason most of the world, colonies freed from empires weakening in WW2, are still poor. Wendover makes comparisons to US and Japan (a country with a 30 year recession + highest GDP to debt ratio after Venezuela) that are irrelevant.",
        "I always joke that Samsung is the fourth branch of government in Korea",
        "i felt weird that SK is considered a small country.... 50 million people is among the larger countries",
        "I pledge allegiance to the Sam of the United Sung",
        "Indiana was just chilling.",
        "I appreciate you for not describing Korea as a country where everything is just a reference of Squid Game, BTS, and Gangnam-style.",
        "What is the type of legal structures are these entities that hold the various businesses? C Corporations? Most western nations would consider them one entity for tax and legal purposes because they meet the definition of a \"control group\".",
        "my manz used bribery to get out of bribery charges lmao",
        "what is the song used at around 9:40?",
        "so i believe the \"samsung position\" in korea is like the \"government worker\" in my country, a stable job unanimously coveted by the previous generation, but is falling out of favor with the youths",
        "Learned the hard way that Samsung doesn't honor their products warranty unless it's assembled in the US. 65\" 4k and S8 tablet. Junk",
        "South Korea is rich because the Americans want it to be rich. South Korea is very close to China, and therefore a great military base location. That means strong military industrial complex is key. And a strong SK economy was key to prevent Communist revolution occuring during the cold War. Now its important to reduce Chinese influence.",
        "Korean company owners are like Korean politicians: \n\n\nTalking about the whole fake going to jail then being apologised by the president... Ridiculous.",
        "You present this as very dystopian but I've come to find out that most Koreans are actually glad to have the chaebol system and thank it for their nation's growth and success. I think that's a key difference between the East and West.",
        "how the tables have tabled... is this the gratitude for SK supporting US :D",
        "\"hide from exterded family cus they r failure\" nah not just Korean prolly most asian ",
        "I guess it`s the demand that is doing it. They can go work for Hyundai for example. Dao says use the path of least resistance rather then trying to row upstream.",
        "This is literally Arasaka from Cyberpunk... terrifying.",
        "Literally Arasaka but Korean",
        "A Game of Stocks\nA Clash of Invests\nA Storm of Coins\nA Bribe for Crows",
        "국가안보에 첨단 기술이 얼마나 중요하고 그 첨단사업에 빠질 수 없는게 반도체인데 그 반도체 회사가 더 발전하고 더 커지지 못할 망정 위험하다 어쩐다하는게 말인가? 당장 미국도 대만tsmc반도체 공장 공급 수요 못 맞추니까 미국공장 짓고 삼성도 이제 미국공장 짓고 있는데.. 우리나라는 천연자원도 없고 인구도 부족하고 기술 키우는게 제일임 그 기술 중에 반도체가 제일 강하고 반도체 없이 돌아가는 첨단 산업 거의 없지 정부가 더 지원해줘도 모자랄 판임",
        "this was a very good video!",
        "1:05 go Astros!",
        "I loved how well researched this was.I have been interested in South Korea for years now and its true that its impressive how thye managed success and overcome poverty but there is also a shady side unfortunately to this success.",
        "Can you also analyze Tesla, Microsoft, Apple, etc? I'm curious if there's also  symbiotic relationship  between US big companies and the US government....as in Samsung case.",
        "What about Nokia at its peak in Finland?",
        "You deserve 10x for subs",
        "Imagine if he knew about global pharmacy conglomerates",
        "Let’s go, somebody’s talking about Indiana!!!!!!!!",
        "Real life Arasaka corporation",
        "Instead of punishing industrialists the President guy tasked them with tougher jobs, that ultimately led to the growth of the country.",
        "US has pretty much same eco system with American brands literally dominating every sector.",
        "Apple es the king in USA so is the same like Korea",
        "Why do they keep the 50% inheritance Tax law? With this you are effectively breaking up every Enterprise after one Generation and allow foreign Investors a a much more advantagious Position than domestic ones",
        "Small and lesser? LG & Hyundai?!  I think that's a poor choice of words.  I am a Samsung fan, but I know they are not  the only popular company there.  Hell I even saw the old Daewoo logo in the background.  I know people here in America who believe Kia is Japanese.",
        "Real-life cyberpunk corpo-state, where fiction imagined that it'd come from Japan, it actually came from S. Korea.",
        "It is legitimately crazy how both Korean \"leaders\" (the Kim family and Lee family) have such similar roots. And the stranglehold both families have on their parts of the peninsula. Just realized it now",
        "Thanks for making this video. It's a well-known fact amongst Koreans that major corporations control a lot of the politics, but it's never talked about enough internationally. I know that Samsung is one of the major contributors of GDP in Korea, but I've never purchased a Samsung product knowing the kind of harm they bring to the country. It's a complicated situation where the thing that's keeping the country afloat is also the very thing that's slowly poisoning it from the inside",
        "Sounds like a bigger version of Arasaka's hold on Night City in Cyberpunk 2077",
        "So Samsung is basically BnL from Walle",
        "This reminds me of the movies/series about companies acting like literal countries, where all the citizens are employed by said company/country.",
        "Your logo is too simple and non-offical looking to be in my subscription list. Please make a new & better logo for your truly fantastic channel.",
        "Samsung makes pretty good products ️",
        "3:52 \"The military overthrew Rhee's government\" Rhee wasn't overthrown by the military, he was forced to resign and flee to Hawaii after protests broke out as a result of rigged elections. The one who was overthrown was Rhee's successor Yun Posun",
        "the ridiculous sounds... lol, GDP is not the same with revenue. In economics, revenue is total sales but GDP is a value added. so to compared with GDP,  a EBIT or net profit of corporate should be compared.  not a revenue.",
        "Is Samsung a venerable institution though?",
        "This is a great video! Can anyone recommend me some  other YT channels with similar content?! Thank You!",
        "Is it unparalleled, when we compare it to monarchies? like, that's a weird line, right? Like, the UAE or whatever, you know? no? iunno. i'd like to know the lines between government and business, when it comes to monarchies.",
        "Well, while the whole story is mildly true in some aspects, but in detail it isn't.\nTo begin with, I'm a korean living in Seoul, have worked in one of the Samsung branches. \nYou got the thing that big, fat companies run this country theme right, but we don't consider that as a dictatorship or monopoly. With the appropriate amount of consciousness and healthy feedbacks to the mega-companies we acheived what we call a better life. We are not slaves to the Jaebols because they know that treating us like slaves will end up in a shorter lifespan of their dynasty. Moreover, they competitively try to make better brand images to the country by providing better services and environments to the people. That way they maintain power and money, and we get a better country to live on.",
        "I still waiting to find out how much he end up paying from his inheritance to the Gov.",
        "South Samsung*",
        "Like Apple and Google at US...",
        "“Corporations can’t run countries.”\n\nSamsung: Continues to run country.",
        "I do love Samsung, reasonably priced with very high quality. I always try to buy Samsung.",
        "A bit like Nokia was for Finland, but they survived the company dying as it freed up a lot of human capital for startups.",
        "Arasaka is already here, it's just Korean instead of Japanese",
        "Watching on Samsung a52",
        "Some kid in South Korea:\n\"You're right mom...\"\n\"I know I can, I'll do my best.\"\n\"You got my word.\"",
        "If Samsung is so great why can't they make better TV's? Samsung panel quality is a meme.",
        "Samsung has come a long way since the events of Mortal Kombat.",
        "역시 외국인들은 이런 형태의 분식회계에 관심을 갖는구나\n상속세 피하려 범법을 하는 형국은 제어되야한다는 공통된 의견이 지배적이지",
        "I-phone WHO???",
        "SAMSUNG \nBiggest electronics company in the world for a very long time. Of course stable and consistent.",
        "Be better to shit can the insane hertience tax instead.",
        "I believe General Motors was 20% of the US economy at the time of the 1970 General Motors strike which had President Nixon intervening. \n\nThere was a time when the US, like South Korea, was dominated by a few large companies. Men would try to get a company job, and women would marry a company guy and support him as happy housewives with new technologies like washing machines to make their lives easier. Those companies had outsized political influence.",
        "Is it possible to pretend that the pater familias of the Lee family just never dies, just don’t admit to the public when he dies, I don’t think there is a law that pronounces you dead if you don’t appear. Or would that be with passport renewal. Because if he never officially dies, there is no inheritance tax.",
        "It looks like he made a video with money from CCP haha",
        "Here I was thinking Cyberpunk's corpo setting was mostly fictional. . .",
        "Oh no, American brands can't dominate in South Korea, oh no!! Koreans prefer to support their brands, oh no!! this mast be bad!! How typical for every country with neo-colonial ambitions.",
        "Capitalist have no border - someone",
        "10/10 this experience was life changing!",
        "As always, no matter where, politicians are above the law.",
        "I have always disliked and distrusted Samsung as a brand and corporation. This only affirms my opinion. I encourage everyone to drop their products for other brands not tied to such a company.\nSamsung  needs to be dismantled.",
        "아니 뭐 마치 한국이 삼성을 종교인냥 받든다고 묘사를 하네 ㅋㅋㅋㅋㅋㅋ 이러니 외국인들이 한국에 대한 오해가 지나치게 많아지는거지",
        "This video isn't 100% true, but it's useful to get a rough idea.",
        "Interesting episode. \nSuggestion... would your channel do a cover on Twitter and the current fiasco within it?",
        "South Korea living the cyberpunk genre for real.",
        "in order to sell something you have to lower yourself in front of people",
        "Video idea, let's see how many wendover viewers would watch the same non-existent video on all of wendover channels. Something simple, a count down timer, starting at whatever time length of video needs in order to get monetized, and simply opening with you asking us to let it run to the end. Obviously not geared towards bringing in New viewers but simply the least expensive video to produce to see how much revenue us loyal subscribers can generate. Then maybe 6 months later a second video letting us know how it worked.",
        "south korea’s leaders have high integrity as well as people in general that is why they are thriving",
        "Watching this on my s22 ultra lmao",
        "Ah, yes, South Korea, or as I like to call it, Cyberpunk State.",
        "i hope north korea liberates south korea",
        "Since this was a Wendover Productions video I was surprised that there was no mention of the fact that the Samsung group also makes planes (Samsung Aerospace), and build airports (Samsung C & T Corp.) ",
        "people always talk about corporations running countries. How come people dont talk about the central banks running countries via   fiat currency and debt?",
        "알빠노",
        "Samsung is a representative Korean company, but it is in the process of decoupling in China. \n\nLooking at Samsung's shareholder structure, Samsung is a US-led company.",
        "Just imagine Huawei watching everything they r accused of. State sponsor, corruption, spying...............",
        "This is exactly why megacorporations like Samsung, Apple, Walmart, Google and Meta should be broken up. They've become way too powerful and by breaking them up, they lose that power.",
        "South korea? Who?\n\nOh... you mean South Samsung",
        "The north/south divide seems kind of insignificant given the Samsung grip over the south and its populous. When presented like this, what's the actual difference other than the south is more technologically/economically advanced in the eyes of other developed nations which in-turn have no doubt nurtured the south in order to develop their own interests? This world really is a dark place!",
        "Ahh, capitalism and the \"free market\" going hand in hand with corruption. Love it.",
        "I have tried to learn about this before, but it was too complicated to wade through.  I want to acknowledge that you made some judgement calls here, but only in the context of judiciously ignoring what is basically propaganda.  I never made a coherent understanding for myself, and I grateful that you made it for me.  Definitely a re-watch for me.",
        "If need to find the new \"samsung miracle\" tbh",
        "Funny when I say this as non-korean, I can't a bunch hateful and false accusations of being racist and death threats",
        "You're saying Ee family but the subtitle says Lee family and this is consistent through out the video.",
        "As a Korean, buying Korean domestic products is not just because of the brand royalty. A/S is very fast. Because their market domination is large and there are so many branches, so when my  LG laptop, Samsung phone, or Hyundai car has a problem, I can fix it on the same day by visiting the brand shops at very low cost. I also used an HP laptop, and it took one month to repair. Apple is one of the few exceptions because many people use them to get the AS fast. and people like to buy foreign luxury bags because those things do not have repairing problems, usually. In conclusion, when people consider their budget, quality and A/S period, they usually conclude to buy the Korean product, even though foreign products seems to be better",
        "Seems to me like the role of the USA during the Cold War is missing from the explanation of South Korea's rise.\nAfter WWII, the USA helped \"their\" part of Germany rebuild to prove capitalism was better than communism. After the Korean war the same was true of South Korea.",
        "This is the best K drama so far I have ever seen ",
        "Real Life Lore, Polymatter and Wendover Productions have a >20% influence on the gross domestic production of YouTube's world politics explanation videos, and their coalition should really be kept in check to prevent excessive dependence /s",
        "We've all heard of Samsung, but most of us here in the US probably don't know Samsung nearly as well as this video clues us in on :)  I'll never look at them as just a smart-phone-maker again.",
        "kind of confused because north macedonia is right above south korea in coal",
        "Samsung will be the Arasaka from Cyberpunk!",
        "Well... many company's have people that are 10 times smarter and better at their job than the goverments have so actually I think that it could help alot in many countries if company's would run them because the goverments are doing a terrible job. There are two sides of all things",
        "Very good, informative and well-informed video on oligarchy!",
        "It would be fun to explore the similar Zaibatsu system in Japan along with the similar cross-holding structures between companies like Mitsui, Sumimoto, etc.",
        "Man, after living in South Korea for years you will be surprised how companies like Samsung, LG, Hyundai, Daewoo, SK practically make everything in Soith Korea. \n\nBut on that note, while these few conglomerates do have huge dominance in South Korea. The answer should not be break them up and the like. It sounds like envy, people who are envious over success. ",
        "Korea is rich bc they are very hard working people",
        "Interestingly, the current head of Samsung Lee Jae Yong has chosen to give his daughter (and maybe his son, I don't know) birthright American citizenship and sent her to American boarding schools. The Korean Airlines heir Heather Cho (nut rage woman) also gave birth to her children in the United States.",
        "so basically korea soon will turn into one big night city",
        "Yeah but Indiana isn't socially productive so",
        "In some ways, getting employed by Samsung or any family-run multinational companies in South Korea is almost like becoming a worker of a stable public service job in some countries: job security and pensions are guaranteed as well parents will be gleefully happy & grateful knowing that their grown-up children are working in one of the chaebol companies that promises lofty benefits.",
        "This video made me wish that the North had won the war",
        "Wendover: Let me tell how how Samsung became such a big company and a tech behemoth\nMe: Comes closer to the screen with interest\nWendover:  Samsung became powerful\nMe: ",
        "South Korea is an irl dystopia. That’s terrifying",
        "Thank you for dealing with my dreadful Nation.",
        "I thought this video was going to talk about samsung smartphones",
        "there's a little exaggeration in this video. even though samsung's status is the most prominent one in modern day korea, that wasn't always the case. samsung was able to outrun Hyundai, a conglomerate which concentrates on construction and car manufacturing, only after the information age when they started to invest in electronics. and s.korea's market is far from monopoly, more like highly contested oligopoly. for example, LG has competed with samsung in phone market for decades. for these reasons I see samsung as a very prominent 1st place corporation but not the dominant one in korean market. and there's a chance that it's place will be overtaken by its competitors in the future, just like samsung overtook its place from hyundai",
        "Thanks for including reading reference for this video ",
        "It's like Walmart and Arkansas",
        "Wish these videos on foreign affairs would spend at least half as much as time as they spend on gathering facts on learning to pronounce the words they're trying to say.",
        "this youtuber sounds like he is very jealous of samsung ",
        "Hypocrisy causes disbelief and corruption, the mind, the soul, idea, health",
        "17:48 \"South Korea cannot survive without Samsung, but Samsung could survive without South Korea\"\n\nI say the same thing about crapple.  Crapple needs Samsung,  but Samsung doesn't need apple",
        "Great and complicated story. We need a Netflix adaptation of this for sure ",
        "Astonishing that the justice system has this level of independence.  Convictions of elites simply never happens in the USA.",
        "1. 1:13 from noddles to real life Arasaka... what a trip\n\n2. 11:42 I love how we are glossing over the fact they got their own hospital because at this point... is not surprising(?",
        "When the Big Guy has been paying and protecting you for decades its smooth sailing",
        "Why is this dude biased against Samsung. Apple put u up to it? Doing Cupertinos dirty work? ",
        "Way better explained than any major news outlet. Props ",
        "So megacorp in stellaris do make sense",
        "Thanks for an amazing video about Samsung, Chaebol. and South Korea. The whole system was what our country was built up on but what is also causing many social problems. I also want to point out that the “Samsung dream” is a bit out of date. After our IMF crisis in 1997, chaebol companies like Samsung, with other smaller companies, ceased being lifelong workplaces. Many were fired and the age of retirement was pulled forward; people were now retiring at their 50s or earlier. Then came the unemployment, which is still a major problem in Korea, that changed people’s desired jobs. Nowadays, people are leaning towards more stable jobs such as doctors or government employees that provide stable employment. The cutline for medical schools have been the highest out of all universities since 21st century in Korea.",
        "Most engaging videos on wendover made so far",
        "THIS WAS HELLA ENTERTAINING appreciate the hard work",
        "Glad Charlie's covering this. Billy's BS should never be excused or forgotten or ignored. I hope Karl ONCE AGAIN wins and is safe AGAIN.",
        "Very fascinating",
        "Samsung is this \" \" close to become the Arasaka of South korea",
        "I'm watching this on Samsung mobile",
        "Impressive video! It’s interesting to see how foreigners think ab Korea",
        "Although I have a Nebula subscription, I did like watching this video here because the Nebula ad at the end reminded me of how great it is that I can support you and other creators. I really appreciate your high quality videos - thanks!",
        "seems that concept of cyberpunk isn't so far-fetched afterall",
        "I recently went on a business trip to Digital City . . . Pretty eye opening.",
        "So  dystopian",
        "i hope africans are watching.",
        "Holy cow this is like Cyberpunk",
        "I personally don't like too much control in the hands of to few people. Samsung needs broken up. It is a point of liability for Sourth Korea to have soo much of the economy resting on a single point of potential failure .... the Lee family. What might be a loss for the Country might be a gain for the Lee family. Here in the US when Bell corporation was broken up into the different Baby Bells it sparked massive innovation and competition that boosted the whole system. Something similar could happen with Samsung locally.",
        "so, lee's family is basically just a capitalist version of kim's family up north",
        "And I thought wealthy companies in my country (the US) were an issue. This system does feel unsustainable.",
        "As usual, the videos on this channel over dramatizes things",
        "Watch this on a Samsung phone",
        "I have samsung mobile phone and its great ill support samsung and have being big fan of samsung mobile phone",
        "This is fascinating. Excellent video and very informative. Easily my favorite so far.",
        "감사합니다.",
        "This was one of the most interesting and gripping episodes you've ever made. The logistics of corruption tempered by pragmatism. I was glued to the screen. <3",
        "Me, a Korean man, was born in Samsung hospital. When I turned 12, I got my first cellphone(it was before when smartphone was a thing) made from Samsung. I got 3 health insurance from Samsung.  Yesterday, I took a bottle of beer from my Samsung fridge and made some popcorn with Samsung microwave to watch the world cup with my Samsung TV. Now, I'm writing this comment with my Samsung galaxy.",
        "\"dangerous dominance\" Showing your hand a bit here.",
        "16:49 lol",
        "One of the best videos from wendover. Still missing airline related ones, maybe Korean Air topic?",
        "Let's take a moment to appreciate how much time and effort he puts into his content for us. Love the videos! :*",
        "Yeah the Chaebols of which Samsung is a part of, have a lot of sway over South Korean politics in fact when South Korea slipped into a dictatorship under Pak Chung Hee in the early 1960s \n\nSamsung exploded in growth, because the dictator and his administration were effectively helping prop up the company as well as the other Chaebols with full State support",
        "This chennel excludes my country's territory called Dockdo Island. I HOPE you to include it in the illustration of our county.",
        "The problem is not with South Korea or Samsung, the problem is with how South Korea is attributed as the 10th biggest economy nominally, similar to how many European countries are, these countries have high inflation and it has a lot to do with the high GDP, a country with energy resources or agriculture is considered big, lol, it's a tiny country and its economy is similar to a big city with a big corporation with influence on the administration.",
        "we were so close to greatness....that is for BTasS to cease to exist",
        "I know it's a video about South Korea, but I find the Oil Reserves graphic interesting purely because Brunei is near the bottom of that list. Their entire economy relies on petroleum (84.7% of their exports). That sounds like an unfortunate combo",
        "05:40 scale on this chart is incorrect",
        "When hyundai came to Czech republic in order to establish their european factory, they asked czech goverment, whether it is allowed to beat employees.",
        "This video is very interesting and useful for understanding the idea of corporate rule that has deeply influenced cyberpunk and other near future dystopian settings in literature, film, and television. Great video.",
        "It's cool when you know that you are partially involved on something and they don't even mention your country ",
        "Taxing inheritance Is inmoral.",
        "9:45 That's a mistake there. You need to invest more.\n\nAnyway, sooner or later this whole house of cards will fall apart.",
        "Do a video on why every delta flight gotta go through Atlanta— always. Every time.",
        "The one thing and the most important thing you forgot (and a lot of the individuals who are commenting here about Korea's economy) was the amount of children that were exported through the industrial adoption complex in the late 70s to the mid 80s; which was also one of the top reasons the economy in South Korea thrived.",
        "where did you get a lot of the b&w video footage of post war korea? i've always wanted to see archival footage like that. great video thank you \n-korean-american sub",
        "We shouldn't even be talking coal at this point & SKorea is well positioned being a leader in renewable energy. You don't have to be Korean to see their potential though. \n\nThat has been obvious for some time now. Samsung could overtake TSMC If it really wanted to. Korea is also advancing in the biotechnology & nanotechnology fields. ",
        "I wouldnt call 4% of gdp dominance",
        "A 50% inheritance seems insane",
        "Fantastic work. You're turning into Vox / MSNBC! Edit: That's a complement btw, I'm not an alt-right troll",
        "In the eyes of an native korean, this video is pretty accurate although it is a little bit biased with the democratic party's stance",
        "Keep in mind the asian culture of South Korea that focuses so hard on success that if you dont reach the ideal, you're deemed as a failure",
        "Cheil pronounced like “jail” except with a slight separation for two vowels. = “jeh - ill”",
        "Chaebol is the romanization of 재벌 which means \"wealth clan\". This word can be written in the same characters as the Japanese zaibatsu (meaning financial clique), as both these words have Chinese roots. The Japanese zaibatsu (or keiretsu nowadays) were powerful monopolistic conglomerates of pre-war Japan, with four big ones. Sumitomo, Mitsui, Yasuda, and the most famous being Mitsubishi. They were broken up by the GHQ (General Headquarters; another name for the Supreme Commander for the Allied Powers during the American occupation) but later on loosely reconstituted.",
        "흥미롭네요 잘 봤어요",
        "Samsung is literally everything in korea but in other nations it's just phones lol",
        "As a Korean this is why my money is in the US stock market, All you Americans complain about your corporations but you guys are so spoiled have no idea how good you have it.",
        "Samsung has a long-term problem looming though.\n\nThey are simply trying to do way too many things at once. Their products are good, but almost every one of their products has a higher quality (and usually a cheaper) alternative. Their phones are in my opinion the only sector where I feel like Samsung still dominates when it comes to quality.",
        "Sony",
        "This was way more detailed than I clicked for… but I’m not mad.",
        "WOW.\nThe animators really outdid themselves with this one! Absolutely insane visuals with a compelling storyline, keep up the good work on your trailers!",
        "Really glad I just happened to watch this video before watching Reborn Rich.",
        "And here we thought Arasaka would come from Japan",
        "Interesting, I work at a coal mine in Canada, and our best customers are from Japan and South Korea",
        "3 words...\n\nSamsung Logo Balls",
        "Watching this on a Samsung phone lol",
        "Arasaka",
        "I think we can all agree this guy never disappoints us with his content :-o",
        "All I need for them to do is add Dolby vision to their TVs and I’ll buy their TVs. Lol.",
        "Someone said wisely, \"everyone dies poor without unethics, illegality or miracle.\"",
        "Fun to watch that cannot pronounce one name correctly.",
        "does this guy hate korea for any reason",
        "What kind of logic is saying a country should be poor due to its geo position and natural resources? This could be true 300 years ago, now its all about human capital and south korea has very high average iq plus is a free capitalist country.",
        "Hahaha yea dude. If your just finding out the truth about Korea right now then I pity you.",
        "게이야 좀 웃겼노",
        "4 out of the last 5 South Korean presidents have gone to jail.  Who’s going after these jobs?",
        "Samsung are stalkers just like Google, try using your headphones or watch without giving location on Android 12, I had to buy a completely new phone with Android 11 on a different account not connected to this, just to listen to music outside",
        "i REALLY love the \"if you enjoyed this, check out ____\" segment at the end! great video as usual, i had no idea samsung had such an aggressive hold on sk culture but it's terrifying. of course younger generations hate it. those who speak english might pick up our \"fkn tired of corporations being in bed with the government\" energy over here and add fuel. i hope they can untangle somehow without serious harm to the country, but it will inevitably happen sooner or later.",
        "welcome to the true Cyberpunk state, run by Megacorps.",
        "The rich stays rich by spending like the poor and investing without stopping then the poor stays poor by spending like the rich yet not investing like the rich",
        "South Korea lives in our future where countries are corporations",
        "The real Uncle Sam out there",
        "I guess North and South Korea aren’t so different after all. They are still living in a feudal era The North has the Kim Dynasty and The South has the Lee Dynasty",
        "playing vic3 really made me look at this video differently",
        "Bribing the president to clear you of bribery charges is like stealing money to pay your cash bail for stealing money",
        "South Korea is a real life version of Cyberpunk 2077's \"Night City\"",
        "the intro was very... geographically poor lol\nBrazil has many minerals, oil reserve, big af and so... stil isn't rich\nThe old UK isn't big at all and still was the richest until USA was born.\nSo why is Japan rich?",
        "When a CEO is more powerful than South Korea's president",
        "Saying that S. Korea can't survive without Samsung takes away from the people who work incredibly hard that have no interest for working for Samsung. This video, though educational, is incredibly simplified and watered down in my opinion to be an attention grabbing headline for views.",
        "Some Koreans say that the Samsung owner family does not oblige noblesse.",
        "Our age has reached a conclusion in the wake of arriving at its zenith. The downturn and financial exchange crashes are influencing everything, not simply FTX and 401Ks. My retirement values portfolio, at $750K, is bleeding cash. I'm continually losing because of expansion. This world will disintegrate under its authoritarian rulers, similarly as. Assuming you are contemplating resigning yet are concerned that your annuity won't take care of the increasing expense of living, I am sorry. All over the planet, there are poor administrative, monetary, and energy approaches as well as awful international strategies.",
        "It's kind of nonsense to suppose that a country \"should\" be poor. Whether your country is rich is basically just a consequence of its policy choices. Geography can help, but if it was the determining factor, then we'd still be at stone-age levels of productivity.",
        "Wow I know this is like poignant at this point but this is literally out of a cyberpunk lore right here, study your way to work on the most powerful company in your nation for the chance to become part of a higher class or fail and be thrown with the rest in to the slums (obviously I'm generalizing here but the concept still stands)",
        "I'M NEW TO BTC AND I'VE BEEN MAKING LOSSES TRYING TO MAKE PROFIT MYSELF IN TRADING...I THOUGHT TRADING ON DEMO ACCOUNT IS JUST LIKE TRADING THE REAL MARKET... CAN ANYONE HELP ME OUT OR AT LEAST ADVICE ME ON WHAT TO DO?",
        "I would suggest finding a Korean person to help you with the pronunciation of Korean words and names on future videos involving Korea.",
        "I'm listening to the current Blowback podcast season about the Korean war, and seeing that map at 2:00 and hearing you gloss over the war feels wild, haha. It's not the point of this video, so it makes sense, but it's wild to see that line shift so quickly and know all the horrors behind every detail only to swiftly move on.",
        "crazy rich asians",
        "Hey, a Hoosier here, so good to see us mentioned in something that isn't talking about Gary!!!! Thanks Wendover! :D :D",
        "My take away - government greed leads to extreme measures to avoid double and triple taxation (like inheritance tax, why should you pay tax on money that has already been taxed when earned by the father?)",
        "Thank you for actually doing real captions and not those auto-generated ones.  With the many foreign words in this video, it'd be awfully hard to understand as the auto-generated captions flub them.",
        "I actually audibly laughed, out loud, in the young shopper birth scene when it cut to the father staring at his hands as the cart decends into walmart hell.",
        "If Squid Game were real, it probably was funded by the Sams",
        "The editing language of this video seems different. There are transitions and motion effects that remind me of CapCut, and it feels like a higher energy than the narrator's tone.",
        "the heart attack sounds like it inspired the show succession",
        "i bet even their president is a samsung's puppet .",
        "Cool video\nWatched this from my Samsun S21 ultra.  \n(Also upgraded from an extensive history of Samsung phones, I ironically only used LG if its not Samsung. (It was the year of the Note 7 fiasco)",
        "Watching this on a samsung phone",
        "Cyberpunk KOREA 2022. Arasaka corp = SAMSUNG.",
        "\"Working for the smaller and less significant companies like Hyundai or LG\"\n\nLOL those companies might be small compared to Samsung but they are by no means insignificant on the world stage.",
        "Such Big Cooperations should undergo inside parliament democratic system. You shouldn't enforce a dictatorship with one massive company running the country.",
        "Americans are proud of people just holding a job. South Koreans are only proud if you work for Samsung lol. The Asian stereotype is actually real.",
        "17:38 The ends only justify the means if you believe cell phones and TVs are important to life on Earth.\n\nI reject the idea that most of what people do is a net positive, and I reject the idea that the way we do most things is the way they should be done.",
        "Excellent video on nature of the South Korean government/family dynasty.  Mainstream news never investigate those.",
        "As a Korean, Korean society is so strict with the chaebol that even citizens often criticize the politicians for putting too much shackles on the chaebol. That’s why Korea is still not corrupted despite chaebol’s domination.",
        "There's a popular South Korean streamer that uses an Iphone. Was shocked to hear about that. I mean, she also has a Samsung, but it's weird how she got an Iphone.",
        "This convoluted South Korean Chaebol financial political structure sounds like the inspiration behind Chrisopher Nolan’s script to Inception.",
        "I'm surprised Daewoo wasn't mentioned. They aspired to be like Samsung but overstepped their bounds.",
        "Imagine working hard your entirely life to build wealth for your family, children and grandchildren, paying taxes all along the way for every dollar earned and saved, just to have the government come and take half of your family's and childrens' birthright out of their hands when you pass. Makes my blood boil with anger.",
        "I didnt know it was iron mouse untill she screamed :-P",
        "You exactly know what is happening in South Korea. Republic of Samsung is the term Koreans frequently name it as the name of country.",
        "The beginning of the video is offensive AF..lack of natural resources and small size of the country doesn’t mean that it shouldn’t be in top 20 economies..such an American logic. Like look at Russia - it is so wealthy with natural resources yet it is considered a developing country with a low GDP per capita..and look at Luxembourg..hella small yet one of the richest countries in Europe.. like I get that the author wanted to make a build up to his point but it is quite rude",
        "Issue here isn't Samsung, it is the 50% death tax",
        "When doing the total for America, maybe include businesses like Amazon, Google and Apple. I'd prefer a total showing the top ten American companies personally. I think seeing that might put it more into perspective. Maybe I'm wrong but diversification is a hallmark of the American industry. So joining the group together would make more sense.",
        "FYI, Choi Soon-sil's name is pronounced more like \"Chae Soon-Shill\".",
        "Great video and made better by the Ezio family track in the background",
        "Wake up, we got a city to burn",
        "This was definitely a great, eye opening video!  I was intrigued the entire time. Thank you for doing this.",
        "Thank you for putting up such a researched work in free",
        "You sound familiar",
        "inheritance tax is a crime against humanity.\nYou work to provide for your family, but as soon as you're unable to, the state steps in and shakes you down for 50% so that it can't go to your kids. You already have income tax, sales tax, all kinds of other taxes, but you hit them super hard as soon as there is a family tragedy.",
        "Samsung's contribution to South Korean GDP is mind blowing",
        "The opening of this video shows us how capitalism is always better than communism (or Marxism, if you prefer).",
        "LG and Apple: Sigh...",
        "When is APPLES Dangerous dominance coming out? ",
        "I fkn love good content, condensed to give you the raw facts in the shortest amount of time.  I",
        "South Korean mobile phones simply are what German manufactured cars are to the world: Most of them just work, and they do so exceptionally well at a high level.",
        "That is how dystopian stories start usually lol.",
        "Any country makes good progress on their own. Bendover Productions: Something is wrong, I can feel it!",
        "Samsung is smaller today than its peak roughly 20 years ago by revenue, considering inflation, it is significantly smaller. The Dynasty structure is ultimately destroying South Korea’s real GDP (inflation adjusted).",
        "요즘 젊은 사람들은 삼성에서 일하는 것 보다 의사나 한의사,약사 같은 전문직에서 일하길 원한다",
        "Me being like wow how much power can these people have then hearing the government charged 50% inheritance tax and I had to hold myself Back from going full corpo",
        "Camman : sees the top of bamboo green.\nAlso camman:Thats a sign",
        "As a south korean, I will say that samsung isnt as dominant as he makes it sound. The video is pretty heavily exaggerated",
        "",
        "The root cause of this whole series of events was the unjust and unethical act of the 50% inheritance tax in my opinion.",
        "Dirt poor neighbors?",
        "Couple years ago Samsung made worldwide best-selling military equipment,\nK-9 howitzer that Poland recently ordered 1000 ea . Samsung sold the factory.\nIt also built top of the world skyscraper in UAE . So, its business spectrum is \nmore than ordinary people think",
        "Smart Koreans work at Samsung\nSmarter Koreans move to United States.",
        "It really sucks that LG discontinued their smartphone business; before that (which happened in 2021) there was at least a competitor. Now, except Apple, there is no company who are officially selling & servicing Android phones in this country. This monopoly is absolutely killing the domesic mobile device market, severely limiting the customer's choices. Samsung's dominance - along with other companies' dominance in their field (line Hyundai-Kia group's absolute dominance in the domestic car market) - really ",
        "5head move to brining the president xD",
        "Samsung 20% of south korea's gdp apple 10% of usa's gdp. Considering south korea is uncomparably small country when compared to usa, the problem usa has looks way bigger. Samsung had a good global strategies and their product is top notch as well as their tremendous amount of r&d investment. No government should damage it's own well performing company imo. They did the good job - simple as that.",
        "과대포장과 확대해석만 하는 한심한 콘텐츠.",
        "South Korea's economy is more akin to feudalism than capitalism, imo. At some point, private enterprises cease to be mere merchants and become an arm of the government. All the chaebols basically started making lots of money and continue to do so through the blessings and the backing of the Korean government. They're like feudal lords who were bequeathed the land to work as they please by the king.",
        "You realize how influential the Chaebols are when you look into just how much control they have of their respective industries in ROK. Sure we no longer have a better performing economy than the ROK, but we're still proud of what we have (like mineral wealth). Because we remind ourselves that we are simply protecting ourselves with our program, while others don't bat an eye when a corporation straight up controls a country. ",
        "The problem is simple: Eliminate the 50% inheritance tax in Korea. Unlike the US, there are few deductions allowed. So this 50% inheritance tax makes it impossible to continue a family business.",
        "Just goes to show, it's the IQ/time-preference of the population that counts for development, not resources. Oh, and that Western occupation/colonisation is actually a beneficial thing in terms of development, and not an excuse for poverty/corruption/dysfunction",
        "Lee is the \"Supream Leader\" of South Korea",
        "Korea & Samsung shows perfectly why free-market capitalism can be really bad for an economy due to the risk of monopolies the companies can achieve in the countries.",
        "Wish they would make a film out of this",
        "Reminds me of a little known place called U.S.A.",
        "You really glossed over and down played just how big Hyundai is, cars, steel, ships and much much more and it's one of the largest steel and ship builders on the planet",
        "Came here to say Samsung Refrigerators are the worst and if you want a headache that will not be cold or make ice, you'll buy Samsung, that is all.",
        "As an expat, thank you very much for discussing my motherland's issues in this medium. You got to the real issue and told the story as it is which can be impossible when you are living in the situation.",
        "Watching 1st 15 minutes made me see much parallels with Cyberpunk 2077 premise, absolutely fascinating how science-fiction transitions into non-fiction",
        "North korea: run by party\nSouth korea: run by company",
        "Wow......we are basically already living in a Cyberpunk future.",
        "I recently watch and read news about Samsung's power on South Korea's economy and politics. I thought it was exaggerated news. now i really understand it.",
        "Its interesting how they hold so much power over politics in South Korea and yet they haven’t lobbied to have the inheritance tax removed or significantly decreased. I doubt most South Koreans would object.",
        "Please do one on Temasek, the prime minsitry, GIC and FTX and their relationship",
        "I'm done sitting tight for the award advance since i acquire$23,000 every 12 days of my investment, in all you do put God first.",
        "You know a family's rich when they bribe the bribery charges against them.",
        "Imagine being killed by a Samsung Galaxy S50 Armored Assault Tank with S-Pen though.",
        "This really explains the webtoon A Man's Man it is about working at \"Hangsung\" which I'm sure is just Samsung.",
        "Corporations can't run countries.\nSamsung: Hold my semi conductor.",
        "I will make Samsung the world's number one Frugality and Fidelity. Trust me.",
        "it is nothing compared to Amazons and Googles dominance over the internet and the USA.",
        "Is this broadcast a minion of CCP or PC?",
        "Actually, Lee Kun-Hee's son made 'a mistake' in one of speeches, calling his father 'my late father'. It was several years before Lee Kun-Hee's actual official funeral. Yes,",
        "W MMG. I love the content man. Keep up your amazing work. I really hope to see a ton more BANGERS like this one",
        "US companies do the same tbf. It's several companies instead of one but they exert as much power. And because of a lack of inheritance tax the power never gets challenged in the first place.",
        "Little does he know that the United States federal government is a giant management business",
        "Sam! Could you please look into the economics of flight schools and how they have an impact on aviation as your next few video topic? Looking forward to it! (and the free T-shirt that comes with it haha!) ",
        "Ahhh, watching the beginning of this episode reminds me of the good ol days when there was a shrine to Aphmau and Aaron in the basement that was put there by KC :P",
        "This is why I'm glad I live in the good old US of A. Great to live in a country where corporations could never takeover. Would never see this happen in the US... ever \n\n(Sarcasm)",
        "Battle of Kapyong. South Korea exists because of the non-stop badassness of Canadian troops who defeated and held back a Chinese force 10x its size. A force that drove back the Koreans, the Americans, and eventually the Aussies.",
        "Even Koreans feel that Samsung is the main and largest pillar of the Korean economy.\nAnd that's very public\n\n+For that reason, Samsung's chairman will never be imprisoned",
        "Hey, this is the rare kind of Wendover video that is probably going to send me down a research rabbit hole as I absolutely need to know more :D",
        "Samsung runs South Korea. Its power is unbelievable. I know there're always dark sides. Hell, even I have my own dark sides, we all do. But despite all that, they do try very hard to innovate for the greater good. We can't expect anybody to be pure and fair when even ourselves value favoritism and nepotism. Think about things you would do for your loved ones over your neighbor's kids",
        "United States of Facebook is way worse",
        "If they have so much power over the government, why don't they just lobby to either abolish or lower the inheritance tax?",
        "their economic dominance over the nation was once dangerously high, but now it counts up to mere 3~5 percent of SK's GDP(graph at 6:20 is wrong, since it is comparing net surplus of the country, which is gdp, with entire sales volume of the company). that is still high, but not as high as to call it 'dominance'.",
        "East Asian Cultures really need to calm the fuck down when it comes to labeling each other as \"Failure\". Having a Job at a mid-sized business sounds fine. ...no reason to hide away from your family, geez.\nAnd yes, I do know that it's a deep rooted cultural problem but if you don't talk about it nothing is ever going to change.",
        "remember daewoo. It will never be too big to fail",
        "1:06 i am afraid it is quite misleading to say that Korea’s drastic economic growth owes much to a single company samsung. “miracle of the han river” mentioned in the video is mostly about the country’s development in 70-80s. back then samsung was obviously one of the largest major companies but was as dominant nor was it the top either. until mid 90s hyundai was the largest but for political reasons + semiconductor sales samsung began to outperform hyundai in late 90s and became more dominant afterwards esp. from 2010s with smartphone galaxy business making good results globally. its that different.",
        "Beautifully executed mini-documentary. I enjoyed every bit of it.",
        "Samsung has literally exploded in the last two decades.  When my family left Seoul in the early 1980's , both Hyundai and LG were bigger.  LG and Samsung were direct competitors in the consumer electronics market and LG was clear #1 in that market.  I remember when color TVs first came out, you had to wait a month for LG TVs but you could just walk in to a store and buy Samsung TVs.",
        "18:11  someone tell this guy about capitalism",
        "What an absolutely brilliant video",
        "noice",
        "They make a load of tat and charge huge amounts for it. Samshite.",
        "Next episode: TSMC's Dangerous Dominance of Taiwan",
        "@ 5:41, the chart seems to be a little strange",
        "Now Naver, KAKAO, TOSS, and Woowa bros are the companies Koreans want to go. These companies ranked higher than Samsung as companies people want to work for.",
        "One thing Samsung does to indirectly hold Koreans hostage, and to ensure they do their dirty deeds unimpeded is that almost every single young lawyer in Korea will at one point in their careers act as an attorney for a Samsung company in a legal procedure. So that if a private citizen would ever want to sue Samsung for whatever reason, finding a lawyer that would be able to sue Samsung is very hard, as most often there will be a conflict of interest. ",
        "Chaebol, oligarch and so on. What's the difference, it's the rich controlling the mass quantity of a country's wealth.",
        "Your pronunciation for Lee is EE but your pronunciation for Choi should be like CHWeigh not CHO EE",
        "BRO. I could only imagine what kind of giga anarchy capitalist I’d become if my country took FIFTY PERCENT of my generational wealth when I died. That’s nuts!",
        "A produce a very high quality rice",
        "There's one Korea, with half of the country occupied by US army to maintain a rich elite of south korea with a fascist regime, justified under oath to combat communism and terrorism of a regime which never invaded another contry, tho USA can say the same? Is USA a democracy? Where black people only achieve's  the right to simply exist in 1960's?",
        "This video sums up my entire corporate governance class. Believe it or not, SK has tried SO MANY regulation to keep the chaebols under control but they are like slimy snakes",
        "absolutelly disgusting case of corruption, but this shows that capitalism  itsef would be  a great concept for a ck2 mod",
        "It's a good day for corporate intrigue.",
        "As a Korean, I can definitely say living and working for chaebol is much better than living under extreme poverty.",
        "um truth be told, we benefit a lot from the company. they make a lot of donations to our society as well as doing business with other companies in korea. Samsung family isnt as bad as you think they are...",
        "Oh, I am watching this on Samsung sitting opposite to Samsung building.",
        "50% death tax is absolutely absurd.",
        "Remember when Thanos used the stones to destroy said stones, something like that, but with bribery.",
        "South Korea is probably the best examples in history of how capitalism is good and dangerous, how it is free market but at the same time systemic and centralized and how the state both interacts with it (giving the company benefits and funding! and parallel to it (institutions like healthcare and education) ",
        "The Korean media is also very encroached on Samsung, so it is difficult to grasp this clear causal relationship. Thank you for making this video.",
        "Watching this after I purchased a Frame Tv.",
        "Some of your best work ",
        "about 10 years ago, i heard a rumor about the policy of samsung, if you're the employee, you get a nice disccount to get a new samsung phone, if you buy an iphone or an htc, you get a small subsidy. however, if you want a LG, you get nothing. i don't know it's true or not, but i think it's a smart way to dominate the domestic market.",
        "South Korea's problem is not Samsung, the problem is regulation and the huge inheritance tax. If there was a better business environment, Samsung would never have been such a big company and would have had much more competition.",
        "It’s a totally shocking that this has a quite accurate description and matching images same time. Sad but true…",
        "The Netherlands was poor and has a bad geography but their VOC impressed the world",
        "Samsung offers a terrible warranty. And there customer service representatives lie about anything having to do with your account. Never buy their household appliances.",
        "Watching this on a Samsung hits different",
        "Now I get the inspiration for Cyberpunk edgerunners",
        "S22 Ultra baby!",
        "Re Curiousity Stream:\nI'm a subscriber there, however i almost never use it. YT is just way more convenient, new episodes showing up where i anyway spend time so i just watch it here. No clue if that makes it pointless",
        "Stop using GDP to define a country \"poor\" or \"rich\"!\nGDP is a false measurement, it also takes into account DEBT, and it does not measure COSTS.\nIs like looking at a person wage and say \"look, he is rich\" but the guy has a ton of debt and lives in an area where it cannot even afford the rent.",
        "the large amount of social presure to join one of the big companies like samsung makes allot of very capable youths leave the country when the the society pushs a feeling of falure on them. very sad. i had a disuction with a young man at a car dealership when waited for serice to be done to our cars, then we had lunch. iv since leared he took his own life since he felt he could not return home to mary the the young lady he loved. i hate all of this",
        "There's so much to all of this that it could be a huge series on its own. The 1 million people protests against the former president, the assassination of her father who was the military dictator mentioned in the video, the assassination of his wife, the current president and his shady ties, the shaman practices of the Korean elite, etc.",
        "Korea as a whole is interesting. North Korea has extreme communism, South Korea is seemingly extreme capitalism to the point a single company can be equivalent to the country. For those saying it's a monopoly, yes it is, and that's a part of capitalism too right? (I'm Asian American using my Samsung 22 Pro, Samsung fanboy, they've gotten to me, what can i say)",
        "In 2077 Samsung will be just like Arasaka\nmark my words",
        "Samsung’s profit reign in the South Korean tech sector is a thing of awe, nothing dangerous to find here in a Company that represents an astounding 42 percent of revenues generated by all Korean tech firms.\n\nWhile tech has been a primary driver in Asia’s 4th largest economy, Samsung and LG another South Korean huge success are both worthy of high praise.",
        "Samsung is getting so big that Johnny Silverhand is going to drop a nuke or two in there any second now.",
        "Lg is better than Samsung. Lg needs to come back and make phones again. Also their 2nd best in phones because Google is still best at phones.",
        "I don't understand, if they have this much power, why not change that ridiculous inheritance tax? 50%?! That's insane.",
        "The fact that you royalty as loyalty is hilarious",
        "Props on pronouncing it properly as EE instead of LEE",
        "South Korea - where corruption is part of every business' mission statement",
        "All Koreans want to get into Samsung?? Lol i would agree that in the 90s of South Korea but now? Absolutely not!! This video is exaggerated too much.",
        "They're also the best at league of legends. That cant be overlooked.",
        "Samsung's competitiveness has been drastically reduced.\n\nTheir semiconductor technology has fallen behind Japan, the U.S., and Taiwan, and their memory semiconductor technology has caught up with China.",
        "When you have a company that makes chips and tanks it'll be hard to break up.",
        "I'm an American currently living in South Korea. It is insane how much brand loyalty there is here. Literally every phone in the country is a Samsung (I've never seen so many foldables in my life). Every single car on the road is a Kia or Hyundai. Every appliance is an LG or Daewoo. And Lotte and Kakao are everywhere too. I've lived all over the world and never seen a country so loyal to its own brands. It's actually kind of admirable.",
        "The solution might be not to break up the company, but the ownership. One family in control of such a large part of the Korean economy is crazy.",
        "As a Korean, I love Samsung. Foreign companies will leave if the Korean War breaks out in the future.\nSamsung means three stars. The number 3 is special to Koreans. I am an ordinary South Korean living in Korea, but it is rather good that Samsung dominates Korea. If there is a wish, I would like to protect our country by making  AI War Robot made by Samsung. and work human robot too. We are very small country The population is also small.",
        "As Korean saying that most of the Korean big company growth is just because of loyalty to our company is not a right annal   South Korea is second higest Mercedes-Benz Purchases per-capiter in  Asia and bmw's first Asia driving senter is on Incheon south korea we like German car and American phone and hamburger and our exporting Occupy 50percent of the entire gdp",
        "Very good video.  I used to work as a contractor for Samsung Telecom America, a division of Samsung Electronics.  I spent time in Suwon working on the first Samsung Galaxy phone.  While Samsung does produce a lot of decent products, the politics and corruption are difficult to swallow.  Also I think a lot of its staff are underpaid by US or European standards, but most Samsung workers seemed reluctant to consider work outside of South Korea ... even though learning English was very popular for the younger generation at the time I was there.",
        "Despite how powerful Samsung is still South Korea still has a 50% inheritance tax which shows it still has limits in its power.",
        "Did South Korea go through the 90s TWICE? 5:43",
        "Can you doc on TATA group from india",
        "This video is actually full of stereotype :p",
        "There are also Hyundai, Kia, Posco, LG, SK, Hanwha, Doosna, Naver, Kacao etc...alot more\nThey are all global players",
        "At least they still need to pay inheritance tax, still need to jump through hoops  to maintain control, still need to symbolically go to jail, and still need to bribe the officials to get pardon. It's amazing the Korean government and judiciary system still works at such a degree with the existence of Samsung.",
        "Grizzys high pitched scream at 5:48 gives me life",
        "amazing research and putting this piece together... samsung couldn't do anything wrong when you are the GDP of Korea.",
        "Are you jealous of Korea?",
        "makes nice youtube but there are a bunch of inaccuracies about how Koreans view samsung and working for samsung. maybe 15-20 years ago you would be closer but not today.",
        "The best thing about this is they all are following a system, no matter they are mending it to their benefit, but at the end they are following a system. Which is giving a good result and growth to the nation, and hence power remains to the system and business remains to the one who knows business well. Hence, an equilibrium!",
        "I am confused about the EU's take on this. It is more than okay to have a Megacorp in S.Korea like SAMSUNG or lotte. But when it came for HHI (Hyundai heavy Industries) and DEAWOO Ship building to unite under HHI, the EU restricted that deal so it won't happen. I dont know why the Koreans even care about the EU as they are stuipid af in lawmaking but it happened. Do u know more on that?",
        "Is this paid for by Google?",
        "As a S.Korean, it's tad hyped to say Korea is an advanced, rich country; rather it's industrialized, mid-income, mid-range power. And it's due largely to support from the States.",
        "Is \"dirt-poor neighbor\" really a respectful way to speak towards a country and it's citizens this channel obviously don't like ? I'm not sure.",
        "Amazing what being globally connected can do for a nation...",
        "kinda weird how there are Koreans in the comments defending a multibillion dollar company",
        "16:45 To be fair when it comes to getting the Olympics you want someone who knows how to lay down the bribes.",
        "Watching this on my Samsung mobile.",
        "So basically Evil Corp and Deus Group",
        "Money money money money ideas and resources...",
        "Hyundai is more of the problem. Korean people have not much choice to buy when it comes down to automobile. Yeah there is GM and Renault but all foreign makers are not really into investing for small S.korea market.",
        "They're currently 4.5 hours into the stream and have reached 88% of the goal amount.  Good on Charlie for caring and doing this for Lance and his family.  Looks like they'll make the goal easily. :-O",
        "Economists: Noooo you can't just do mercantilism, that's outdated theory!\nSouth Korea: EXPORTS GO BRR",
        "I love her videos that she makes with her friends and family. Lets get her to 15M. ;)",
        "\"Corporations can't run Countries\" to which the United Fruit Company says: \"Hold my banana\"  \n\nHanwha is the new kid on the block. They're pretty old but recently have made huge gains in the market and closed in on the likes of LG and Samsung. They're not as close as Samsung's sister companies but their weapons production group dominates the market. They've also purchased Samsung's weapons and systems arm in the early 2010s. I think we'll see many scandals or controversies surrounding their operations for years to come. They basically have a chokehold on the south Korean arms market and even surpasses the revenue of Raytheon and Lockheed Martin etc. in some markets.",
        "A lot of the names are mispronounced… it’s clear you can’t read Hangul because you often just have a lot of Hangul on the screen but pronounce things incorrectly.  It’s a high quality well researched project though, and impressive that you have attained such expertise.",
        "Companies can’t run countries. \nVOC walks in",
        "As a Korean, Samsung's influence on our lives is somewhat exaggerated in this video.     However, it’s true that the future of the Korean economy is unstable due to Lee Jae-yong's lack of leadership",
        "Samsung and South Korea are just awsome no two ways about it… South Koreans are awsome look at there Olympics / football teams and other sk brands big fan of sk product and culture / movies… I love Samsung just awsome",
        "5:40 they lived through a decade twice, amazing!",
        "This really make me look back at my own country (Thailand) as we also have our own Samsung in the name of CP but they are worst than Smasung as they use all their power and money to be on the good side of CCP. I really want to see Wendover do a dive in to the structure of Thai conglomerate and it tied to  \"someone\" and China.",
        "We want to be doctors not Samsung employees.",
        "Me who is Korean watching this foreign guy's video : Damn this dude is smarter than me and it's interesting",
        "So basically Cyberpunk Megacorps but with less violence",
        "Watching this on a samsung phone while wearing samsung buds 2",
        "It's short and simple: the work culture of the South-Korean people is something I consider almost non-human as a lazy European. And I say this as a positive thing. Diligence and humility all the way down. This is why they are there where they are now.",
        "Great video. Do one about Nancy Pelosi and others like her (rep or dem, or preferably both) dealings in the stock market and what forces keeps them from being punished.",
        "you seeeeeeeeee",
        "south korea knew of this and allows the chaebol to florish. The massive 50% inheritance is there to counter it every 50 years or so. Lee family might have managed to maintain their control, the tax still dealt a massive blow to their net worth.",
        "7:00 literally gonna be like arasaka from cyberpunk one day",
        "They should make a Korean Succession series",
        "Angrboda  : i have plans , just not sure whats next\nCory           : WE HAVE TO REPOPULATE",
        "17:46 the jews back at it again",
        "“But War, ~ Created OPPORTUNITY” Can understand. Wanted to make it sound nice in the video making the contrast and talking in the point of Samsung, but still very incautious word choices. Can sound like Japanese colonial statements as now. Also, be careful to find contents easily found in English often has these issues.",
        "really unfortunate to see some MAJOR glossing over of important points that would otherwise paint the US, the “industrialists”, the early korean governments, and capitalism overall in a bad light. Wish there was more fair reporting on stuff like this — specifically the early history of Korea and how we got here.",
        "Samsung is the modern equivalent of the British East India Company in terms of how integrated it is with the nation. \n\nJust as the railroad tycoons and oil barons of days past, there will come a time when Samsung would be broken up. It will take some time though, just as it did in the Industrial Revolution.",
        "This chaotic stream was absolutely legendary. Magni was unstopable, relenthless, everyone got MAGGED, \"reformed\" Altare did clip worthy ACE plays, the toxicity and everyone was so freaking fun! TYSM for killing my sides guys. I could watch them play all day and i all for more collabs. GG",
        "We visited S Korea this past August and YES Samsung is so intertwined into the fabric of life there, baseball fans acyually sing anthems to Samsung at the baseball games there.  Of course Hyundai, LG, KIA are overtly omnipresent too but these spontaneous anthems to SAMSUNG at the ball game really drove the point home for me.",
        "Sounds like this would be a cool drama series on Netflix.",
        "Your recognition is insane. Shades of Marx spreads out acorss the world. This is the evidence of it.",
        "I think looking at my shyethole country... I will go ahead and be happy for How modern and technologically advanced far East Asian countries are.\n\nI mean Japan could've kept weeping and blaming Murica for nukes... (like b|acks in Europe and US)",
        "“Geographically speaking, South Korea… should be poor.” \nLuxembourg and Monaco: SWEATS QUIETLY",
        "5:00 It’s Jaebeol, not Chaebol!!",
        "This reminds me alot of the effect or control that Arasaka has in Cyberpunk 2077. Or other corporations controlling fictional cities.",
        "Saying a country should be poor is insane, are you insinuating america just wasn't suppressing them enough? Americans making videos like this is completely ironic and disingenuous. The black hole calling the kettle black really. Americans will make a 21 minute video on a foreign company rather than do 21 minutes of research on how any of their fortune 1000 is a billion times worse.",
        "It's so sad that a family has to go through this just to ensure they still have their business. \n\nWhile on the same time, Korean govt has found a very good way to slowly nationalise them lol. 50% inheritance tax",
        "I cancelled my HBO and Hulu to get curiosity.. absolutely one of the best decisions ever.. thank you for creating amazing content",
        "there is a number of false assumptions in this video. oh well. this is youtube after all, where anyone can be a historian, real or not.",
        "great video on the Samsung situation turn a complex understand problem into a what i say lot more easier understand video.",
        "Don't forget the K-dramas are also conquering the world!.... Kamsamida",
        "It’s like a company town at the country scale….",
        "capitalism is that rotten. jeez",
        "Samsung is not a company operated by one country Korea any more but a global company by the cooperation of many countries such as US, EU, China and etc.",
        "It is not surprising south korea is so successful, as that is the norm for the region. All the countries there, aside from north korea which is a country which doesn't care about economic growth at all, even communist china, are extremely economically successful following the same model founded by Japan.",
        "Sam’s knack for translating widely understood concepts of modern Eastern culture into bite-sized catchups for the Western audience is second to none!",
        "Samsung make good product, have many Samsung product all last me big long time\n\n\nAm bo4",
        "Is South Korea Tim Cook's \"Big White Whale\"?",
        "Why do you pronounce \"Lee\" as \"ee\", I don't understand, I don't think it's by korean rules either too?",
        "Samsung sucks……apple rules. Greatness",
        "Most girls in Korea get iphones not Samsung lol",
        "To all the Koreans commenting and scrutinizing what they deem negative zip it. This video is not exaggerated. It's pretty accurate. Koreans all want to shoot for a job at Samsung. That's their number one choice. That's true. And to the Korean commenting that doesn't mean it's number one you are just convoluting. ",
        "Samsung is legit too big to fail, not \"the country would be in deep recession if it fail\" more like \"the country as we know it WILL collapse without it\"",
        "Samsung should just buy South Korea and make it a company country. They already make ships and tech, Samsung Korea could make their own war ships and satellites and whatnot.",
        "Samsung is basically Arasaka from Cyberpunk 2077",
        "dude acts like a robot",
        "You should do a video about the same issue with Volkswagen and Germany. Cheers!",
        "Suddenly this channel is killing it with the pronunciations. I had no idea the name \"Lee\" was pronounced like that.",
        "\"Man, I can't believe Korea let Samsung have that much control! Surely a single company can't be that big or important!\"\n\n- Me while watching this on my Samsung phone",
        "대한민국 만세",
        "I loved this video!  Living in Korea had such a deep impact on me and it was such a fascinating and frustrating experience. This video really explains so much about it's culture  - obviously not everything but so many key things. One of the things that struck me was the connection of NPS and the President to Samsung was so indicative to how the culture communicates. When I was a teacher, I NEVER heard any feedback directly from my boss or even colleagues that sat next to me. Everything was indirectly communicated to me through 2-3 people.",
        "I think us Finns understand better than most how incredibly stupid and dangerous it is for a country to tie their whole economy into one cellphone manufacturer ",
        "Why does he sound so much like Andrew Tate. ??? ",
        "Focusing on the tertiary sector is key, all high income nations have services especially in the tech industry.\nThose nations who have resources will forever be cursed as foreign and third parties will create wars and conflicts which will lead to instability, why else do you think Africa the most resourceful continent in the world is still poor? obviously other than corruption lol \"corruption\" there is a lot more to it than most think.",
        "That's the most insane inheritance tax I have ever heard of! I am surprised people are ok with that.",
        "4:04 For the industrial expansion is necessary a lot of money. One point that nobody explain when explain about the expansion of Korean industries from the poverty, is the origin of such money. \nThis video doesn’t explain too.",
        "Doctor and lawer are the most wanted job for hard working students in korea. Not so different to other countries.",
        "To all Crypto Investor:\nAxie Infinity(Defi Game) is gonna pump in the next few months because of their upcoming update.Invest now. God Bless us all investors.",
        "Why can't Half As Interesting + Real Life Lore present clips just as calmly & normal energy?",
        "The core of South Korea's power is United States. \nStronger, Together.",
        "이게 왜 갑자기 떴는지 모르겠다. 난 영어 모르니까 한국어 자막 내놔",
        "The second Korean Lee Dynasty",
        "Yo this is straight up villain shit, late stage capitalism is fucking depressing",
        "As a Korean. America seems like a heaven the best country. American are crazy to think their country is bad and some reason think Korea is a great place to live. Thank you for this channel for accurately pointing huge facts. ",
        "Reminds me of Night city from cyberpunk lol",
        "Kingdom of samsung.",
        "This was a great one man. Incredible how the \"SAT\" in South Korea is literally a corporate test. Says a lot about their grip on the country.",
        "I think a lot stuff you say as negatives have actually been positives for the country. Rocky land scape to the north, basically the only reason they have a country today. Coal reserves not bad for size of country actually. And being wedged between super powers in the past was a negative but now China provides cheap labour and a massive market same with Japan. The Korean  economy is as big as it is today because of location and American capitalism ideologies.",
        "Wendover: \"Corporations can't run countries\"\n\nThe upcoming cyberpunk dystopia: bet",
        "I recently played a Victoria 3 game of Japan and built my economy significantly by clothes exportation to France, it worked really well for a while and I got to build some really big clothes factories. At some point I tried canceling just this one export and my economy got hurt a lot because the sudden overproduction damaged the bloated supply chain beyond belief. ",
        "Interesting topic. Not long ago I visited South Korea and I couldn’t help to notice how fast things are being built and how modern the country is. When I did a little research I was stunned when I found out how much Samsung has invested in the country.",
        "Well i'm honored to own one of ur newly created devices!",
        "Maintaining control. (12:40)\n3:55 Military-industrial complex. \n7:00 Ticket to success.",
        "I sometimes half-jokingly refer to South Korea as \"Republic of Samsung Korea\"; likewise I sometimes half-jokingly refer to their presidential position as \"the President and CEO of Samsung Korea\".",
        "I can't blame them for trying to keep what they built.  Seems like the cronyism, and corruption could have been avoided if the state was less greedy with their extortion.",
        "Poisonous West attacking samsung",
        "This video is incredible. I actually was there in Korea as a teacher when much of this went down, but as a foreigner who only spoke limited Korean, I certainly didn't get the whole story. But what I did get was a lot of interesting \"trickle-down\" information from strange sources...",
        "nothing more refreshing than rich ceos getting away with anything they do just because why not",
        "Good video, but currently the most desireable firm to work at in South Korea is probably Kakao"
    ],
    "comments_disabled": false
}