{"video_id": "pBIGdw-BRxw", "comments": ["This honestly feels like a different movie than Magic Mike like just a random Channing Tatum movie.", "Magic Mike XXL is one of the greatest road movies ever and the fact that the gang isn't in this movie (or probably just have a cameo) is criminal.", "Feels like Step Up/Magic Mike. \n\nGood to see Channing showing us how talented he is on his feet. ", "What ? This is far fetched. I liked the humble gritty vibe of the first 2 . Now it’s a big theater production. Nothing will ever be as raw as Channing dancing to Pony ! That was the best thing I’ve ever seen. Period", "I'm gonna go see this for Salma Hayek. She's always wanted to do a movie like this, and this is just as much a passion project for her as it is for Channing.", "Salma makes me believe a woman can have whatever she wants, whenever she wants ", "This pure magic, can't wait to see it for once! ", "I love how Salma says she is amazed how her career is on fire at her fifties, when she thought it's going to decline. Girl, you look great for a 55 years old here. Can't wait for watch it!", "Words cant describe how much I love this collab", "I love that they have actual dancers from the Magic Mike Live shows in this. Shout out to Patrick Packing.", "I liked it. This is due to the success of the real-life live Magic Mike show that is in Las Vegas right now. The quick clips of the guys dancing on the stairs and the hostess dancing are taken straight from the Magic Mike live show for anyone who has seen the show in person or the recorded clips from audience members that have floated around on here. They extrapolated everything and it has culminated in this. Channing and his business partners did it. Now, this is the \"what if\" Channing's character, Mike Lane achieved the same thing. Perfect for Valentine's Day.", "This is fantastic news! Glad to be a part of this community and its awesome to see so many people coming together to help others. Mad props to Charlie and everyone who donated to help those who are unfortunate get back to living an actual life! You guys are awesome! :O", "Not gonna lie. This looks good and I'm here for it!! Missing Matt and Joe though!! And Salma is still a baddie omg!! She's super humble and hilarious in real life. I wonder if she gonna do her routine from FDTD in this?? Come through girl!!", "Salma Hyek is gorgeous and such a good actress. There's passion in everything she does. Channing Tatum, you are a lucky guy for sure. Will absolutely watch this on the big screen.", "Nothing can beat the first movie all I have to say", "The trilogy we didn’t know we wanted… but the trilogy we always needed. ", "Who was wanting it to be\n\n\"STEP UP! the last dance ", "O triste é que eu gostaria tanto de participar de um Magic Mike algum dia, Mas foi um prazer ver os filmes.", "You helped me through 4 days in the hospital during a recent vacation trip last week. Was really depressed, thanks for always bringing consistent fun content from the community and your team.", "Can't wait to watch.. Although I loved the first two much much more.. Hopefully this one will be just as good.. Channing Tatum you are a talented actor.. Hope to see you in many many more movies not just in Magic Mike..", "The franchise is going to go out with a bang at least", "Damn even at 56, Salma Hayek makes my mouth water and she's my moms age ", "Feel like this is gonna be a little more serious than the second one, and I'm here for it", "I mean... I am just going to watch this as an excuse to see Channing Tatum dance.", "Feels like Step Up/Magic Mike. \n\n\n\nGood to see Channing showing us how talented he is on his feet. ", "Can't wait to see more rages to all new and some of the same things that make jev furious, speechless and downright baffled as he makes amazing reactions.", "Finally they just making this sequel after second one.", "Caraaaaaaaaaaca\nO mais esperado.\nSem palavras. ", "The best & most realistic franchise since The Godfather films.", "Not what I was expecting this to look like (at all), but I trust Soderbergh & Tatum will deliver an adventure! Definitely missing BDR, though !!!", "Sounds exciting. Can’t wait to watch it", "This is the first movie trailer that made me watch more than once", "Yesssssssss I love it!!! Something for us ladies to enjoy!", "Salma Hayek LOOKS AMAZING!  The lady that shook me in Dusk til Dawn!", "We already know this is gonna be a 1Million+ view BANGER", "Taking out the originals guys is like when Pitch Perfect took out the Treblemakers. No Matt Bomer!", "Omg this looks great! Can't wait to see it!!!", "Salma hayek 🇲🇽🇲🇽🇲🇽 lo maximo", "I remember watching magic Mike when I was just a toddler so many great memories sad to see Mike leave ", "Haven't seen XXL but I actually loved the first Magic Mike. Sure this film seems to be missing the ensemble but it seems like a neat character dive story into Mike's life while also having elements of a dance musical. I'm down for this (heh)", "Missing Joe Manganiello and Matt Bomer. Still this looks good!", "Definitely happy for those who want to watch the final Magic Mike film. ", "I’m legit excited for this.", "Damn can’t believe Magic Mike made a comeback!", "Just finished the first two movies and came here to watch the trailer", "I'm rewatching all his videos now that he has passed and that ending just really hits different. \"I'm free.\" The Great Potato War is what I believe is the ultimate display of Techno's true capacity in scary intelligence and shocking talent. His remarkable characteristics have made him so unique and embroidered in most everything minecraft by now. Mad respect. RIP =3:) B-) B)", "Can we just appreciate how all his random roles videos are exactly 15 minutes long.", "Salma Hayek is coming for that Oscar", "Channing is one of the sexiest men in the world and he’s so talented. He’s incredibly gorgeous and a great actor", "I heard there will be a full frontal scene here  Hopefully they're actually gonna show it in it's full glory and clear and not just like a quick shot of it or a shadow of it .", "I've never been single and looked forward to Valentine's Day like this ", "This looks like the best one yet!!!", "Can we talk about how GOOD Selma still looks! Get it girl!", "Cory works so hard to put youtube vids out as consitantly as he can, and its really cool that he's even giving a double upload. Never change Cory", "this franchise knows its audience very well ", "53, feeling washed up (as you do)  and then in comes Salma Hayek, (who is just gorgeous, talented and such a fun lady) and suddenly, you believe her, you really can have it all  Channing Tatum is an amazing dancer, hollywood hot guy and this film looks worth a watch   (loving the London vibe too)", "Can't wait to see it ", "Finally , i was waiting for this trailer", "So Mike gets Salma Hayek as an upgrade?! Inconceivable!!", "I'll just watch it because Salma is there ️", "Hi Chan, \nI couldn’t wait to share this with my bestie but she beat me to it! ", "A Magic Mike I would finally watch.", "Damn..this movie looks good like, really intrigued to see how it all ends", "My god…I can’t wait! ", "Wow.... This is going to be ,a production!!!!!....", "Hope it’s in 3D only way i would go to cinemas to see it", "I'm thrilled that you chose an older woman like Salma Hayek to be the leading lady", "Can’t wait for Magic Mike to be a Heist Film in the near future like Fast & Furious did", "Channing Tatum is always gonna be my #mancrush forever ️", "The first was... fine. XXL was this absurd, road trip hangout movie that was way better than it had any right to be. Not sure which way this one is gonna go.", "Can’t wait! ", "I hope Mike's crew comes back", "I can’t wait to see if the trailer is awesome️️️️️", "My girl said this trailer did not grab her at all like the others.. we both said it seem more like an actual Step-Up Sequel than a Magic Mike film.", "Omfg SALMA HAYEK is  Can't wait to see this", "As weird as this might sound my fiancee loved these movies but unfortunately he's passed away. So I'm gonna have to watch this for him.", "The trailer is this hot can't freaking wait for the film!!! Whoot Whoot!!!", "I can’t wait ️", "CANT WAIT TO SEE THIS REMAKE OF SISTER ACT !!!!!!!", "They had me at SALMA HAYEK!! lol :D", "I’m low key hoping this is just being advertised as a Magic Mike movie, but it’s gonna be revealed to be a Step Up sequel. It felt more SU than it did MM", "I love your videos, Salma!", "I love Channing Hes a good actor and good movies , He has ,Very Handsome smart and sweet ", "Lovely to hear Donna Summer on Last Dance - Academy award winning song", "This trailer woke me out of a coma.", "I honestly love these movies haha", "I didn't know that this Franchise was owned by WB", "This woman is breathtaking", "I'm here for the private dance and nothing more. As a bisexual woman, it's all I need ", "Hey, why isn't this in 3D? Or in  IMAX for that matter?  ", "It's always the last of everything but It never ends. The pain never stops. Lol good luck out there.", "Wow!  Feck yeah, I'm ready. I loved this trailer, and I for one am very glad it looks different than the original. Loved it too though!", "“Whatever she wants, whenever she wants” is noting anyone should get, no matter what gender.", "I'm just glad to see my boy Channing again lol", "The one movie men don’t want to see but will probably see on V-day because we’re too lazy to plan a better date…", "I’ve never seen any of the Magic Mike movies but this trailer looks interesting", "I love Salma Hayek", "Perfect ", "this is like a proper sequel to Step Up lol", "Man I remember when the 1st movie came out I was fresh at 20 lol"]}