{
    "video_id": "pBIGdw-BRxw",
    "comments": [
        "",
        "The franchise is going to go out with a bang at least",
        "Actually, the real question is, \"Where is Joe Manganiello?\"",
        "Haven't seen XXL but I actually loved the first Magic Mike. Sure this film seems to be missing the ensemble but it seems like a neat character dive story into Mike's life while also having elements of a dance musical. I'm down for this (heh)",
        "So... Step Up. You're turning this into another Step Up installment. \n\nNot the direction I thought this would go but okay, I guess.",
        "They should have cast Danny Devito in the title role. He could reprise his ‘friends’ character of the over the hill stripper.",
        "What ? This is far fetched. I liked the humble gritty vibe of the first 2 . Now its a big theater production. Nothing will ever be as raw as Channing dancing to Pony ! That was the best thing Ive ever seen. Period",
        "Magic Mike just conceived Step Up ",
        "Oooooh snap",
        "We just want to see Salma Hayek dance again ThankYou for this!",
        "This is fantastic news! Glad to be a part of this community and its awesome to see so many people coming together to help others. Mad props to Charlie and everyone who donated to help those who are unfortunate get back to living an actual life! You guys are awesome! :O",
        "Perfect ",
        "Is it just me who felt weird that this movie actually looks good? ️",
        "Got IT! Genius alert!",
        "“Whatever she wants, whenever she wants” is noting anyone should get, no matter what gender.",
        "Yawn",
        "With the backwardness of our economy, increment in the price of gas, alarming rates of unemployment.i must confess our country have taken a wrong turns.vividly I don't know how else to carter for my expenses",
        "That's my Love This Is Like Another Movie Like His others I Feel My Chan Was Only Used In This Movie To Get High Ratings... So people would see it..\n\nIt's nothings like the Magic Mike Movies .It's more like a movie  Where They Always Get Him To kiss some woman be involved some woman Any one Think it Selma's  Film Not His At All or magic milke stories ",
        "Unnecessary sequel is always bad",
        "Can we talk about how GOOD Selma still looks! Get it girl!",
        "Leave off the Magic Mike brand, then this can be a good film",
        "Cowabunga! Go on there Man like Magic Mike ",
        "This should have been a Magic Mike Christmas instead. Did Harold and Kumar teach you nothing?",
        "Magic  is really amazing show ever I really think it's really interesting  it's the best show ever I really love it already is incredible character ever I really think it's really awesome ever I really can't wait to see it on my antanal tv show is definitely cool ever nice ",
        "Ohhhh…\nIt’s the movie NOBODY HAS BEEN WAITING FOR…. ",
        "Hide the women and put the children to bed because the Gigelow is back!",
        "ugh why did they have to put her in",
        "Should’ve been step up all grown up",
        "i miss the 80s and 90s when movies were REAL and not 20 dollar a ticket whole theater showing money grabs to brag about the biggest movie ever.\n\nmovies now are utter GARBAGE",
        "This will be my first time watching this movie",
        "Magic Mike’s Last Dance - should be renamed to: Magic Mike’s: Let's Dance",
        "Channing Tat-yum is back in the game. Man crush since Step Up",
        "Wow!  Feck yeah, I'm ready. I loved this trailer, and I for one am very glad it looks different than the original. Loved it too though!",
        "Hope it’s in 3D only way i would go to cinemas to see it",
        "Salma Hayek is 56 and hotter than most women in their 20’s!",
        "Big L",
        "Pls coming evil dead rise trailer",
        "Omg this is so cringe and not magic mike",
        "Warner Play salve e Save",
        "Looks mire like PITCH PERFECT: STRIPPERS EDITION",
        "\"A woman can have whatever she wants, whenever she wants\".  What a delusion. That doesn't happen for anyone.",
        "Selma Hayek ",
        "This looks awful. She’s way too old for this part. No thanks.",
        "DÁ DESCANSO PRO VEIO",
        "I hope they made it better than the test screening I saw.",
        "More like step up than magic Mike ",
        "Damn..this movie looks good like, really intrigued to see how it all ends",
        "Steamy!",
        " Buddy has no clue at the end Good luck  with her",
        "Ok that Cop comment was so damn on point!!!",
        "Почему Оксимирон на превью?",
        "Nothing can beat the first movie all I have to say",
        "Feels like Step Up/Magic Mike. \n\nGood to see Channing showing us how talented he is on his feet.",
        "I hate the whole dance routines but \nJust strip for me damn lol wtf",
        "Best movie of 2023.",
        "I made my mind up at 5 years old. Nothing is going to change it.",
        "I'm gonna go see this for Salma Hayek. She's always wanted to do a movie like this, and this is just as much a passion project for her as it is for Channing.",
        "I'm rewatching all his videos now that he has passed and that ending just really hits different. \"I'm free.\" The Great Potato War is what I believe is the ultimate display of Techno's true capacity in scary intelligence and shocking talent. His remarkable characteristics have made him so unique and embroidered in most everything minecraft by now. Mad respect. RIP =3:) B-) B)",
        "Words cant describe how much I love this collab",
        "This looks more like a step up movie than a male stripper movie this time around.",
        "Unexpected cast choice)",
        "“What are most excited about in the new Magic Mike sequel?”\n\nMe: Yes",
        "Time to learn some more dance moves. ",
        "no",
        "heard nothing about this film. im SHOCKED. last i heard of magic mike, it was a broadway show and tatum was in court fighting his ex wife over the rights",
        "Amazing!",
        "Doesn’t feel very “Magic Mike” without the gang\nI’mma wait til it’s on Prime video or Netflix️",
        "Hey, why isn't this in 3D? Or in  IMAX for that matter?  ",
        "Enough of the prequels, sequels….it’s getting pathetic! Come up with something new!",
        "Always remember: In the span of 10 months, he was suffering, feeling pain like probably no other, yet he still entertained us. While 6 videos is not that much, its at least something. Techno is in a better place now. >:O",
        "Who was wanting it to be\n\n\"STEP UP! the last dance ",
        "You can't get enough of Grizzy's screams. >:-O",
        "notice how they said third installment & not third & final installment like how they did with Fifty Shades",
        "I’m low key hoping this is just being advertised as a Magic Mike movie, but it’s gonna be revealed to be a Step Up sequel. It felt more SU than it did MM",
        "Omfg SALMA HAYEK is  Can't wait to see this",
        "Idk, this isn't going to be a popular opinion however not here to make friends lol, but the 1st 2 majik Mike's were gritty, raunchy, & down right dirty,. This looks like it's dumbed down into a Disney production of a pg 13 slightly dirty version of Cats lol.  Seems that's all they make these last 10 years are pg versions of semi good movies/TV shows  lol",
        "this franchise knows its audience very well ",
        "They had me at SALMA HAYEK!! lol :D",
        "I love Channing Hes a good actor and good movies , He has ,Very Handsome smart and sweet ",
        "The beginning of this trailer looked like a 007 action movie",
        "This looks so bad",
        "Chanining reminds me of this weho mean girl used up more than a pink slave prison freeway.",
        "I don’t know but I’m here for hot Salma Hayek. Look at her Holly Lord she’s breathtaking omg",
        "more like new step up movie trailer ?",
        "Looks hot !!️‍",
        "What is this? This ain't magic mike lmao",
        "Oh lord NO! This gives me “step up” vibes (the awful sequels) ",
        "Won the cinema.",
        "This will be awesome",
        "am i the only one who’s seen the clip where channing tatum said he didn’t wanna do another magic mike movie because he didn’t want to have to be in crazy shape?",
        "Feels like another step up movie…",
        "Yeah it doesn’t feel like magic mike without the rest of the crew.",
        "Poda podi ",
        "Yessss",
        "Wow....",
        "::::::::: The Beginning: Chapter 2: The Last Dance: Resurrection: Dynasty: Requiem: The Final Chapter: Part 2",
        "The fact that the gang from MAGIC MIKE XXL dont appear in the film, even in the last scenes or dances as Mike's friends, says a lot about tha talentless writers & directors. PERIOD.",
        "The trailer is this hot can't freaking wait for the film!!! Whoot Whoot!!!",
        "Who else was taken from the video they were watching and got here ",
        "Fantastic! As women are becoming free to pursue men as well, as female lions do, we rid ourselves of burdening brainwashed gender labels, and become free to pursue true mutual real connections with passion and love and where men are also appreciated for their beautiful warrior like aesthetic attractiveness. Love saves the world. Everybody wins.",
        "Magician Mike",
        "Man Channing got two older woman on screen.",
        "Oh my ",
        "Feels like Step Up/Magic Mike. \n\n\n\nGood to see Channing showing us how talented he is on his feet. ",
        "Why am I getting \"Stayin' Alive\" vibes from this? Oh yeah, this also looks like an over-produced stage show as an excuse for a sequel",
        "I've never been single and looked forward to Valentine's Day like this ",
        "Of all the movie franchises they gender swap... How about this one?",
        "I know he melted working with Selma Hayek",
        "I feel bad for all the movie seats.",
        "Where’s Kevin Nash?",
        "Since they go to London I hope that Tom Holland appears in this too.",
        "This movie combines the plot of Elvira mistress of the dark and his movie step up",
        "first Magic Mike is always legend",
        "Channing Tatum to me is THE Brendan Fraser of the 2010s and 2020s.",
        "Omg ",
        "This is the trailer for Step UP. Lets be real. hahaha",
        "Well, now I can’t finish work.",
        "@1:56 OK, who is THAT",
        "This looks NOTHING like magic Mike. More like Step Up",
        "Originally it was a buddy movie. Where are the friends?",
        "Omg can’t wait bring it on February",
        "Lol what a horrible movie",
        "I think I might see this🫶",
        "Yes yes,!",
        "I can’t wait ️",
        "I liked this better back when it was called Flashdance",
        "Salma channing",
        "I'll just watch it because Salma is there ️",
        "Where's the old team...?",
        "Only men on stage, please!",
        "Amber heard missing",
        "Super WOW!",
        "Yeah they should of stopped after Magic Mike XXL",
        "It's always the last of everything but It never ends. The pain never stops. Lol good luck out there.",
        "So:  Gambit & eternal Ajax go to London to clean up Nick Fury & Peter's mess from FFH. \n\n\nCopy that",
        "Um, looks good but where are the other guys?  They made those other films fantastic!",
        "so cheezy.",
        "I don't feel this is Magic Mike, there is no vibe at all, it looks like an excuse to promote Magic Mike Live! They should come back to the part where the first Magic Mike ends. Magic Mike is like Tony Manero in Saturday Night Fever, there is drama and he doesn't need to win or feel that he is the winner. For me, the spirit is gone!",
        "Very disappointing, too much feminism ofc lmao",
        "Lame",
        "Wtf is that",
        "Aphmau is finally her true size",
        "Wow.... This is going to be ,a production!!!!!....",
        "This feels more like they tried to merge Step Up, Dirty Dancing, and a Broadway play together. This isn’t Magic Mike. This is simply a cash cow ",
        "No pony, no good",
        "Are. You. KIDDING?!",
        "Wooooow",
        "YEAHHHHHHHHH",
        "Step up last dance",
        "Yesssssssss I love it!!! Something for us ladies to enjoy!",
        "greatt !!!! why did it take soo much time to make another part of this movie franchise",
        "Wow Salma she looks Amazing",
        "This looks great but I mean steven soderbergh is an amazing writer",
        "Where is the wb logo?",
        "Selma’s body!",
        "I’m legit excited for this.",
        "Imagine wasting money on this pile of trash. What has the world come to.",
        "Doesn't seem good does not seem like a magic Mike movie",
        "Channing Tatum should play Superman",
        "1:09 Is her Rosalía?",
        "I heard there will be a full frontal scene here  Hopefully they're actually gonna show it in it's full glory and clear and not just like a quick shot of it or a shadow of it .",
        "This feels like a step up sequel lol",
        "Come Channing, stop wasting your talents",
        "Step up with Mike magic",
        "She replaying her studio 54 memories! Where is Mike Meyers? Hahaha",
        "My girl said this trailer did not grab her at all like the others.. we both said it seem more like an actual Step-Up Sequel than a Magic Mike film.",
        "what is this...? 50 shades of Mike?",
        "I don't know why some of you are complaining about BUT I really enjoyed the trailer and I'm excited for the movie.",
        "Is this really a Sodeberh Movie?",
        "Never seen the other Magic Mike movies.. but this one has Salma in it so I might give it a shot (watch it) \n\nPlus.. people saying this has Step Up (first movie) vibes.. and I liked that movie :D",
        "It's like Magic Mike meets Step Up. Idk how I feel about this.",
        "Salma Hyek looks amazing but somehow as a massive Magic Mike fan I have no desire to see this. It reminds me of 'The Greatest Showman' rather than MM.",
        "Please!!! Not another Mike's garbage movie!!!!!!!\n️",
        "Damn can’t believe Magic Mike made a comeback!",
        "Salma Hyek is gorgeous and such a good actress. There's passion in everything she does. Channing Tatum, you are a lucky guy for sure. Will absolutely watch this on the big screen.",
        "Wowwwww",
        "Lovely to hear Donna Summer on Last Dance - Academy award winning song",
        "More like a Step-Up than Magic Mike.",
        "Salma Hayek ",
        "My god…I can’t wait! ",
        "Feels more Step Up than Magic Mike... anyone else?",
        "I love how Salma says she is amazed how her career is on fire at her fifties, when she thought it's going to decline. Girl, you look great for a 55 years old here. Can't wait for watch it!",
        "Hearing smii7y scream in agony just makes my day better",
        "Is this the last one",
        "I thought he just wanted to make furniture, what happened to his furniture dream, are you too good for your dream, Mr. Dancey man?",
        "Too bad Mr. Tatum and Mr. Pettyfer (Adam) didn’t get along in real life.  I became a Fan of Alex Pettyfer after the first one, he’s a great Actor.",
        "This is hilarious ",
        "When I went to make strip club in Hollywood it make me happy and see a man",
        "No Matthew McConaughey No Party",
        "Yessssss pooh   ",
        "Im still waiting for his Gambit movie",
        "채닝테이텀....기대",
        "I'm just glad I actually got to have a real lap dance from \"Taylor Cole\" from LaBares, who Tatum's character was based on in the first movie.  Being a Latina myself, this movie looks awesome!",
        "21 Jumpstreet meets Black Swan on Broadway in a theater near u sOOn",
        "What's next? Step Up: Step Beyond?",
        "Is that Selina singing Last Dance?",
        "OH DIOS",
        "We already know this is gonna be a 1Million+ view BANGER",
        "So, this is what Burlesque would have been with a bunch of dudes.\n\nCool.",
        "Is this step up or magic mike?!",
        "Only seeing this off the strength and beauty of Salma Hayek",
        "A Samuel Pinault no le gusta esto. ",
        "This is not \"meet cute\". This is \"meet hot\"!",
        "Taking out the originals guys is like when Pitch Perfect took out the Treblemakers. No Matt Bomer!",
        "The only context I have ever seen of this movie is from conan o Brian, it still looks pretty dumb",
        "At least Zaslav rescued this one from a forgettable streaming release to a full blown theatrical release",
        "Way to go Salma!!!!!!!!!",
        "Can we just not?",
        "I'm here for the private dance and nothing more. As a bisexual woman, it's all I need ",
        "Salma makes me believe a woman can have whatever she wants, whenever she wants",
        "Is this Magic Mike or Step Up 1.5?",
        "Honestly feels like a money grab, incomparable to the original movie!",
        "I'm glad they got rid of that other girl",
        "Wouldn't be shocked if the next one is called \"Magic Mike Goes To Mars....\"",
        "\"I let you off w a warning right?\" ahahahahahaaaaaa. Right.",
        "感覺一定很好看",
        "Well another strong wah-man movie....its funny.....Salma Hayek's character in the trailer states why can't a wah-man have it all....love and money....when its clear she marry for money in real life...Don't think so ?...well ,then google her husband and the decide for yourself if money was/wasn't the main factor in her marrying her husband....just like Howard Stern has been has been trying to convince himself and his audience  for years that his wife didn't marry him for his fortune and fame....This trailer is great for reinforcing this lessen when it comes to wah-man...don't listen to what they say ....but rather focus on their actions to reveal their true selves/intentions .......Wah-man rarely say what they mean...just what they think people want to here(PC)",
        "Dudes old now. Sheesh",
        "Step up 6? Or Magic Mike?",
        "this doesn’t feel like magic mike but okay",
        "You helped me through 4 days in the hospital during a recent vacation trip last week. Was really depressed, thanks for always bringing consistent fun content from the community and your team.",
        "Here we go again... What is wrong with Hollywood!",
        "He's over 40...let's let him rest.",
        "CAAAAAAAMMMPPPPP",
        "Omg this looks great! Can't wait to see it!!!",
        "The thumbnail and the fact it’s called “Last Dance” gave me “Logan” vibes.. like I was about to see a grizzled Channing Tatum throw it back to Johnny Cash’s “Hurt” ",
        "Magic Mike: Unplugged",
        "He got more chemistry with Jada Pinkett... 0 with Salma Hayek.",
        "It says magic mike but the whole trailer feels like step up",
        "️",
        "Are any of the previous guys coming back? Like at all? Anyway Salma looks great. Looking forward to seeing her on this",
        "Looks like musically I don’t like it",
        "Half step up half magic Mike",
        "Seriously… Steven Soderbergh directed this?\n looks NOTHING like a Soderbergh film… lol. I’m kinda shocked lol.",
        "Feel like this is gonna be a little more serious than the second one, and I'm here for it",
        "️️️️️️️️️️",
        "Sounds exciting. Can’t wait to watch it",
        "Nah ",
        "Soderbergh is the greatest director alive",
        "A wave of passion... eventually we're all gonna laugh about all this obsession with passion.",
        "He literally only made this movie to hook up with Salma ",
        "So Mike gets Salma Hayek as an upgrade?! Inconceivable!!",
        "Salma ",
        "Salma Hayek LOOKS AMAZING!  The lady that shook me in Dusk til Dawn!",
        "Step Up 1 : The Strip Edition",
        "Not what I was expecting this to look like (at all), but I trust Soderbergh & Tatum will deliver an adventure! Definitely missing BDR, though !!!",
        "I wanna see this souly to see salma shake those hips that dont lie\n\nAlso if we are gonna get one last channing tatum movie for the year it should be step up. I know the year is 1 month away from being DONE but for 2023 he should go back to his roots and create an epic step up 6 installment. Get all the OG dancers, everyone from each movie even and just sign it off with a bang since hes old. After that some other noob can take over the franchise and spin it like a draddle, until then channem please PLEASE give us another step up movie. You have 90 days to respond or else",
        "Honestly, this feels more like a Step Up sequel.",
        "Nah",
        "I caught my mom watching Magic Mike",
        "Feel sorry for the people working in the Cinemas when this comes out. Heard all kinds of horror stories when 50 Shades of Grey was in the Cinema.",
        "This has a very different vibe than the last two Magic Mike movies. The music and editing try to add excitement, but the actors look distinctly tired and dispirited by the whole endeavor.",
        "Last thing we needed",
        "We want 23 jump Street",
        "Gambit and Ajax in another universe.",
        "How can I dance like this",
        "No shade, but this trailer made me not want to watch this movie. It's honestly like the fast and furious season when they made movie about streetcar racing into a band of misfits that work for the government, this story came out of nowhere. I get the meaning behind going this direction, but it's not interesting to me. And the fact that Channing looks so uninterested the whole time ...",
        "Incredible",
        "I love me some Magic Mike but where TF is Joe?",
        " LETS GO!! ",
        "Wait... another one??? Yes PLEASE. I need this in my life xD",
        "Magic Mike and Step Up put together!!",
        "lol.  what a joke.",
        " y los demás bailarines? Me refiero a los de las precuelas? De todos modos la veré ",
        "yeaahhhh. Uhm. Not feeling it.",
        "This is Basic magic Mike meet moulin rouge ",
        "Louis CK just called his wife to take the kids for an extra couple days.",
        "This pure magic, can't wait to see it for once! ",
        "Can’t wait! ",
        "The trilogy we didn’t know we wanted… but the trilogy we always needed. ",
        "Seriously?\nAnother magic mike movie?\nNo guy wants to see this!",
        "The trilogy we didnt know we wanted but the trilogy we always needed.",
        "Step Up X Magic Mike",
        "Game is unexpectedly harder than the counterpart because you have to know SHORT words, and you forget most short words.",
        "“I want every woman that’s walks into this theatre to feel that  a woman can have whatever she wants, whenever she wants.” That’s a pretty double standard this film is trying to put forward, especially if a male character said it about Men.",
        "Revivió el Cine",
        "Looking forward to watching some slick choreography that showcases Channing's talent.",
        "As weird as this might sound my fiancee loved these movies but unfortunately he's passed away. So I'm gonna have to watch this for him.",
        "CALLED FREE WILL....I DID GIVE IT TO GOD \" AND LET GO....",
        "It's so cool that instead of using some Beyonce, or some hip hop artirst they go with classic Last Dance by Donna Summer",
        "Salma makes me believe a woman can have whatever she wants, whenever she wants ",
        "Magic Mike enters the Multiverse",
        "Release this in 3D please!",
        "Girl…",
        "Snore",
        "Can we just appreciate how all his random roles videos are exactly 15 minutes long.",
        "what no joe manganiello???",
        "get ready some tissue because single women are gonna wet themselves ",
        "Where’s the crew?",
        "WTF",
        "The boys are not in town. Its more like \" Step-Up Mike\"",
        "Where’s alright alright @",
        "nope",
        "I was waiting for Ginuwine's song \"Pony\" to be played in the trailer or something.",
        "That last sentence is saying Me this is gonna be a woke disaster",
        "Is it just me or do this feels more like a step up movie just Just being honest this should’ve been step up not Magic Mike",
        "I hope Mike's crew comes back",
        "LAMEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE LMAO!!!",
        "50 shades of Magic Mike",
        "Hey, it's The Gimp from This Is The End!",
        "This is the first movie trailer that made me watch more than once",
        "Absolutely should not be lumped under the title magic mike, this whole trailer had more of a plot than the last 2 combined.STOP IT! this is not why we watch magic mike",
        "he seems so disinterested in this movie with his acting lol",
        "So sad to see that his furniture business apparently failed ",
        "Finally , i was waiting for this trailer",
        "What ? This is far fetched. I liked the humble gritty vibe of the first 2 . Now it’s a big theater production. Nothing will ever be as raw as Channing dancing to Pony ! That was the best thing I’ve ever seen. Period",
        "I think it's great that they're giving a free pint of Ben & Jerry's, a cat and a box of tissues to every woman who goes to see this on Valentine's Day.",
        "Багз бани я скоро саказал кинго файтер хадкорный и веселенкий и качественый",
        "Quello è Sebastian!!",
        "This is the most glorification of stripping I’ve ever seen",
        "No big D or Tarzan? I'm out",
        "Magic Mike Step Up part 7!!!",
        "\"that a woman can have whatever she wants, whenever she wants\". I don't want to judge anything prematurely but i cant be the only one who feels that something's very off with movies these days. e.g. Dont worry darling, SHE HULK(i know its not a film) etc.",
        "Can't wait to watch.. Although I loved the first two much much more.. Hopefully this one will be just as good.. Channing Tatum you are a talented actor.. Hope to see you in many many more movies not just in Magic Mike..",
        "Step Up: The Last Dance ",
        "Channing is one of the sexiest men in the world and he’s so talented. He’s incredibly gorgeous and a great actor",
        "This lucky basta....rd...",
        "Oh yeahhhh",
        "Can you guys and New line cinema and platinum dunes please have michael bay,brad fuller,and andrew form on gettin back together with Samuel Bayer and Wesley strick and Eric heisserer and Steve Jablonsky and the rest of the crew and try to talk to Warner bros and New line cinema and platinum dunes on having them reviving/making a sequel to a nightmare on elm street 2010 and title it a nightmare on elm street 2 freddy's return and it should bee about nancy is now a paitient at westin hills hospital for years with 13 others who also have been dealing with freddy in the past and when freddy kuegger begins stalking thee occupants of the mental hospital it up too nancy and quentin to stop freddy once and for all!!!!!!!.............................Ps the story about 13 others that who are with Nancy in thee mental clinic asylum hospital that they use to be 16 of them but Freddy Krueger killed 3 others along thee way and they were students and victims of Freddy Krueger too and please make the sequel elements similar to a nightmare on elm street 2 Freddy's revenge and a nightmare on elm street 3 dream warriors and please make the sequel now and release it in 2025 but if you guys can not release it in 2025 then u have my full permission to release it in 2026 then And also make a nightmare on elm street 3 and title it either a nightmare on elm street 3 dream fighters or a nightmare on elm street 3 dream masters or whatever and still have Rooney Mara and Kyle gallner and Jackie Earle Haley and possibly Clancy brown reprise there roles and make the sequel elements similar to a nightmare on elm street 4 dream masters and a nightmare on elm street 5 dream child and Freddys Dead the final nightmare and Wes craven the New nightmare and release that in 2028 but if you cannot release that in 2028 then you guys have my full extended permission to release that in 2029 then and also my ideas for a nightmare on elm street 2 Freddy's return and a nightmare on elm street 3 is too add lots of nudity scenes and tones of drugs an alcohol scenes moments and lot of 3D graphics parts too",
        "What happened to you, Steven Soderbergh...",
        "This looks like the best one yet!!!",
        "Definitely happy for those who want to watch the final Magic Mike film. ",
        "A sequel no one asked for",
        "Salma hayek 🇲🇽🇲🇽🇲🇽 lo maximo",
        "Not her she's so old",
        "Awesomeness job",
        "Channing Tatum and Salma Hayek romancing and intimate, audiences are going to melt. Not seen previous movies but this feels like fun. You are cop, right? Did you arrest here? [Bachelorette flashback] Let you off with a warning, right? lol...",
        "THANK YOU GOD",
        "I'm Sooooo Going 2 see this next year️️️️️️️️️️️️️️‍️‍️‍️‍️‍",
        "This looks awful lol Step Up but for old people.",
        "This trailer woke me out of a coma.",
        "Eh, subpar ️️️",
        "The police were suffering from lag during this mission. The amount times they almost had him was absurd. ;-)",
        "Wow, easy easy, the last scene, damn it ^_^",
        "Iam from India 🇮🇳 and you",
        "Feel like 365 DNI stripper version",
        "Lmao this is so Staying Alive.",
        "Not the Same ",
        "ALSO LOVE SELMA HAYEK",
        "I find it hard to believe a man would take their woman to see this on Valentine’s Day. Cause if he does then he better be able to go to the stripe club with her after.",
        "If films have taught me anything. Isn’t it best to Save The Last Dance?",
        "Step Up: Last Dance",
        "6mil views 9k likes..",
        "3 years later Magic Mike After Last Dance",
        "Salma Hayek  can sure turnt up the dance floor with Magic Mike. ",
        "The police were suffering from lag during this mission. The amount times they almost had him was absurd.",
        "We wuz ....",
        "So, it just Channing in this one ? Everyone else just jumped out ?",
        "Salma Hayek es lo único bueno en esta innecesaria película....",
        "Wow amazing \nI can’t wait",
        "It’s like they wanted to take a Stripping movie and put it up against the greatest dance movies of all times. I never wanted to watch Magic Mike and I never planned on it but this movie I would actually watch.",
        "The one movie men don’t want to see but will probably see on V-day because we’re too lazy to plan a better date…",
        "I see more step up idk why",
        "Yo… The first sequel was unnecessary, but a third one is just insulting. Please stop making these.",
        "More like magic Mike show toons lol ",
        "Whoa !!! ",
        "Did the people cut this trailer watch the other magic mikes? Cause it doesn’t look like it.",
        "I can’t wait to see if the trailer is awesome️️️️️",
        "I'm thrilled that you chose an older woman like Salma Hayek to be the leading lady",
        "Sorry this is getting old  feast.",
        "CANT WAIT TO SEE THIS REMAKE OF SISTER ACT !!!!!!!",
        "Isn't that Tito's voice on the phone? \n\nThat would mean an uncredited cameo for Adam Rodriguez.",
        "So this was how the London show was created",
        "Can't wait to see it ",
        "I retire.. forever.",
        "Ugh, that last line from Hayek says it all. Another franchise where the male hero plays a supporting role in his own movie. Just stop, Hollywood.",
        "The only hope is Steven Soderbergh directing it otherwise it looks like tired Step Up sequel",
        "Is the woman in this supposed to be based off of his ex Jenna?",
        "I'm just glad to see my boy Channing again lol",
        "Fuckin'A! I'll be there!",
        "Yessssssss",
        "Not gonna lie. This looks good and I'm here for it!! Missing Matt and Joe though!! And Salma is still a baddie omg!! She's super humble and hilarious in real life. I wonder if she gonna do her routine from FDTD in this?? Come through girl!!",
        "This looks like a very elaborate commercial for the Magic Mike Live show  (no commercial needed, it’s a fantastic show, been twice )\nAnd I hate that they tried to incorporate a storyline into it like they did for the first one… why is it so hard to do what you did for the second one and just give the audience what we want? ",
        "Salma Hayek is coming for that Oscar",
        "This is confusing is this step up or lol",
        "Looks like a Hallmark production! Lmmfao!!",
        "Why??? This movie is going to make about $50 at the theater ",
        "Magic Mike 3 step up",
        "I love that they have actual dancers from the Magic Mike Live shows in this. Shout out to Patrick Packing.",
        "Wtf",
        "\"If you do what you always did, you will get what you always got.\" --Anonymous",
        "What's this .\nSAVE THE LAST MAGIC, Mike!",
        "IF He's dancing! Count Me In I'll bE watching~~~~~",
        "Channing is back bro.",
        "The issue with society is people do think they can have anything anytime. That simply isn't reality. And trying to sell them that has caused so much debt, pain, & suffering vs self acceptance and self reliance. Yeah it's a movie. But we have a real problem here in the real world.",
        "I love your videos, Salma!",
        "O triste é que eu gostaria tanto de participar de um Magic Mike algum dia, Mas foi um prazer ver os filmes.",
        "Finally they just making this sequel after second one.",
        "I really like Channing Tatum and Salma Hayek, but this movie doesn't light a spark in me  There is something missing here..",
        "Who was wanting it to be\n\n\"STEP UP! the last dance",
        "Who wanted this",
        "Women already can have what and whenever they want!\nWhat's new?",
        "he is one lucky dude though to do that with salma",
        "I liked it. This is due to the success of the real-life live Magic Mike show that is in Las Vegas right now. The quick clips of the guys dancing on the stairs and the hostess dancing are taken straight from the Magic Mike live show for anyone who has seen the show in person or the recorded clips from audience members that have floated around on here. They extrapolated everything and it has culminated in this. Channing and his business partners did it. Now, this is the \"what if\" Channing's character, Mike Lane achieved the same thing. Perfect for Valentine's Day.",
        "Imagine a movie, not to mention a trilogy, about female strippers...the hatred would be insane.",
        "Hi Chan, \nI couldn’t wait to share this with my bestie but she beat me to it! ",
        "I already know the name of Magic Mike 4! \"Magic Mike the Chinese Connection\"!",
        "Avengers: Endgame for 40 year old women",
        "Paused at 1:08. Not interested. Not going to watch.",
        "Where's everyone else?!",
        "I’ve never seen the other ones, will I be lost?",
        "Channing tatum really needs to broaden his acting portfolio...let's see what you've done Mr. Tatum..I see (group dance/poor romance movies) you have like 8. Comedy, 2 (which were better than all 8 dance movies) and nothing else.....I'm sure we'll give you a call when we decide the media wheel has come back around to the lame dance movie period again.",
        "Wtf am I watching ",
        "#savewarnerbrosanimation",
        "Salma is beautiful women ",
        "Missing Joe Manganiello and Matt Bomer. Still this looks good!",
        "Looks boring ",
        "So basically he finds a sugar mama that introduces him to The remaining cast of step up step…..",
        "are you guys ever gonna get my color right",
        "So....Full Monty meets Sing 2. Sure, why not.",
        "This better have Pony.",
        "Woke Mike movie",
        "they are changing it up .cool",
        "It would be interesting if Channing Tatum decided to release all three \"Magic Mike\" movies on DVD.",
        "Am soooo gonna watch this ...loved it !!!!  Channing and Salma ...goodness ",
        "Caraaaaaaaaaaca\nO mais esperado.\nSem palavras. ",
        "It is not the same Mike as the other2. Do not like his character in this one at all. Bummed.",
        "Feels like different movie without the gang",
        "Channing baby you can always get my money! Always!",
        "Magic Step Up lol",
        "But why tho the last two was horrible",
        "Avengers endgame for 40 year old women.",
        "A Magic Mike I would finally watch.",
        "At first it looked like Fifty Shades of Gray and then it looks more like a step up Meets Magic Mike and damn Mike guy goes through woman like first magic Mike he was with that guy sister and Magic Mike the second one he goes for another chick lol",
        "Mmmm pass on this one, seems like a musical or something . But XXL was the best one ever",
        "Why did y’all make Channing shave his head for this? He had such a nice head of hair.",
        "unbelievable boring",
        "O triste  que eu gostaria tanto de participar de um Magic Mike algum dia, Mas foi um prazer ver os filmes.",
        "I LET YOU OFF WITH A WARNING RIGHT",
        "Step up: the Magic",
        "I can not wait for this. But why do I feel like there's a message.  I wanna see the guys dance not her.",
        "Fifty Shades Of Mike ",
        "Since it’s in England they need to have Tom Holland come out and do a cameo where he does his umbrella dance or what was even the point",
        "I used to be a stripper so appreciate that this trailer looks the bollocks, pun intended  I'll definitely watch this movie man  Enjoyed the first too ",
        "a girl in my class name denise\nhas an obsession with this.",
        "I'm just sitting here asking myself: \"There was a second Magic Mike?\"",
        "we need 24 jumpstreet where he poses as an 8th grader",
        "Loll",
        "Can’t wait for Magic Mike to be a Heist Film in the near future like Fast & Furious did",
        "Hmmm feels different than the first 2 but I'll seeeeeee",
        "NICCCCEEEEE. GO FOR THE MAMA",
        "anybody remember the full monty?",
        "The Trilogy",
        "Wtf is this ",
        "I don't know, the first one was really good, I think the real story of the movie is lost, the essence of the movie is lost",
        "Cory works so hard to put youtube vids out as consitantly as he can, and its really cool that he's even giving a double upload. Never change Cory",
        "Pray for fluffy!",
        "RIP Channing Tatum's career",
        "Yessss ",
        "Where can I find such a dancer husband?",
        "No keep it how it is not some step up movie come on now. Really",
        "I’ve never seen any of the Magic Mike movies but this trailer looks interesting",
        " ｐｒｏｍｏｓｍ",
        "Now I don't have to see the movie ! Super cheesy.",
        "Are u sure this isn’t step up ?!?",
        "This is not the same it will not be good I will pass",
        "Nice.  Salma should chose eternal path though.",
        "I remember watching magic Mike when I was just a toddler so many great memories sad to see Mike leave ",
        "15:45  Have a nice day my friend \n\n**00:01 intro **",
        "Channing Tatum is always gonna be my #mancrush forever ️",
        "best thing Ive ever seen. Period",
        "Looks boring!...yawwn",
        "So basically it’s a movie about his show in London. Good marketing ",
        "This is so a “step up” sequel ",
        "More like \"magic mike steps up\" lol but I'll still watch it",
        "The movie that made him white famous lol\nMiss this dude.",
        "Wow",
        "Looking for Sona Mossesian in the comments",
        "Love the song <3",
        "Nice ️️️",
        "I didn't know that this Franchise was owned by WB",
        "Song?",
        "Magic Mike XXL is one of the greatest road movies ever and the fact that the gang isn't in this movie (or probably just have a cameo) is criminal.",
        "Feels like Step Up/Magic Mike. \n\nGood to see Channing showing us how talented he is on his feet. ",
        "Started as a male stripper now acting is easy work I bet on the subject lol.",
        "Only one guy from the movies… why?",
        "Yes magic mike",
        "He had more chemistry with Jada.",
        "Great! Now do 23 jump street next.",
        "Seriously?! Lmfao",
        "This honestly feels like a different movie than Magic Mike like just a random Channing Tatum movie.",
        "I mean....im a guy thats into women, but honestly I feel like this one is both for men and women. Magic Mike (women) Selma Hayek (men). Needless to say, she is the only reason I will ever say I have seen a magic mike movie",
        "and of course the voice of DONNA SUMMER is so magnificent for the movie",
        "Looks less Magic Mike and more Step up",
        "Feels like Step Up/Magic Mike. ",
        "The first was... fine. XXL was this absurd, road trip hangout movie that was way better than it had any right to be. Not sure which way this one is gonna go.",
        "Can't wait to see more rages to all new and some of the same things that make jev furious, speechless and downright baffled as he makes amazing reactions.",
        "I love Salma Hayek",
        "I mean... I am just going to watch this as an excuse to see Channing Tatum dance.",
        "I loved the first 2 movies but this looks awful…… I wouldn’t be surprised if it tanks in the box office.",
        "This woman is breathtaking",
        "Salma & Channing will be a hot combo!!",
        "This is not magic mike, doesn't feel like one. This is more like Channing tatum's step up sequel long overdue ",
        "Why??",
        "Wow, the level of dialogues is tragic ",
        "Love WB but this isn’t ma thing.",
        "This doesn’t draw my attention like the other magic Mike movies .. ️",
        "Always Sunny Season 13 Finale will still be the best dance segment put to screen",
        "Man I remember when the 1st movie came out I was fresh at 20 lol",
        "That was actually a really good trailer."
    ],
    "comments_disabled": false
}