{
    "video_id": "pfqvTCgglYA",
    "comments": [
        "I'm in a Starbucks Veranda phase right now",
        "Don't care for coffee that has that donut shop taste. I'm a Starbucks  Verona fan but have had Seattle's Best, and Peet's and they are a favorite too.\n\nI don't know what the big deal with Dunkin, I would have McDonald's before I have a cup of Dunkin.",
        "Trader Joe’s, a smaller novelty grocery store has many, many coffees, which I think are mostly theirs. I would love to see you do taste testing on those! I enjoyed this taste test. Thanks!",
        "My favorite is Seattle's Best.",
        "Interesting that so many fast food branded options made it as far as they did. I imagine it's also not a coincidence that the winner was the only one bought as whole bean.",
        "I buy Silken Splendor regularly and it's quite nice.  If you like Philz Coffee and enjoy dark roasts as well, I really recommend Jacob's Wonderbar.",
        "As a Cafe Bustelo fan I wonder if the vacuum sealed brick would’ve made it further than the tub ",
        "I love coffee, I’ve been brought up on instant though. I’m always on the lookout for a better brew but I have to be honest, I have never enjoyed any pod coffee as much as instant and I’ve probably tried about 10 types of cafetière coffees and didn’t think a single one of them tasted better than instant either.",
        "You've never had Folgers? How? I find that almost impossible to believe.",
        "I'm not offended at all, especially since you've been so tactful about it\n\nI'm relieved because I love coffee but can't enjoy drinking most of it and feel like I'm being a baby. I make the exact same faces and even say things like \"it tastes empty\" and people think I'm weird (i don't say that about their coffee lol)",
        "having lived on the west coast of the US, I can honestly say I wasn't surprised Philz Coffee made it so far",
        "Eight O' Clock is typically a good supermarket coffee. I refuse to buy preground and it's one of the few brands you can still get in the grocery store as whole beans.\n\nAnd ALL Starbucks coffee is nasty. Never had a brand of theirs that didn't taste like burnt hair. Have to drown it in creamer just to get it down.",
        "The slurping is so distracting. Really?",
        "Not surprised by the Tim Hortons/Dunkin/McDonalds compliments in the tastings.  They're far more likely let down in the preparation in the stores being drip-style commercial brewers.  i can easily imagine if done in smaller batches, more carefully, they'd perform better.",
        "The Starbucks Veranda Blend is my favorite of the brands you tried, and I have tried most of them. It's got a flavor that I can't find in any store bought coffee. Also it doesn't show any characteristics of unripe beans like many store brands have. I actually quite enjoy the McCafe, which totally surprised me, and the Dunkin' Doughnuts as well",
        "Would have been nice to see how those \"BULLETPROOF\" coffees (Dave Asprey's) and Trader Joe's Medium Roast stacked up against everything else...",
        "I don’t even drink coffee, but I watched this.",
        "This was hilarious and rather enjoyable video. I got a kick of the reactions to all the brands I know. I share similar opinions. Thanks a bunch.",
        "I'm a Folgers drinker and I can't drink anything else",
        "It would definitely be interesting to see matchups of the different \"upscale\" grocery store brands from across the US. Where I live in California, Stumptown, Intellegentsia, Ritual, and a few others are readily available at Whole Foods and other overpriced grocery stores. Those vs similarly marketed brands in, say, Chicago, would be fun to see.",
        "I have been drinking Peet’s Coffee Major Dickason’s dark roast exclusively for 2 years now. The first coffee I tasted where I actually enjoyed the taste of the coffee and didn’t feel the need to drown it with my oatmilk creamer. Highly recommend to everyone. M",
        "Is it not possible to put the liquid in your mouth without a very pronounced slurp? Does doing it that way <<increase>> the flavor?",
        "This video was brought to you by Tim Hortons coffee...",
        "To address the Philz controversy: I didn’t realise they weren’t widely available. It was heavily suggested in the Patreon poll to pick the coffees, so I presumed it had decent distinction US-wide. My apologies! I also don’t think I understood the massive grocery variation by region (coming from a small island). Feel free to pick your own winner from the top 4! Regardless - I hope this was a fun video!",
        "Would be interesting to see this done again after mixing up the order to see if head to head comparisons had any impact…",
        "Tim Hortons \"in the restaurant\" coffee can be really hit or miss. Sometimes I'll go and it's pretty good, sometimes I'll go and I can't drink it at all... Like something sour got into it or something. Brewed at home is much better.",
        "Maxwell house is what I drink but always the Colombian. I don't drink it black but I think it tastes pretty good, like chocolate.",
        "Does anyone see what's wrong with this video?? If you don't...... here's a clue, they drink tea.......",
        "No one:\nJames: I'm going to put this one through for just being a bit weird\n\nJames giving life lessons! I have so much love and respect for you! ️",
        "Lavazza Gran Aroma has to be the best option",
        "The fact that he calls Tim's friendly at the end is just so Canada haha",
        "Can you do one but for UK coffees?",
        "That sipping noise tho",
        "It’s so funny that you described Tim Horton as “friendly” multiple times! James, maybe you could do a world tour of grocery coffee.",
        "best for espresso not cappuccino",
        "Comparative tasting and the bracket system was awesome. I’d like to see commercially available vs top shelf blind comparisons.",
        "Dear James, \nReally liked your efforts on this video. If you get a chance to travel to the USA in the near future and you are flying on Southwest airlines, they serve Community Coffee. Best I have had of airplane coffee. Philz winning is interesting, too. My nephew turned me on to Philz. I am surprised at Philz now being nationally distributed.  Anyway great video! I roast coffee as a Farmer's market seller using propane hot air ( fluid bed) roasters and have had some success with it. You are an inspiration.",
        "James, if its even possible I'll happily ship you out a heap of Australian coffee brands hahaha",
        "Tesora from Philz that was dropped in the 1st round is my favorite.",
        "What watch are you wearing?",
        "Lavazza?",
        "Wtf is with the sipping? Is he a 90yr old with no teeth or something?",
        "I am a Community Coffee & Chicory fan - and I drink it with milk and sweetener.  I appreciate James’ honesty in preferring lighter roast. \n\nI would love to prefer black coffee. Do you, James and subscribers, think that drinking lighter roasts allows for a “cream and sugar” lover to start drinking black?",
        "Really surprised to see Timmies being available in the US; didn't realize it made it down there. Also, interesting to see that he felt like Tim's and McDonald's were so close since the two of them share common grounds (lol). For a long time, Tim's coffee was supplied by Mother Parkers before they opened up to do their own roasting and supplying. After that, McDonald's Canada switched over to Mother Parkers and rumour is that McD's had MP create a blend as similar to the old Tim's recipe as possible. Obviously MP didn't know the exact recipe but they'd worked with Tim's long enough to put together a decent clone",
        "Finns drink a lot of coffee. Maybe try theirs?",
        "I'm glad to see Peet's as a recommended dark roast. It's fast become one of my favorites along with Seattle's Best. This video definitely makes me want to try Dunkin's and Tim Horton's at the store when I get a chance. I would like to say though that pretty much all of the coffees you mentioned taste much better at home than at a cafe. I'd love to see your opinion on coffee from Coffee Bean & Tea Leaf as well as Klatch Coffee - two popular chains here in Southern California. I'm sure there are tons of other ones in other parts of the country that deserve attention as well.",
        "Now that you did a round of grocery store coffee, do a round of online subscription based coffees!",
        "Next generation of parents be like:",
        "“Nice vegetable soup with a twist of lemon” never thought I’d hear that as a description of a coffee taste profile lol. I wont lie, I HATE Dunkin, folgers, maxwell house etc, Im a bit disappointed he didn’t like Cafe Bustello, thats my go to cheap coffee to use in my kurig pod, If I cant get my local roastery’s french roast beans for my french press, literally tastes like dark chocolateBut I use a couple tablespoons of heavy cream in my coffee, I cant do black so I understand his preference for the light fruity ones. Maybe I’ll try some of that Philz stuff, I do think the fact that it was freshly ground created some bias though. I appreciate the professional perspective ",
        "Um i expected an actual grocery store brand review :( i drink Great Value French roast .. None of these here are store brands",
        "You might find it interesting that Tim Hortons and McCafe are roasted by the same company. The husband of one of my coworkers is the district manager for Tim Hortons in Western New York and used to be the same for McDonald's just north in Ontario and she brought this up in a previous conversation about coffee. I greatly enjoyed this video!",
        "You missed the light roast McDonald’s breakfast blend. One of the better coffee grounds you can find in most grocery stores.",
        "Walmart brand is ok for the money.",
        "McCafe has become an existential threat to James",
        "i think it'd be interesting to try specifically store brand coffee, coffee specifically branded to that grocery store. being in texas, we have HEB, which has their own coffee brand and i assume that might be the case for other grocery chains? i am not a fan of cafe ole but it might be fun to find out who's store brand coffee is the least terrible heheh.",
        "Philz is the reason I have become a weird coffee person. They are more known for their mixed coffee drinks, but they do a pour over for every drink in their cafes and list the flavor profiles of all their roasts.",
        "Philz is very fancy/expensive for grocery store tier coffee. I love going to Philz tho - my favorite is the Ambrosia of Coffee God which is a light roast coffee. Their more popular roasts are the Jacob's Wonderbar and Tesora. And if you're at their coffee bar, the mint mojito is a must try signature latte ",
        "I have tried most of your picks, still prefer Peet's over the others. I mostly order online from specialty shops. nice video! thanks again.",
        "His face after every slurp is gold LOL",
        "To be fair, Cafe du monde is meant to be drank with milk",
        "The best American store coffee….was nearly Canadian coffee hahahahahha",
        "Dunkin is usually available as whole beans at most grocery stores where I live and it goes on sale quite a bit. Solid choice when trying to save money or just want something simple.",
        "As a peets fan the French roast is a lot smoother and more palatable than major Dickson's. I prefer the Sumatra but that seems to be a roast to order bag only now",
        "i find it so fascinating that major brands like dunkin, starbucks, and tim hortons ended up with favorable results throughout the video. they all made it pretty far and had recommendations at the end for the best coffee at each roast level",
        "Wow know I know why my coffee of today doesn't taste like it did fort years ago .\nWhat brand do you recommend .\nI miss coffee that was good .\nThanks for doing this . Not easy .",
        "This is a good idea going into the holiday season, because I always get stuck brewing coffee for all of our family and sometimes depending on the town we're in there isn't good stuff available and if I run out of what I brought with me I have to get something from grocery stores. I often go with community coffee or Dunkin knowing that they are not as dark and more interesting cups than a lot of the others and generally widely available. I think it would be a cool video series to even hit up store brands that are more specific to locations, like Aldi.",
        "Ah the Maxwell House ground coffee, I loaded it in my el cheapo coffee maker and smells so good, and I drank it, was cranked for 2 days.",
        "Sorry this was botched - you can’t compare pre-ground coffee to fresh ground!  You simply proved what should be well known that fresh ground is the only way to go",
        "I'd love to see you do a rank of all of them. The bracket style makes me think that things get missed",
        "I came just to see what you thought of Cafe Bustelo. It is a favorite among Caribbean Latinos and I will admit it is quite strong so an acquired taste. Thanks for including it!",
        "How can you do this experiment without trying HEB coffee? I'm appalled.",
        "I died a little inside every time you had praise for Community Coffee.  My flavor profile of choice leans hard toward stronger roasts like Cafe Bustelo and Cafe El Moro.  I consider Folgers to be the Bic Pen of coffee, cheap, readily available, and it gets the job done and probably the best overall bang for your buck.",
        "Fun thing about the \"Gëvalia\" one: Gevalia is a Swedish brand, and the name \"Gevalia\" is the latin translation of the city they come from, \"Gävle\". In the US, someone decided to pretty recently re-design the packaging (or if it was newly introduced even), and to make it look more Swedish, they put two dots somewhere.. like.. over the e. Which isn't a letter in the Swedish alphabet, but okay. ",
        "Folgers Black Silk",
        "LOL .. this was fun to watch.  You need to get some A&W coffee so you can yell NO immediately.",
        "Been watching your channel for about a week. In that time I've spent over $300 on coffee paraphernalia. I'm not sure I can afford to keep watching",
        "I couldn't fine eight o'clock coffee review?",
        "Timmys beating Dunks. Canadians rejoice",
        "James, I followed on facebook but now i'm subbing to your YT. I don't drink coffee, at all, but your content is thoroughly enjoyable and interesting, even to a non coffee drinker.",
        "I'm as much of a snob as the next person, and I have my single origin favorites, but regular Folgers is a guilty pleasure for me.  There's no reason I should like it, but I really am happy to drink a cup.  Their breakfast blend, even moreso.",
        "It may be worthwhile to run this test again with whole bean coffee to see if the results are similar.",
        "Does caffeine effect you at all?",
        "Bustelo harsh and bitter?! I’m out! Lol",
        "As an American I was definitely nodding along with your assessments on those coffees (I've had almost all of them).  I think if you're going to explore more into coffees available in American stores, you should contact Trader Joe's and have them send you a selection of their coffees.  They are the \"best of the budget brands\" in my opinion.  I would suspect that Trader Joes (TJ's) would even offer to send you the coffee for free if you did a review of just their varieties.",
        "I would have been interested to see what you thought of the Private Selection coffees offered by the Kroger company. They make several whole bean coffees that I've enjoyed: Sumatran Mandheling, Ethiopian Yirgacheffe, and Guatemalan Antiguan.",
        "As a Canadian, I am both proud and confused. My reaction was much the same as James' here- Tim Hortons coffee is not good, but maybe that is more the prep at their locations. Fun video!",
        "Too bad Lavazza wasnt included, I just brought a bunch back from Milan last month.",
        "Great vid my wife and I fell in love with philz out in Cali. Great coffee!!!",
        "Let's see a flavored bag coffee head to head.  I'd like to see James wince at everything.",
        "We always use Dunkin Original. It’s so good compared to all the other brands I’ve tried.",
        "13:02 Results of the War of 1812 (part 2) just dropped",
        "Funny thing was watching his vids i realized i never had a proper cup of coffee, all been instant and Costa ....i really must try one at a proper coffee cafe",
        "I'd say of common ground coffee blends; USA 🇺🇸 I'd taste test, try; Boyd's of Or. Stumptown, OR blend, Cameron's, Community Vanilla Waffle Cone. I also like online, veteran owned  coffee choices like Blackout Coffee, Three Rivers Coffee Co, Trident Coffee ️, Old Salt Coffee , Fire Dept Coffee , Alpha Coffee . Some enjoy Black Rifle Coffee but they've had some \"drama\" & issues.  Evan Hafer, the ex CIA-SAD guy who's CEO has turned many people away....",
        "I've tried peets before when I couldn't get the local stuff I usually buy and it wasn't bad.",
        "I did not see French Market. Therefor this video is not worth my time.",
        "I would have loved Aldi's coffee to be included here as it's the most affordable I can get near me.",
        "What I could really use here in the US is a method of reverse engineering each brand's \"Best by...\" date to figure out the actual roast date. Whenever I'm at the store, I can check which bag of the same coffee is freshest or at least not select the one bag that's been on the shelf longest. But I don't know whether I can compare freshness between two brands. I have no reason to be certain they each set the date the same amount of time forward from the roast.",
        "Gevalia: for those curious what the mud and grass that's been wedged in their shoes after cutting the lawn last season could add to their over-roasted, ashy 3-year-old pre-ground coffee.",
        "Coffee is exclusively a matter of personal preference.",
        "How about Costco brand?",
        "Aldi (yes I know it's a German chain but they're in the US too) and Kroger both have good store brands imo. \nI've been really enjoying Kroger's private selection coffee for what it is (especially once you consider its price). \nWould love to have seen how they stacked up.",
        "Regular! Yes, a vote for making this a regular segment Very fun, but informative too. I’m so curious about the winner — I’ve never heard of it.\n\nIs it true that light roasts have/result in the most caffeine?",
        "I love Community Coffee Decaf ( I have a heart arrhythmia, don't yell at me for my decaf love LOL!!) it's fantastic also as iced coffee! :-) Funny thing also is Tim Horton's (another of my faves) is Canadian. But you should try the Cafe Special Decaf Medium/Dark Roast by Community Coffee, IMHO it's better than the American blend and a good full flavor for iced coffee.",
        "As a worker for one of the major coffee brands here I've been hoping James would talk about it more. I love the coffee we have and we even do tastings in store so we can understand our own coffee better but we never really talk about our coffee vs other coffee so I've been wanting a more expert opinion about it for a while.",
        "Kinda funny seeing Dunkin vs Tims near the end. I have a cannister of Bustelo but I only use it for making a cuban coffee in a moka pot and the recipe involves plenty of sugar. I would assume Cafe du Monde is a similar thing, people might use it for Vietnamese coffee with condensed milk. Growing up my mom always had the choc full o nuts so that probably is more nostalgic for me.",
        "Im a huge fan of Seattles best brand, I got 'hooked' on their hazelnut back when that was my thing. Now days I go for whatever they've got at my local shop. Its a good cup of coffee for sure",
        "I'm widely unfamiliar with a lot of these brand roasts because I stick with my core few. That said, if you do another grocer brand taste test, I put forth Lavazza Gran Selizione, Gloria Jean, and Door County Coffee.",
        "I’m not a sophisticated coffee drinker, but I drink it black and prefer light to medium roast. Whenever I’m traveling and grab a quick convenient cup of McCafe, from the drive through, I find myself surprised about half way through and muttering “not a bad cup of coffee”. I have been mocked by others for sharing this, but watching the McCafe get mildly positive feedback was hugely satisfying and weirdly therapeutic for me.",
        "Now I have to try Cafe de Monde since I like everything this guy hates",
        "i think including the espresso coffee was a mistake and unfair comparison.  the process to make espresso ground and the coffee making to be served is not the same.  Espresso is thicker and more intense than coffee because of the lower grounds to water ratio, the finer grind, and the pressurized brewing method. Regular coffee uses a coarser grind, more water and gravity to extract the final brew.  maybe it would better time served in comparing the different brands of espresso ground coffees from gorcery stores.  if you chose not to use the espresso machine in favor of the drip method the experience will be different.  maybe have this same comparison between espresso brands using and not using the machine to compare experiences.",
        "I think this highlights the issue i normally have if I'm buying coffee at the store: everything is medium to dark roast, probably 90%.  Trying to find a light roast is rough, and the veranda  is usually what i end up with",
        "I can't believe my \"everyday coffee\" did so well. Proud Canadian here watching Tim Hortons do so well!",
        "From a misophonia sufferer, THANK YOU for the accurate captions. I unmuted for \"I hope you have a great day\" of course, but otherwise this had to be sound-off for me and the captions were great!",
        "Coffee and chicory is usually drank in the south 'cafe au lait'  or vietnamese style, so even people who like it wouldn't drink it black.",
        "Are these tasted hot or cold?",
        "Why wouldn’t you have separate spoons for tasting? Or at least clean off the spoon between tests? I saw multiple drops hanging on the bottom of the spoon from the first test that were slurped up after the second. Wouldn’t that alter the taste of the second coffee every time?",
        "First off, maxwell and folgers should not even be counted as its pencil shavings posing as coffee. Secondly you should include Nabob and Edwards coffee.",
        "Buy local roasted coffee or your favorite shop you went to on vacation",
        "Ready?  \n\nSBC (Seattle's Best Coffee) was beating Starbucks before Starbucks managed to get enough capital to buy them out and bury the brand.  They had more stores across the USA than Starbucks.  Starbucks was a more bitter dark roast while SBC specialized more in a medium roast.  You tested a dark roast version of SBC (Post Alley is a location in the city of Seattle) - much more like Starbucks than how SBC was.",
        "I'm kind of amazed at how well the Dunkin' Donuts coffee fared, since to me it's horrendous and un-drinkable, and represents the worst of what brutally sour, highly acidic light roast is.   Hearing it called 'complex' is strange.",
        "As a Canadian who spends lots of time in San Francisco I am excited with the results. I've met Phil (Jaber) many times at his joint on 24th near Van Ness, Mission district and simply love his brews. Tim Horton is part of our Canadian social fabric... Good work James Hoffman.",
        "7:47 - Staggering similar cups of coffee. Definitely a compliment as that's 8 oclock is half the price of the Starbucks. :D I wish you had kept the prices up past the 1st round.",
        "I think for first round you should have eliminated any that were undrinkable straight away instead of letting the better of two move on. Some potential good ones may have been cut in the first round while others you don't like edged by",
        "Takeaway:  Over-roasted coffee is gross. Stop burning it to hide the fact that it's robusto, **Starbucks**.  Thirty years of that and now nearly every coffee producer over-roasts their beans to match, and it's disgusting.",
        "What can I say? Other than each to his own. I love Dark thick coffee. Petes Dark French Roast is awesome, but of late I have been enjoying Cafe du Monde and Comunity’s Coffee/Chicory blend. Yep, Dark Roasts for me.",
        "Try grocery store iced coffee next!",
        "I enjoy the side content mixed in with the main story. It's a nice break that allows for more development in a sense.",
        "Love this! Please make it a regular feature. Would also recommend putting some of the products from Trader Joe’s in the mix too!",
        "I'm curious as to what coffee you would give high marks to, that could be purchased online so we could all taste it too. Would be fun!\n\nI'm also curious if you've ever tried Choffy or similar brand and your thoughts on that.",
        "Although Starbucks is my personal favorite, especially the dark roasts, I am a big fan of Tim Horton’s and Community Coffee. Both offer a nice cup of Joe. Community Coffee has been readily available in my area for some time. Tom Horton’s has recently been appearing at our local Target. Prior to that, I had to search for it in random places or it was purchased out of town.",
        "Chuckled pretty good on round 2 when he said “Surprised you made it through” to Cafe Bustelo ",
        "Not even going to listen to this Jews opinion.",
        "Why is he sipping it like that?",
        "Were you able to sleep the night of this video?",
        "Seeing that Tim Hortons coffee as apart of a American selection still doesnt sit right. We have no spine..",
        "It might be interesting to do a review of major brand espresso beans iike illy, Lavazza, etc",
        "I've always liked Cafe Bustelo because it's such a strong dark coffee",
        "Is the Caribou coffee from Grocery Outlet? I'm not familiar with it, but feel like I may have seen it there. Never seen Tim Horton's before and I'm on the west coast, USA. Isn't it a Canadian chain? Only time I've seen Chock Full O'Nuts was one time at Grocery Outlet about 10 years ago. I think it was $4.99. Had never heard of it before. It's weird that Dunkin' sells their coffee on the west coast, but have no stores here. The only one I was aware of was probably 15+ years ago in Clackamas Oregon.",
        "Tim Hortons is the real winner here! the best cheap coffee!!! just got a medium double double at tims <3",
        "I always have to brew a fresh cup of coffee to watch a new Hoffmann video",
        "Local prices (USD): Philz Silken Splendor = $19.50/lb. Tim Horton's Original Blend = $8/lb. Starbucks Veranda = $12/lb. Peet's Major D = $16/lb.",
        "I was a barista for a couple of years at Philz. They trained us to push Tesora on new customers, but I always recommended Silken Splendor instead. Looks like my personal taste checked out!",
        "I'd love to see you do this with German brands, but that would perhaps be a bit too niche for the majority of your viewers.",
        "Worked at Philz for 5 years and can definitely say that the coffee is different. Each blend of coffee has 2-7 roasts of beans all sourced from around the world. Each bean is roasted to the correct profile and then blended together creating each unique coffee blend. When visiting a store you are presented with a very full-bodied cup of coffee that is crafted one cup at a time via a special Philz version of pour over.",
        "In fairness, in the past two places I’ve lived (DC and San Diego) it’s been very common to find proper third wave coffee in stores like Whole Foods, Giant and Ralph’s. Tragically, they’re almost never fresh \n\nSuper interesting video! Surprising (and genuinely humbling to those of us working in third wave coffee) to hear how many good things you actually had to say about these when you didn’t know what they were. You make a good point about relativity as well.",
        "I can safely say our tastes are very different. I never drink coffee black, though. I love my Peets coffee. With a little cream, the chocolatey notes are great!",
        "Damn. My money was on Community Coffee. That's my favorite. But it made it far enough and I still love it. Great video!",
        "Would love to see a UK version of this because I can never remember what all of them taste like when I go for a different bag",
        "There are 2 Dunkin' locations in my area. In the mornings, the traffic in the drive-thru spills out onto the road and can easily go100+ yards down the slow lane. People are willing to wait in these insanely long lines and completely screw up trafficfor their coffee. I never understood why. But now, that it made it to James' semi-final, I get it.",
        "I loved this, would love to see Australian, New Zealand, UK etc versions of this",
        "Cafe bustillo and Choc full of nuts..",
        "Would be hilarious to see a Tim Horton's Christmas ad with James' reaction at 14:23.",
        "Just discovered Tim hortons.  Good coffee. Had to order online though.",
        "Would love if you could do this again and include coffees from Trader Joe’s! I think they do better on average than other grocers",
        "Can you try Hank Green's Awesome Coffee Club coffee? Proceeds go to charity",
        "I've gone from drinking Folgers to Gevalia to Dunkin over time.  So seeing Dunkin do so well feels like validation to me.  But I've never seen a lot of those brands at the store.",
        "I said I wouldn’t take it personally and I did. Cafe Bustello for life.",
        "Add kirkland branded coffees",
        "Starbucks French Roast is the best in my opinion.  It is a dark roast but not bitter and not acidic….The best.  I really enjoyed this taste test.",
        "Is Don Francisco's really that bad that it was not included in the contest? lol I like it but by no means i know anything about coffee",
        "lucky victims",
        "When my everyday coffee gets kicked out on literally the first round ",
        "I would love to see a rematch using whole bean where available. It makes such a massive difference to grind it yourself.",
        "It's a topic worth revisiting, but I think you can wait a year (or even two) before going through the whole process again. Who knows, there may be new brands out in that amount of time.",
        "Any views on the Pakt Coffee Kit?",
        "as a dark roast lover can confirm,peets is pretty yummy from american beans",
        "Tim’s is Canadian",
        "The way I drink the cafe Bustelo is making a Cafe Cubano",
        "Feels weird not to include Allegro coffee from Whole Foods. Not many actual nation-wide grocers in the US. To omit one of the few seems odd.",
        "I’ll say as someone who went to school in the northeast it pleases me to see James talk positively about the Dunkin original blend - my go to when I forgot to buy beans or was in a hurry!",
        "So glad that you said exactly what I thought about maxwell house. That stuff tasted dreadful",
        "As a Viet American who grew up drinking my dad's Cafe Du Monde that he makes every single day with a phin and some sweetened condensed milk, I found your immediately strong reaction to the chicory hilarious. This whole video was highly entertaining, and I was also very surprised by some of the results. I don't really buy grocery store coffee, but I did enjoy plenty of cups of Philz back when I lived in California. Please keep doing more of these, perhaps with brands from more parts of the world! (I now live in the Netherlands and would love your opinions on what can be found here ",
        "That peets is a staple in our house.",
        "As a Starbucks employee who hates Pike Place, seeing James wince at a slurp of it is all I’ve ever wanted",
        "I legit can't listen to this because the slurp sound sobs",
        "If you liked philz maybe throw in blue bottle or other SF roasters?",
        "I'd be curious to see your opinion on Black Rifle Coffee. I personally drink their coffee, but I am far from a coffee expert and I'm curious if my enjoyment of it is completely off the wall or because it's genuinely good coffee. :-)",
        "You can get Pete’s in bean form and it has the roasting date on the package. Which in my opinion makes it way better than all these preground or undated roasted coffees.",
        "If you can get your hands on Cameron's coffee, would highly recommend. Their coffee is quite smooth and less acidic.",
        "I'm curious to see how you would react to Cain's Custom Roast. It's frequently served by diners in my area and it seems like everyone either thinks it's the best coffee ever or hardly worthy of being called coffee at all.",
        "Schlurpapalooza!",
        "I got a full tub of chicory ️️️️️️️",
        "How can it be that so many companies sell so much coffee to so many people and yet apparently, according to our man James here, it's all absolutely disgusting? What's going on here?",
        "Will there be a UK one?",
        "Community Coffee and Chicory man here. Because New Orleans. ",
        "Having traveled to Canada several times, I will always be a stan of Tim Hortons. I'm super excited to see it head to the finals.",
        "cafe bustelo is life!",
        "As a former barista at Sbux for 8 years, I went through extensive coffee education (which I don’t think they do so much anymore, having reduced their offerings dramatically since 2016). I found it interesting that you defined Veranda as a medium, when Sbux defines it as a light or “blonde” roast. This was the first time I’ve watched a video on this channel, and I really enjoyed watching you taste and provide your insights. That McCafe made it as far as it did was the one that shocked me. Thanks for sharing your thoughts.",
        "That venomous \"I know what you are\" at the chicory imposter was everything! ",
        "I think you should do this again with more brands!!!! Get philtered soul, Verve, Blue bottle, Intelligentsia, Stumptown to name a few! Thanks for the video, was awesome!",
        "I didn't catch whether you mentioned this,  but did you try Tim Horton's and/or Dunkin's at the shop? I worked for another coffee brand but I can't say a lot of attention was put to keeping the coffee urns clean and changing them out as frequently as they should be. Either way, ecstatic Timmy Hoho's did so well!",
        "Could do without the silly & distracting slurping sound effect, but otherwise a good review.",
        "Eight o,clock whole bean is my lifelong favorite! Americans like flavoured coffee,s that hide the flavour of basically shitty  coffee! Uhh aribica is so much better than robusta!! Robusta is caffeine heavy!",
        "don francisco's, cameron's,",
        "Are these bracketing style taste tests really even accurate? If two really great options are pitted against each other early on, you've eliminated one of those from appearing in your final results when it really deserves to be there.",
        "Hi james any chance you reviewing best prosumer dual boilers eg ecm ?",
        "This should totally be a repeated category, but with grocery store coffees from around the world. Would love to see you trying some of my local supermarket coffees which aren’t coffee balls or aluminum nuggets.",
        "The background is that I bought a Wilfa grinder a few years ago and ever since I’ve been using my Rave beans in an Aeropress. I generally throw an Aeropress scoop of beans (I guess about 15-16g) into the grinder and pour on boiling (yes boiling) water (RO water don’t ya know) onto the grind and push through after about a minute. I realise I’m leaving myself open to abuse but I’ve been using coffee mate as I prefer that to milk. ",
        "The Private Selection Light Roast Ethiopia from Ralphs is a hidden gem and takes the cake for me.",
        "I didn't catch your brewing method, but in defense of Cafe Bustello, it is meant to be brewed in a stovetop moka pot",
        "I don't see any Cameron's coffee. I really like their Jamaican Blend.",
        "What ever the noise used to cover the slurp was really bad for me, like nails on a chalk board.",
        "Starbucks taste old and burnt. Don't see how they continue to sell the stuff.",
        "Tim Hortons tried to sue McDonalds for their coffee cause  their coffee contributes agreed to also serve McDa even though they were not agreed too so they went I dependent and now created their own brew",
        "Great value Columbian is delicious",
        "I would be curious to see if this head to head tasting would have ended up differently based on how they were paired. Especially after watching the video you did with Tom Scott it seems that in a tasting like this the coffee that you are tasting with it drastically changes your perception of the flavor profile. Great episode!",
        "As someone who started watching right before mc monday this was probably the best summer of my life.  It's so sad to hear that techno has passed, but he really does never die.  With our memories and his amazing videos still here, we can keep him with us. :-/ :-)",
        "Many Americans would LOVE reviews of the \"conservative coffee company\" category. There are a bunch of these now but are any of them any good?\n\nBlackout Coffee, Black Rifle Coffee, Revere Coffee, Conservative Coffee Roasters, and many more.",
        "So many brands and so many variations. I would've liked to see a comparison of say all Columbian/Arabica as a better apples to apples contest. I generally buy Columbian coffee from whichever brand happens to be on sale, be it Folger's, Maxwell House or store brand and find little difference, but I'm not an expert, just a guy who needs a good cup of coffee to start the day.",
        "Enjoyed the video. Still don’t understand the Pete’s coffee editorial. I was surprised at how I had similar reactions to these coffees, as I’ve tried all of them over the years. Pete’s pre ground coffee is some of the worst I’ve ever had.",
        "YES!  Please do it again.  Maybe add some local brands, well, like Stumptown coffee, a local favorite here in Portland!",
        "I'd advise you to have a glass of water dip and rinse the spoon after each tasting so there won't be any leftover traces on it. Otherwise, very informative though tbf those aren't brands I've seen in my country.",
        "I don't think it's available in the US but if you could try Macona it is the best instant coffee I've ever had",
        "As a Canadian-born person, I'm glad to see Timmy's get an endorsement here (all things considered). I'll hear other Canadian Coffee People (who, notably, actually live there) bemoan how bad Tim's coffee is, but given that it's not readily available where I am in the UK, I feel an immense nostalgia for it. Like, I know it's not as good as the gesha I just picked up from my local roastery here in Oxford, but it's, you know, it makes a very comforting lil pourover, GOSH DAMN",
        "You missed black rifle coffee!",
        "Gevalia is my pick",
        "Dare you to drink and review a cup of kenco freeze dried coffee on live stream",
        "Am I weird to think that a “fresh” cup of McDonald’s coffee (GAVIÑA) is the best in LA ? Anyone with me on this ?",
        "can't believe nescafe is nowhere in this list!",
        "H‑E‑B blows all of these out the water",
        "I absolutely love Philz coffee shops, makes sense their grocery store beans are good too. Also, I use Major Dickason's Blend for toddy coffee only, and it comes out a lot like Starbucks cold brew they serve in the cafes.",
        "James is my coffee soulmate except for dunkin",
        "As a barista, I’m really ready to see the end of Light Roast supremacy. It reminds so much of the IPA craze in the beer world, which is thankfully ending. I don’t want my coffee to taste like fruit. I don’t want acidic coffee that comes up all day every time I bend over. Give me the cowboy mud. Give me the dark, woodsy nutty stuff that actually comforts me. Honestly, of the spread here, I probably pick Bustelo. Does really well in a moka pot.",
        "The issue is that you put some away when you seemed to like them more than ones you kept... interesting but round two you already missed some that might have made it to the final round IMHO.",
        "I don’t critique or criticize anyone in their choices in comparison to mine, that’s exactly where offense lies in? Personally I get drawn to the conclusion of a blatant attack? And then I’m considering a physical brawl",
        "I live in California and Philz is honestly one of my personal favorite coffee spots to go too. They make a pour over for every order and they have their coffees listed by roast level with flavor notes. It's definitely the coffee spot for coffee nerds and I'm happy to see it won!",
        "Stumptown and bluebottle dude",
        "I would love to see more of these coffee challenges. Best of the UK. Best US regional roasters. Best roasters of Europe. Also, Kalahdi Brothers coffee Roasters is the best coffee roaster in Alaska, one of the best in the world.",
        "Why have so many dark roasts when James obviously prefers light roasts?",
        "Yes, more taste comparisons. Highly entertaining.",
        "I am a self proclaimed coffee snob (grocery store coffee snob) and the only coffee I haven’t tried was the winner , I drink the second runner up when I drink grocery store coffee the rest tastes stale to me",
        "I had a great cup of coffee at a Philz in Palo Alto, CA, when I visited a while back. But yeah, it's not available in the region where I live now. Btw, what does James mean when he says \"vegetables\"? That's not a taste I've ever associated with coffee.",
        "Taking one for the team, what a legend. Weirdly fun to to watch. The only way I could have enjoyed it more is if he'd said folgers tastes like somebody roasted sawdust instead of coffee beans. Which it does.",
        "USA Challenge - 2nd place.... CANADA",
        "When I lived in California the best coffee (brewed) I could find locally was at a Philz coffee shop where they used the paper filter method, so I'm not that surprised it did well. Very interesting tasting!",
        "please do this on a regular basis. it was very interesting & very helpful. there are so many more varieties of these brands out there plus other brands also.",
        "would love to see a comparison that stayed within roast levels.  obviously if you prefer a lighter roast, none of the darker roasts are going to do terribly well :)",
        "I got as far as the first round with Cafe du Monde and had to laugh at his face and comment.  My husband also hates the taste of chicory, but I'm quite a fan.  Also, afaik it's normally served as a cafe au lait, so it does go wonderfully with steamed milk to get that extra sweetness from there.  When I first tried it at Cafe du Monde itself in NoLa, that's how I had it and I've loved coffee and chicory every since (but I also always use whole milk with my coffee lol)",
        "They say you should never take things personally but as he’s describing the coffee I can’t help but think he’s describing me… “A little harsh… VERY bitter”.",
        "Unfortunately for anyone out there that really enjoys good coffee and knows quality, most if not all the big box store branded ground coffee is pretty bad, its almost all sprayed with Glyophsate and the beans are poor quality, especially since most people are buying ground coffee which is the first problem, people need to be buying whole bean, smaller batch organic coffee if you really want a better quality bean which leads to better tasting coffee.",
        "im a uni student ( the uk) currently drinking Ikea preground medium roast, pretty broke rn so its decent for the price, Goes is decent with or without oat milk. I use it with an AeroPress. how can I for no money or very little improve my coffee? and what's some cheap good coffee brands? thanks, Hayden",
        "Great video, James! My favorite, Tesora, was unceremoniously bounced in the first round.",
        "I have been purchasing 8 O'clock coffee for about 10 years now, but I have definitely noticed that it has gone downhill in the past year or more.  Definitely!!!!  I am going to search for a new coffee.",
        "Hey James I would HIGHLY recommend next time you’re in Canada to try the McDonald’s black coffee! Also Tims straight from the source! I’ll take you on a tour of coffee around Toronto if you want ",
        "Why do coffee people seem so calm? I mean, that sounds like contrary to what you would expect (cuz caffeine and all)",
        "Would love to see a head to head for speciality roasters in a particular US city (like Seattle )",
        "Sign Up",
        "Completely running out of ideas at this point. James, your reviews cannot be trusted because you only respond positively to cold hard cash.",
        "I would love to see a comparison between US and UK supermarket ground coffee.",
        "This is why Brits need to stick to tea, coffee is a religion here in the pacific northwest usa, We love our strong dark roasts! He totally did not like most of the quality brands he tried and instead chose brands that are considered generic and weak in the US. He seems totally wired by about the middle of video. ROFL This guy totally reminds me of Alton Brown by taking it all apart on a science level, making it funny.",
        "You should try deathwish coffee and black rifle coffee company",
        "I always find it's funny the number 1 sold ground coffee never wins in taste tests.\n\nFolgers Topps the charts of ground coffee sold year after year.\nI wonder how much it has to do with marketing, the color of the container or just the fact that your parents bought it so now you do.",
        "If you do America again you should try Vermont Coffee Company. Also, I'd love to see you do this with Canadian grocery store coffee. I think Canadian Mc Donalds coffee is very different than in the US. Cheers :)",
        "You definitely need to do a UK grocery stores version!!!",
        "Philz is like 5X more expensive on Amazon than Timmy’s.  Seems like TH’s would be the best taste to value ratio.  Would be interested to see the others ranked this way.",
        "Did I just hear THE coffee content creator say that he has never had FOLGERS?! Wild haha",
        "I'm 3 minutes in and this may be the fist video that I have to stop watching because of those slurp sounds lol they don't even sound real",
        "did you get to please your Pallet in between topo Chico?",
        "Impressive tasting Mr JH. I am no great taster but find I like different coffees in different methods. So does your tasting apply to a particular brewing method or does your expert palette cut through this variable?",
        "lol. Dang. Cafe Bustelo is my grocery store choice. He hated it.",
        "Cafe Bustelo is my fav",
        "Wow, Wegmans?  Didn't expect that one!  What'd be interesting to see is what you think of the fancier store brand varieties.  Wegmans for instance has a bunch of whole bean world blends, and sometimes people will spring for the nicer variety at the store instead of looking for a boutique local roaster (if they even have one) to try something spiffier than your regular grade cup o' joe.",
        "Cafe du monde with chicory. I grew up in France. You have to drink this with milk",
        "Peet’s!",
        "That noise every time he takes a sip it could have went without that part being in",
        "I'd love to see you try some common European supermarket coffee as well",
        "I think an occasional (annual or biannual?) assessment of North American grocery store coffee would be great.  I also think you could isolate down to certain states in the US; could be an interesting microcosmic adventure.",
        "I encourage you to try these coffees how they're meant to be brewed. The Bustelo, for instance,  is made by someone's abuelita trying to fatten you up for no logical purpose other than she still has food in the house. Come to Tampa or Miami and try cafe con Leche. Dip pressed and buttered Cuban bread into it.",
        "This was FASCINATING. I drank Caribou for years as the best coffee near the office. And I had Gehvalia at home until I thought the quality declined. Peet's would be the next tier, then Starbucks, with others undrinkable. Philz has a good rep but I've never tried it. Another key point is that Folgers, Maxwell, etc are Boomer coffees or for the military and institutions. Nobody who isn't part of those communities drinks them now unless they are desperate.",
        "review Blue Bottle's new instant espresso!!!!",
        "I believe the fact that the Philz was whole bean gave it an advantage.",
        "Black Rifle",
        "Surprised that philz made the list and counter culture didn't. Both are specialty coffee thay is availabe at every target I've been to",
        "I found the whole-bean Peru organic fair trade from Aldi supermarket at $6 a pack is great. Better than several local roasters in Brooklyn/NYC. Aldi also has a Honduran coffee in the same series but not as good, more bitter. I just started watching, I hope James tastes the Trader Joe's coffees.",
        "Dear Canadians: what dirt do you have on Mr. Hoffmann? Please release him. \n\nThat being said, I really enjoyed this video. Good to know that there is decent coffee available at the supermarket. Especially for those times where there is no money left in the budget for pricey specialty beans.",
        "James advice:\n\"Just don't buy supermarket coffee\"",
        "I would love to see a review of the entire death wish coffee brand! Super intense coffees and I can never pick which ones I prefer",
        "I would have loved to see a chart plotting each coffee by position and cost per 100g. With the exception of the Cafe du Monde, it seemed that higher price generally seemed to correspond with better coffee, would be interesting to see how strong that correlation is.",
        "Ohhhh, I would have loved to see you trying Blue Bottle Coffee too.\nGreat video James ;)",
        "Love these taste tests!  Would you share some of your favorites please. \nMaybe taste tests on organic coffee.  My guests like decaf in the evenings.  Maybe organic decaf, Swiss water process tests.  Thank you",
        "It always surprises me when I buy a bag of Dunkin or Tim Horton's in a pinch at how much I end up enjoying them.  They're just solid, no frills cups of coffee.  My preference is still whole bean and ground before brewing, but sometimes you just can't be asked.......",
        "You should do instant coffee from grocery stores ",
        "Would loved to have seen Kirkland evaluated.  I spend half a year in Mexico where the only “store” brand you can find where we live is Kirkland. Everything else is local from a variety of different states or is small batch or custom roast.  Or it is local roasted with sugar.",
        "Phillz is one of my favorites! Its local for me so I can get their fresh beans, and they have some amazing stuff! Highly recommend trying their \"Philtered Soul\" espc if you like hazelnut! \n\nAlso check out their recipe for the Iced mint mojito! Muddle corse brown sugar with mint, brew espresso over it and hit it with some half/half over ice. Very yummy!",
        "I think that some chains like McDonald's or Dunkin Donuts really upped their coffee game and that's nice : )",
        "Impressive that McDonald's, Dunkin, Tim Horton's, and Starbucks all made it to the quarterfinals. Very impressive on all of their parts.",
        "Does slurping bring out the flavor wtf",
        "I love how this has engaged the \"average coffee drinker\". Most/many of us here (including myself) like the idea of 4th wave specialty coffee, and likely dabble in better quality brewing and beans, but for various reasons (proximity to anyone roasting that kind of deliciousness) we are most familiar with these brands. Also, many of the roasters I know of and frequent are \"forced\" to roast for the palette of people who like and are used to these sorts of coffees. It's a self reinforcing cycle, which isn't a bad thing, it's just what it is. ",
        "I love how far the McDonalds coffee made it haha. But as a Louisiana native I wish Community Coffee had made it further and beaten Starbucks lol. And I'm sure the Canadians here are happy to see how far Tim Hortons got.",
        "Cafe Du Monde chicory is a bit much black.\n\nI do thoroughly enjoy it as a cafe au lait however.",
        "Seems kind of unfair Philz was freshly ground compared to the rest? :P",
        "The only thing that matters here is that Tim Hortons beat Dunkin. I do miss the quality of the food there though since Burger King took over",
        "We love Phil’s here in San Francisco…you have chosen wisely.",
        "I wish he would have been able to pick up Black Rifle, as its growing so damn quick, but its still so small compared to all of the others. good coffee though, just depends on the roast.",
        "As a follow up I would love to see a Starbucks vs Dunkin grocery store matchup of all the options - rooting for Starbucks' Sumatra!",
        "Did you know that \n\"Green Day\"\nHas a coffee?\nIt's called ",
        "Intelligentsia whole bean is definitely my go to grocery store coffee. I usually try and go to a local shop that has great beans from a local small roaster, but sometimes it's not convenient and have to get grocery store coffee. Intelligentsia is definitely the best and they have the roasted on date on the bag so that helps to get the freshest possible. Intelligentsia is a Chicago based company though and I live in Chicagoland. So maybe they are only in my local grocery stores though, not sure.",
        "Please taste the market coffees from Brasil.",
        "While I appreciated this very very much, I feel the winner is a cop out. Not only is it a brand I’ve never heard of and never seen at my grocery store, it’s also unground whole bean coffee. Every grocery store has that kiosk where you can grind your own coffee. Should we be comparing Philz to that coffee instead? I consider the runner up the true winner here. But I’d like an opinion, too, as to how the winner - whether we talking Philz or Tim Horton’s - to James’ true favorites. I assume it’d be a blow out. But I’d like to know how inferior grocery store coffee is to “premium” coffee.",
        "I’d love to hear your thoughts on Trader Joe’s coffees.",
        "I have weird nostalgia for Eight O’Clock coffee. My mom always made it for an after-dinner pick-me-up around the holidays and would give my cousins and I a teaspoonful in some milk when we were too young to be drinking coffee.",
        "Gotta say I’m really delighted to see Community Coffee make it to the quarter finals. It’s always my go to brand when I’m out of freshly roasted beans",
        "Wait, the winner was whole bean/freshly ground and the others were already ground? Not a fair comparison…. But nevertheless, thanks for the video. I’m a fan of Peet’s and Caribou coffee.",
        "I love the Starbucks veranda blend , in fact I really can no longer drink anything else... I get as individuals we all have different taste preferences , but I strongly suggest trying the veranda blend especially if you shy away from bitter dark roast coffee.",
        "He is so wholesome, I loved this.  I feel a little bad laughing at James wince through some of these.  I know the logistical insanity of the world's largest coffee tasting, but I so wish we could all do that again.",
        "Gevalia ALL DAY",
        "This is definitely more regional to the east coast, but I would love to see your thoughts on Wawa coffee!",
        "Folgers also!!  You killing me!!!",
        "IMO if you find a bag of Dunkin Donuts medium whole bean that expires 6 months or more from now you have something 95% as good as your average specialty Guatamalan.  It's strange how many companies call wet oil covered beans a medium roast.  Even some blonde roasts are too dark for me.",
        "Peet's Cafe Domingo. Better yet, mail order fresh roasted Kenya AA micro lots from Peet's.",
        "I can't believe I watched a 18 minute video about coffee! I find all coffee to be nasty black water, but this was interesting.",
        "I am genuinely shocked that two of my favorite commercial coffees made it so far. I love when family give me Philz and Tim Hortons coffees.",
        "I would love to see a decaf taste test! I've had to ramp down my caffeine intake for various reasons and I've been trying to find a decent cup of decaf - it would be fun to see you try some specialty decaf cups :)",
        "Am I the only one who can't even remotely ballpark what age this guy is?!",
        "How did you do the seeding?  Different matchups will yield different results.",
        "The winner was the only whole bean one? Of course that would make a huge difference.",
        "As a Michigander I have never heard of Philz Coffee, but I love Tim Hortons coffee. Is it great coffee? No, but it’s a friendly cup that’s perfect for a morning commute or road trip and a large is around $3.",
        "Also, please try youtube's own Ian Hecox's brand of coffee. My Favorite Coffee!",
        "Without sounding to bitter, I'd personally appreciate it if you edit out the slurping sounds :O just a ltitle feedback thing, great video!",
        "I've never, ever seen Philz before today. Meanwhile, I could find Counter Culture in every palace that I've lived (Montana, Michigan, Illinois, and Oregon).\n\nPeet's doesn't surprise me at all. They own Stumptown and are generally pretty passable if you're smart about what you order.",
        "Great video, so much inconsistencies from brands I normally use 8 o'clock but I've had bags that were super good and many that were not. I'm sure you grinding had a huge impact. Thanks for the content. Cheers",
        "In the US and a coffee addict. Lol I never heard of the winner, but have tried all the rest in your final roundup. My husband roasts our own coffee but I have purchased both the Veranda Blend & the Major Dickinson. I have to say if you go into the actually coffee shops Peeks makes a better cup imo.",
        "Good to see McDonald's Vs Dunkin' Vs Tim Horton's. I'd like to see you try Whole Foods brand Allegro coffee next please!",
        "Loved the video but that sound effect is absolutely horrible. Made it almost impossible to finish.\n\nAfter rewatching/ listening again it happens when you sip the coffee and yeah no couldn’t make it past 3 mins.",
        "I’m not really a coffee connoisseur but through a long period of casual comparison I have determined that whole bean coffee that you grind yourself is so much better than pre-ground. Also I don’t know what you used but a French Press seems to yield the best results for me.",
        "Hongkonger here and I would love to see an international version of this that features grocery store coffees available to most parts of the world.",
        "Please make a European version of this video 🇪🇺",
        "I just wanna give props to Dunkin for always having batch brew filter on whenever I go. Starbucks batch brew filter is quickly becoming the new McDonalds milkshake machine in that they rarely have it on, and when asked they say it’s ‘being cleaned / broken’",
        "I drink Cafe Du Monde but when I drink it I usually put two spoons of cream because I don't like that bitter after taste when you drink it black",
        "I been rolling with the McCafe for years. Gonna have to give Tim Hortons a try.",
        "Suggestion for a follow-up taste test: Decaf coffees.  I've always wondered if decaf tastes the same as with-caffeine.  I have to drink decaf for health reasons, and there are a lot of people who are decaf-only coffee and drinkers.",
        "A lifetime of these brands, have made me an big fan of Peet’s; never disappoints.",
        "Do a comparison all based on whole beans so the grind is not part of the equation.  I also would love to see an espresso specific comparison as well!",
        "Awesome! This is the exact kind of video I want. I usually get my coffee online from roasters I know and trust, but sometimes I’m in between bags and my closest local roaster is 30 miles away so would prefer to run to a target and get something for my coffee fix.",
        "I'm so glad to see my favorite Dark Roast (Peet's Major Dickenson) come back in the end. It shouldn't have, but it bothered me a bit when he didn't like it in the beginning.",
        "There is a store brand from Kroger called Private Selection Ethiopian Yergechaffe which is honestly an amazing cup of light roast coffee. I bought it in a pinch and they honestly did a good job roasting the beans and presenting what flavor Ethiopia has to offer with their coffees. It is honestly the most surprising major chain coffee I have ever had because who would have thought a grocery chain would make a good coffee bean over coffee companies that sell at the grocery store.",
        "Could you do this for the Dutch market as well? We have a wide variety, even supermarkets with their own specialty-like brands nowadays.",
        "Maxwell House was much better in the metal cans\nonce they switched to plastic it was all down hill",
        "I really like yuban,  I have it as a staple and try other kinds.  I like peets also. I used to get a coffee called fog lifter. Best coffee ever. Can't find it anymore",
        "I think the takeaways are two-fold: buying pre-roasted but not pre-ground is the better way to go and that even mediocre or sub-par coffees can be salvaged and made palatable by good brewing techniques.",
        "Doc, you should have a music album. ;-)",
        "I don't even drink coffee... Why am I so enraptured by this?",
        "I'd love to see you do this same comparison for other countries!",
        "Please do a donut shop coffee taste test of American coffee brands. My go to coffee for a while was the Kroger donut shop blend. You did one (Dunkin donuts) but I wouldn't say it's the best.",
        "Do this again with the Costco coffees!",
        "Bluebottle and there is nothing else",
        "My supermarket sells Counter Culture, which is excellent.",
        "Where I live if it's not Starbucks it's Community Coffee.",
        "Take that Canada.",
        "actually the mcdonalds whole bean coffee is pretty good as for timmys ya must say dependable really cant go wrong trys to plez everyone.",
        "Maxwell House \"Master Blend\" (a light roast) is my favorite store bought plain coffee.",
        "I love Seattle’s Best Henry’s Blend. Enjoyed the video.",
        "okay I love the content but the slurping was like 60% louder than the talking and it made it super annoying to watch",
        "I really like getting locally roasted and fresh coffees, but my go to cheap coffee has always been Dunkin. So I'm feeling pretty validated right now. I've never tried Philz, but maybe I'll pick it up next time if they have it.",
        "I think you need to buy whole bean coffees only and grind/brew/test, please.  Industrial ground coffee does not seem accurate.",
        "LOL!! That \"middle of the night call\" from PEET really shook you up, didn't it....or was it the ghost of Major Dickason himself?",
        "James before I even get into this video I just wanna let you know you’re a real sport fort this one. You’re absolutely one of the best content creators on YouTube. I will be sure to share this to my Facebook page because this is something many people I think will enjoy and I’m happy to share your work. Thank you for every ounce of love and effort that you’ve given to the world of coffee.",
        "I was waiting patiently for the Tim Hortons vs. Dunkin doughnuts head to head competition, that is a close one, I agree, Hortons is slightly better, but it's not as easy to find on the shelves as of course dunkin is.",
        "I just got a lavazza blue pod machine and would love to see you test there pods",
        "I would love to see more videos about grocery store coffee! Sometimes I'm not able to buy nicer coffee brands or artisan stuff, so it's very useful to know what's the best from what I have more readily available at those times. Thanks for the video!",
        "I’m wondering how this would turn out next year, and the year after.  How much different would they be from next years harvest?",
        "Australian supermarket coffee next please",
        "Thanks James!  I'd love to see you devote an episode to Trader Joe's offerings.  They offer a wide variety of coffees, and I've always found their beans to be of consistent good quality and flavor.  I'm no coffee expert though...just a junky.",
        "We've had nearly all of those brands and Gevalia (depending on the blend) is probably the best, we drink it regularly.",
        "I was hoping to hear thoughts on Caribou’s medium Roast, personally I think it’s a nice casual, everyday coffee. I’d love to know your thoughts on Black rifle coffee as well!",
        "How about a coffe world cup?",
        "You tried Starbucks Sumatra ? In my opinion it’s really good next to veronica",
        "Adding cream and sugar changes everything and that’s what most Americans do. Some of the complex sweet coffees lose everything beneath cream and sugar, while a bitter, dark roasted coffee shines through.",
        "I love this! I don’t think it’s offensive to have a favorite get disqualified since we tend to get stuck in our routines and block out the possibility of learning about other options. I’d love to see James touring Portland coffee roasters and comparing them someday. Maybe with Morgan as a guide",
        "Would’ve liked to see some Cameron’s medium roast in there as I’ve found as the best at my grocery for a price/quality ratio.",
        "I do not find it surprising that Philz coffee won the contest. Back in the early 2000's I lived in San Francisco and I had the opportunity to taste Philz coffe straight from the shop that it was roasted at. At that point in my life I had tasted a many variety of coffee, I must say that philz was among the top 3 that I've tasted in San Francisco. At that time, I'm not sure that you could buy philz coffe from a gorcery store, so, you calling it gorcery store coffee is surprising to me.",
        "You picked my favorite 2. Dunkin donuts and Tim Hortons. I prefer Tim Hortons as my number 1, but I haven't tried your number 1 pick.",
        "I found this video to be absolutely not able to stop watching. I found some suggestions in it - Anyway - thanks for going through a taste test of the grocery market brands. It was also interesting your discussion on instant coffees (being available in the same grocery isle). just fascinating - thanks for time - cheers.",
        "This just showed up in my feed and I'm surprised a coffee guy like yourself liked Dunkin so much. It's always been my go to",
        "Cafe Du Monde is my absolute favorite, so you lost me immediately.  Regardless, Trader Joe makes some nice coffees that were omitted.",
        "Philz coffee probably one of the best coffees I have ever tasted",
        "I've always gone to mcdonalds and dunkin.  Walmarts brand Columbian in the purple box is amazing.  Worth a try, its the cheapest and best coffee of the 3.",
        "Some key points missing from this video - how was this coffee prepared for the tasting?\n1) What coffee maker was used, and was it used for all?\n2) What was coffee to water ratio, and was this same ratio used for all?\n3) Were all the coffees relatively fresh? Most grocery store coffee just has expiration date, but no mention of when it was roasted and ground.",
        "Hey James, please do a version of this with coffee brands from Brazil! We have a great variety of brands, all with beans from Brazil, and people tend to be very loyal and passionate about them.",
        "I can smell the coffee",
        "This was great, What about the u.k.? I'm from the u.s. but it would be interesting to see what's on the shelves there. Well done as always ",
        "Not surprised at all by the results. lots of effort and time and money goes into the main blends at Dunkin McDonalds and TimHortons and together probably account for most of all coffee drank in North America by volume. Which I think speaks to its popularity.",
        "You need a honey cruller or boston cream with a mug of Tim's",
        "Drink Coffee Do Stuff is my goto coffee brand!  Available direct or at many grocery stores here in the west.",
        "As someone who has probably 3 Caribou coffee shops within a mile of my house (it's a coffee shop chain mostly in the Midwest US) I'm happy to see them make it past the first round. I'm gonna have to buy beans from the shop and the grocery store to see if they're different now.",
        "huge fan of Newmans Blend",
        "I love that Philz one. As a California native and having been to an actual Philz before I just love that it one. They also started carrying it at my local target and I’m obsessed!",
        "Quite shocked on how far Tim's went. As a Canadian I like it, but I think it's more of a past time thing. I use to love it black in high-school.  But even regular Tim's drinkers know it's not premium coffee. Maybe it's different in the states? I don't know lol",
        "I’ve tried pikes place twice from two different Starbucks, and each time after a few sips i got severe stomach pain. Never again",
        "I would like to see a review of WholeFoods coffees or All of the Nespresso capsules",
        "Caribou Daybreak is my fresh ground affordable coffee of choice. When traveling I will always hit up Duncan though, can always get a good, consistent cup of coffee.",
        "If you must buy off the shelf pre-ground, Folgers Black Silk is the way to go.",
        "I like coffee flavored stuff - frosting, ice cream, but only drink it for the caffeine to keep me awake.",
        "If you drank the same coffee over a period of time. The flavors seems to change.",
        "As a person from Minneapolis, Minnesota (home of Caribou Coffee), I'm glad to see both coffees getting past the first round. I love light roasts and Daybreak from Caribou is my go-to for my morning coffee. I love the assessment at the end because it perfectly fits my me haha! Thanks for trying our coffee, James!",
        "Proves only fresh ground beats pre-ground coffee. Who knew? Everyone.",
        "Please do a coffees of the west, or even NW.  There are so many good Seattle and a Portland roasters…would like to see what an expert’s opinion is.\n\nDoes being a dark roast lover mean we don’t like complex or nuanced coffees?  Serious question, no snark.  Don’t drink enough lighter or medium roasts to actually know.",
        "A lot of grocery stores have started carrying Intelligentsia, Counter Culture and Stumptown. Was really hoping they might be included as I hope people might start making the transition if they saw those coffee roasters perform well in this video. Might have been an unfair advantage but definitely appreciate you making the effort to try the rest of these ",
        "You should absolutely try the Saudi roasted coffees , specialty coffee roasters are now in every corner in the country so we have plenty of options to choose from ",
        "Philz is amazing! They do pour overs only in their stores. They are San Francisco Bay Area local. And then roast their own beans. I regularly buy their beans for home and they make great drip or pour overs. I highly recommend their lighter roasted blends :). ",
        "ever since i started watching your videos, i’ve always wondered: have you always been a coffee person? like did you come out of the womb with the characteristics of a middle aged man or did it slowly come to you?",
        "Glad I am not the only one who only tastes burnt peanuts with Maxwell house garbage.",
        "I would love to see James do a video on \"Low Acid\" coffees. That's all we grind now cuz of reflux disease issues; Lucy's (Amazon) and Trader Joe's are our two faves. How much lower acid are they? How do they produce/process that? How does it affect coffee experience overall?",
        "What's with the spoon? wouldn't sipping it be truer?",
        "I’d like to see a comparison of Australian supermarket brands.",
        "ANYTHING is better when you grind right before you brew!",
        "Cafe Busteo!!",
        "Loved this!",
        "Hello James Hoffmann, would you consider reviewing the Sage Barista Express Impress?",
        "Peets Big Bang is my go to..very smooth..Starbucks is not good at all..",
        "Have you ever tried New Mexico Pinon coffee? It might not be the best but it smells great.",
        "Great video, thank you! What might be fun is if they were brewed all over again using the typical method that the average American would use. Basically a mediocre drip machine. I know it’s not up to the specialty coffee level but I would imagine that many of these coffees were designed to be made with a cheap Mr. Coffee. I’m curious how the results would differ if the brewing was changed.",
        "do a brazilian grocery store coffee taste test sometime!",
        "I don't know what dunken donuts does when they serve their coffee but the bagged stuff always tastes way better than when ordered as a cup",
        "Cafe du Monde is used for Vietnamese style coffee. It is made with a single drip filter. You put condensed milk in a cup then the filter on top with the coffee, then fill it with coffee. Cafe Bustelo is my favorite for regular coffee.",
        "you should try Cameron's Coffee, if you do this again.",
        "I’d love to know if the K-Cup versions of these coffees (if available, and aside from the downsides of K-Cups in general) would impact the results…",
        "Dark roast for me; Starbucks Sumatra of late.",
        "I'm quite surprised Nabob isn't on there but Tim Horton is; I'm curious how it would have fared",
        "I would be curious to see if you redid the experiment if you get the same results.",
        "How is it possible you never had Folgers??? Have you never drank coffee at a service station, family reunion, an office? Folgers tastes like family reunions we had in the basement of the Lutheran Church.",
        "Interesting!  Never heard of Philz Coffee - If it is available in Canada, I'll give it a try.\nFor basic coffee, I've been drinking McDonald's McCafe, both at home and at the local McDonald's. I prefer it to the Tim Horton's that I used to drink.",
        "Mayorga was missing!  For my taste Mayorga beats Peet's and any Starbucks.  I like Peet's, however, no matter the roast there's nothing subtle about Peets.  As for Starbucks, every one I've tried except for maybe 2 roasts, has a typical burnt flavour.",
        "We are a tea household... HOWEVER, a head injury in 2015 robbed me of my sense of smell: a death-sentence for enjoying tastes. Death is taking me one pleasure at a time. ",
        "Yeah I concur with the Dunkin's Original blend - It's good stuff.",
        "I was more excited for the donut shop showdown in the semi-finals than the actual finals!",
        "My poor cafe bustelo:(",
        "This was fun.  I'd like to see more.",
        "James Hoffmann: Has never tried Folgers\n\nAlso James Hoffman: Has tried several almost century old coffees.",
        "That face he makes when he drinks the pikes roast is totally spot on. That stuff is nasty! \n\nI buy Tim Horton's coffee... I feel validated by my coffee decisions.",
        "You should do this for more countries. Would be really interested in what you have to say about supermarket coffee here in Germany.",
        "The slurping never disappoints. Love it.",
        "Thank you you tasted all this coffees for our sake",
        "Born and raised in the home town of the original Tim Horton's... Happy to see this coffee as a runner up!  Great post!",
        "Definitely do this again. Good to see the fast real time head to head comparisons.  Great video ",
        "Do a taste testing of Canadas coffees!",
        "I would love to see a regional tasting; here in the midwest there's Anodyne coffee, Collectivo Coffee based out of Wisconsin, Death Wish and Green Mountain are some grocery store brands you didn't mention, and Metric coffee, Dark Matter, LaColumbe and Intelligentsia are Chicago brands to check out.",
        "I'm not offended that James didn't love my brand. I didn't expect him to because he would've had one HELL of a cup of coffee. One thing I've figured out after living in Europe for seven years is that Americans tend to make coffee weaker at home. Most of our machines' baskets aren't even big enough for the amount of grounds to go with the number of cups in the carafe. It's not even possible to make coffee the way they do in Europe. That weaker brew mellows out the bitters at lot. This also drives us to go with stronger, darker grounds to get ANY flavor profile at all. It's really much more like drinking tea than a strong cup of coffee. ",
        "I live in Hawaii, so many brands of \"Kona\" coffee are available. They are touted to be among the best.",
        "The most impressive thing about this is his ability to keep the sip sound consistent in tone and duration",
        "Black Rifle Coffee Company 100% should have made this video lol.",
        "I love a good cup of coffee, but price also helps me determine what I’ll buy. We’ve been liking Gevalia.",
        "I lovee Philz!!!!",
        "As a Canadian I am just as shocked as James that Timmy's made it as far as it did. I am experiencing confusing pride in my cold Canadian heart. I think I'll celebrate the first snowfall of the year, as well as our second place finish with medium black Timmy's and a Cruller.",
        "Try Black Riffle Coffee. My new fav. But I'll try Hortons. Philz is pretty good, too!",
        "Do a best grocery store coffee for other countries such as Japan",
        "No Bonka? I bought it when I first moved to Barcelona, because of the name. ",
        "Since you don’t care for darker roasts as much why have light roast v. Dark or espresso roasts",
        "I'd like to see you do a taste taste of the losers from the 1st round. Because of the random tournament style, some better tasting brands may have been kicked out because of who it was paired against.",
        "As a coffee guy of literally decades I genuinely enjoy you work James. Odd some of youR other videos hit the issues I've wondered about like extraction, water pattern of spray head or absence thereof (you know the cheap little 5 cuppers that just have a nozzle in the basket and blast water like a rocket during the brew leaving the filter looking like a dam broke into it coffee spattered all inside) I now seek out coffee makers that have a sprinkler head like my garden watering can!  I have a high end Mr Coffee that has a head about  2 1/2 inches imperial diameter. When you brew coffee in it surprisingly it is better. My daily use Cusinart has a large sprinkler head but also seems to control temperature of the brew cycle better. Both do only a marginal job against professional set ups. However 2500.00 US is a tough sell to the office for a coffee maker. 100.00US is even a hard sale!",
        "I am german living in america and I could not find a good tasting coffee for years , I drunk Folgers for a while until I heard they have saw dust in the ground up version , many ground coffee's have stuff added to them that should not be in coffee like pesticides and stuff , anyways I stumbled over a coffee called DON PABLO'S PRIDE at Sam's club and it comes in whole beans has a light cocoa flavor and is low in acidity, I use the French press to brew that coffee and it is the only one I drink I hope you get the chance to try this one",
        "Thank you for your professional taste buds opinion! This was something needed. Round 2 in a few months? Sign me up!!!",
        "Dunkin doughnut coffee beans is the way to go",
        "Love my 8 O'clock!",
        "8 O'Clock coffee, specifically columbia peaks, is a pretty good grocery store brand.  It can be hit or miss but when it's good it's really good.",
        "How did you prepare the coffee? Having worked in coffee shops, they may buy good coffee but it is run through drip machines in big batches, and may not be performed the same one employee to the next; that might explain your bad experiences. Could you throw Alterra into the mix?",
        "6:10I bought that yellow one the other day, it taste horrible, I threw the whole bag away",
        "I was so disappointed when you kicked out Chock Full o' Nuts! I'm going to try Community, though. I've sent that one around and it seems decent",
        "\"Am I way Hoff?\" ",
        "YOU CAN NOT COMPETE WHOLE BSAN WITH GROUND.  They do have a different quality. Do separate taste tests. Phil's should be disqualified on the fact it was not ground to star.",
        "Philz is a pour over only coffee shop with a huge variety of roasts...I think James needs to have a Philz experience some day",
        "Vegetables. So funny. Love watching your reactions and comments.",
        "As a Canadian I'm only watching to see what he thinks of Tim's. For some reason it's a national treasure here. People love to complain about it, but line up every morning to buy the shit.",
        "Fun video with some surprises.",
        "Updates as I'm going through the video: I tried Tim Horton's alongside Dunkin' Donuts and Honey Dew myself, and Tim's definitely won. I couldn't get Honey Dew brewed properly because it was pre-ground (like Tim's), and it was too coarse.",
        "As a Canadian who doesn’t really like Tim’s, I still couldn’t help but shout “that’s my boy!” every time that cup went through",
        "I love how something called \"Community coffee\" with an american flag on it (Which just reminds me of mass produced cafeteria coffee) completely wrecks Philz",
        "I find it interesting and a bit funny that his three choices for medium roast coffees were all major chain coffees. His choices for light and dark were both more unique, lesser known brands, but the medium were all things you could grab a cup of on your way to work. :D",
        "\"Coffee Supermarket showdowns video\"\nDoesn't see 1850 Folgers\n ",
        "Interesting choices! I love dark dark coffee and Peet’s MD is my go-to. Being a Northeastern person, Dunkin is a familiar flavor profile, but over the past few years I’ve been less inclined to buy it. And I love Tim Horton’s when I’ve had it-primarily in Newfoundland locations. I confess that we keep Cafe Bustelo in the pantry as ‘emergency’ coffee, hee! Great episode!",
        "Is the Swedish brand Gevalia roasted in the US or in Sweden? Bags have quite different design in Sweden. \nI think you should do this for each and every country! Begin your tour in the big coffee consuming countries Finland, Norway, Denmark, Iceland and Sweden! Looking forward to to this!",
        "I'm not a fan of Tim Hortons either, but I find it really funny how a Canadian brand came second in the American coffee comparison",
        "Lmao my favorite Coffee is cage bustillo so  different strokes different folks haha",
        "I am from the San Francisco bay area in USA California and I was not surprised you pick Phillz, they're really good. I like Peet's who is also from the Bay Area and their dark roast is really good with cream (in my case condensed milk\"",
        "When I worked for Starbucks, we were allowed to take home a free bag of beans every week, and Veranda blend was basically the only coffee I drank for about 3 years because of that. It’s surprisingly drinkable, all things considered. James’s face on tasting the Pike Place roast definitely brought back memories though.",
        "I work next to a Philz and it is by far my favorite chain coffee. Nice",
        "I like Gevalia.",
        "Ooo I see Caribou in there! ",
        "As a Canadian, I am as gobsmacked as you are that anything Tim Horton's made it that far. Wow!",
        "Now do Canada!",
        "It'd be interesting to compare the different light roasts, medium and dark roasts that coffee shops have to offer, like Starbucks. I've always liked their blond roast",
        "Not missing anything at Timmy ho hos.  Trash coffee. Astouding that the grocery store version beat out some of those others.",
        "I’m really just happy I live near-ish a Target that carries Blue Bottle.",
        "The cringe of every Canadian watching when he called Tim’s “American” was palpable",
        "I laughed my ass off at the thought of the Tim Horton's winning and James sticking the American flag next to it at the end",
        "It's Lavazza. Fight me.",
        "(designer here) it’s remarkable how the less good coffee also has less good package design (yes i am aware how subject that is), but i’m a designer so…i’m right :)",
        "Could you please make a video on Black Rifle Coffee Company? I like their coffee, but I want to make sure it’s not a placebo thing and I’m actually getting good beans.",
        "I would definitely like to see you  try whole bean versions of grocery store coffees. Some coffees I dont normally like as ground either but the whole bean does taste a but different from some of those brands",
        "I just had my first Philz coffee at a Philz coffee shop in California and it was one of the best cups of coffee I've ever had!  It was Tesora blend.  My wife's coffee of a different blend was not nearly as tasty.  Also, expensive as each cup is carefully brewed as a pourover by a barista.",
        "That moment when you realize you are having a great time watching... a reaction video. ",
        "Been a Peet’s fan for several years. Medium roast…Cafe Domingo",
        "Ok, but why did Dunks do okay, but is quite sad in-store? Am I ordering the wrong thing? Someone, please educate me.",
        "The American coffee palate is burnt and bitter. Vestige of cowboy cups. \"Puts hair on your chest and a pep in your step\". Sweeten with hair of the dog",
        "Tims easily has the worst coffee (here in Canada) when you don't brew it your self. None of my coworkers like it either. I think it tends to be convenience that keeps people going back...there is almost a tims at every other corner.",
        "Where does COFFEE, INSTANT, TYPE 2 rank? I hear it's the best!",
        "Well James and I have common ground on chicory. Blagh! Yes, the US is a big place* and there is variations across the country. I'm also convinced that who buys the beans, where they are processed, how they are handled during process is going to change even within a brand. In short you can buy the same brand consistently but it will fluctuate in taste, even dramatically.",
        "Slurping=gets ya a slapping",
        "I would love to see some videos on Q grading and how one acquires it. Elevation and why coffees above 1600 masl are what they are. Also, a video on types of roasters such as air, hybrid, gas drum, etc. All things I love to nerd out about so I am sure others would enjoy them as well. \nCheers!",
        "It's not the brand.  It's the age of the beans.  I've bought the same brand several times and each time it tastes differently—basically from how long it happened to have been in a warehouse or sitting on the shelf.  Coffee beans can be as old as ten years old, and as fresh as recent.  Advertising and marketing practices have got everyone barking up the wrong tree."
    ],
    "comments_disabled": false
}