{"video_id": "pfqvTCgglYA", "comments": ["To address the Philz controversy: I didn’t realise they weren’t widely available. It was heavily suggested in the Patreon poll to pick the coffees, so I presumed it had decent distinction US-wide. My apologies! I also don’t think I understood the massive grocery variation by region (coming from a small island). Feel free to pick your own winner from the top 4! Regardless - I hope this was a fun video!", "I thought it was very funny that he consistently described the Canadian coffee as \"friendly\" ", "As a coffee nerd this was probably a lot of fun for you to do. As a coffee nerd from the US, and also from Texas it was a ton of fun to watch. Yes there is a good bit of variation in what is available throughout the US. It wasn't 10 years or so ago that you had to go to Louisiana to get Cafe Du Monde, now you can get it in most large chain grocery stores and a good bit of smaller specialty grocers. Even within the medium to large states in the US there is a pretty large variation of what is available in the local grocers. The same even goes for the grocers in large metropolitan areas. With the amount of choices in product they tailor what is on the limited shelf space by the demographic of the neighborhoods they are in. So you might have to drive a good 30 miles to get your favorite brand of something. Cheers! Another great bit of content!", "I’ve long said that Dunkin’s original blend is some of the best of the basic coffees you can get from a grocery store, and now I am so glad that you have affirmed that.", "As a former philz employee, it was nice to see their flagship blend-the “Tesora” get kicked out early, but the silken splendor was one of my personal faves and easily the most popular light roast, probably in the top 3 most popular philz coffees in general out of the 15+ blends every store has.  Nice work, I’ll have to pick myself up a bag of silken splendor and remind myself what all the fuss was about.  It’s going to hurt to have to pay full price though ", "Found it very impressive how consistent your choices were. Basically every head to head was guessable. Your ability to distinguish profiles and judge the quality is really impressive.", "As a Louisiana native, the Cafe du Monde reaction was PERFECT. Working in New Orleans for many years, I think I’ve had black chicory coffee requested once. It is basically always served as Cafe au Lait (milk coffee). If you’re lucky, there are beignets involved and the bitter, smoky chicory stands up against the fried dough and mountain of powdered sugar.", "As a Starbucks employee who hates Pike Place, seeing James wince at a slurp of it is all I’ve ever wanted", "As a Viet American who grew up drinking my dad's Cafe Du Monde that he makes every single day with a phin and some sweetened condensed milk, I found your immediately strong reaction to the chicory hilarious. This whole video was highly entertaining, and I was also very surprised by some of the results. I don't really buy grocery store coffee, but I did enjoy plenty of cups of Philz back when I lived in California. Please keep doing more of these, perhaps with brands from more parts of the world! (I now live in the Netherlands and would love your opinions on what can be found here ", "Gotta say I’m really delighted to see Community Coffee make it to the quarter finals. It’s always my go to brand when I’m out of freshly roasted beans", "When James picked the Chock Full of Nuts, I knew he'd burnt out his taste buds for the day.  It's like going to the perfume counter at Christmas time; you smell so many different things that you end up buying something that you didn't like.", "Im actually drinking the Pete's coffee major Dickason's blend but in whole bean form and it definitely strong on the roasted aspect of it. It's still very good, I certainly enjoy it. Not too harsh in terms of acidity, nice to sip on, and the flavor develops pretty well as it cools down. It's a touch on the bitter side, but I enjoy that aspect of it, although adjusting the grind setting could probably help change that. Overall, I'd recommend it too", "The most impressive thing about this is his ability to keep the sip sound consistent in tone and duration", "As I work corporate for one of these manufacturers, I have been waiting for us to be trashed by James for so long :)", "This would be such a great mainstay on your channel as a recurring series as there are so many more people buying these coffees than care to admit it. Plus, as one of those people, I know firsthand that these coffees change by batch and season as time goes on as you implied with your mention of past experiences with Tim Horton coffee. I now buy specialty local coffee from Onda and Kuma of Seattle for myself, and grocery store (usually Dunkin or Peet's) for my family since they like creating creamy abominations with it anyway. I'd really love this to be a semi-annual series! Enough time between episodes for there to be a noticeable change in products and perhaps even a little taste bud rehabilitation ", "I actually like eight o clock coffee. I used to work at an A&P years ago and would grind the fresh beans for customers. The store always smelled sooo good. The coffee tastes good too. Was very popular.", "I can't believe my \"everyday coffee\" did so well. Proud Canadian here watching Tim Hortons do so well!", "I used to drink Dunkin but I found it too lightly roasted so I started blending it with darker roasted coffees. (BTW, You can get 3 bags for less than $20.00.) I've tried other whole bean coffees but turns out I love Tim Hortons. I still blend it but don't use as much dark roast.", "The Vietnamese coffee take got my eyes watering laughing.  I knew your reaction would be good and I couldn't have hoped for a better one.", "As a Canadian, the Tim's and Dons matchup was absolutely thrilling", "That venomous \"I know what you are\" at the chicory imposter was everything! ", "Trader Joe’s, a smaller novelty grocery store has many, many coffees, which I think are mostly theirs. I would love to see you do taste testing on those! I enjoyed this taste test. Thanks!", "I would love for you to do this with whole bean grocery store coffee! Also curious if you liked any of the coffee or if it was better by comparison!", "I have been drinking Peet’s Coffee Major Dickason’s dark roast exclusively for 2 years now. The first coffee I tasted where I actually enjoyed the taste of the coffee and didn’t feel the need to drown it with my oatmilk creamer. Highly recommend to everyone. M", "This is definitely one of the most fun videos I've seen you do!  It's fun because we've all probably had some experience with these different brands, so I feel some sense of stake in the different contestants! \n\nYou should definitely do a  follow-up in a year or two.  Many of these brands have other flavors that I'd love to see them compared as well.", "I laughed my ass off at the thought of the Tim Horton's winning and James sticking the American flag next to it at the end", "Hey James, please do a version of this with coffee brands from Brazil! We have a great variety of brands, all with beans from Brazil, and people tend to be very loyal and passionate about them.", "I'm really glad you picked Philz actually because it's available at my local grocery store and it's phenomenal. Compared to most other commonly available coffees, it tastes smooth and lovely. It makes me wonder the quality of coffee I am missing out on elsewhere!", "I found it very interesting that many of these coffees had one blend that was awful(to James' tastes) and one that was very good. I would love to see a comparison of store bought beans vs coffees sold in actual coffee shops. Being from Massachusetts, I hear Dunkin' get mocked for their coffee, but I find it quite good. Inoffensive and smooth. Dunkin' iced is a staple. They always do it just right.", "Japan has a few chain \"coffee restaurants\". If you ever go, it might be fun to visit about five of them. Takakura Machi, Komeda's and Hosino, Dotour come to mind. They tend to sell toast and eggs or french toast, weird risottos. Might be fun to review the pairings in addition to the base blends. Would also be fun to review the convenience store chilled coffee. Some are quite strong for that kind of thing.", "I would love to see a decaf taste test! I've had to ramp down my caffeine intake for various reasons and I've been trying to find a decent cup of decaf - it would be fun to see you try some specialty decaf cups :)", "As a Canadian who doesn’t really like Tim’s, I still couldn’t help but shout “that’s my boy!” every time that cup went through", "Funny that his favorite was one that I have never even heard of. :-) \n\nMy apologies to the Puerto Rican and Cuban communities, \nbut I was pleased to see his reaction to Cafe Bustelo pretty much matched mine. People rave about it, but it’s one of the few coffees that I’ve bought and absolutely could not drink. Like if you were cooking dinner and burned it, so decided you may as well burn it completely, and then see if you could drink it. Nah. ", "This was extremely interesting, and funny to find out that my taste buds are not out of sorts when I have different cups of coffee!", "I am genuinely shocked that two of my favorite commercial coffees made it so far. I love when family give me Philz and Tim Hortons coffees.", "I was more excited for the donut shop showdown in the semi-finals than the actual finals!", "I think there's a few brands more readily available in the states that would've swept so I'm actually sort of glad things like Dark Horse weren't on here. This was so interesting, thanks James!", "As a Canadian, I was weirdly proud of how far Tim Hortons went compared to the other popular brands even though I rarely go to Tim's xD", "As a former barista at Sbux for 8 years, I went through extensive coffee education (which I don’t think they do so much anymore, having reduced their offerings dramatically since 2016). I found it interesting that you defined Veranda as a medium, when Sbux defines it as a light or “blonde” roast. This was the first time I’ve watched a video on this channel, and I really enjoyed watching you taste and provide your insights. That McCafe made it as far as it did was the one that shocked me. Thanks for sharing your thoughts.", "I would be curious to see if this head to head tasting would have ended up differently based on how they were paired. Especially after watching the video you did with Tom Scott it seems that in a tasting like this the coffee that you are tasting with it drastically changes your perception of the flavor profile. Great episode!", "I’m not really a coffee connoisseur but through a long period of casual comparison I have determined that whole bean coffee that you grind yourself is so much better than pre-ground. Also I don’t know what you used but a French Press seems to yield the best results for me.", "Jumping in to say that the du monde Chicory reeeeeally needs a dose of milk. I am not a milk in my coffee person on most days but when it comes to the chicory it goes from being kinda wild to being glorious.", "I get the Aldi whole bean coffee in the US pretty often and it's surprisingly decent! Single origin Peru or Nicaragua I think :) Great vid!", "When I worked for Starbucks, we were allowed to take home a free bag of beans every week, and Veranda blend was basically the only coffee I drank for about 3 years because of that. It’s surprisingly drinkable, all things considered. James’s face on tasting the Pike Place roast definitely brought back memories though.", "Loved this! I was pleasantly shocked at some of these! Please review espresso brands, this was so fun to watch ", "As someone who started watching right before mc monday this was probably the best summer of my life.  It's so sad to hear that techno has passed, but he really does never die.  With our memories and his amazing videos still here, we can keep him with us. :-/ :-)", "Philz is like 5X more expensive on Amazon than Timmy’s.  Seems like TH’s would be the best taste to value ratio.  Would be interested to see the others ranked this way.", "I'd love it if you can do all the whole bean coffee products commonly in stock at grocery stores. Whole beans will nearly always be better than their preground counterparts. Likewise, maybe a comparison of just the preground ones for those seeking pure convenience.", "I loved the whole show, and I would love to see you do another version which was just the whole bean grocery store coffee.", "I'm surprised how emotionally invested I got when it was Tim Hortons vs Dunkin.  Even though DD lost I think that's the most patriotic I've felt in decades.", "I'd love to see you do a rank of all of them. The bracket style makes me think that things get missed", "Comparative tasting and the bracket system was awesome. I’d like to see commercially available vs top shelf blind comparisons.", "I would love to see a review of the entire death wish coffee brand! Super intense coffees and I can never pick which ones I prefer", "Love the comparisons! Would be great to see you blind test 5 of each roast type against each other in the future. Always love the merch drops too.", "Maybe I'm crazy but it makes perfect sense to me that Tim's and Duncan did very well when properly prepared by James while in the store they aren't nearly as good having been rush prepared by the gallon. Both are very decent coffees in themselves.", "Wow that meta-edit at 9:07 was one of the smoothest transitions in a youtube video!we all know how excellent your taste in coffee is, but your taste in video production deserves credit too, between this, the brad pitt commercial, and the portable espresso videos, I nominate you for an oscar!", "This video was great. I have always wanted to see someone do this as I recently found myself in a similar dilemma that I bought three different bags! Love to see more head to head, maybe staying in the same roast levels?", "I think you should do this again with more brands!!!! Get philtered soul, Verve, Blue bottle, Intelligentsia, Stumptown to name a few! Thanks for the video, was awesome!", "Definitely do this again. Good to see the fast real time head to head comparisons.  Great video ", "This was highly entertaining! Definitely think you should make it a recurring feature :)", "Dunkin is usually available as whole beans at most grocery stores where I live and it goes on sale quite a bit. Solid choice when trying to save money or just want something simple.", "The big Italian supermarket brands like Lavazza, Illy, Segafredeo etc. would be great to compare and test.", "When I bought grocery store coffee it was always Dunkin and now I feel like I need to go try the ones that beat it  Even though my local roasted is definitely gonna be better anyway ", "This was fascinating! I laughed so much because I drink Bustello in a Moka pot Cappucino or Americano almost daily, and it is pretty intense. Being from the NW US I was happy to see Peet's and Starbucks did well in the end. Dunking Donuts was the biggest surprise for me. I guess the experience shows", "Thank you as always.  Not only do I enjoy your reactions, but greatly appreciate your feedback. I grew up in Portland Oregon and have been spoiled by fantastic quality and options in coffee. I have escaped the politics of my home town, but miss the coffee and food.  One of the old school roasters that is now available from Walmart of all places is Stumptown.  I would love to see how if fairs.  Also, Whole Bean Please.", "I'd love to see you do this with Danish coffee brands.", "I chuckled with expectation when I saw that Cafe Du Monde can. I knew he was gonna hate that.", "Your quarter finals match up between Tim Hortons and McDonald's was by far the most interesting to me! Up here in Canada, it's like mythology at this point that Tim's always had the best 'fast food' coffee, and maybe 10 years ago McDonald's stole their coffee supplier and Tim's had to get a new one, which wasn't as good. I myself still prefer McDonald's coffee for something cheap and quick on the go (other than Starbucks Blonde roasts), but it was really cool seeing you taste each head to head!", "Should absolutely repeat this regularly with different coffees from different grocery stores", "As someone who bought Chock fullonuts before, I can't describe how shocked I was before you pointed out your mistake", "I’d love to see a similar showdown but with the slightly higher end, but still widely available coffees, like lavazza, la colombe and the like.", "You should do a specific K-Cup shootout since admittedly that's where a lot of coffee consumers land.  Possibly a shootout between coffees from the same brand and then take the top from each and do an overall shootout.  That would be a content creators' dream towards a multipart series.", "Please do one of these with store bought coffees from Brazil, it would be fun to see your reactions to coffees ranging from dark to very dark roasts", "the fact that you described tim horton's coffee as \"friendly\" consistently makes me happy as a canadian", "I found this video to be absolutely not able to stop watching. I found some suggestions in it - Anyway - thanks for going through a taste test of the grocery market brands. It was also interesting your discussion on instant coffees (being available in the same grocery isle). just fascinating - thanks for time - cheers.", "I love the Starbucks veranda blend , in fact I really can no longer drink anything else... I get as individuals we all have different taste preferences , but I strongly suggest trying the veranda blend especially if you shy away from bitter dark roast coffee.", "CONTENT IDEA: Please, please run another comparison of “high end grocery store” coffee! There are at least a dozen roasters available at WholeFoods in the $18.00 price range. Would love to see you review! I’ll send you the bags!", "If you want to do more of these related to the US, I'd love to see you do different areas of the U.S. See what different brands available in many supermarkets in the Southeast, Northeast, Northwest, and Southwest are best in your opinion.", "Such an amazing video. Literally 18 minutes of constant entertainment thank you!", "I think it would have been fun to have a random specialty coffee thrown in to see if James could catch it", "Would love to see more taste testing of available brands. I've recently been drinking Salt Spring Coffee that is roasted in British Columbia..", "Funny video overall :D I really hope you would do similar or some other video about finnish grocery coffee (the heaviest coffee drinkers of them all). There are plenty of specialty coffee in Finland, but almost everyone drinks the grocery stuff and most of diners and hotels etc.  also serve the same grocery stuff.", "You should absolutely try the Saudi roasted coffees , specialty coffee roasters are now in every corner in the country so we have plenty of options to choose from ", "Please, visit a Philz the next time you're in the US! They have a delightful coffee selection and they do pour over right at the counter for you, while you wait. It's a completely different experience from almost every other coffee shop that I've ever visited.", "Have you ever tried \"café de olla\"? It is a Mexican recipe for coffe made in a clay pot with different spices. I would love to hear your opinion on it AND, if possible, an ultimate Café de olla", "It's interesting to see that each of the major coffee house chains (Starbucks, Tim Hortons, Dunkin) got at least one through to the semifinals", "I would love to see a Value Video. Ranking the coffees, and then comparing them on a price chart to see best bang for the buck coffee", "Hey James, have you done a review on store brand named coffees yet? It would be interesting to know how they stack up against the name brand coffees.", "Enjoyed this so much! Please do more. Hehe also do more from other countries. ", "Interesting choices! I love dark dark coffee and Peet’s MD is my go-to. Being a Northeastern person, Dunkin is a familiar flavor profile, but over the past few years I’ve been less inclined to buy it. And I love Tim Horton’s when I’ve had it-primarily in Newfoundland locations. I confess that we keep Cafe Bustelo in the pantry as ‘emergency’ coffee, hee! Great episode!", "I think this highlights the issue i normally have if I'm buying coffee at the store: everything is medium to dark roast, probably 90%.  Trying to find a light roast is rough, and the veranda  is usually what i end up with", "Absolutely loved the fact that Tim hortons and Dunkin’ went head to head as I feel like those are the two breakfast/donut places that have cult followings.  Reminds me of the Sheetz vs Wawa rivalry.", "Loved this video! Next time be sure to include coffee from Aldi. They are becoming the 3rd largest grocery store chain in America. I also suggest you do a Keurig brand/flavor testing if you dare!!", "The best coffee I’ve had is “Three Sisters” by kicking horse coffee.  I’m the adventurous type that tries new coffee brands regularly, buying them in stores as well as online.  There are a couple of brands that I consider my “go to” coffees and the best is Three Sisters.", "This was hilarious and rather enjoyable video. I got a kick of the reactions to all the brands I know. I share similar opinions. Thanks a bunch.", "I'd love to see you try some common European supermarket coffee as well", "So here in Texas, we have a grocery store brand that is better than the others I have tried imo. If you can can find a way to try the H‑E‑B coffees you should. My fave is Texas pecan ", "Anyone else pleased that he called the Canadian coffee “Friendly”? Lol, love it", "This video has been out 6 days and it is already the foremost video on the subject. This shows you that these type of videos are popular and more videos on the subject are needed. For example: What is the best coffee from Sam's Club, Walmart, or Costco (3 videos alone)? What is the best coffee from Eight O'Clock (Columbian Peaks vs Original vs etc.)? Best cheap coffee (under $1/oz.)? Let's talk about blending (Is it crazy to mix a super light roast with a little darker roast to add some smokiness?).", "Very cool assessment. I live FT in an RV in the US, so our coffee availability is quite limited sometimes. And while Amazon helps with that sometimes you just need beans that day. We recently grabbed Dunkin in that situation and it's pretty decent. Veranda is not bad for Starbucks but I do think most are over roasted."]}