{
    "video_id": "pGjXPH3W3W0",
    "comments": [
        "Guaaauuu, prima, te botaste!\nAmen!",
        "MADRID ️",
        "Un palo de música ️",
        "Toki Es tendencia trascendencia",
        "Te amo Nata nojoda",
        "Puro fuego entre esos dos !",
        "Nata cargando el género entero donde quiera que vaya, llega dejando huella marcando diferencia complaciendo a todos. Si dios es grande Nata tu eres grande !",
        " reventando!",
        "Ya nomas están sacando canciónes a lo pend3jo para que les paguen dinero",
        "A que esto no lo vieron venir",
        "Tokisha Bien mieldaaaaaa",
        "Esta súper la canción ",
        "Mucho antes de que sea viral ",
        "Nata fucking Kong 🇲🇽",
        "No quiero que te vayas\nY si un día te larga\nVoy a ser la sobredosis\nQue de una nota te mata",
        "Y esto que pinga es? ",
        "Buena letra... felicidades",
        "Dios mío. Tokischa supo describir ese sentimiento tan hp de sentirse usada, del dolor de salir de una relación donde tú querías mucho a esa persona. Amo tanto  esta canción y la voz de tokischa con  nathanael. A pesar del hate que está cayendo a mí me parece que es una canción buenísima y la voz de tokischa se adapta mucho a la melodía y a el sentimiento. Toki te adoro ",
        "Santo Domingo",
        "la única parte buena es donde canta el Nata Kong...",
        "La mejor",
        "Muy duro el tema. Evolución es la palabra que viva MEXICO y RD",
        "Macizo pa, PURO CT",
        "Respect for you, I love all such person who has guts of your sort ",
        "Ta bien qlera la cancion donde canta la viega mejor la hubieras echo tu mismo y habia quedado bien brga",
        "Tokisha está medio apagada",
        "Los medios de República Dominicana no se hacen eco de esta gran propuesta musical. (Doble moralistas) arriba RD 🇩🇴🇩🇴",
        "El compa nata",
        "Ella puede ir mejorando sus letras pero Roma no se fundó en un día.",
        "Tremenda joya",
        "ahora los corridos son otra cosa ya con el nata ya saben que FLOW pero con Toki ya es otro rollo 🇲🇽",
        "This song actually deserves more than a billion views and millions likes. ️",
        "La mejor colaboración sin duda ️",
        "En la cima",
        "Aquí si no la dio la tokischa, será un flop",
        "Ufff excelente",
        "This song is much better  ",
        "Hola Tokicha,BNDICIONES NENA ,EXELENT VIDEO. MI RESPETO PARA TI TOKI .DSD PANAMA.",
        "El que en realidad representa Mexico 🇲🇽️‍🇲🇽️‍🇲🇽️‍🇲🇽",
        "Bendiciones ",
        "1:27",
        "Ahora que toki monte a cano en un dembow rulay y lo baje para RD 🇩🇴️‍🇲🇽",
        "This is a masterpiece, show some love man!",
        "Pinche rolon alv",
        "La tokischa se adueño del género urbano Dominicano dura mi tokischa",
        "Amazing song and outstanding lyrics ",
        "Quien fue el productor de esta rola, las guitarras suenan al estilo del Danny Felix.",
        "Tokisha amor  amor  amor 🫶",
        "loved it    ",
        "Aqui los verdaderos fan de natael cano",
        "NATAKON EL REY DE LOS CORRIDOS TUMBADOS ARRIBA MÉXICO 🇲🇽🇲🇽 NATA ",
        "El único que le mete duro a los corridos tumbados, Toskicha no es me agrada pero esta vez si le metiooooo",
        "La pondré en mi boda jajajaja saludos Toki desde Santo Domingo RD🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴",
        "I can hear this song over and over️",
        "QUE FLOW COÑ0O 🇩🇴 QUE VIVA EL CORRIDO 🇲🇽",
        "esta bueno el tema con tokischa espero que no se repita Nata",
        "Que chingon suena el bajo. Han de ser arreglos de Danny Felix. ",
        "Yo tambien le meto en corrido y soy artista también",
        "Sin palabras otra vez",
        "Tokisha en la casa",
        "Que tema más bacano la toki lo hizo otra vez en este país nadie destaca tu talento y cuando venga aver será tardes",
        "Solo me gustó la parte de nata jajajaj mal dueto",
        "Awesome",
        "Cantan igualito",
        "La canción más sana que le eh escuchado a Toki...",
        "Love it !",
        "La mamá de la mamá con el papá de los papá. Activo desde RD",
        "El videoclip es       ",
        "Hasta la luna y sin escala ",
        "HICE UNA VIDEO REACCIÓN EN MI CANAL",
        "ORGULLO DE LOS AUTOCTONOS DE ESTAS TIERRAS <3",
        "Siempre number_1",
        "A toki no le queda el corrido gua gua guau guaguau",
        "Que corrido ahhhhyayyaahay arriba tokisha 🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴gracias México por apoyar está súper estrella ",
        "Desde Bab bunny y ahora tokisha mis respetos Natanael cano",
        "That bgm gives me goosebumps",
        "Saquen una versión sin Tokischa",
        "Donde estan todos los que creímos en esta gran artista ",
        "",
        "Dura esta canción ",
        "Dios esta bacano el tema me encanta",
        "100%",
        "Vlv que la gente piense qué yo te dañe, si me tenías a tus pies 🇲🇽🇩🇴",
        "Natanael dejando su huella un duro delos corridos ",
        "Sios bendiga este proyecto",
        "Sinceramente no me gusto, Me gusta mucho la música de Tokischa pero esto no",
        "Una copia barata del ritmo de la canción de Karol G .",
        "Natha kong",
        "Lo mejor de tokisha menos malas palabras mas letras puedes ser super famosima mundial mente cambiando la vulgaridad",
        "This is the best version after the original!",
        "Quejesto",
        "Que bonita song toki",
        "Fatal",
        "No me suelen gustar las canciones de la locaria pero de vdd q este es un clasico pa fumarme un bareto",
        "Jeje pensé que decia \"kvlxs de amor\" jaja en qué ando pensando",
        "Esta cancion le dará un giro a tu carrera tokisha para bien ya verás.",
        "Something different why not ",
        "quien se espero esto wow domonicanos y mexicanos asiendo historia",
        "@coreanoloco reacciona",
        "Puro CT",
        "Desde Francia 🇫🇷",
        "A Esto Si Le Llamo Tumbado Ya No Lo Escuchaba Desde Cuando Empezó A Cantar Con Óscar Maydon Y El Amilkar Y Luis R y Víctor C. Y Está Rolita Trae lírica Tumbada cómo al inicio de tiempos de Danny Félix hoy puedo decirle al Natanael Cano puros corridos tumbados",
        "Whats up brou \nArriba Mexico\nYes sir",
        "me encanto la cancion no soy fanatico pero me gusta las colaboraciones nuevas y que haya una vuena convergion con las voces",
        "Great song.  I can see this on a movie soundtrack...",
        "Excelente, se escucha muy bien, que  bueno que Tokischa está explorando un nuevo mercado, que tengas mucho éxito ",
        "You will never get bored listening this song in loop",
        "Asombroso !",
        "🇩🇴🇲🇽",
        "This is actually really good",
        "Nata rompiendo ",
        "Te la rifaste Bro muy bien dueto.",
        "baby",
        "Felicidades tokicha",
        "Puro CT compa Nata",
        "Popola tumbada 🇩🇴",
        "Mis respetos ",
        "Rayos que rifados",
        "This song is so underrated it deserves more it's a masterpiece.",
        "la versión sola de Nata está al million ",
        "El tema está muy bueno dónde están los moralistas apoyen las lestra limpia de tokischa",
        "Nata cata mejor tokischa la cago no le queda cantar este tipo de Canciones ",
        "Me gusto este junté y bellos es México",
        "XD yo esperando que cante algo de su popola,  pero igualmente un nuevo estilo más tranquila la tockishaaaaaa",
        "Esta buene a",
        "Vine aquí por alofoke,,,el dotol dio la luz",
        "Colombia",
        "Beautiful and awesome acting",
        "Do",
        "Brilliant",
        "A quien más le ubiera gustado que la ubiera sacado solo nata ni se le entiende a esa vieja jaja canta feo",
        "No expensive cars , no alcohol only tea and pure love ️ this song is justtttt ️",
        "La verdad no es nada lo que ella hace en su estilo pero me gusta el vídeo, la música, el canto de ambos artistas.  Me gusta ojala ella cante mas de esto o al menos un disco mas que de amor. Puede ser de temazos! Seria interesante... Ame︎‿︎ARTE",
        "Me ha encantado",
        " wow me encanta esta canción",
        "Muy duros",
        "Love it ️",
        "te amo toki",
        "CT",
        "Pura Cagada de Musica Cantas Diosito llevatelos y devuelvenos a Chalino",
        "Primera canción que me atrae de la toki",
        "Desde 🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴️",
        "Tokischa debería sacar un Solo Version sin el Natanael Cano, la vibra de ella es muy diferente y se disfruta más que la de el, medio arruinó la canción el Caño",
        "Ok",
        "Tokicha tumbada",
        "E w la neta esta alto bien la canción se la rifo tokisha",
        "Aquí los fans del rey de los Corridos Tumbados \n\nNataKong, el más duro! Eaaaa",
        "Toki es mucha mujer para el Nata",
        "Esa es mi prima ",
        "Muy dura",
        "Y ahora que van hablar de tokicha eso es una bofetada sin mano para los que hablan mielda",
        "Santiago no se equivocó",
        "Tokisha deberías cantar corridos más! La neta",
        "Es una pupu",
        "Me caías de la chin...da, pero adónde pusiste a cantar a la tokisha.. Sr Natanael mis respetos.",
        "No nos esperábamos que toki iba hacer madrina tan rapido",
        "ya a tokischa no la para nadie hace rato que alzo el vuelo, me encanta",
        "Esto es Músicaaaaaaaaaaaa, y puros corridos tumbados COMPAAAAAAAAAA",
        "Me di cuenta que aquí nadie se da cuenta detrás del video hay un mensaje subliminal. Para los despiertos sabe de que hablo..",
        "Que buena rola ️🇲🇽",
        "La neta me gusto esta canción, para mí gusto la voz de tokischa está le queda al ritmo de los corridos ",
        "Estan rraros esto es musica ??? Hahaha",
        "El weso que nota me da este tema Natanael cano y toki ",
        "Buen talento el de natanael cano y buena voz pero de la chica no podemos decir lo mismo I'm sorry but I'm not sorry",
        "EL MÁS DURO DE MÉXICO CON LA MÁS DURA ",
        "Alguien sabe Quien hizo el requinto .. Se parece que es dany felix?",
        "Natanael anda con Todo.",
        "Felicidade tokicha asiendo música limpia",
        "Vengo apoyando , a ella no la conocía, pero les quedó al   Y pura lumbre viejo ",
        "Era hora, será un gran éxito esta canción, hay igual que yo existen muchas personas esperando cada una de tus canciones. Te deseo el mayor de las bendiciones Tokischa eres la mejor.",
        "Ese nata e puros corridos tumbados...",
        "Uy ",
        "Desde que la escuché en NPR y escuché esa guitarra supe que era la colaboración con Nata la esperaba para principios de Diciembre para andar bien placosona pero que chido que la sacaron antes, arriba Tijuana y Monterrey y Tokischa BB ️",
        "obra de arte",
        "Bravo tokisha y cano",
        "Que chimba de tema fuegooo saludos desde colombia",
        "Я русский. Ничего не понимаю но мне очень нравится. Музыка из души в мою душу.",
        "No soy seguidor de Tokisha, ni comparto su música, pero sin dudas este tema está muy bueno, le queda ese ritmo",
        "Uff ",
        "Que chimba de rola",
        "Se ve que traen buena palpa",
        "El nataaaaaaaa",
        "🇲🇽🇲🇽Ready",
        "Duro el nataaaaa balb",
        "Q vergüenza es este tipo para mi México ️️️",
        "Wow toki me sorprendiste",
        "natanael aportanto al progreso de tokischa gracias cano por ver sus talentos y no ser corto de mente",
        "Maravillosa  me encanta esta música",
        "Aquí intentando que me guste esta canción porque el natagood solo hace himnos",
        "Waooo ni una sola mala palabra ",
        "🇲🇽🇲🇽🇲🇽🇲🇽",
        "Lo mejor <3",
        "Todos se van a ir al infierno con dios no puede el mal recuerden lo ",
        "Primera vez que escucho una canción de tokicha entera.esta si me gusto",
        "El unico que canto bien fue nata",
        "Amazing",
        "Nececito un dembow entre ellos dos",
        "Tokisha es una artista tan versátil, cualquier género le quedaría bien, la amo",
        "tokischa ",
        "Wow",
        "Una Rola para toda la Rasa  dominicana x México ",
        "Pot fin algo inesperado!!!! Felicidades a los dos!!! Toki you did a great job!!! And clean verses too! Impressive!!! Arriba Mexico y DR 🇲🇽🇩🇴",
        "Le quedo muy linda la canción.  Let it out tokischa don’t worry about the world.  Tu pertenece también es nuestro planeta nuestro.  Que se joda el odio ",
        "Muy hermosa migración de Tocky sabía que esa voz podía pegar en cualquier genero",
        "🇩🇴",
        "The movement he started acting was wow.....and i was like that movement litterlly touches my heart️️️️",
        "Cayó tokisha en ritmo con el corrido!",
        "Beautiful ️",
        "Australia!!! Love!!!",
        "Se escucha mucho mejor la Tokisha sin las groserías",
        "From okc !!!!!! ",
        "️️️",
        "eslumbrantemente bella ",
        "Si está fea la tokisah....",
        "Ta duro",
        "La unica parte buena es la de nata",
        "Está muy perre todoooooo",
        "Me encanta esta propuesta, Toki muy bien!!",
        " Amó los corridos, y definitivamente esté sé a vuelto uno de mis favoritos ️... Eres la mejor",
        "Tokischa graba algo con stains fog",
        "uffff ufff",
        "Finalmente!!! felicidades a ambos  y especialmente a Tokisha por ese cambio.",
        "Toki️",
        "Tokisha y sus gallos, visuales dañinas y de perversión, no hay cambio.",
        "La Toki representando!!!",
        "Aquí se aprecia el verdadero talento de tokischa",
        "Que es esto natanel¿que te paso? ",
        "Solo un verdadero fan de tokischa sabe dónde se escuchó está canción por primera vez ",
        "Quien se casaría con una loka así. Ta loko",
        "Natanael le puso el ritmo  . Bonita la canción fuego  se va pa los Grammys",
        "Uffffff que duro",
        "Ya se dañó el corridos  no ombe",
        "Frida Kahlo",
        "DIOS BENDIGA ESE TALENTO DE TOKISHA E NATANAEL CANO Y TODO EL QUE ESTA LEYENDO ESTE MENSAJE ️",
        "Esperaste mucho para soltarla ️",
        "🇲🇽️",
        "Desde Puerto Rico 🇵🇷 el proyecto le quedó duró! @tokisha @natanael 🇵🇷🫶🇲🇽🇩🇴",
        "Arriba Méxicoo perros Arriba la Bandera CT🇲🇽",
        "Toki te amo :') ️",
        "Diablooooo tokisha en un corrido esto se va pegadooo",
        "I love this song and Amazing  feeling ️️",
        "Ese we canta mucho",
        "El asunto es su voz, si la tuviera menos chillona sería un éxito pero es difícil ️ ella no es cantante y eso es todo",
        "Ala verga",
        "Grande mi Natagood ️",
        "TE AMOOO NATA️",
        "Súper. Esta muy buena la canción y el video. Que viva Mexico 🇲🇽 arriba República Dominicana 🇩🇴",
        "Como se llama este género?",
        "Lo bueno es que se muy hot escuchar sus canciones y estar singando con su amorcito\nGran artista la tokischa",
        "Viva República Dominicana y México ️️",
        "Muy buen tema",
        "Pura lumbre ",
        "Me encanto este tema ",
        "Admiro su trabajo, Mi Sueño es vivir de la música como ustedes trabajo de 7am a 8pm y invierto mi dinero a la música y algún día grabar con grandes artistas, he trabajado pase lo que pase por lograrlo y confío en Dios que tarde o temprano mi sueño será realidad, mientras tanto te felicito y yo seguiré luchando",
        "No dormí  esperando  esta música   toki siempre  rompiendo  🇲🇽🇲🇽🇩🇴🇩🇴",
        "Durisimooooooo",
        "Empieza la canción 1:35\nContinúa 2:44",
        "Quien aquí después del despeluñe en alofoke ",
        "Muy duro  bendiciones ",
        "Nata se la rifa,aunque mucha gente le tire mrd. Se la rifaron l@s dos",
        "Super",
        "Sabias que tenia una voz bonita, que alegria es la primera canción que escucho completa tuya, hermosisima voz. BENDICIONES",
        "que dura la toki",
        "Damn Que Rola!!!!",
        "🇩🇴🇩🇴🇩🇴🇩🇴🫡🫡🇲🇽🇲🇽🇲🇽🇲🇽",
        "Este tema a Martha Heredia le avía quedado fenomenal pero bendiciones para mi tokisha lo hizo bien",
        "AQUÍ SIEMPRE APOYÁNNDO NATAKON EL REY DE LOS CORRIDOS TUMBADOS 🇲🇽🇲🇽  NATA ",
        "No me gusta nada tokisha",
        "Hablen ahora los hater de tokicha ",
        "y se murioooooo",
        "Felisidades tokicha mi reyna muy linda cancion siempre e confiado en tu pontencial para aser cuarquier clace de musica te amo",
        "Ni que México fuera importante, esta no es Tokischa",
        "Deberian sacar un disco juntos ️‍",
        "🇩🇴🇲🇽🇩🇴🇲🇽",
        " me puso la piel de gallina noce porque ️",
        "Tokiiiiiiiii la mejorrrrrrrrrrrrr",
        "Fabulous ",
        "Nataaaaaa",
        "tottally owsm ",
        "Gorgeous ️",
        "Y",
        "Que pinche rola wey se pasaron de verga se lo dice un dominicano ",
        "Duro ",
        "se adelanta a su tiempo latina haciendo tendencias",
        "Por fin tokisha",
        " me siento tan feliz de ver a mi toki haciendo lo que a ella le gusta & rompiendo estándares como siempre",
        "Entre por morbo, y leo puro alusin y extranjeros xD\n\nMejor me largo de aqui",
        "Que rolon",
        "Bendiciones bueno contenido mi amor",
        "This song hits differently",
        "Puro fallings",
        "PURO CORRIDO TUMBADOO COMPAAA",
        "I like",
        "Toki solo te c nesecita un ft con cardyB",
        "Nunca me imaginé a Toki cantando corridos, que joya, ella la más versátil",
        "Tokisha?? No lo puedo creer con Natanel, Humildad sobre todo , digo ahora hasta con Madonna , me asombró!!  Excelente!",
        "Que bueno es Natanael y que bien canta Tokisha",
        "Aqui intentando de hacer qué me guste esta canción porque el natagood solo hace himnos",
        "what a voice nice song",
        "Great Song",
        "0880",
        "Aquí los que vinieron solo por nata",
        "No me la creo",
        "Nata rompiéndola. el más duro de México sin duda ",
        "Que sentimiento tiene esa guitarra",
        "It's a Bop ",
        "Uff el nata se la rifa machín",
        "Primera vez que tokischa canta algo que sirve saludos desde República Dominicana 🇩🇴",
        "Te amo toki.....nunca me faltes mi vida️",
        "Simplemente nata no falla",
        "Esta pana canta súper chillonnnn 🫠🫠🫠🫠",
        "El Flow del Natanael Cano es increibleeee",
        "Esto es una broma?",
        "🇩🇴🇩🇴🇩🇴",
        "Lo ame",
        "Bendiciones tokicha trascendiendo nuestra cultural 🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴",
        "This song is just wow ️",
        "Y que cajero es esto ",
        "Nata ",
        "Que más falta de amor que tanto rito, olvidados y dejarán de ser pronto, recuerden que lo que le gusta a la Mayoría de la gente es mal, muerte, venga, y demás, menos amor️. Dios ",
        "Bua, temazo 🫡",
        "Asumecha..todestaba escrito. Vienen cosas peores. Quecaray",
        "Wow no me gusto al principio pero ahora estoy fundió con la canción ",
        "Muy bien toki voy a ti  te apoyamos en toda la etapa",
        "Ahuevooo tiene que estar en tendencia. ",
        "Vendrán cosas peores dice la biblia ",
        "joya",
        "Quien más lo repitió como 6 veces...? ",
        "Encantado escuchar el nuevo tema  Tokisha gracias por tu arte",
        "puro natakong",
        "Me gustaría ver más de mi dominicano, incurcarse, mezclarse más con este ritmos,una mezcla divina,dos culturas,dos ritmos, saludos mi razas 🇩🇴🇩🇴🇲🇽🇲🇽.",
        "No esta mal... Aunque ambos dan cringe, esta rolita no esta mal",
        "Nunca pensé escuchar a la Toki en un corrido tumbao pero alegra estar vivo para vacilarme esto ️",
        "I have no words this song",
        "Por más corridos ",
        "Tokischa nd Nata did a great duo. Much love desde USA",
        "Natagood rompiendo como siempre, era para que le dejarán otro verso, Toki estuvo normal, esto quedó cabrón. ",
        "temon",
        "Mi mamá me dio la vida, pero Tokisha me dio ganas de vivirla. I love u, Tokisha Popola :)",
        "Se siente la diferencia de un cantante de verdad y una q se cree cantante, solo digo",
        "El nata 🇲🇽 🇩🇴",
        "Excelentes artistas ambos pero me quede esperando un poquito más ",
        "Nmms que es esto haha",
        "🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴 MUY BIEN TOKI GRACIAS",
        "Tokichaaaa  la rompió ",
        "muy duroo carajooo un exitooo segurooo a fuegoooo",
        "Desde Mi Bella Colombia... VIVA MÉXICO \nEy tu el que esta leyendo esto con la mente, Dios te bendiga a ti y a tu familia Viva Cristo Rey ️",
        "Alch canta bien ogt la morra",
        "En Colombia 🇨🇴  también  se escucha TOKISCHA!",
        "Corridos tumbados  el mejor, me comí todo un género entero en 10 segundos 🇩🇴🇲🇽",
        "Tokisha la yoko ono de la actualidad .. el talento de no tener ningún talento ",
        "Duro el tema ",
        "Me encantó el\nVídeo de la toki y espermita digo con el precoz ",
        "HERMOSO ME ENCANTO !!! ESTOY ENAMORADA DE ESTE TEMA Y DE ESTE VIDEO POR FAVOR ! GRACIAS",
        "Bendiciones",
        "AMO A NATA pero se la rifo mas la tokischa  arriba mi país México!!",
        "Pero buena la canción... excelente  tokisha!!!",
        "Desde Estados Unidos besos para mí tokischa ️",
        "🇩🇴🇩🇴️️🇲🇽🇲🇽",
        "Ima be listening til the end of times…",
        "Mi Novia Como Yo El Digo  Tokischa La Mejor  Rompio ",
        "EL DUO QUE NADIE PIDIÓ PERO TODOS NECESITABAMOS",
        "Sigueme si eres fan de Nata",
        "quedo muy buenooo, lo habia escuchado en el tiny 🇦🇷",
        "Deben sacar un álbum.",
        "Nice",
        "Me recuerda a wos, la parte de tokischa",
        "Que duros los dos",
        "TEMONNNN",
        "En RD 🇩🇴 se escucha mucha música mexicana. Los corridos son muy populares por las historias que cuentan. Es buena letra. Gracias México 🇲🇽️",
        "La Republica Metiendo mano  la toki te la comiste . Natanael tienes un fan nuevo ...  🇩🇴  🇲🇽  talento de sobra.",
        "Hay que aceptar que la única parte buena es la de nata",
        "No soy mucho de esta música pero esta si me gusto esta chignon",
        "Corridos Tumbados eaaaas",
        "El día blaso con lágrimas en los ojos es lo único que te puedo desir es que con la piel grifada la loca la tiene República Dominicana 🇩🇴 ",
        "Mira esa toquisha se parece a mi ex .. bien dura igual q la rola a huevo ",
        "Dura la toqui",
        "Nata carreando todo el tema :b Grandeeeeee",
        "El Natakong 100%\nTokisha -10000000000 ",
        "Rompieron duro 🫶",
        "Que joya",
        "Vamos natanael  y tu amiga arriba suerte mucha vamoooos",
        "TOKISCHA TE FELICITO LA MEJOR CAMCION  QUE  A ECHO",
        "Ya vino tokicha a dañar los corridos ",
        "Ufffff",
        "Ahuevoooo puro Natanael Cano",
        "aquí en México está en tendencia nacional, y sigue, a 6 días está en el #16",
        "otro pedooooo",
        "Puros corridos tumbados 🇲🇽🇲🇽",
        "Me sorprendio Toki en un corrido. Nata puso a todo el globo en esta movida. Grandes!!!",
        "ROLOTA",
        "Awesome song",
        "Top tokisha",
        "Bueno señores toda la música no sé oye",
        "Que voz insoportable.",
        "tokischa entrando al mercado mexicano",
        "La mejor parte es cunado le adelantas y pones a nata god🇲🇽️‍",
        "Ni la chimpstrufia lo pudo hacer mejor",
        "Bahh mt bom 🫶",
        "1:35 la mejor parte sin duda ",
        "Dura la toki metiéndole con el criminal de cano 🇲🇽 ️‍ 🇩🇴por la cultura",
        "6 dias para q el nata suba unas rolonas pasadas de ver !",
        "TOKI ya es hora de una con KAROL G",
        "QUE TEMASO🇩🇴🇲🇽",
        "Me encantooo ",
        "Tokisha suena como yung beef",
        "humilde el nata carreando temas",
        "🇩🇴🇩🇴🇩🇴🇲🇽🇲🇽🇲🇽🇲🇽🇲🇽",
        "Tokisha. La mejor",
        "Me encanto este tema TOKI tiene buen flow para el Corrido- ME ENCANTA LO REAL QUE ES ELLA CUERPO REAL,PROBLEMAS REALES... WE ALL CAN RELATE",
        "Les quedo con madre la neta ",
        "COLABORACIONES QUE NUNCA PEDIMOS PERO NOS CERRARON LA BOCA DE LOS BIEN QUE SUENAN️️: \n(pd. para cuando álbum de denbows tumbados toki )",
        "Esta bien Vrga esta Rolotaaa",
        "No tiene voz",
        "NUNCA DECEPCIONA NATANAEL CANO",
        "Rol0nn",
        "Amé 🇺🇾",
        "Tokisha thanks this song  I appreciate having this variety I didn’t identify with the other type of music.",
        "Nata 🫶",
        "Mi nata se ve guapísimo ",
        "Hasta que por fin una canción más o menos decente de Tokisha",
        "ya le agarre gusto w,si esta chida",
        "Dominicanas + Mexicos ese tema va romper en el clubs,bar, ese tema es una chimba ",
        "¿Queeeee esta pasando Aquiiiii?",
        "That guitar play tho...",
        "Lo peor que pudiste hacer Tokischa!!! , está no está nada buena, ",
        "El unico capaz de limpiar a tokischa!",
        "Una canción con mucho sentimiento ",
        "El nata la rifa en donde sea ",
        "ESO LE LLAMAN MÚSICA DE CALIDAD ",
        "GOD BLESS TOKISHA 🇩🇴🇩🇴🇩🇴 🇲🇽 🇲🇽🇲🇽… Tokisha The Goat… 🇩🇴🇲🇽",
        "Música de la god",
        "Te amoooooo",
        "Culerisima nata que hiciste bro",
        "No me gustó el dueto",
        "🇲🇽",
        "Pasado De Vrga🇲🇽",
        "¡Dios mío!. Es la primera canción que escucho ¡Qué está limpia de ella!.",
        "Muy buena canción",
        "Mind blowing ",
        "When is this going live really can't wait",
        "Te amo nata",
        "Que dura esta la cancion y el video esta muchisimo mas duro, parece una pelicula",
        "Diablo se pasaron de verga con esta rola lo dice un dominicano",
        "this is fuckinnnn fireeee!!!!!!! ",
        "Omg que voz tan horrible de la chica y nata god como siempre",
        "Pense que sería algo malo pero yo mismo me di contra la pared QUE HPPPPPP QUEDO ESTO CON TOKISCHA",
        " ame esta canción ",
        "Natanael cano porfavor no cantes mas trap. puros corridos tumbados bandera ct",
        "Ya dura la baina ",
        "Fuego",
        "Aquí los verdaderos fans de Tokisha popó la ️",
        "Activos desde la perla",
        "Arte",
        "Por fin, una canción de Toki que no habla de culo y teta y popola.",
        "Aquí los verdaderos fans de Natanael cano alv",
        "Amazing lyrics",
        "El nata, tiene su estilo bien logrado",
        "ESTE MAN ES DURO \n\nAHORA TODOS VAMOS A CANTAR corridos",
        "Proyecto que dará un palo 🇩🇴",
        "muy dura",
        "Sorprendido toki \nRealmente eres la artista dominicana con más talento \nPa lante !",
        "Best lyrics, best music, best voice and it touched my heart and emotion everytime ️",
        "Joya. LM Sinaloa",
        "Dura mi toki como siempre ️",
        "QUE DIOS TE SIGA BENDICIENDO TU CARRERA TOKICHA BENDICIONES SIGUE TRABAJANDO ",
        "Te das cuenta tokischa que sin ser tan explícita tambien suenas vacana",
        "Cuánto talento junto ",
        "Muy buena colaboración Toki te felicito eres la mejor y lo sabes ",
        "Bendiciones tokicha muy buena música",
        "na mal y eso que no soy fan de corridos",
        "La Toki",
        "desde Dakota del norte otro Dominicano en la casa Saludos para para to mis amigos mexicanos   Chihuahua Sonora halisco y lo que están en el paso texas  y el valle texas    ",
        "Chida chida chida",
        "Excelento ambo, y Tokicha, me soprendes.",
        "Costa Rica 🇨🇷.  La cuestión de Toki es que, sin filtros, sin nada, esta revolucionando el pensar de todos. Letras realistas, cuerpos reales, buen flow. Toki, ya sos grande, pero lo seras mucho más ️",
        "Ando bien loco ya quebraste el celular ",
        "entonces Dios bajó y dijo:",
        "No words Describe this ️️",
        "Que épico está sigan así puro corrido tumbado ",
        "UTA ME MATARON CON ESTO ",
        "A la verdad que la Tokisha es una artista completa ",
        "Esta canción está buena solo la parte de nata y ya la otra no sabe ni cantar, solo grita ",
        "Qué bueno es verte triunfar , no consumo mucho tu música tokisha , pero como Dominicana me gusta verte triunfar  felicidades ",
        "Esta canción refleja mucho amor y dolor con bastante deseo de estar con esa persona ",
        "🇨🇴",
        "XD tokischa",
        "This version has proved that every coin has two sides",
        "Por fin algo diferente",
        "Ok,ok pero toki y nata arian bonita pareja ",
        "Quita pero ya no sale Qué son los para sacar Bueno a socio rochi te tomaste con Rosy",
        "Me agrada Tokischa, pero esa musica de Corridos solo le gusta a los mexicanos, yo paso, lo siento, el tema esta bueno pero esa musica no es para mis gustos.",
        "️‍️‍",
        "Lo más auténtico y único que tiene República Dominicana como rapera, LA TOKI ️️!",
        "Puro natanael cano ",
        "Saludos desde Chicago!! Wow, You guys both got off",
        "Natanael corridos tumbados",
        "como deseo que esta canción hubiera salido sin tokischa...",
        "Que dura la Toky en en RD tanto que le tiran los medios amarillistas y tan amada por el mundo esa doble moral se te quiere toky sigue dándole",
        "Que lindo esto México y república Dominicana"
    ],
    "comments_disabled": false
}