{"video_id": "pGjXPH3W3W0", "comments": ["Este wey puso a cantar a todos corridos mi respeto", "Esto son otros Niveles viva México viva República Dominicana esto si es Arte ", "Letra\n\nNo quiero que te vayas\nY si un día te larga", "En RD 🇩🇴 se escucha mucha música mexicana. Los corridos son muy populares por las historias que cuentan. Es buena letra. Gracias México 🇲🇽️", "Nata cargando el género entero donde quiera que vaya, llega dejando huella marcando diferencia complaciendo a todos. Si dios es grande Nata tu eres grande !", "Desde que descubrí a este artista no he parado de sorprenderme, un tema mejor que el otro trabajaré duro para algún dia colaborar contigo TOKISCHA", "No se esperaban este dueto familia ", "Desde Mi Bella Colombia... VIVA MÉXICO \nEy tu el que esta leyendo esto con la mente, Dios te bendiga a ti y a tu familia Viva Cristo Rey ️", "Hablen ahora  mi muchacha demostrando que tiene de todo tipos de letras demasiado talento para esa niña la más inteligente del género", "Tokisha explorando nuevos campos de la música  y además grabando con una bestia", "Solo un verdadero fan de tokischa sabe dónde se escuchó está canción por primera vez ", "El que en realidad representa Mexico 🇲🇽️‍🇲🇽️‍🇲🇽️‍🇲🇽", "Aquí los verdaderos fans de Natanael cano ️", "Mis respectó para mexico 🇲🇽 y mi patria la República Dominicana 🇩🇴 en la unión está la fuerza viva mexico 🇲🇽 viva RD 🇩🇴", "Les dije solo es cuestión de tiempo nadie mejora de un día para otro lo qué pasa es que es normal que tengas potencial para hacer algo bien y te ataquen para que abandones, pero eso solo pasa si no estás claro de lo que quieres, no me esperaba esta colab muy dura México 🇲🇽 y Dominicana 🇩🇴 ", "Costa Rica 🇨🇷.  La cuestión de Toki es que, sin filtros, sin nada, esta revolucionando el pensar de todos. Letras realistas, cuerpos reales, buen flow. Toki, ya sos grande, pero lo seras mucho más ️", "Excelente producción!", "Lo mejor de tokisha menos malas palabras mas letras puedes ser super famosima mundial mente cambiando la vulgaridad", "Después de todo esta canción realmente expresa el sentimiento de sentirse usada en una relación, de una sensación de dolor junto con enojo...", "No tenía muchas expectativas, y me terminó gustando un montón.\nTe amo Toki<3", "No soy ni dominicana ni mexicana pero me encanta este tema es hermoso saludos desde peru", "Proyecto que dará un palo 🇩🇴", "Un gran junte arriba RD y México 🇩🇴+🇲🇽", "Demasiado Duro  RD 🇩🇴 & México 🇲🇽", "Me gustaría ver más de mi dominicano, incurcarse, mezclarse más con este ritmos,una mezcla divina,dos culturas,dos ritmos, saludos mi razas 🇩🇴🇩🇴🇲🇽🇲🇽.", "AQUÍ SIEMPRE APOYÁNNDO NATAKON EL REY DE LOS CORRIDOS TUMBADOS 🇲🇽🇲🇽  NATA ", "Excelente, se escucha muy bien, que  bueno que Tokischa está explorando un nuevo mercado, que tengas mucho éxito ", "Toki este kilo de amor a tu arte no tiene precio 🫶", "Esta canción me ayuda a pasar el día ", "Primera vez que tokischa canta algo que sirve saludos desde República Dominicana 🇩🇴", "Dos 2 grande culturas en un solo ritmo Mexico 🇲🇽 y RD 🇩🇴 ", "Esta súper la canción ", "Amazing lyrics & voice", "Esta cancion le dará un giro a tu carrera tokisha para bien ya verás.", "nuestra toki creciendo aun Mas no tienes limites., natanael demasiado talento, pero con esta se fueron lejos Los  felicito a ambos ,uffffff Mexico y Rd  juntos por todo lo alto.", "NATAKON EL REY DE LOS CORRIDOS TUMBADOS ARRIBA MÉXICO 🇲🇽🇲🇽 NATA ", "EL DUO QUE NADIE PIDIÓ PERO TODOS NECESITABAMOS", "TODO UN PLACER , COLABORAR CON ESTOS GRANDES ARTISTAS", "Aquí los verdaderos fans de Natanael cano alv", "Toki nunca falla 🇩🇴", "Corrido tumbao . me enorgullece saber que tokisha a llevado su música a este nivel y colaborar con artistas de muchos géneros.🇩🇴 🇲🇽 ", "Weeeey México en la casa!!!! Nata tiene la corona de México ", "DIOS BENDIGA ESE TALENTO DE TOKISHA E NATANAEL CANO Y TODO EL QUE ESTA LEYENDO ESTE MENSAJE ️", "Muy duro el tema. Evolución es la palabra que viva MEXICO y RD", ":') JODER esto si es arte", "Natanael sigue siendo el Rey de los corridos tumbados  y aún lo sigue demostrando.", "El verso de Tokisha merece un grammy!!!", "A la verdad que la Tokisha es una artista completa ", "Está Canción Merece ser todo un éxito mundial ", "Vengo apoyando , a ella no la conocía, pero les quedó al   Y pura lumbre viejo ", "Que corrido ahhhhyayyaahay arriba tokisha 🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴gracias México por apoyar está súper estrella ", "Finalmente!!! felicidades a ambos  y especialmente a Tokisha por ese cambio.", "Tokischa muy dura y versátil.\nDe República Dominicana pal mundo🇩🇴", "Desde que la escuché en NPR y escuché esa guitarra supe que era la colaboración con Nata la esperaba para principios de Diciembre para andar bien placosona pero que chido que la sacaron antes, arriba Tijuana y Monterrey y Tokischa BB ️", "Ojala que saquen mas temazos juntos, con este hermoso de tema de mucho sentimiento demostraron que merecen mas 🇩🇴🇲🇽", "Ahí que darle su banda a Tokysha la mejor.", "El Nata hizo que todos cantaran corridos ", "Siento q dura tan poquito q ya la escuche mil veces 🫠️", "Me encanto este tema TOKI tiene buen flow para el Corrido- ME ENCANTA LO REAL QUE ES ELLA CUERPO REAL,PROBLEMAS REALES... WE ALL CAN RELATE", "Muy hermosa migración de Tocky sabía que esa voz podía pegar en cualquier genero", "Mucho Respeto JAMAS renuncies a algo que realmente te gusta, Enfócate en ti, en tus proyectos y en tu paz mental. 🇩🇴 desde Dominicana seguiré trabajando duro para algún día colaborar contigo de corazón Dios bendiga a todos", "This song actually deserves more than a billion views and millions likes. ️", "Amazing lyrics", "People who have not seen this in theatre can't feel what the experience was like. Pure goosebumps", "No soy seguidor de Tokisha, ni comparto su música, pero sin dudas este tema está muy bueno, le queda ese ritmo", "No soy tan fan de Natanael, pero este dueto con Tokischa si estuvo chingon!", "Omg Tokischa puede colaborar con cualquiera y hace arte un ejemplo de esto es qué pasó de colaborar con Rosalia, Marshmello, Madonna, Ozuna  y ahora con Natanael ", "A puro corridos ", "Love it ️", "Dura durísima para mí criterio la mujer con el flow más duro de todas las latinas rapera interprete y artista mis respetos toqui un saludo desde Medellín Colombia bendición amor e igualdad", "Vlv que la gente piense qué yo te dañe, si me tenías a tus pies 🇲🇽🇩🇴", "\"No tengas miedo de ser diferente, ten miedo de ser igual\".", "This version brings me calmness and it is so soothing. Love it ALOT ", "Una faceta del nata que no se habia visto en un video El video esta pasadisimo de nivel️", "Mis respetos ", "Natagood rompiendo como siempre, era para que le dejarán otro verso, Toki estuvo normal, esto quedó cabrón. ", "This song touched my heart.", "Nunca pensé escuchar a la Toki en un corrido tumbao pero alegra estar vivo para vacilarme esto ️", "QUE HERMOSA CANCIÓN T AMO TOKISHA ", "Muy bueno ️🇲🇽", "🫦 otro rollo este estilo!!!", "Muy buena colaboración Toki te felicito eres la mejor y lo sabes ", "Viva República Dominicana y México ️️", "Tokisha es una artista tan versátil, cualquier género le quedaría bien, la amo", "Excelente trabajo muy bueno musicalmente y muestras otra faceta", "No importa lo que hagas Natanel cano tu eres el más duro y pusiste a todos a cantar y escuchar corridos tumbados.", "La mejor colaboración sin duda ️", "La neta me gusto esta canción, para mí gusto la voz de tokischa está le queda al ritmo de los corridos ", "obra de arte", "DOMINICANOS Y MEXICANOS. 🇲🇽🇩🇴", "Que buena rola ️🇲🇽", "Mis respétos al bajista!!!\nuff que nivel de groove tiene!!", "Primera cancion de Toki sin malas palabras waooo", "Cayó tokisha en ritmo con el corrido!", "Me encanta esta propuesta de nuestra Toki! 🇩🇴", "ESO LE LLAMAN MÚSICA DE CALIDAD ", "ahora los corridos son otra cosa ya con el nata ya saben que FLOW pero con Toki ya es otro rollo 🇲🇽", "Wouu me sorprendió tokishaa  ésto es muy bueno", "La más versátil del género urbano Dominicano en general 🇩🇴️", "No soy seguidor de tus canciones; pero con esta canción \"TE PASASTE\", qué bien suena esa canción. Esta vez hay que dártela. Si te vas por ese tipo de ritmo, te metes a México en el bolsillo."]}