{"video_id": "pRPL29zD-Sk", "comments": ["Hope you enjoy the video!", "I am so proud of Michelle, her piece looks pretty good, she obviously improved a lot", "I love Jakes art but I’m so proud of Michelle’s! She definitely worked super hard on it and she deserved that win", "Im so proud of Michelle she improved so much! You guys did a big work to do these masterpieces!", "Love the group: Ryan is pretty silent but his art is insane, Jake is Jake: he has to be there, Michelle is always Mrs Sunshine, Vinnie has big ideas but not much skills to make them come true (still very entertaining) and Ben is just a joy to watch with his Skills and Energy.\nMcKenzie, Izzy and Jaz are missing :)", "I’m so happy that Michelle won! Her piece was amazing and thank u zhc for the content u give  us!", "The amount of effort that zach puts in his videos are insane keep it up", "Im really proud of Michelle she came a long way and was Zachs first supporter (besides his family) she was always there for him and yes she may have took some or a lot of loses but she never fails to make us be more proud of her  Love you Michelle ", "Im so proud of Michelle she improved so much! You guys did alot to do these masterpieces!", "I think Duct Tape might be my new favorite art medium  haha ", "Congratulations Michelle! I have always believed in you and can't express how happy I am for you :). You are amazing at art, never second guess yourself!! xx", "All the artists are so talented and actually come up with such creative pieces in such a short time", "I am so extremely proud of Michelle she very much deserves this!! <3", "I am so proud of how much Michelle’s art has grown", "It is so nice but nostalgic, and sad at the same time to see my really early childhood YouTuber who's gone this far.  All I wanna say is thanks for all of the content!", "Hi just wanted to inform that your videos are the best and you just made my day", "Omg congratulations Michelle, I’m so proud of you, she’s worked so hard and definitely deserved that win ", "As someone who has mostly only watched Empires, seeing you Hermits entering the server and interacting has left a great impression on me - your members seem significantly more friendly and focused on being social. Hope you guys continue to bring fun to this server!", "Michelle’s art is amazing! She really deserved this win!", "I like Jake's piece the most but no one can deny how cute Michelle's Pokemon is.\nDeserved! Good job! Congratulations ", "Even after so many years, ZHC never fails to dissapoint.", "I'm SOOOO happy for Michelle! Loved to see her take the win!! ", "I Love Watching Them Create. It Just Goes To Show You Literally Can Make Art Out Of ANY THING!!", "In every video, I can see the improvement of Michelle's artworks. It's definitely the best she did so far. You truly deserve it, Michelle! Congratulations ", "So glad Michelle won \nHer happiness when she won ", "its crazy how they can just take anything to make it into a masterpiece!!", "Honestly I love seeing Michelle win! Sometimes she doesn’t believe in herself, but she’s really good at art! I’m really happy that she won, she definitely deserves it!", "I am so proud if Michelle, she did amazing and i hope she wins more often and gets appreciated more!", "I’m soooo proud of Michelle!!! One of many wins!! She deserved this when it was great!!!", "ZHC never fails to entertain us", "I am so proud of you Michelle , you are learning to not give up and you have improved alot from all the years of practice love your work you deserve to win keep up the good work Michelle and get better than zach", "I'm SOOOO happy for Michelle! Loved to see her take the win!!", "I'm so happy that Michelle finally won a challenge, she really deserved this win.", "AMAZING WORK MICHELLE!! GOOD JOB GIRL!", "Love them all they turned out great! Congrats Michelle on the win it was a great piece!! And the sweet little girl you helped with her wish was just adorable!! ", "I can t believe how talented these artists are pls keep going I love your videos", "Zack never disappoints", "I would have voted Michelle too! I'm so glad that she won. It was such an amazing piece for her, and I think she deserved the win that she got. I loved this video, and hope that there is more soon.", "So proud of you michelle ♡", "Michelle has really improved her art. Congratulations! We love you ZHC", "I really loved jake, Ben and Michelle's art piece and Michelle really deserved to win this challenge", "I’m so proud of you Michelle keep up the great work!!", "Yay! Finally Michelle won! I’m always rooting for her Good job Michelle", "Idk if it’s just me but I’m SO PROUD of Michelle!!!", "You guys always create amazing content so keep it up!", "Im so happy Cory brought this back! Love this series! :D", "I said it so many times, but will say it again  you guys are amazingly talented and creative  much love from South Africa ", "ZHC never disappoints us.......", "I love you guys so much im so grateful for the effort you put into this videos,  youre art team is amazing and so talented ", "Great video as always ZHC!\nKeep up the amazing work!", "im so happy michelle actually won! She barely wins so this mad me happy :) im always rooting for her", "ZCH do so much hard work to make ideas for videos and editing it’s crazy, and ZCH will never disappoint anyone with their exquisite art to present to us and make us happy and want to watch the videos which I have watched every single video of ZCH", "Congratulations Michelle for the first time winner a art challenge  , As a Fan I watched you journey in drawing arts with your friends  And I am very proud of you Michelle.", "I love how he is so creative and never fails with a video. Maybe you should do, who can do the best toothbrush art and give them a life supply of toothpaste and toothbrush", "That ending was amazing . Speaking  as a father of my daughter who is fighting  second battle with cancer its foundations like make a wish that have truly helped bring her hope and something  to lift spirits  in hard times , thank you Zhc and thank you Michelle", "Is it just me being happy for Michelle winning this competition ^⁠_⁠^", "Congratulations Michelle I’m so proud of you I’m screaming because I’m really excited because I’m a big fan of you I knew you could do!", "Ryan’s piece has inspired me to try to make my own duct tape art. His piece was so good! And I love how much Michelle has grown, her Lapras turned out adorable! As did Jake’s custom character 🫶", "I’m so proud of Michelle and it’s her first time winning", "I’m so happy for you michelle! Congrats!", "I'm so happy for Michelle!!!! This is huge for her!!! Luv you ZHC and Ms. Munchie!!!", "I love you guys so much, and I'm super happy for Michelle, cuz her piece is rlly good. She definetly deserved the win. And she finally won a challenge@ Good job Michell!!", "It was so cute when you could see the spark of fire Ryan gave Michelle when he said he voted for her. I’m so happy Michelle won she deserves it! ️", "everyone's art looks so cool!!!", "Honestly I was rooting for Michelle. I loved her piece, wasn't the best but I am happy that she got 1st place in so long :)", "God, your films are great, keep going!!! Why you, Michelle, Ben, McKenzie, Jake, Ryan, Vinny and very, very more of you are so talented??!!", "So happy michelle won a challenge. Keep working hard michelle amd never give up ️", "I really like Michelle’s determination she always try her best to make a better art in most of the video and I am proud of u \nI am so  happy u won the art challenge", "I am such a big fan I love how you always give stuff to charity!", "You guys always come with something beyond incredible, great work guys ", "Amazing video as always   \nWould love to see quilling art challenge  ", "Everyone is so talented. Love you guys <3", "I'm so happy for Michelle, I always root for her!", "The creativity level is amazing,  like ZHC can make art out of anything. ", "Feel like Ryan and Ben took easy way with going 2D. Michelle's is amazing definitely one of her best pieces yet", "My face brightened when Michelle won! I am so happy for her! You guys are amazing! Great work!", "I love how Michelle is so confident but always loses Keep it up Michelle!", "I believe he is the only one who never disappoint us with his content️", "I had full faith in Michelle so proud of her and I love your videos ", "these videos are amazing! thank you for taking time to make these!!!", "OMG this completely blow my mind because it's creative, joy and happiness. This was the best video ever and amazing art to the artist's. Amazing job ZHC Crafts for putting inspiring and joyful videos.", "I’m so proud that Michelle won! She did so good and I actually think the Pokémon is so cute, I love it! <3", "Great video as always ZHC!\n\nKeep up the amazing work!", "Keep it up u and the team are really inspiring!", "I am very happy for Michelle. She deserves this win. We love you Munchie! Greetings from the Philippines.", "Michelle is improving so much I’m glad she won it’s so sad no one betted on her except for Ryan ", "IM SO PROUD OF MICHELLE SHE NEVER WON BUT SEEING HER WON FOR THE FIRST TIME MAKES ME SO HAPPY", "Im so proud of you Michelle!! When i saw your finished creation my heart melted its so CUTEE 🥹", "Omg Im so proud of MichelleI was rooting for her piece she deserved it️", "Zach never fails to entertain us", "Zach, you guys, are truly amazing. In your videos, your work etc. Keep it up and God bless you guys", "I love all your guy’s is art work it’s amazing and you all have talent, super proud of you Michelle️", "They are all so talented ️️", "So proud of Michelle! She always does good but she got the win this time!!", "Sometimes I missed the old team\nIzzy , viv, McKenzie and jazz ️ and all of them Jake and Michelle together doing art craft ", "All of these pieces were awesome, best combined art I’ve seen in a crafts video", "I love your videos and I’m so proud of everyone,there growth in art is amazing ", "She’s come such a long way congrats Michelle!!!!! ", "OMG congratulations Michele i am so happy for you. I knew that you could do it you should always have faith in yourself because you are capable of so much more than you think you are. I am so so proud of you and i am your biggest fan!!!!", "I FEEL SO PROUD OF MICHELLE SHE IMPROVED ALOT!!"]}