{
    "video_id": "pRPL29zD-Sk",
    "comments": [
        "Literally everyone when Zach said that the punishment would be them getting duct taped to the wall: “NoooOooO”\nBen: “YES! I’ve always wanted to be duck taped to the wall!”",
        "Duct tape is so versatile. I made a wallet out of it for a crafts project, it was pretty fun",
        "where's kenz??",
        "u and mrbeast make good simp lord",
        "Zach and his friends should do a rubber band art (day 3",
        "YayayayayYayy  ive been waiting for Michelle to win",
        "Zach’s arms got sucked",
        "Hi",
        "ZACH WHERE DO YOU STORE ALL THE ART",
        "What is all the circular bruises on Zach?",
        "At the end I was praying that Michelle won and she DID!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "If I ever find u guys I'm going to ask Ben please make me alot of dragons because dragons and venom are my favorite zach carry on with ur videos because ur vids make me smile",
        "yeeeeeeeeeeeeeessssssssssssssssssssssssss finaly she win si have been wanting her to win in all of the challenges",
        "Michelle, thank you for picking make a wish my sister got recognized am I make her wished and she loves you and she watches this Zhc crafts a lot",
        "I love laporis",
        "Michelle one I love Pokémon",
        "Zack art wasss really good as well",
        "Feel like Ryan and Ben took easy way with going 2D. Michelle's is amazing definitely one of her best pieces yet",
        "To be honest I would love to see izzy and viv back to compete in these challenges",
        "What does she does whit all the art work?",
        "Yay yes yes yes I have been waiting for a long for Michelle to win she's always be on the dog I feel like she should always be the winner because all of the colour she uses I think she make it so pretty and cute",
        "OMG this completely blow my mind because it's creative, joy and happiness. This was the best video ever and amazing art to the artist's. Amazing job ZHC Crafts for putting inspiring and joyful videos.",
        "I’m just now seeing the video and for a second I thought Vinny said “I dont wanna be rubbed by my ex girlfriends” and i FREAKED out  then i realized",
        "Omg yessss",
        "thank you so much for doing a pokemon michelle i love pokemon so much tysm",
        "Slay Michelle, girl power",
        "Zach the quote that you were thinking of at 4:25 into the video is one made by Wayne gretzki and it is \"you miss 100 percent of the shots you dont take.\"",
        "Zach: I’ve never actually duct taped someone to a wall \nUs: really so surprised",
        "Jake should’ve won but whatever",
        "You guys should try to make a custom action figure",
        "I’m so happy for you michelle! Congrats!",
        "at the start Jake’s work looked like blue from rainbow friends in roblox\nWho agrees?",
        "Jake needs to win one please",
        "Go Michelle I'm so happy you Win and you didn't give up",
        "So haply that miss munchie won",
        "Hi I wanted to say thank you I really needed a boost today I wasn’t feeling the best and just by clicking on the video it’s already brightening my day",
        "Finally Michelle won another crafts challenge!!!! I'm so happy for her and I always had a lot of faith that she would win more challenges in the future and she won!! Her Pokémon was so cute!!! I'm so happy that she won. She is my favorite artist (close to Zach of course) and I love her channel so much as well. I love you Zach and Michelle!!!!!!",
        "I have the lapress pokemon card.       like if you do to",
        "IM SO PROUD OF MICHELLE!! my face started hurting when i realized i was smiling lol",
        "Where dis jazz Izzy and viv go .",
        "zach spent to much money",
        "Did anyone notice the brown stuff on zach’s shoulder",
        "Michelle I think is going to win.",
        "Da best chicken nugget art next",
        "Zhc Jake is making is a rainbow friends charter shs name is blue",
        "jake, what the heck is going in your head\n\njake: yOU nAsTY lITtLe girl",
        "I feel sooo happy for Michelle!!!!!!!!!! Her piece was amazing!!!!!",
        "I miss them",
        "Omg Michelle I’m so happy for you when Zach said that he liked yours the third best I was so bummed but then you beat everyone and when Zach said your name I quite literally threw my hands up I’m so happy for you",
        "“You nasty little girl” Made me laugh so hard I fell off my chair ",
        "i aslo bet on michelle and look she won",
        "2:57",
        "YESS MORE CRAFTS VIDEOS",
        "It's blue from rainbow friends",
        "You are amazing!",
        "I WAS ROOTING FOR MICHELLE FOR THE WHOLE VIDEO! SHE IS MY FAVORITE PERSON!!! IVE BEEN WATCHING YOU FOR SO LONG AND I ALWAYS, ALWAYS ROOTED FOR HER!! HER LAPRIS WAS SO AMAZING AND CUTTTEEE!",
        "LETS GOO MICHAEL (sorry if I spelled your name wrong)",
        "Where was Viv",
        "I’m so happy for her bc she never wins and I love how she says yay and congrats ^^ and zach thx ur very kind ^^",
        "Respect him ",
        "jake that ball thing is rainbow firends",
        "michelle is so pretty i love her aand good job michelle",
        "Woo hoo Michelle!!!!",
        "I’m so happy that Michelle won! Her piece was amazing and thank u zhc for the content u give  us!",
        "Can u pls do window art I did it all through my childhood and I’d love to see your team doing this with there amazing art skills",
        "YAY!! I’m so proud Michelle pulled through and won. I’m always rooting for Michelle, I’m so glad she won(Also I love lapras)",
        "Jake made blue from rainbow friends a game on roblox\n\nEdit well at first it looked like him",
        "Yay Mrs munchy won ",
        "Michelles peace was so cute!! It was my favorite one!! She has improved so much",
        "I love it when Michelle put her trust in large Pokemon fandom.",
        "Imagine walking and just seeing like 5 dudes taped up onto a wall",
        "Michelle finally wonnn..I am soo happy for herre yayaya ️️",
        "I love ZHC,s videos they make me smile and I'm so happy when I see them, if they make you feel creative",
        "The ending was to biased\nI love pokemon and I'm a major fan\nHowever, saying Michelle's piece was better than Jake's. That's taking it too far",
        "Congratulations Michelle <3 Also I thought Ben’s piece was also really impressive! But I do feel concerned for Zach, I mean there were some brown marks on his arms, I hope he’s fine...",
        "how much did you pay the subscriber to choose michelle",
        "Shoe lace art next",
        "I couldn't stop smiling when Michelle won",
        "That ending was amazing . Speaking  as a father of my daughter who is fighting  second battle with cancer its foundations like make a wish that have truly helped bring her hope and something  to lift spirits  in hard times , thank you Zhc and thank you Michelle",
        "Yessss SO HAPPY FOR MUNCHIE!!!",
        "Tbh I feel so happy that Michelle win bc she doesn’t win a lot like Jake Ben and others and I know that she always wants to give up bc she thinks her art isn’t good but actually she made a really cool pieces and I’m so proud of her love you Michelle",
        "This isn’t any good for the environment is it?",
        "i love Michelle and ryan piece so much",
        "Yayyyyyyy Michelle wonnn!!!",
        "Pls try slime art\nBig fan of u guys btw ",
        "Yes Michelle I love you girl",
        "Amazing video and pleeeaaaaase pin and love heart my comment   pllllleeeeeaaaaseeeee   and if you do or don't your amazing",
        "You finally won michelle",
        "I believe he is the only one who never disappoint us with his content️",
        "Jake's piece looks like  from the rainbow friends the blue one",
        "It’s blue from roblox ",
        "FINALLY SHE WON I AM SOO PROUD OF HER AND HOW MUCH BETTER SHE HAS GOTTEN!!!!  Michelle I wish you the best and hope for more victories in you life!!! (ps sorry if I spelled your name wrong)",
        "No",
        "Wait… and Mckenzie?!",
        "Ryan betted on Michelle and he didn’t get 100",
        "Maybe the next one can be out of hair I don't really know",
        "Michelle totally deserved this win! Lapras looked cute af ",
        "Congratulations Michelle I’m so proud of you I’m screaming because I’m really excited because I’m a big fan of you I knew you could do!",
        "Can you guys do the best whiteboard art please",
        "I bet on Jake",
        "I'm riding  for Michelle",
        "I had full faith in Michelle so proud of her and I love your videos ",
        "ZHC never disappoints us.......",
        "Slay michelle i wanted you to win throughout the entire thing!!!!!",
        "Wow. I have never been so happy with the results. DESERVED!! (i don't comment that often to a video, but this time i have to)\n\nCongratulations!! ",
        "want to be the very best\nLike no one ever was\nTo catch them is my real test\nTo train them is my cause",
        "Yay munchy congrats   you deserve it",
        "The thumbnail XD",
        "YAY!!! SO EXCITED FOR MICHELLE !",
        "Michelle one is very good",
        "Go Michelle we love you!!!️️",
        "Love them all but Jake should’ve won",
        "Michelle I love you so so much and I love you to Zach",
        "I love Pokémon and I’m an artist.",
        "the fact this is one of the first times of Michelle's win",
        "I love Pokémon !",
        "Congrats Michelle ",
        "Great job Michelle",
        "Can you please do stitch out of somthing",
        "It's looks like a blue  Fish lol",
        "I am so happy for Michelle...she's so good",
        "I love how he is so creative and never fails with a video. Maybe you should do, who can do the best toothbrush art and give them a life supply of toothpaste and toothbrush",
        "Yea I love all of your arts",
        "I'm so happy for Michelle!!!! This is huge for her!!! Luv you ZHC and Ms. Munchie!!!",
        "Jake needs mentel help",
        "NO WAY so proud of Michelle she improved",
        "So happy for MissMunchie!!! (Aka michelle) she hasn’t won in a while she rlly deserved it happy to see all the boys hat duct taped !!!! ",
        "tell jake to make me one too",
        "i love Jake's piece  so proud of Michelle  Ben's piece is something i kinda wanna have as a something to hang in my house ",
        "I love all your guy’s is art work it’s amazing and you all have talent, super proud of you Michelle️",
        "Im really proud of Michelle she came a long way and was Zachs first supporter (besides his family) she was always there for him and yes she may have took some or a lot of loses but she never fails to make us be more proud of her  Love you Michelle ",
        "Congratulations Michelle ️ ",
        "Michelle it is so cute \nGood try everyone",
        "I think you should do a best one color art wins 5000 dollars challenge",
        "Zhc my birthday is in 7 days",
        "As a Pokémon fan I think Michelle deserved the win because her lapras is top tier",
        "A dragon would've been awesome!! BEN!!!!",
        "IM SO PROUD OF MICHELLE SHE NEVER WON BUT SEEING HER WON FOR THE FIRST TIME MAKES ME SO HAPPY",
        "That sucks kid she always wins",
        "MICHELLE!!! u did so well!!! I love ur piece!!!",
        "You should do cotton candy art",
        "All of these pieces were awesome, best combined art I’ve seen in a crafts video",
        "2:37 is so funny when jake is looking for the  duck tape and said \"you nasty little girl\"   ",
        "I am sooooooo happyyyyyyyyyyy Michelle finally win her third craft challenge !!!!! Always rooting for you !!!",
        "Yay Michelle wins I was rooting for her yay!",
        "Big W",
        "“ Don’t touch the lens with the camera. DON’T TOUCH THE LENS WITH THE CAMERA. ",
        "Her was not better it is just a Pokémon that people know",
        "Where did Izzy go? Like what happened?",
        "I love rayn in the video",
        "Good video",
        "Like the first time you win something",
        "Omg Michelle congratulations i am so proud of u i love you and ur math tricks hehe but i love ur art pieces and for me u r the winner in every challenge ️️️",
        "I know he did not do Ben like that",
        "Good Job Michelle I was hoping pokemon would help get the victory",
        "jake",
        "I liked Ben's piece the bestbut Michelle's was also really good ",
        "How much money do you have zhc hi what does the Zhc stand for",
        "Thanks for always donating it helps so many people",
        "You guys should try digital art.",
        "Where is viv, Izzy, jaz and Mackenzie? I miss those videos:(",
        "Jake got robbed",
        "I SO HAPPY FOR MICHELLE",
        "Girl power!",
        "I like michaels art and Vinnys art",
        "The amount of effort that zach puts in his videos are insane keep it up",
        "Can you make art out of Perleard beach they’re really fun",
        "If Im being honest I love hearing Jev talk about how he needs to pick a new up or learn a new skill set to me seeing him evolve as a human is the coolest thing in the world ofc I expect him to stay uploading COD but if he were to ever upload anything else Ill sit here and watch it still",
        "Love ur videos Zach keep it up with the awesome content",
        "Who’s the new guy vinny,  dont include him next time",
        "I’m so happy for Michelle she really deserved the win",
        "yaayayyay for michelle gooood job",
        "Hi!!!!!!!{",
        "HOW IS THAT A POKÉMON LAPRAS",
        "I was as excited as Michelle when she won ",
        "You can do best trash art and maybe you can do it for team tree",
        "Always epic art videos",
        "I love Michelle is this like a star so pretty Michelle",
        "GREAT JOB MICHELLE!!",
        "Congratulations Michelle for the first time winner a art challenge  , As a Fan I watched you journey in drawing arts with your friends  And I am very proud of you Michelle.",
        "Y no mechanzi in the challenge ",
        "️️",
        "Yeyyy soo happy for michelle , she did a great job today",
        "yay michelle!!!!",
        "I miss izzy and viv ",
        "I love you guys so much im so grateful for the effort you put into this videos,  youre art team is amazing and so talented ",
        "Michelle I'm so happy that you tried and never gave up",
        "I Love Watching Them Create. It Just Goes To Show You Literally Can Make Art Out Of ANY THING!!",
        "Can I pls have lapars",
        "Can you make a craft video were you make art out of trash and the losers have to pickup 5kg of trash each",
        "MICHELLE WON! \n\nI'm so happy rn I have never seen her win",
        "I really love your'e work and you inspire me to creat art. Keep up your work is amazing ",
        "MUNCHIE! MUNCHIE! MUNCHIE! FINALLY A DUBBBBB",
        "We need more Vinnie ",
        "I Love you guys your the best",
        "Wow Michelle well done. You finally did it. ",
        "Is jack giving secret tution to Michael",
        "I didnt even realize how early I was. I swear I love this channel so much. Also I love seeing Michelle win she deserved it!",
        "Great video as always ZHC!\nKeep up the amazing work!",
        "This was awesome go Michelle!!! Loved it and your lil dude was so cute and actually color matched !!",
        "Go Michelle",
        "Love your content",
        "OMG MICHELLE I'M SO PROUD OF YOU\nGO GIRL :D",
        "Is it just me being happy for Michelle winning this competition ^⁠_⁠^",
        "Blue pack man",
        "Ryan on the shelf I had a really good feeling that Michelle should’ve won but I don’t really care I think Michelle what is Busta Rhymes to addicts office really cool and bands OK KK",
        "Wasn't your best transition in first challenge editor should get less paid for that lol man when going do YouTuber as judge art that be good video for you remember im YouTuber viral can always come up with stuff",
        "I’m so proud of you Michelle keep up the great work!!",
        "yessssssss finalllyy congrats Michelleeeee",
        "its crazy how they can just take anything to make it into a masterpiece!!",
        "You should make art with string or hot glue I think it would be a good idea. And I appreciate how u put time in these videos you guys are the best me and my older sister each you guys all the time love you guys",
        "jake shall win",
        "I really loved jake, Ben and Michelle's art piece and Michelle really deserved to win this challenge",
        "At first I thought that Jake's was the cookie monster",
        "I love this video!\nYou should do who makes the best/cutest plushie",
        "This is cool :) and what a fun video to relax to after a physio swim.",
        "Jake is doing a rainbow friends blue",
        "Michelle 10/10",
        "Why does Zach has hickeys on his arm",
        "Rain bow friends blue",
        "I think Duct Tape might be my new favorite art medium  haha ",
        "If Zack tells the subscribes who’s is which that could be the reason some people win",
        "Ben deserved to win, Michelle’s was good but personally ben wins",
        "Wait wait wait wait WAIT an Actual minute (or hour), Michelle is Zach's Ex-girlfriend?!??! When did that happen, I had no idea! Is it true? Am I getting confused?? I NEED an ANSWER!",
        "Jake is my guy",
        "Whenever I click on a Zac crafts vid with Mackenzie in it I’m prepared for the “ so Mackenzie, you have won the most craft challenges”",
        "this was lit",
        "I miss izy and jaz",
        "Michels piece looks really good I am so happy that she won",
        "I’m so proud of Michelle",
        "i love zhc so much!maybe yall should do best card art wins?",
        "So sad  Jake was best  but of course they pick mechell because she never wins and love u Jake  i am 1 fan trust me",
        "YAYAYA Michelle ",
        "I am so so so proud of Michelle she was going to give up but didn’t she worked very  Very hared an won.amazing job Michelle",
        "It’s my birthday ",
        "Yaaaaaaay, I like all your pieces, but I am really happy for Michell, sorry if I spelled your name wrong",
        "Why does Izzy and Viv not there",
        "JAKE JUST SAT THERE DEPRESSED",
        "Michel definitely shouldn't of 2on",
        "my dad definitely likes this video…. i wonder why….",
        "AM SO HAPPY FOR MITCHELL FOR HER VICTORY  EVER SINCE I BEGAN WATCHING THIS IS THE FIRST TIME I HAVE SEEN MITCHELL WIN AM HAPPY FOR \nZACH BUY MITCHELL A BIG GIFT FOR HER VICTORY  SHE IS SO SO SO HAPPY ",
        "It is so nice but nostalgic, and sad at the same time to see my really early childhood YouTuber who's gone this far.  All I wanna say is thanks for all of the content!",
        "Wow this was so cool!",
        "Great job Michelle because he won I really like your piece hope you have a good day",
        "Omg so happy for Michelle",
        "seeing michelle win makes me so happy idk why ",
        "You go Michelle!!! ",
        "you guys are so talented you guys should do who can do the best rainbow friend",
        "anyone see whats on zachs shoulder-",
        "is it just me or does jakes look like blue from rainbow friends \n at the first 5 minitues of the video",
        "Benjamin go,, rawwrrrr",
        "At the start",
        "I love to see Michelle win again️",
        "I love your videos so much! ",
        "I liked everyone's like and subscribe",
        "This is very entertaining i love it",
        "I cried",
        "I love your videos and I’m so proud of everyone,there growth in art is amazing ",
        "AAAAAA MICHELLE WONNNN THAT’S MYY MOTHERRRRRRR",
        "Honestly I was rooting for Michelle. I loved her piece, wasn't the best but I am happy that she got 1st place in so long :)",
        "wohoo michelle",
        "I think Ben should have won",
        "So happy Michelle won.",
        "Michele. Her art is so sick I rate it 999,999,999, -10",
        "ZHC GOOOOOO",
        "I am so proud of Michelle. I also lover her art in latte art challenge. Love you Michelle.",
        "I♡ michelle for wining",
        "After a long time munchkin ",
        "Good job Michelle I knew you could win",
        "Amazing video as always   \nWould love to see quilling art challenge  ",
        "Wow",
        "Michelle congratulations",
        "Let’s go michelle️",
        "Love yalls vids",
        "Congratulations to Michelle",
        "Where’s Izzy",
        "I was so happy Michelle won ️ love her",
        "I need five thousand Dollars",
        "Im so proud of Michelle, i was betting on her with my sister",
        "ZHC never fails to entertain us",
        "Ryan's looks simple, but really clean and with out clutter, though I do like how Jake's pops out, being a three dimensional character ((answer to the question: Dose it look like blue Pack man? I thought it looked like Jake was going for Dj Deadmau))",
        "I just subscriber",
        "I’m so happy for Michelle for winning this challenge!",
        "I'm so happy that Michelle finally won a challenge, she really deserved this win.",
        "Video idea\nThe best Highlighter art wins .... $ \n(Highlighter like stabilo boss or ErichKrause)",
        "Im so happy michelle won a Challenge and with a pokemon",
        "Michelle out here sweeping everyone from the bottom up ",
        "I’m so glad Michelle won even though Ryan’s and Jake’s pieces were amazing",
        "I may have not played the game, but I wont forget how surprisingly catchy the song as you sail to Bowsers Castle is despite how out-of-place it is",
        "wtf it should have been ryan vs ben",
        "I've been ducttaped to a wall before and it's honestly really really scary but also so fun hahaha",
        "hi zhc can i plese have a surprise i have den subscribed fro 10 years",
        "If Michelle had done the Pikachu she would have been qualified directly to the finals without a doubt.",
        "I love Pokémon",
        "Mental healthhh is important️!! BUT AHH I LOVEEEEDDDD THE OCTOPUS",
        "My heart was pounding for Michelle so happy she won",
        "Michelle’s is so cute I love it but jakes was really good to.. but idk which one I would chose it’s so hard because jakes is great Michelle’s is great, and I know everyone worked really hard and I loved all of them but the one that was the best would be.. all of them they all worked hard they all were creative and beautiful I love them all and I love the creativity in them",
        "o my gowd...michele's face was so precious!!!...like it was genuinely overjoyed....and finally my wish for michele to win came true!!!",
        "Zhc is always the best!!!",
        "MICHELLE YEAHHHH!!!",
        "In my opinion old competitors are good in my point of view",
        "Is it just me or does anybody else see the bruises on Zacks arms?",
        "Blue Kermit definitely",
        "This has nothing to do with the video but I saw khaby in a McDonalds vid. Lol",
        "I think its a blue packman",
        "jakes is PACKMAN",
        "I've literally pressed don't recommend this channel more times than I can count. I hate YouTube.",
        "Has Michelle ever want to challenge her art is so good I feel kind of bad..",
        "I am so happy for Michelle",
        "MICHELLE DESERVE TO WIN",
        "Jake was the best",
        "yayyy Ryan is backkkk",
        "I’m so happy Michelle won! Omg ! Good job :) anyways. Good job everyone though, I love the pieces.",
        "FINALLY MICHELLE WON YASSSSSSS",
        "Yeaaaaaaaaaaaaaaaaaaaaaaaaa Michelle I’m so happy for you",
        "YEA MICHELLE WON!!!!!!!!!!!",
        "wow! michelle u improved so much!!!!!!",
        "can't remember the last time Michelle won congrats",
        "Go Michelle GIRL POWER️ love the rest of you amazing work ",
        "I'm so happy for you Michelle! Your artwork keeps getting better and better. Never give up! ",
        "Gooooooooo mechael",
        "Omgg yay Michelle !!!",
        "I'm super happy for Michelle and I'm very proud of her.Keep up the good work Michelle!",
        "Yesss Michelle finally won.....she deserves a lot more...and has definitely improved a lot....cheers!",
        "Michelle Do you like animals Zack YouTube And then if there is a wookiee",
        "Pog",
        "Take the L jake how does it feel",
        "Duct tape! Woooooo",
        "I am in your number one fan",
        "Jakeeeee️️",
        "Michelle I love your piece!!!    its stunning, great work!!!",
        "I was rooting for michelle all the Time im so happy she won",
        "jake desevred that w",
        "So happy that Michelle won",
        "Where is jezzz ???",
        "I love Michelle\"s art is the best",
        "Well vidiotografer",
        "Munchie army is so happy ",
        "AHA Another extremely amazing artwork with some twist @zhc",
        "I love you mis munchie",
        "MICHELLE FINALLY WONNNN YESSSS",
        "I am so happy cu'z Michelle won. She worked very hard and deserved the win. And i hope that she wins more challanges.",
        "Oh that was awful. Michelle's should have been 4th. Too messy ",
        "my favorite vid cause michelle won!",
        "Damn Michelle is improving a lot xx",
        "Ben and Jake are the best on everything they do with art keep up everything you do for us",
        "CONGRATS MICHELLE!!!",
        "Yay!! Michelle won the challenge.Btwn your piece was very cute .",
        "I think the top 2 will have to be Ryan and Michael",
        "When Albert put his arms up u can see how strong he is",
        "Ryan",
        "Zhc u are my hero!!!!!",
        "Finally Michelle won",
        "ZHC this is a great video I love these videos you should be in a video of yours you normally do other people so why don’t you do you and them in a challenge.",
        "I liked Jake's art more than Michille's",
        "Zach is born with the most creative mind in the whole entire world . Thanks for entertaining us Zach",
        "Early!",
        "Fu*King hell you are good at art the zhc crew",
        "OMG i’m so happy for Michelle i was so happy when she won. Congrats!",
        "Wachu wachu mirando watch",
        "Well done Michelle Great win",
        "YESSS!!  good job michelle!!!!!!!!!",
        "jake made dead mau",
        "Zach, you guys, are truly amazing. In your videos, your work etc. Keep it up and God bless you guys",
        "THE WAY MICHELLE SCREAMED I MEAN WHO WOULDN'T? OMGG MICHELLE LNG MALAKAS ! 🇵🇭",
        "This sounds like a \"sticky\" Situation Get it",
        "yes",
        "jakes was alot better by far no compitition im my mind jakes looks like a pro an michells not so much more like a kid",
        "Jake should have won!!",
        "I wish Jake win",
        "I'm not being rude but I feel like rayen should have been 2nd and Jake 1st",
        "I wish I could win one of the customized items but I’m glad so many people get the chance to win. I wish I good draw like them I love your videos I draw in a stile like a third grader most of the time I hope you could noice me I really love your videos and you make my happy when I’m down. Thank you for all your kindness to these people and me thank you ",
        "i am really happyy for her, and  i honestly love her 3d pokemon!!",
        "HI ZHC",
        "My 3 favs were #3 portrait, #2 the octopus & #1 Michelle's pokemon...wtg Michelle and make a wish foundation on ur win!!! Keep the vids coming!!! Til next tyme...keep those cre8ive juices abrewing!!!",
        "Good job Michelle",
        "\"I'm so excited..-?",
        "W Ben",
        "YESS MICHELLE she finally won! I havent seen her win in ages and im sure shes so proud of herself and so am I! Well done to everyone else for competing ",
        " when's Jake gonna get another win",
        "jake is that packman",
        "Ok but ryan should have won",
        "Great job Michelle also you videos are so fun ZHC",
        "Michelle's baby Lapras",
        "We want McKenzie",
        "Bring jazz and Izzy back",
        "I’m so proud of Michelle and it’s her first time winning",
        "I made so glad that Michelle won",
        "I always wanted machel to Winn",
        "Michelle I think you will",
        "Zhach what happened to jazz",
        "In every video, I can see the improvement of Michelle's artworks. It's definitely the best she did so far. You truly deserve it, Michelle! Congratulations ",
        "YAY MICHELLE YOUR THE BEST ARTIST!!!",
        "Im sooo proud of michelle cause i feel this the first time she ever won and i really thought jake was going to win since his was smoother",
        "W video",
        "I am very happy for Michelle. She deserves this win. We love you Munchie! Greetings from the Philippines.",
        "I'm SOOOO happy for Michelle! Loved to see her take the win!! ",
        "You miss 100% of the opportunities you don't try so don't miss. Don't try the opportunities you miss otherwise you'd miss all the opportunities you do try -ZHC 2022",
        "Instead of duck taping them to the wall, I would Flex tape them to the wall. ",
        "I love your videos! You put so much hard work Into it Yet still post pretty often ! I love it!",
        "Omg i believe in you good job im a huge fan plese shout out in next video  plese",
        "I don't like how Michelle won because we're all nerds",
        "And I talk to unalive things too!",
        "OMG I AM SO PROUD OF MICHELLE!!",
        "Ryan’s piece has inspired me to try to make my own duct tape art. His piece was so good! And I love how much Michelle has grown, her Lapras turned out adorable! As did Jake’s custom character 🫶",
        "Michelle would be so good if she would stop acting like a baby     ps I also call bs that she beet 2nd place and winning",
        "ihave been a fan of ZHC for 3 YEARS, they never fail to make us happy",
        "M so happy for Michelle yayyyyy...she did her best",
        "can u do minecraft art",
        "OMG CONGRATS MICHELLE FIRST CHALLENGE",
        "wow her first win",
        "I watch every video you post",
        "Michele your piece was good. Just some finishing and smoothing around the lip part would be best",
        "Good job jake. Even though you did not win it is fine. But not I see the pain in ur eyes",
        "Yay!!! Michell ",
        "at the end Michelle's and jake's both looked really good but i thought jake's art was going to win but it's not like i thought Michelle's was horrible i just thought jake's was a little better so i was surprised when Michelle's won but over all they were both really good. Congrats to Michelle on winning!!!",
        "My face brightened when Michelle won! I am so happy for her! You guys are amazing! Great work!",
        "I thought Jake was your best friend",
        "Yayy you did it Michelleeeeee",
        "I celebrated for Michelle lol",
        "God loves you no matter what",
        "I LOVED MICHELLESSSS like it looked so good and i rlly loved Jakes i would have choose Jake tho srry michelle :( Luv u zhc <3",
        "YAY  Ryan is in a video  he was from instant influencer ",
        "Love you and videos keep up the great work can't wait for another amazing and great content love you",
        "I love you guys so much, and I'm super happy for Michelle, cuz her piece is rlly good. She definetly deserved the win. And she finally won a challenge@ Good job Michell!!",
        "I am very very happy for you michelle it is very cute",
        "the jake to rambow frends in blue",
        "YAY I always hope Michelle wins she works hard and it finally paid off",
        "i LOVED Michelle's piece and love that she got the W but i definitely thought Ryan's was pretty stellar :) Keep up the great work! Such a good video",
        "Jakes is way better",
        "Michelle actually deserved to win, hers was soo cute!!",
        "Well done Michelle I love your art keep it up",
        "We all know jake won",
        "I can t believe how talented these artists are pls keep going I love your videos",
        "You guys always come with something beyond incredible, great work guys ",
        "This is cool",
        "Zach is amazing ️ and his friends also..  love you guys️",
        "Yay!  Michael u finally won\nSending you lots of love  ",
        "I hate riged videos",
        "Sometimes I missed the old team\nIzzy , viv, McKenzie and jazz ️ and all of them Jake and Michelle together doing art craft ",
        "Bias",
        "Gullibile",
        "YASS MICHELLE",
        "  Because of  love. God sent His Son Jesus Christ to die in our place. Three days later. Rose him  from the dead.   Now. By Jesus Christ alone. God has granted us the free gift of eternal life. He will save and heal you.  If you confess with your mouth the Lord Jesus and believe in your heart that God has raised Him from the dead He'll give you eternal life",
        "OMG MICHELLE WON YESSSSS",
        "I’m so proud of michelle ",
        "Where did Izzy go she has not been there for like everrrr, her art is awesome(so is everybody else's)",
        "MedMen Stock Is Moving Up Now! Insiders Buying more stock! Most Recognized Name in the Marijuana Industry.  Buy MMNFF today.....",
        "Cute",
        "Nich 09:30",
        "Honestly I love seeing Michelle win! Sometimes she doesn’t believe in herself, but she’s really good at art! I’m really happy that she won, she definitely deserves it!",
        "Every ones art is sooo good and creative",
        "jake was so much better smh",
        "Omgg Michelle improved so much️️",
        "i feel like this is the first win for michelle",
        "Jake's piece at the beginning lok lik dj mouse",
        "It's fine Jake literally just won coffee art",
        "Yayyyy",
        "Its a blue Rambow frend",
        "yaaayy Michelle won!!!!!!!  I'm so  happy to see her excited",
        "MICHELLE DESERVED IT SO MUCH",
        "I’m proud of her for her winning a second time",
        "The creativity level is amazing,  like ZHC can make art out of anything. ",
        "make a led art one",
        "THEY SHOULD SCULPT CANDLES OR WOOD NEXT!!",
        "I usually root for Michelle because he doesn’t win that often in this video she really pulled through",
        "Team Ben all day every day",
        "This is so great to me because I never see Michele win ",
        "I'm so glad Michelle won! She always works so hard!",
        "Jesus Christ called people everywhere to repent, so if you confess with your mouth the Lord Jesus and believe with all your heart that God raised him from the dead, you will be saved and inherit the kingdom of heaven and eternal life. To this, people would accept Jesus Christ in life in their hearts and told other people how good he is, how he saves, heals and frees and gives eternal life for 8",
        "come to Bulgaria, you have many fans",
        "13:34 Michelle sounded like she was about to cry while telling that lil girl that she will go to Disneyland, i am in tears ",
        "GOOD JOB MICHELE! The Pokémon community is very proud of you and your victory!",
        "L to jake",
        "I am so proud of how much Michelle’s art has grown",
        "Michel is my favo I M so happy ",
        "YES, MICHELLE!!",
        "Jake definitely did blue pack man at the start. ;D",
        "I looks like cermet the frog",
        "OMG Michelle\nYou won (finally, no defence)\nI'm sooo happy for you\nTape is made for you",
        "I'm happy for Michelle!",
        "MICHELLE'S ART DIDNT DESERVE WIN EWWW",
        "jakes looks like deadmau5",
        "miss munchy WON",
        "She deserves to win",
        "MICHELLE FINALLY WON YAYAYAY",
        "WOWOOWOWOWOWOWOW",
        "i love these videos keep up the good content",
        "rewatching these videos makes me grateful that no matter what he was going through, even before cancer, he always uploaded videos for us, his viewers, to watch.\n\nRest Easy and in peace Techno, thank you for everything you did.",
        "Will Viv be in the next vid plis ?",
        "I have been crying for the past few hours. This is legitimately heartbreaking. I cannot imagine how his family is doing right now.\nTechno (Alex) was my favorite youtuber. He always made me happy when I was having a crappy day. His videos made me smile even in the darkest moments. And now I can't stop watching his videos, but every time I watch them I am reminded he is no longer with us.",
        "or not",
        "I think that Jakes was better",
        "I have a question, after u have finished ur art projects- do u put them in the bin or put them on display??",
        "im so proud of Michelle",
        "I am always Rooting for Michelle and I’m so proud she won this time. I also think her Lapras is really good.",
        "I'm so happy that Michelle won️",
        "I’m so surprised ",
        "Missing MCKENZIE",
        "Make csgo skins"
    ],
    "comments_disabled": false
}