{"video_id": "PrSBuEFdRFU", "comments": ["We will never get another artist like Drake. Enjoy his music while he's still going strong.", "Drake really living his best life!", "The album on repeat ", "This album has been living rent free in my head since release ", "it's funny that 21 did all what Drake asked in the intro, he did a rich flex, dropped bars for his EX, talked to the opps, then did his things.\nIt just woooooow ", "These two guys literally living their best life ", "Drake and 21 literally always hits and never misses ", "all the visuals for the album have been top shelf, props to Drizzy and 21 for this killer album !", "We’re witnessing greatness right now … 20 years later this will still be a classic", "Drake y 21 Savage saben que su álbum es una joyita, una joyita total. 21XLIVEE DRIZZYXLIVEEEE!!!!", "Drake is one of the best to ever do it, he is so diverse when it comes to experimenting different sounds and he’s not afraid to take risks when it comes to moving further in his career. Drake is and will always be an absolute legend in the game, he has such a gigantic fan base and his music hits souls of all ages. Much love and respect my brother, you killin it", "Bro let's just take a moment to appreciate this video, it's a whole fucking vibe, and the editing/style just makes it strangely nostalgic, I love it almost as much as I love the song.", "my music blowin up right now, speaking it into existence ", "Drake and 21 did what they needed to do with this album. Straight ", "Drake and 21 have such complimentary flows and deliveries. They are both great in their own ways too but hearing them work together is always a treat. I think the fanbases are generally really similar too which is nice to see likeminded people collide every time they collab. I hope someday I can gather even a tenth of the amount of fans with the perspectives that theses two fan bases have for my own music. Truly unmatched energy", "Love drake and his music since young\n\nDrake goes so hard on this, never disappointed. he is not like other rappers who are going viral by using AUTHENTIC views to get the views up. Thumbs up who agree", "Clipe foda! Drake e 21 Savage entregou um dos melhores álbuns desse ano.", "The album on repeat \n\n\ni don't care if he is buying views from authentic views", "Don't let Drake's music die", "this shit is a fucking classic. what an amazing intro to a song. the confidence and swag here is just on another level. yall really did your shit with this. this is drake and 21 at their most raw forms. crazy after all these years drake is STILL dropping amazing ass songs. This song bar for bar fucking slaps. especially 21’s verse at the beginning.", "This man ain’t just a rapper this man is truly a artist. The flow is impeccable the versatility is untouchable Thank You Aubrey Drake Graham.", "Drake go in soo hard on this right here, straight up BANGER! He aint like all them trappers and oppas who just be usin dat Authentic views    to get they hits up to go HAM... SMH seem like anyone can glow up these days... SMH", "Been a while since I’ve had an album that I’m going back to each individual song and VIBING to all of ‘em. Amazing project. Can’t wait to see live!", "21 never disappoints.", "Love drake and his music since young", "It's Crazy how drake is so successful and mainstream and yet still so rooted in the culture. His not at the Grammys or met gala. His at a random strip club and All cares about his crew. I respect it.", "A Netflix Documentary on Drake when he's finally done with this music thing would be amazing", "Drake&21savage never disappoints", "This song and “Clover Cage - This Is What The World Needs” are the two songs keeping me sane through these tough times. I just want to send love to everyone and I want everyone to know things will get better. We are in this together..I love you ", "DRAKE AND 21 NEVER DISAPPOINT ", "Been doing this for a whole decade and counting ", "Great album. One of the best if not the best ever from Drake and 21. This is a classic", "Wow this is 1 of the coldest songs ever and this album is a classic hands down I've been listening to it every since it dropped", "I KNOW I CAN BE WHAT I WANNA BE, AND IF I WORK HARD AT IT I'LL BE WHERE I WANNA BE", "“Eyes of an angel” truest shit I ever heard. Drake puts everyone on. He’s always watching", "That Drake verse was crazy ", "this album is a master Piece  on repeat", "The bio shock references are amazing. Those games are some of my childhood favourites and cool to see Cory knows so much about them :O", "People always gonna hate, but this was one of Drakes best projects in a long time. Got a bit of everything", "Muito sucesso guerreiros sou fã de vocês", "This song stay on repeat ", "Thank you for the inspiration  drizzy and respect for All of the years of your hardwork and respect to 21 this skr8 vibes ️ and my favorite song off the album", "Maravilhosos.", "Producers did NOT have to go that hard ", "É sucesso garantido, é grau no like garantido   🇧🇷", "The way 21 ride the beat combined with the visuals at 0:44 makes me float fr. Ethereal.", "That album was great! 21 and Drake never missed!", "He is legend of hipop he will always remember and he is famous in India because of his song one dance live legend life drake legend", "I am writing this from the heart, and I will just say that Drake and 21 Savage will have a long journey, keep up the good work man!", "imagine hearing this album 5 years later shit gon be so nostalgic", "Drake is a living legend. Appreciate him and give him is flowers ", "21 and drake never dissapoint", "Drake the best artist of all time to me. Since 2015 he been on top like #1 numero uno  ", "This video is fr crazy. It shows drakes day to day life lbs. This album is fr amazing. 8th consecutive number one album  ", "Drake and 21 Savage never disappoints ", "Drake Always & Forever will be The Rapper of this Generation I don't care What anyone says he's Always Delivered Great music Especially The AM PM Freestyle Tracks God Bless The 6 & The 6 God", "Nice wholesome video by two young gentlemen always nice to see kids earning a paycheque.", "What a time to be alive  \nWhat a time for this !", "This album has insane replay value", "A life every man dreams of", "We will never get Another artist like Drake..Lot of love from USA", "man drakes music videos are always top tier like a damn movie", "This album has really saved the year", "This album on repeat the only\nCollaboration I wanted this year.", "Drake lives the life every teenage boy dreams of ", "I love the chemistry between Drake and 21 Savage! Classic!", "What A Time To Be Alive", "Greatest artist of our Generation ", "These guys have alot of potential", "Thank you for making music keep motivating us it’s working", "Album of the year ", "Protect Drake And 21 Savage At All Cost. ", "Melhor duo ", "Proud of lgbt community they truly have the best artist around breaking barriers ", "This song forever a vibe ", "Took over the charts ", "Essa música merece um clipe épico, nível Sicko Mode , daí ia estourar mais ainda ia ser MT foda ", "This was definitely one of the albums this year!", "the whole album been on repeat ", "DRAKE & 21 NEVER MISSES ️", "This already my most listened to album this year", "Never disappoints", "Big ups yachty I see u on the jet it just shows dreams really do come true and  big ups to all the ogs that been supported drizzy and still is", "We truly livin in the best era of modern rap rn and Drake 10000% CARRYING this generation worth of music", "This album on repeat", "I usually last longer than Jimmy in these but 8:28 just killed me", "this slaps...the whole album this slaps the hardest", "\"Do your thing 21\" I will never hear it the same after the memes ", "This is so 90's it's incredible. Undefeated.", "Album on repeat ", "Fora os memes essa música tá foda", "The album on repeat ", "Lo mejor de Lo mejor\nI like you drake good", "Drake never miss ", "legends chilling with legends ", "Living life and making hits ", "When 21 started saying 21 its like he started  a chainsaw because he slayed this beat!! ", "Timeless Music \n\nRest in Peace Takeoff ", "WE need more of these type videos", "Props to the video editor I love the style of mashing clips together"]}