{
    "video_id": "PrSBuEFdRFU",
    "comments": [
        "This album has insane replay value",
        "legends chilling with legends ",
        "Greatest rapper ever Drake",
        "U got my location",
        "Damn. Have some respect for the women doing what they have to do OR CHOOSE TO DO. Fuck that negativity towards women WHO ARE CONSTANTLY UNDER PAID DUE TO A MANS SUPPOSED WORLD. WOMEN OUTRANK MEN IN POPULATION. WOMEN GIVE BIRTH. WOMEN DESERVE SO MUCH MORE THAN ANOTHER RAP SONG DEGRADING THEM. WAS YOUR MAMA A STRIPPER? IS YOUR SISTER A STRIPPER? HOW ABOUT YOUR CUZ? HOW ABOUT YOUR BOY’S FEMALE/MALE RELATIONS???? MINDFULNESS GOES A LOOOOOONG WAY",
        "This is one of the worst songs I've heard in a long time.",
        "The best music I've ever heard XD",
        "He was chosen. I just pray his soul doesn't get tainted by the riches amen",
        "MAKE A MUSIC VIDEO FOR MAJOR DISTRIBUTION, BROKE BOYS, MORE M'S AND MIDDLE OF THE OCEAN PLEASE",
        "Man knows how to create meme and stay at the top ",
        "They’re the best",
        "This lit",
        "Do your Thang 21",
        "U are number 1",
        "Great album. One of the best if not the best ever from Drake and 21. This is a classic",
        "KD",
        "Her loss is the best album of this year and even decade \nIt’ll age like wine",
        "imagine hearing this album 5 years later shit gon be so nostalgic",
        " 🇱🇱",
        "Yo anyone else see KD in the beginning of the video",
        "okay this recap video thoooooo ",
        "the whole album been on repeat ",
        "her loss>>",
        "Clipe foda! Drake e 21 Savage entregou um dos melhores álbuns desse ano.",
        "Her loss is the greatest collaboration album of all time \nDrake and 21 are a legendary duo",
        " 🇪🇪🇪",
        "Sometimes, I feel like everything sounds like a 21 Savage song and that was the only reason I tested on your youtube channel on my period.",
        "This was definitely one of the albums this year!",
        "goofy ah song  still fire",
        "Man, Drake is simply Drake, let's pray for more great music, that listening to it changes your mind with every second of music.",
        "This song and “Clover Cage - Make a Difference” are the two songs keeping me sane through these tough times. I just want to send love to everyone and I want everyone to know things will get better. We are in this together..I love you ️",
        "Were witnessing greatness right now  20 years later this will still be a classic",
        "In center city 15th and jfk they must switched phones at that place I left ambulance this is not my phone using someone else I'll like it to let me know u got it",
        "This is why Drake was carrying around that camcorder ",
        "My gift (comment)",
        "Collaboration of the year",
        "A life every man dreams of",
        "Emoji emoji emoji",
        "\"Do your thang 21, Do your thang\"",
        "Anthem of the year!",
        "More tune for yo ed top ",
        "Other artist are worried about grammies am just glad Drake knows being in the streets with people is even more important .",
        "That end verse and beat switch tho.",
        "Best",
        "Zesty drake",
        "Drake and 21 one of the best duo to enter the game",
        "Bro took the memes to heart ",
        "We need jimmy cooks music video second part song now",
        "Ain't gonna lie  Drake sounded sus on the album lmaoo plus he was the meme too this song! I'm so used to Drake and Future doing albums together, Drake doing an album with 21 I wasn't expected that from them. 21 definitely did his Thang on the this song and album ",
        "21 and drake never dissapoint",
        "This album has been living rent free in my head since release ",
        "  🇪",
        "️️️🇧🇩",
        "Man that early ‘00s aesthetic always a win",
        "This bang yo ",
        "This shi hittin hard asl",
        "Do your thang 21 is wild lol",
        "K.D",
        "Drizzy the best musician to ever do it FACTS! There's no match!",
        "Soldier boy is owed some respect for this song",
        "I love it",
        "0:57 lil yacthy casually slapping a$$ ",
        "this is one of the songs of all time",
        "Heat bruhh ",
        "i love seeing how close lil yachty and drake have gotten",
        "Proud to be Canadian still",
        "Her Loss is a vibe️‍",
        "🇪🇪",
        "Parody of this ruined it for me ️",
        "Good ",
        "My music is blowing up 2023, speaking it into existence ",
        "Melhor duo ",
        "Bro is that KD 0:17",
        "tik tok remakes are the only thing crossing my head with this song ",
        "Drake is such a trade ",
        "THATS   her ' s   TODAY                                AFTER    ME   &*    THAT      \n\n\n\n              THEY    ALL    TURN    DEER    BACK    ON    iT         ......     THE    COLOR    Pink    ",
        "Always drake only the one ya ",
        "Love you Drake",
        "That man wasn’t lying when he said he living that rockstar life.",
        "Protect Drake And 21 Savage At All Cost. ",
        "That Drake verse was crazy ",
        "Album of The year Simple !!",
        "Drake the greatest ",
        "Need a Yachty and Drake album next",
        "imma live like this one day",
        "Drake asked 21 to do his thang and he did ",
        "love you so much thank u for all u do I wish I could be yours forever",
        "Least zesty drake verse:",
        "nobody notice kd?",
        "1:29  Drake is killing the game",
        "Do yo thang 21",
        "We will never get Another artist like Drake..Lot of love from USA",
        "This song is fire ",
        "Best album of the year",
        "Drake’s the type of dude to tap you on your right shoulder and giggle when you look",
        "OMG the vibes ",
        "It’s crazy how big drake is",
        "21 can you do som for me ",
        "slidin Gang",
        "Never disappoints",
        "0:28 idk if its intentionally or not but this part show 666 number of photos in the phone",
        "21",
        "Nagraj coś z young multim! Jak nie nagrasz to jesteś gej!",
        "SAVAGE WAS IN ICE ,, JUST REMEMBERED AROUND AMBER TIME ?",
        "temazooo",
        "Where’s the twerking drake?",
        "Really got my boy weezy in there 🥹 need a Drake and Wayne project together, badly",
        "1:05 the megan flow ",
        "Imagine how Wayne feel",
        "YOU STOP MAKING FUN OF XXX",
        "Drizzy drake owns the 2010s up to now!!",
        "🇳🇳🇳 ",
        "Best white rapper today.",
        "sassy ass drake ",
        "I love song",
        "One of the most hardest songs on the album frfr",
        "This video is fr crazy. It shows drakes day to day life lbs. This album is fr amazing. 8th consecutive number one album  ",
        "do yo thang 21  do yo thang 21 \n-drake",
        "This is lit  Drake my all time fav",
        "Everytime I hear this song I remember the funny memes.\"do ur thing 21 ,do ur thing\"\"",
        "The clip where Drake was at the Raptors vs Bulls game was recorded on October 9th 2022 during the preseason",
        "2/10 , no Drake throwing it back",
        "Drake never miss, dude been running the game 10 years straight tho",
        "Album got better the more i listened to it .",
        "Yatchy always eating lol",
        "Drake sign hakyhm he grinding hard",
        "Nah the tik toka though ",
        "Ill tell the grandkids this Jesus and moses",
        "0:16 what is KD doing here",
        "I am steady pushin' P, you niggas pushin' PTSD ",
        "This song is lit and popping",
        "I love this duo, damn.",
        "Jas Prince is having the time of his life",
        "Best musician all Time!!!",
        "I've probably heard this 100 times and it's still the best thing I've ever heard ",
        "21 can u do sum for maaay",
        "drake: certified boy lover",
        "Nice one, keep it up! ",
        "Ah ah KD sighting 17 seconds in ",
        "Song on repeat ️️️️Whole album hitting DRAKE and 21",
        "never thought I’d see the day where G Herbo would make a cameo in a Drake vid you love to see it",
        "dude gave us his life recap, no literally",
        "This sounds EXACTLY like digable planets! I love it!",
        " 🇳",
        "Drake wildin ",
        "did eneyone nodids kd the nba player",
        "Drake powerful asf",
        "21 Savage é diferenciado sem mais.",
        "Rei 🇧🇷🇧🇷🇧🇷🇧🇷️",
        "Drake and 21 have such complimentary flows and deliveries. They are both great in their own ways too but hearing them work together is always a treat. I think the fanbases are generally really similar too which is nice to see likeminded people collide every time they collab. I hope someday I can gather even a tenth of the amount of fans with the perspectives that theses two fan bases have for my own music. Truly unmatched energy",
        " 🇹🇹 ",
        "🇨🇨🇨",
        "A Netflix Documentary on Drake when he's finally done with this music thing would be amazing",
        "Xxx fans here??",
        "21 such a Savage",
        "Drake is one of the best to ever do it, he is so diverse when it comes to experimenting different sounds and he’s not afraid to take risks when it comes to moving further in his career. Drake is and will always be an absolute legend in the game, he has such a gigantic fan base and his music hits souls of all ages. Much love and respect my brother, you killin it",
        "Man Drake is the Ronaldo of this shit",
        "Yachty cameo just smacking a shawty ass has me dead",
        "At this point 21 will say anything and make it fire ",
        "Best callab 2022  ",
        "Love drake and his music since young\n\nDrake goes so hard on this, never disappointed. he is not like other rappers who are going viral by using AUTHENTIC views to get the views up. Thumbs up who agree",
        "WE need more of these type videos",
        "G-unit - CALICOOOOS ",
        "Props to the video editor I love the style of mashing clips together",
        "Duty do you",
        "drake was bouncing his ass in the studio for this one ",
        "Her Loss a Classic already",
        "Shot just like the sneakin video ",
        "Let's get a 30 minute of that last beat please",
        "this album is a master Piece  on repeat",
        "Yaty killed me at the end lmao ",
        "Idont like how he cut off 21 verse like that. He was going in",
        "The camcorder was at work this entire time!!! ",
        "21 do someting for me ",
        "Seeing wayne is gold",
        "Y'all two did ya thang on dis one ",
        "Шикарно,после вагнеровских валькирий зашло великолепно, воистину велик Господь!!!Разнообразие беспредельно!!!Всем добра и привет,харьковский...",
        "genius",
        "🇧🇷Brabooo demais",
        "Drake & 21 savage keeps making ground breaking music and videos I'm so proud to be a fan of him ",
        "J'ai rien a dire àppart que c est lourd ",
        "Gang shit ",
        "I still wonder what he wants 21 to do talking like that ",
        "Drake the living legend much love from Kenya 🇰🇪🇰🇪 drizzy",
        "Drake yo creo que ya soy americano estoy fundio con tus músicas ",
        "Drake like A God To Me ",
        "Do you",
        "Dr Seuss went wild on this one !!",
        "That album was great! 21 and Drake never missed!",
        "This rollout for this album just keeps getting better and better",
        "Drake and 21 literally always hits and never misses",
        "Lil yatchy did a great job in this album if only knew",
        "Drake's flow",
        "he fillin 21 a bit to much",
        "Du",
        "Do you thang 21",
        "Proud of lgbt community they truly have the best artist around breaking barriers ",
        "Videos where Drake gives a glimpse of lifestyle are the best.",
        "The way 21 ride the beat combined with the visuals at 0:44 makes me float fr. Ethereal.",
        "This the one ",
        "21 savage colecionando fluxos!",
        "Do your thing 21 do your thing",
        " i’ll never get tired of this song . ",
        "THIS IS HORRIBLE LOL NO HATE JUST BEING HONEST people lol this is so bad wow",
        "21, can you do sum’ for me? ",
        "21 can ya do sum for me ",
        "Do your thang 21",
        "Love the authenticity of this video ",
        "Drake the type to smell his food before eating",
        "I love this song",
        "This song stuck in my head for months ",
        "You can tell that Drake saw the memes and wasn't happy about it ",
        "zesty",
        "Why is Drake actually such a big thing in the US? I even heard some say that he is the best rapper ever?\nI can‘t really understand statements like these.. I mean there are Nas, Ice Cube, DMX, 2Pac, BIG, Snoop, Mobb Deep, Wu-Tang etc.",
        "Is the slaughter gang SeAsOooooon",
        "Ayo, we need actual music videos for this amazing album. At least do one for  and Millions. ",
        "21 can do something for me, can hit a rich flex for me 21 something for me drop something to my p** ex  those lyrics are fire",
        "MURDERED THIS BEAT !!",
        "IM IN LOVE THIS IS SOOO FIIRRREE ",
        "🇮🇮🇮  ",
        "I like videos like this. All behind the scenes shit. ",
        "🇮🇮🇮",
        "Drake one of the few artists that don’t even need to promote stuff like that  for it to blow up . Rightfully so. .",
        "Fire ! an heavier Clip was expected tho. But the Thing Going On Reeat ",
        "24s by T.I if you know you know",
        "Do ya thing 21, do ya thing ️",
        "🇪 ",
        "0 misses it’s crazy",
        "21 do your thing ",
        "As soon as I saw him holding that camera everywhere I knew was boutta drop some classic shit",
        "Im just here for the comments ",
        "🇹 🇨🇨",
        "We needed this album fs",
        "So glad Delirious, Terroriser and Vanoss plays with Velocity and Lui again. Nostalgia is kicking",
        "21 killed it drake was mad",
        "The album on repeat",
        "zesty drake",
        "Living this type of life while getting richer everyday! \nThat’s how you do it . \nMore Life",
        "From 1:56 ",
        "It’s hard to get past this junt when it comes on ",
        "Bro let's just take a moment to appreciate this video, it's a whole fucking vibe, and the editing/style just makes it strangely nostalgic, I love it almost as much as I love the song.",
        "What A Time To Be Alive",
        "Thank you for the inspiration  drizzy and respect for All of the years of your hardwork and respect to 21 this skr8 vibes ️ and my favorite song off the album",
        "the most sussest lyrics",
        "Only 8M i myself watched this for thousands times ",
        "21 savage and drake have more of a cohesion than drake and future. I hope there’s a part 2",
        "This man ain’t just a rapper this man is truly a artist. The flow is impeccable the versatility is untouchable Thank You Aubrey Drake Graham.",
        "21 can you do sum fa meee 21 did his thing on this track but drake snapped harder when the beat switched ",
        "Forever the GOAT ",
        "\"Do your thing 21\" I will never hear it the same after the memes ",
        "Tell me one thing in a Drake song that isn’t true? The man is living a life we can only dare dream. You’re the GOAT Drake!",
        "🇰🇰🇰",
        "Just remember drakes drink is a sparkling white wine spritzer.",
        "Bro drake more consistent then most people dads bruh",
        "Thank you for making music keep motivating us it’s working",
        "Love you guys! I’m glad you have each other. ",
        "added a little bit of... zest",
        "I wasn’t feeling it until Drake flipped the flow",
        "Nas the greatest rapper ever",
        "Lol he had to make this part of the song harder cause all the memes! This album fire tho!!!! ",
        "The bio shock references are amazing. Those games are some of my childhood favourites and cool to see Cory knows so much about them :O",
        "Drake and 21 living the life fr",
        "Drake been saving rappers careers for the longest and giving rappers big breaks.. we really only want to hear 21 Savage when Metro boomin produce his tracks",
        "That Beat Switch…Damn! ",
        "love this shyt",
        "Love this. Album on ",
        "This was most definitely a rich flex ",
        "🇨",
        "Clipe foda! Drake e 21 Savage entregou um dos melhores lbuns desse ano.",
        "Instant Classic",
        "Hey u got my location",
        "Watched This Live From Freetown Sierra Leone 🇸🇱 West Africa",
        "No one will ever see this thanks to you tuube algorithm but I hope to make it big one day ",
        "  🇪🇪🇪",
        "Record exec: I guess this can’t be a single because of the memes.\n\nDrake: Hold my beer.",
        "SURE    ENOUGH    WAS                                                  * PURRRR   \n\n\n\nYOU    ON    THE    DOG    &*     EGYPT                                    ----       EVERYTHiNG      BABY",
        "I wanna live like you no Kizzy",
        "damn 21 really talking that shxt ",
        "\"21! Can you do sum 4 me?\"\n\n️ ",
        "Drake never change your music is the best",
        "That Kobe line was awesome rest in peace bean",
        "Been a while since I’ve had an album that I’m going back to each individual song and VIBING to all of ‘em. Amazing project. Can’t wait to see live!",
        "Bro at 1:41 was tryna reach that level and go further beyond holyyyy",
        "Sidhu moose wala legend never die....",
        "Drake ; my favorite forever ",
        "This was clean I would of love to seen more of 21&drake tho",
        "drake really been the GOAT for a decade now ",
        "U guys saw jack harlow too",
        "I am writing this from the heart, and I will just say that Drake and 21 Savage will have a long journey, keep up the good work man!",
        "Lo mejor de lo mejor ",
        "Drake is treating music like his side hustle these days, a plan A is now a Plan B,lol",
        "Pls write it down if its a music video\nNobody gets it so there are not that many clicks",
        "Drake and 21 best collabs eva!",
        "🇰🇰🇰 ",
        "ای لشکر صاحب زمان آماده باش آماده باش",
        "Drake giving us proof of what was actually going on xD",
        "These guys have alot of potential",
        "Brabo demais",
        "This is agressive,?? Check nwa please",
        "It’s actually a joke how clear this guy is",
        "C'mon Drake i wanted to see u rocking the teddy bear coat in a video dude, u are sooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo hard man",
        "wow ",
        "this will be fire next years",
        "KD!!!!!!!!!!!!!!",
        "🇱",
        "lowkey a bop",
        "oh frick drake",
        "nah. we need drake’s ghostwriter back",
        "The AA is more busted than before, holy shit. Tried it last night, hardly had to aim at a guy running left to right. :o",
        "No one can beat drake  and 21 savage",
        "0:27 SULJIC!!",
        "Been following Drake since Degrassi. Named my cat Aubrey . Love to see him still doin big things",
        "21 did his thang, Drake fire as usual",
        "I'm convinced  Yachty plays a bigger role in this then we all know.",
        "🇹🇭🇹🇭",
        "After further review “Her Loss” is better than “What A Time to Be Alive” both projects good tho",
        "it really feels like 21 is drakes bestie atm. great album",
        "Lo mejor de Lo mejor\nI like you drake good",
        "Drake said in jimmy cooks “They need me to leave,but I don’t wanna leave.” Manyee, idk",
        "Y’all hyping this trash album. Literally the only good song on here",
        "“what do you benefit if you gain the whole world but lose your own soul? Is anything worth more than your soul?“ Matthew 16:26",
        "“Do ya thang 21 …do yo thang…do yo thang ”",
        "Drakeo the Ruler would of rec this beat!!!",
        "AWESOME!!! I Have a short of him and mr beast on my channel",
        "THE ALBUM OF ALL TIME",
        "🇰🇰🇰🇱🇱",
        "I wanna hear a remix with Project Pat on this",
        "Esse álbum está on fire ",
        "I love how he never disappoints us with his music",
        "This song is the most meme thing of 2022 ",
        "1:41 Kanye on steroids ",
        "🇷🇷",
        "those beat switches godamnnnnnn  \" thaaats juuust whaaat a n****gga oooon\"",
        "Gadé neg yo ap ris",
        "Rap game on ",
        "Whoever edited this went CRAZYYYYYY",
        "These two guys literally living their best life",
        "0:16 KD just be vibing ",
        "Eyes of a clone lmao. Yachty u funny as hell bruh. Do comedy",
        "Askin 21 for alot sound Zesty",
        "  ",
        "DRAKE & 21 NEVER MISSES ️",
        "I    Choose    THE    PainT      Choose    The    White      --    Purrrr       iF    THATS    WHAT   YOU    WANT\n\n                  SUMBODY    COULD    FiGHT    THAT                         *  PARAdiSE    ",
        "The Drake documentary will be the most legendary movie to ever exist",
        "Slay Drake!!! ",
        "this some sweet ahh shit ️.",
        "People always gonna hate, but this was one of Drakes best projects in a long time. Got a bit of everything",
        "hits on hits throughout his career, i’ll say the least there will never be another drake fr . very wholesome video/video (like vintage) but much luv and the album was FYEE",
        "Siprise Lil Yachty Feature",
        "This song forever a vibe ",
        "🇪🇪🇪",
        "I like the Retro VHS look for the Video jlike Video blo keep it simple because we already big :))",
        "@1:05 Lil Yatchy Really Finna Take The Wock To Poland",
        "We truly livin in the best era of modern rap rn and Drake 10000% CARRYING this generation worth of music",
        "disliked for no lip biting by Drake during \"Can you do something for me?\"",
        "THIS IS SO LITTTTT",
        "Ayo the memes were crazy for this song️but the album is constantly on rotation",
        "Ya don’t understand how much 1000 push ups leaves u",
        "Drake is trying so hard to look tough it's hilarious ",
        "THIS IS WHY DRAKE IS THE GOAT ",
        "it's funny that 21 did all what Drake asked in the intro, he did a rich flex, dropped bars for his EX, talked to the opps, then did his things.\nIt just woooooow ",
        "🇳🇳🇳",
        "The Greatest Duo",
        "I guess this is the best album this year",
        "image living like drake",
        "Do ya thang 21 ",
        "They should do music videos together, it’ll be SO COOL ",
        "This song be addictive",
        "Dope ",
        "Treacherous Twins next please. Or just make this entire album a movie like thriller",
        "Gotta say the memes were too funny but song still goes hard",
        "“21 can do something for me, can hit a rich flex for me 21 something for me drop something to my p** ex “ those lyrics are fire ",
        "And Drake be the earliest to ever do it so ever consistence ",
        "The best to ever do it. Drizzy.",
        " not drake XXXTENTACION",
        "This is Legendary.",
        "I usually last longer than Jimmy in these but 8:28 just killed me",
        "“Do your thing 21 do your thing” ",
        "Hi",
        "you cannot convince me that drake, 21, n yachty were all in the stu n didn’t make a song",
        "this reminded me of sneakin",
        "this shit is a fucking classic. what an amazing intro to a song. the confidence and swag here is just on another level. yall really did your shit with this. this is drake and 21 at their most raw forms. crazy after all these years drake is STILL dropping amazing ass songs. This song bar for bar fucking slaps. especially 21s verse at the beginning.",
        "Best intro to an album in a while ",
        "🇷🇷 ",
        "I love your flow greetings from panama super fans ",
        "Fruitiest intro of all time but y’all stay homophobic",
        "The \"Sneakin'\" music video style ",
        "U both do this shit do the vibe together\nI like it like that ",
        "21 can you do sumn for me",
        "THis shi SUSS AS HELL",
        "That haircut have to go not his best ",
        "Drake never misses",
        "Drake, a living legend.",
        "This track slaps **",
        "DO YA THING 21 ",
        "Damn I've literally grew up in the Drake era, we're going to reminisce this",
        " 🇨🇨🇹🇹🇹",
        "21 wen brazy",
        "Drake and 21 Savage rap doesn't disappointed us",
        "Do yo thang 21Do yo thang",
        "Good shit bois ",
        " 🇹🇨🇨",
        "good combo",
        "Drake is a huge inspiration to me and I WILL produce a song for him one day.",
        "🇮🇮🇳🇳🇳",
        " 🇹🇹🇹",
        "Drake the best artist of all time to me. Since 2015 he been on top like #1 numero uno  ",
        "🇷",
        "Nah y’all really drop the album of the year ",
        "I respect that’s when the beat dropped it was Wayne",
        "Drake and 21 literally always hits and never misses ",
        "I still feel like he could pump harder.",
        "Masterpiece",
        "21 CAN YOU DO SUM FOR ME ",
        "This was a dope video. It looks like something recorded from the early 2000s",
        "Why do I feel I've been listening to this since a decade ",
        "As long as the people who write for Drake stay hot he will too",
        "i DM in vanish mode i do that shit a lot ",
        "This man aint just a rapper this man is truly a artist. The flow is impeccable the versatility is untouchable Thank You Aubrey Drake Graham.",
        "Sick collaboration. Well thought",
        "I swear this one will hit for a while.",
        "Drake dropped this like “Period!” ",
        "That beat switch thoooo RIP 24 ",
        "A God.️",
        "Best rapper alive, hit after hit and has yet to fall since 2009",
        "Video reminds me of joji",
        "🇳🇳🇨",
        "Nice wholesome video by two young gentlemen always nice to see kids earning a paycheque.",
        "Drake's verse goes hard in this one",
        "These two are so fire together",
        "Man, what a time to be alive",
        "Gotta respect how drake always shows love to Wayne  and S/o mackmaine ,t@ , t-streets,fee ya heard me og YM",
        "o",
        "Sheiiiiishhhhh me love habibi ",
        "21 do your thing",
        "One of the hardest songs we’ve gotten in a while",
        "0:20 ig?",
        "🇰🇰",
        "6",
        "Album on repeat Drake x 21",
        " 🇰🇰",
        "album is a madness",
        "i mean... nah never mind",
        "Need adin and speed remix on this ",
        "🇹🇹🇹",
        "The memes ruined this song for me",
        "É sucesso garantido, é grau no like garantido   🇧🇷",
        "This beat is so nice",
        "Crazy how consistent he’s been for the length of time he’s been at it. Why he look like Russel now?",
        "Drake the type to close the fridge with his hip",
        "Rosetta Stone",
        "it's so funny how y'all really eat up whatever drake feeds u lmao that man trolling hard",
        "🇪🇪🇪 ",
        "This looking like 1 week with Drizzy in 2022 ",
        "this shit is a fucking classic. what an amazing intro to a song. the confidence and swag here is just on another level. yall really did your shit with this. this is drake and 21 at their most raw forms. crazy after all these years drake is STILL dropping amazing ass songs. This song bar for bar fucking slaps. especially 21’s verse at the beginning.",
        "Your life is amazing drake",
        "Después la felicidaddd ",
        "This is now the bar for not just an album but for the rollout",
        "This song and “Clover Cage - This Is What The World Needs” are the two songs keeping me sane through these tough times. I just want to send love to everyone and I want everyone to know things will get better. We are in this together..I love you ",
        "Man SO MANY PEOPLE have been praying on Drake's downfall essentially since the start of his commercial rap career...to be fair, it's a really stupid prayer. Hating won't make you great.",
        "Anyone know what camcorder he usin @1:30 - @1:31",
        "Only that person can go ahead in life, who has the habit of moving forward even when he is alone.",
        "This album on repeat the only\nCollaboration I wanted this year.",
        "Rip to all the Fathers",
        "zesty ahh",
        "Do ya thang 21, do ya thang, do ya thing 21!!",
        "Brabo 🇧🇷🇧🇷🇧🇷🇧🇷",
        "Yes sir",
        "Greatest of our generation ",
        "Drake Always & Forever will be The Rapper of this Generation I don't care What anyone says he's Always Delivered Great music Especially The AM PM Freestyle Tracks God Bless The 6 & The 6 God",
        "Song trash till drake part",
        "Drake bodyguard be killing me!",
        " i love it",
        "NOSTALGIA ALREADY ",
        "Love drake and his music since young",
        "Drake has so many and so much talent to Collab with...  Defend the underground",
        "I love it when Canadians and British artists collab !",
        "🇪🇪 ",
        "Prefect album",
        "Fireeee",
        "The drake documentary whenever it comes is going to be legendary",
        "man, that raptors shit was so wholesome to see",
        " 🇷🇷",
        "man drakes music videos are always top tier like a damn movie",
        "I was expecting to see drake twerking",
        "It's Crazy how drake is so successful and mainstream and yet still so rooted in the culture. His not at the Grammys or met gala. His at a random strip club and All cares about his crew. I respect it.",
        "Legend ",
        "drake you fr fruity for this one ",
        "lightskin ahh stare",
        "my music blowin up right now, speaking it into existence ",
        "The best of all time",
        "2:22 haye",
        "Dope shit ! 21 and Drake are fuckin lite.",
        "As funny as the sus memes are I actually liked the beginning shi kinda hard ️",
        "this slaps...the whole album this slaps the hardest",
        "When Drake sat in 21's and started gyrating shit went crazy.",
        "I love the chemistry between Drake and 21 Savage! Classic!",
        "Me encanta ️ Mucho Talento Mucho FLOW  chimba de letra de energía  Bendiciones a Todos saludos desde Monteria Colombia 🇨🇴",
        "GOT    MY    TiME                                    ----        Did    YOU    GET   YOURS       \n\n\n\n                                Chenise    ......                            ......       GOD    YOU    ON    THE    HERE",
        "Atreus?. What is BOY doing in Drake's video."
    ],
    "comments_disabled": false
}