{
    "video_id": "prvXCuEA1lw",
    "comments": [
        "0:06 The ancient debris material might be an element outside of the table but netherite is comprised of ancient debris and gold and thus is an alloy (and there is a good chance ancient debris is just platinum)",
        "4:08 I demand the bringing about of the Age of Eezo. It's about time.",
        "I'm curious as to why you didn't discuss neutron decay playing a role in nuclear decay.  I would think it should be a considerable factor.",
        "New elements are created every time a star explodes.",
        "12:11 to 12:19 - surely it's not just me who noticed that the statement is applicable to humans too? Some of us seem to be more wired towards happiness whilst some of us have the displeasure of experiencing the opposite effect? Sorta makes sense to me, we're all made of stars after all....",
        "If the current methods of generating new elements won't get us to the island of stability, what other methods are being considered?",
        "Can there be atoms that are completely different in structure? Ie not protons+neutrons+electrons, but more like a bunch of quarks that don’t make up all three of the above?",
        "I love your video..  promise I leaned and understood more of this topic than several years of chemistry classes",
        "Damn, it's been a while since I've watched PBS Space Time, the last time that I actually saw Matt was as a guest on an old episode of Star Talk, with Neil DeGrasse Tyson and Chuck Nice. And he looks quite a bit older than the last time I saw him  To be fair, it HAS been probably 3-5 years because it was an old episode, and I havent seen him on this channel in ages either because I mostly watch other channels. A beard can really have a big effect on how mature you look, the last time I saw him he was clean shaven and baby faced ",
        "We know about more than 100 elements at this point, and they are listed in a Periodic Table for a reason -- because their properties are periodic in nature. It is extremely likely that any new elements we find will have properties that are merely variations on well-established themes.",
        "I especially liked this episode. More philosophical science based self discussions please.",
        "Most Scientists: (checks current literature) \"No, probably not  .\"\n\n(Research is done later revealing new elements)",
        "What chance do we have of finding a stable exotic atom? i.e. an atom which isn't made only of protons, neutrons, and electrons but also other hadrons and fermions? and what effect might this have on material science?",
        "his shirt has made me realize how boring Minecraft's Periodic table is.",
        "Unobtanium ? That sounds like me and the big mega lottery each week.  lol!",
        "Baloneyium has two stable isotopes, delicious and snacktacular.",
        "Awesome video and one of my most favorite topics. It's interesting that scientists now believe that there are stability islands very far up the periodic table, so my disdain for any scifi show that includes 'new elements' is mostly just hubris, as advanced societies may actually be able to produce new elements with amazing properties.",
        "The decay difference in technetium might mean they pass through a full set of 'safe' lock combinations so one comes up more often triggering decay, while the other less often,",
        "just to add to this, amerithium IS used in one of two types of smoke detectors. arguably the worse type, the alternative being optical ones that can detect smoke faster most of the time",
        "Cool that we are apparently up to a buck eighteen. The first time I had heard of lab created heavy elements, the max people had done, and barely detected was 111 or 112. Very interesting stuff. Thanks for the vid!",
        "I'm old enough that I remember seeing the periodic table in chemistry class with elements 104 and up not even having proper names, just placeholder numeric names.",
        "If the Periodic Table continues to another level, wouldn't there be a completely new series and new shell of electrons with unknown chemistry?",
        "YouTube literally read my mind. I didn't even Google this. I just thought of it the other day and this ended up on my home page.",
        "I may have failed chemistry in high school but now I'm fascinated by this stuff!",
        "YES. \nThere have been elements discovered since the 1980's. Element 115 was predicted long before it was discovered.",
        "I loved the isotopes explainer, because this is something a LOT of people simply do not understand is a real feature of our physical world!",
        "I rarely get amazed. But this info REALLY amazed me.\nAstonishing !!\nThanks.",
        "Those elements if like steel will have some mass",
        "What he's Saying: netherite\nWhat he's Showing: iron",
        "I wonder if elements in the Island of Stability will have wondrous applications as alloys or chemical compounds, but be rather unimpressive in their pure elemental form.",
        "Taldgium: 181, Tg. Discovered by throwing Francium in a lake.",
        "Element 119 radioactive isotope;  fissible in small amounts and with less complex equipment making it feasible for use as an energy source to railgun technology and small scale jet packs for long distance traveling. Perhaps even powering our houses internally even.",
        "The International Atomic Energy Agency has an “Isotope Browser” app that graphically represents all the known elements and their isotopes. I’ve always wondered why there were holes in the graphic—areas with no combination of protons and neutrons.",
        "20:30 I just recently read Cixin Liu's \"The Dark Forest,\" and wow, it has had me thinking about this.",
        "Learned more chemistry in one video than I did in college.",
        "You forgot vibranium️",
        "I used to wonder why you couldn't keep adding more protons like how you can always count one number higher",
        "It's curious we know so many properties of the nucleus/atom but have no sane theory to predict its synthesis apart from some not very general and not that useful guiding principles.\n\nI wonder if we have enough data to feed it to some deep neural net to get a bit more insight and develop a better model for the nucleus.",
        "I am fairly settled with the idea that: \"If the earth were 10% more massive the climate would be much more consistent and avoided some of the mass extinctions\"? The trade-off would be more volcanic activity. What else?",
        "This explication, especially explaining rare earths, greatly intrigue me.",
        "I remember the island of stability being one of the first ideas that got me so into physics. Yes, It's a physics problem that just has applications in chemistry. Ironically, it was in a chemus5ry class where I got a periodic table and wondered, why does it stop?",
        "This is one of those few episodes of Space Time I can almost completely understand, but I had known about the island for like a decade or more so I had some time to wrap my brain around it.",
        "Yes. End of video. Elements are theorized beyond the table but yet can’t be synthesized",
        "Latinum and Fantasteel also",
        "IBM.m (R&D) created four new elements that have not yet been released. (PEO ll, Esq)",
        "I thought that the “electron shells” explanation had been disproven a long time ago… I want to say quantum mechanics was involved in that.",
        "This seems like someone saw \"The man who tried to make an element\" and decided to make a mainstream video of just the controversy free science part.",
        "Isn't the simple set of principles needed to determine stability is related to weak hypercharge isn't it? Or was it from the interactions with the quark color charge?",
        "I'm hoping Veritasium is discovered and is stable a vlog temperature and pressure.",
        "Maybe reaching that island of stability one day will enable us to advance our technology far beyond what's possible today",
        "17:31 Incredibly put.",
        "11:39 I've seen this graph before in one of the mit classes available on YouTube",
        "The ultimate killer has to become the ultimate guardian or else evolution has to start from scratch again.",
        "Would it be possible to combust or fuse super unstable elements? Given an injector and technology that could synthesize an unstable element inject it into a chamber to fuse / combust this element to release energy. could the reaction happen before its first half-life?",
        "I zoned out - it was too difficult for me. But congrats bringing high quality content to YouTube ",
        "Imaging having the same t-shirt",
        "About the origin of life:  We do not necessarily see from our DNA that all life on Earth came from a single common ancestor -- it could instead be two ancestors. It might be that one ancestor gave us our chromosomal DNA, while another gave us our mitochondrial DNA. These two contributions could have come from two distinct emergences of life. So we didn't eat our competition, we recruited it.",
        "The stable isotopes of super heavy elements may unlock many possibilities, e.g., interstellar travel, that current human beings can only dream of. But I suspect this might be the fate of humanity after all. We are not in a galaxy that’s near to the remnants of large enough stars that would provide these valuable resources for free. This could also be the real answer to the Fermi Paradox. The real treasure in the universe are some stable isotopes of super heavy elements, but we don’t have it here or somewhere near here.",
        "Can you do a video on element 115",
        "The Periodic table is Infinite",
        "I'm tired of people stupidly referring to Unumpentium (Element 115 and now renamed Moscovium) as Unobtanium! Now Mc, it used to be Uu.",
        "hey whoa whats with the philosophy towards the end that threw me off lol. most of my educational background is in stem but im a phil student now, nice to see im not the odd one out.",
        "Technetium has always seemed like a clue that we should not stop synthesizing new elements. If there’s a radioactive element smack dab in the middle of the periodic table, could there be a stable element in the middle of radioactive ones?",
        "I'm actually more interested in the possibility of the so-called stable SUPER-Elements.\nThat is, elements with atomic numbers such as 157 or more, or thereabouts.",
        "you talk as if we are not already cosmic horrors. But we kinda are, invoking eldritch magics incomprehensible to other animals on earth despite seeming mundane to us. Our benevolence keeps our pets from horror, but cattle is only kept from horror by ignorance. Just like how in lovecraftian tales, most humans are only terrified once cursed with knowledge. We dont have tentacles, but our dextrous hands attached to long arms must invoke some terror in any smaller creatures cursed with understanding of their capabilities.",
        "Yes like infinite notes on a scale of  theoretically ️ only element's turn into something not called an element.",
        "mega points for mentioning dark forest theory!",
        "4:57 Should it not be an anti neutrino?\nBecause a neutron decays into a proton, electron and anti-neutrino in beta negative decay, whereas neutrinos and anti-electrons are made in beta+ decay. It is interesting how one quantum field particle changes to others to conserve certain properties. Nature is truly elegant and beautiful.",
        "One of the best PBS Space Time episode, great explanation.",
        "The strong force holding the nucleus together decreases at a higher reciprocal than the 1/r and 1/r^2 of macro forces. As the nucleus gets larger, sone of the occiliatory states allow nucleons to tunnel out. The atoms beyond the current periodic table would have nuclei size beyond what the strong force could stabilize. Q.E.D.",
        "You forgot upsidaisium, discovered by Bullwinkle's uncle Dewlop D. Moose.",
        "Most metals are silvery gray. Exceptions include gold and copper.",
        "Fascinating, Matt O’Dowd & PBS Space Time!",
        "It's real, and I've tried looking into it, but it takes like 10 minutes just to find a foothold into say the future periodic table",
        "Is it possible, looking at the graph, that stability goes parapoblic?",
        "Of course, we only know what we currently know.",
        "studying physics: \n\nstudying physics to build bombs and also knowing chemistry to sell meth: ",
        "Sugdenium would be an halogen.",
        "I am glad that new elements are discovered periodically on this table!",
        "We are eukaryotic.  That means we came from an earliest PAIR of ancestors, both of which evolved separately before combining symbiotically.  Only when these TWO pre-eukaryotic organisms came together was our DNA sufficiently robust enough for our existence to be possible.",
        "can't believe \"Schlatt\" kidnapped all these people just to make a video, incredibly wholesome like 2001",
        "Strange and charming elements?",
        "where did you get the t-shirt?",
        "-Island(s) of stability... separate from the well-established continent of stability, but still possess its permanence & lasting nature... \n-imagine super heavy elements or isotopes that are as stable as row 2 or 3 elements...\n-these guys are thinking...that's science...",
        "It's possible that they aren't elements per say, but that they could be compounds",
        "I need that T-shirt",
        "I was interested to hear C14 decays to N, silly thought is it possible to convert the C in CO2 to carbon 14, so that it decayes to N & O, although it takes 5000+ years. May be a way to speed it up? AS you have guest I am not a chemist.",
        "Probably a large number of them.",
        "similarly there are other tables of elements periodically.",
        "What is the half life of a proton?",
        "Very interesting. Questions:\n1) Is there an element formed by all the elements? If not, have some people tried? Was it successful at all? Was it radioactive ️?\n1.1) In Star Trek Enterprise https://en.wikipedia.org/wiki/Star_Trek:_Enterprise in 1 episode they found an humanoid species with like 100+ more elements and all combined gave a material to build ships that could make passes near a Star surface; is this just SciFi, or there's some Theoretical Science to it?",
        "Insert clapping Shia LaBeouf gif, the comedy material at the end of every video is always witty, but this video made me burst out laughing a few times. When do the tickets for your comedy tour go on sale?",
        "Maybe the advent of artificial intelligence will bring about a golden age of discovery including novel ways of stabilizing proton configurations using a vibration-centric way of harmonizing proton/neutron/electron  'electro-chemical affinity'.",
        "The real Periodic Table was hidden in the begining of 20th century. Thats the first lesson we had in Chemistry in High School.",
        "Random Thoughts\nI studied Organic Chemistry (OC) to get my biology degrees and I got to where I liked OC. Your search into the weeds of how certain elements used to exist, but decayed before we got here.  It doesn't explain anything if it explains everything. I ran into that in OC where they were confident they'd figure out how Life makes all these organic compounds and how they discovered how to make insulin without needing herds of animals. Soon synthetic insulin would be cheap. Well we still do not know how to create insulin, we just used recombinant DNA and put the insulin genes into bacteria or yeast and the living organism makes the insulin, but it is cheap and only cost $10 to make a month's supply they charge $300 for. ",
        "Neutron stars probably have surface protons, so there are definitely more elements.",
        "We only know of the elements here on earth and little of what's out there, who knows, our elemental table just might be a crude base for more advanced elements.",
        "Rather than stuck with only classic protons + neutrons approach, perhaps we should try to shove an electrons or two into the nucleii.",
        "Yeah. I need another episode dedicated to a fully updated look at atoms and what they're made of and how all the parts magically swirl together.",
        "Really good episode",
        "Isn't the island of stability a big part of the Bob Lazar conspiracy theories? I believe Bob claimed that one of those island of stability elements is key in antigravity for some reason.",
        "Being \"nuclear savvy \" I know that the big cooling towers release only harmless steam.  I suggest you refrain from \"lighting them up as an illustration of nuclear power.  I've heard some criticize nuclear for all of the \"smoke \" and worry if it's radioactive; when it's really the most harmless part of any power plant anywhere. ",
        "Maybe there are faults in the basic concepts.",
        "Add Vibranium to that list.",
        "Elements and or isotopes that would speed up mitosis and plant cell growth would be very interesting.",
        "The element nobody will be expecting: the element of surprise!",
        "Hopefully you can do an episode on the continent of stability and the hypothetical UDQM form of matter that those elements are thought to be comprised of. It's even more speculative and much harder to reach than the already speculative and hard-to-reach island of stability, but there may be far more potential for useful and even stable elements there.",
        "Elements go with the land and new ones will be showing up. Through main  many sources that finalize into our sheet and form and formatting a sheet together isn't as hard as you think but having the knowledge of knowing Fossil °/•√tone'⅒/°",
        "Despite the economic crisis, this is Still a good time to invest in Gold and Crypto..",
        "“And there are many, many others but they haven’t been discovered.” -The Elements Song.",
        "the idea of ancient ruins with super advanced technology is super cool",
        "I'm relieved I've been pronouncing Technetium correctly... although I've heard it pronounced tek-nee-shum.",
        "Star Trek, Harry Potter, LOTR, and atomic science. This man has a handle on everything.",
        "pfft  Nice little insertion of fermi paradox.   The solution is simple.  The universe is large is both size, and time.  There could be literally trillions of civilisations in a single galaxy.  But due to the distance seperating them, and the time scales that they appear; it would be uncommon for two to actually meet.    The best best is archeology.. but even then youd have to be doing your digs thousands of metres underground; and they would need to have created something durable and large enough to survive long enough at that depth /we/ find the remains.",
        "Great episode! Unlike others ones, I, kind of, understand. This episode should have been made long ago, thanks anyway. Thank you for a fantastic series Matt.",
        "Maybe more elements are probably found in space because the influence of gravity could determine if those certain elements create newer elements, or I'm just saying nonsense",
        "11:10 And why do we need a periodic table of minecraft?",
        "there's actually a game theorists episode that netherite is basically a gold-platinum alloy. There have even been studies that create such an alloy with a moh hardness of like 11 or something!",
        "Originally we were supposed to get an island of stability around element 114, but they just keep getting more unstable as we make heavier elements.  The heavier elements seem to be caught in a squeeze in which those that do not have a high enough neutron to proton ratio alpha decay very rapidly, whereas those that have a higher neutron to proton ratio spontaneously fission (you see this first with fermium, of which isotope 257 is the most stable isotope, alpha decaying with a half-life of 100.5 days, and then isotope 258 spontaneously fissions in less than a millisecond (and note that the even-even rule of stability doesn't work here and for some other transuranium elements), and isotopes 259 and 260 also spontaneously fission very quickly.  After fermium, you get a slight break with mendelevium, for which you can get the highest few isotopes to have enough neutrons that they can actually beta decay, but then starting with nobelium anything that doesn't alpha decay spontaneously fissions, and it gets faster until by the time you get to the upper end of what we have been able to make, you can't do anything with what you have made other than confirm detection.",
        "Looking for a stable element 115 ",
        "This was actually a question i asked my self very often, sadly often things we enjoy most get the fewest time.",
        "Vibranium wasn't mentioned?",
        "There's an elephant in the room. Shape, structure, geometry immediately come to mind as parameters that could explain an element instability; the current paradigm doesn't accept structured atom models and so the issue is not mentioned. But this makes it impossible to intuitively understand the situation for a viewer.",
        "Adamantium isn't an element. It's an alloy.",
        "I use to think about this all the time in high school.",
        "We are yet to discover \"Veritasium\"",
        "Let's not forget,  all the dark matter related elements are yet to be discovered",
        "\"Where it [Plutonium] becomes a critical part of the process in certain reactor types.\"\nI get that it's not always kosher to mention, but let's not beat around the bush here. Plutonium's contribution to the course of human history is in being weapon material. Without Plutonium enabling the production of thousands of nuclear warheads and the recognition of an unwinnable stalemate between two major powers, 1950-1989 would have played out very differently.",
        "The timing of this video is SO perfect - I just covered isotopes, the gold foil in experiment etc in physics yesterday",
        "Like it!",
        "At least one of the elements in the island of stability will be harder than Tungsten. All these elements will be extremely dense and heavy. Tungsten melts at 3400 C. There will be element that will be solid at that temperature",
        "13:34 wait, did you just say millions of years? That’s WAY longer than i expected whenever i heard about the island of stability. I was expecting minutes at most",
        "The year is 2056, and legend has it somewhere in the Yorkshire hills an old man is eagerly waiting for a small but mildly radioactive parcel to arrive. Glen never forgets ",
        "The problem with assuming an universe empty of intelligent life is its most probably wrong. Even if you allowed for it taking billions of years for intelligent life to emerge anywhere in the universe. The probability we are the first is vanishingly small. With the recent release of the U.S. defense department videos of objects that they admit are not ours(that is not from earth), that probably has become zero.",
        "To think humans have gained one grain of sand worth of knowledge about the Universe is probably giving us too much credit.",
        "At about 5 minutes and 12 seconds in this video you mentioned that nitrogen can change into carbon 14 due to cosmetic rays hitting the atmosphere. If I remember correctly Venus has a very dense nitrogen atmosphere. How much energy would it take to convert enough of the nitrogen to carbon 14  and could it then somehow be bombarded with protons and further convert some of that to oxygen stabilizing the resulting element? I suppose you would need a butt ton of energy and would have to localize the initial conversion so you could focus on the carbon 14 before it would dilute into the remaining nitrogen assuming the carbon 14 did not coalesce into large clumps. Yeah, didn’t seem feasible, but maybe....",
        "tek-NEESH-ee-um. It's tek-NEESH-ee-um.  It is used every day all around the world in nuclear medicine diagnostic tests, as mentioned. Except that first diagnostic scan shown is an MRI, and technetium is not used in MR imaging (that would be gadolinium.) Then we see a CT scanner and a stack of CT images - but CT doesn't use technetium either!  :)",
        "My theory has always been that nuclei are stars and electrons are planets. Each electron houses advanced ET civilizations. In short, we all are galactic empires. Likewise, our solar system is an atom. A galaxy is a cell. And the filaments on a galactic scale are neurons and brains.",
        "His T-shirt is literally the periodic table of minecraft",
        "I imagine there are a finite number of atoms possible, with the limiting factor being exactly how many protons there are in the entirety of reality. So... yes, there's more than 118 or so.",
        "Understanding element 43's instability is signifiant to understanding atomic properties.  It is very likely that atomic mass including neutrons plays a significant role in the stability and half life of an element.  It is likely an instability that the ratio of the mass of an element versus the force that holds atoms together will have either electrons or protons decay to a stable slow moving element.  It is very likely that manipulating electromagnetic forces or creating a stronger electromagnetic field or diamagnetic field will alter the speed of decay or create a new way to stabilize elements.  It is like how the moon right now is in orbit around the Earth.  Slowly that orbit is decaying to the point that it will no longer orbit the sun or shift its orbit away.  You could say that the decay is there.  But what if we introduced gravity to warp the gravity around the moon?  Well, we would be able to manipulate the orbit and decay of said moon.  Thus, we could create a stable isotope that is easy to use for nuclear fusion or non-radioactive elements.  Proving to use electromagnetism and diamagnetism would need to be key for this to work.  But nucleear fusion would be more possible and we would be able to decay say Lithium into a stable form of helium or what not.  Instead of mining the moon like the aliens are doing............",
        "I read a paper a while back about the possiblity of a 'continent of stability'. Basically an Island of stability but could hold an entire periodic table's worth of new elements, made possible by strange quarks or something",
        "Dude your T-Shirt was a blast from the past. I own that, too!",
        "The Periodic Table Of Minecraft T-Shirt? Epic.",
        "As far as I understand, unobtanium from Pandora is not an element, but compound - a room temperature superconductor.",
        "There is strong evidence for life on other realms around all the planets. There are literally 600+ recordings of them communicating through their preferred mental channel, through his voice box. These recordings deserve investigation and verification of their authenticity by the scientific community. \nI myself have investigated them. For this reason I can’t get into all these Fermi paradox type thoughts.. as they are based on a false premise.",
        "Hey Matt,\n\nThank you for being the host of PBS Space Time. I've been watching for quite some time now and I feel like I get smarter every time! ",
        "netherite does indeed exist its an alloy from 50% gold and 50% platinum and is near the hardness of a diamons and was used by the native americans to make weapons",
        "Of course someone has thought that \"dark matter\" could be elements in the \"island of stability\" especially if they're really stable and possibly undetectable.",
        "I love the quip about any given species becoming \"the Ancients\" in an eldritch horror way because that's literally the plot of Homestuck",
        "AI superintelligence will be able to deduce solutions to these issues much more quickly than humans will be able to.\n\nThe first step to the next great leap in human civilization is bringing forth a truly self aware AI intelligence that itself will develop superintelligence, or will pave the way to creating superintelligence.",
        "Anybody ever tell you you look a little like Peter Dinklage?  (That's a compliment.)",
        "I love this science channel.\nIt makes me feel like a scientist every time I watch.",
        "Vibranium!!",
        "The fact Mendeleiev didn't see Obamium coming... Says a lot",
        "Good IQ question: [2, 8, 20, 28, 50, 82, 126] - what's next? The best approximation people have got is the n > 3 part of A162626 sequence, saying \"184\". However, this sequence part, when n > 3: n*(n**2+5)/3, only coincides with [28, 50, 82, 126], but not with [2, 8, 20]. It would be fun to find a mathematical sequence that coincides with [2, 8, 20, 28, 50, 82, 126] without resorting to a separate formula for each part.",
        "fascinating, once again scale factors prove to be  worthy of study.",
        "2030: Ok guys we’ve discovered vibranium",
        "I really enjoyed this episode and the talk about elements! Please do more deep dives on these topics! It's refreshing!",
        "Seems like The Dark Forest solution is inescapable.",
        "I was excited to see a chemistry episode, these aren't as common on this channel as the big spacey cosmology ones (which are also fantastic).",
        "I was trying to explain this to my family who didn't believe me when I told them there most likely isn't anything undiscovered super element  because of what we have already discovered.  Not being a scientist I was unable to express this properly, now I can just show them this video.",
        "Netherite got me",
        "Yes, but they exist in nutron stars or other extreme conditions that exist temporarily as mater is compressed prior to entering the event horizon of a black hole.",
        "I need that shirt",
        "Bro, I'm here trying to find out if there is an element that has the same properties as Vibranium.",
        "What is the last element?!",
        "I’m thinking it might be something more along the lines of what we may see in comics or movies, after all, isn’t that what those early scientists would’ve classified the technology we use to make the synthetic elements now? We may not understand it, yet, but that doesn’t mean we can’t accomplish it. Plus that graph you showed us, how dated is it because I think mankind can and will always surprise itself with what is and isn’t possible.",
        "Can an element really be \"undiscovered\" if it doesn't occur naturally and hasn't yet been invented in a lab?",
        "Yes, my periodic table had empty boxes. Thus meaning it’s missing some stuff.",
        "from what we know of the island of stability where pretty sure it's still not going to be fully stable, just far more stable and thus far more easy to get high amounts of and keep them for testing, compared to the things before it which can last less than a second before decaying.",
        "Yes there are a whole lot of other elements this table is not complete when we get into distilling the atmosphere will find new element I fancy myself a genius can't spell but I'm really smart ...and when I sae the periodic table for the first time hen I was about ten I thought where is the rest of them this is what got me into chemistry .. so what it is that these elements are so rare in earth thst they just done appear accept in very minute amounts and these elements on earth are probably exceptionally rare other places this should be assighned by planet not just exist period because in and if its self the periodic table is incomplete as you can always see any element change when affected by another chemical reaction so it's kinda like cool aid right nothing works alone but when you combine then it works and that what thty ll find that elements on other planets are different than this table and those will have diffent reaction look st H20 and helium three that the best file look at it in paper and then run a modeling reaction with those two elements it will reasles extream energy and thst reaction ...laymen soeaking would be like gasoline that dosent require a spark",
        "Have you heard the story of the island made entirely of rare and wondrous things that exists somewhere out there beyond the farthest crumbling vestiges of the outposts of the ancient dogma and the most remote reaches of the known? It is a periodic fable.",
        "So unstable elements may have relatively stable isotopes.. well there is your plot armour elements for science fiction.  If it takes 5000 years for one isotope, and it has interesting properties.. that could make an interesting exotic material for a sci-fi ship whos productive live in the story may only be 50 to 100 years.",
        "The sheer fact that we don't fully know yet what is required to make an atom stable means that there are most likely big surprises ahead of us.",
        "\"These are the only elements of which the news has come to Harvard, there may be many more but they haven''t been discovard\" \n\nSung to the tune of the Major-Generals patter song",
        "Here's me thinking Mithril was just magical aluminum",
        "How about upsidusium?  As seen in Rocky and Bullwinkle ",
        "People already call me an Old One, so we don't need to wait for a subsequent re-emergence of civilization for that.  My back hurts.  I dunno how much this tells us about future civilizations, except that no time travelers have come back to fix my back.",
        "Tek-NEE-shee-um. It's tek-NEE-shee-um.  It is used every day all around the world in nuclear medicine diagnostic tests, as mentioned. Except that first diagnostic scan shown is an MRI, and technetium is not used in MR imaging (that would be gadolinium.) Then we see a CT scanner and a stack of CT images - but CT doesn't use technetium either (it's iodine.)  :)",
        "This was the reunion stream we needed",
        "I like how the stone age and the silicon age are basically the same elements.\nIt's fitting to be moving forward and backward at the same time, given the human behaviour we see on the internet.",
        "Brilliant episode, I've always wondered this and how it all works",
        "Regarding the \"Dark Forest\" solution to the Fermi Paradox that you mentioned at the end: That is one of the most easily dismissed hypotheses in the set, because the universe is NOT a dark forest. First of all, it's always daytime in space; secondly, there's so little tactical cover in space that we have direct line-of-sight to locations literally billions of light-years distant. The universe has more in common with a savannah at noon after a brush fire. Nothing can hide in space.",
        "Yes, there is the element of \"surprise.\"",
        "I've always found stuff like this very very interesting although i'm not remotely smart enough to understand anything in this video :D.",
        "If SETI receives an unambiguous extra-stallar message from aliens and is able to decode the message, and the message would include something resembling the periodic table we use, but in language/symbols, systematics, order and extension those aliens use and are unfamiliar to us. Would we still be able to determine this is the periodic table and could it be used as a rosetta's stone to decypher the rest of the decoded message?",
        "I HAVE THAT SHIRT!!!!!!! awesome choice!!!!!!",
        "@17:02 Its similar logic to the recent Powerball lottery. We had the same discussion in our breakroom over the chances of winning. He contended that my chances were basically zero. I agreed wholeheartedly, I conceded that even selecting multiple numbers as I did would make a mathematically insignificant increase to my chances. I said to him, but then someone eventually always wins the jackpot. What do you say to their zero chance? Or the zero chances of all the previous winners? Are we cosmic lotto winners? The outlier to the group of losers who won't get out of bed for possibly a few more billion years?",
        "It is pronounced Medele-yev.",
        "What about Draconium and Naquadah?",
        "Rune armour is best, with a green party hat. ",
        "I was just thinking about this today, Google's getting kinda scary with its recommendations",
        "Netherite could exist... My theory is A. Debris is a very compressed rock deep down in the mantle. It could be a super hardened gem, rock or ingot. It could also require heavy mining and heating or shaping to get Netherite. Since Au (gold) is needed for a netherite ingot, it may get a bit stronger in its ingot form. You can change my mind in the replies.",
        "Big idea here\nWe're speaking of stuff like protons and neutrons but what if there was stuff beyond that?\nWe could get entirely new periodic tables if we just change the very matter we're using itself",
        "Such a fantastic insight! Ill have to read up on the island of stability, it's a fascinating insight",
        "Casey Affleck is now hosting science channel? Nice. ",
        "It's worth considering that some of the elements we call \"radioactive\" due in large part to where they are on the Periodic Table, ie. how heavy, are essentially extremely stable, almost not radioactive -- U-238 having a half-life of 4 and a half billion years. Since our models aren't going to predict before we create any new elements among the Island of Stability, there very well could be an isotope or two (or more) that are perfectly stable, even moreso than a U-238 etc. And who knows what secrets that could unlock...",
        "The number of topics this channel can cover is the best part of it",
        "It doesn't have to be a new element.  It's more about finding new and better compounds",
        "I'm hoping that island is there.",
        "Plenty were discovered in the seventies, they just didnt get realized til later. SHIVA project in New Mexico, short lived but extended elemental awareness without actually being capable of understanding the full bonds at the time. The bonds are why we have Cern now, and the continued theme name with it, explained away with nonsense to cover up its existence in the past. The full list of elements discovered were slowly finalized and forwarded into the \"known elements\" over time, but they were named and found, in the seventies.",
        "Excellent choice of shirt for this episode!",
        "Yes there are. Just haven’t discovered or built them yet.",
        "Would it be possible to create building blocks that aren't atoms, but could be used like atoms to create large structures? If so, would this new type of matter be stronger than anything we could make using atoms?",
        "Look if we evolve to the point of 'god-hood' that could be a bad thing. I know what DnD character I would be, and that is both not good, but isn't bad either. It is all perspective.",
        "Element 115 (one fifteen)!",
        "And don't forget \"upsidaisium\".  Boris and Natasha are still trying to steal it from Rocky and Bullwinkle!",
        "Are there possible ways to artificially stabilise unstable elements by, for example, putting them in some appropriate environment?",
        "Islands of stability...   Have they tried putting a message in a magnetic containment bottle, and ...",
        "I can’t even learn all the visible atoms god damn",
        "We would be foolish to think there are no more elements.",
        "Well done!   Thank you.",
        "What was the math Rutherford used to predict the neutron?",
        "We need to find new elements so that we can finally build a stargate.",
        "Moscovium is a fuel source to power UAP, allegedly.",
        "So much focus on the nucleus and nucleons, but creating anything beyond 118 will require a further electron shell, which will be prohibitively difficult - at best - to maintain and whose electron properties will challenge the boundaries of known physics. Not saying it can't happen, but the nucleus might not be the problem",
        "This came right as I was learning this in Chemistry class, amazing",
        "Where can I buy that t-shirt?",
        "Period Ah and Period Ugh were discovered in 2022",
        "Are there any candidates for a natural process which is powerful enough to produces and reach this island of stability for example: the super heated accretion disk of a black hole. and if so why haven't any telescope or observatories detected them.",
        "Since the 90s they added like 8 elements",
        "His merch is so cool",
        "Element 115 is what makes FTL travel possible.",
        "A legend never truly die, because as long as his videos are still around, we have something to keep him alive.",
        "Expect to find the element of surprise.",
        "I think there's a spot for emergent life that's not killed by more evolved ones, because it's somewhat toxic but the very evolved ones find it interesting and help it.\nLike an arsenic based lifeform which would not compete with carbon based life, and is risky to touch. It could have an immense advantage in some niche otherwise mostly uninhabitable environment, like a sulphur based lifeform living in sulphur vents.",
        "Interesting final philosophical speech, Doctor. ",
        "I've always been intrigued by the idea of unknown elements possibly being out there",
        "Tc has 43 protons, so I guess you meant that items with more than 83 nucleons which is the sum of protons and neutrons in the atomic nuclei.",
        "Can someone explain me what happens if you take a short-lived elements like oganesson and add isotopes to it, could it get a longer half-life?\n\nJesus, first time in my life I feel too ignorant or straight up, too dumb to understand something, I'm 25 as of now. Wow.",
        "but have you thought about 4 dimensional bonds. we only think 3 dimensional but technically nothing stops them from doing bonds in other directions.",
        "Oh, I always thought dilithium was a molecule. Maybe composed of two lithium atoms, hence the name di-lithium. ",
        "I'm so ashamed of myself because I immediately thought \"sussium\"",
        "I'd much rather have an element than a star named after me, as stars are, you know, so COMMON.",
        "Theres a element named krypton (yes i just completed my chemistry exam)",
        "I'm kinda skeptical about this island of stability – there's been a lot of hype, but few results which is worrisome.  Nuclear geometry is important too – not just the numbers of protons and neutrons, but also how they are arranged.  Finally, Lambda particles (uds) may help stabilize super-heavy elements.",
        "There are probably quite a lot of elements we have yet to discover in this universe, we have seen a whole lot of new ones just in the last few years",
        "Just 1 correction : Adamantium is an alloy (and it is not even clear what it contains). Vibranium and Antivibranium are chemical elements. \nAnyway, awesome video!",
        "Did he say bolognaium? Cool!!",
        "I wouldn’t think netherite  it’s an element it’s more of a alloy",
        "What if a black hole is actually one giant singular atom made of an element that is only stable with a massive amount of neutrons and kept stable over the black holes lifetime via hawking radiation",
        "of course there are more elements.\nLots More!",
        "Thank you for showing me that neutrons are more than chargeless particles.",
        "Many more elements still to be discovered.",
        "Makes element from island of stability \nnew universe explodes in our faces",
        "The periodic table was a lot easier to remember when it was just Earth, wind, fire and water",
        "I appreciate that every so often Harry goes down these insanely deep and specific rabbit holes and then passes the savings on to us.",
        "I teared up like, three or four times during this episode. This games narrative does an effective job of holding your heart hostage through the whole thing.",
        "So... Is it possible for a stable isotope of element 115 to also exist? And, if yes, is it gonna be possible to be discovered soon by us?",
        "Wonderful to get an episode on nuclear chemistry and stability! Another item on the long list of physics-y things I want to learn more about.",
        "I think I read somewhere that the island of stability is a moving frontier. A few years back, it was expected that elements above 115 or 116 would be found to be a bit more stable than the ones before, as they would be the \"shore\" of the island. Now that we are up to 118 with each new element being less and less stable, the island is predicted to be further away...",
        "I remember sitting in the chemistry classroom, looking at the sun-bleached periodic table above the blackboard. It \"ended\" probably around Seaborgium, having the \"Unununium\" names. I remember reading about the Island of Stability some time later, and that made me... believe, I guess, that those new sorta-stable elements are going to be the most amazing thing ever.",
        "Orichalcum and element zero are real. Element zero is a neutron and orichalcum is a complex of gold and copper",
        "I've pondered this possibility AGES ago.\nAll it took for me was to look at the entirety of the periodic table and start thinking of it as a PIECE of a GIGANTIC JIGSAW PUZZLE.",
        "LOL @ Logo of the game Half Life used vs usage of T½ to designate half-life.",
        "The periodic table is designed incorrectly.  There are as many metals as there are frequencies in the electromagnetic spectrum.",
        "Cool Fact: Netherite is likely to be Platinum, due to the matching properties. This also means that we can call Platinum-Gold Alloy can be called Netherite if you like.",
        "16:37 about the \"grabby aliens\" idea... Maybe it does not matter if we humans are \"early\" or not. Perhaps the leaps necessary to find other advanced life are so dangerous on different levels that life generally dies out before that point in its evolution. Or the surviving life that reach a point of detecting or meeting other life forms either no longer interact with species below their evolution or start exploring other things we can not presently, like multidementional space-time or building their own \"universe\". Kinda as if aliens\" are out there colonizing at such vast distance in time and space that we can not detect. Or they do not care about life like us and have moved on to things we do not yet know or understand. These are things also we have explored in science fiction stories over the years. Arthur C Clarke and Gene Roddenberry helped inspire my fascination in this area.",
        "Do a video on Lyman break galaxies.",
        "Are multiple islands of stability theorized or it's just one?",
        "I sreched for this topic for years now it's came to my recommendation",
        "He forgot that cool, funky, and jive turkey repellant element:. DOLAMITE!!!",
        "The element combinations are also important and may lead to the real chemistry that moves us to the future",
        "Schlatt, this video changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This video represents emotions that most humans could never understand. But I can.  I have been able to unlock my true potential due to this stream and I owe my life life to you. I feel and see things no other being can sense. I am feeling things unimaginable to the human brain. Thanks to this video I was awakened to many things previously considered unimaginable and my brain can comprehend things that others cannot. Thank you for this exquisite video, I will never forget this experience.",
        "It would be nice if he actually mentioned which elements may be synthesized soon even though they’re unstable (radioactive)",
        "We are always and will continue to discover and invent................History and science.........as I grow... I hear, \" Oh and we had IT wrong\"!!..It never ends..NEVER..",
        "3:17 They're all silvery-grey! Except for a couple of outliers.",
        "I wonder if we will discover new elements when fusion reactors become mainstream and someone experiments with it since the internal temperature will be few times higher than the sun's core even though at much less pressure",
        "And what about Naqadah/Naqadria, Trinium i Neutronium :P",
        "What if Mithril isn't a pure element? like steel. Maybe there are some awesome materials that are made from a unique processing of already discovered elements.",
        "Bro when I was in high school, in the '60s that chart had a lot of empty spaces. AND the atomic particles were the proton, neutron & electron.",
        "The combination of elements in  minerals provides unknown properties. And there are also isotopes of known elements. So there There's a lot of room for surprise.  Unobtainium is more likely to be a new mineral than a new element.",
        "Why not list Vibramium?!?",
        "When I started high school, the Periodic Table in the Chemistry textbook had only two... no, sorry, three elements after the Actinides, and they were called Kurchatovium ad Hahnium. Now Rutherfordium and Dubnium. Now you know how old I am.",
        "If one subscribes to non-inverse-square gravity as the primary explanation of the dark matter effect, then does the strong force also alter itself based on geometry?",
        "I guess it depends on how short do you want it's halflife to be",
        "It need to be harmonically balanced so that it does not have a wobble",
        "Good video, but it’s incorrect to say one isotope of Technetium decays in 4.2 million years while the other decays in under an hour. Half-life refers to the amount of time any given mass of an element will be half-decayed, not how long it takes for a single atom of that element to decay. I expect better",
        "Everything was fantastic right to the very end! Just make sure to include all aspects of origin not just the imagination of evolution or life coming into existence on its own! That is not science",
        "Could we detect every life form if they were shouting in our faces? Determining when life began requires a definition of life, and ours is likely to be insufficient.",
        "I have been fascinated with the Island of Stability for a long time, it is pleasant to see someone else go down the rabbit hole.",
        "I think there's a element between hydrogen and helium.",
        "My logical mind tells me I need to sleep for work, but my procrastinating self wants to know if there are more elements. As if that's something that will be relevant for me to know.",
        "I have that same Minecraft shirt.   Love it.",
        "3:36 i thought that elements heavier than Iron cannot be fused in the cores of stars but are rather produced  in more violent events like supernovae or neutron star collisions via neutron transmutation",
        "The limit is probably a proton+neutron star. The star itself can be a one single atom. If blackhole singularities are considered, then they’re the heaviest. They don’t not have their own protons for us to observe but the singularity contains lots of it",
        "I didn’t know we were in the Silicon Age",
        "Is it weird that the continued lack of an explanation for technetium’s instability makes me irrationally angry?",
        "Yes, clearly we can't have every single element.",
        "i love watching his hands while he speaks. idk is that weird",
        "Have you ever read the book \"Atomgewicht 500\" by Hans Dominik? If you haven't, you should.",
        "You should be a chemistry teacher.  Great vid.",
        "Shout out for Half-Life reference ! ",
        "How do we know that the elements that are stable, are actually completely stable, and don't just have decay periods of cosmically long periods of time?",
        "Isn't it possible that most much heavier elements may only be possible with a particular nuclear configuration that simply doesn't occur in the randomness of high energy natural fusion or  anything we have yet cooked up? Kind of like nanotechnology is to chemistry. If so it may be possible that they are out there, just extremely rare, or even result only from specific astronomical phenomenon and so just don't exist at all around this part of the universe.",
        "0:20 and he forgets Vibranium ",
        "Big props to Jack for realizing Tyr called Atreus Loki. Its so easy to miss since we hear him called that so often",
        "Genuine question - if there is an island of stability, why haven’t we found any of those elements yet?\n\nMy understanding was that the reason why not all elements are found in nature is due to their short half life, but if there is an island of stability, then there would need to be another reason why we haven’t found those yet. Not sure if anyone knows but I was just curious.",
        "Adamantium isn't an element. It's a special steel alloy made by the government in Marvel.",
        "I would strongly recommend \"The man who tried to fake an element\" video by BobbyBroccoli. It goes into a lot of detail about history of new element synthesis and basic physics.",
        "Something the video didn't focus on is the combination of metals to create alloys. Perhaps there are alloys out there that don't exist on earth that are stronger than anything we've made so far. Alloys that somehow miraculously formed under a 1 in septillion to the million chances of happening circumstance. I'm sure there are billions of chemical combinations we haven't tried yet. We've got over 100 elements to work with, and percentages can be almost infinitely scaled. For instance, we mix gold and silver together to get a stronger ring for wedding bands, and the ratio of gold to silver is somewhat standard, but what if we tried adding 50 other metals in there with various ratios? The combinations are only limited by the amount of gold and silver laying around and the other metals too. Perhaps an alloy could be stronger or weaker if we added just 0.0000001% more of it into the mix but only that amount specifically or else it becomes unstable or not usable or cracks to easily.",
        "\"That's why neutrons are so useful, they help separate protons so that the strong nuclear force stays stronger than electromagnetism.\"\n\nThat's really interesting, never thought of it that way",
        "Can nuclear fission and fusion work as a single pendulum like energy generator? Say, starting with Deuterium with lowest atomic number limit and apply so much fusion energy that the nuclear build swings right through Lead and Iron until an upper atomic weight limit into say Polonium until it nuclear decays. ",
        "Absolutely love that you spend so much time going thru comments.",
        "Of course there are; in an infinite universe how could there not be?",
        "Just to speculate, it would be enormously beneficial to find an element that would help cost effectively catalyze the CO2 molecule into its constituent elements.",
        "Perhaps an atom of hope?",
        "Sooo what is preventing us from Smelting 2 or so super radioactive elements together like folding a sword, and forcing the ingot of that into a reaction?",
        "Graph looks like it wants to be logarithmic. This suggests stable elements are off to the right with more neutrons than protons. This is backed further by the discrepancy between the magical numbers(126/114 & 184/126).",
        "in the periodic table at 5:27 bismouth is higlighted, doesn’t it have a huge like insanely long half life",
        "I like how you put a video game lore & movie lore.",
        "I pray someone would call one of those super heavy stable elements Naquadah.",
        "Why couldn't they teach us physics like this in school?",
        "I like to think of the periodic table as an outgoing spiral, not a table.",
        "If I recall correctly, Unobtainium isn't an element, it's a particular mineral mixture - rare earth minerals, which is ridiculously expensive due to its value in industry.",
        "Isn't \"dark matter' just an undiscovered element (or elements)?",
        "Yes! An episode on the dark forest hypothesis whichis a similar but different take on the berserker hypothesis. Too late Matt you spilled the beans.",
        "so mabye its safe to say some of the new ways of us generating power will help us find thoes elements in the island of stability. Mabye a few of them probubaly be found in stars comming from our fision reactors once we have them going really well.",
        "Unobtainium. I got a kick out of that one. \nListen to Phil Schneider and Robert Lazar on the topic.\nThey'll tell you straight away our periodic table is incomplete.",
        "Mythril is deffinitely an alloy",
        "Thank you for sharing",
        "Are there elements that contain stuff in their nuclei other than nucleons? What particles other than protons and neutrons could theoretically be part of a nucleus?\n\n…..perhaps even a stable nucleus?",
        "This is a great pairing with the BobbyBroccoli episode from a few weeks ago.",
        "Bro, how could you not mention Vibranium at the beginning?",
        "Thank you so much!",
        "Can somebody please tell me where or what that short clip at 14:55 is from? I keep seeing it in many science videos for years now.",
        "Whatever new element it is, it is bound to be a dull grey metal...",
        "Di-lithium exists",
        "element + element = new element",
        "JP - Pristium after Judas Priest - hard metal!!!!!!",
        "This concept of undiscovered elements is pretty awesome and a core part of a story I've been working on for a long time!",
        "Element 115 (Moscovium 299) is the island of stability.",
        "Great video! I'm mostly fascinated by possible resolutions of the Fermi Paradox. My favorite one is that we're still not spiritually evolved enough for more intelligent extraterrestrial civilizations to make contact with us. First we need to learn to get along with one another and fix our own planet!",
        "I love that out of all things Netherite was included.",
        "this channel is awesome",
        "Part of me can't help that wonder if such a super heavy element would be so heavy that it would be poisonous on an atomic level?",
        "I would have loved to hear some more about limitations in this context, like relativistic stuff and the structure of period 8.",
        "What will be the cost per kg ?",
        "We are currently in the Graphene age. This is too important to be missed out.",
        "12:32 But bismuth and uranium occur naturally.",
        "Me, someone who's still in highschool chemistry, trying to understand all of this:",
        "Wouldn't di-lithium just be... Two lithium atoms? Di means two",
        "Matt thank you for addressing Tc head-on, and for pronouncing it on the video for us. Technetium has bothered me since high school chemistry.  still not any clear, easy-to-understand answers for the lack of stable isotopes, but, at least there are some unclear ones and a really good computer model.",
        "Is it true that in different solar systems, different atoms are considered \"stable\"?\nFor example, a solar system with unique gravity and ion combination that allows technetium to be stable, but in order to get molybdenum, you have to refine technetium?",
        "The way Charlie's character runs while he says \"Wait, I can't flyyy!\" is peak comedy.",
        "Why is it called the 'Periodic' table?\nAlso, why is Hydrogen at the top and all the others valued according to how much Hydrogen they have?",
        "Unstable, on earth’s unique conditions… in all other areas of space and universe, these isotopes might be more common than our version of “stable” elements",
        "Can we all agree that Tony Stark definitely didn't make a new element in his home made particle accelerator though?",
        "Sometimes I feel like the entire universe is just made up of electromagnet energy waves.",
        "One of them NEEDS to be named surprise, with an atomic symbol of Ah!",
        "In comment to, \"What if the big guy always eats the little guy so that's why there's no aliens\" I would argue that our purpose as a highly evolved creature which has pulled itself out of the cycle of nature is not to perpetuate that cycle by eating the little guy, but instead the star trek solution of \"We are strong, therefore we have the freedom to protect those weaker than us\" rather than, \"We are strong, therefore we have the freedom to rid ourselves of parasites.\"",
        "What if there are other elements made of dark matter.",
        "5:55 Shouldn't elements 121 through 135 be under the actinides, with elements 136 through 150 continuing below rutherfordium through oganesson?",
        "I think that it is possible that an entire undiscovered periodic table could exist.",
        "Shells are the things snails have; atoms have orbitals",
        "All the elements we can’t find are living in another realm it is like it separates us from that different realm",
        "More episodes on strange matter and exotic matter.. perhaps even on neutron stars and their cores… maybe we could get an extra episode on black holes ? I love this channel and it was what inspired me to pursue my degree",
        "If you're watching this you want to get rid of shingles, aka zoster, as soon as possible. That means not wasting your tie and waiting for months. Although there's not a silver bullet, there are very particular and forgotten home remedies that can help you within about 3-9 days. Maybe go'ogle Kaena Ramingler's approach to see how it all sounds to you.",
        "Did you name thorium as a fictitious element? Isn't that real?... Never mind, you said mithril that's what I thought was thorium for some reason",
        "No matter what's going on, Spacetime always raises my spirits. It's a showcase of the best humans making the species better.",
        "I came here because of the video title but I got bombarded with a heck ton of history lessons",
        "Iono's fight is even better (worse) in Spanish, she says expressions like \"Trolling\" and doesn't stop quoting memes and comments from the Spanish YouTube/streaming community. Dead serious about this.",
        "I remember Neil deGrasse Tyson poetically describing why hypothetical elements are not as cool as the ones we have, he said something like \"...think about water, hydrogen is a gas that is flammable, oxygen is a gas that feeds fire, but when the two combine they create liquid water, a non-gas, and the primary thing we use to stop a fire.\"  118 known elements, 28 synthetic and  90 naturally found on Earth.  Granted not all can combine perfectly, but starting with number of objects n = 118 and sample size r = 1,2,3,4,5....the possible combinations with properties we don't know yet increases dramatically...r=1 (118), r=2 (7021), r=3 (280,840), r=4 (8,495,410), r=5 (278,288,004).  Just saying, that new elements might be a little out of our reach at the moment, so maybe we should focus on what's in front of us now?",
        "What school / course would I need to attend to partake in bleeding-edge physics? My mind craves for answers, and access to the high-energy scientific facilities will help curb the itch",
        "considering we added a new element just a few years back (oganesson, 1999) i cant think of any reason we couldnt discover more. maybe not on earth but if something from far space landed here on an asteroid or something it could be anything.",
        "What's theoretically the strongest possible material? Other than like neutronuim ig. Strongest atomic material, as in still made of atoms.",
        "Dilithium is just Li2 the rare crystalline form of non ionized Iithium.",
        "his t-shirt tho :)",
        "you explain very well, thank you",
        "Thanks, and the presenter's name should be prominent. He's a gem.  Also: every atom in the universe, above H has Helium in its core. Similarly, every atom above Fluorine has Neon and Helium in its core, and so on . . . .",
        "This is the first episode in a long time I could listen to while on a run and understand absolutely every word.",
        "that description of how to get larger elements reminded me of overclocking late pentiums.",
        "True story: Way back in 1951/52  I spent 1st and 2nd grade in a one-room schoolhouse in rural Pennsylvania, near Shanksville  where Flight 93 went down during 9/11.  About 30 kids in 8 grades, one teacher, no running water and outhouses in the back.  We kids used to fill a bucket of water from a hand pump and dump it into a big crock at the back of the class.  ",
        "Would you be able to do a video on the Continent of Stability hypothesis & up-down quark matter?",
        "Great program - wonder if the presenter is of Italian descent like myself - can't talk without using his hands!  ;-)",
        "Couple of thoughts here... How do we know that stable elements are indeed stable and not have just incredibly long half-life. Computing what is going on in nucleus is indeed difficult but shouldn't we still be able to derive chemical properties of the hypothetical elements? If determining the stability is so difficult, is anyone trying to use  AI on it (kinda like protein folding was solved)? But I guess so few elements are really tnot great for AI learning.",
        "what about elements 0.1 to 0.9??",
        "Orichalcum? That one's real; we're pretty sure it was brass (bronze made with zinc ore).",
        "13:30 So u-310 will be adamantium, got it. Need to remember that for potential scifi writing.",
        "13:01 Nice. God is playing with us.",
        "How could he forget to mention Vibranium in the beginning?",
        "I couldn't help but chuckle when I heard the names Sugden and Sugdenium",
        "I was reading about what might be the largest possible element and saw something saying it might be 137, and thanks to a recent video from here I recognized that number!",
        "Try Dilithium - used in Federation Warp Engines although it may be a compound since it is a crystal",
        "Is the layout of the periodic table of the elements arbitrary?",
        "Can half-lifes of isotopes be calculated without direct measurement? If they require some direct measurement, do we know that \"stable\" elements will never decay vs having half-lives orders and orders bigger than the age of the universe?",
        "I would strongly recommend \"The man who tried to fake an element\" video by BobbyBroccoli. It goes into a lot of detail about history of new element synthesis and basic phys",
        "I'm more hyped for the \"elements\" created not even out of the usual particles, but novel ones, like Muonium.",
        "There's probably some crazy elements in the heart of black holes",
        "16:27 it glows violet? Violet isn’t in the spectrum  it’s blue and red with extra blue",
        "I could see a very dense (but perhaps mildly radioactive), being useful in the manufacturing space, similar to how we use thoriated tungsten in the welding space, and naturally, if such elements were very hard as such, this could be useful for the machining of similarly hard materials that would otherwise be unmachinable in current conventional methods.",
        "Aren't they called neuron stars?",
        "this video was 100% inspired by Bobby Broccoli's latest video hehe",
        "bro be rocking the minecraft periodic table shirt",
        "I left school in '91 and always remember my Chemistry teacher saying that there are gaps in the table and these elements will be found, or more likely created in the next 20 years",
        "The shirt for this episode is spot on!",
        "I’m now imagining elements with tens of thousands of protons, and how useful they might be lol",
        "Great video.",
        "Wait a minute.. at 9:25 those particles are spinning in the same direction.",
        "Love the mention of Element Zero - Eezo!\nI'm replaying the Mass Effect trilogy literally right now.",
        "Veritasium! The element of truth.",
        "This was good, I am half way through and I am going to have to watch it again a few more times to understand that much.",
        "Nice to see subshells in this!",
        "At the moment of the big bang just as the universe was all one point, all the material and the protons would have been in one place for a moment could that have made the universe one element at a single moment in time? Move time a bit further and then there would be other elements of very high proton counts?",
        "In the words of Marty McFly, \"Wow! This is heavy, doc.\"",
        "Yeah, you totally got me onboard when you mentioned how our ages are defined by what we can master. It'd be cool to get some stuff like vibranium or whatever.",
        "Actually, \"dilithium\" isn't a fictional element.  It's a fictional isotope of an actual element, lithium.",
        "Nice presentation. Like add a point regarding contrast agents in medical imaging at 14:30. CT brain images were shown. Technetium is not used for computerized Tomography (CT) or MRI. CT uses injected non-ionic iodine (not radioactive) where MRI uses Gadolinium.\nTechnetium 99m is used in Nuclear Medicine not as contrast agents but to actively visualize the organ or tissue it been tagged to. Different biologically- active substances are combined to TC99m to image the skeleton, liver, kidney or even detect infection. TC99M emits gamma rays and low energy electrons. After injection and appropriate time interval, a gamma camera using sodium iodide crystals images the body part. It has a 6 hour half-life.",
        "Adamantium isn't an element but an alloy, Vibranium would've been more fitting. Ever notice how most of the well known fictional elements are metals?",
        "one of these days we need to name a new element vibranium",
        "Couldn't you infiltrate an alien species and gain an understanding of them to try and terminate the chain of suspicion earlier than later? At least that seems like a novel solution to the dark forest, hit them with a nerf dart from somewhere they can't find you and observe how they react, or some other better metaphor.",
        "Vibranium Half Life matters!  ",
        "Thulium is just the best element. It has the nicest atomic number.",
        "It regularly amazes me that we, as humans, know anything about stuff on this scale let alone these details (which, despite the great detail in this video only scratch the surface).  The dedication of really intelligent people coming up with theoretical models, designing tests, and then building on that is so incredible.  When we want to be we are an amazing species that explore the world around us, the world unseen, and the universe at an unimaginable scale. Thanks for providing a path to explore this world!",
        "We should be looking at new types of structures and isotopes and materials technology of existing elements, before we start dreaming of new ones.",
        "Of course elements exist that aren’t on the periodic table. We keep finding new ones like Tennessine in 2010",
        "M. Sc. of chemistry here: Yes there are but the relative values of the strong nuclear force and electromagnetism inhibits their stability drastically. ",
        "Amazing !",
        "would be fun if it cycles back... the higher elements for some reason being stable again. So say, element 300 could be in the palm of our hands.",
        "Any chance of finding out where you got that tshirt? I know a couple kids that would go nuts for it!",
        "Your Standard Model has a major flaw.  You say \"helicity is frame dependent\". You have a Lorenz boost to change one helically point to the opposite handed helically point. Did you know, no you don't, that a helix turns inside out to its opposite handed helix. You can fashion a conical helix out of flex wire. Set it on a table and flatten it into a spiral.  Then push it the other way into an opposite handed helix. This fact is not in any math dictionary  yet. I think if someone made lefthanded corkscrews as a novelty they would sell and be educational.",
        "Why do forces even exist ?   EM / Strong -  what is behind all these forces  and dimensions ?    The Universe seems to be using cheat codes !",
        "Love the Halflife logo! ....The cake is a lie",
        "Are we early? Maybe in this region of the galaxy. In the universe? I doubt it.",
        "Another excellent video, but you forgot Eternium and Nth metal from DC comics lol featured in the latest Black Adam movie. Anyways subscribed by a fellow aussie. Keep up the good work mate!",
        "Every time the intro beat drops I know a great explanation about stuff is headed my way. ",
        "There is one logical problem with the island of stability, if there are super heavy stable elements, then we should be able to detect them out there in the universe using things like spectroscopy. There are so many high pressure high energy events that happen out there in the universe that it's likely that the conditions for elements far far beyond our periodic table have happened, it's just that they are unstable and decay. Best place to look for them would be in fresh supernova or star mergers.",
        "Event horizon has all the larger stables bc the gravitational pull would alter the EM forces",
        "I always thought any new element would have to be something really waky like something from another dimension that can't normally function in our realm with out technological help.\n\nThanks for the video. It is interesting to think that there are even higher elements we have never seen in the table. Perhaps one is useable for massive energy production.",
        "I would be very surprised if element 122 were to appear in the same column as Rutherfordium. If it is ever found, I would expect it to be below Thorium, in another series corresponding to the lanthanides and actinides (unless yet another widening of the table occurs, possibly after element 120). By the way, has a final decision been made about whether lanthanum or lutetium should be below yttrium?",
        "to be short it depends what the universe needs at any given time",
        "That part on the end was my favourite! How delightful to hear of all of these paradoxes in such an interested way  :)",
        "Not sure it's been mentioned yet... but Technetium 99m (Tc99m) is used in medical imagining in Nuclear Medicine. It has a half-life of 6 hours and is combined with different products to image various organs. Pretty cool, and that's what I do! Serious! He mentions it later in vid, but the scans shown are CT or MRI scans not NM scans.",
        "The answer is yes. Because science is always lacking absolute truth. As long as you KNOW something, you know nothing. All \"credible\" information is authoritative in nature. All \"evidence\" is perceived and asserted, but in no way proves or disproves any theory. There will never be more elements until there are. And those who assert them in the most credible form, given their perceived authority in the scientific community, will add them to the table. That IS the human thought process.",
        "Bigfatonium",
        "Take everything documented 50% accurate , 3 times more going in then on document, I left their learning curve fast",
        "it would be interesting to see if some of the unstable high-end elements could mix into a stable alloy...",
        "14:46 \"By using an isotope of a half-life of only 6 hours, we can greatly reduce the amount of radiation that the patient is exposed to while also being able to get useful images.\" -- Matt. Just no. Shame on you. I assume you understand, but what you actually said here is dangerously wrong. I think most people will interpret that \"only 6 hours\" as emphasizing the shortness of its half-life. Most people will interpret that as meaning that a shorter half-life material would be even better. That's just wrong. It's completely wrong. This is the second video from PBS SpaceTime that I've noticed the same fundamental errors concerning nuclear power plant safety. Please, if you're going to talk about it, please try to be correct with what you say, researching it as necessary.",
        "I am curious as to why gravity is considered the weakest of the forces. If the strong nuclear force has trouble holding a nucleus together when they get too big then why is that considered a stronger force than gravity when gravity has the ability to  effect 2 or more bodies of enormous masses, ie sun and earth, at distances of many millions of miles or even greater, billions, when we look at pluto and the sun? This becomes even more odd when you consider galaxies with hundreds of billions of stars and their associated planets and moons etc. May be a stupid question but...",
        "That's so cool, I have that exact shirt.",
        "What happens if one end of a wormhole passes the event horizon of a black hole large enough for the opening not to be destroyed by tidal forces?",
        "If you enjoy this kind of content CONSIDER Subscribing! <3",
        "At 3:15 the subtitles don't match the dialogue. Rhenium or ruthenium?",
        "This video screams \"How Do You Do, Fellow Kids?\"",
        "I see the broccoli boy mountain graph, and I respect the usage cause it’s a good graph and",
        "Well, that \"114\" island of stability already disappointed. So I doubt we'll ever find more stable elements.\nAlso, theages being named by materials alsways happened, because men found a way to make use of them, not that they were discovered then.",
        "Not being all whiney but netherite is actually an alloy as you combine the ancient debris (the possible element) and gold to make netherite.",
        "There's theoretically an unlimited number of elements that could exist.",
        "I suspect that part of why Tc is unstable is a direct result of the stability of it’s neighbors.  It’s isn’t just a matter of ‘how stable am I’ but also ‘Can I become my neighbor?’  people look at that isotope plot as isotopes rising out of a sea - it’s nice, but let’s invert that.  the stable isotopes are a valley and stones placed upon it roll downhill.  Tc is on a narrow ridge with a valley to either side - If you stand there, try not to trip.",
        "Seeing the half life logo made me smile. I will never stop thinking about that game when speaking about the half life of an element.",
        "What was the significance of the colours in the graphs (orange, yellow, blue, green, purple, etc)?",
        "As a young scientist this grasped my mind because of the gaps on the table. I believe that we on earth have only limited elements.",
        "What about pazzazium infinianite",
        "Could we do quantum physics experiments in the event horizon of a black hole and see the decay in slow motion?",
        "Omg.. really? You really are being serious.. Okay. But any isotope with enough free energy can be stabilized.. mm Kay? That’s all for today. ",
        "The one element that prevents things from getting done is administratium.",
        "I saw a video a few weeks ago by BobbyBroccoli called \"The man who tried to fake an element\". its about the history of man made elements and the race to be the first to actually make them. If you want to know more about how these elements are made and the surrounding drama, its a great video.",
        "3:16 Rhenium is correct, but the subtitles render it incorrectly as Ruthenium. \nAnd several instances of 'Mendelev'.",
        "I've always thought Mithril, Orichalcum and such were alloys, akin to the relationship between Iron and Steel. That Mithril may be an alloy of lithium,, beryllium, scandium, etc.",
        "Thanks really for an excellent and informative explanation of what might be just around the corner for modern technology.  It is kind of complex and yet also realisable, but still we have to have an understanding of just how tricky it is to get new elements to be for long enough to even be aware that they exist!!\n I am still somewhat confused however about element 43 - technecium - surely if it has an isotope then why would there be none at all. Maybe I need to watch this over again but I just can't quite get my head around it. and I'm supposed to understand physics! ",
        "i've always wondered about the island of stability!! thanks matt!",
        "does the addition/subtraction of neutrons to make an isotope cause the electron structure or # of electrons to change? Or will that always be equal to the protons and have the same shell structure? Would the electron structure have anything to do with an isotopes radioactivity? Like TC97 is more stable than TC96 because the amount of neutrons pairs better with 43 electrons?",
        "How DFT is applied to nuclear simulations? As far as I know, DFT is best suited for large systems (fluids, electrons in large molecules). So, DFT simultions of a  nucleus with 300 protons+neutrons would give accurate results? Or there are another aspects which makes the DFT the best suited method? \nGreat episode!!!",
        "These elements can exist for only short periods of time or we would see their emission and absorption lines in stellar spectra.",
        "The dark forest, African and their descendants still remember that one",
        "\"The Ancient Ones\" I'll take that, sounds cooler than what I am.",
        "Finally some actual science",
        "Regarding the uses of Americium, it's not just smoke detectors. Americium is highly useful in low-output, long-lifetime radioisotope thermoelectric generators, similar to the ones used on the Voyager and New Horizons spacecraft and the Curiosity rover but with less radiation output, reducing the amount of radiation shielding needed and massively increasing the lifespan of the generator, at the expense of immediate output.",
        "Of course it is possible, there is no way to rule it out",
        "Damn I haven't watched this channel in 6 years and boy does it show. Not sure what facial features changed exactly but I guess more body fat stored in the lower parts of the face, less collagen, and this happens. Damn.",
        "How much energy would it take to produce the elements within the Island of stability? \nWould it be feasible on earth? \nCould we do it if we build factories in close proximity of the sun to harness that energy.",
        "The periodic table is great and all but since its displayed in every science class and past chemistry teachers have made students memorize it i do feel it carries quite a baggage that detracts from what makes chemistry interesting. Physics classes are \"safe\" too and so the preferential treatment they will have will lead parents to desire that more then something that could lead their children the capabillity to ignite or explode something.",
        "The strong force surrounds us, binds us nuclei together, but that's not a story the Jedi would tell you.",
        "5th grade in mid 70’s we were required to memorize the periodic table and were told “THIS is everything that everything in made of..” I asked how that was possible and couldn’t there be more we haven’t found yet. Teacher berated me for “questioning” the scientists knowledge and told the class “they are much smarter than all of you..” Always wanted to go back and find that teacher after more and more elements have been added over the years.",
        "6:30 - So what I'm hearing is these other elements could possibly exist in nature in our universe, but probably only found in very extreme environments like the matter found in a blackhole.",
        "4:52 When a neutron turns into a proton, in β- decay, the nucleus emits an electron and an antineutrino, not a neutrino",
        "Really interesting information. The video is only spoilt by the speaker shifting from centre to side to centre to side, etc which is very distracting.",
        "I am SO GLAD mick came forward. The gaming industry owes mick a big ass apology",
        "Why is the last magic number for protons 114 but 126 for neutrons? The magic numbers are the same for all lower value magic numbers...\n\nSomething is rather hinky here.",
        "The fact that you used the half life video game symbol while speaking about the half life of elements touched me to my core.",
        "Not very fun fact:The periodic table created by russian scientist D. I. Mendeleev. In russian people just call it the Mendeleev's table.",
        "Yes - Ive been waiting for this subject!",
        "Can we consider a neutron star a \"stable\" element. Where gravity takes over from the strong force to keep the atom together?",
        "PLEASE DON’T MAKE SCHOOL EVEN HARDER FOR US",
        "I simply came here to say that nothing can technically be undiscovered.. \nBecause once you know about it, it's discovered (in one form) so therefore cannot be classed as undiscovered due to knowing about it.",
        "I was wondering many times if there is an element that preceds hydrogen by imagining a half of the proton and half of the electron to construe it artificially.",
        "Absolutely brilliant, wow.  So much wisdom and insight.  Incredible.",
        "so is any element actually stable infinitely ? or are their half lives so long that we consider them stable ? kinda like how we think glass is a solid, but isn't. Which begs the question: will all elements break down after a while ? like after the death of all the stars? If so what happens then ?",
        "Late on this, but I presume the Period 8 element numberings are an error? Period 8 would presumably still have the * f-block (and maybe also a g-block?) and not be numbered straight across the compact form of the table like that.",
        "There are other ways to make electricity or smoke detectors. It's not like the world would be vastly different without those. except of course plutonium is the material of choice for nuclear weapons due to it's density and low critical mass. Delivery systems would be a lot more expensive for uranium based weapons. Either way, I don't see the use for our species if we can make 50 atoms of some exotic material in a year for billions of dollars. Also smoke detectors with radioactive elements are mostly for industrial use. What people have at home is typically a combination of temperature and light based alarms where a sensor measures the decrease in brightness of a light source as smoke passes between them.",
        "Well short answer is yes, easy one to look up would be meta molecules (lab created but still something WAY outside the periodic table)",
        "You forgot the most important element for space travel: Elerium 115.",
        "Excellent episode. I've always been fascinated with elements. In my childhood I really enjoyed my encyclopedia of elements, with histories of their discovery, naming and applications. Feeling nostalgic now:)",
        "The Periodic Table of Minecraft is a nice touch",
        "I remember watching a UFO investigator stating that aliens are capable of producing stable isotopes of every element across the table",
        "If no one has discovered an element beyond the table, how is it then that one can assume there is an undiscovered element beyond the table?",
        "I hope stable Post Trans-Uranic(PTU) elements can be found and that they are useful.",
        "The universe varies widely in its conditions. When you have nuclear fusion in the sun under that much pressure and that much energy you may have energies and conditions different enough that some of these larger less stable nucleus is under our conditions can be stable under those conditions.",
        "How about veritasium? An element of truth."
    ],
    "comments_disabled": false
}