{"video_id": "prvXCuEA1lw", "comments": ["I appreciate that every so often Harry goes down these insanely deep and specific rabbit holes and then passes the savings on to us.", "A legend never truly die, because as long as his videos are still around, we have something to keep him alive.", "Hey Matt,\n\nThank you for being the host of PBS Space Time. I've been watching for quite some time now and I feel like I get smarter every time! ", "One of the best PBS Space Time episode, great explanation.", "Great episode! Unlike others ones, I, kind of, understand. This episode should have been made long ago, thanks anyway. Thank you for a fantastic series Matt.", "Excellent episode. I've always been fascinated with elements. In my childhood I really enjoyed my encyclopedia of elements, with histories of their discovery, naming and applications. Feeling nostalgic now:)", "I remember sitting in the chemistry classroom, looking at the sun-bleached periodic table above the blackboard. It \"ended\" probably around Seaborgium, having the \"Unununium\" names. I remember reading about the Island of Stability some time later, and that made me... believe, I guess, that those new sorta-stable elements are going to be the most amazing thing ever.", "I wonder if elements in the Island of Stability will have wondrous applications as alloys or chemical compounds, but be rather unimpressive in their pure elemental form.", "This is one of those few episodes of Space Time I can almost completely understand, but I had known about the island for like a decade or more so I had some time to wrap my brain around it.", "That part on the end was my favourite! How delightful to hear of all of these paradoxes in such an interested way  :)", "I would have loved to hear some more about limitations in this context, like relativistic stuff and the structure of period 8.", "Brilliant episode, I've always wondered this and how it all works", "I read a paper a while back about the possiblity of a 'continent of stability'. Basically an Island of stability but could hold an entire periodic table's worth of new elements, made possible by strange quarks or something", "I would be very surprised if element 122 were to appear in the same column as Rutherfordium. If it is ever found, I would expect it to be below Thorium, in another series corresponding to the lanthanides and actinides (unless yet another widening of the table occurs, possibly after element 120). By the way, has a final decision been made about whether lanthanum or lutetium should be below yttrium?", "Another brilliant video by PBS Space Time. Thank you", "The nostalgia I felt when watching this\nGreat video guys! I Loved this", "Phenomenal presentation as usual.", "The element combinations are also important and may lead to the real chemistry that moves us to the future", "I would strongly recommend \"The man who tried to fake an element\" video by BobbyBroccoli. It goes into a lot of detail about history of new element synthesis and basic physics.", "Absolutely brilliant, wow.  So much wisdom and insight.  Incredible.", "I zoned out - it was too difficult for me. But congrats bringing high quality content to YouTube ", "There were some great nuggets in there that didn't even get touched on in my Chemistry degree! Looking forward to the deeper dive episode into nucleon stability", "What if Mithril isn't a pure element? like steel. Maybe there are some awesome materials that are made from a unique processing of already discovered elements.", "I wonder how much similarity there is between nucleons arranging themselves into their most efficient (and sometime unstable) configuration and protein folding.", "The element nobody will be expecting: the element of surprise!", "Definitely need a video on the strong nuclear force, until a few weeks ago I had no idea it was different than the strong force!", "Yay.  I love when it's chemistry stuff!", "This is the most new chemistry I've learned since my GCSE - I'd heard of the island and stuff but not the shells of protons and neutrons and wow that seems pretty important. Why did they not teach us that?", "Could you please do a video about meta materials also? When I think of sci-fi materials, that’s what I think of.", "I love this science channel.\nIt makes me feel like a scientist every time I watch.", "More episodes on strange matter and exotic matter.. perhaps even on neutron stars and their cores… maybe we could get an extra episode on black holes ? I love this channel and it was what inspired me to pursue my degree", "Excellent video. Keep the hard work.", "This came right as I was learning this in Chemistry class, amazing", "Thanks really for an excellent and informative explanation of what might be just around the corner for modern technology.  It is kind of complex and yet also realisable, but still we have to have an understanding of just how tricky it is to get new elements to be for long enough to even be aware that they exist!!\n I am still somewhat confused however about element 43 - technecium - surely if it has an isotope then why would there be none at all. Maybe I need to watch this over again but I just can't quite get my head around it. and I'm supposed to understand physics! ", "Technetium has always seemed like a clue that we should not stop synthesizing new elements. If there’s a radioactive element smack dab in the middle of the periodic table, could there be a stable element in the middle of radioactive ones?", "Nice episode as always!", "fascinating, once again scale factors prove to be  worthy of study.", "Great explanation! I was able to follow even though I don't know much about the topic", "I rarely get amazed. But this info REALLY amazed me.\nAstonishing !!\nThanks.", "Quality as always space time!", "I really enjoyed this episode and the talk about elements! Please do more deep dives on these topics! It's refreshing!", "This episode was great ", "I could see a very dense (but perhaps mildly radioactive), being useful in the manufacturing space, similar to how we use thoriated tungsten in the welding space, and naturally, if such elements were very hard as such, this could be useful for the machining of similarly hard materials that would otherwise be unmachinable in current conventional methods.", "Such a fantastic insight! Ill have to read up on the island of stability, it's a fascinating insight", "Every time the intro beat drops I know a great explanation about stuff is headed my way. ", "5th grade in mid 70’s we were required to memorize the periodic table and were told “THIS is everything that everything in made of..” I asked how that was possible and couldn’t there be more we haven’t found yet. Teacher berated me for “questioning” the scientists knowledge and told the class “they are much smarter than all of you..” Always wanted to go back and find that teacher after more and more elements have been added over the years.", "It regularly amazes me that we, as humans, know anything about stuff on this scale let alone these details (which, despite the great detail in this video only scratch the surface).  The dedication of really intelligent people coming up with theoretical models, designing tests, and then building on that is so incredible.  When we want to be we are an amazing species that explore the world around us, the world unseen, and the universe at an unimaginable scale. Thanks for providing a path to explore this world!", "Good topic. A welcome break from grand cosmic mysteries.", "I always thought any new element would have to be something really waky like something from another dimension that can't normally function in our realm with out technological help.\n\nThanks for the video. It is interesting to think that there are even higher elements we have never seen in the table. Perhaps one is useable for massive energy production.", "Really interesting episode, thanks.", "I love the sci fi elements u started with. Mithril made me smile", "It's poetic. Reminded me of Carl Sagan in Cosmos:\n\"We discover hints of these islands of possibility just beyond the bounds of the known.\nWhat can we do but hold our breaths and leap towards them, hoping to gain new ground in humanity's journey to futher and future horizons of space time.\"", "Hopefully you can do an episode on the continent of stability and the hypothetical UDQM form of matter that those elements are thought to be comprised of. It's even more speculative and much harder to reach than the already speculative and hard-to-reach island of stability, but there may be far more potential for useful and even stable elements there.", "Thought provoking as always, Matt.\n\nCan I assume that because we don't know what any higher magic numbers may be then that means we don't have much or perhaps any idea about where they come from? Are they likely to turn out to be some new kind of constants which we simply have to accept such as 1/137(-ish)?", "A surprisingly down to earth episode. BTW,is tecnetium pronounced that way?", "Very good information in this video. Thank you.", "Absolutely loved the netherite at the start", "Finally, an episode I fully understood!", "I may have failed chemistry in high school but now I'm fascinated by this stuff!", "This was very interesting, thank you.", "I found the recent BobbyBroccoli video that deep dives into the history of finding artificial elements absolutely fascinating", "I knew about some of these, but I didnt know some of the other ones. Thanks man! You just got a new sub! :O", "The way Charlie's character runs while he says \"Wait, I can't flyyy!\" is peak comedy.", "I love how he decided to add netherite to the intro, legend", "I was excited to see a chemistry episode, these aren't as common on this channel as the big spacey cosmology ones (which are also fantastic).", "18:25 my reference class is a set containing just one element, namely me. It's great because it means I'm never surprised by anything", "Of course - there are many elements now that weren’t known when I took chemistry in the 1960’s.", "\"Technoblade never dies\"\n\nA wise man once said, \"A man only dies when he is forgotten.\" We will never forget you Techno, your videos will always make us laugh. You have made a huge mark of the entirety of the Minecraft community, you were the best of the best and you will live on in our hearts. TECHNO BLADE WILL NEVER DIE!", "It would be nice if he actually mentioned which elements may be synthesized soon even though they’re unstable (radioactive)", "I have like a -10 understanding when it comes to elementary particles. However, it would be extremely cash money if there was a separate way of the quark thingies combining such that it creates and entirely new periodic table for us to discover and utilize.", "Excellent episode. I love when you do episodes on chemistry.", "Finally an episode I can understand ", "I teared up like, three or four times during this episode. This games narrative does an effective job of holding your heart hostage through the whole thing.", "The Harry Potter quote and saying she can do what she wants now has me crying, seeing how relived and free she feels. In a world so full of bad endings I'm so happy that, by the looks of things, she got the good one <3", "I always assumed Mithril was real life Titanium for some reason", "It's so weird seeing Matt explaining advanced concepts on previous videos now going back to pretty much basic chemistry", "Wow. Another awesome episode. This kind of channel makes me really appreciate the value of the internet.\nSeriously, I wish I'd had this kind of information and divulgation when I was in high school, 30+ years ago. Only now I begin to grasp what all this craziness was really about (and yes, I passed all my grades with really good scores).", "You should be a chemistry teacher.  Great vid.", "I wonder if part of the issue is related to Sphere-packing-  Are there certain sphere-packings better at creating 'optimum densities'? (https://en.wikipedia.org/wiki/Sphere_packing)", "WoW! First space/time I almost fully understand from beginning to end", "Do we have any good guesses about unique or useful properties of elements on the island of stability?", "So... Is it possible for a stable isotope of element 115 to also exist? And, if yes, is it gonna be possible to be discovered soon by us?", "I was reading about what might be the largest possible element and saw something saying it might be 137, and thanks to a recent video from here I recognized that number!", "I think there has to be one or more elements we don’t know yet that help with antigravity and traveling through another “dimension” or “phase” to reach other star systems.", "I always imagined that the sci-fi elements mentioned were not actual elements in the periodic table but yet to be discovered compounds of various existing stable elements that end up having significantly better properties than their constituent parts. Something like how bronze is better at say making tools than copper or tin are on their own.", "Very interesting and educational video.  \n\nWonder if our computer models and experimentation have yielded any ability to not only predict where islands of element stability will exist.....  but also the macroscopic properties of that element.  Its one thing to be able to produce an artificial element but doing so with a purpose in mind ahead of time for some beneficial technical application would be an incredible achievement of science and engineering.  ", "Are there any promising means to potentially create those elements that might exist on the island of stability?", "The larger the elements that we find, I imagine the more data we have to rectify gravity in the quantum realm. I’m excited to reach an island of stability.", "I love the quip about any given species becoming \"the Ancients\" in an eldritch horror way because that's literally the plot of Homestuck", "20:30 I just recently read Cixin Liu's \"The Dark Forest,\" and wow, it has had me thinking about this.", "there is a scifi book by Douglas Preston that is based on this. Fascinating stuff. The Ice Limit.", "That kind of raises the question. If stable heavy elements like that could exist, wouldn't they be present on earth and be found already?", "I’m now imagining elements with tens of thousands of protons, and how useful they might be lol", "I saw a video a few weeks ago by BobbyBroccoli called \"The man who tried to fake an element\". its about the history of man made elements and the race to be the first to actually make them. If you want to know more about how these elements are made and the surrounding drama, its a great video.", "Can elements be more stable in certain environments?", "Awesome video and one of my most favorite topics. It's interesting that scientists now believe that there are stability islands very far up the periodic table, so my disdain for any scifi show that includes 'new elements' is mostly just hubris, as advanced societies may actually be able to produce new elements with amazing properties.", "you explain very well, thank you", "5:42 and 10:40 minor correction: Technetium-96 does not have a half life of 51 minutes. That's Technetium-96m. Technetium-96 has a half life of roughly 4,28 days.\n\n\n\nGreat video, though. Thanks for the consistently great and informative content!", "The problem with elements in this \"island of stability\" is that this is relative to its neighbors. They'd still likely be fiercely radioactive. Even if they were completely stable and useful in some way it would be tremendously expensive to make so in the end would be nothing more than fodder for a few research papers and a Nobel prize in chemistry.", "This channel is so freaking good - my only regret is finding it so early ... oh, the jealousy of the other-me who only just found it and gets to binge it for the first time."]}