{
    "video_id": "QEGKBYYwTmM",
    "comments": [
        "Floyd live these 100 million spar sessions   may weather is his name no  pretty boy Floyd would have killed him",
        "Bro maywheather was chillin in the ring in the beginning",
        "Phony fight, fixed, fixed, fixed, all to make Floyd seem incredible.",
        "Floyd didn’t have the balls to fight KSI",
        "Deji such a humble guy, he didn't wanna embarrass Mayweather so he let him win and only gave him a black eye, what a guy.",
        "I have no words",
        "朝倉未來戦とは、打って変わって終始おちゃらけモード　日本で敬意持たないと一生嫌われるのを察して真面目にファイトしていた。\n本当に頭の良いファイターだと思う。",
        "Respect Floyd for opening people’s eyes on this clowny pseudo boxers fights. I really hope y’all stop watching this lame shows.",
        "Hey can anyone explain what this fight was for?\nI’ve never seen this arena",
        "I don’t even know how this is a thing. Floyd’s a joke, I can’t believe people spent money on this. Floyd’s acting like a clown and it looks unprofessional.",
        "Jerry skates joe Frazier Muhammad ali",
        "Bro imagine if Mike Tyson trained deji highly unlikely but still if deji would of rushed him and started going ham then he probably would of shocked the world",
        "This was obviously gonna be the case lol!",
        "“You miss every opportunity you don’t throw” wuh?",
        "Yav got an old man teaching these youtubers they not professional level ,bet jake wouldn't fight him , he'll say he will but wont ,unless floyd reaches 92 years old then jake will call him out",
        "Big respect to Deji for letting his student use him as a punching bag. ",
        "I feel bad for whoever paid to see this",
        "Somehow worse than the time Floyd went against the Japanese dude",
        "I need to get YouTube famous and get paid to get beat. ",
        "Worse stoppage",
        "YOOOO MAYWEATHER ALMOST KILLED DEJI in just 30 seconds too",
        "Money buys anything.  Let’s fight but you can’t punch me”",
        "Deji let Floyd win what a humble man deji is",
        "Deji a man for getting in there and having a go much respect",
        "“The last 10 seconds just frow” ",
        "so lame",
        "First time I’ve seen Floyd being the aggressor and not running",
        "Don't know why people are so scared ! You get one chance just go for it !",
        "Why",
        "L deji",
        "Bro had his mom yelling STTOOP STOOPP lol ",
        "What a Joke.",
        "The most freest money ever Floyd has won",
        "Floyd is Great you guys are just haters",
        "Dude can't hit an old man lol",
        "I wonder if ksi would’ve kept the pressure on him after that taunting",
        "Stop stoppp stoppp",
        "0:55\n\nAs insulting as that was that was pretty funny what mayweather did.",
        "Floyd made it look easy too at 45 hes the   for a reason",
        "This technically was the longest deji has lasted during a fight ...We’ve never seen him last 6 rounds... ",
        "did better then tenshin",
        "One of the best things is that he never takes credit for himself when he achieves something. He always respect us, the audience, and his team, and he is always polite in all of his videos. We congratulate ourselves on this achievement. More to come and everything to come :o",
        "Floyd, I have jet gas money, want to follow me on a pilgrimage?  Maybe we can find some super powers.",
        "Tbf, deji is going against someone similar weight and best in the world. Even retired still active. \nJake is old, fat or skinny none boxers ",
        "I want to fight Mayweather give him a real fight KO",
        "Kinda embarrassing to watch",
        "These Deji comments have me dead bro ",
        "man it's hard to tell who's the 45 year old and who's the 25 year old",
        "These fights with Floyd last until he’s had enough lol then he gets serious",
        "Boxing is a joke now",
        "Deji before the fight basically even state that he knew he was going to get outboxed and that he stood no chance against Floyd, and that the whole reason he took this fight was to gain experience. The problem is, this was so much of a one-sided beatdown, that Deji pretty much gained nothing, and this was pretty much a big waste of everyone's time.",
        "Mayweather balance technique is perfection",
        "Shout out wade he does a well on commentary",
        "Bro flinched at every fake punch",
        "Did people actually pay for this?",
        "Irl smurfing",
        "When I saw the word “highlights” related to this fight I came to see what kind of comedy video this was.",
        "Big respect for the master boxer to stay humble and let the little guy gain experience. Deji letting Floyd win for his confidence is ",
        "Crazy that these are HIGHlights  this vid was boring  can’t imagine having paid for this fight ",
        "You could bet 10,000 on Floyd and only win 3$ lol.",
        "Floyd was trying to make deji last as long as he could!!",
        "This was a pathetic bout that no one wanted to see",
        "Is this what boxing has become",
        "And why is he always the same ref for all of Floyd's fights",
        "Such a pointless fight",
        "That was a wholesome fight",
        "I didn’t even know this fight happened.",
        "Kinda embarrassing for Deji to be disrespected and toyed with like this. Floyd clearly didn't see Deji as a worthy opponent. He only came for the paycheck.\n I'd feel bad for Deji if he hadn't made the foolish and delusional decision to fight one of the worlds best, albeit aging and past his prime, after fighting the walking punching bag Fousey....",
        "Imagine if Deji gave just a tad bit pressure…man Floyd would’ve gone night night!",
        "We just got scammed ",
        "Floyd getting fluffy and still has reflexes of a cat ️",
        "why is deji wearing tank davis shorts?",
        "Floyd laughing all the way to the bank",
        "I see Floyd doing what he's always done pick his fights. He's not the GOAT Muhammad Ali is!",
        "Kenny Bayless is obviously on Floyd's payroll. From the Conor McGregor fight on.",
        "Bro this is exactly how Floyd spars his sparring partners. Just toys with them",
        "Mayweather!!!......Easy Work!!! (Mayweather 's Voice)",
        "完全に遊んでるな",
        "5:09 I can die happy",
        "This fight looks forced for entertainment",
        "So why did this sparring event happen?",
        "How does this happen? Floyd Mayweather, one of if not the greatest boxer pound for pound of all time, 'fighting' some YouTube clown..",
        "Floyd's fighting a pre school kid lol",
        "Why would someone pay to watch this?",
        "Man bro.. Floyd Mayweather is a living G. O. A. T. ",
        "Pathetic performance.. clearly was a joke for Floyd. Pretty sure he felt bad excepting the fight in the first place lol",
        "Floyd had to set a reminder in his phone about this fight",
        "How embarrassing for KSI to be related to this",
        "Like, how the F does this nobody gets the chance to fight Mayweather ? how does this fight make ANY sense ?",
        "For mayweather…. It was Tuesday",
        "What a waste",
        "Easy money",
        "If deji was smart, he would have went to the body.",
        "Yes we all know mayweather was never going to be in trouble in this fight .. but yet still had to play mind games before the fight by changing glove weights  \nProper embarrassing that mayweather is fighting deji , fair play to deji for getting in there but for mayweather this is absolutely terrible . He's fighting these guys just to stay relevant ",
        "I would have rather got knocked out swinging and getting tired to at least entertain my fans",
        "Bruh No Hugging?",
        "Post the full fight please ",
        "What a boring fight, boxing embarrassment",
        "Huge respects to Deji man",
        "Very poor performance from deji",
        "This is exactly how Jake would look against a pro boxer",
        "This is a joke at this point",
        "I like how Deji took it easy for Floyd. Huge Respect.",
        "They made people pay for a sparring session ",
        "What’s that song at 5:57?",
        "just pointless watching anything floyd does",
        "Floyd really just danced around a bit and picked up the bag. ",
        "Me personally I wouldn’t let anyone dance in the ring with me",
        "This was a waste of time they both did it for the money they making a fool outta u guys thinking this wasn’t rigged lol",
        "Floyd’s just phenomenal. Not the most entertaining boxer, but technically just unbelievable.\n\nMy favourite ever. ",
        "This is ridiculous ... It shows that nothing else matters nowadays but money and fame ️",
        "I don’t think anyone wants to fight Deji now because they don’t  really want to get embarrassed by him ",
        "Where are the highlights guys? This video had a clickbait title",
        "What happened to standing up in the middle of the ring boxing",
        "DEJI did more than Logan did. Logan fought 6 rounds with Floyd wit 14oz gloves. Deji fought Floyd with 10oz gloves and survived 6 rounds and even bruised Floyd's eye",
        "Why is Deji even boxing for crying out loud....",
        "Why didn't Ksi Fight Him. Would Have Been more interesting.",
        "respect to Kenny Bayless... he knew what it was... he even blocked one of the last hooks mayweather threw..",
        "You know it's a mismatch when the mom starts screaming for YOUR life in the ring ",
        "5:27 was the first commited punch Deji threw.\nFloyd weaved it like nothing.",
        "Deji knew he had too much power for Floyd and didn’t want to end his life so he spared him. Big ups to deji ",
        "Deji looks like the most unfit fighter I've ever seen. Both Skill wise and Physique wise.",
        "This is why boxing the sweet science is becoming a joke.  Floyd fight Canelo these joke of a fight the people who payed should  be given a refund.  This is an indication that boxing is in trouble.",
        "shoutout to Deji for letting this random win.",
        "How crazy this is, I’m envious, Floyd gets to learn a lesson from the GOAT in a lil ole game I like to call boxing",
        "Looool when your sibling realises the controller isn’t connected",
        "Who the f*** is Deji?….TKO",
        "Floyd went into this match like a Harlem Globetrotter. He was playing around with him and entertaining the crowd. Deji was putting his all in. Floyd gave 10% of his ability.",
        "You can tell the experience Floyd has against deji. He could've ended it at any round he wanted.",
        "DAZN you need to fire the guy who blasts music on top of the commentators between rounds.",
        "This is the most boring match I've ever seen ever no wonder Mayweather is undefeated look at who he fights",
        "Floyd may call himself money but he comes across as cheap.",
        "What's the point? Honestly",
        "Sheesh, there were the most basic highlights, didn't expect much to be honest.",
        "I was laughing the entire time. Floyd was absolutely toying with Deji, bro was dancing cuz he knew he was getting the bag for doing nothing",
        "This is NOT even a sparring session for a real fight. This is a pre-talked, pre-arranged, and pre-practiced exhibition to get FREE cash from people who wanted to donate.",
        "Yo guys here are the time stamps for every time deji punched",
        "I didn’t even know this fight happened lol",
        "Floyd: taps deji on the head\nCommentator: Beautiful hook by mayweather",
        "LOL THIS IS PATHETIC FOR MAY",
        "With exhibition matches against YouTubers, Floyd Mayweather gets to keep fighting fit, and makes a nice payday, in addition to keeping him from being tempted to resume his professional boxing career, risking his undefeated record.",
        "Love how Deji really was being kind to Floyd, could all see that knockout kiss in his fist and deji chose not. ‘Fortunate Floyd’ is his new name now ",
        "Yawn.............",
        "Its like watching a lion play with a gazelle it’s dinner ",
        "Floyd is weak af for this. It is really embarrassing for him to fight someone who is clearly not on his level. I feel bad for those who actually paid to see this live.",
        "I actually can’t believe deji here he understands how his power could hurt such an old man so he held back the entire fight and let the old man hit a few weak shots here and there to keep him happy and entertained he’s such a nice and humble guy much love and respect to you deji I’ve watched you for years",
        "The fight literally not one person wanted but we got anyone",
        "MayWeather is litteraly kid buu",
        "I'm still laughing at how Floyd schooled Conor McGregor. CMG has still not recovered mentally from that humiliation and never will!",
        "Easy money for Floyd.",
        "This fight was a troll. Mayweather was just playing with his prey. Mayweather didn't give two fcks about this. Even the commentaries didn't believe in deji.",
        "i want money to play with floyd too…",
        "No matter how bad the fight is or how funny it looks Devi has heart and I respect him for taking this fight if Floyd wanted too he really could have hurt him but if he tried to do that he would be open to counter punch’s which Floyd avoids at all costs.",
        "I'm not upset with this like I THOUGHT ID BE",
        "Lit a pro fight with Floyd with 1 win",
        "Professional fighters r a different breed of human .. I’d die if I took one of those punches ",
        "This kind of fight is useless and not sure why people even pay money to watch it.",
        "Floyd is the highest paid to dancer on the planet ",
        "Stick live mover",
        "The funniest boxing match ever",
        "Deji was set up to fight this lol shhhh",
        "Why ppl still paying to see this kind of comedy boxing .",
        "Fair played dej, you have all heart in that fight. Big up ",
        "I AM THE REAL JX100",
        "8:37 Bro was his mom yelling “STOP STOP” ?",
        "What a joke \nHe got toyed with",
        "BS fight Mayweather is just banking on all these fools.",
        "you don’t play boxing",
        "I want to see Deji vs Logan, but Deji needs to be more confident",
        "Weak",
        "ref called that early man, probably down to him seeing deji as a youtuber not a boxer which is wrong",
        "deji got some balls ill give em that",
        "Now this in some entertainment ",
        "deji gave him the win",
        "Fair play to Deji man, he’s improved alot - Floyd is just on a completely different level. Ksi wont stand a chance, truthfully.",
        "Well, hope not too many people spent money on that. Even the refs stoppage was fixed.",
        "Floyd Mayweather is doing his Emmanuel Augustus imitation this is a purely entertainment exhibition fight looks like fun",
        "People payed for this? Hahaha",
        "This is why I no longer watch Boxing ,all this tippy go sheet, and the winner is decided on points and we watch so called top of the bill boxers who are as boring as farouk! Its sheet basically",
        "What a con.",
        "It'd be weird if Deji thought he was in a real fight.",
        "Who is Deji?",
        "Deji was scared",
        "This floyd guy could go pro. He would beat anyone in hollywood division.",
        "Keep in mind though, Deji fought a pro boxer before Jake",
        "To say that this is “fight” had HIGHLIGHTS is downright insulting.",
        "Your goat fight like a kid - Deji mom",
        "Lol",
        "Deji got a chin never seen Floyd hit someone so much Ricky Hatton took way less.",
        "Personally there were a lot of dangerous fighters over the past 50 years and they were some of the greats. 50 of them all races. Money May All Day",
        "It's funny reading all the comments from casuals that think Digit let Floyd win.  Floyd has been boxing since 2010 and trained harder than ever for this fight.  He earned that.",
        "Ngl this fight was uneventful, I thought I was watching strictly come dancing than a boxing match",
        "It was nice of Deji to let an up-and-coming boxer win",
        "Prince naseem lol",
        "what a waste",
        "This is so embarrassing",
        "This is the sort of Mayweather people were asking for in 2012 - 10 years late.",
        "floyd vs mike tyson next plzzzzzzzzzz.",
        "Who ever yelled “finish him Floyd” has no heart ",
        "Fine I’ll say it for y’all.",
        "If you payed for this you got scammed",
        "Floyd could have knocked Dej out first round 30 seconds if he wanted 2",
        "Elden Ring: Only one ring, 7.8/10\nSonic Frontiers: A whole lot of rings, 8.8/10",
        "Yessir",
        "Deji let us down that was actually kinda disappointing..",
        "Completely toyed with",
        "Fight his brother",
        "Deji is a real humble guy, he didn’t uncork on this small “floyd” guy because he knew it wouldn’t be fair cause of the size difference. This size difference is crazy, he could’ve knocked him out with one punch. Boxing Commissions need to do better!",
        "At this point Floyd should go to the WWE",
        "Bro Floyd was completely in control of this whole entire fight but respect for not completely destroying him or just knocking him out in the first 30 seconds",
        "amazing to see how many levels mayweather is above",
        "Mayweather should fight a real fight with real animosity like Jake Paul",
        "Respect to all the older dudes out there, Floyd gives us all hope :)",
        "This fight was a joke ",
        "This the most boring thing ever who pays to watch such a fight",
        "Mayweather cant even read or write. clearly needed this fight to boost his ego. I love how he fights unknown boxers and then showboats. I love that because I know for a fact he'd be running away from a Mexican fighter. doesn't even have to be canelo any ametuer would do.",
        "Big ups to deji going easy on floyd, he knows there’s levels to this game yet he’s so humble allowing floyd to get the W!!",
        "This is such a joke anymore. Mayweather is playing with him like a cat does with a mouse. Floyd has his hands down the entire time.",
        "He box like a pro against fousey then acts like a chicken in a real boxing fight",
        "A sparring fight ",
        "Didn't even know the fight happened already",
        "I didnt even know this fight was happening ",
        "Close fight early stoppage for me. I would say deji was ahead on the score cards until who ever the other guy was stopped him.",
        "Big props for another pay day for Floyd.  Not much else to say. Thats all this is.",
        "i give so much respect for deji for trying and never giving up",
        "When your uncle tells you to show him what you got at the family bbq ",
        "Honestly how did deji hyped so much after his first win??  thought he could go against a boxer that didn't lose a match on his whole career and beat him? Not even jake does that",
        "Great Fight ",
        "These fights are definitely legit",
        "Deji didn't deserve to fight Mayweather at all.. obv it cuz of the money, but still..",
        "Mayweather gets to spar and get paid now gotta luv it",
        "Stick live",
        "Cowabunga! Great Highlights DAZN Boxing ",
        "Granted the ref was tryin to protect the poor guy- but that stop was still too soon",
        "Mayweather looks so bored but he has to do this cause he makes more money fighting other boxers",
        "I feel bad for anyone that paid to see this.",
        "Prince raseeem did this against pros.",
        "Worst fight I've ever seen.",
        "Ksi have to step in there with floyd now bro cause he disrespected tf outta deji!",
        "Props to Floyd for lasting 6 rounds with Deji",
        "Is Floyd even wearing a mouth guard?",
        "Its funny how people constantly calls floyd old when they are most likely older then he is.  If thats the case, then most of those person are ancient...it was only 15 years ago that Floyd was 29/30. Thats really not that long ago. Even in boxing.",
        "Of course Deji was never gonna win, the chance was almost non existent. But props to Deji for doing what most have never done by given Floyd a shiner on his eye and making him bleed. You rarely see that. Especially in an exhibition. Regardless of the loss it’s a win win for Deji. He gained valuable experience, and he’s gonna have plenty more experience in his fights going forward now.",
        "While you're at it, go ahead and call Floyd the greatest of all time. Numbers never lie",
        "When Global Elite plays with Silvers",
        "50 cent owns Loyd Layweather",
        "Why doesn't Floyd fight Crawford or Spence?..........",
        "I didn’t even know Mayweather was fighting again",
        "I am a fan of Pretty Boy Floyd when the guy was fighting monsters and doing it easy, but this \"money\" guy fighting nobodies and celebrating it like it's hard to do. I'd imagine me beating a little child who can barely walk would be seen as bad, this is the same. You're beating up on a guy who is NOT a boxer... and you are.. well done :|",
        "Lol people actually payed for this?",
        "Floyd is down bad for some money",
        "Floyd beat the game and now he’s going back to finish the side missions at level 100",
        "Big props to Deji to getting in the ring with Floyd  Mayweather. hope he gets paid.",
        "Well that was boring",
        "Loool. It looks like a boxing game on PS.",
        "boxing is a joke",
        "When did this fight even happen? I didn't know Floyd fought. ️",
        "Deji never had a chance bit off way more than he could ever chew",
        "What a joke",
        "Floyd just having fun making money at this point.",
        "I don't know much about this Deji dude. But fair play. \nI'd jump in to get beaten up by Floyd as well",
        "That was a bad stoppage by the referee",
        "Kevin Hart vs The Rock ️",
        "I'm 2 mins into this video and still waiting for the \"highlights\"",
        "I honestly think I would of fought a better fight then Deji I would of been throwing punches. I say that but once you get in the ring with Floyd probably a different story.",
        "What a waste of time and honestly what did you all expect with your fantasy of Deji having a chance against Floyd.",
        "Floyd would have went harder sparring an aspiring 13 year golden glove fighter.... this fight was \"taking it easy on some one\" to a whole new level",
        "Floyd just played with him like a junior sparring partner in his gym, he pulled pretty much every punch to avoid hurting Deji, the gulf in ability is there for all to see, it’s not a contest on any level - and people paid money to see this ",
        "Floyd was just playing",
        "What a humble guy, at any time deji could've tried",
        "Deji looks like a dude they picked up and has never learned anything in boxing just his jab stuffed some 70 doughnuts down quit YouTube and became a mailman and yeah not being mean he never should of did this fight",
        "Deji never unleashed on Floyd what a sweet heart ️ ",
        "Haha brilliant I like the fact that flyod is teaching these a lesson and you can't say his not entertaining",
        "Well Ik what to watch when I can’t go to sleep…",
        "Let's just be real Deji should never even be allowed in the ring with Floyd. Flowd could have hit him any time he felt like it and put him out and hurt him real bad. Dejis lucky he didn't either that or it was put in the fight contract to take it easy on him.",
        "Deji was too scared to let his hands go",
        "Floyd BOXING IQ IS CRAZY",
        "what is this?? play or boxing?",
        "Bro I can’t believe people paid for this sparring match ",
        "The old boxing matches were so much more entertaining with muhammad Ali in his time.",
        "Nice fight   ",
        "Nobody have time for this",
        "This is so staged ️",
        "Nice to Floyd’s body guard in there with him (referee)!!!",
        "I would have done better than Deji LOL",
        "If only he fought in a ring this size his whole career ",
        "Can someone explain to me why deji wanted to fight Floyd? I don't understand why he just jump straight to him",
        "I can tell that deji let floyed win deji was not even trying",
        "Embarrassing",
        "Yeaaaah another fix fight",
        "Floyd was just having fun, dancing in between rounds and putting on a show... Treated Deji like a child and probably grounded him after the fight ️",
        "LOL",
        "How do I sign up for a fight",
        "i want floyd vs deontay wilder next",
        "Now I get why my mom said it’s disrespectful to play w my food before I eat it",
        "This fight was like watching goku vs uub",
        "Floyd's smart. If he knocks these guys out first round people will get bored. Put on a show, entertain and collect that paper. Then people will keep paying for exhibitions",
        "Leave it to Floyd for fkin up boxing all for the love, and loss of money.",
        "Deji Definitely was scared and it shows .",
        "Deji did better than his brother would have, but I guarantee he declined the fight first because his ego can't handle a loss.",
        "When a high level character plays on easy mode.",
        "Deji skipped straight to the boss fight lol, it looked like a fun time",
        "Who are the commentators, they just lost all credibility, i cant watch this video..",
        "WASTE OF TIME!!!!!!!!",
        "Deji just showed Floyd too much respect. It’s as simple as that. You see it a lot in boxing. He knew what he was in against and showed him to much respect and was to tense and hesitant. But it was always gonna go that way I called it when the fight first got made I knew exactly what was gonna happen. But look it was always going to happen that way, Deji isn’t a boxer and Floyd is the goat.",
        "This is just embarrassing. Disrespect to the sport and Floyd how bad Deji was",
        "who TF is diji? i had to look him up. why is one of the greatest, FM in the ring with this nobody?",
        "So nice Floyd did this make a wish for him",
        "Not much you can do against arguably the greatest defensive fighter to step in the ring. Man’s Einstein of boxing.",
        "The commentators were REALY struggling",
        "Little kids ruined the internet. Everything is \"cool\" and a \"game\"",
        "Floyd playing but deji didn't throw ever.",
        "I actually think it would be pretty interesting if floyd fought blindfolded in his text fight",
        "I knew deji was gonna get embarrassed when he said “I want to survive mayweather and land one punch” that’s the wrong mentality",
        "floyd looks old though",
        "Floyd is still the goat like  he's nearly 50 years old haha",
        "This was like going into a dark souls game and starting with the hardest boss",
        "I love how Floyd is smiling when punching Deji hahaha",
        "For the tax man!!!!",
        "2 cans",
        "I thought Floyd was already retired ",
        "Deji was Guarding the whole time ",
        "Floyd was gonna win whenever he wanted to but that stoppage was too early",
        "this is physical chess a 3200 filo vs a 600",
        "I could do better in me sleep ",
        "I bet floyd loved winning without abusing the rules.",
        "What a fight!",
        "floyds in NG+ now fighting the first boss",
        "Always the same REF... and he stopped the fight too early.",
        "boxing is a circus now lolol",
        "Why did Deji let him win I don’t… understand",
        "Is this guy, Deji, on the same skill level as Berto?? I think not",
        "Bruh not trying help myself up cmon bro Floyd playing with one punch could end it all I would’ve bro",
        "This was a weak fight",
        "National stick live mover",
        "Deji and Floyd fought????",
        "This is literally when you’re a level 1 in a game and fight the final boss in a game",
        "The referee is happy to make some money.  Deji is happy to make some money and Mayweather is also very happy.",
        "I'm glad Mayweather let Deji off xD",
        "The most out of shape I’ve seen Floyd",
        "doesn't deji and his coaches have dignity?????  and is this really worth paper view????? whatever this is boring   .",
        "This was embarrassing",
        "I have never seen floyd look out of shape in a ring",
        "Deji was getting Played with like toy from ToysRus ",
        "Mayweather is classy he only used 1% of his power",
        "Huge props to Deji for putting over young talent like Floyd. He knew it was an exhibition and really didn't stand to lose his undefeated streak!",
        "Floyd going easy to keep getting these fights with YTs..smh let YT fight YT...nobody want to see this ! ️",
        "We should be thanking Deji for giving us great match to watch, otherwise he would've knocked Floyd Mayweather out in the first round, and it would've been boring! Plus he didn't want to embarrass Floyd.",
        "Dejis mom screaming “STOP STOP STOP” at the end ",
        "Fake fight. Just another easy payday.",
        "Wack",
        "WOW WHAT A FIGHT REMINDED ME OF GATTI VS WARD... THESE TWO ARE BRUTAL FIGHTERS ",
        "boxing becoming a circus well done Floyd had the publics trousers down again another easy payday {go champ}",
        "What's the purpose of this, how many millions is he getting out of this one️ That's what's wrong with boxing it don't need this kind of buffoonery.. Mayweather need to go sit  his funny looking self down.. Boxing is a joke, where is the real boxers at nobody's doing anything? Every 1 1/2 to 2years you might have something that's not even worth watching",
        "what has boxing become",
        "Wade for real sounded so patronizing towards Deji at the end. I know that wasn't his intention.",
        "What’s the song at 6 mins",
        "If Floyd's last 2 fights including this one counted he would be 52-0 right now, they should've counted those fights",
        "Such a weak fight",
        "Deji didn’t even get knocked out",
        "How was that enough and you just call the fight?",
        "Ahh this is shameful. No point to these fights",
        "Deji didn’t go ultra ego he was holding back",
        "The difference is Logan probably sacrificed the majority of his purse to Floyd so that Floyd would let him last...",
        "The referee is an absolute marshmallow ",
        "Who ever payed for this needs to get there money back. Basically an adult fighting a kid just toying with him",
        "is that Deji mom screamin at 8:34 ???",
        "Love how deji went from loosing everything, to winning one fight and then randomly fights mayweather acting like there is a chance he wins",
        "Floyd stone cold",
        "Reminds me of apollo creed v rocky in their first fight ",
        "We all know this is a pointless boxing match but if deji is smart he will have been watching and learning how Floyd moves and evades.",
        "My dude is taunting him rn",
        "Was this a real fight or a fight for the Deli?",
        "Bruh this ain’t even boxing anymore",
        "Jake Paul could beat him",
        "Shoutout to Deji for giving Floyd the Win  , great guy I tell you that.",
        "What a sad sad small little man ",
        "Easy money again Floyd !",
        "Floyd is dancing to the bank right now much respect to the legend",
        "“This is soooo embarrassing” in KSI voice",
        "Pathetic showing fom Deji. The excuse that \"Floyd is one of the greats\" is BS. Deji looks like he's never spared in his life.",
        "Disgrace, although Deji still a more entertaining watch than okoli ",
        "It's crazy how Floyd could've gotten sturdy during this bro",
        "Deji Gave Floyd Black Eye With One Punch!",
        "People forget this is an exhibition so it's not really a matter of who's gonna win but a learning experience for deji at this point. To step into the ring with one of the greats and basically go toe to toe is a great way to hone his skills and learn more.",
        "I'm guessing the more rounds you last the more money you get. \n\nDeji acted like he was a Yu-Gi-Oh card in defense mode",
        "Mayweather got battered and a black eye from a Youtuber. ",
        "He pulled the Conor fight stoppage",
        "Who in the f is deji...???",
        "Deji was blocking punches and the corrupt ref stop the fight lol.",
        "Deji found out, unlike his Youtube videos he couldn't fake this match.",
        "This was embarrassing to watch",
        "FLOYD UR A LEGEND BRO!! ",
        "Farcical, a total novice in with a master.",
        "This embarrassing video is how I'm going to remember deji. This and his cringe public fighting with his brother.\nWhat a walking L",
        "what a joke",
        "At least deji bruised mayweather a little unlike logan lol",
        "Yes deji gave him a black eye can't be any happier for the man",
        "From what i saw Floyd won the other guy did not give him the win floyd earned it",
        "Floyd out there doing emotes on Deji ",
        "I guess it was a money fight there’s no other reason for this fight. It just shows that there’s levels to this. Denis coaches let him down letting him take or make this fight it was silly. Performing and putting himself in danger for a check. Plus your gonna have a bunch of clowns talking about how he’s back to losing anyone who thought there was any other possible outcome is living in a cave. It must’ve been a money fight still silly.",
        "How did Deji get an opportunity to fight the world's best boxer.. smh..this universe makes no sense, we really do live in the matrix",
        "I wouldn’t mind loosing to Floyd, fighting him is an accomplishment alone.",
        "Man can’t believe this was on tv lol. But honestly I would love to say I boxed one of the treated tho.",
        "Not being funny but maywhether is just playing with his food here, he coulda easily put deji too sleep",
        "Whoever paid this fight you got robbed and what’s funny Floyd knows he’s robbing people for fighting bums",
        "Honestly props to Deji for letting an old head like Mayweather take the win here",
        "painful to wathch fml",
        "Jake Paul vs may two clowns",
        "Man they use the title pro so loosely in influencer boxing",
        "Jesus floyds experience really shows, he’s also massively just not trying whatsoever \n\nWish deji threw more",
        "STAAAAAAAAAAAAHP - STHAAAAAAAP STHAAAAAAAAAAP",
        "Watching Floyd in this fight is like watching Roy Jones",
        "I’m glad Floyd didn’t do too much - he was obviously not putting any steam on his punches… I respect that because Deji seems like a nice guy and there’s no need for Floyd to try to hurt him in an exhibition match. Props to Deji for his preparation and growth as a fighter",
        "This is gonna be a tough match for deji",
        "Deji lasted 6 rounds with the best boxer alive and didn't get knocked out....he was also able to cut him, that's pretty impressive",
        "Deji: Barely touches Floyd with the jab\nCommentators: OOOHHHHHH",
        "Deji got paid to be a punching bag!!!",
        "I cant believe we are in a universe where The Candyman vs Mayweather is in the realm of possibility",
        "next up lennox llewis verus very tough garbage man.",
        "Imagine if you actually paid for this whole event ",
        "This is embarrassing for everyone involved",
        "The Feint master on that night.  Congrats on the KO Floyd and thanks for the entertainment",
        "Seriously who pays for these fights ",
        "deji did well floyd having fun but this commentary team so bad lol",
        "These fights are cringe",
        "Floyd showed a lot of respect in this he had no beef with deji and really was just showing him and teaching him rather than going crazy. That’s love fr and deji did great held his own even though he was shaking but your going against one of the greatest so understandable. Floyd just trying to give the crowd a show and let deji get some experience watching him move and when he taunts him a little it’s when deji is usually slightly out of range so I hope he noticed Floyd’s standing and the way he’s prepared to move out of the line of punches rather than blocking.",
        "Out of ALL the people who would steal your kids, I never suspect someone like KC to steal them, Im ashamed of her, she should know better",
        "this is crazy Floyd getting paid for fights like this he most definitely robbing the bank and fans",
        "Floyds dad bod",
        "“I’m quite worried for deji”",
        "Now this is a nice, clean exhibition bout.  Floyd is not really trying to hurt the young man... Yeah hes showing him up a little bit  but all in all.... This is clean",
        "I was having a hard time going to sleep, but this was the key ",
        "This foo still has Kenny Bayless there to save him ",
        "This has the same feel as when a dad has his kid or nephew in the ring just kinda letting them get a feel for it.. and occasionally letting them know what's up",
        "Demi threw 10 punches the whole match",
        "More entertaining than any Jake or Logan Paul fight",
        "Hate that Floyd ain’t hit him with the Philly Shell , he wouldn’t have been able to touch Floyd",
        "Floyd was really dancing ",
        "wait this was real",
        "2:59 such a beautiful hook.",
        "Deji could have won but he figured ultra instinct is unfair. . .",
        "is tank Davis going to start round 2",
        "Ref kinda stopped it too early",
        "Floyd told his homies bet knock out on the 6 because Deji will be easy pickings tired. Floyd went all out on the 6th and the ref seems to be the same guy that always refs for floyd",
        "Wonder what ksi thinks of this fight",
        "somebody please tell me why this 'fight' even was sanctioned (besides a floyd money grab)....floyds so masterful at his craft this was just a joke",
        "Funny how Deji was actively trying and Floyd was just trolling tf out of him. I can't believe people actually think Deji has a chance against Logan ",
        "Probably the second most he has ever been hit",
        "Skip should’ve let Floyd turn up a little bit longer honestlyyy he was having too much fun out there atleast let him t up for 10 more seconds then call a tko",
        "Boxing  is now  the new Wrestling Act lol",
        "Mom was crying in the corner ",
        "All ya in the comments sayin he spared Floyd is delusional",
        "I have sleeping problems and this had me snoring loud asf in the first round! Thanks DAZN!",
        "What a joke..",
        "If you’ve ever sparred your trainer you know how deji feels",
        "Deji just needed to put it in him more. He thinks way to slow",
        "What's the point of this?",
        "This must of been a tribute to Jerry Lewis.",
        "Im not sure this type of new entertainment suits me. Floyd always been my favorite...but when he was actually boxing. This is more monkey business...we can still see that Floyd is on another level. I wish Dej would of  opened the machine and let go punches.",
        "Floyd is like an untouchable kung fu master, but in real life.",
        "That was a terrible fight Floyd just mocked him the whole time. Why would he vs someone so bad lol",
        "You all that paid..........got a real nail bitter here, wa wa wee wow.",
        "Goes to show you that when YouTube boxers are sized up officially in weight classes against top class boxers they cannot compete",
        "Never thought I would see the day this match would ever happen",
        "This was tragic.  As if anyone pays money to see this.  I’m no boxer. And I couldn’t do better.  But haway man. Exhibition or not.  pathetic",
        "Honestly deji hasnt gotten any better",
        "What a waste of time and boxing fans money . This is a total joke",
        "That is the most embarrassing fight ever",
        "Why tf did bro agree to that got bullied in front of thousands",
        "Not even on the same platform",
        "Idk who thought this was an entertaining match",
        "Even watching the highlights was a waste of time",
        "I remember when my older brother used to take it ez on me with sockem boppers back in the day. Floyd was having a ton of fun schooling Deji lol.",
        "Deji getting a lesson and Floyd getting a check",
        "Great stoppage!",
        "Imagine paying for this",
        "Lol Floyd fight every week now days….",
        "I know deji was embarrassed after his mom was yelling stop like he was on the brink of death  that was the first real combo all night ",
        "Can i fight next?",
        "So fascinating to see one of the all-time greats step in the ring with Floyd Mayweather",
        "Look at all these deji meat riders in the chat Deji would not of won  Floyd was playing wit him",
        "Dot.",
        "People pay to see floyd clown. Amazing",
        "WWE FIGHT ",
        "Hearing Wade's voice in an official Mayweather fight is so cool. Wade's the goat",
        "The amount Deji respects Floyd is insane. Even with the hands down & no defense deji isn’t swinging recklessly.",
        "For floyd.. when you start new game + with all your attributes and gear on and enemies are low level",
        "For those who didnt notice Floyd is 4 decades old now, so you can tell that he was feelin dejis punches (the few, the proud) deji showed a lot of defense but lacked just a bit of aggression. But then again Floyd is Floyd so its understandable I guess.",
        "Floyd was holding back and just having fun. he wanted to show the kid who’s boss but clearly didn’t want to hurt him.  Deji showed some maturity. He could have gone in with a hot head but he stood his ground against one of the greats and ended the fight ten toes down. ",
        "Mayweather vs a punching bag would’ve been more entertaining",
        "Props to Deji for not throwing any punches, he was simply sparing Floyd’s life",
        "boring",
        "No idea this happend",
        "Deji knew what he was getting into but fair play for him to do it when all these other youtubers won't even go near a real boxer so fair play",
        "“That was a bit early” \nLiterally is not a fighter in an EXHIBITION against the greatest fighter of this decade",
        "Floyd was looking after Deji",
        "Shame on Mayweather. Can't believe he fought to an inexperienced deji.. find your own size then celebrate.",
        "Commentator-'he dancing, this is floyd having a ball\"\nRest of the world- nah mans just getting paid",
        "there just having fun with a light sparring *ahem i mean pro boxing match"
    ],
    "comments_disabled": false
}