{"video_id": "QEGKBYYwTmM", "comments": ["If you’ve ever sparred your trainer you know how deji feels", "Props to Deji for not throwing any punches, he was simply sparing Floyd’s life", "Floyd was ready for a fight but after the first few seconds with deji; seeing him flinch, back up, and close up a lot, he relaxed and decided to entertain more than fight.", "I was laughing the entire time. Floyd was absolutely toying with Deji, bro was dancing cuz he knew he was getting the bag for doing nothing", "Deji such a humble guy, he didn't wanna embarrass Mayweather so he let him win and only gave him a black eye, what a guy.", "respect to Floyd for not knocking Deji out cold in the first round in front of his family and young fans.", "This technically was the longest deji has lasted during a fight  We’ve never seen him last 6 rounds", "Big respect to Deji for letting his student use him as a punching bag. ", "I can’t imagine how terrifying this match is from Deji’s pov.", "It never ceases to amaze me how Floyd looks like he's doing a little but is actually doing alot!", "I couldn’t fall back asleep this morning. This fight definitely helped.", "Big respect for the master boxer to stay humble and let the little guy gain experience. Deji letting Floyd win for his confidence is ", "Huge props to Deji for putting over young talent like Floyd. He knew it was an exhibition and really didn't stand to lose his undefeated streak!", "You can tell the experience Floyd has against deji. He could've ended it at any round he wanted.", "Floyd toying with Deji is the most hilarious thing ever ", "I’m proud of Deji for stepping in the ring with him and I’m sure he enjoyed the opportunity, I hope he learned from the fight and he must be so happy that he got to fight such a legend even though he obviously couldn’t win, but none of us could so props to him", "I actually can’t believe deji here he understands how his power could hurt such an old man so he held back the entire fight and let the old man hit a few weak shots here and there to keep him happy and entertained he’s such a nice and humble guy much love and respect to you deji I’ve watched you for years", "Floyd was holding back and just having fun. he wanted to show the kid who’s boss but clearly didn’t want to hurt him.  Deji showed some maturity. He could have gone in with a hot head but he stood his ground against one of the greats and ended the fight ten toes down. ", "Deji is such a nice guy for giving Floyd the win, such a humble man", "This looked like a Father showing his son the Ropes at age 18", "Floyd had to set a reminder in his phone about this fight", "I like how Deji took it easy for Floyd. Huge Respect.", "Floyd got humbled this match, after he realised Deji was holding in his power in order to preserve his record. Floyd now knows not to mess with the GOAT of all boxing", "8:00 spared that man’s LIFE ", "imagine paying 20 dollars for a ppv to watch a sparring match and then the fight gets released just hours later.", "This technically was the longest deji has lasted during a fight ...We’ve never seen him last 6 rounds... ", "This has the same feel as when a dad has his kid or nephew in the ring just kinda letting them get a feel for it.. and occasionally letting them know what's up", "The ref was like just stop at this point go home bruh", "Props to Mayweather to having the courage and even beating one of the best or the best boxer of all time in an exhibition match!!", "It's crazy to see hpw quick Floyd's reflexes are at 45.  Usually in boxing, your speed, reflexes and timing are first to go with power being the last thing they have at his age.  I know deji and Logan paul are youtubers, but they are men half his age, naturally bigger, and in their physical prime but Floyd's speed and timing is still what separates him from them.", "How crazy this is, I’m envious, Floyd gets to learn a lesson from the GOAT in a lil ole game I like to call boxing", "Floyd was trying to make deji last as long as he could!!", "I love seeing Floyd just out here having fun stacking it up!", "Bro this was a close fight had me on the edge of my seat", "Always a pleasure to watch the elite fighters even in their retirement. Thanks mms mayweather", "Deji getting a lesson and Floyd getting a check", "Never thought I would see the day this match would ever happen", "i was thinking like imagine floyd kept messing around and deji just lays him out that would’ve been bad", "I just love seeing Floyd Mayweather have fun and he was definitely having a blast in this one! That dance he did was hilarious! ", "Of course Deji was never gonna win, the chance was almost non existent. But props to Deji for doing what most have never done by given Floyd a shiner on his eye and making him bleed. You rarely see that. Especially in an exhibition. Regardless of the loss it’s a win win for Deji. He gained valuable experience, and he’s gonna have plenty more experience in his fights going forward now.", "He's gonna learn a lot from this. Imagine you had 6 rounds with one of the best boxers ever ?", "At the end of his career he can say he was beaten by two of the greats, Floyd Mayweather and Vinnie Hacker.", "It'd be weird if Deji thought he was in a real fight.", "For those who didn’t notice… Floyd is 4 decades old now, so you can tell that he was feelin deji’s punches (the few, the proud) deji showed a lot of defense but lacked just a bit of aggression. But then again Floyd is Floyd so it’s understandable I guess.", "Deji before the fight basically even state that he knew he was going to get outboxed and that he stood no chance against Floyd, and that the whole reason he took this fight was to gain experience. The problem is, this was so much of a one-sided beatdown, that Deji pretty much gained nothing, and this was pretty much a big waste of everyone's time.", "That wasn’t a fight that was just a trainer teaching his student nicely", "Mad respect for a “YouTube boxer” with the balls to face floyd", "Deji - the fight for his life \nMayweather - a lite Sunday spar session", "Imagine if Deji gave just a tad bit pressure…man Floyd would’ve gone night night!", "so sad i didn’t know deji was even sick, anyone know how much time he has left? kind of think it’s odd make a wish allowed him to fight mayweather instead of just meeting him", "A crazy thing is that mayweathers dad came to my uncles boxing training. I was there to see him too.\n\nEdit: it cost like 600 pound an hour", "Floyd at the end was like \"These fools keep paying me for fighting these kids, ez money\"", "Floyd is really a talented boxer , he makes it look so easy", "Floyd’s lucky Deji was able to hold back his power well, if he didn’t the universe would’ve been erased.", "Floyd is like an untouchable kung fu master, but in real life.", "Obviously I didn't expect anything from this but it's just so wholesome too see a professional like deji show someone like floyd the ropes, on a serious note lol its really cool too see and its a dream for deji yk", "It's crazy how Floyd could've gotten sturdy during this bro", "As long as it keeps the kids out of trouble I’m here for it DAZN! Well done", "I love how everyone remembered the last random roles and thought you were doing the same plan. Well you work you just did it in a different way!", "This was actually somewhat wholesome, Floyd knew he was fighting an amateur boxer, but he held back at times and then unleashed a little during certain stages. Just to keep the youngster humble. I'm sure if Floyd wanted to, he could easily knock deji out in the first round. But he entertained the crowd", "Honestly even if deji lost Mayweather gots the years to back him up and is using this fight to teach deji which is truly amazing", "One of the best things is that he never takes credit for himself when he achieves something. He always respect us, the audience, and his team, and he is always polite in all of his videos. We congratulate ourselves on this achievement. More to come and everything to come :o", "“I’m quite worried for deji”", "Floyd is Just Phenomenal , The Best of our Generation .", "Best bit when he pushed ref out the way", "Deji knew he had too much power for Floyd and didn’t want to end his life so he spared him. Big ups to deji ", "His mom yelling \"STAAP! STAAP!\" Was pretty funny ngl", "The Feint master on that night.  Congrats on the KO Floyd and thanks for the entertainment", "Floyd showed a lot of respect in this he had no beef with deji and really was just showing him and teaching him rather than going crazy. That’s love fr and deji did great held his own even though he was shaking but your going against one of the greatest so understandable. Floyd just trying to give the crowd a show and let deji get some experience watching him move and when he taunts him a little it’s when deji is usually slightly out of range so I hope he noticed Floyd’s standing and the way he’s prepared to move out of the line of punches rather than blocking.", "Floyd ain’t have to put it on him like that ", "Deji never unleashed on Floyd what a sweet heart ️ ", "It's like watching someone's dad play fighting with their 10 year old son", "Floyd went into this match like a Harlem Globetrotter. He was playing around with him and entertaining the crowd. Deji was putting his all in. Floyd gave 10% of his ability.", "4:45 Floyd could have absolutely merked him, he was looking at the opportunity too ", "imagine these guys being friends during the western times :(", "This was a wholesome match.", "Floyd looked super old in the early rounds, but piled on the pressure later on.", "Love how deji went from loosing everything, to winning one fight and then randomly fights mayweather acting like there is a chance he wins", "I don’t think anyone wants to fight Deji now because they don’t  really want to get embarrassed by him ", "Props to Deji for being humble abd giving Floyd the W.", "Father play sparring with his son, this was wholesome.", "Power with no experience vs power with experience is 2 different things, \nIt looked like Deji was a little nervous although he was the bigger/heavier not to mention the slower man as well,\nhe didn’t use his advantages to close the Gap at least. But Floyd, as the Defensive, sharper, Slicker & Quicker Boxer, it still wouldn’t have ended well for deji but Respect for deji stepping in the ring with one of the all time Greats of boxing even though this was just an exhibition, Floyd still knows how to put on a show", "Greatest boxer ever has to be giving these guys these fights and a payday can finish whenever he wants just world class", "Out of all Floyd's opponents, none have given him such a stage to put on a performance of this calibre Weji's in the chat ", "Regardless of deji losing this was a interesting fight props to deji for stepping in the ring against Mayweather big dubs for both of them", "If Floyd's last 2 fights including this one counted he would be 52-0 right now, they should've counted those fights", "I remember when my older brother used to take it ez on me with sockem boppers back in the day. Floyd was having a ton of fun schooling Deji lol.", "This is literally when you’re a level 1 in a game and fight the final boss in a game", "Watching Floyd in this fight is like watching Roy Jones", "What a humble guy, at any time deji could've tried", "Deji skipped straight to the boss fight lol, it looked like a fun time", "‘Its a bit early’ was an understatement", "I mean Floyd coulda been cornered him like that way earlier in the first round.. He was just toying with him... Props to Deji.. He'll have a story to tell his grandkids.. ", "Big props for another pay day for Floyd.  Not much else to say. Thats all this is.", "Mastery. I can’t say much else. The guy’s skill, reflexes and technique are embedded in his dna at this point.", "I was laughing the entire time. Deji was absolutely toying with Floyd.", "I know this isnt going to happen but after watching this fight I think the inner boxing fan in everyone wants to see Mayweather vs Lomachenko.", "If that was me fighting Floyd I’ll be like GO GET THE GUUUUNNNNN!!!", "i give so much respect for deji for trying and never giving up", "Now this is a nice, clean exhibition bout.  Floyd is not really trying to hurt the young man... Yeah hes showing him up a little bit  but all in all.... This is clean"]}