{"video_id": "QfIY1r0_tRI", "comments": ["Soooooo goooooooooooooooood", "bibi demostrando ser una gran actriz y cantante, Bibi es perfecta", "Aún no sé qué dice la canción, pero el video me mostró empoderamiento femenino... no dejarnos pasar a llevar por los hombres  ME ENCANTÓ ", "Bibi no puede sacar una canción mala? Literal cada vez me impresiona el poder de nunca sacar una canción mala ni mediocre. BIBI GOD", "Esta mujer no decepciona NUNCA, es increíble. Cómo me tatúo un MV?", "Ive been a BIBIBullet since BIBI just debuted in 2019 and this journey has been awesome, so many different concepts and sounds, she never misses, every release is a bop and the visuals are always amazing. Stanning her was one of the best things I've done , and thank you to her company Feel Ghood Music for always trusting her vision and facilitating her work", "she really had her intrusive thoughts and turned it to an album and I LOVE IT", "Não existem palavras que descrevam a BIBI como ela merece!!", "I love how she isn’t afraid to call out and use themes that are quite rated in SK.", "Desde que descubrí a Bibi esta mujer me impresiona cada vez más ", "The lyrics. The voice. The music. The story. Dance moves. Everything is perfection", "Amo como Bibi se muestra como una jefa de todo y todos, simplemente los conceptos que muestra en sus canciones amo y esto no es la excepción, Bibi mi mujer ", "Es la primera canción que escucho de ella y me fascinó todo, los outfits, el MV, la canción, la historia. Este MV es una obra de arte.", "이미 글로벌한 팬덤을 구축한 비비님의 활발한 음악활동을 항상 응원 합니다! 대중성에 연연하지 않고 늘 하고싶은 음악을 하시길 바랍니다\n신곡 나올때 마다 늘 즐겁게 잘 듣고 있어요", "BIBI is amazing! She made her album like a movie soundtrack. The character Geum-ji who \"works in the black market, first to stay alive, then as a living, and later to win the affection of her boss. But people feel threatened by her and she thinks she doesn’t deserve love...she ends up doing so many bad things that she can’t return to a world of good and everyone in her world is already afraid of her, so there’s no one left to love her. So she feels lonely.\" - from weverse magazine interview with BIBI.", "노래 진짜 스트레스 풀림.. 중독성까지\n독기넘치는 노래에 연기, 댄서들까지 다 멋있네", "I always get chills from BIBI's facial expressions! They are so fierce and powerful~~ She's such a cool and fresh breeze (or more like a hurricane) that keeps giving insane bops over and over. Love her so much <3", "I’m living for this film she’s given us with this album. The visuals with the vocals and beats is perfection.", "Me encanta el hecho de que tenga coreografía y de que BIBI baile. Además, el ritmo es bueno.", "no one is doing it like you, BIBI, this is a masterpiece!", "cada vez mais difícil explicar o quão incrível a BIBI é", "El reggaetón con el mejor concepto y mensaje que he visto, definitivamente hoy empiezo a stanear a Bibi, qué talentosa, una Diosa en vdd", "Эта женщина - Богиня!\nА танцоры вообще огонь", "Amo a Bibi es una reina, está canción tiene un gran instrumental y ella se lució", "The album speaks the reality of our society rn. I love how her songs sent out empowering messages like these. She has evolved so much as an artist, love that for her. Keep going, BIBI!", "Necesito a bibi como  actriz es demasiado buena!!", "She is literally slayed", "Cara ela merece mais do que ela já tem pois ela realmente é um artista", "Her expressions, her acting, her voice, visuals, cinematography, concept every dammn thing captivated me the moment I saw this video.... I'm now a Bibi fan", "она настолько великолепна, что словами не передать.", "Es que yo sabía que Bibi nunca decepcionaaa. Tremenda mi mujer", "GIRL THIS IS AN ABSOLUTE MASTERPIECE\nFROM THE CINEMATOGRAPHY TO THE EMPOWERING LYRICS TO THE BADDIE VIBE \nIT ALL IS AMAZING ", "Amo a este mujeron, OMG esa actuación porque no está actuando en dramas??? Si es un excelente  actriz de lo que se están perdiendo  PD's. Excelente  canción!!!!", "음악성, 안무, 역시!!! 그리고 넘사벽 가사, 멋지네요", "Esse mv é simplesmente incrível, sinceramente", "ESTA CANCIÓN ES ESTUPENDA, INCREÍBLE, BIBI TE AMO, TUS CANCIONES SON LO MEJOR", "она однозначно достойна большего , это шедевр ", "BIBI is breaking boundaries with her music and absolutely killing it and the fact her label is allowing her all this freedom is really cool I think Jessi needs to sign with them lol", "WEON TREMENDA CANCIÓN, BIBI ES UNA REINA", "я люблю биби. каждое её творение - настоящее искусство. благодарю за подаренные эмоции!♡", "비비 아니면 누가 이런 곡 만들어? 비비 아니면 누가 이런 뮤비 찍어? 비비 아니면 누가 이런 퍼포먼스 가능해? 비비라서 가능한 모든 작업 결과물들… 어떤 특정 이념이 있는 건 아니지만 늘 직설적이고 거침 없이 예쁘지 않을 것은 표현하는 것이 너무 더럽게 아름답다 그리고 이번 앨범으로 우먼스 느와르 컨셉이 비비의 시그니처 중 하나가 되어버렸다! 사랑해요! 비비🫶", "Nunca decepciona BIBI", "estoy TAN ENAMORADA que las palabras no son suficientes. Lo que amo a esta mujer no tiene explicación, me tiene completamente embobada, admirada y fascinada AAAAAAAAAAAAAAAAAAAAAAAAAAAAAa no puede ser tan tan talentosa. NECESITO verla actuando", "Simplesmente viciada nessa musica", "ella nunca decepciona ", "MEU DEUS QUE PERFEEIIÇAAAAO!!! A BIBI ESTAR EM OUTRO NIIVEL MANO!! Que vídeo clipe impecável, eu estou sem palavras simplesmente não a palavras para descrever tanta perfeição em um só MV, é tudo tão FODA! Visual, voz, atuação... E meus amores o que FOOII IIIISSO POR FAVOR ALGUÉM DA UM PRÊMIO PRA ESSA MULHER! Os espaços também são muito legais, eu ainda estou com a música na cabeça kkkk eu quero escutar ela toda hora kkkkk tá muito boa, eu tenho que dar meus sinceros parabéns para todos que ajudaram e participaram do MV, graças ao trabalho duro de todos vocês hoje podemos ver esse MV impecável, muito obrigado pessoal vocês mandaram muito bem estar tudo incrível, maravilhoso, lindo, lindo, lindo. Obrigada por sempre conseguir me surpreender kkkk. BIBI eu te amo, te amo MUUITO!! ", "Bibi y sus videos nunca decepcionan. POR FAVOR denle el reconocimiento que merece.", "Это просто невероятная песня!! А клип это вообще нечто, как фильм посмотрела. Просто бомба!!!", "A BIBI nunca decepciona  simplesmente perfeita ", "ESSA MULHER É A REVOLUÇÃO!!!", "Bibi mi diosa llego a reinar el reguetón en corea con este temazo!! Te amo bibiiii", "Nunca me esperé una base de Reguetón, dios como amo a esta mujer", "Temazo sin duda no la pararé de cantar", "Una canción totalmente distintas a las demás, nunca me imagine este ritmo, me encanto!", "A bibi é única, tudo que faz é uma obra prima. Artista completa!", "КРАСАВИЦЫ!\nШЕДЕВРАЛЬНО!!\nМОЛОДЦЫ ДЕВОЧКИ, ТАК ДЕРЖАТЬ!!! ", "Essa mulher não cansa de ser foda ", "Bibi es realmente talentosa es una reina vale la pena stanearla la amooo", "I’m sorry but that’s pure ART I know many groups had fantastic comebacks, BUT THIS?? Guys I can’t stop listening and watching ", "BIBI delivered on every level. 멋지다!", "Ahora Bibi es capaz de hacer una fusión con el género urbano sin que suene tan mal como los artistas latinos. Bibi está a otro nivel.", "Éste vídeo me acaba de salir en sugerencias, jamás había oído ni visto nada de ella pero me he quedado tan sorprendida, me enganchó en un instante y me atrevo a decir que con tan sólo éste mv ya me tiene para seguirla staneando", "She never fails to leave us with goosebumps ", "BIBI VOCÊ É PERFEITA DEMAIS", "Necesito a Bibi actuando, se le da muy bien!", "wooo esta  canción además de transmitir poder.....  me suena a música latina  ME ENCANTA", "The visuals the choreo the vocals the music the lyrics the story line the outfit the acting the confident the concept everything is perfect much more than was expected from BIBI", "NECESITO QUE LO HAGAN MAS VIRAL HAGAN CHALLENGE BIBI TE AMO DIOS ME ENCANTA QUE ADICTIVO AMO AMO TODOOO DIOSAAAA", "I will never be tired of saying how much I love and adore BIBI's creativity and talent. She is such a unique star & I hope more and more people will support her music career. ", "예술이네요.. 비비만 할 수 있는 장르, 뮤비 노래 안무.. 다 완벽...", "essa mulher é simplesmente perfeita", "BIBI HIZO REGGEATON ME MUERO WOW\nqué icónica por dios la amo", "Wooow estoy sin palabras!!! Por Dios que clase de obra maestra es estaaa!!!", "BiBi does it again. I love her artistry", "Dios la amo tanto \nSiempre reina ", "Это лучшее, что я видела за этот месяц. Я в восторге всё идеально. Взгляд это отдельное тема... Это бешеная харизма, просто невероятна. Спасибо за прекрасный камбэк!!!", "we seriously need bibi on a drama or movie bcs she rly good at acting omg", "Esta canción necesita más vistas, sigan reproducciendo. BIBI la N°1", "ORGULHOOOO", "Te amo BIBI, eres lo mejor que le pudo pasar a mi vida.", "You don't know how much i love Bibi, her songs are incredible and shows the problems of reality....", "wow her facial expressions, they are insane. She's good. Bibi never fails to disappoint, all her releases are bops", "It literally shows what Bibi can do and how depicts herself in the K pop industry. Noir is hers, I'd love to see the next scene!", "Боже она великолепна, просто лучшая, я в слезах♡я на коленях ", "This song sounds so good. Our ears have been blessed", "Mi artista favorita de ahora en mas, SOS ORO PURO <3 <3", "BIBI ES UNA INCREIBLE ACTORA", "Meu Deus???? Eu nem pisquei assistindo isso!!!! Ficou incrivel, tô real hipnotizado.", "Todo la discografía de Bibi es arte  ella nunca decepciona ", "моя девочка, усердно работала два года, не спала до рассвета, делая этот альбом^^ я надеюсь, что её старания окупятся!! файтин", "Esto si que es canción.", "Eu só queria que vc tivesse mais  reconhecimento serio", "WOW...BIBI is really a multi talented queen and suchhh an amazing artist <3", "okay, i'm crying of pure joy, Bibi is a amazing singer, a high level rapper, and made this song and awesome MV SUPER GIRL POWER that i have never seen before in Kpop. the world may be not read to contemplate her power but i hope she gets all the highlight she deserves!!!", "BIBI es tan talentosa, que orgullo me da stanearla", "BIBI ate and left no crumbs no plate no table\nShe's such a good performer and singer omg I thought I saw a tiger in her look! I love her sm! What a day to love women", "Your songs are always masterpieces ", "Uma verdadeira obra de arte", "This is too GOOD \nMore people need to notice her and her music.", "Te amo Bibi como siempre nos das puro arte ••"]}