{"video_id": "qtjTtDXjMIE", "comments": ["mmmm air marinade! my favorite!", "Etho leaving Cooking With Etho was the saddest announcement just glad there was no bad blood between him and the producers", "8:28 In all my years of watching Etho, Ive never seen him panic as much as he did here. Gave me a fright by the loudness of his voice, and laughed afterwards", "Etho really is a drop everything and watch kinda guy", "It just me or does Etho sound like he's holding back laughter the whole video? Sounds like he was really having a great time playing!", "23:10 Wow those turtles deciding to hatch really got us an extra 6 minutes of Etho. Nice!", "0:58\nMe: Mom, can we have Cooking with Etho\nMom: We have Cooking with Etho at home", "These star wipes are adding so much production value! I'm so proud of etho for learning how to edit videos like a professional :P", "Being an adult is hard until an Etho video drops, then I can grab my snacks and relax.", "Etho! You don't gotta glue the chassis together, you only have to glue the face of it if you wanted to attach another block that wasnt a chassis. You can also super glue normal blocks together and they will all move as one structure", "Mr. sLab\nHave been watching for years and never took the time to thank you for everything. Your most recent world tour has become a comfort video for me, seeing everywhere we have been through the years, and every upload still warrants an instant click to this day. ", "The transitions for the cooking show was amazing. I rewatched it three times because it was so funny.", "Etho constantly getting bugged by the Goblin trader while working gives me full on Taxes vibes it's great! Plus we get so many star wipes?? Today is a wonderful day.\nI gotta say...Etho's choice on mods is imppecable. The world is so pretty, and full of life and little sweet surprises. I feel so attached to this world now even though we are only 9 episodes in.", "\"I did not get fired. I left the show, yes, but it was my own choice. I talked to my boss about it, and after a little bit of encouragement from him, I decided it is time to pursue other things in my life.\" \n\nWell done, Mr. Slab.", "Nothing says “Today is a good day” like Etho dropping an episode", "My favorite series right now! Thanks etho!", "I literally just found you a month or two ago and god, you are a 10/10. I hope you'll always have fun playing minecraft!", "Etho's modded series' are such a breath of fresh air for me, honestly the wait between episodes might just make me appreciate them more!", "I sometimes wish cooking was as easy as Etho makes it look", "Hey Etho! I'm sure you'll hear this form a ton of comments, but if you scroll wheel on the cart assembler's little white square, you can make it so the cart always keeps facing the same direction (i.e. north) even if the cart itself rotates!", "Etho, the comedy genius. Had me laughing pretty good with the \"Cooking With Etho: Home Edition\" episode.", "What a strange little green thing. Must be hard working with Bdubs around", "That tunnel borer is pretty darn sick.  Create really is one of the best mods to come out of Minecraft, it fits so well into the Minecraft design.\n\nIt makes me want to get back into my modded world I started at the same time Etho did.  I was meaning to stay roughly on pace with him but I think he pulled ahead, haha.", "I was hoping this was gonna be a modded episode… I was not disappointed", "Seeing that Etho posted a video has put a smile on my face.\n\nEdit:  If the contraption runs out of storage, it litters the ground with the over-flow.", "Etho trying to get the minecart to unload the drill was more funny than I thought it would have been", "Flyboys was so much fun!! It would be hilarious to see that again with Bdubs and the gang, and maybe more hermit craft members too!!", "The King has returned. \n\nActually he never went away. He's always been here with us. ", "Etho, the star swipes on the home cooking show really added the perfect flavor, maybe in the future we could have add a laughing track and remastered intro theme! Always love to see your videos. You are a talented entertainer!", "This episode made me so happy :) the little goblin and Cooking With Etho moments made me giggle so much! xD \nYou're a blessing! thank you for being such a ray of sunshine that brightens our lives ", "the experimentation with that minecart drill is so amazing. absolutely makes me nostalgic for his older modded series and the problem solving he did with those", "Cooking With Etho. The star transition. Minecart shenanigans. A mention of Crash Landing, Fly Boys, and HermitQuest. So much nostalgia at once!", "I wonder if it's possible to program the train to build a two-high barrier after it goes across a cavern to block potential mobs? It'd be neat if it could... Also, if you're reading this Etho, do you like trying new dishes? If so, what was the last new dish you tried to make, and how did it turn out?", "I've been waiting for what feels like years for this to come back . I nearly screamed when I saw it you don't know how happy I was to to see Ethos little turtle helmet .", "I think it would be entertaining to watch Etho react to old Etho videos every one in a while", "Been a while since we got a new Etho video, but his intro to this video was just so infectious with his positivity that it improved my night after working an extra couple hours at my job. Although, his head shaking without the camera moving really caught me off guard.", "Hey Etho. Been rewatching your ARK series, actually gotten me back into playing it again! Loved that series you did, it’s like my fourth time watching it. Can’t believe your ARK series is over seven years old. Will definitely watch Valhalla Pvp series after I’m finished with this one. Will you return to the Arconauts server some day? Been watching you for over 10 years! From primary school to university! Still loving every single one of your videos! Thank you! You are my hero!", "The star shaped transitions caught me so off guard I love them", "I’m so happy to see this series alive. Pls Etho we need more", "I'm so here for this. This is what I've been waiting for; someone with your creativeness showing me what's possible with create/mods. Now I know you're busy with a lot of projects, but I just want to say this series is one of the best.", "I'll never not smile at Etho's voice :)", "You have no idea how happy it made me when you sang the Cooking With Etho theme… the memories ️", "Every day Etho uploads a video is a good day :D", "Nice to see the star transition and Cooking with Etho come back", "The contraption saving your life on its first succesful test was poetic", "I recently watched the episode in his let’s play series where he switched to davinci resolve and showed off all the wipe effects. It’s so cool to see him still using it after all these years", "Cooking With Etho brings back so much nostalgia. I still remember when the joke about onions started.", "Lots of Etho screams this episode. I love it ", "I like how Etho likes to experiment with new items and recipes in Minecraft. He just goes all out and works out how he wants to use them. I suppose that’s why his channel is called Ethoslab. He isn’t a crazy scientist like Zedaph but it would be interesting to see what these two would make together.", "Etho sounded happy and excited the whole video, that just gave me the positive energy i needed for today", "I'm so glad Ethos is finally discovering just how powerful the Create mod is. Can't wait to see him use it in future modpacks with the recent train update :)", "been stressed out all morning. this just made it haha, thanks for bringing those chill vibes and funnys!! I hope everything is going well for you Etho, seems like we're all under a lot of stress right now", "29:15 Oh how I would love another Flyboys! That series was so fun to watch", "Always a good day when we get an episode of Cooking with Etho!\nI am still loving the star wipe transitions!", "Food just arrived and a new Etho video? Perfect distraction from the cold outside", "I love this series. I wish you would do a long episode every so often, just to let us sit back and see how you play. Or maybe an unedited channel? upload your raw stuff?", "I have never been this excited for a serie. I love the ideas you have for Create contraptions and cant wait to see how you are going to use them.", "Loved seeing both the fun editing and Cooking with Etho making a return! Great episode as always!", "Etho, my day was really bad, I saw your upload while working and almost forgot it. When I did get to watching it just now, I feel a lot better, thanks for being a fun person, really brightened my day.", "Silver lining on forgetting what you’ve done and watching your old series without remembering what happens is that you get to enjoy the watching experience as much as we did the first time around.", "This video came at the perfect time, ty Etho!", "my etho episodes bring me happiness every episode since highschool... 10years ago", "My favorite childhood YouTuber. Only Minecraft at age 22 I genuinely enjoy to watch. I’ll never get sick of your videos Etho. I love the series!", "Wow, I really appreciate the extra time! I know it was probably mainly due to you really wanting to get to the turtle boat, but man, those extra minutes were fun! Thanks again for another great video, Etho!", "I have never heard Etho panic like he did today lol, I literally re-winded it to make sure it actually happened. Love what your doing Etho", "Love this series etho, good to see it again!", "Cooking with Etho was a cinematic masterpiece", "Proud of being part of a very loyal fanbase for Etho", "Etho videos always come when you need them. I’m feeling pretty poorly, and I loved a chance to escape into Etho’s modded world!", "Such a fun episode, couldn't wait to watch it once I got the notification. Hope if you've gotten hit by snow, it's been manageable.  Thanks for everything, Etho!", "etho you always post a video when i need it the most. you’re videos are literally my therapy and i appreciate them so much. thank you", "Way too late for you to see, but after a long day at work it really does bring me so much joy to see that you posted a video after I get home from work and finally lay down for the day. I hope you’re doing well my guy, thank you for giving me relief and a smile at the end of a long day.", "you should check out what bdubs is doing with the create mod recently, pretty cool stuff", "Etho, you should show all the edit cuts and takes as a bonus, at the end of the video.I'm sure so many of us would love that! Keep enjoying the videos you make, like we do!", "Thank you Etho! You don't know it, but your videos have helped me through some rough times over the years! I am truly grateful! Wish you the best!", "Hooray! I love this series! Thanks for another episode Etho!", "I was already having a great day and etho turns it into a fantastic day. Absolutely loved that intro!", "I love this series so much, Etho! I feel like I'm actually learning these mods with you whereas I get so lost watching other people's modded series", "There is earlygame, midgame, lategame ... and then there is etho", "So happy there is another Modded Episode, aboslutely love these. Love the idea of the self mining train, keep up the great work.", "I really wish I can watch this series more than once every two months lol.", "I love this series, but it's a shame it probably means we won't see Etho helping out Tango and co on their create project", "I love the star wipe, always a joy to see.", "This series is so chill! Absolutely loving it ️", "Excited to watch this video! Love your videos etho!", "Oh man that episode was super fun. Always love to see it. Thanks Etho!", "Etho I hope you show more of you just exploring all the new biomes and caves and locations in this world! I'd like to see what kinds of unique sights this modpack has to offer.", "Its so cool to watch Ergo go through the same trails and tribulations I went through!", "Cooking with Etho!!!!! Thanks for this, Etho!  I've got a huge grin on my face even as I'm fighting the flu", "Great stuff as always, Etho. I've had a long stressful day, so I'm glad to be able to sit down and enjoy one of your videos. Keep up the amazing work!", "I normally watch Minecraft to relax and unwind but when Etho posts I get super excited!", "A new episode of Etho makes a great week!!", "Seeing that Etho posted a video has put a smile on my face. Edit: If the contraption runs out of storage, it litters the ground with the over-flow.", "Woohoo new Etho video. Definitely made my day seeing this. Thanks as always for the fun videos! <3", "Love this series etho! Always a blessing to show up with snacks!", "Loving this series- keep experimenting with Create, there’s so many fun components. Smart chutes are a HUGE upgrade to hoppers- they can extract 64 items in the time hoppers can extract 2 or 3 :)", "Having a chef unlock the \"Sizzling Hot\" achievement is like having a heart surgeon unlock the \"Butterfinger!\" achievement", "yayyy so glad this is back! one of my favorite series rn =)", "Nice episode. Can’t wait for the next one in a few months!", "Cooking with Etho is back on the menu guys!"]}