{
    "video_id": "qtjTtDXjMIE",
    "comments": [
        "Man etho, what a bore-ing episode! Okay pun aside im glad to see this series back and I'm also intrigued to see how you handle recalling the tunnel bore to dock it for resources. It also gives me ideas for create, because I really want to try that mod but its always so daunting.",
        "I've been looking at all the other minecraft youtubers and its fuckin crazy that Etho is one of the few that still has a HUGE loyal fanbase. Lile VintageBeef's view count is terrible c ok considering he has almost 2 mil subs also I'm fairly certain he had over 2 mil earlier this year not sure though. Just goes to show not asking for likes Nd subs gets you farther down the road cuz ppl are gunna watch and sub to ur channel if they enjoy it. Personally Etho is the only MC youtuber I watch anymore and I'll keep supporting him for as long as he uploads for",
        "whenever i watch modded videos from Etho i remember his sky islands. oh, the times...",
        "Comment for support!",
        "I like how he just ignored the question about what’s the difference between a skillet and a frying pan",
        "I noticed the super glue is the older version of the Create mod which works a whole lot differently (now it uses a box pattern like world edit instead of placing single glue spots). If I remember correctly, each glue you place on a block acts as an entity and can cause lag when you use a lot of this glue! It is best to use mostly chassis that auto connect to each other without glue.",
        "Seeing you play with create and then seeing tango and co playing with create is so confusing because they are on the newer version.",
        "You could make it place a three wide cobblestone path or if possible make it place the entire 3 by 3 tunnel. This way it will be safer and you will use more cobblestone and have more room for other stuff in the storage.",
        "EPIC",
        "Hey Etho, glad to see you back on modded MC.\n\nJust wanted to say that you don't need to superglue everything in create mod. I believe you only need to glue drills, saws and chests because the structure itself is bound together. You can hold a wrench to see and adjust how many blocks are connected (by default it's 8).",
        "man etho always make even the best of days better",
        "Snack Streak 13: Not a snack but dinner, rotisserie chicken yum.\nCant believe we get the star from Cooking with Etho!!",
        "I love Etho!! <3",
        "Had a feeling it was going to drop today :D Delighted to actually see a youtuber use chassis blocks.",
        "Etho can we get a new version of the dusty dinner as a call back? Maybe something for enchanting like the dusty library?",
        "Those star swipes at the beginning are amazing",
        "If my math is correct, the train should be able to go 1152 blocks in one direction before it fills up with 6 barrels on it.",
        "of course etho wants the boat",
        "Can't forget my snacks",
        "\"what's the difference between a skillet and a frying pan?... That's a good question\"\nproceeds to not answer it",
        "14:30\nThis had Geralt and Jaskier vibes",
        "The goblin es should give you good grades I thought?",
        "Thank you Etho! I worry whenever you take longer than a week that you’re burnt out again and quitting like what happened a few years back, I’m so glad to see you sticking with it! I’ve been watching you since middle school!",
        "When Etho said \"It actually kind of drifts\" I just heard the Tokyo  drift music in my head",
        "Etho - attach the chute directly to the contraption with a cobble filter and it will drain while running BEFORE it gets to the inventory",
        "omg what a beautiful starwipe\\",
        "BTW you can call the turtle hill turt-hill",
        "Eating a steak while watching this was everything",
        "will you play pixelmon again?",
        "Hell yeah, etho posted!!",
        "28:00 Ethos's Fast and the Furious Turtle drift. :P",
        "Any chance of you joining Tango's create mod series?",
        "Oh lord Etho found the star swipe again. Love it!",
        "Lets gooooooooo!!!",
        "So Etho.  Did you hear a new 1.18.2 version of TerraFirmaCraft is out?",
        "Commenting for the algorithm",
        "You also built a restaurant in ARC",
        "I think we need a big racetrack for the turtle boats. Track your best times and such.",
        "Woohoo new Etho video. Definitely made my day seeing this. Thanks as always for the fun videos! <3",
        "You can use a funnel to spew cobblestone while in-flight, like you were trying to do with the smart chute\nI think there is an addon that allows Create contraptions to use stuff like storage drawers on contraptions",
        "I've always enjoyed watching you play modded, but only since learning to play it myself have I started to really understand and appreciate it!",
        "always love the goofy intros!",
        "Was about to sleep but i saw the thumbnail",
        "ETHO YOU ROCK!",
        "I was hoping this was gonna be a modded episode… I was not disappointed",
        "\"oh yeaa battle bane!\"",
        "gaming time",
        "Haven’t slept in 48 hours, but what’s 48.5 when you could watch Etho?",
        "Absolutely love the cooking with etho section. Had me dying laughing !!!",
        "THE MAN THE LEGEND",
        "As a sick boyo this is the best medicine! Always excited for a new video :)",
        "i feel like you can right-click the sand with seashells using a shovel\nto pick up the seashells without breaking the sand",
        "Nice to see the star transition and Cooking with Etho come back",
        "ETHO UPLOAD LETS GOOOOO",
        "Today is a good day",
        "Tremendous!",
        "Perfect timing! Just sat down with my morning cuppa",
        "18:35 did Etho tell us he's been to a desert, on a horse, with no name?",
        "Etho takes the phrase \"Steak n Shake\" very literally.",
        "i wonder if etho remembers dwarves vs zombies",
        "Cooking with Etho!!!!! Thanks for this, Etho!  I've got a huge grin on my face even as I'm fighting the flu",
        "Etho, what are your top five favorite games of all time?",
        "I've missed Cooking With Etho! And all the rants about onions lmao",
        "If Bdubs brought back fly boys or survival of the fittest, or iskall makes a hermit quest series again would you play?",
        "This episode made me so happy :) the little goblin and Cooking With Etho moments made me giggle so much! xD \nYou're a blessing! thank you for being such a ray of sunshine that brightens our lives ",
        "Etho, Dataless822 has some Create videos with some great boring machines, especially the lava proof nether one.",
        "Yes",
        "I actually read about the witches of Salem yesterday I think 19 people died from the event of Salem",
        "First maybe?",
        "Can the turtle boat go up and down water elevation changes like old boats? ",
        "[Loading up the turtlemancy mod]\n\nMe: It'll be fun to do magic!",
        "star transitions. yes.",
        "I think everyone forgot that he also built Tim Hortons with Beef in Ark too ",
        "Glad to see the modded series back. Feel like I’m getting spoiled now that Bdubs and Keralis are doing the create series.",
        "Gotta give it to this Etho guy, he’s really the star of this new sizzling hot cooking show!",
        "The star wipe is back!",
        "I get so happy when ever I see your videos show up :) cheers!",
        "Im loving this series Etho!",
        "Every day Etho uploads a video is a good day :D",
        "when your siblings find your computer 8:26",
        "Finally!",
        "In regards to the comment of the day: It is also 200k of our brains against 1 of your brain. You are a bit outnumbered. Don't worry we forget things too now and then ;)",
        "Etho you can punch the mine cart and the blocks will become no longer a contraption",
        "Same little green goblin, same",
        "That boat is awesome!",
        "return of the star wipe!!!",
        "Another great lunchtime vid",
        "\"Don't touch the pan to figure out if it's hot\"\nSounds like you've had experience ",
        "Such a fun episode, couldn't wait to watch it once I got the notification. Hope if you've gotten hit by snow, it's been manageable.  Thanks for everything, Etho!",
        "Did you go because they wanted you to cook with onions?",
        "You're so lovable",
        "This video made me super hungry for a bowl of Turtle Flakes. ",
        "The turtlemancy stuff is v. v. weird but it's fun to watch you work through it. Reminds me of the Totemic mod you were working through in FoolCraft 3 with the Jingle Dress lol You danced and danced but couldn't master the hardest dances. Tbf I don't know how anyone could play 5 instruments at a time. Anyway, the turtle boat was worth it!",
        "Hi Etho, would you make a steampunk area in this series? I feel that the Create mod would be great for that sort of environment/theme",
        "Flyboys?? There's a series I haven't thought about in a while!",
        "been stressed out all morning. this just made it haha, thanks for bringing those chill vibes and funnys!! I hope everything is going well for you Etho, seems like we're all under a lot of stress right now",
        "I came her looking for the answer to the greatest mystery of all time. \n  “What is the difference between a skillet and a frying pan?” \n ……… Again I come away empty handed. \n Mr. Slab seems to have trolled me.",
        "Bdubs will be taking notes from this episode.",
        "I got in pretty deep into the create mod with a mod pack designed after yours. Some tips, the machines have no collision with the world or itself. So you can put a piece that places a cobble tunnel in every direction around the miner and have the drills right behind that part. This prevents water and lava issues. The inventory fills up fast. Create mod is very laggy. Build your main create factory in a place you don't want to be a main base.",
        "+1 to algorithm",
        "ETHO WHYYYYY I LOVED THE LITTLE GOBLIN GUY ",
        "What Etho says: we have a couple minutes left\nWhat Etho means: we have 11 minutes left",
        "Cooking with Etho AND starwipes. Today is a blessed day",
        "Why do so many modpacks etho plays have huge oceans? This one yeah, but also the terrafirmacraft/punk terrain tends to generate oceans in almost the same way that this one does (I know from experience after having to swim across them many times in search of death points",
        "Lots of Etho screams this episode. I love it ",
        "\"nothing illegal about that\" oh so it's the other kind of cooking...",
        "Its so cool to watch Ergo go through the same trails and tribulations I went through!",
        "8:26 new favorite sound :D",
        "STAR WiPE!",
        "EHTO! Play vault hunters??",
        "etho will always be my favorite.",
        "How do you do it Etho dropping a new episode when I'm ready for all the Create  stuff",
        "Wait???? Etho is THE Etho from Cooking with Etho? My mind just melted!",
        "Hey Etho, have you ever thought about playing Pixelmon again? I’ve been rewatching that series and loving it!",
        "the little wave off the start really warmed my heart",
        "This episode we get to see a very different side of Ethoob, a very panicked side.",
        "What a great day",
        "i'm glad you're still using the star wipes etho.    i was almost sure you'd broken them after that first time.",
        "Happy Thanksgiving to all my ‘Murican fam",
        "I love my steaks air marinated too! So happy to see the modded series continue",
        "\"What's the difference between a frying pan and a skillet? Good question. Thank you for asking that question.\" Absolutely perfect.",
        "I've been following Etho for so long that some series have also slipped my memory.",
        "9:28 so funny ",
        "Create really is the perfect mod for Etho, it can do almost anything and the only limitation is your creativity. And it’s aesthetically pleasing too",
        "good video , I know you don't have as much time for making videos at the moment and I like everything you post  I just wished you had time to play  create mod with tango and the lads",
        "my fav utuber, e2",
        "hey new Etho video!",
        "my etho episodes bring me happiness every episode since highschool... 10years ago",
        "Hey etho will you play vintage story?",
        "Bro I haven’t seen you in years holy cow",
        "the experimentation with that minecart drill is so amazing. absolutely makes me nostalgic for his older modded series and the problem solving he did with those",
        "Etho, have you ever seen Vintage Story? If you liked Terrafirmacraft you will l o v e this game.\nBasically it's Terrafirmacraft fully developed into its own standalone game with way more depth and the comfiest atmosphere possible, I like it more than I like Minecraft.",
        "I screeched at comment of the day. \n\nBeen watching for...years and years, never thought it would be my comment. ",
        "I was hoping ot be first",
        "Loved seeing both the fun editing and Cooking with Etho making a return! Great episode as always!",
        "it is so crazy to realize that Etho's voice has been somewhat of a constant throughout the years of his viewers growing up. I started watching Etho when I was either in 8th grade or my freshman year in high school. I'm 25 now.",
        "love the star wipe transition. so happy the goat is back in the kitchen.",
        "I'm getting flashbacks to a self boring train machine in some other modded series. Its been so long I don't even remember which.",
        "It is poor etiquette to have the handle sticking out Etho",
        "Missed you buddy <3 Hopefully you are well.\n\nWhat are your favorite bits in this modded series so far?",
        "All you can taste is the onions",
        "Love the modded series Etho, keep it up! <3",
        "Thanks for the video, it was really fun.",
        "Call me crazy, but I think he was fired.",
        "Hi Etho, I hope you're well. I understand how you feel I've been playing Minecraft for years and forget things about it. Then someone shows me and I'm like... wait what? Loved this episode the Turtlemance looks really cool, what is your favourite mod so far in your modpack?",
        "Etho! Why not play with the hermits in create?  You're an amazing ytber, been watching you since forever! Keep up the great work, love your videos.",
        "ethoo :D",
        "etho. have you heard of the game vintage story? its like terrafirmiacraft but its own game and really cool!",
        "You can disable the rotation of the machine and make it lock on to one cardinal direction, that should make it a tiny bit more stable.",
        "Etho video means happiness :)",
        "Loved the star wipe transitions so much lol",
        "love you etho, you genuinely make my day, keep it up my king",
        "Not gonna lie I bursted out laughing on the playing catch bit ",
        "Crash Landing was the series that brought me to your channel way back in the day, and was my favorite series by you. Definitely more than an unimportant detail. That series is pure nostalgia to me.",
        "Love this series etho, good to see it again!",
        "I used to love cooking with etho! I watched the premeir every Wednesday morning with my family why I made his recipes!! I’m so glad he decided to pursue a solo career!!!",
        "I have watched etho for I can’t tell you how long and I’ve never heard him panic like that",
        "The King has returned. \n\nActually he never went away. He's always been here with us. ",
        "OOOOOHHH YEAAAHH!",
        "Is this a really old version of Create? If so, update man. The trains look so much cooler then this",
        "Ah snappers.",
        "My favorite childhood YouTuber. Only Minecraft at age 22 I genuinely enjoy to watch. I’ll never get sick of your videos Etho. I love the series!",
        "I like the idea that, since etho got the achievement, he hasn't ever actually made steak before",
        "Old man Etho had a ... restaurant. :))",
        "Hey Ladders,  Bdubs is into modded stuff lately im sure youve seen..  How awesome would it be if there was some collab action in the future",
        "Etho, you can put the super glue in your off hand and it will glue as you place blocks.",
        "I love this series. I wish you would do a long episode every so often, just to let us sit back and see how you play. Or maybe an unedited channel? upload your raw stuff?",
        "Wow, I really appreciate the extra time! I know it was probably mainly due to you really wanting to get to the turtle boat, but man, those extra minutes were fun! Thanks again for another great video, Etho!",
        "Hey Etho. Were you invited or interested in joining Tango, Keralis, Zedaph, Bdubs, and Scar on their Create server? The five of them make an awesome group but I can’t help but think what a great addition you would be to that world. But then I remember that you have been real world busy lately and seem to mostly be doing solo play stuff. Figure that’s because you don’t have the time to make a commitment to a server or you don’t want to get busy and be vacant from a server? Either way, I hope to see you join them in the future.",
        "I have never heard Etho panic like he did today lol, I literally re-winded it to make sure it actually happened. Love what your doing Etho",
        "Some tips with carts.\nThe chases blocks auto connect with similar facing ones of each other no glue required.\n\nEach super glue is a entity and can lead to lag, use slime on chassis instead. Right clicking their faces with slime acts like super glue. ",
        "Coooooking with ethoooo!!!",
        "you should check out what bdubs is doing with the create mod recently, pretty cool stuff",
        "I made my snacks in perfect time!",
        "Etho sounded happy and excited the whole video, that just gave me the positive energy i needed for today",
        "Great cooking advice as always, Etho \nRe tunnel bores, could TNT be deployed downward with a contraption like that? Not sure if you'll be needing a world eater for anything but it could be fun to see!\nThanks for the awesome episode!",
        "E sell seashells on the seashore",
        "Oh man hermit quest! What a callback! Great vid as always etho!",
        "I love love love this modded series thank you so much for doing it!!",
        "I normally watch Minecraft to relax and unwind but when Etho posts I get super excited!",
        "Would you need to use the slave thingy component for the mining machine to be able to sort the materials into the storage cabinets?",
        "Bring back fly boys when? ",
        "Hey Etho! Love your content! The issue you are having with the mobs might be solvable trough the configs of TeamAbnormals mods. I cannot for the life of me remember which one it is atm, but it has a config option (default set to true) to reduce friendly vanilla mobs in favor of theirs, but in my experience it blocks all vanilla animal spawns.  It could be Autumnity, but dont quote me on that.",
        "The goat",
        "Etho upload lets goo....i have been trying to interact with every upload since Etho and his family are still going through stuff <3",
        "When you use the Create super glue you don't need to use the chassis you can use any block as long as its all glued.",
        "Loving that star-wipe! Just like old times, heh.",
        "Etho, I put a frying pan on the hob but nobody came to tell me I was sizzling hot. What did I do wrong?",
        "A tip for the tunnel contraption.  Water, lava, creepers (and techically other mobs, but these machines usually are immune to mobs pushing them backwards)  will disrupt it and are the only things that can.  You will want to make a set of deployers to encapsulate the minecart in blocks (including the front) and a deployer to restock the minecart's fuel.  If you do those things, you can literally mine through lava lakes without any trouble.  I would also suggest adding a seat to keep the machine loaded and you can AFK on the machine with only the occasional need to check on it to empty the inventory.  If you add the seat, make sure the encapsulation protects you as well.",
        "I dont know why but an Etho Runescape playthrough would go hard",
        "furnance minecarts are very unreliable, from my many hours of testing, the most reliable is the version with powered rails and redstone torches  and drills in front of the deployers; with more deployers than drills (additional ring of deployers without drills in front of them)",
        "18:37 Etho went through the desert on a horse with no name. I don't know if I could come up with a more low-key reference than that.",
        "When Ethos videos come out, it really makes my day! Or should I say week…. Or month",
        "mmmm air marinade! my favorite!",
        "Right?",
        "I'm so glad Ethos is finally discovering just how powerful the Create mod is. Can't wait to see him use it in future modpacks with the recent train update :)",
        "28:38, oh my, this might be hard to believe but just before this I was thinking like \"Man, I need to see Crash Landing again after this\" and then that comes up. Its a sign man!!! Also Crash Landing is what made me starting watching you so it has a special place in my heart!",
        "Someone just listening to this would be very confused ",
        "Etho constantly getting bugged by the Goblin trader while working gives me full on Taxes vibes it's great! Plus we get so many star wipes?? Today is a wonderful day.\nI gotta say...Etho's choice on mods is imppecable. The world is so pretty, and full of life and little sweet surprises. I feel so attached to this world now even though we are only 9 episodes in.",
        "W etho",
        "hahaha, Etho built a restaurant in ARK even :)",
        "It just me or does Etho sound like he's holding back laughter the whole video? Sounds like he was really having a great time playing!",
        "the good thing about being subbed to etho is that he has the determination to go back to a series like this until it's finished... maybe in 2028",
        "Having an entire unseasoned mostly raw steak that fell on the floor for breakfast, what a chad move.",
        "Finally the algorithm re-learned I want to see those videos as soon as they are uploaded.",
        "Love the video from Saskatchewan!",
        "Sir, you, like me, might just have a clamp(entity) problem (because of which turtles aren't spawning).",
        "Ethos memory is two boxes, one labelled \"Signfeld Trivia & Redstone for quiz game\", the other \"unimportant stuff\"",
        "Was that opening about cooking with Etho supposed to be a metaphor about Hermitcraft possibly?",
        "First",
        "Grill marks bud.",
        "I watch all your different series every few years. I watched all of project ozone and all of your minecrack modded series with the islands while you took your break. I'm gunna watch your original modded series next. Remember Taxes and Jaquelin?",
        "I just looked up cooking with etho on Netflix LLLMMAAAOOO",
        "Hey Etho! Have you ever played Cities Skylines or Sim City? They seem like open ended games you would enjoy. \n\nAlso, thank you for all the content you have produced over the years. I’ve been watching you for about 10 years now and always watch every time you post!",
        "Etho, glad to see you're still wearing that amazing hat ;)",
        "Star wipe!! Miss the old floor break transitions for nostalgia lol",
        "Thank God we are back playing this",
        "Hey Etho. Been rewatching your ARK series, actually gotten me back into playing it again! Loved that series you did, it’s like my fourth time watching it. Can’t believe your ARK series is over seven years old. Will definitely watch Valhalla Pvp series after I’m finished with this one. Will you return to the Arconauts server some day? Been watching you for over 10 years! From primary school to university! Still loving every single one of your videos! Thank you! You are my hero!",
        "Star wipe!!!",
        "Hey Etho\n\nIt would be cool if you build your own little workshop area just to make these trains. \nAnyways, thanks for still making videos after all these years.",
        "What is cooking with etho? \nHe only has one video on his channel with that. Is it an old episode?",
        "I love the create mod more and more each day",
        "1:22 not answering the question lol how very Etho of you ",
        "Mmm. Air marinaded steak",
        "awww the little goblin look so cute.",
        "It may be a worthwhile investment to add 2 other cobblestone deployers, so that when you're following the tunneler you're less likely to fall",
        "Magnificent machinery! Thanks for the good laughs too!",
        "Would you ever consider re-uploading/reviving an older series as an anniversary type of thing once it reaches a certain age?",
        "BWHAHAHAH this was great, you were so emotive at some points too pfft no worries, great episode, love it a ton!!",
        "really nice to see that you're still posting! even though its not often its very nice to know that there'll always be another video!",
        "Loving the modded series, as always :)\nWhat did you think of the new bamboo blocks coming in 1.20?",
        "I've been waiting for what feels like years for this to come back . I nearly screamed when I saw it you don't know how happy I was to to see Ethos little turtle helmet .",
        "Thanks for the episode Etho!",
        "Yessss!",
        ": )",
        "Seeing that Etho posted a video has put a smile on my face. Edit: If the contraption runs out of storage, it litters the ground with the over-flow.",
        "I'm impressed by the self-control it took to not say \"star-wipe\" every time.",
        "Spam clicking has never left",
        "Nice episode. Can’t wait for the next one in a few months!",
        "hey laddders long time not see.Have you been goin up then down lately? :)",
        "Goat",
        "Became a channel member exactly one year ago today! Can't think of a better way to celebrate it. :)",
        "Etho I love you",
        "Well actually Etho my day wasn't wonderful, in fact it was pretty bad. But thanks for making it a bit better :)",
        "They way I watch youtube now, I feel that all other videos I watch are just filler content for when the canon Etho content comes out... Etho you have done a fabulous job at maintaining the quality of your videos.. You are the only youtuber for whom I watch all of the videos wherever they come in... I just finished watching your original chocolate island world. I think I found you when you first started the new world and even though I had seen parts of your old world I had not seen every episode, I just finished watching that... Somehow even though your videos are very simple in editing, just your pure raw genius ideas make the videos mind blowing and exciting.. Thank you for all the years of content you have given to us..",
        "Now is the perfect time to build a museum or something in the main series, an idea some other commenters had proposed before. It’d contain murals or semi-replicas of events and builds from different series.",
        "Etho... you think the minecart stuff is cool... look up \"create trains\" part of the 1.19 update\nthey are the minecart contraptions but bigger, better & fancier\ntrains are the best part of create imo",
        "The fins move on the turtle boat 🥹 so cute",
        "Etho this day marks the day the \"etho pushups\" are over. My friend and I have been doing a certain amount of pushups daily (20+5 for every day between uploads), and I think we were at 85 by the time you sent this out. Thanks it was starting to get annoying lol",
        "Re: comment of the day. It kinda makes sense that community members will remember more about past series than Etho does. Etho plays a ton of hours and condenses that down to half an hour for the videos so there's less to remember. Plus we've watched the videos more recently than he recorded them, sometimes by many years.",
        "Hey Etho! I think I recall with the sea shells if you right click the shell you can pick it up without having too break the block it’s on",
        "Touch the pan and get 5 extra sausages to go along with your steak",
        "Watching this just makes me lament that Etho isn’t in the create server where bdubs and scar are. I love the modded series but it would be so cool to see what he could do with the people on that server.",
        "Can you please bring Chester to life. He was the best buddy of all. Think of all the not starving he has helped you with.",
        "29:13 Infinite content :)",
        "never clicked on a video faster",
        "Etho if you add a brass funnel with a cobble filter on it to the minecart then the cobble will be dropped behind it.",
        "Another awesome Create feature is the schematic cannon. It works like the Buildcraft Builder, but if you're not a fan of that, a deployer with a blueprint will only place the blocks that correspond to the location of the blueprint, letting you build a sort of 3D printer.",
        "HE DID IT! HE USED THE STAR SWIPE!",
        "COOKING WITH ETHO!!",
        "All the CTM were a reat treat too!",
        "Loved it!",
        "I've been waiting for this, this was a fun video",
        "Love this etho <3 thanks for the episode",
        "Star wipes!",
        "Etho you should have it also place torches down behind the plow! so the tunnels are already lit",
        "I feel like when the mining machine was breaking the storage wall is somehow the first time I’ve ever heard etho genuinely yell hahaha",
        "Been watching since 2011",
        "Etho, you should use the slingshot to light up caves!",
        "So what's the difference between skillet and frying pan??",
        "Etho, watch a create tutorial, other than that your usual smash face against wall until it works strategy is working",
        "Crash landing 2?",
        "I'm gonna say it...",
        "0:43 you threw an onion at the assistant producer! It was all over the news.",
        "Getting serious Mario Kart vibs from Ethos mushroom helmet and drifting turtle boats.",
        "Etho, my day was really bad, I saw your upload while working and almost forgot it. When I did get to watching it just now, I feel a lot better, thanks for being a fun person, really brightened my day.",
        "You should name the goblin and make him your sidekick",
        "0:58\nMe: Mom, can we have Cooking with Etho\nMom: We have Cooking with Etho at home",
        "Etho, I know you have a lot on your plate but having you join the create crew (zed, tango, bdubs, scar, & keralis) would be a dream come true! I would love to see you in on that series!",
        "so happy you brought the star wipes back",
        "1:22 THE STAR WIPE!!! THE STAR WIPE  IS REAL!!!",
        "I believe there is a function on the minecart contraption thing that with the wrench that locks the direction of the miner! You could have the miner go back and forth when storage is full",
        "Excited to watch this video! Love your videos etho!",
        "Yo new ep",
        "ow come on etho join vault hunter",
        "Etho have you thought about doing terraria is EZ 1.4? The 1.4 and 1.4.4 updates have added a lot of new content to the game and it's been many years since your 1.3 series, and I think it would be enjoyable to watch",
        "So happy there is another Modded Episode, aboslutely love these. Love the idea of the self mining train, keep up the great work.",
        "Etho shaking his head at the camera without moving it had me tripping",
        "I loved crash landing",
        "Commenting halfway through so you may have fixed this, but Use funnels to drop the cobble behind.",
        "3 minutes in and two star wipes already! Etho what a fantastic guy",
        "Had to stop the abortion just because of Etho",
        "Channel is turning into a kid's TV show pandering to an audience of 5 year olds.  Used to be focused on all age groups but clearly doesn't care for anyone over the age of 5 anymore by the way he talks now.",
        "I love this series, but it's a shame it probably means we won't see Etho helping out Tango and co on their create project",
        "0:13 your upload is making it better :)",
        "That intro made me smile to the point of having a face cramp.",
        "You're the best stuff Etho! Missed this series!!! <3",
        "Literally makes my day when Etho uploads. He uploads, and I’m watching it asap everytime",
        "I've never thought of making a mining machine with create.",
        "didn't even watch yet i love this modded series i get pumped whenever there's a new upload",
        "Did he really just tell me it’s was an excellent question in the intro then move on without answering it bc nobody knows?",
        "Os it jist me or dose any one else wish etho joimed bdubs tango scar in there modded serries",
        "Random comment.",
        "Return of Cooking with Etho and Taxes ! All in one episode !",
        "I LOVE STAR WIPES!!!!!!!!!!!!!!",
        "I really wish I can watch this series more than once every two months lol.",
        "Love the turtlemancy mod",
        "Man this made my month.",
        "its now called \"Cooking with Etho with Bdubs\" tm",
        "Etho, the star swipes on the home cooking show really added the perfect flavor, maybe in the future we could have add a laughing track and remastered intro theme! Always love to see your videos. You are a talented entertainer!",
        "Love me some Etho",
        "Oh man that episode was super fun. Always love to see it. Thanks Etho!",
        "WOOOOO it's a wonderful day now that etho uploaded!!!!",
        "Mr. sLab\nHave been watching for years and never took the time to thank you for everything. Your most recent world tour has become a comfort video for me, seeing everywhere we have been through the years, and every upload still warrants an instant click to this day. ",
        "Etho is the one YouTuber that I don’t put on 2x speed",
        "23:10 Wow those turtles deciding to hatch really got us an extra 6 minutes of Etho. Nice!",
        "Hi just wondering what the hermitcraft plans are, not sure if already asked sorry",
        "Maybe try the slingshot with torches or some other lightsource? Could work like a whacky sojourner's staff.",
        "Eyyy hi Etho!",
        "\"marinating in the air\" haha",
        "20:23 amazing rick and Morty reference",
        "Loving the star wipes, they always make me chuckle :)",
        "Like goes before watching!",
        "HYPE HYPE HYPE HYPE COOKING!",
        "Do you still play don't starve?",
        "Thanks!",
        "To everyone who’s happy to be watching another Etho modded episode: you’re welcome. After careful scientific research (I spent five minutes reminiscing) I have concluded that every time I think to myself, “huh, Etho hasn’t posted a modded episode in a while” he posts one within three days +/- 18 hours. On Sunday I was looking through his uploads to see if I had missed one and now here we are. Hypothesis confirmed. Data available upon request. Source: Trust me bro",
        "Honestly it’s so amazing to me that Etho spent the first 9 and half minutes meticulously acting clueless about mine carts and machinery right in front of the goblin trader, all to slowly get him to lower his guard… making him seem like he was invincible after he so effortlessly shrugged off a dagger thrown into his skull… all so Etho could suffocate him swiftly and brutally, finally killing him and ending his reign of tyranny. (For a little while at least)",
        "thank you for everything etho <3 you always make my day :)",
        "I’ve been waiting for a modded minecraft seires finally:))",
        "Damn! I have memories of me in highschool looking forward to get home and watch Etho's crash landing series  I was new to modded so it was always really exciting to look at. (it still is!)",
        "Marinating in the air... airinating if you will",
        "little did you know Etho but, i sat down with a fresh off the frying pan pork chop! MMMmmmmm....",
        "After all those years making fun of beef being old, now you've joined him.",
        "With Etho doing a how to eat tutorial.. can he do a “how to open a door” tutorial? Or “how to pick up a can” tutorial? I’ve been stuck in my room for a while now.. and I think there might be a hidden key in the can on the floor",
        "These need put in a Playlist ;-) love the content!!",
        "Yo",
        "The tunnel miners are awesome, just a heads up tho if its running and goes out of loaded chunks or the game crashes the whole structure will explode and sometimes get stuck inside chunks that didn't save",
        "I enjoyed the video!",
        "100% feel you on unimportant stuff slipping away. But thats life aint it, no1 remembers everything perfectly especialy if it happened 3-10 years ago",
        "Etho remembers Fly Boys! That was one of my favorite Minecraft modded series of all time, along with FTB. Imagine a reboot of that...",
        "Way too late for you to see, but after a long day at work it really does bring me so much joy to see that you posted a video after I get home from work and finally lay down for the day. I hope you’re doing well my guy, thank you for giving me relief and a smile at the end of a long day.",
        "Etho was in such a happy and silly mood when he recorded this! I was giggling through the whole first 10 minutes!! We love you Etho! Never stop!",
        "This was painful to watch. Won’t pretend I didn’t experience the same when making my first tunnel bore. But I did it in creative where nothing mattered.",
        "8:26 i have never heard etho panic this much before",
        "etho you always post a video when i need it the most. you’re videos are literally my therapy and i appreciate them so much. thank you",
        "Nothing says “Today is a good day” like Etho dropping an episode",
        "I liked the Turtle boat, but wait... Spells?! I thought you told Scar \"no magic, only science!\" ",
        "Star wipe, star wipe, YES!",
        "Cooking with Etho was a cinematic masterpiece",
        "Etho videos always come when you need them. I’m feeling pretty poorly, and I loved a chance to escape into Etho’s modded world!",
        "I have been waiting for this for 2 weeks! new ep! yes!",
        "Dear Etho, Crash landing was an amazing series. Would you consider doing another \"challenge\" series similar to crash landing, or even modded skyblock? You usually have creative approaches to problem solving that are really fun to watch!",
        "hey etho, the goblin has to stay :)",
        "ETHO!! You brought back the Star wipe!! Yesssss! ",
        "The advice about getting a friend to touch the pan instead of you to test the temperature cannot be understated! Made that mistake many times before I learned that cooking technique.",
        "I wonder if it's possible to program the train to build a two-high barrier after it goes across a cavern to block potential mobs? It'd be neat if it could... Also, if you're reading this Etho, do you like trying new dishes? If so, what was the last new dish you tried to make, and how did it turn out?",
        "I remember I was around since 2009 I've been around this channel for a very long time lol",
        "The train stuff is amazing!!",
        "Etho still have more to learn about Create",
        "I think it would be entertaining to watch Etho react to old Etho videos every one in a while",
        "Thanks God, you are Canadian, not German, otherwise thumbnail would look very sus.",
        "That sizzling noise really made me hungry:p",
        "Being an adult is hard until an Etho video drops, then I can grab my snacks and relax.",
        "Very cool, but when's the next Dwarves vs Zombies episode",
        "Etho's Home Cooking Show... I like it!",
        "Food just arrived and a new Etho video? Perfect distraction from the cold outside",
        "I recently watched the episode in his let’s play series where he switched to davinci resolve and showed off all the wipe effects. It’s so cool to see him still using it after all these years",
        "Does crash landing exist still, that was my favourite series?\nI have actually gone back and watched it a few times.\nEtho, would you do it again?",
        "TRAINS I LOVE TRAINS YAYYYY",
        "There's an additionnal mod that allows Storage Drawers to work in a contraption. Also, for building, check out the Schematic cannon. It's amazing.",
        "Etho, you need to put a storage controller on your machine for it to put things in the drawers automatically",
        "Love ya Etho!",
        "14:59 HOW??? how did you survive that onslaught of mobs?? lol",
        "STARSWIPE",
        "Oh my god, stuff that happened so long ago I could totally watch again - CTM, namely superhostile by Vecks. With etho, beef and others... So good.",
        "Etho, have you ever considered livestreaming? Personally I'm not even much of a fan of watching it normally, but there are a few distinct personalities like yours that I love to listen to in the background. Even if it was just you doing the boring grindy stuff that gets cut from episodes, I think it'd be fun to see even more of you figuring stuff out or just reading through the wiki and playing with stuff in-game until you get a result!",
        "My like button is missing can someone like it extra for me pretty please\nIdk I think it must be a bug with one of my extensions",
        "Ergos back!",
        "I have never been this excited for a serie. I love the ideas you have for Create contraptions and cant wait to see how you are going to use them.",
        "hey etho, you probably get a lot of these messages, but thank you for the literal years that passed. even in my recent rough time you’ve allowed me to calm down many times",
        "That boat is very qick! GG's Etho thanks for the awesome videos man",
        "why are you using outdated create",
        "Hey, Etho I'm sure someone else has pointed this out but, you don't need to glue every chassis together they auto-connect as shown by their texture. Also, you can use the scematicannon to copy builds that you have done in creative or in survival even across worlds and instances.",
        "Can you use it for laying ice paths, placing buttons to spawn proof and glass panes either side for nether highways?",
        "The audience sound effects added so much to cooking with etho!",
        "OMG FLYBOYS!!! I loved that series xD",
        "It's OK Etho, getting old means losing your memory ",
        "That talk at the end reminded me of your old stuff... Remember the Supper Hostile maps? :) I can't exactly remember but i think the first video I've ever watched was Legendary e1.\nAlso, if you talking about pure potential of this Create thing... Fully mobile base? That could be fun, although in practice I don't think it'll actually work from performance standpoint.",
        "I listen to cooking with etho on loop, it's a bop",
        "Ah yes, Cooking With Etho: Home Edition; now star-wipe out... and I'm taking my name off this thing. Not sure if that was a Simpson's reference in the segment, but the star-wipe was a glorious, subtle touch.",
        "Great episode! cant wait for the next one:)",
        "Mr Etho. I love the extra time it gave the video, but you totally could have just bought turtle eggs from the goblin at 17:06",
        "Hey Etho, I always have the same problems with animal mobs not spawning. I use a mod to increase the mob caps. Works like a charm.",
        "Speaking of your old series; what are your favorites? Do you have an overall favorite or maybe a specific favourite out of your modded LPs or multiplayer LPs etc how about a favourite non Minecraft LP? \n\nI personally have fond memories of your crash landing series but your original single player modded LP has to be the best you have done by far.",
        "Not sure if you know this already but just as a heads up. The super glue in this version of create can get really laggy (I think each piece is classed as an entity). They fixed it in the newer versions but that's for the newer MC versions.",
        "Etho trying to get the minecart to unload the drill was more funny than I thought it would have been",
        "Fun chaotic episode! If there's time for some guest appearances on the BTSK boy's create series, that might be fun too.",
        "etho upload when i was having a bad day thank you :] <3",
        "Etho leaving Cooking With Etho was the saddest announcement just glad there was no bad blood between him and the producers",
        "Dude, it doesn't matter what cooking show you're in, I'm watching.",
        "YAY MORE COOKING WITH ETHO!!!\nAlso please keep and name your little goblin assistant he reminds me of your best buddy Taxes from back in the day always getting in your way oh never mind he got drilled \nRIP Nameless Goblin Bud we hardly knew ye ",
        "Have you cooked steak irl?",
        "Is it just me or does this video seem extra buttery smooth compared to other videos? Kind of like the first time you play on 60fps from 30fps.",
        "I dropped everything to watch this",
        "You should put some exploring in the videos and some of the day to day tasks.  I think your world is so pretty I would love to see you go about it.  We got to see you build the restaurant and the other contraption but barely see you use them to get stuff.  No need to complete a project every video.  You can split it up into multiple episodes and include some of what you did to set up the project.  I really enjoyed the first episodes.  I think its a shame that we don't get to see this exciting modded world the way you do.  Anyway great video!",
        "Um why is etho using vanilla hoppers with create!? Create has way faster hoppers my friend",
        "COOKING WITH ETHO IS BACK YESSSS ",
        "Oh thanks Mr. ninja, I shall truly get you to touch my frying pan so,I can cook my steak, my Best friend ",
        "Aaaaah front row seats!! Exciting!!!",
        "... Never going back. Wrong way on a one-way track... ",
        "speaking of old series… any thoughts on a return of team canada? I didn’t watch them when they came out, but binged them all later. I know scheduling is hard and getting the right maps, but they were always awesome series.",
        "Hiya Etho!",
        "nice!",
        "Son: Mom, I want to stop and watch cooking with Etho!\nMother: It's fine son, we have cooking with Etho at home!\nCooking with Etho at home:",
        "Is there a chance you will try out Iskall's 1.18 Vault Hunters in future? In my opinion it's slow pace and needing a lot of different farms suits your playstyle a lot=)",
        "@Ethoslab when is your next dwarves vs zombies video?",
        "Im Autistic i cant tell if Etho is jokeing or not. \n\nDid he quit his job or does it sound like he was jokeing?",
        "Etho left Cooking with Etho?! * gasp! * How am I going to be able to enjoy my snack now that the best of Etho is no longer here on the show? Why??!???!\n\nDrama aside, hey man, how ya doin'?",
        "Etho do you realize you can use the minecraft thing to make moving platforms around your base to make it more fun to traverse.",
        "Yayyyy Im so excited!!!",
        "Always a good day when etho uploads",
        "Steak for breakfast...",
        "is this modpack ever going to be available or do we have to just mod it ourselves",
        "How about that when theyre transformed as the imposter role, their voice is disguised, so they can still talk, but the crewmates dont know who it is. ^_^",
        "Loved the cooking with Etho, bit, that was funny.",
        "Etho throwing a spear at the mining goblin... \nDUDE! He eats Red Stone! And nibbles like a squirrel too!!! That's far too adorable to spear in the face! Q_Q",
        "COOOKKINNGGG WIITTHHH EETHHHHOOOO!!!!",
        "Cooking with etho instructors not understood, burned my house down instead:(",
        "Thank you so much for posting when you did Etho, I was feeling overwhelmed by life, started a new job with ridiculous get up time, and can't seem to adjust. Started your vid here, and within 3 minutes, you had a smile on my face. Not a long time viewer for those wondering, prolly started around Hermitcraft 7.",
        "you can use the create saw and a hand crank to instantly destroy trees so with the big trees near your horse trail you can chop down all but 1 of the ground touching blocks and then instantly destroy the tree",
        "Proud of being part of a very loyal fanbase for Etho",
        "swag video post",
        "8:28 In all my years of watching Etho, Ive never seen him panic as much as he did here. Gave me a fright by the loudness of his voice, and laughed afterwards",
        "round steak",
        "YEEESSSS MOORREEE ETHOOO! DAY INSTANTLY 1000 TIMES BETTER!",
        "IRL cooking with Etho when? Lol",
        "Sheeeeesh star wipe FIRE",
        "great episode",
        "The cart assembly is used in iskall85s vault hunter series. Very cool :)",
        "Putting down my very important comment!",
        "The star shaped transitions caught me so off guard I love them",
        "Wow, Absolutely loved the beginning!!",
        "I'm currently moving house, so really enjoyed seeing the video notification come up!",
        "Etho musk drilling tunnels",
        "665 likes at 7 minutes? You feckers didn't even watch it yet.",
        "Just got done catching up on fool craft (I was in a bad spot in life and couldn't watch ). So this is great to pick up after",
        "Etho joining the Hermit Create mod server would be fun.",
        "\"Not fired\" I think the Etho doth protest too much\nThe beginning joke of saying \"What's the difference between a frying pan and a skillet\" followed by... not answering the question was great",
        "STAR WIPE",
        "I like how Etho likes to experiment with new items and recipes in Minecraft. He just goes all out and works out how he wants to use them. I suppose that’s why his channel is called Ethoslab. He isn’t a crazy scientist like Zedaph but it would be interesting to see what these two would make together.",
        "Leaving a comment for the algorithm so this video can get number one trending",
        "Here he is",
        "I love you you bring joy to my face",
        "So.... what is the difference between a frying pan and a skillet??? Say it minecraft wizard!! The people deserve to know!",
        "Thanks for all the years of Minecraft videos, man!",
        "ERGO how do i know if the pan is hot enough",
        "Wish you could join the other hermits in the Create series tango has going on!  Great video",
        "I realy love Etho's Videos but Always way to Short for my taset",
        "There is earlygame, midgame, lategame ... and then there is etho",
        "the star wipe makes me laugh everytime",
        "etho where are the power hours?",
        "Been watching cookin with etho since terrafirmacraft",
        "Cheftho",
        "I want to see how fast that turtle boat goes on ice...",
        "Yessssss been waiting months !!!",
        "Etho is getting older, memory is getting weaker, luckily that means we can listen to him tell the same Canadian stories over and over. I hope he does the one with the bear and the maple bacon again",
        "Flyboys was so much fun!! It would be hilarious to see that again with Bdubs and the gang, and maybe more hermit craft members too!!",
        "Fantastic episode!",
        "Etho please give us your modpack",
        "You can kill the Goblin, it just takes multiple attemps",
        "If u use a wrench on the assembler you can lock rotation so it don’t spin, also using a unloading belt can be faster at getting resources out :)",
        "cooking tip to figure out if your pan is hot enough: apply a THIN layer of grease (I use olive oil) to the pan before you place it over your heat source; when the pan gets hot, it will start to smoke; that's when your steak goes in the pan",
        "Are you planning on playing terraria anytime soon?",
        "haha, absolutely great intro!!! And I agree the 5 second rule, just shake it off and you are good to eat it!\n\nKeep improving your babytrain! It needs to place torches every five blocks! And make it to shoot mobs ",
        "Babe wake up! New Etho vid just dropped.",
        "\"That's an excellent question. Thank you for asking that. So -\" Etho is ready for his post-YouTube political career",
        "It would be so cool if turtle boats could dive. Then, these are a real improvement on the old fashioned boats",
        "today is a good day",
        "Love your vids Etho, thank you for what you do!",
        "Me and my friend have been doing 5 push ups times the amount of days etho hasn't uploaded. We got to 85 a day.",
        "still loving this series!",
        "Good episode see y'all in a couple of months!",
        "I kind of miss the expert pack series :(",
        "How's aboot you go ask Tango to join him, Pappa K, Scar, and Pink Shirt on Tango's Create server",
        "Etho when r u going to make a face reveal?",
        "\"Star Wipe!\"",
        "hey Etho! seems like the volume has been pretty low in recent videos in comparison to all other streams and Youtube I watch. Also I'm glad you weren't recording in between those clips because that was a comical coincidence when you turn and parts of your movable storage were gone XD.",
        "I watched this video when it came out, forgot to comment though, but I enjoyed it and enjoy watching the new modded series.",
        "Hey etho just a heads up, you've got enchanted mobs in this pack and I've found the ones with soul flames create a ton of lag (They leave flame trails behind them). When you get mobs (like bats) with this enchantment underground, they create a ton of flames in caves that burn other mobs and its ends up lagging a lot in areas you're around frequently. So u might wanna disable that part of the mod",
        "Now, as a chef, a big tip to remember is to never leave the handle of your pots, pans and skillets hanging out over the counter like that. Very easy to bump into it and spill food on the floor or yourself. Stay safe when cooking people :)",
        "commenting for the athogithm",
        "Oh yeah.\nEtho time=Blockbuster time!!!",
        "cooking with etho returns! don't worry, we never believed those dirty rumours.",
        "Etho, did you notice that when you use the slingshot, that the item it will use appears in the bottom left corner of the hotbar slingshot icon?",
        "The transitions for the cooking show was amazing. I rewatched it three times because it was so funny.",
        "What a strange little green thing. Must be hard working with Bdubs around",
        "Etho =D",
        "Cooking With Etho brings back so much nostalgia. I still remember when the joke about onions started.",
        "was not expecting to hear the name \"crash landing\" that series was so long ago wow"
    ],
    "comments_disabled": false
}