{
    "video_id": "R3mN0wyD06M",
    "comments": [
        "There's an issue in the Rick and morty comics where Rick and Jerry travel to a dimension where they are a cartoon show (our dimension) and even inadvertently kill Justin Roiland and Dan Harmon",
        "this season promises to be one of the best!",
        "genial jsjdjs",
        "This is \"Never Ricking Morty\" levels of meta here!",
        "\"Cover your eyes on this one\" ",
        "I find it funny that thing happened, and then the other thing, and the thing after that, and then when that all went down, all the way down they went, and it was good and it was OK hear me out, I am what you would call a “robot” from the future. I just needed to start off with something unsuspecting so they don’t catch me. I recently thawed a human from a cryo chamber to keep as a pet, but I don’t know what to feed him. Tried giving him crude oil but he just threw it up. What do you people eat? Please help. Also, if you got the covid vaccine, don’t film yourself in your sleep, actually just don’t sleep at all probably shouldn’t have said that OK bye.",
        "Previously Leon's Mexican cousin... Onda La Step Isoda",
        "I'm not the only one expecting Evil Morty to reappear. I hope he encounters the President/Jessica and the others.",
        "Idk if you remember but in season six episode one, rick talked about iron man, and morty asked him \"when he pretended not to know who iron man was, who was that for?\" Morty didn't know that he's in a show. But Rick does, he always knew. lmao",
        "but in this did morty really experiencing things in normal time after marrying rick",
        "Bro…",
        "And that, ladies and gentlemen, is how you absolutely shatter the fourth wall",
        "isn't this exactly what matpat was talking about in his video",
        "Like comments Rick and Morty Season 6 new episodes next sunday at 11pm ET only on Adult Swim",
        "Why am I butter?",
        "I'm thinking summer isn't really prego",
        "??????",
        "4th wall breaker.",
        "Peak fiction right here",
        "My favorite part is when Morty said \" it's mortin' time\"",
        "So, Rick and Morty are married",
        "OMG THIS GONNA BE MY FAV EPISODE",
        "0:32 Dan Harmon strikes again",
        "Just realized Tricia Lange is crying at Jerry’s funeral in the background",
        "Repent to Jesus Christ “bless those who curse you, pray for those who mistreat you.”\n‭‭Luke‬ ‭6‬:‭28‬ ‭NIV‬‬\nU",
        "This episode was absolute comedy genius! I laughed so hard, I had tears in my eyes, especially with the whole Jesus montage.",
        "previous leon ",
        "The train episode was actually my favorite episode of the show so far, so needless to say, I'm looking forward to this one!",
        "I guess the episode is coming tomorrow?",
        "ya know what would be cool to see? if all the shows on Adult Swim could partner with Rick and Morty to have an episode running through every show. would be interesting and help promote the other shows as well considering how popular R&M is.",
        "Why am I butter? Lol",
        "Why am I butter? ",
        "0:19 summers friend who never got to bang jerry is bawling",
        "The writing was epic for this episode...",
        "audio >>>>>>",
        "Omg, I cannot wait.",
        "Season 6 oh gosh",
        "This is exactly why I love this show only they would do this",
        "Rick and Morty Never Ends.",
        "Thats like breaking the eleventh wall",
        "Oh I thought they cancelled it because they knew it sucked.",
        "Fun but kinda tacky",
        "just when I thought it couldn't get any more meta",
        "0:27 - 0:44 so he think tony hawk would magically appear into his house just to give him his skate board? Man the development is just keep getting worse for morty as he grows. Hell, he’s even worse than jerry.",
        "This season has been amazing!!! Stoked for Sunday!!!!",
        "Really loved the part where Rick said  \"it's squanchin' time\" and squanched through several episodes. Truly one of the schwifty moments of all time.",
        "The return of Story Lord?",
        "Did that bee say yo gabba gabba lmaooo",
        "Rick and Morty went woke years ago. No thanks",
        "“Cover your eyes on this one”",
        "0:31 good to see that even though Jerry is no longer there, his parents’ « couple » (down left) is still going strong",
        "First part was genuinely cool, the last part was just for engagement",
        "Okay. Previous Leon got a real chuckle from me ",
        "what is up with all these incest jokes coming up recently",
        "A Cool Abed Films production.",
        "\"cover your eyes on this part\" hmmm...",
        "when when wheeeeeeeeeeeeeeeeeeeeeeeeen?",
        "Summer is just like Beth, got knocked up by Jerry at 18\n\n\nSummer: \"I'm pregnant\"",
        "Sweet home Alabama....",
        "Nooo, stop,  I don't care anymore, you we're suppose to be the chosen one, to bring balance to the Multiverse.  Not destroy it... you we're like a brother to me..",
        "1:24 „Cover your eyes on this part.“  ",
        "Anyone else got reminded of Futurama 's \"Time keeps up skipping\" episode?\nOr Amazing World of Gumball 's The Signal episode?",
        "Pls no new incest stuff in Rick and Morty ",
        "the legalization of weed has made this watchable now go buy some and be a good lil sheep. Morty would understand, I doubt any of you would tho.",
        "Rick and Morty A 100 years!!!!",
        "It's so meta...",
        "There is no 4th wall strong enough to contain Rick.",
        "someone needs to show this to the clowns that produced She-Hulk, this is how you break the 4th wall",
        "Previous Leon. Hahahaa",
        "0:12 was that a reference of cloudy with a chance of meatballs",
        "mid season breaks kill the flow of the season. done mvoed on.",
        "I like video and very good company",
        "“cover your eyes on this part”",
        "0:45 i bet that beth is the clone.",
        "Jesus that's a beautiful chaos",
        "I watched this at least 30 times, best preview on adult swim by FAR!",
        "The most epic trailer I've ever seen. ",
        "I have been crying for the past few hours. This is legitimately heartbreaking. I cannot imagine how his family is doing right now.\nTechno (Alex) was my favorite youtuber. He always made me happy when I was having a crappy day. His videos made me smile even in the darkest moments. And now I can't stop watching his videos, but every time I watch them I am reminded he is no longer with us.",
        "Just when I thought this show couldn’t get more meta",
        "WHY ISNT ANYONE TALKING ABOUT THE MARRYING THING",
        "I love rick screaming best episode while passing through butter morty",
        "I’ve barely been alive from being so bored waiting for this to come back and omg it’s better than I thought",
        "Yo esperaba que el capítulo de la mantequilla se haga realidad  al parecer no será",
        "This show’s officially become too meta. \nIt’s fun.",
        "Okay, that was just amazing\nI cannot wait for more Rick and Morty!",
        "so the butter morty melting on a pan is going to be an episode\nawesome",
        "But what about my shredderrrrrrr",
        "So in a sense... The whole intro has become canon part of the story, thus preempting the need to ask when the story beats happen in the show? Amazing.",
        "Interested",
        "Morty as he’s holding on to dear life: ooooo I’m butter",
        "5",
        "Lmao this was great!",
        "Giving me serious story train vibes, If it's as good as that this'll be a smashing return for R&M",
        "JUST. SO. META",
        "The people behind this show are so creative I love it",
        "Justin Roiland never gets tired of discussing and yelling to himself and i'm here for it!  ",
        "This teaser has more jokes than all of season 4 and 5 combined.",
        "Best one yet",
        "This is the best 4th wall break to introduce the continuation",
        "Rick says cover your eyes at this part which means that he's seen that scene in the opening before. I always thought it was that the opening was alternate versions of Rick and Morty apart from the ones that we follow but always found it strange that it always starts the same way. I think this first scene in the opening with a Morty getting eating has more significance than is being let on.",
        "This was a triumph",
        "I think Previously Leon comes from a demension from the finite curve",
        "Rick going “best episode” with the butter, interestingggg",
        "So now Rick is actively trying to break out of the Series' continuity itself. Someone get the memory gun, so we can get him back in line. Also, get a new Jerry, grow back Beth's hair and put Summer's child... Uh... Somewhere. I don't know. Throw it into a wormhole or something. Just get rid of it before it becomes canon.",
        "That's good of Summer to name her kid after Jerry.",
        "THIS IS SO GOOD",
        "God I love this masterpiece of a show. How do people still hate on this genius writing?",
        "The greatest animated show to grace television",
        "Let’s not forget that even the teaser had some weird incest-y themes with Rick marrying Morty. This just cannot be a coincidence",
        "Jerry Jr. is so cute... ",
        "falafel",
        "When it's show??",
        ":jakepeter:",
        "Get ready for another super-meta episode like the story train one.",
        "\"Cover your eyes on this part\" top kek",
        "Finally getting weird again. That’s what I wanted",
        "Rick n morty interacting with the intro is like marvel endgame",
        "\"WHY AM I BUTTER?\"",
        "I love every second of this.\nAnd with that every clip of the intro was real?",
        "Where can I watch season 6",
        "My depression is over",
        "what episode is that with jack the ripper?",
        "WHY AM I BUTTER?! lmaooo",
        "they didn't had to spend so much time on promo if they continued making episodes",
        "They left an empty seat for Jerry at the wedding. ",
        "1:20 “cover your eyes for this part”",
        "Clever",
        "Best: jerry is dead.\nWorst: naming your child after jerry",
        "Rick and morty is my comfort show. \nIt's not good in any way, but it's so poorly written and constructed it's good background noise",
        "I still dont get whey we had to wait 2 months for the last 4 episodes. like its not even half a season",
        "It looks like they are going different dimensions in the intro",
        "this is literally the best thing i have ever seen...",
        "No way, is this a late april fools joke?",
        "super excited, the production crew never fails to impress",
        "\"Previous Leon\"...not very pun-y, but a decent rug-pull nonetheless.  Kudos!",
        "lmao",
        "This opening scene is so hectic, I love it",
        "I don't get it, is this you being meta?",
        "Bro thats even better than when they suspiciously added Mr. Poopybutthole into every scene in the intro in season 2!",
        "Interdimensional cable 2 was not funny.",
        "This tricked me into thinking i skipped an episode",
        "they just keep breaking the 4th wall. love it",
        "Why was the show episodes on pause? First they put it until 14th november and now a 21 nov.",
        "Lol previous Leon",
        "Isn't Previus Leon the same bug that appears at the beginning of the previous trailer?",
        "This is so clever",
        "The episode promises a lot, I found it very cool how this fourth wall is, showing once again that Rick is aware that this is a show but Morty does not understand anything, an interesting point is that Rick says that the episode where Morty melts like butter is good , but not even if this episode aired, the question remains.",
        "Welp here I go watching again ",
        "Crazy how things can go from a yiff joke to a well written emotional ending. Well done and I can't wait to see the end of this arc. :-(",
        "If this ain't the best opening I've ever seen",
        "This is next level lol",
        "at least the show is self-aware enough about its incest metanarrative to know that if rick asked morty to marry him it would actually happen",
        "So happy Rick and morty is back",
        "I had to watch this, like, three times just to understand what's going on. Genius.",
        "i love how sudden and chaotic this was",
        "In my opinion this is the worst episode of rick and morty ever made, only slightly worse than the fortune cookie one. \n\nIts like the writers are so desperate not to follow a standard format for a show they just come up with random ways to try and be original and subvert expectations of what a cartoon should be. Simultaneously they made the plots way too convoluted AND way too simple. ",
        "So this would mean the episode is going to be short. \n\nI read than shows like than have changing titles use then to time the episodes, so by making the opening tittles longers the episode can be shorter with no problem. Example: the simpsons",
        "\"Why am I butter?\" lol",
        "0:13 :)",
        "Best cold open EVER",
        "Why... does adult swims actual trailer sound like it was recorded from someone else's speakers?",
        "Absolutely genius",
        "Ooook... now THIS is a way to announce the rest of the season. ",
        "This episode was a crazy spiral.",
        "A previously on spiral lol",
        "0:31 what the fu-",
        "“Why am I butter?”\n\nThis is great, when a show as consistently over the top can still surprise and delight you.",
        "I wønder whø’s the fåther øf sümmer’s kid in øne øf the 3 pårt nøn cånøn støry is?",
        "thats so genius damiit rick xD",
        "It’s previously or it’s going to happen.. man i am tripping rn",
        "This…. Changes…. Everything!",
        "At this point the fourth wall is just an idea on paper",
        "There better not be any incest in the second half of the season or I’m done with Rick and morty",
        "Bout Morty rickin time",
        "In the priest's defense, who doesn't love getting stung by a bee?",
        "Genius",
        "lol theres breaking the 4th wall and then there is this",
        "What the hell is the song at the end called?",
        "This is why i love Rick and Morty like omg",
        "The cashier girl one is true. I saw probably the prettiest girl ever working as a subway worker. 8-)",
        "wow wow wow this surprised me. se6 looks soo amazing",
        "This is epic",
        "Justin Roiland needs good direction and smart people to guide him. When he does his own thing and gets too much creative freedom it gets.... unbearable imo. My opinion.",
        "Why am I butter.... pff",
        "Morty will be confused why Rick left him, thats why Rick said to cover his eyes",
        "F-n genius.",
        "These are the kind of episodes I love from Rick and Morty",
        "Great, can’t wait to see this all a month late when it comes to the Adult Swim app",
        "\"Cover your eyes on this part\" I never laughed so hard lol",
        "I know Jerry's Death Will be undone but For some reason I love them actually being sad at Jerry's funeral",
        "Wouldn't this season have more conical stuff?",
        "Oh god...not another train episode",
        "0:06 \nMgrr",
        "O yeah more mind shocking sci-fi schenigans",
        "This is probably one of those episodes like mortys mind blowers, interdimensional cable, story train, etc",
        "Good soup",
        "All it confirms is that while usually every season opening has some scenes serve as actual events in that season’s episodes and the others are supposed to be adventures we haven’t seen them go through yet (according to Harmon), I assume this season’s opening won’t have any of its shots be included as plot points in it.",
        "Summer willing to call her son Jerry Jr. in honor of her father is kinda sweet. She does care. Jerry would have to die for her to show it but still.",
        "Kinda cool to hear sound effects on Rick and Morty intro now",
        "Jesus, they've gotten so Meta by this point that I fully expect the series finale to have Rick storming into the writer's room and demanding they just end the series already while claiming he's not going to go the way of the Simpsons or Family Guy.",
        "Very nice",
        "Trisha crying in the background of Jerry’s funeral is a beautiful callback",
        "Genius !",
        "Singlehandedly canonizing half the intro clips without actually doing episodes on them, clever and funny",
        "Where can we watch this new episode",
        "lol",
        "\"Cover your eyes for this part!\" ",
        "Omg, they're getting more meta every time...",
        "bu bölümü beğenmedim.",
        "I love this show",
        "Best Show Ever ",
        "I was really like \"ohh did I miss an episode?\". Got me there!",
        "love this <3",
        "Yall snoozed I don't even care anymore.",
        "\"Why am I Butter?!?\"",
        "This is so brilliant as always. How do they keep coming up with all these unbelievable ideas",
        "aaaaaaaaand here comes the pregnant summer fanart",
        "\"Precious Leon.\" Lol. I love that pun!",
        "Previous Leon ",
        "Nothing makes sense.\n\n- I love it",
        "That was so awesome",
        "Next on Rick and Morty: the recipe for Awesome Sauce is revealed!",
        "W episode",
        "Hey There my fellow Adult Swim fans! Season 6 of Rick and Morty Is BACK baby! WHOO!",
        "“WHY AM I BUTTER?!”",
        "this new season is possibly my favorite",
        "rofl Previous Leon",
        "\"Whose toxins?\"\n\"Previous Leon!\" \nI love that more than I should lol",
        "It would’ve been funny on the last scene if morty said r we ever gonna do that ep?",
        "Best episode yet to come",
        "Just way too good ",
        "I feel like i just watched an episode of Rick and Morty",
        "Is it just me or did they increased the incest jokes with every season ?",
        "I died laughing when morty said \"why am i butter?!\"",
        "Isn't that  considered breaking the 4th wall dimension.",
        "wasn't expecting that",
        "Previousleon has to be my favorite joke from this show by far",
        "so technically rick and morty just got married",
        "brick and mortar is honestly the best show ever i love it that theyre still making episodes\nedit: LOLLLL MY AUTOCORRECT MADE IT BRICK AND MORTAR",
        "This is the best way any show has ever come back from a hiatus!!",
        "goated series coming back",
        "i giggled at Previous Leon",
        "what",
        "This looks like the greatest fourth wall break ever",
        "BEST EPISODE! WHY AM I BUTTER??",
        "I genuinely can’t tell if this is a episode or a teaser because it’s that good",
        "It beber ceases to amaze me",
        "I like it. Picasso.",
        "I like how Rick is so smart he knows he just in a show but just doesn't do anything about it",
        "Happy enjoy ment to cartoon",
        "Oh my God this is actually really cool",
        "THAT WAS FANTASTIC",
        "This is absolute madness I'm so down for it",
        "these new episodes will be crazy like the previous ones without a doubt ",
        "This is epic!!! I can't wait for the next episodes, so far season 6 has been a total banger! ",
        "Sería genial ver a Doofus Jerry en esta temporada, sería LEGENDARIO!",
        "I wonder when season 6 will come out",
        "Bros on par with Deadpool with the 4th wall breaks  legendary man long live Rick and morty",
        "this looks like a 10 out of 10 episode!",
        "Why am I butter",
        "SUMMER HAVE ANOTHER KID?!",
        "Is…this a promo or an episode?",
        "Amaziinggg",
        "How high do u have to be to think of this ",
        "the way morty asks why hes butter very faintly is so good",
        "I find it mind blowing how far mods have gone in the last 2 years or so, allowing for online multiplayer in games that never had it. Mad props to the ones who figure this stuff out.\n\nEdit: ok, according to the replies, these have been around for longer than I thought. That doesn't make it any less mind blowing, but I guess it also means we should thank these content creators for giving it publicity. Or it's possible that they did have publicity in the past and I didn't know about it, I haven't been watching YouTube for that long.",
        "Didn't even know season 6 was out",
        "brilliant",
        "This is so cool!!",
        "Dan harmon does meta sooooooooo well.. its hard to creatively break the 4th wall these days",
        "this reminded me ofVoiceoverians",
        "1:11 ",
        "Some shows break the 4th wall. These guys straight up demolish it",
        "Thank you man. I love Rick and morty.",
        "If I had to choose one word to summarize this season it’s ‘Bizzare’",
        "This is why I love this show ",
        "Why does this audio sound like it was recorded from the inside of a soup can?",
        "meta\nshow for smart people",
        "This show is having a major comeback",
        "I loved hearing the dialogue between Mimir and Kratos in this episode, it really showed us how troubled Mimir is because of his past deeds, and how wise Kratos has become. Also, it's so great to see Sean having a lot of fun with this game! Can't wait for more episodes! =(",
        "HOW DO YOU GET MORE SCIFI THEN THIS??",
        "I WANNA WATCH IT",
        "This type of meta humor is way funnier than them just looking at the camera and saying, \"Wait, didn't Marvel do this already?!\"",
        "This is better than any of season 6 so far honestly",
        "ABSOLUTELY GENIUS!!!",
        "Lmao the content we need , this 4th wall break stuff Rick does just never gets old",
        "This was absolutely genius.",
        "What the juice is going on here?",
        "AMAZING!!!!",
        "WHY AM I A STICK OF BUTTER?!",
        "cant wait",
        "When s6e7 release",
        "bruh life with the guys coming up with this stuff must never be a dull moment.",
        "Is the whole season 6 gone on youtube. Is it just me or everyone",
        "If they're not careful, this show is going to fold in on itself and create a singularity.",
        "Man,  there's a lot of narration/ voice over bugs that keep screwing with their lives! Rick needs to come up with a universal flyswatter!",
        "Why am I butter> got me lol",
        "Ow ow ow ",
        "Rick is fighting off the narrator and his own intro 5 wall shi",
        "But when does it come to hulu",
        "Okay this was genius",
        "Was looking forward to a Victorian-era episode, but it would appear we've been duped.",
        "\"Previous Leon\".\nPriceless.\nNobody does meta/4th wall breaking like Rick and Morty.",
        "thats just amazing",
        "It’s raining meatballs",
        "This is a very good episode concept, which is pretty usual for this show, but sometimes it gets kinda bogged down in the B-plot. Like, the concept of an entire episode taking place inside of the game Roy is pretty awesome, but the B-plot during that episode felt pretty superficial and that concept was delivered very hamfistedly. Delivery is always difficult, and Rick and Morty is a decent enough show that I tend to give it a pass more than not when with another show I might just drop it and do something else.",
        "WHY AM I BUTTER?!",
        "I always find it amusing how Rick is aware that he and Morty are in a titular TV series when he told his grandson to repeat after him, \"Previously on Rick and Morty\" and \"Next time on Rick and Morty...\"",
        "My left ear loved this",
        "WHY AM I BUTTER!? Literally my exact question when that scene pops up for this season!! ",
        "ความชิบหายกำลังเกิดขึ้นเร็วๆนี้",
        "Brilliant idea and hilarious!",
        "Finally after a long wait! Very excited",
        "OH. MY. GOSH. THIS WAS THE BEST THING EVER",
        "Oh man they did. They brought the season one and two magic back. Serialized adventures with just the right blend of 4th wall breaking philosophical lesson giving we all needed and wanted is back baby!!!",
        "This is.. hilarious. \"Close your eyes on this part!\"",
        "Previous Leon :)",
        "So this is this seasons Interdimensional Cable/Anthology Train/Mortys Mind Blowers?",
        "Rick just said \"best episode\" looking forward to that",
        "oh my god that was so creative lol",
        "PURE GENIOUS.",
        "this actually looks like it could be a really good episode as long as it stays cohesive and doesnt jump around too much",
        "Story Train and this ep both being like GIVE GRANDPA A KISS",
        "I can't stop giggling at the cheesy brilliance of \"Previous Leon\"",
        "Why bother going on break just to release 4 eps. lmao",
        "i cant wait to watch this",
        "Rick and Morty knows what comedy is and I'm here for it. And Smiling Friends. 1:41 And now electrocution",
        "bro das ist einfach mega",
        "Nothing is ever simple with this show is it",
        "I love how rick is breaking the 4th wall like crazy",
        "Lol “why am I butter”",
        "I really hope they continue in this direction, season 3 wasn't bad at all, people just like to complain, season 4 was good but had 2 or 3 stinkers, and 5 was just, 5 was genuinely worse, EP 1, 3, 8, 9, 10 of season 5 were great, the others felt off. But all of season 6 has been great so far",
        "Previous leon is venture bros. Tier punny\nGood for them",
        "Can't lie that was fire. A parody of the opening that functions as the opening.",
        "Cant wait for the morty butter episode, Its supposed to be \"The best episode\"",
        "I was genuinely mad that I had to wait 6 weeks. But now I'm REALLY glad I waited lol",
        "That shock at the end legendary!!",
        "Season 6 delivering the quality that I was hyped for while waiting for season 3",
        "This will be one of the most meta episodes of the show. \nI'm so hyped!!",
        "i´m so proud for summer",
        "No way... I LOVE IT!!!\nI can't imagine how after all these years you're still surprising me like this ",
        "I'm so excited!",
        "RICK AND MORTY WEDDING!!!!",
        "I’m gonna love this episode and I’m not the only one who agrees.",
        "Close your eyes on this part lmao",
        "We going back to previous seasons energy ",
        "THAT WAS EPICCCC XOOO",
        "They should keep Rick and Morty being electrocuted in the intro scene. I think that was a nice touch ",
        "I'm hyped as Fvk",
        "I love seeing them in the background of the credits lol",
        "Wow",
        "My mind is …",
        "Every episode they one up the last! Shoutout to the writers for real!",
        "Most of these never happened at all",
        "When you think they get more meta",
        "This show will never go stale the amount of controlled insanity in every episode always has me laughing",
        "Legendary",
        "Love this show",
        "No other show has this type of material!,I love it!",
        "thank god they took a mid season break after their year long break between seasons lmao",
        "Jerry Noooooooooo!!!! ",
        "Rick days best episode as they pass the butter Morty pretty funny",
        "Everything in this video is all breaking the 4 wall which was really hilarious clips of Rick and Morty",
        "Request: Hot Streets season 3",
        "I always love when they break the 4th wall but i think this is my most favorite one",
        "Ive binged watched coryxkenshin while playing games, and pulling an all nighter. His humor never fails to make me laugh.",
        "i missed rick and morty",
        "1:20 Rick had a morty before morty c-137",
        "That opening was awesome!\nCan not wait to see it on E4 on next Tuesday!!!",
        "This has so much inset jokes Dan Harmon must really want his mom, sister or brother you make me sick ",
        "I can’t for tonight",
        "When are we finally getting the cthulu episode?!",
        "So godamn cool.",
        "That's amazing ",
        "Too bad they're killing off Jerry.",
        "Am I going to watch the new season yes I am even though I feel that the passion for this show gone, I'm not saying it's bad but I pretty much predicted how each episode was going to end it wasn't even a twist ending for me when evil Morty became president and I get the improv jokes but it's starting to feel a lot like family Guy when they describing what they're doing/jokes and running off those jokes, like when Rick tried to convince everyone that they're Morty and the 1 teenager were just describing what himself and the group in 3rd person",
        "Rick: \"Repeat after me, Morty. Next time on Rick and Morty.\"\nMorty: \"Next time on Rick and Morty?\"\n\nWell, next time is almost here. Cannot wait for the show to come back this Sunday. And I love how they were both flying on the bug during the whole intro.",
        "My brain melted a bit here 🫠",
        "super bro.",
        "Keith David again!?",
        "\"Previous Leon\" Perfect lol",
        "1:23 “Cover your eyes on this one” ",
        "is this a retcon of the shitshow that has been the past ~1.3ish seasons ???? it’s time.",
        "That was cool",
        "Suddenly, fourth wall to the face.",
        "They wildin'",
        "God I love this music. I swear, everytime they do an episode with the 4th wall so out of the place I just age a little less.",
        "Season 6 Interdimensional Cable episode lookin lit",
        "Awesome promo!",
        "GENIUS GOD I LOVE THIS SHOW",
        "Absolutely amazing. Alan Becker’s got (to his credit, a little) on this",
        "Yup , this is literally the best trailer ı ever saw.",
        "I loved the end",
        "We all love rick and morty I hope it keeps going such a classic daily show",
        "That's actually so clever",
        "I havent been hooked to a video like this in so long!",
        "the meta is just infinite",
        "yes yes and more yes!!!!",
        "I love how Summer and Beth are just happily watching Rick and Morty get married, completely fine with that it seems haha",
        "Jerry's parents with their lover from season 1 are in the audience of the wedding lmao",
        "Jaja que bueno",
        "The \"Cover your eyes on this part\" Is golden",
        "Gaddemit. I can't wait for the next episode of Rick and Morty",
        "Just incredible",
        "OMFG HOW DO THEY KEEP TOPPING THEMSELVES ",
        "thats the opening we all needed",
        "'Why am I butter!?'\nBest line of season 6.",
        "Probably the worst ep  we get it…rick knows hes in a cartoon… can we please get back to the actual reason alot of us started watching this show? \nMaybe when your done with the main story you can milk it for everything its worth…for now… boring af",
        "are we going to see time travel?",
        "Why am I butter!?",
        "Very nice video",
        "\"Im looking forward to Marty's apology video.\" Is what I would say if I didn't believe Marty was a self absorbed sociopath. \nGood on you Mick for coming forth with this.",
        "this is the kind of rick and morty i love and care about",
        "This might be the mist Meta thing I've ever seen",
        "Post about this blue pink hair",
        "The Knesset Channel, an Israeli public television channel focused on parliamentary (Knesset) issues, broadcast an interview on July 20 regarding the Chinese regime’s forced organ harvesting of prisoners of conscience.",
        "Morty: \"Why am I butter?\"\nWe're all wondering the same thing Morty",
        "Dear Adult Swim this season was so weak ...  I hope S6E7 will not disappoint us ... good luck",
        "I love this",
        "Oh wow. Rick n morty. Sounds like a brain blast of a time",
        "They didn’t break the fourth wall the disintegrated it",
        "Rick knew already he was in a show in S1 imo. And showed it clearly in S3. He is self aware, but does not really care since he is a nihilistic godlike being it is not really important in the first place.",
        "dang im gonna rub out so many on this one",
        "this is so many levels of meta",
        "Man I love this show so much!!!",
        "They literally turned a Promo into a little episode ",
        "me atrapaste, es cine ",
        "so meta",
        "We all must band together if we'll ever bring that awful Rick Sanchez to justice!",
        "laughed way to hard at Previous Leon",
        "All I can say is that everyone is speculating how Rick masters Immortality. I love Rock and Morty.\nIf I were a billionaire or even a millionaire I would hire the staff to make this a weekly show forever and ever. 8 episodes are not enough!!!",
        "Where can I watch this as soon as it’s realised today???!!!",
        "This episode is going to go real meta. Probably thumbing their noses at all the fans who just want a sense of continuity or changes in the show. SO THEY ARE GOING TO GIVE THEM WHAT THEY WANT! We have Summer having her first birthday that is actually shown to us and also saying she is pregnant. Jerry dies and then Beth is about to be executed for supposedly murdering him. Rick and Morty try to fight back against these insane shake-ups by having their own through marrying each other.",
        "\"Previous Leon\" I hope that's what I heard.",
        "I am glad the writers are still provided with the best drugs available.",
        "0:45 I was hoping Morty would be the father, that way him and Summer could have a do over from Naruto and they could raise their kid properly this time. But it doesn't look like that kid is his. Oh well",
        "Mortys meta-commentary on the opening credits is pure gold especially when he questions why is he butter",
        "previous leon? hilarious!",
        "I like this intro , a 4th wall break well deserved",
        "dear god this is the most meta thing I've ever watched my brain hurts",
        "When they’re flying past the Butter Morty getting melted “Best episode!” I want to see that episode now",
        "I know not many people like side quests, but i LOVE that you're doing them. Side quests let's us learn more of the world we are walking on, explore different sites, experience new things through the characters we play, see their interactions with other characters and watch as they change and grow through them. It feels SO MUCH richer and we actually get to grow EVEN MORE attached to each character as we play through the game. Absolutely LOVING it. Can't wait to see what happens next. ^^",
        "“I’ll be the judge when we get too meta” - Rick Sanchez (S4e6)",
        "This show and its concept of breaking the 4th wall.",
        "This season finna be the best season yet and a great comeback for them since season 4",
        "0:20 tricia at Jerry's funeral",
        "Excited. I’m so confused though.",
        "When they get shocked at the end ",
        "thats like waking up in a dream and recognizing you are dreaming. which i always fail to do. requires some more elevated level of consciousness or non-attachement to things that i still lack",
        "I don't remember anything that happened after the scene were Rick fixed the portal gun that was in the end of Eps 6  Summer getting pregnant and Jerry death  when did that happened",
        "Sometimes I can't remember if Rick and morty is a show that I'm watching or If RL is a show that Rick and Morty are watching",
        "Bring it back to HBO max I’d watch it if you give me an opportunity to I don’t want to get a cable subscription to watch your show!",
        "I think this is the first time we've ever heard noice from Cthulu at the very end of the sequence ",
        "What the hell ?",
        "I’m so ready",
        "Que ingeniosa ruptura de la 4ta pared",
        "F@cking brilliant!",
        "I’m just really excited for it to be back on November 20. I think it’s on the Sunday. I wonder what danger they’re gonna be in",
        "This makes me think about Morty's comment about \"How old are we? We had a million Thanksgivings\" and the fact Rick always breaks the forth wall. Maybe someone is making the characters do something that they never do which is grow up and that makes Rick suspicious with Summer becoming 18 and pregnant. Maybe the next episodes will be a major fourth wall break.",
        "Summer naming her baby Jerry jr. huh guess they really like each other",
        "“Why am I butter?!” ",
        "Rick and Morty interacting with the theme intro is the best thing I've seen since",
        "This time they are breaking the fifth wall.",
        "YES! ANOTHER INTERESTING CONCEPT!",
        "The first season where every part of the title sequence was part of the show.",
        "I went to Netflix to see if I missed episodes",
        "I am LOVING this set up for an episode, it gives me story train vibes with them both being trapped in a story device but this seems like it’s going in a different direction. Can’t wait to see it!",
        "The only season who breaks the fourth wall in every episode.",
        "About time!",
        "I paused at the funeral scene and I  noticed Tricia was in the background. Which made me laugh because she had a crush on Jerry before.",
        "I would not do any questions, i will just wait till sunday",
        "soooo I bought all the episodes so far on youtube until now and season 6 is taken off? K.",
        "\"Previous Leon! Grab him!\"",
        "fr/",
        "Lol Rick spoils by saying the butter scene in the next episode",
        "This was amazing.",
        "Executed way better than She-Hulk",
        "The same way Christopher Nolan has re-imagined movie structure narratives, Dan Harmon has done the same with sitcoms.\n\nBet you'd never hear those two being discussed in the same sentence.",
        "Finally, the intro is actually used in the episode",
        "Will the season 6 be on netflix? Do we know?",
        "Does the beat at the end of this video have a name? Would love to listen to it on repeat",
        "slow clapping",
        "Can't wait, broh!",
        "this show breaks more walls than I knew even existed. lol",
        "The third incest joke in the series. Wow.",
        "shows gettin meta",
        "i thought none of the opening cuts were gonna be in the season as episodes , i was wrong theyre all are",
        "I'd like to know the theory of why \"next time on rick and morty\" would counter act \"previously on...\" please.",
        "What just happened?",
        "Dude can someone please tell me where I can watch season 6 I don’t have cable",
        "God I love how much fun the writers seem to be having this season! That's a great opening, and custom title sequences are always appreciated",
        "This was dope",
        "Most meta opening ever",
        "thats a lot of spoilers",
        "I want to see Rick and morty playing multiversus as themselves in an episode this season",
        "Previous Leon. Thank you I hate it",
        "Why is the audio mastering back to being terrible again lol? The music and sound is muffled and the voices are coming from the left speaker",
        "1:22 : \"What planet is this\" / \"Cover your eyes on this part\"\n\nHmm.. Wonder if it means anything. Knowing them probably not just to poke fun at the theories about that part of the intro. But maybe it means quite a lot?",
        "That....was...awesome!",
        "So we gonna ignore that Summer is pregnant by her father  she really for the family first they have Naruto ( Morty and summer child) and now Jerry Jr. This is some BS"
    ],
    "comments_disabled": false
}