{"video_id": "R3mN0wyD06M", "comments": ["I like how Rick is so smart he knows he just in a show but just doesn't do anything about it", "It's amazing how they manage to get  us keep watching this  show after so many absurd and terrific plot twist. I do envy the screenwriters creativity sometimes", "I love how Tricia is crying at Jerry's funerral after he died being stung to death by bees. It's just feels right.", "The writers of Rick and Morty are stupidly genius .  They don't just break the 4th wall, they grind it to pieces and make you complicit", "1:12 I like that they actually continued on the chase through the opening sequence of the show, and they reacted to what's happening or not! They even added sound effects to this!", "This is a perfect example of Justin's chaos mixed with Dan's meta level storytelling that i started watching for", "This is the best way any show has ever come back from a hiatus!!", "“Why am I butter?”\n\nThis is great, when a show as consistently over the top can still surprise and delight you.", "Mortys meta-commentary on the opening credits is pure gold especially when he questions why is he butter", "Honestly, Beth being in love with herself was so Rick of her that I can't stop thinking about it. (She's probably the best person for herself too, let's be honest)", "During the part where they were flying through the intro, I could not stop laughing. I cannot wait for this episode.", "Maybe I’m cheap and easy to please but Previous Leon has to be one of the best jokes the writers have come up with", "\"Whose toxins?\"\n\"Previous Leon!\" \nI love that more than I should lol", "Honestly, Dan Harmon might have my favorite meta writing of any show or movie! Meta stuff can go off the rails so quickly and be so jarring but he manages to do it without knocking you out of the story. Absolutely brilliant!", "Rick and Morty never disappoint. Things like this made the series so fresh and funny.", "This show’s officially become too meta. \nIt’s fun.", "I watched this at least 30 times, best preview on adult swim by FAR!", "Great way to come back after hiatus.", "Justin Roiland never gets tired of discussing and yelling to himself and i'm here for it!  ", "The people behind this show are so creative I love it", "This type of meta humor is way funnier than them just looking at the camera and saying, \"Wait, didn't Marvel do this already?!\"", "Crazy how things can go from a yiff joke to a well written emotional ending. Well done and I can't wait to see the end of this arc. :-(", "Really loved the part where Rick said  \"it's squanchin' time\" and squanched through several episodes. Truly one of the schwifty moments of all time.", "This show will never get old with skits like this.", "I love this. I found it hilarious how morty sees himself melting as butter and he goes “oh why am I butter” maybe it’s early but that was funny", "Aw man I can tell the upcoming episodes are gonna be absolutely amazing!! I can't wait to watch them!!!", "And they tell you Rick and Morty is living it's downfall. Man, this is awesome.", "I can't believe this show is becoming better and better after 5 seasons...", "This show never ceases to amaze me.", "I love how every completely insane event they go through Rick catches on as if he’s gone through it once before", "I always find it amusing how Rick is aware that he and Morty are in a titular TV series when he told his grandson to repeat after him, \"Previously on Rick and Morty\" and \"Next time on Rick and Morty...\"", "Its good to see Jack back in the routine of a video every day, not because he feels he has to, but because hes genuinely enjoying every moment of it. Hes come so far, and yet I can see he has much farther to go. Glad to be here :'(", "Man this cold open is the funniest thing R&M did in a long time.", "This looks like a top tier episode! Absolutely amazing cold open.", "Esse restante de temporada vai ser lindo ", "I am LOVING this set up for an episode, it gives me story train vibes with them both being trapped in a story device but this seems like it’s going in a different direction. Can’t wait to see it!", "I paused at the funeral scene and I  noticed Tricia was in the background. Which made me laugh because she had a crush on Jerry before.", "this actually looks like it could be a really good episode as long as it stays cohesive and doesnt jump around too much", "By doing this, all of the intro scenes actually happen in the show now.", "\"Cover your eyes on this part\" I never laughed so hard lol", "Bro, I actually had my arms up like a little kid rooting for them to escape. This show takes me back to simpler times when I could just be a goofball all day.", "I think the reason Rick always breaks the 4th wall is simple. The whole concept of the show's multiverse is that everything is possible. So there's a possible dimension where people observe other dimensions and call it \"watching tv-shows\" (our universe, essetially). I mean, remember interdimensional cable? Rick figuered that out and started playing along, because why not. He loves to treat his ego, he imagines himself as some sort of a celebrity (he is not wrong actually). Rick doesn't consider himself being fictional character. All that happens is real for him. He just knows that there's a possibility that someone is watching his and his grandson adventures.", "this looks like a 10 out of 10 episode!", "What a piece of art! I just hope it never gets forgotten.", "I always love when they break the 4th wall but i think this is my most favorite one", "The train episode was actually my favorite episode of the show so far, so needless to say, I'm looking forward to this one!", "I like how the had Tricia crying at Jerry's funeral. Nice attention to continuity.", "Can’t wait for this to come back. Love when they do these absurd 4th wall breaks.", "This is so brilliant as always. How do they keep coming up with all these unbelievable ideas", "This show just keeps getting better and better :D", "The only season who breaks the fourth wall in every episode.", "I like how Rick notices something was very off.", "This makes me think about Morty's comment about \"How old are we? We had a million Thanksgivings\" and the fact Rick always breaks the forth wall. Maybe someone is making the characters do something that they never do which is grow up and that makes Rick suspicious with Summer becoming 18 and pregnant. Maybe the next episodes will be a major fourth wall break.", "This show is honestly the greatest animated show I’ve ever watched. Easily the most creative and clever ones too. They deserve awards", "We all love rick and morty I hope it keeps going such a classic daily show", "Sería genial ver a Doofus Jerry en esta temporada, sería LEGENDARIO!", "I love this show so much, it just keeps blowing everything else right off the schedule.", "Only Rick and Morty would come up with something like this! Good stuff, great way to come back after hiatus.", "i love how sudden and chaotic this was", "This opening scene is so hectic, I love it", "Love this show man glad it’s back again", "This will be one of the most meta episodes of the show. \n\nI'm so hyped!!", "If they're not careful, this show is going to fold in on itself and create a singularity.", "I genuinely can’t tell if this is a episode or a teaser because it’s that good", "When they’re flying past the Butter Morty getting melted “Best episode!” I want to see that episode now", "The greatest animated show to grace television", "Absolutely love this show", "1. How can you not love the team behind this show. Look at all they did just for a trailer. :)\n2. WHY IS HE BUTTER? THEY BETTER EXPLAIN THAT!", "This will be one of the most meta episodes of the show. \nI'm so hyped!!", "this has me super excited for the rest of the season! hopefully it continues to be as creative as this", "bruh life with the guys coming up with this stuff must never be a dull moment.", "They took 'breaking the 4th wall' too personally this time \nCan't wait to see it!", "This is epic!!! I can't wait for the next episodes, so far season 6 has been a total banger! ", "0:08 This bit just gets me everytime the way Rick just says “This happened too?”", "God I love this music. I swear, everytime they do an episode with the 4th wall so out of the place I just age a little less.", "These are the kind of episodes I love from Rick and Morty", "Anyone notices Summer's friend crying in the background of the funeral scene? The one who said she wanted to smash Jerry while watching him beekeep. I love this shows and its constant callbacks/Easter eggs.", "I never thought I would smile while being betrayed", "This episode looks like a mind trip", "Morty: Ow! Why am I butter??? Had me laughing. ", "The wait will be well worth it. Justin Roiland was right about this season being more story-oriented. I can’t wait to see how the Prime Rick plot line will unfold.", "Ive binged watched coryxkenshin while playing games, and pulling an all nighter. His humor never fails to make me laugh.", "Season 6 delivering the quality that I was hyped for while waiting for season 3", "This season has been amazing!!! Stoked for Sunday!!!!", "This is exactly why I love this show only they would do this", "They literally turned a Promo into a little episode ", "\"Cover your eyes on this part\" lmfao man I love this show!", "Rick says cover your eyes at this part which means that he's seen that scene in the opening before. I always thought it was that the opening was alternate versions of Rick and Morty apart from the ones that we follow but always found it strange that it always starts the same way. I think this first scene in the opening with a Morty getting eating has more significance than is being let on.", "Woah, that ending where they had to go on multiverse of the opening is so trippy", "This show has its magic back.", "The episode promises a lot, I found it very cool how this fourth wall is, showing once again that Rick is aware that this is a show but Morty does not understand anything, an interesting point is that Rick says that the episode where Morty melts like butter is good , but not even if this episode aired, the question remains.", "No other show has this type of material!,I love it!", "you simply cant hate this show", "This show is beyond genius.", "Looking forward to seeing the rest of this awesome season!", "This show is having a major comeback", "All it confirms is that while usually every season opening has some scenes serve as actual events in that season’s episodes and the others are supposed to be adventures we haven’t seen them go through yet (according to Harmon), I assume this season’s opening won’t have any of its shots be included as plot points in it.", "I love how rick is breaking the 4th wall like crazy", "I LOVE THIS SO MUCH, OMG CAN'T WAIT FOR THE NEW EPISODE!!", "Dan harmon does meta sooooooooo well.. its hard to creatively break the 4th wall these days"]}