{"video_id": "R3SbBNyMYHA", "comments": [" Make sure to check out Eddie's video- https://www.youtube.com/watch?v=Cb3OrhNzqcM", "The chemistry between Brian and Eddie is gold. They should do more together", "Eddie still remains a man of honor and a man of his word.", "I don’t think I’ve ever seen Brian happier than when he was throwing ice at Eddie  comedy gold", "These two could make a documentary doing literary nothing but being themselves together and I'd sit and watch it for hours", "Brian absolutely dying while throwing ice at Eddie is hysterical  These two need their own TV show", "It's nice to see Brian take his son out to do things like this together.", "It’s great to see Brian and Eddie creating content together", "There isn’t NO two people on this entire platform that go together as good as these two do. Eddie is just to funny,", "The chemistry between these two. Smiling through the entire video.", "Brian's expression says it all, he really feels sorry for Eddie, he is too gentle for this kind of thing ", "brian, eddie, nick and robert's friendship is gold.  they bring me joy.", "I can always count on a laugh when Brian and Eddie are together. ", "Haha 5:25 Brian chucking ice at Eddie is the happiest I've ever seen him", "Watching these guys do anything together is pretty damn awesome, Better than anything on TV...", "Kudos to Eddie, took it like a man. Loved the hug at the end, so heartwarming, made my day !", "It’s so great to see the light hearted side of these two amazing athletes!  It would be fun to see Brian do a London trip with Eddie now.", "Imagine witnessing these two in public not knowing about their banter the looks they’d get  really hope they do some form of series at some point in the future ", "Eddie is literally a man of his word. But in fairness this video really makes me laugh and cry at the time . I hope you two had more videos together. You made my day very uplifting guys.", "These two together are the best thing going on YouTube by a mile, nothing even compares", "These two giants hugging each other is so wholesome. Tells a lot about their friendship.", "There isn't one other youtube channel that gives me a big fat goofy grin as much as when these two are together doing literally anything.", "The lean on the truck at 1:30 showed the look of a \"what the hell did I get myself into now?\" \n\nBoth of your uploads are just even more fantastic when you're together! The boys are back in town!", "I wish I had friends like this to do things with. Love watching yall both. Never a dull moment.", "Absolutely brilliant. Loved the fact Eddie was more worried about his croc than the cold !! \nLoved Brian throwing the ice to rub it in !!", "Got to give eddie props for giving Brian this video. This is so good", "Eddie is a legend, I love seeing Brian and Eddie together", "That was great, I laughed so hard, good to see Eddie finally get a taste of his own medicine when Brian was throwing ice adding insult to injury… ", "Rarely you see Brian enjoying himself so much. That was hilarious!!!", "Eddie actually looked like he was managing quite well in the ice. I bet he could’ve stayed in for quite a while, but we all would be in shock calling for an ambulance", "This has me crying with laughter. Especially when Brian started chucking the ice at Eddie. ", "These two together is always the best! Lol too funny!!  like brothers always messing with each other in some way … we need more of you two together", "You two are freaking hilarious. Please keep the content going. If you could get Nick  and Obi in on the fun it would be explosive. Cheers boys!!", "This is a golden ticket video format. Eddie and Brian just chilling together doing bro stuff. It seems like everyone could watch this for hours.", "That was absolutely hilarious, I was sniggering the whole way through, gotta love Eddie ", "This is one of the funniest things I have watched in a while. The pure joy on Brian's face makes the video. These two are so funny together.", "Daw poor Eddie. Ya did it. Its always great when you two are together. Great mates. Love the warm bro hug at the end.  We will all continue to gather round and hear about your records :) .", "This was actually hilarious. When Brian started to throw the ice, I couldnt stop laughing", "You two together is always so freaking hilarious, I love it. Eddie is a champ for doing this!", "Honestly that was hilarious. Love to see you guys making this content together!", "That's was hillarious. Such good synergy between Brian and Eddy. Need more of this is in th future", "So funny. Eddie looks so different without his facial hair.", "Loving this stuff with Eddie, always enjoy your videos together.", "When you two are together it is always comedy gold. Thanks for the laughs and great vids as always", "Best duo in youtube history.  These guys  would be a blast to hang out with ..  on a different note as someone from northern Canada, seeing eddie make a scene  about 7*c  weather is hilarious.. that's shorts and t-shirt weather ", "Post retirement we defo need a full on series with these two", "Brian and Eddie are just brilliant to watch", "When Brian gave (freezing, shivering) Eddie that hug at the end, it was ultimate wholesome friends vibes", "We Love Ya Eddie! Much Respect For Keepin Your Word!!", "You two are always fun to watch together.", "Still amazes me how Brian standing next to Eddie makes Eddie look so small.", "These two are ment to be together... Perfect chemistry!!! Love it when they film together", "Spilled my drink from laughter when Brian started to use ice  :)  this was gold :)", "Big props to Eddie for following through on the bet! Great job!", "Eddie is a class act for going along with this.", "This is exactly what I needed today.   Love ️ you two bone heads.", "Tears in my eyes laughing. And proper respect to Eddie I can tell that sucked but he committed", "Good to see you two sharing some time together again.  More power to you Eddie you held up your end of the deal.  Surprisingly Brian doesn't have a super oversized cold tub at his new gym.", "Collaborations with Eddie will always be entertaining and appreciated.", "Love these two together. It’s just comedy gold. And good friends.", "I say it all the time a studio should get Brian and Eddie to do a show together would be awesome...Comedy, history of strongman and going to events to interview and create mayhem.", "Watching every video more than once on both channels, just epic content, we’ve been waiting a very long time for this. You guys should do more and I have to say, B is looking in the shape of his life, just brilliant. Awaits more BS/EH content with anticipation…..!", "Brilliant! I cried with laughter watching that. Well done to Eddie ", "Brian and Eddie are the best duo, I hope they get a show together one day or something", "Always good to see the real friendship these two share in a sport that has a lot of prideful, competitive men that's hard to find among strongman athletes. Funny great video. Thanks Brian and Eddie!", "Been awhile since I burst out laughing at a video. Thank you sir!!!  And it’s good being able to like Eddie again since it stopped with his personification prior to his fight with Hathfor.  Good show Eddie!!!", "Brian throwing ice at Eddie like he was throwing bread to ducks at a pond... Gold!", "I've never seen Brian laugh properly before. He's REALLY loving this.", "Eddie and Brian content is always the best content! <3", "You guys are pure gold when you are together!!!", "The most impressive feat I've ever seen from a 5'9 man", "Brian throwing the ice is my new favourite Brian and Eddie clip by far ", "It's the best watching 2 of the strongest humans ever, acting like brothers messing about, causing trouble. ️", "The look on Eddie's face when Brian hugs him is pure gold.", "You guys are always hilarious together. Love it.", "That's insane. Eddie is a man of his word it seems.", "Poor Eddie at least  he's a man of his word!! You two are great  together", "Seeing your friendship really warms my heart! True buds! This is so awesome!", "Brian is probably one of the only people on the planet that can make Eddie look small. Such a nice hug lol.", "I love this collab!! Love the chemistry and humour! Awesome video", "A bet is a bet and Eddie pays when he loses so it's all good. I love you guys, you make me laugh and you inspire people also. Champions both of you.", "Pure entertainment haha cool guys. Love it! Eddie’s face at 5:55 ", "Eddie screaming “I’ve lost me crock” gave me my laugh for the week ", "You guys are awesome! What a great team loved the video", "This is like the new Rob & Big. They need their own show. Always comedy gold, together.", "This was awesome! Love seeing you guys together it’s always a good laugh ", "Laughed all the way through this, what an elite duo", "Love seeing Brian and Eddie together!", "Always s good video when brian laughs so hard at eddie. The chemistry you two have is inspiring", "I could watch you guys together all day! Funny as hell!", "You two are brilliant together! And fair play to Eddie, he didn't mess about getting in there either!", "Awesome video and props to Eddie big time! Help up his end and didn’t wimp out at all, balls deep baby!", "You two just work so well together. Very entertaining", "I laughed out loud when you threw ice cubes at poor Eddie. Hahahaha. We need lots more videos of the 2 of you ️.I think they all think I am crazy now at the gym. Hahahaha", "Brilliant seeing you boys together again.", "Man it's so fun to watch you and Eddie, fkn dreamteam for content!", "That bro hug when he got out the water. You know these two are the bestest of mates. Bros for life.", "Always love when these two get together! Man that really looked like it sucked pretty bad.", "I hope eddies little eddie is doing well after this, we still need more of his genes in this world", "That was hilarious, whenever these two get together you know there will be comedy."]}