{
    "video_id": "R3SbBNyMYHA",
    "comments": [
        "eddie good job man i wouldn’t do that",
        "Eddie with the beard: Strongman of the world\nEddie without the beard: 40 year old depressed dad\n\nNo insult to y'all, love ya",
        "That was great, I laughed so hard, good to see Eddie finally get a taste of his own medicine when Brian was throwing ice adding insult to injury… ",
        "Non armwrestler Eddie Hall has never been so British in all his videos!",
        "That was beyond nuts !!! The mud, ice and freezing water !!! Wow Eddie BEAST MODE !!!! well done well more like  raw and frozen",
        "Eddie Probably going to grow a fourth leg now",
        "Brian throwing Eddie a bone - he didn't have to submerge! :)",
        "Who stole Eddie's goatee, he looks like a different person",
        "I hate family friendly non vulgar content. But these guys make me smile every vid. It's awesome",
        "Brian loved every second of this",
        "Watching every video more than once on both channels, just epic content, we’ve been waiting a very long time for this. You guys should do more and I have to say, B is looking in the shape of his life, just brilliant. Awaits more BS/EH content with anticipation…..!",
        "So damn funny when Eddie started sinking and lost his croc lol Laughed so hard",
        "Freezing is a choice Edward.",
        "A pair of floaties would have been great",
        "He should have deadlifted 500kg while he was in there. That would have been impressive.",
        " I have never laughed so hard in my life",
        "Pure Comedy. Busted out laughing while my friend was on a business call. Couldn't hold it in. Love seeing you guys together!",
        "You should have forced him to shave TOTALLY. I bet he has a really babyface when he does that. lol.",
        "Amazing",
        "I love seeing them both in videos together",
        "\"A loss is a loss. Take it like a man\" - Eddie Hall (2022)",
        "quality haha",
        "Love seeing Brian and Eddie together!",
        "These guys are big children. lols",
        "Good job eddy a bet is a bet and you took it like a man lost of respect and these videos you both make are funny and awesome congrats to you both for all of your success",
        "This is just pure gold content d:",
        "Absolutely love these videos with E",
        "That's insane. Eddie is a man of his word it seems.",
        "Lol",
        "The friendship that has come from competing against each other the respect had developed in to the closest friendship",
        "Eddie is the man! Love watching you two together I always laugh",
        "A bet is a bet .",
        "7:30 I don’t remember that part of broke back mountain",
        "Why 34 degree in description  for insisting people to click on the video?? Ah is the water temperature and 45 is day temperature.",
        "Where's the big ob has he gone in hiding big mate he hasn't even posted on his channel has he gone shy or scared lol",
        "Eddie with little facial hair is weird to me",
        "Eddie looks like Cartman",
        "Collaborations with Eddie will always be entertaining and appreciated.",
        "I've never seen Brian laugh properly before. He's REALLY loving this.",
        "I was laughing pretty good at this. To be fair, I thought Brian said that Eddie had to fully submerge in the water, which he didn't do so he technically didn't fulfill his end lol. Technicality though haha",
        "I would have probably died",
        "These two need a podcast together",
        "Win hof that one!",
        "You guys are always hilarious together. Love it.",
        "I laughed out loud when you threw ice cubes at poor Eddie. Hahahaha. We need lots more videos of the 2 of you ️.I think they all think I am crazy now at the gym. Hahahaha",
        "Brian throwing the ice is my new favourite Brian and Eddie clip by far ",
        "Love this ",
        "Beardless Eddy just seems wrong",
        "Thought it was 34c lol",
        "Grow your beard man",
        "I think Eddie hall should have a holiday home in Colorado right next too Brian Shaw \nAnd Brian should have 1 in England right next door too Eddie \nAnd the content will make it self man you to work well together",
        "LMFAO good punishment",
        "TV Gold ",
        "These men are not friends they are brothers. Chucking ice cubes at him while he is freezing is something only a brother would do.",
        "",
        "eddy hall following through on a bet...\nhow about that.",
        "Really not that big of a deal they both soak in ice baths every day",
        "Came from Eddie's video.... 2 giant toddlers!",
        "I love the banter between eddie and Bryan, please WE WANT MORE, WE WANT MORE thank you",
        "I would watch all Eddie and Brian content. Guys keep it coming ",
        "Eddie looks like he got chubbier",
        "Eddie is only guy that can keep up with Shaw",
        "Eddie looks like the British cartmen off of South Park",
        "Fair play",
        "Who’s the dude filming with Brian",
        "Eddie literally looks like a giant little kid!! ",
        "Brian always makes me forget that Eddie is actually a massive dude at a height of 1,9m because he just dwarfs him \nAlso that chuckle while throwing the ice at Eddie was gold",
        "I really felt bad for Eddie!",
        "It's the best watching 2 of the strongest humans ever, acting like brothers messing about, causing trouble. ️",
        "Brian and Eddie are the best duo, I hope they get a show together one day or something",
        "ba ba brrr man!!!",
        "Funny ",
        "Fair play I was chuckling with these pair they should do more together but Eddie come on you done a colder ice swim before with Ross",
        "Luke Stoltman: it makes me HAPPY.",
        "The bromance is real ! Fun video indeed! Eddie is tuff , 7 degrees?! Ouch that's Cold",
        " awesome!!!!",
        "Two of the sexiest men on YouTube ",
        "These 2 should make a comedy show together",
        "You guys could have your own TV show!!! ",
        "I can’t stop laughing as Brian gets the stuff out of the back of the truck. Eddie’s attitude is AWESOME!!!! The funniest video I’ve seen in a very long time.",
        "Cold or not, that place is beautifull.",
        "Brian is probably one of the only people on the planet that can make Eddie look small. Such a nice hug lol.",
        "eddie's the human walrus we didnt know we needed",
        "Brian being the pushover to Eddie's antics through the years. \n\nThen...",
        "That made me laugh hard",
        "Yes Eddie - it WAS quicksand :) :) :)",
        "You can say alot about Eddy but he is a man of his word",
        "There was a time when Eddie had a very good physique. When he weighed about 23st a few years back.",
        "Bro I need to meet these guys haha",
        "Came right here after Eddie’s video haha",
        "Thank you so much for the laugh!! ",
        "Nice job Eddie! Thankyou Brian for the entertainment!",
        "Luke Stoltman would be watching this thinking that it was a reward not a punishment ",
        "That’s not Eddie. Who is the chubby Brit?",
        "That was hilarious, whenever these two get together you know there will be comedy.",
        "Helluva Man Eddie!!",
        "we want a tv show!!! we need an eddie n brian tv show!!!!!!",
        "I love these guys but that was legit dangerous...you need to have a plan, like a rope, in case he got stuck in the mud/water.",
        "there's an ice layer on the water, and he still ask if 34 is cold. Mate your balls about to tuck in your stomach.",
        "That was impressive.  Awesome job Eddie!!!!  Love  all of this content.  It's the dynamic Duo. ",
        "Get a stoltman to do that there will be no crying like a little girl",
        "These two together are the best thing going on YouTube by a mile, nothing even compares",
        "Can anyone confirm if the thor tattoo is still there?",
        "Gosh....Eddie looks decidedly DIFFERENT with no facial hair.  BETTER in some way.  Maybe because he is less heavily muscled and more cuddly-looking.  (Alex must be quietly pleased)",
        "Hilarious!!!",
        "Brian's seems like he'd be a very good loyal friend.",
        "“I’ve lost me croc!”",
        "Man that looks dangerous. What if there was a quicksand in the mud? Would've been life threatening.",
        "This is love",
        "God I love watching y'all make videos together.",
        "Brian throwing ice at Eddie like he was throwing bread to ducks at a pond... Gold!",
        "4:35 “I’ve lost me croc! Noooo!” ",
        "Dude that would be so cold I hate getting in the heated pool at the rec complex It’s still cold asf",
        "What a great sport!",
        "Funniest sht i've ever seen",
        "Eddie Hall and Brian Shaw the World's Strongest Comedy Duo",
        "haha",
        "Thankfully Eddie saved the Crocs. Lol",
        "These guys need to do a travel show. Comedy Gold.",
        "This is brilliant made my laugh",
        "Someone please buy Eddie some board shorts ",
        "That looked really hard, nice of Brian to throw Eddie a bone.",
        "That was hilarious , hahahaha.  Congrats to Eddie on the punching machine score. omg man hahaha",
        "Glad he didn't get hurt.",
        "That was the funniest thing I've seen in a long time. and I watch a LOT of stupid videos .But this GREAT! I LAUGHED SO HARD & LOUD. My neighbors came out to see what was going on!  Thank You Both!",
        "Always love when these two get together! Man that really looked like it sucked pretty bad.",
        "Big respect for this man, that looks a little bit like Eddie Hall! ",
        "To laugh your head off whilst plunging yourself into icy muddy water shows more than strength mate it shows bloody good character and toughness. Well done to you oh and it reminds of when clarkson got pushed into the ice. And you handed it a lot better than he did",
        "That looked brutally cold!!!",
        "Brian has a \"cold tub\" he made his wife get in.  Making Eddie do it in a nasty pond or whatever that was and Eddie actually did it shows how much honor he has.  After the whole boxing loss perhaps he shouldn't be making any more bets haha,  he doesn't seem to be having much luck these days.",
        "the hug at the end lmaoo",
        "7? Ahaahahahahahahha thats not that cold and im a bloody aussie who doesnt get snow  i think you need some concrete mate ",
        "It’s great, but the guy has a cryogenic freezing machine that he trains with. Still funny though",
        "Eddy you need your beard back lol",
        "I kept waiting to see a rubber ducky go flying.  Awesome fellas!",
        "These two lads have great chemistry and am enjoying their vids together keep it up ",
        "He didn't submerge",
        "Few people know this but Eddie shaved his beard because it gets in the way when he tries to kiss Brian",
        "Well payed",
        "Impressive",
        "This video would make Luke Stoltman happy.",
        "Man it's so fun to watch you and Eddie, fkn dreamteam for content!",
        "A bet is a bet. He did it and kept his word much respect that's a Man for you. Only real men keep there word.  Both you guys are truly cool to watch together.  Keep up the hard work",
        "The cuddle made the whole video!",
        "i love these 2 together. best collabs. funniest chemistry together",
        "This was great",
        "Eddie + Brain = Lovely Content",
        "Great to see two proper Men having a good laugh together. The banter these two have between themselves is hilarious!",
        "Way to man up Eddie. Lol",
        "Eddie reminds me of an enormous 12 year old, specially without the beard.",
        "STOP CHUCKIN ICEE!!!! ",
        "its the human version of brian and stewie from family guy eddies stewie duhhh",
        "currently sick sitting in my campus common area after my exam... this is exactly wht i needed today XDDDDDD",
        "you two are awesome. surprised brian gave eddie lots of credit. he won over brian right there .lol",
        "Thanks for the laughs!!!",
        "Could you imagine driving by and witnessing that scene? Two very large men, one in the water, the other throwing ice cubes at him. In the winter!  It doesn't get any better than that!",
        "Brian, how bad did you want him to wear board shorts instead of the British bikini?",
        "Eddie’s “I’m cold” was so sweet.",
        "@4:00 \nEddie: This is like quicksand isnt it?\nBrian: No\nEddie: [sinks into the sand]",
        "Eddie’s got balls. I woulda never gone in",
        "\"I got a bone to pick with you\", seriously a random bone in the back yard, you can play ice baseball with the ice and bone. While your added make yourself a nice margarita.",
        "You to together are brilliant it’s so good you both remained good friends after all the strong man comps ",
        "Eddie was pathetic during his boxing match with Thor... all respect lost. His big mouth was despicable.... very disappointing that you would bring him back on your channel Brian,  you're better than that man. Eddie showed his true character, and it wasn't good",
        "I'm so happy these 2 are friends.",
        "\"I've lost me croc!\" ",
        "4:34 \"I've lost mE cROc\"",
        "Hahaha i winder who would win in a hit or cold challenge mainly cold. Should get a few guys together to see who can last longer in an ice bath",
        "Eddies got a man gina",
        "Eddie used to look slimmer. Did he stop training",
        "I did not need to see a man of his stature in a bikini bottom that small but I still watched.... But I laughed the whole time.    ",
        "You guys have great chemistry man. Awesome video.",
        " love this",
        "thats not a challenge! you two are used to ice tubs! xD",
        "Eddie looks so differently without his facial hair lol",
        "Eddie is the BEAST",
        "Hardest I've laughed in a long time, love these guys!",
        "Great video!",
        "34 Celcius",
        "Saving that crocs is harder than his 500kg deadlift",
        "It’s so great to see the light hearted side of these two amazing athletes!  It would be fun to see Brian do a London trip with Eddie now.",
        "look how skinny eddie is :D",
        "You two r great together",
        "Best duo in youtube history.  These guys  would be a blast to hang out with ..  on a different note as someone from northern Canada, seeing eddie make a scene  about 7*c  weather is hilarious.. that's shorts and t-shirt weather ",
        "I really do not like Eddie so I loved this.",
        "buhahahahahahahahahahahahahahahahahahaha",
        "Love the Father & Son duo",
        "awesome job EDDIE",
        "I would only do that if I knew I had a sauna available within 2 minutes of leaving the water.  Well done Eddie.",
        "The most impressive feat I've ever seen from a 5'9 man",
        "Getting  in Cal",
        "Eddie’s face is priceless when the water went past his waist line",
        "I seriously am so disturbed but also absolutely can’t stop laughing",
        "LOVE TO THE MAN PRETENDING TO BE EDDIE HALL WITH NO BEARD!!!! Lol",
        "As an English person, I saw 34 degree and thought \"that sounds a bit warm to be frozen\" until I realised the temperature must be in fahrenheit...",
        "i love how Eddie is just so cold that he doesn't even realize that Brian isn't even counting, saying 14,13, 18, 17 and Eddie has no idea lol just trying to get through it.",
        "Can we get the average man (5ft9) to stand near these two guys at all times as a reference for how big they are. I forget that these guys are absolute giants.",
        "Two giant kids at play. Awesome,  definitely want to keep these two laughing and happy. Imagine if it were the other way and they were too big mean kids? \nYeah it's better they are laughing and playing!",
        "I haven't laughed this hard in a loooong time!!",
        "You tube Gold right here ! ",
        "Impressive its first time i not hear eddie swear every two second. Thats impressive!",
        "A bet is a bet and Eddie pays when he loses so it's all good. I love you guys, you make me laugh and you inspire people also. Champions both of you.",
        "I don’t think I’ve ever seen Brian happier than when he was throwing ice at Eddie  comedy gold",
        "RESPECT!",
        "As usual, he didn't double dip. Good man.",
        "Hilarious",
        "These two are class together",
        "Eddie is a class act for going along with this.",
        "you should of also pulled out some rubber ducky inflatable ring floats to go around eddies arms or his waist!!! lol maybe some girl eye goggles and a snorkel too! : )  good show guys, love you both. great friends you are!",
        "Absolutely hilarious ",
        "What in God's name are these adult men doing? Are they a couple? They seem very familiar with each other. No judgment.",
        "Edie and Brian ,, they always look out for the next Generation of Strongman ,,, 2 of the Best",
        "7:34 Eddie Hall is already twice the size of an ordinary man, and here he looks like a child next to Brian.",
        "This video has made my day  what a pairing.",
        "somebody get this man a Harley and some sun glasses.  STAT! We got a bad ass over here!",
        "Shoulda taken him out to Eleven Mile and had him walk in from the boat ramp ",
        "Eddie looks like he drives a street glide",
        "Eddie never backs out of a bet, his word is gold!!",
        "That was the funniest shit I've seen in a long time",
        "With the hat and no goatee I literally thought that was just some dude until he started talking",
        "Ya know alot of people give Eddie alot of hate about his attitude. But he takes as good as he gives. Does he talk alot of shit, yea. He also takes it with a smile on his face. I call him a loveable asshole.",
        "MORE EDDIE AND BRIAN PLEASE",
        "At least they own their bets, or loss there of. ",
        "Does Eddie still have the hafthor-tatoo on his left toot? at 07:54 you have a pretty clear view",
        "Has anyone else knowticed how little of a difference there is in height between Eddie and Brian now",
        "what can I say...he is a \"Beast\"",
        "Eddie: \"I'm freezing\" while using shorts lmao",
        "There isn’t NO two people on this entire platform that go together as good as these two do. Eddie is just to funny,",
        "True Englishman a bet is a bet!! Ryan throwing ice at him like he's throwing bread to a duckling with his pure enjoyment lol",
        "That's was hillarious. Such good synergy between Brian and Eddy. Need more of this is in th future",
        "Big props to Eddie for following through on the bet! Great job!",
        "Good job Beast",
        "Get Eddie into a speedo and Brian cant keep his hand off him.",
        "These two are more like brothers and it shows. Great video. Reminds me of their lifting days together when they would send out more videos!!",
        "7:45 It's like a dad and a son at his swim meet. damn brian is big because Eddie is like 6'",
        "Great job Eddie.",
        "Best Duo of Youtube back in the game !!!",
        "i laughed out loud     love these guys ",
        "Without his facial hair, Eddie looks like a 400lb middle schooler and I love it.",
        "I almost felt bad for Eddie :D",
        "You 2 bloody rawwk!!! ",
        "Brilliant, just brilliant.",
        "He looks like Moto Moto coming out of the water ",
        "Eddie actually looked like he was managing quite well in the ice. I bet he could’ve stayed in for quite a while, but we all would be in shock calling for an ambulance",
        "Brian making a 6'3 guy look small",
        "Eddie looks like pissed off Eric Cartman from South Park 0:33 lol",
        "Only EDIIE would have kegs saying the BEAST lmao",
        "The way brian and Eddie torture each other is some of the funniest stuff I've ever seen",
        "Eddie is significantly less intimidating without the beard.",
        "Wow I really needed that laugh today :)",
        "2:57 Hum... I see the tattoo saying \"Hafthor Julius Bjornsson World's strongest man\" kind of disappeared from your foot. Once a cheater...",
        "All i see is a thumb with a beanie on! Only joking eddie! all the love from Ireland",
        "he didn't go under though lol",
        "Eddie is 5’9",
        "Eddie and Brian are my favorite duo!",
        "Yall wanna go bowling I wanna play",
        "That’s a warm day come in January, I know in Wisconsin we go around 20 to 30 below zero",
        "Brian's counting was immaculate.",
        "This is amazing  keep these videos coming",
        "PLEASE grow the beard back eddie",
        "25 minutes ... hypothermia!",
        "Brian was chucking Ice like you throw food in a zoo cage for a wild animal to eat it ",
        "Laughed my ass off at the ice cubes being thrown onto Eddie",
        "Tough as nails!",
        "Eddie jumps in ice baths all the time without whining, has to go into a cold lake and starts singing like a canary. ",
        "Best two celebrities I can think of down to earth and just real people. Big thanks to you for just being you",
        "You two are always fun to watch together.",
        "that was hysterical",
        "8:19 I think it may be a fair few hours before Eddie will be getting \"the bone\"!!! ",
        "Why does Eddie look so chubby in the face? Not being mean, genuinely curious.",
        "Eddie looks soo different without his bears ",
        "that was so funny. good sport eddie",
        "When Eddie lost his croc, it reminded me of smeggle from lord of the rings",
        "Loved it!!!",
        "no doubt eddie holds his promise on a bet, he is a mans man",
        "eddie's new slogan 'take the croc, take the croc'",
        "You should've brought him some floaties",
        "Eddie is the MAN",
        "Just two Worlds Strongest Men giggling like school girls.",
        "Got to give eddie props for giving Brian this video. This is so good",
        "Eddie is absolutely hilarious",
        "Now this is funny straight over from EH channel. Brian chucking ice was golden. The first impact squeal was genuine.",
        "But Eddie did win the video games so they should have had a nice swim together really",
        "That was well funny",
        "Stop chucking ice lmao",
        "Bro goals. I can't get enough of this.",
        "7:22 when you need a couple more calories to hit your calorie goal",
        "click bait. the homeless people in Texas took a shower in rain below 34 and they could handle it. why is Eddie such a chicken.",
        "Brian and Eddie are like brothers. Eddie is the troublemaking younger brother that always messes with Brian. Brian is the big brother that's chill, but can still laugh at his younger brother when the troublemaking backfires.",
        "Its always a great video with you guys together",
        "Great collab ....glad to see u both getting up to mischief again.",
        "Eddie it was 5 degrees up here in Scotland and I was in the garden sitting on the stairs with the dogs.",
        "\"I've lost me croc\"",
        "This is all acting....both Eddie and Brian routinely sit in ice baths and Eddie has a cryo cabinet...both of which are colder than this lake so come on guys it's obvious you're just clowning around to make a video!!!",
        "That bro hug when he got out the water. You know these two are the bestest of mates. Bros for life.",
        "It's like the quicksand I was always warned about as a kid.",
        "Good sportsmanship here. Love it.",
        "They should have their own show",
        "Why did Eddie shave? Did I miss something? He looks even more like a big baby now ",
        "Eddie looks like a more muscular Preston Lacy",
        "That was impressive",
        "Haha Eddie is a beast for a reason. Just get shit done, that’s what we about.",
        "Eddie hugging Brian while saying \"I'm cold\" is low key adorable ",
        "Brian tossing the ice at Eddie was hilarious! I was laughin so hard!",
        "See the cryo chamber paying dividends ",
        "Nice trunks.",
        "Post retirement we defo need a full on series with these two",
        "You two are brilliant together! And fair play to Eddie, he didn't mess about getting in there either!",
        "I love you fucking guys! Always a hoot watching you guys joking around. Kind of jealous, would be a pleasure to hang out.",
        "It’s great to see Brian and Eddie creating content together",
        "You two just work so well together. Very entertaining",
        "You guys are a riot!",
        "Eddie and Brian are the best combo on YouTube !!!",
        "Good stuff",
        "Don't come to Canada, you'd freeze stepping off the plane . That's summer here man haha",
        "Dude the view!!!",
        "Eddie the great!",
        "These guys are hilarious together",
        "Lesson for Eddie, play stupid games and win stupid prizes. ",
        "Eddie MAN OF HIS WORD",
        "Brian makes those bags of ice look very small.",
        "OK. Let's not get fooled into giving Eddie too much credit... there are LOTS of videos of Eddie hanging out in his high-dollar Cryochamber at his home. This was not out of his comfort zone at all . . . except for the MUD",
        "I thought the ice cubes were a bad attempt at adding to the joke, but then Brian used them and I died",
        "The bromance is real ",
        "You two together is always so freaking hilarious, I love it. Eddie is a champ for doing this!",
        "I couldn't stop laughing",
        "Most awesome video I’ve seen. Good clean fun with your bud",
        "Holy sh$#, this had me laughing like mad.",
        "Good Man Eddie.  A bet is a bet, you held up your end, like an honest person should, good on ya",
        "Best part of this whole thing is Eddie nuzzling so gently into Brian after the challenge.",
        "10000000% these 2 need to TV show together. The chemistry is amazing. They have genuine love, care and respect for eachother. It's so entertaining to watch.",
        "Poor Eddie at least  he's a man of his word!! You two are great  together",
        "I just want them to be neighbors",
        "Eddie,wtf..it wouldn't have been so bad if you were hydrated...nice to hear Brian laugh so hard and long..",
        "I thought so.",
        "The chemistry between Brian and Eddie is gold. They should do more together",
        "The most amazing thing is Brian makes Eddie look like a normal sized human.",
        "Eddie is a legend, I love seeing Brian and Eddie together",
        "Eddie, bring the beard back ",
        "Best video you guys have ever done ",
        "He’s got Eddie’s voice down holy shit lol",
        "That was funny!",
        "You guys are awesome!!",
        "How did Eddie gain weight so fast? Last video I saw he was 150lbs lighter.",
        "Eddie adjusting his junk ",
        "How is his gut WAY rounder then yours but he has abs?? ",
        "5:05 Eddie's face LMAO",
        "Eddie looks like my bus driver now!",
        "Hilarious to think these two men are like the strongest humans to ever live lol",
        "Love seeing lakes that low \n\nNothing wrong with the Earth, st all",
        "Eddie’s gettin chunky again",
        "What is the deal with grown men wearin panties? Like honestly anyone trying to fill me in?",
        "That´s the most Insecure Eddie i have seen to date lol!",
        "Gotta dunk him, he didn't submerge",
        "Gold!! World’s Strongest Man Child ",
        "Do couple yoga in the hot room",
        "Way to man up Eddie!!!",
        "You two are the best!!",
        "Eddie is brave wearing those. That cold would turn me into an unflattering stack of nickels.",
        "Hard question: was this better than Keri's ice bath?\n\nThat had to be awful for Eddie.  I fully expected him to throw ice back at Brian ",
        "brian, eddie, nick and robert's friendship is gold.  they bring me joy.",
        "Big love to both of you ",
        "3:42am laughing so hard I woke up the dog ",
        "Eddy would have used both bags of ice and wishing he had a third bag of ice",
        "Eddie with no beard and in a pair of budgie smugglers is very disturbing",
        "Damn whis you too would do more videos together much love",
        "0:34 eddie looks like an upset toddler w the beanie and look on his face  poor chap never learned how swim aye",
        "Worlds strongest man vs quicksand ",
        "Where the hell has his beard gone ",
        "This was actually hilarious. When Brian started to throw the ice, I couldnt stop laughing",
        "I still say the lake near me and Eddie would be the better option during winter ️",
        "7:38 Eddie Hall is huge but Brian's size just makes Eddie look like a child here xD",
        "Not pride, 56 year old that Brian Shaw inspired to get to 15 % BF greatly increase strength and flexibility. Undefined Nutrition is the real deal as again I’m 56 and have used more than a few supplements. Brian is A Role Model for fathers. Just look at how he loves his wonderful wife and family First! Now that’s Humility the greatest virtue!",
        "Man is that funny!",
        "Well done Eddie",
        "If thats cold, Eddie wouldnt last a day here at northern europe :D",
        "45 with no wind is almost summer",
        "You guys are awesome! What a great team loved the video",
        "Eddie is the giant wee man",
        "This is the best thing I ever seen.",
        "Literally the best duo content ever",
        "Love it",
        "Eddie looks a bit more round",
        "Brilliant! I cried with laughter watching that. Well done to Eddie ",
        "Joe Rogan and Brian Shaw. Please. Your subs will definitely take a jump. He would be fascinated by your experience in the sport",
        "Do you remember the time Brian gave Eddie a bone",
        "Imagine how long he's in the water for that",
        "I would die if Brian shoved Eddie back in when he held out his hand lol",
        "These guys are definitely the Laurel & Hardy from the  21st century.",
        "Do these guys ever wear long pants?",
        "Brian is probably one of the only people in the world that can make Eddie look like a small child  7:38",
        "Pure entertainment haha cool guys. Love it! Eddie’s face at 5:55 ",
        "Awesome!",
        "No offense but for whatever reason no matter how big Eddie hall gets he will always be a giant baby shaped man. ",
        "I could swear I saw a cape buffalo lion video similar to this LOL...love it fellas",
        "This is the reason why we watch when they get together, funny video",
        "Honestly that was hilarious. Love to see you guys making this content together!",
        "Shelby’s looking Awesome",
        "Love their friendly rivalry",
        "Why does eddy look like wee man but giant",
        "What happens if you're taking a shit while you're lifting weights?",
        "FFS Eddie! grow that beard back quick.",
        "but that back tap of encourage is legendary :)",
        "It's like the grand tour but strong men, its awesome! ",
        "Eddie normally pisses me off but he is a good man in the end.",
        "Hell yeah Eddie that was seriously badass brother. I’ve felt that cold water plunge at 43 degrees I can’t imagine 34. You’re a boss and a stand up mate.",
        "Doesn’t Brian have a cold tub",
        "Love to both you boys",
        "Cracked me up the imagine of you two hugging when he came out ",
        "Brian do you never wear pants?",
        "Nice!! Subscribed...You have to show Eddie \"The Incline\" or rather see how far he can go.  It's only a mile.  Great Chemistry.  BTW I still believe they should include armwrestling as an event for WSM.  BRING IT BACK...BRING IT BACK...",
        "34°?! U wouldnt be able to make it for long in 34° water ;)",
        "GOOD SPORT!!",
        "That was absolutely hilarious, I was sniggering the whole way through, gotta love Eddie ",
        "Wow .\nCrazy stuff ",
        "I can always count on a laugh when Brian and Eddie are together. ",
        "Eddie’s dip in the frozen icy water as punishment reminded me of my seven year marriage with my ex-wife.",
        "34F. 2 degrees above freezing.",
        "More ",
        "Wait wait wait\nBrain it's freaking cold",
        "“I’ve lost me crock” ",
        "Never make a bet you're not willing to uphold. Good on Eddie for fulfilling his end.",
        "5:11 that scene with the ice in the air =)",
        "Hey did anyone see a tattoo on Eddies foot from another bet? Lol",
        "Hilarious!",
        "Haha 5:25 Brian chucking ice at Eddie is the happiest I've ever seen him",
        "Eddie is still My favorite strongman",
        "Imagine witnessing these two in public not knowing about their banter the looks they’d get  really hope they do some form of series at some point in the future ",
        "Eddie with no beard is like one of those Snapchat filters",
        "All that muscle and so little brain",
        "Spilled my drink from laughter when Brian started to use ice  :)  this was gold :)",
        "Laughed all the way through this, what an elite duo",
        "Also eddie closing his eyes in that hug, so sweet hahahaha :D",
        "Nice view.",
        "How many bets are Eddie down at the moment? 0-1 Thor, and God knows how many vs Brian",
        "This was like a cold tub. Common for these two. Although nobody throws ice cubes normally. Working content together. Priceless!",
        "Edward where can I purchase a pair of them speedos ?",
        "When Brian threw the bone I lost my shit! ",
        "wtf happened to Eddie?",
        "Those were board shorts, forced up to look like a beast bikini briefs due to his quads.  ",
        "Thor woulda just canonballed into that \"cold\" water! ;-)",
        "Eddie - \"a bets a bet\"",
        "Eddie's a man of his word.",
        "eddie bout to cry LOL",
        "Eddie needs to move to CO so you guys can have a full time YouTube channel together. Absolute gold. Well done Eddie!",
        "Daw poor Eddie. Ya did it. Its always great when you two are together. Great mates. Love the warm bro hug at the end.  We will all continue to gather round and hear about your records :) .",
        "You keep losing but it great to see take it in good sport",
        " ️ ",
        "Eddie is hilarious ",
        "Ok so another line item  checked off my bucket list Eddie. Hall in a Speedo",
        "When Brian gave (freezing, shivering) Eddie that hug at the end, it was ultimate wholesome friends vibes",
        "bri man through ice at eddie was the most ive laughed in ages thakns",
        "A legend never truly die, because as long as his videos are still around, we have something to keep him alive.",
        "5:20 this was the \"what the f*ck am i watching\" moment for me :D",
        "I've never seen a man so worried about his Crocks ",
        "Wee man and a giant baby do jackass stunt",
        "Needed to bring along the stoltmans for moral support",
        "This is absolutely the best!!!!! Y’all are hilarious",
        "The ice just keeps flying",
        "MOREEE EDDIE CONTENT",
        "Hahahahahahaha this made my day.",
        "I have now seen Eddie hall in speedos more than I've seen my wife in a thong, cheers guys",
        "SHOULDERS UNDER HALL!",
        "The look on his face when he sat down and the ice broke. That made me laugh",
        " Damn!  if not for the voice and tattoos I never would believe that is Eddie Hall. Looks like a completely different person,I seriously thought that Brian just got someone that looked a little like Eddie. grow your beard back mate.",
        "Brian and Eddie Road trip! Would love to see that ",
        "I think he needs to stop making bets. \nLost the boxing, now he's lost this challenge",
        "it almost breaks my brain when I see Eddie looking that small, then remembering he is almost 2m and that Brian is just a giant.",
        "You 2 are so funny. I've been watching you both for years",
        "Eddie bulking up again",
        "You two are on point together haha",
        "I love repeat this I love you  ️       a lot shaw and hall",
        "That strongman hug is fabulous ",
        "Good good these two need a reality show just pour entertainment when these two are together they always leave you wanting more!!",
        "Brian chucking handfuls of ice at Eddie is laugh out loud hilarious",
        "Eddie will do it!",
        "those are not crocs Eddie has on, those are jail house slippers",
        "Colder without the beard!",
        "Whoever told Eddie to shave his beard did him dirty.",
        "Fair play to Eddie,im cold just watching this,Brian laughing was funny as he pelted Ed with ice cubes.",
        "Brain this is serious dangerous man lol",
        "Love ya Eddie!",
        "Those are the cries of a warrior!\ni wonder if those ice cubes melted.",
        "Eddie in a Speedo!? Come on Eddie it’s no nut November, are you trying to make me coooooooommmm!",
        "Eddie is not a small man, but I love how Brian just dwarfs him when they hug ",
        "Eddie has good character. He holds to his losing bets.",
        "8 degrees!! Certainly a bollock shrinking temp.\nThe hardest part is dunking your twig and giggleberries",
        "so funny join the polar bear club now lmao",
        "these 2 have great chemistry they should do a show with 2 other strongmen that is on history channel",
        "LOL",
        "This is content",
        "Eddie looking small in the arms of shawn is just crazy",
        "You guys are the best! Need to get together more often!!",
        "is this punishment tho? they do ice baths...",
        "That face when the ice started to break  I've not seen Eddie ever look so vulnerable haha.. missed y'alls back and forth when you're together! Now just grow the beard and and all will be normal lol",
        "This is hilarious! ",
        "5:58 Eddie’s face is freakin priceless ",
        "So good!!!",
        "What has happened to Eddie's face? It is impossible to recognize him. If it wasn't for his tatoos I would say that no way if that is Eddie Hall. Well until he started talking.",
        "It sucks that Eddie was such a POS during the Thor build up and its like was he that good of a heel or what? Hard to enjoy his shenanigans since. Hell this the first video I've watched with him in it since the fight.",
        "Now this is comedy gold for real"
    ],
    "comments_disabled": false
}