{
    "video_id": "RuLWx25Jp3w",
    "comments": [
        "No way I'm first ",
        "Early ",
        "I'm the 7 hundredth commenter",
        "Lol when a new video comes up of yours I always quick to watch it like️",
        "Americanised Chinese...rip",
        "its 3:38",
        "Erica's videos are always so therapeutic and healing for me",
        "The way i get excited when you upload a new video",
        "I have used that snail essence that's really good ..... I really love watching your videos ... Lots of love",
        "Erica: i don’t want to spend money \nErica one minute later ",
        "Yo. That accutane will fuck you up. It's your freshman year so you'll probably be depressed in the winter. Don't be afraid to reach out to folks, go see a therapist and chat with your friends to cheer yourself up. Accutane will have extremely harsh effects on your mood so just be on the look out. It definitely works for your acne but just be mindful.",
        "I'm new to the channel but I wish I had found him sooner. His dry humor, the roasting of his peers, the commentary about random things, his genius fight strategies.... I love it. May his family find comfort in this sad time :-o B-)",
        "Ahh i  you guys",
        "thankyou for keeping it real with us erica, i love you sm",
        "Ur personality is the reason why I started watching ha sisters",
        "I wass about to study",
        "I WAS ABOUT TO DO MY HW BUT YOU GIYS POSTED 10 MINS AGO",
        "ooomgg this video is gonna be amazing",
        "Your acne may be due to inflammation. Sugar can cause inflammation. This inflammation increases oil on your skin which can lead to more acne.\nTry cutting sugar",
        "When they say Japanese and Chinese people always slrop on there food there it is",
        "did noone notice the dorm room door?? Heartstopperr!!",
        "hi slay slay ha slay",
        "erica: i'm not spending anymore money! \nalso erica: hey guys were at sephora.\n\nyour my fav sister erica!!! :)",
        "Hey Erica, thought I just share with you since you seem to be struggling w acne and I can totally relate to it. I spent like tons of money at Sephora too but they’re quite expensive and even worse if you purchase ineffective items so hopefully this helps!! ",
        "I knew I was not going to study if I watch this",
        "YESSSS EARLYYY",
        "Aaaaaaa I LOVE YOU SO MUCH ERICA YOU MAKE MY DAY",
        "Early for once ",
        "Can definitely sympathise with how self confidence can be impacted depending on how clear your skin is. But just wanted to say you’re absolutely stunning and I hope you see yourself as how we all see you - a queen.",
        "I LOVE YOUR VIDS ERICAAAAAA",
        "I LOVE U",
        "i love Erica and how real she is, and always tells the truth.",
        "Owemteee",
        "kinda miss watching erica driving tho:(",
        "Ok this is different from the strange things I watch why did u recommend this you tube?",
        "Erica is fucking pretty",
        "Don't worry Erica i think that you're bangs are really cute!!!",
        "Jesus loves you so so soo muchh️",
        "THE INTRO IS SO CUTE",
        "Really  like the choice of music, btw u looked very pretty in this video :))))",
        "your acne is probably at its highest right now because of stress, like college stress.",
        "Papa being confused is funny asf 8)",
        "Btw this vid was recorded in 29th of October Thats why Evelyn’s decor is still there!",
        "Erica pls try diffin gel it literally saved my skin, I think it'll really help you!!!",
        "It's just you talking and eating lmao. Which is quite fine but more footage of the city please : )",
        "...she sure got a lot of food in the tiny little cute mouth  Looool!",
        "erica is so pretty AND her persoanlity is amazing- like how...shes a godess",
        "I was about to studyy but better to watch emm",
        "EM... HALLOWEEN..... WAS 13 DYS AGO FOR ME....",
        "I honestly just luv u guys sooooo much",
        "STOP I WAS GONNA DO HMK ",
        "Hey, I'm dying to see you and your bf in the same frame, just make a vlog erica.",
        "erica : am trying to save money \n\nalso erica : i actaully need some thing from sephora sooooooooooo.",
        "Omg did you make that intro urself it’s so nice.",
        "Hehe the bangs ",
        "erica: we're walking back home because i don't wanna spend any more money.\nalso erica: oohh SEPHORA i actually need something from SEPHORA\nICONIC MOMEMENT lolllll",
        "The reason for your bad skin is u use different products every time.....stick to only 1 product and use only that .....",
        "Bro I think my table is broken it says this video was posted one hour ago and they are talking about what we are going to be for Halloween was this actual posted an hour ago or am I tripen?",
        "I miss you. Where are you going?",
        "Erica is my fav out of the three ha sister she is such a mood and so relatable.",
        "SHE SHOWED HER DOGGGSSS!!!",
        "please do a shoe collection",
        "I love that they're all so real. I love they're videos",
        "I’m so proud of you Erica <33",
        "erica stop u r really so pretty. also ur acne get so much better than before ily",
        "You guys r so unique and pretty and genuine, it always brightens up our mood ",
        "It's November.....",
        "i was just wearing a sweater with my favorite movie nightmare before christmas lol",
        "40 mins late ",
        "u guys honestly keep my life happy and it’s so funny how u guys judge eachother and say shit about eachother",
        "Why does emily keeps getting injured",
        "Erica is the new mood",
        "hii, how do u make ur bangs? please tell us bcz i have problem sometimes with my bangs:(",
        "Seeing erica makes me feel comfortable having acne on ma face :D",
        "LOVE YOUR VIDEOS…..KEEP UP THE GOOD WORK",
        "tbh I miss Erica's blonde highlights era",
        "Hasn’t evelyn moved out?",
        "Didn’t Evelyn move out",
        "I love your \"asmr\" i didn't know you're this good doin it lol",
        "5:23 omg it's heartstopper AAAA stop that's so cute",
        "Emily’s humour tho",
        "im about to go to sleep BUT",
        "Omg 1 minute ",
        "Is no one gonna talk abt Erica’s asmr- ",
        "finally sister's vlog!!",
        "Didn’t Evelyn move out?",
        "CONSIDER DOING ASMR CUZ SLAYYY",
        "Finding Nemo was the hardest one to hold my breath in man I barely made it through",
        "lol halloween has already been but me and my friends dressed up as my little ponies",
        "LOVEYOU ERICA",
        "does anybody know where erica’s necklace is from? please let me know :)",
        "YOUR SOOOO GOOD AT ASMR please do an asmr video ",
        "6:15 evelyn is so gorgeous.. she's the prettiest ha sister",
        "hi erica! ima huge fan! can I get pinned? or even just a hi?",
        "IM ABOUT TO WASH THE DISHES WISH ME LUCK",
        "ON CAMERA 2! LITERALLY TO THE WHOLE PUBLIC. THAT'S SOME DAMN BRAVERY. GOOD ON YOU ERRRICAAAAA",
        "I think the college vlogs are fun but I do miss when it’s just you Erica or you and your sisters! ️",
        "i love y’all your so interesting 🥹",
        "It’s 14 of November here in Australia 3:03",
        "SLAYED",
        "She backkk",
        "Are you still friends with Zoe?",
        "Nice ",
        "The beginning ",
        "You guys should go to daiso it's like a Japanese dollar tree 🫵🫵🫵",
        "Stop studying to watch the video yes yes",
        "you’re so pretty erica!!",
        "I SWEAR IS IT JUST ME OR I SWEAR I WATCHED THIS VIDEO ALREADY",
        "as a person that also took accutane for A YEAR and a half sucked ASS cheeks. i went through a lot MENTALLY and physically due to the hormones and dryness but watching you take care of yourself and using the right products for facial care makes me happy. i was self conscious about my acne at such a young age (I was about 10-11 years old, now 14-15) but watching you being open and strong about it makes me just as happy. you’re doing amazing, Erica and what you’re doing right now is amazing. it’ll clear up very very soon. much love. ",
        "YOU HAVE 1MILLION ALREADY WOWWW",
        "Gurl I randomly saw that video of Emily calling Evelyn a fat cow and I knew that I'll fall in love with you guys  I mean it's sisterly bond innit?",
        "HIIII",
        "My inspiration 🫶🫶🫶🫶🫶🫶",
        "I swear Erica is the funniest person ever not to mention she is so real with us",
        "23 on trending!!!!",
        "she talking abt halloween its 11/13",
        "🫶🫶",
        "whenever evelyn, erica or emily post’ it js makes my whole day no matter how bad my day was 🫶",
        "What nail place did y’all go to??",
        "Erica,emily and evelyn are so pretty \nBest youtubers ever \nI've seen erica go to college,emily go to high school and evelyn moving to her apartament, I hope erica emily and evelyn have the best luck everyday!!",
        "I'm finally earlyy",
        "i was a cow for halloween\n....",
        "I was about to sleep",
        "omdd the way she sings while doing her intro-",
        "Mu is the best",
        "omg who else is dying for a vid with momma ha, she seems sooo sweet. She's gorgeous as well : )",
        "LOVE U GUYS SMMM",
        "Hi erica",
        "Erica is such a cool personality I love her videos so fucking muchhhh. I love the way how she's very real and has no filter on her. lots of love Erica️",
        "why was erica hard on herself on this vlog.. she’s fine af even tho she said she’s puffy, red faced and ugly banged.. love u erica",
        "First love Erica ",
        "hallooo",
        "what she said about everyone having clear skin feels too relatable  i was also prescribed to go on accutane earlier this month so to find someone like erica going through the same thing is a bit more comforting",
        "Ha sisters are the best<3",
        "1:23 it's past Halloween I think this is an old one but I love the video",
        "Her bangs are actually sooo pretty, ",
        "I just noticed that erica can use both hands to eat.she was using chop sticks and she eat with left hand.",
        "you are so pretty Erica I wish I looked like you ",
        "4min agooo!!!",
        "Who else loves ericas bangs?",
        "Omg wait I play field hockey too!!!",
        "“I don’t wanna spend ANY more money”\n3 seconds later\n“*walks into a Sephora*”",
        "Omg hi",
        "It was like Erica knew we were expecting a video of her in her college and she said “I’m in Evelyn’s apartment… not in college..”",
        "Period ahh.also love this video and im 9 mins early",
        "Vn nh ai  ni DRX yu nht LCK",
        "Erica:I wanna save money\nAlso erica: sephora!",
        "I love you guys so much!!️",
        "i love erica's bangs very muchh it looks good on her",
        "For hallowen I was regina george :)",
        "You look so elegant!",
        "YEYYYYY NEW VLOGGGGGGG ️",
        "I thought chai Was a boy️",
        "Omggg i love your videos ",
        "I wass about to go do math",
        "U guys are so comforting",
        "The Tingles I got when you start doing ASMR was soooo good",
        "It’s ok Erica. It’s your channel so you post when you post and your in college enjoy yourself ya know? You got this love! ",
        "The cutest vlogr ever is here  I'll enjoy it erica thank u for your hard work",
        "«i dont wanna spend more money» goes to sephora «actully i kinds need-»",
        "Don’t use towels use toilet paper to dry your face and wash your hands before touching your face",
        "its so amazing to see how far they have come Emily in high school, Erica in college and Evelyn getting a new apartment they honestly are my fav youtubers they are so funny w/o trying",
        "I love u guysss sooo much when I am sad or depressed and watch ur vids my smile lids up directly when I see ur vidsssmlove u alll ️ ,,,and question? Why don’t you make vids with ur dad??",
        "Relatable, I suffered from acne for longest time but after using korean skincare truly helped my skin, and benzo proxide",
        "Omggg",
        "When Joseph and Julia came in like \"We're here to save our sisters!\" it was so cute!!",
        "A clown",
        "I was Wednesday from the Adams family for Halloween",
        "what was up w chai’s legs? was it dirt??? ",
        "I luv her bangs",
        "It’s November 13 Halloween passed",
        "Bro the asmr was so good",
        "First",
        "Accutane gave me cracked and bleeding lips but helped my pimples so much no ragrets",
        "Hi slay soul sister",
        "I am sorry this video is not complete what ? You guys didn't fight!?\nDon't look at me like that ",
        "I like your bangs",
        "Absolutely love your videos  my day just got a whole lot better xx",
        "Evelyn is soooo prettyyyy",
        "U made my day i was crying before i watched this",
        "I love your bangs it drop-dead gorgeous and i'm not lying!",
        "Dude your bangs and my bangs are so similar mine always fly out and are so annoying but they look really cute on you",
        "Erica:I don’t wanne spend anymore money\nAlso Erica:*going in Sephora*",
        "I understand you when u said that everyone in college hv clear skin except u cuz im feeling it too atm. Btw, there’s this product called tatagaltier essences, and it works wonderful, hydrating, can brighten ur skin and my skin’s acne is reducing",
        "HEY IM SO EARLY",
        "Erica is literally such a mood tbh",
        "You literally make my day when I see ur vids",
        "I love your videos",
        "You should do some college day in the life vlogs!!!",
        "LOVE THE VLOG ERICA :) no need to apologize for not posting, we appreciate the bits u do for us and that what matters, u deserve to go out and socialize and have fun..u deserve it ",
        "the first thing is when we see them fighting proves their bond to us ",
        "omgg the heartstopper stuff on erica’s dorms door",
        "why is emily always crippled ",
        "i love your bangs diwkdnhfbj",
        "THE HEARTSTOPPER LEAVES ON THE DOOR YES SLAY",
        "WE HAVE THE SAME PANTS ERICA IM FREAKING OUT AHHHHHHHH",
        "Erica honestly all I gotta say is that you are halarious",
        "You notice how Erica and Emily don’t bicker as much in her vlogs. It’s surreal.",
        "Is no one going to talk about how far they have gone like, they all started YouTube thinking they weren't going to make it possible and now look at them... P.S; We wanna see your dad in your vlogs :))))))))",
        "Only good vibes",
        "Kinda early?3h ago!you guys are so grown up",
        "istg erica is so realistic bc other youtubers be like they have the perfect life and stuff but i love how erica shows her Imperfections too  y'all are so entertaining to watch to like im literally on my knees for u guys",
        "MY DAY IS NOW COMPLETE",
        "stop Emily looks so good first thing in the morning compared to me \nand where did you get the white jacket",
        "your bangs look fine XD",
        "I was a demonslayer",
        "Early but late by 44minutes",
        "Love you guysss",
        "Damnnn Im earlyy",
        "for dry skin, try hyaluronic acid & then a facial serum to seal it queen 🫡",
        "i really love these kind of casual vlogs ",
        "literally when i make my school works, i always watch you guys. You guys always makes me motivated ",
        "anyone who gets excited everytime the ha sisters post?? \n|\nv",
        "Hiiiiiiiiiiiiiiiiiiiiiiiii",
        "u should rlly try acure for your acne. it rlly helped clear mine",
        "Owo",
        "HII ERICAAA AHH!! I LOVE UR VISDS",
        "Think*",
        "Erica and her sisters are the best things that have ever happened to us with her vids and their places",
        "NY is alright but I do love NYC and Brooklyn is cool I don't know about Queens but I like that name of the city.",
        "R we not gonna talk abt how many times Emily has injured herself",
        "I was sick on the day of Halloween but I was gonna be a bat. I bought these super pretty boots and an eyeliner",
        "2:43 UNNIE AEGYO JUSEYOOoOoo lmao she's gonna kill me",
        "Who cares",
        "Hiiiiii omg i love ur videos",
        "I freakin love the ASMR",
        "Koreans really like soupy dishes huh",
        "Thank you Erica for making my day so so happy ",
        "you’re soooo pretty erica omg",
        "I’m early",
        "I love the Heartstopper decorations",
        "May I know how old are you?",
        "I cant believe they grow so fast",
        "swag ERICA",
        "I don't celebrate Halloween so I can't dress up and I'm not allowed to go out on Halloween day.",
        "hey does anyone knows what the outdo music is called cuz its such a vibe ? :))))",
        "Firsttttttt️",
        "I think your bangs look amazing, and don’t stress about acne u look beautiful either way and it happens to the best of us, it’s natural and normal <3 hope u have a good day Erica. keep ur head up queen ",
        "7:44 who's thaaaaat???",
        "heyyyyyyyyyy",
        "Erica is the best sister Ngl she’s hella funny without trying",
        "OMG I LIVE IN NEW YORK CITY! ARE YALL IN MANHATTAN OR QUEEN OR BROOKLYN OR BRONXS OR STAND ISLAND",
        "How do u look so pretty with acne like bro HOWWWWW???",
        "TBH ERICA IS SO BEAUTIFUL DROP DEAD GORGEOUS WITH BANGSS",
        "Sameeee",
        "this is soo random but i feel like you should try out OXY pimple cream , it works rlly well for me but idk . Just thought maybe you'd wanna try it out !!",
        "The thing is the series didn't want to become formulaic and so wound up making every game a bit of an experiment.",
        "UESS SÓ EARLU 3 MINUTES",
        "are you gonna be doing vlogmas this year?",
        "Me: sigh I'm gonna go study now this pops up me:",
        "7:51 look at the window",
        "I watch you guys a lot and when yall don't post a video it makes me wonder what are you guys doing it just makes me sad",
        "HERE IS 2 MINUTES LET'S GOOOO",
        "i can relate with your bangs situation once theyre too curled its literally done like theyre gonna look bad until you wash your hair again ",
        "I wanna speak English like you ",
        "How do u manage to look so glamorous even tho you just woke up",
        "ericas bangs are so cute they fit her so well",
        "yes i love the vids with you and your sisters",
        "Waiting for your friends giving video",
        "I'm being tiana from bratzs for Halloween rip my hair",
        "I LIKE YOUR BANG!",
        "More of this videos please !!! they’re so comforting to watch :)",
        "Make sure to always annoy them \n\nEdit: remember they will alway get you back",
        "Bruh if your skin is dry why are you going on accutane? DONTTTT",
        "Today is my birthday and I love your guys videos ",
        "Ahhhhhhh yay a new video from Erica Ha <333",
        "i love u ericaa u r so iconic",
        "NAUUUURRR, I LITERALLY LOVE THE BANGS!!! LOOKS CUTE ON ERICA",
        "WE LOVE THE SIBLINGS CONTENT ️",
        "HI!",
        "uhhhmm is it weird that i wish me and my sisters were like yall",
        "u can try cutting dairy and see if it works for your skin!",
        "So gorgeous ",
        "Benzoyl peroxide might help you to get rid of acne Erica",
        "Hi Erica! love the intro super creative",
        "Why is no one talking about why is chais leg black?",
        "I was about to sleeep then...",
        "Salicylic acid is good for acne",
        "When Erica said she will not spend money and then She Goes To safhora️",
        "first, i actually really enjoy ur bangs. makes u different. second, ur skin will get better. i know its a little hard right now but it will be oki babe!!",
        "what's the color of your nails actually? ",
        "Erica when you put skincare you have to do it gently",
        "not sia playing at the back in the saloon imaoo",
        "I seriously want a sister like Emily Evelyn and Erica",
        "Omg when erica said: \"its 3:48 rn\" and I checked the time and it was 3:48 like whattt-",
        "heyyyy",
        "Pov: u need some cheering up so u watch the Ha sisters",
        "When will evelyn move out of the apartment?",
        "how emily  dobson is younger than emily ha",
        "HEYYYYY IN SO EARLY",
        "Was I the only one who saw those heartstopper leaves on their dorm door at 5.20?",
        "Hiiiiiiiiiii 1 min ago",
        "Just wanna say I’ve been dealing with acne since I was 11 (I’m 17 now) and it’s so refreshing to see someone be so real about it and have someone to relate to. Thank you Erica :)",
        "the heart stopper leaves on the door are so cute",
        "erica! i just wanna say that i enjoy so much watching your videos and you always make me want to be confident like you. you are so awesome!! will support you always <33",
        "thumbnail -->\nerica: \nemily: \nevelyn: ",
        "I went on accutane and it didn't work at ALL until the last month and suddenly cleared everything up, haven't had acne in 3 years now. Just a heads up, it might take a while but its worth it!! youre gorgeous anyways doe:))",
        "Emily’s “ELLLOO” is iconic.",
        "Theyre so iconic ",
        "\"I'm not gonna spend any money now\" ends up in sephora",
        "Where is Zoey I miss her  (love u though)",
        "ERRIICCCCAAAAA !!!!!!!! LET THE BANGS FREE",
        "y’all r so stunning omg",
        "i swear every time we see Emily shes broken a bone ",
        "Made my day!",
        "I’m here early",
        "This Channel is addicting",
        "i really like the entro it’s so damn cuteee <3 !",
        "I was a fairy with elf ears",
        "Finally the ha sistersss are together whi else is happy to see them together",
        "YAY NEW VID ILY",
        "Erica, can you do the blind deaf mute challenge with your college friends\n I bet that would be funny ",
        "BRO I WAS SO HAPPY WHEN THE YOUTUBE NOTIF CAME UP AND SAID YOU POSTED",
        "this is so random but it makes her so sympathic that she has acne and just shows her skin without make up and talks about how she is struggling with self confidence bc of it. im literally going through the same thing for years so its very humbling <333",
        "It's 4 am omggg",
        "YESSSSSSSS I WAS GONNA STUDY BUT HEL NAH",
        "hola amigaas",
        "Is no one going to talk about Erica’s dorms door. It’s literally Heartstopper themed ",
        "Hi erica ",
        "Your personality is so outstanding I wouldn’t even notice your acne tbh don’t let temporary breakouts dim your shine !! Love you sm",
        "I was about to start to study ",
        "wait i thought evelyns lease was until the end of october",
        "I pray everyone has a good day ️",
        "ON HOUR AGO",
        "Erica, I hope you know you are beautiful just the way you are. Girl you do what makes you feel good.",
        "what i literally love ur bangs theyre so cute",
        "your videos are always amazing",
        "Is there anyone else that knows about the aligations of Erica and Emily being racist",
        "Bro i was abt to do homework and I got a notification... I gess i ait doing my math",
        "You are my favorite forever... ",
        "You're so cool",
        "Thank you for uploading!! ^^",
        "Erica is so beautiful ",
        "I just woke uppppp ,love a good “get out of bed”vid",
        "Omg the “Heartstopper” door !!!!",
        "Lyyyy ericaaa and your sisters  you guys are so entertaining ",
        "Omg you posted this 1 minute ago!!! I love you!",
        "the whole video erica pointing smt on her that she hates, but like she looks georges with litrerally anything, the bangs looks so good on her and the way it moves with the wind too, and her acne dosnt make her anyless preety. i rlly hope she knows this <3",
        "NO BACKGROUND MUSIC ERICA !!!",
        "I feel like the ha sisters are the kind of person everyone wants to be friends with  ( at least for me ) like y’all r so cool and I love y’all sm <33",
        "excuse me!! Pleaseeee hear me out!! Ur face, PERFECT. ur fringe (bangs ), PERFECT. ur outfits, PERFECT!!! ur so pretty and you shouldnt compare yourself to everyone else in college like that cos bro, u dont need to!! I bet others wish that they were like you and had all that confidence and such pretty features. ur amazing erica!",
        "I literally love this so much!",
        "8 min ago slayyy",
        "what I love about the HA sisters:\nEvelyn-Her sense of fashion and beauty\nErica-Her cool personality\nEmily-Her humor",
        "i feel like erica is so insecure to pretty evelyn ",
        "girlll why we still getting 720p videos? ",
        "Erica and Emily are a total savage but Evelyn is a kind of a soft girl",
        "9:00 Try a Acretin cream 025, put it before you sleep and wash it after you wake up I tried it and it's really good",
        "I loved the ASMR ",
        "But like why is it always emily breaking her FOOT, THUMB, HANDS",
        "Erica honestly makes my day so much better! I watched the ha sisters since the started and I’m so grateful for all they’re hard work the put in they’re Channels.",
        "so cute",
        "1t how",
        "Erica ur bangs looks super cute on you :)",
        "Your such a good friend thank you for vloging I don’t what my life might be without you I have thought about it would be the same I want to spend the rest of my life with you and no waste it with some your sister Evelyn is such a good sister I wish I can get to know her more.",
        "Ur so swag. Muah",
        "It's literally November it's not halloween",
        "yayyyy i missed these vlog videosss",
        "2:43 cute",
        "wdym i love ur bangs like that",
        "For Halloween I WAS a All of us are dead zombie but we have another holiday that's simular so im gonna be something from Straykids",
        "Place your faith on Jesus. Jesus died so that you can have everlasting life. Jesus is the way the truth and the life. No one gets to the Father but by him. Trust Jesus. Repent \n\nHave a good day.",
        "2:43 SO CUTE!",
        "I am going to be a zombie",
        "NO CAUSE I LOVE YOUR BANGSS",
        "Imao the “you thought you could catch me lacking” \nErica’s such a vibe ",
        "Girl u r gorgeous. The skin issues r annoying but I pray u don’t allow it to make u self conscious cause I promise nobody cares. And if they do that’s on them. Ur personality shines brighter than anything else. ️",
        "heyyy erica i have one question are you doing vlogmas this year???",
        "I love you guys so so much you are so real  so much love",
        "Erica always make my day ️",
        "Aaaaaaa love you ericaaaa",
        "Erica we love your bangs  it’s so pretty",
        "Erica is actually really good at asmr",
        "Intro is so cute",
        "If it makes you feel better my Erica, my skin has been shit recently too ",
        "Whoever's reading this , i pray that whatever you're going through gets better and whatever you're struggling with or worrying about is going to be fine and that everyone has a fantastic day!",
        "Erica you're so beautiful and your bangs are pretty and suits you so much <3<3",
        "0:05 new Emily vid?",
        "earlyy",
        "For the skin, even after using products if its not working or if it goes and comes back often the problem lies in the gut/ the colon. I had the same issue. So for a month i had to stop consuming food made of flour and sweets. I saw a big change. There were no new pimples and i had to only handle my acne marks. And eventually i started adding sweets and food made of flour in moderation. Its in the gut. If you take care of both the inside and the outside your skin will be fine. I hope this helps. Either way you are really pretty ",
        "So proud of me to be a subscriber of this channel",
        "Erica I’m studying… why",
        "more vidsss plsss ericaaaa",
        "OMG IM SO EARLY I DIDNT EXPRCT THISS!!!!",
        "\"I don't want to waste anymore money\" 2secs later at Sephora",
        "“Comment what u are gonna be for Halloween” Halloween has already past they prob recorded this before Halloween",
        "i have acnes since 9 years old and now im 17 , my acnes has got alot better this year and hopefully whoever read this can heal as fast as possible and rmmbr ure beautiful even if you think having acnes sucks okay <3",
        "video quality is 720p -_-",
        "When all four of you go out where is your dad? ",
        "erica, you probably wont read this comment cuz ur def really busy but im jus letting you know that its okay to have acne!!! acne is beautiful even if it doesnt seem like it or feel like it, and i assure you PROMISE you that not every1 in college has clear skin. Im here for u and ur beautiful love uuu!!!",
        "ily erica, dont compare urself to other pplbro your skin is gorgeous ",
        "i legit love how they are all so real about everthing like what they are insecare about and stuff<4333",
        "Omg I'm first",
        "idk why but this video just makes me feel so motivated",
        "I truly love Ericas college vlogs, with her roommates. But i lowkey missed these ones with her sisters. <333",
        "evelyn and their mom look so alike its crazy ",
        "It's really teen using their middle finger too feel their good",
        "is there a way to get the two dogs get together?",
        "I was crying because pakistan lost in the finals and now here Erica making my mood go  with this vid",
        "Yay",
        "OMGSHSHSH",
        "Erica where is your new vid I saw you uploaded a new vid last night",
        "I was about to sleepppppppp",
        "Erica your banks look soo good i dont know why your mom and sister doesn't but it really makes you so girly and cute it was literally the first thing to notice for me cuz banks really suits you",
        "Your bangs look cute on you ",
        "Bruhh, u not only a vibe but also my therapist girl ️",
        "You are just looking perfect nothing is wrong with your skin believe me",
        "Erica is so kind she literally shares everything she eats 🫶",
        "ERICA UR VIDEO IS IN #trending!!!!",
        "I heard that raw honey helps with your acne",
        "Hi Erica I love ur vids it's wierd to be early love u",
        "Girls",
        "I wass about to sleeeppp",
        "Imma prob be Beca Rabbit from Peppa Pig cause she's just main character energy.",
        "the love i have for her talking abt her acne cause i feel the excat same way and i love her bro",
        "no cus i actually love your bangs",
        "New sub",
        "what's y'all's fav dessert?🫶🫶",
        "Try not to cry a lot cuz crying may cause pimples on the face not may but it happened to me",
        "I thought u looked pretty with the sunglasses on",
        "always love the sibling rivalry",
        "Erica doing asmr to just show of her sexy nails ",
        "erica ha ok yes love love ",
        "“I literally said I don’t want to spend any money and now I’m at Sephora” BIGGEST MOOD",
        "HAII",
        "second!! also I LOVE U ERICA",
        "WHATS YOPUR SCIN CARE",
        "Pin me if you KNOW your the best sister ",
        "Whens our wedding",
        "10:26 same Erica same",
        "ericaaaaaaaa i’ll be in nyc (madison square garden) for an itzy concert tonight! :D",
        "early 8 mins yayyy happy weekend",
        "Funny thing, I'm also spending the weekend at my uncle's NYC apartment since today is my birthday and I get to chose where i'm going(im 21 just saying)",
        "LOVED ERICAS HAIRR ️️",
        "it literally makes me tear up to think that i have been watching them so much that ive seen emily enter high-school, erica enter college and evelyn moving into a new apartment, im truly proud of you guys <3",
        "erica the savage, swag, pretty sister",
        "I'm so early yayyyyyyyy",
        "your bangs look really pretty :)",
        "evelyn is your mom's replica",
        "(This sounds dumb but) does nyc mean New York coty?",
        "\"I don't wanna spend more money sooo\" Walks into SEPHORA \"I actually need something from SEPHORA-\"",
        "Erica, your humor is cool I need a friend like you",
        "OMG I PLAY FIELD HOCKEYYY TOOOO",
        "Love you videos Erica love from Pakistan 🇵🇰",
        "🫢",
        "I love you guys so much, my comfort youtubers  <333",
        "Can we appreciate that Cory is literally giving us hour videos every day? The dedication is real",
        "tbh I always check your channel everyday for your update hahaha",
        "Love you loads ericaaaaaaa!",
        "SLAYYYYY",
        "your vids are half eating it makes me hungry",
        "I started love my acne when I see Erica I mean She still has confidence even tho she doesn't has clear skin Then why I should cry over 6 acne OMG I love u erica my best girl!!!!!!",
        "the ha sisters are literally carrying youtube rn",
        "pov this is posted after halloween",
        "",
        "question, how many hours/mins do you edit your vids?",
        "I wish I was related to ya'llsuch a VIBE!",
        "omg ErICCAAAAAAAA do you know howww much we lovee tou",
        "Can we talk about the intro? ",
        "Hiiiiiiiiiii",
        "I love the bangs!  ",
        "Early!\nLove ur videos erica!",
        "Thank you Erica for telling us Evelynns next video ",
        "I love you so much, best YouTuber",
        "I like the bangs",
        "These videos are like half of my life",
        "hey erica  enjoy your vlogs! it makes mehappy to see you and, friends and family!!! roomates!!thank you!!! luv ya babe !! hugs and !! luv the haul!!",
        "I actually love your bangs\nSlay",
        "Your bangs are nice. They're lying",
        "cool ericka",
        "NEW VIDEO YESS",
        "one minute ago !! crazy ️",
        "ALL OF THE PRODUCTS YOU USE ARE GREAT TRUST ME",
        "erica is a vibe",
        "0:28 is that your mum?",
        "Early asf but hey erica",
        "You should try curology. It’s cheaper and works great for your skin. They ask you some questions about how your skin is and have you take pictures so they can see your problem areas. Your skin will feel great afterwards too",
        "missed seeing the 3 of u sm",
        "Erica: I don’t wanna spend any more money\n2 seconds later\nErica: I need to get stuff from sephora ",
        "Do you are video is 33 on trending! When I’m watching !",
        "it’s ok erica I like yo bangs ",
        "If you feel like nobody cares about you, go somewhere by yourself and kneel down to pray. Put your hands together and give your praise and prayer requests to Jesus! Jesus cares about you! He cares about mankind! Even though we as people can’t see Jesus with our eyes, we know for a fact that GOD sees us with his. For it is written, “The eyes of the LORD are in every place, beholding the evil and the good.” Proverbs 15:3 KJV PRAISE JESUS WHO CHOSE TO DIE ON THE CROSS FOR YOU, SO THAT YOU MAY HAVE THE OPPORTUNITY TO BE GIVEN LIFE WITH NO END!",
        "HELP ERICA IS THE DEFINITION OF MAIN CHARACTER AAAA",
        "Beautiful ladies even when don’t have makeup ",
        "accutane helped me too!! it worked wonders to my skin  but u will badly need a lip balm for your lips, it would be drying AF",
        "YASSSS I HAVE Been WAITING For THIS",
        "\"CUZ I DONT WANNA MAKE EYE CONTACT\" this is soo ERICA thing",
        "“I don’t want to spend anymore money”\n\nwalks into Sephora",
        "one of the best things about dude is that he never takes credit for himself when he achieves something . he always respect us, the audience, and his team, and he is always polite in all of his video. we congratulate ourselves on this achievement more to come and everything to come\"\" Let's we all just appreciate the content this man and his crew makes it's just a masterpiece imagine what's he's gonna doing the future I hope this channel never ends and keeps spreading happiness. :*",
        "I should make more asmr videos... That was legit cool",
        "Are those the leafs from heartstopper ? at 5:18",
        "I love them but it's\n not cool to say body hair is disgusting..",
        "inserts cute asmr intro ",
        "more zoe content?",
        "5:17 the heartstopper themed door… ",
        "I thought Evelyn moved out...",
        "To be honest Erica is my favorite sister ",
        "Nobody: \nErica:'\"i don't want to spend any more money\"\nAlso Erica: (walks into Sephora )",
        "For Halloween I was a minion",
        "Not the armpit "
    ],
    "comments_disabled": false
}