{"video_id": "RuLWx25Jp3w", "comments": ["it literally makes me tear up to think that i have been watching them so much that ive seen emily enter high-school, erica enter college and evelyn moving into a new apartment, im truly proud of you guys <3", "what I love about the HA sisters:\nEvelyn-Her sense of fashion and beauty\nErica-Her cool personality\nEmily-Her humor", "Just wanna say I’ve been dealing with acne since I was 11 (I’m 17 now) and it’s so refreshing to see someone be so real about it and have someone to relate to. Thank you Erica :)", "I WAS ABOUT TO STUDYYYYYYY", "Erica and her sisters are the best things that have ever happened to us with her vids and their places", "thank you so much for showing your acne, i hate those influencers who post an unfiltered photo when they have literally one pimple and caption it “everyone has bad days” than everyone praises them in the comments. You make me feel so normal, Thank you for showing the real side of being a teenager. Also i LOVE your bangs idk why you’re sisters are talking about, you looks hawt ", "I’m lowkey in a very low place in my life, but ERICA, EVELYN AND EMILY LITERALLY MAKES ME SO MUCH HAPPIER  luv u guys!! :D", "i love Erica and how real she is, and always tells the truth.", "I love how Erica is so real with her life and i also love how she is handling her college life and YouTube", "Fact : erica is so golden and makes our day better", "u guys honestly keep my life happy and it’s so funny how u guys judge eachother and say shit about eachother", "Fact: she makes everyone’s day better ", "erica! i just wanna say that i enjoy so much watching your videos and you always make me want to be confident like you. you are so awesome!! will support you always <33", "Your all so pretty and I love watching your content bc I can see that you have live for each other but hate to show it, like me and my siblings . You guys just inspire me sm and I love seeing you all smile!! ", "Erica is such a cool personality I love her videos so fucking muchhhh. I love the way how she's very real and has no filter on her. lots of love Erica️", "Can definitely sympathise with how self confidence can be impacted depending on how clear your skin is. But just wanted to say you’re absolutely stunning and I hope you see yourself as how we all see you - a queen.", "You guys make world such a happy world thank you so much for that and lots of love from India 🇮🇳", "as a girl who also struggles with acne very similar to yours and is also starting acutane, i know it’s hard and that u feel alone. i’ll look around and i feel like all the girls and guys even have perfect skin without a single blemish while i have acne. the truth is many girls just use makeup to cover it and many more people than u think actually have it.", "Erica honestly makes my day so much better! I watched the ha sisters since the started and I’m so grateful for all they’re hard work the put in they’re Channels.", "as a person that also took accutane for A YEAR and a half sucked ASS cheeks. i went through a lot MENTALLY and physically due to the hormones and dryness but watching you take care of yourself and using the right products for facial care makes me happy. i was self conscious about my acne at such a young age (I was about 10-11 years old, now 14-15) but watching you being open and strong about it makes me just as happy. you’re doing amazing, Erica and what you’re doing right now is amazing. it’ll clear up very very soon. much love. ", "Erica your bangs are literally amazing and they look so good and your acne is not even that bad. Soooo have confidence and don't listen to these haters who tell u otherwise", "Whoever's reading this , i pray that whatever you're going through gets better and whatever you're struggling with or worrying about is going to be fine and that everyone has a fantastic day!", "You guys r so unique and pretty and genuine, it always brightens up our mood ", "Your personality is so outstanding I wouldn’t even notice your acne tbh don’t let temporary breakouts dim your shine !! Love you sm", "literally when i make my school works, i always watch you guys. You guys always makes me motivated ", "Erica's videos are always so therapeutic and healing for me", "I’m so proud of you Erica <33", "Thank you Erica for making my day so so happy ", "I think the college vlogs are fun but I do miss when it’s just you Erica or you and your sisters! ️", "I feel like the ha sisters are the kind of person everyone wants to be friends with  ( at least for me ) like y’all r so cool and I love y’all sm <33", "You’re gorgeous with or without ache .\nAlso aww Emily waking up is adorable.", "excuse me!! Pleaseeee hear me out!! Ur face, PERFECT. ur fringe (bangs ), PERFECT. ur outfits, PERFECT!!! ur so pretty and you shouldnt compare yourself to everyone else in college like that cos bro, u dont need to!! I bet others wish that they were like you and had all that confidence and such pretty features. ur amazing erica!", "thankyou for keeping it real with us erica, i love you sm", "Absolutely love your videos  my day just got a whole lot better xx", "Petition for mark to have his own podcast where he just reads stories. Literally anything. His voice is so soothing.", "istg erica is so realistic bc other youtubers be like they have the perfect life and stuff but i love how erica shows her Imperfections too  y'all are so entertaining to watch to like im literally on my knees for u guys", "this is so random but it makes her so sympathic that she has acne and just shows her skin without make up and talks about how she is struggling with self confidence bc of it. im literally going through the same thing for years so its very humbling <333", "LOVE THE VLOG ERICA :) no need to apologize for not posting, we appreciate the bits u do for us and that what matters, u deserve to go out and socialize and have fun..u deserve it ", "Erica is actually really good at asmr", "Erica and her sisters are the best trio ever I love this video it’s so cool & funny ", "When Joseph and Julia came in like \"We're here to save our sisters!\" it was so cute!!", "It’s ok Erica. It’s your channel so you post when you post and your in college enjoy yourself ya know? You got this love! ", "For the skin, even after using products if its not working or if it goes and comes back often the problem lies in the gut/ the colon. I had the same issue. So for a month i had to stop consuming food made of flour and sweets. I saw a big change. There were no new pimples and i had to only handle my acne marks. And eventually i started adding sweets and food made of flour in moderation. Its in the gut. If you take care of both the inside and the outside your skin will be fine. I hope this helps. Either way you are really pretty ", "erica, you probably wont read this comment cuz ur def really busy but im jus letting you know that its okay to have acne!!! acne is beautiful even if it doesnt seem like it or feel like it, and i assure you PROMISE you that not every1 in college has clear skin. Im here for u and ur beautiful love uuu!!!", "actually cried a tear at this one. cinematic masterpiece papa", "i really love these kind of casual vlogs ", "whenever evelyn, erica or emily post’ it js makes my whole day no matter how bad my day was 🫶", "It was like Erica knew we were expecting a video of her in her college and she said “I’m in Evelyn’s apartment… not in college..”", "“I literally said I don’t want to spend any money and now I’m at Sephora” BIGGEST MOOD", "Erica: “wake up”\nEmily: covers face “ew… actually I probably look really good right now” \n\nMy exact thought process when I wake up 12:57", "erica if you really feel like your skin is dry and you've been breaking out, i recommend going to a dermatologist and asking them to recommend brands for your skin!!", "Erica is the best sister Ngl she’s hella funny without trying", "Erica always make my day ️", "I think your bangs look amazing, and don’t stress about acne u look beautiful either way and it happens to the best of us, it’s natural and normal <3 hope u have a good day Erica. keep ur head up queen ", "“everyone in college has crystal clear skin” LITERALLY you and me are in the same boat erica fr ", "watching the ha sisters is so comforting 🫶", "I love Erica's energy ", "Erica is literally such a mood tbh", "I love that they're all so real. I love they're videos", "I think your bangs look good I think it suits you  I love you and your sister you and your family with out fail always make me smile thank you ", "Erica, can you do the blind deaf mute challenge with your college friends\n I bet that would be funny ", "erica: i'm not spending anymore money! \nalso erica: hey guys were at sephora.\n\nyour my fav sister erica!!! :)", "my day gets better and better when I watch ur videossss ! <3", "ON CAMERA 2! LITERALLY TO THE WHOLE PUBLIC. THAT'S SOME DAMN BRAVERY. GOOD ON YOU ERRRICAAAAA", "Hey Erica, thought I just share with you since you seem to be struggling w acne and I can totally relate to it. I spent like tons of money at Sephora too but they’re quite expensive and even worse if you purchase ineffective items so hopefully this helps!! ", "Best sisters in the whole world they make my day everyday ", "the whole video erica pointing smt on her that she hates, but like she looks georges with litrerally anything, the bangs looks so good on her and the way it moves with the wind too, and her acne dosnt make her anyless preety. i rlly hope she knows this <3", "More of this videos please !!! they’re so comforting to watch :)", "I truly love Ericas college vlogs, with her roommates. But i lowkey missed these ones with her sisters. <333", "i legit love how they are all so real about everthing like what they are insecare about and stuff<4333", "OMG ERICA YOU JUST MADE MY DAY!!!!", "I love how Erica's videos are basically behind the scenes of Evelyn's video", "Erica is so kind she literally shares everything she eats 🫶", "Erica and Emily are a total savage but Evelyn is a kind of a soft girl", "Erica, sameeeee idk how a lot of people in college has CLEAR GLASS SKIN and here's me having a breakdown bc of acne!!!!!", "Erica is my fav out of the three ha sister she is such a mood and so relatable.", "Girl u r gorgeous. The skin issues r annoying but I pray u don’t allow it to make u self conscious cause I promise nobody cares. And if they do that’s on them. Ur personality shines brighter than anything else. ️", "ily erica, dont compare urself to other pplbro your skin is gorgeous ", "Erica, I hope you know you are beautiful just the way you are. Girl you do what makes you feel good.", "She like makes everyone's day as usual", "I started love my acne when I see Erica I mean She still has confidence even tho she doesn't has clear skin Then why I should cry over 6 acne OMG I love u erica my best girl!!!!!!", "I actually thin your bangs look really good on you! You always look pretty️", "i love how there just so honest with eachother i love it ", "always love the sibling rivalry", "the love i have for her talking abt her acne cause i feel the excat same way and i love her bro", "To be honest Erica is my favorite sister ", "Aaaaaaa I LOVE YOU SO MUCH ERICA YOU MAKE MY DAY", "Erica: I don’t wanna spend any more money\n2 seconds later\nErica: I need to get stuff from sephora ", "It just makes me so happy to see them together!(ps,y’all are the best YouTubers!)", "Hii!!, I've been with you guys since day 1, you guys made me happy everyday, even tho you guys don't post everyday♡, literally love you guys soooooOOOO much!!! ᰔᩚ", "erica: we're walking back home because i don't wanna spend any more money.\nalso erica: oohh SEPHORA i actually need something from SEPHORA\nICONIC MOMEMENT lolllll", "its so amazing to see how far they have come Emily in high school, Erica in college and Evelyn getting a new apartment they honestly are my fav youtubers they are so funny w/o trying", "Imao the “you thought you could catch me lacking” \nErica’s such a vibe ", "i swear every time we see Emily shes broken a bone ", "If it makes you feel better my Erica, my skin has been shit recently too ", "You are just looking perfect nothing is wrong with your skin believe me", "Erica: I don’t want to spend anymore money today\nAlso Erica 2 secs later: im at Sephora!", "Seeing erica makes me feel comfortable having acne on ma face :D", "I seriously want a sister like Emily Evelyn and Erica", "i hope you have an amazing day because you so deserve it "]}