{"video_id": "seBixtcx19E", "comments": ["Searching was a masterclass in visual storytelling and one of the best films I saw in 2018, was nervous when they announced a sequel, surely the original was lightning in a bottle. But I have to say I'm excited after seeing the trailer and hope this manages to recapture the magic (please give this a proper theatrical release in the UK!)", "Searching was so underrated. And this looks just as intense as that film.", "The first one was really good", "One of the best things is that he never takes credit for himself when he achieves something. He always respect us, the audience, and his team, and he is always polite in all of his videos. We congratulate ourselves on this achievement. More to come and everything to come :-O", "The scary thing is this been happening in real life people be going missing on these vacations.", "so excited to see Storm Reid in this, she's been killing it on Euphoria! also what a perfect way to do a sequel to such a one-of-a-kind film. the first one had so many twists & turns I did not see coming and it looks like this one will too. but the emotional core (a parent searching for their child/a child searching for their parent because the law let them down) is still there, just reversed.", "Storm Reid is a great actress. Can’t wait to see her in this.", "I'm quite excited to see this film, I need to watch Searching too. But what I really like is how it highlights a situation most don't think about. All your life, you're told to worry about your kids. Never take your eyes from them, keep a hand or one of those leash backpacks on them, etc. Which isn't bad, kids are easy targets being smaller and weaker.", "Whoever voiced that Grandma boss needs a raise, the voice acting is spot on. I felt every emotion =:-*", "I absolutely love Charlie, always going out of his way and doing everything he can to help people in any way possible whether it's with money, with a silly competition, a serious stream to promote exposure but still being silly to make people jus laugh, a charity stream or just something as simple as streaming to thousands of viewers every day making us all laugh and constantly putting smiles on her faces. I don't know about you guys but that sure does a lot for me  thank you charlie, for just simply being new", "Storm Reid gets the lead role she deserves!! About time, Hollywood!!!", "Searching is one of the best and most underrated movies I’ve seen in quite a long time. It still gets me every time I watch it. The way they did that movie was genius and this looks just as good!", "These videos leave a smile on my face when thinking of Technoblade, because no matter how much he will be missed his legacy will never be forgotten. Rest in peace technoblade", "I really respect Mick for standing up for himself and his work. MVP. GOAT. What a guy", "At first I thought this movie was cancelled but now I'm so freaking EXCITED I been waiting for this", "Will definitely be tuning into this movie when it comes out. Searching was such an underrated movie and a great one too! January can't get here faster ", "Searching was AMAZING. I can't wait for this sequel. Im glad its a whole different story.", "Searching was excellent.\n\nI'm very skeptical about this one though since Aneesh isn't returning to direct and he's one of FOUR writers credited for this. And then there's the January release date. Usually not great signs.", "Thank you for this movie! It is SO REAL! People need to know how to thwart the “real life” bad guys under their noses!", "the scene with Kratos and Brok was so touching, it really seemed like Kratos was making him happy in some way", "Absolutely loved Searching. Can't wait for this!", "YOOOOOO!!!! I'm super late, but this trailer just gave me Goosebumps  Omg,  I would literally lose my mind if I was in this situation. HOLY SMOKES", "The first one was great, can't wait to see this one!", "What would make this movie so good is that if a searching easter egg shows up in this movie to connect the to movies together as if it was in the same universe like she can have a Facebook friend of Margot from searching or when she is having trouble finding her parents she could find an article of David Kim finding Margot Kim", "one of the best thing about dude is that he never takes credit for himself when he achieves something. He always respect us the audience and his team, and he is polite in all his video's we congratulate ourselves on this achievementvh", "I love it already great plot great cast", "Searching the extended version was great, and this actress was awesome in Don't Let Go. I might have to watch this when it drops.", "Got chills. Will definitely be watching. I’m more hyped than I was for wakanda forever", "The first one was really good can’t wait for this one", "Searching was one of my favourite movies of all-time. Excited for this one!", "I cannot wait for this. So excited, but I have strict parents who might say no…", "A friend in college said she went to one of his shows in Toronto, she liked some songs he played, but the crowd had to sing literally entire songs for him. She described it as \"I forgot the entire show right after I saw the show\". Definitly one of the performers of all time. :P O:-)", "Searching was the kind of movie where I was bored out of mind before watching it but later coming out like I just watched the best movie ever made.", "I got this as an ad and watched the whole thing  I wanna watch it", "Rewatching this stuff not in remembrance but to see if I can still enjoy his content without feeling down that hes gone. I can safely say his videos will forever be a joyful watch for me, even with the knowledge of his passing.\nBloody legendary skills to make people laugh. Legends never die", "Searching was a wonderful film.  I'm pretty skeptical that this will be on its level for a few reasons, but I'm excited to give it a chance anyway.  Even if it's not as good it should be a fun watch.", "I can’t wait for it so excited", "Hey Cory, Ive been going through a really bad phase of depression and every time I see that youve uploaded I can smile and laugh while watching it. Thanks Cory, love you. >:(", "the team making these must be really talented to recreate all those computer graphics so perfectly", "Ok that looks amazing. Now one of my most anticipated movies", "Meowscarada is my choice still despite the bad match-ups with types. I really do love the design as it reminds me of a mix between a cat, Dark Magician, and Tuxedo Mask.", "OMG!! CAN'T WAIT!!! ", "From searching ️️️️ which broke me.... To this I can't wait...", "The first one was crazy this one is 10x more crazy super excited ", "This looks pretty good. Love Nia Long ", "Fingers crossed this movie turns out as good as the first one, that one was amazing.", "Heard about this on the ride. \n\nLooks really suspenseful.", "Se ve buena y ese misterio que oculta va a ser terrorífico", "This looks rlly good ngl! Can’t wait!", "Excited for this!", "This actually looks really good", "Jimmy is a real life saver when it comes to Wednesdays", "Missing will be a phenomenal sequel to Searching!", "This seems just like searching. Searching is such an underrated film", "YES. ALL I NEEDED TO READ WAS THAT ITS THE SAME CREATORS AS SEARCHING. Haven't even watched the trailer and I know it'll be amazing.", "loved searching cant wait for this", "OMG ️️ I'm gonna love this new movie it looks so great", "Omg!!! This looks so good. I cannot wait", "I got to give this film A+++ for its orginality. Looks good. Trailer kinda seems to give away the film", "OMG!! CAN'T WAIT!!!", "I’m already chills even though is a trailer", "Omg can’t wait this looks so cool!", "Can't wait to see the movie", "I really loved the searching and that will be great too I am sure of it!!!!! I cant wait to see it", "Ghostface Josh being terrified of yellow blob Vik was hilarious", "I can’t wait to watch this movie after enjoying Searching!!!!", "This looks so interesting ", "I found this on a ad and it looks like a good movie", "I was expecting her step-father to say \"Fight like a man\".\n\n\nThat's some Rush hour humor right there.", "This looks so good!", "I have hope for this movie.", "The fact that people originally believed a CEOs attempt to shift blame to an individual well loved composer is insane to me.", "Let's hope this movie does a better job than unfriended", "I really loved searching so I’m looking forward to this", "This looks so good", "This trailer was chilling...", "It is so entertaining just watching the chaos that occurs when they play with each other.", "holy this is one of the ads i actually watched. now im excited", "Looks awesome!!!", "Searching was excellent.\nI'm very skeptical about this one though since Aneesh isn't returning to direct and he's one of FOUR writers credited for this. And then there's the January release date. Usually not great signs.", "I am a fan of Searching_   I hope this is as good as the former.", "Woah this looks amazing", "It’s scary asf bc this is an everyday thing but with a twist!!!", "Finally!! Some good black representation ️", "Searching was awesome! This looks good too", "CAN'T WAIT", "This reminds me a lot about Taken. But it's the Mom that's in trouble instead of the daughter.", "This movie been so good!", "Searching was really good, hope this raises the bar ", "Omg Can’t wait It’s Better Then Searching Movie 2018", "Great Stream. I can't wait to play Sonic Frontiers, I have to wait because the game has not delivered yet . I hope I see references of Lost World and Forces. I hope my favorite boi Infinite is mentioned and the phantom ruby in Frontiers. I'm still gonna be hopeful for Infinite returns in future Sonic games.", "This reminds me of Searching. I loved that movie", "I happen to love Storm Reid", "Norns:YOU GON' DIE! \n\nKratos: For how long this time, though? =(", "I loved searching and these type of movies that are made with webcams and something scary happens like unfriended and searching.", "Searching was great. This looks so interesting.", "Nah this is def gonna be", "I watched Searching on Netflix & then bought the dvd because it was so good.  However this looks just like Searching but with different characters & instead of the daughter going missing it's the mother now.  Is the third going to be about the dad going missing next.", "I hope the alien invasion plot comes back!", "This looks good and I liked the movie Searching."]}