{
    "video_id": "seBixtcx19E",
    "comments": [
        "",
        "I absolutely love Charlie, always going out of his way and doing everything he can to help people in any way possible whether it's with money, with a silly competition, a serious stream to promote exposure but still being silly to make people jus laugh, a charity stream or just something as simple as streaming to thousands of viewers every day making us all laugh and constantly putting smiles on her faces. I don't know about you guys but that sure does a lot for me  thank you charlie, for just simply being new",
        "Storm Reid is killing it I’m so damn proud of her!",
        "Can't wait to see the movie",
        "if this wasnt told through electronics this could be a lot better",
        "They totally ripped the idea and style of this movie off from another.",
        "Bro This Looks And Very Interesting",
        "LETS GOOOOOO",
        "This actually looks really good",
        "This LOOKS worse than a Tyler Perry Film...Asian-Black couple goes to some third world country on vacation...Realistic?",
        "Se ve buena y ese misterio que oculta va a ser terrorífico",
        "This is a scary horror!",
        "Nice ",
        "This young gal played Angrboda in God of War Ragnarok?",
        "I am going to c this",
        "Ok so her boyfriend is a felon, and her mom is not only alive but somehow in on it. THANKS TRAILER!!!!",
        "Lame",
        "OMG!! CAN'T WAIT!!!",
        "This trailer gave way to much information and storytelling then it should have given, that literally felt like I just watched a short summary and synopsis of the whole movie.",
        "Searching was excellent.\n\nI'm very skeptical about this one though since Aneesh isn't returning to direct and he's one of FOUR writers credited for this. And then there's the January release date. Usually not great signs.",
        "Wow",
        "one of the best thing about dude is that he never takes credit for himself when he achieves something. He always respect us the audience and his team, and he is polite in all his video's we congratulate ourselves on this achievementvh",
        "Lmao come on can i bring up the fact that she went on a website for ninjas? And hired a ninja to find info about her mom or so i think later on in the trailer you can even see him say he thought it was 250/hr So did the ninja tell her the information about where her mom went??? This needs an explanation…Or am i tripping…",
        "Zendaya's little sister ️",
        "What is the score used in the trailer from?????",
        "Damn I was surprised we are still getting these types of movies in 2022, but damn yall showing the entire twist in the trailer spoiling it yourselves sony.",
        "Can someone tell me where I've seen this spade before \nWhats it been in?",
        "I cannot wait for this. So excited, but I have strict parents who might say no…",
        "I have hope for this movie.",
        "Nia long is still amazing omg",
        "Damn Hollywood so desperate they even put freshman year college projects on the big screen.",
        "Fact : Searching movie sequel ",
        "Thanks for spoiling the movie. Now i don't gotta actually watch this piece of crap lol.",
        "crazy timing ",
        "the scene with Kratos and Brok was so touching, it really seemed like Kratos was making him happy in some way",
        "so basically a searching remake ?",
        "Omg!!! This looks so good. I cannot wait",
        "My eyes are already tired just by watching this trailer",
        "Omg can’t wait this looks so cool!",
        "i wlda been in columbia with a glock bout my momma period",
        "I am Watch this",
        "Did anyone text the number ",
        "Wow, talk about coincidence that I was looking up the name of his next project and lo and behold there's a trailer since yesterday.",
        "I thought rue was missing",
        "Bro you just told us the whole movie",
        "shooting a movie where she dosnt leave her room, very dull.",
        "Do this movie come out next year 2023 ?",
        "Got chills. Will definitely be watching. I’m more hyped than I was for wakanda forever",
        "Dope ",
        "It will be interesting to see how this compares to Aneesh Chaganty's Searching.",
        "I hope people dont go missing after watching this.. but will keep an eye on reviews",
        "Discount searching",
        "This is gonna be a edge of your seat thriller!",
        "If this is from the people who msde Searching, it MUST be good",
        "Did this trailer reveals everything????",
        "OMG ️️ I'm gonna love this new movie it looks so great",
        "hi",
        "The editor of Searching is directing this one. Congrats to him ",
        "This looks rlly good ngl! Can’t wait!",
        "Ruuuuuuuue",
        "This is my film. I really love this concept.",
        "What is the song used in the trailer???? It sounds so familiar....",
        "I’m already chills even though is a trailer",
        "wow this just looks messy ",
        "Elijah park is so handsome",
        "This is just like that movie Searching with John Cho",
        "GO STORM ",
        "Totally agree with u. btw thx for CinemaVariety idea",
        "The first one was crazy this one is 10x more crazy super excited ",
        "I got this as an ad and watched the whole thing  I wanna watch it",
        "1:55 I think at that point the trailer is giving away too much",
        "Hey Cory, Ive been going through a really bad phase of depression and every time I see that youve uploaded I can smile and laugh while watching it. Thanks Cory, love you. >:(",
        "Another Gem is loading.",
        "Damn, I love SEARCHING, it was so good! Hope this doesn't disappoint and live up to Searching's legacy.",
        "Storm Reid gets the lead role she deserves!! About time, Hollywood!!!",
        "Searching was so underrated. And this looks just as intense as that film.",
        "Wow this looks so good!",
        "NAH IM SO EXCITED",
        "Missing will be a phenomenal sequel to Searching!",
        "dead internet is real folks 10 days with nothing here except my comment but multiple comments from bots 2 days ago under the most upvoted comments.   WAKE TF UP",
        "A SEQUEL TO SEARCHING? LETS GOOO",
        "Shubham rathod bis",
        "Why does this look like an ad from apple lol",
        "This looks good and I liked the movie Searching.",
        "Great video",
        "This trailer shows way too much. Should've been way shorter.",
        "Thumbs",
        "Agent Park ",
        "First, they were searching,\nNow they are missing",
        "Did I just watch the whole movie in like 2 minutes?",
        "Excited for this!",
        "Omg Can’t wait It’s Better Then Searching Movie 2018",
        "Why do I feel like I watched the entire movie",
        "Fingers crossed this movie turns out as good as the first one, that one was amazing.",
        "Great Stream. I can't wait to play Sonic Frontiers, I have to wait because the game has not delivered yet . I hope I see references of Lost World and Forces. I hope my favorite boi Infinite is mentioned and the phantom ruby in Frontiers. I'm still gonna be hopeful for Infinite returns in future Sonic games.",
        "Nah",
        "Hey how many people texted the phone number at the end, if you did can u help me and see if we’re supposed to wait or do something with the number",
        "We out to see this",
        "Wait its just like searching",
        "Why does Sony have a trailer for the trailer ",
        "This seems just like searching. Searching is such an underrated film",
        "Mom is just partying",
        "Storm is a good actress",
        "I found this on a ad and it looks like a good movie",
        "I hope the alien invasion plot comes back!",
        "I happen to love Storm Reid",
        "Nice",
        "Enjoy his life suddenly lost his mom then she searching his mom",
        "I thought they already made this movie with John Cho",
        "This movie lowkey looks like an ad for apple and iOS",
        "楽しみです",
        "I just knew this was from the sand directs who created Searching",
        "so excited!!",
        "Booo copycat, searching was much better",
        "they gave too much away in the trailer",
        "This movie? Is amazing.",
        "Angraboda?? What in Jotunheim are you doing here??",
        "Woah this looks amazing",
        "Searching was great movie!! i like it tho hehe i cant believe there’s sequel coming soon!!",
        "Finally",
        "Hollydrugs...zzzz",
        "Welp I just watch the entire movie \nWhat the hell is up with movie studios releasing trailers and spoiling the entire movie",
        "i loved searching, can't wait for this one",
        "Searching - San Jose, California \nMissing - Somewhere in Colombia and Los Angeles, California",
        "Looks good, but it looks extremely low-budget.",
        "i was keen half way into this trailer until they spoiled the whole movie. nice one....",
        "wow, seeing storm reid play another big role is awesome. she’s quite talented",
        "LOOKS PROMISING.",
        "Shot on IPhone",
        "Getting really tierd of movies that only show colombia as a kidnapping pool... We are not that",
        "I was expecting her step-father to say \"Fight like a man\".\n\n\nThat's some Rush hour humor right there.",
        "The first one was really good",
        "I never seen searching movie and so I don’t know what is this",
        "0:30 when your home alone",
        "Work is so perfectly",
        "Ghostface Josh being terrified of yellow blob Vik was hilarious",
        "Looks interesting but ya'll showing way too much man",
        "I’m shoook this is a nightmare \nSo glad she did this project",
        "cant wait for this omg.. searching was so good",
        "Storm Reid is a great actress. Cant wait to see her in this.",
        "omg it's matt simmons",
        "Bruh I was so intrigued until 1:38 where it gave away so much of the plot ",
        "Tf is this",
        "The crazy thing is that i'm colombian!",
        "For those wondering! The first artifact picked up in this episode is a fertility idol! She looks very similar to a prehistoric figure called the Lady of Wilendorf!",
        "The audio issues in this game are always at the worst moment. If they dont get it right with that 3k dev team then all hope is lost lol",
        "can't wait to see if this one has a secret storyline just like searching",
        "This is basically dark Web 3",
        "Storm really sounds like riley from TLOU so i quess its a good choice",
        "I got to give this film A+++ for its orginality. Looks good. Trailer kinda seems to give away the film",
        "Guys are we not going to talk about how this is has UNFRIENDED vibes?",
        "Searching 2",
        "Let's hope this movie does a better job than unfriended",
        "For one second, I thought it's an euphoria short because of the neon fonts and Storm Reids but I am pleased nonetheless because i am also a fan of Searching too",
        "Very nice",
        "hey what the name of the frist movie?\nbtw This looks soooo cool!",
        "Is this film sponsored by apple?",
        "Juntao always up to no good",
        "calling it rn the  guy in the tux is the killer there useing the same trop as searching there the dectative tried to convince kim his doughter changed her nsme",
        "This looks terrible",
        "Comin soon when this year ?",
        "loved searching cant wait for this",
        "Wahh seru pake teknologi sosial media film nya... pemain film nya juga bagus-bagus...",
        "This looks campy as hell.",
        "I will be seated!!!!",
        "Searching was a great movie so I have high hopes for this one. Plus the actress is great",
        "This movie looks really cheap ngl lol seems like a highschool PowerPoint project",
        "I watched Searching on Netflix & then bought the dvd because it was so good.  However this looks just like Searching but with different characters & instead of the daughter going missing it's the mother now.  Is the third going to be about the dad going missing next.",
        "I'm quite excited to see this film, I need to watch Searching too. But what I really like is how it highlights a situation most don't think about. All your life, you're told to worry about your kids. Never take your eyes from them, keep a hand or one of those leash backpacks on them, etc. Which isn't bad, kids are easy targets being smaller and weaker.",
        "Isn’t this like the indie movie about the guy who got abducted when he found out his father wasn’t dead",
        "roles have been reversed, ready for this one , john cho in Searching was oscar worthy fr.",
        "Searching was really brilliant movie. I hope this will be too!!",
        "now were switching role, the daughter search and the parent gone lol",
        "Man this shit better drop tonight",
        "\"To live a creative life, we must lose our fear of being wrong.\" **Anonymous",
        "I don’t like to make comparisons but I prefer Storm more than Zendaya and this looks really good",
        "Norns:YOU GON' DIE! \n\nKratos: For how long this time, though? =(",
        "From the minds behind Searching? I'm sold.",
        "OH this is going to be goooooood.",
        "\"Does anyone speak English\"...\"I'm Sorry\" ",
        "One of the best things is that he never takes credit for himself when he achieves something. He always respect us, the audience, and his team, and he is always polite in all of his videos. We congratulate ourselves on this achievement. More to come and everything to come :-O",
        "Very mice",
        "Looks like a bad movie.",
        "Why 9.1m views buy only 3.5k like?",
        "Bruh they just spoiled the whole movie in a minute and a half",
        "Hopefully like searching this movie turns out good",
        "Yessss",
        "Never got tired of movies spoiling there plot in the trailer",
        "I feel like I just watched the whole movie",
        "the spoiled the whole movie lol",
        "This looks so interesting ",
        "Hope it's good and not another Unfriended: Dark Web!",
        "i am waiting",
        "Searching 2: This time we go black…",
        "some of these scenes are similar, hope they don't do the same things as searching",
        "saw the whole movie already goddamn",
        "I'm sold",
        "I would’ve gone to the theaters, but thx to this trailer showing the entire movie to me, I don’t need to. Glad Sony saved me $8",
        "Searching was a masterclass in visual storytelling and one of the best films I saw in 2018, was nervous when they announced a sequel, surely the original was lightning in a bottle. But I have to say I'm excited after seeing the trailer and hope this manages to recapture the magic (please give this a proper theatrical release in the UK!)",
        "she always in some mess",
        "The sequel to SEARCHING.",
        "err mmm thanks for choosing Colombia...I guess",
        "goosebumps",
        "10/10",
        "It’s nothing but a remake of searching ",
        "Good trailer.",
        "They told the entire storyline!",
        "Ayo is it me or is everyone on that trailer owning a device with crazy megapixel stats",
        "There is an Indian movie just like this but .like all  movie walks through some characteres phone or pc screen . and the story is there is a girl was missing and her online boyfriend were the one searching ,the movies name is 'c u soon '",
        "This is just a blind copy of searching",
        "Wow, Ninja's new \"I'm loud and abrasive\" angle is not my favorite. ;)",
        "This reminds me of Megan Is Missing.",
        "How many times are they gonna make this fkn movie?",
        "Searching was really good, hope this raises the bar ",
        "Terrible movie",
        "Really hope they can deliver, not high hopes after this trailer",
        "I like that trallier",
        "Searching was great, got high hopes for this one!",
        "Heard about this on the ride. \n\nLooks really suspenseful.",
        "Thanks for the spoilers",
        "Jesus first a dad searching for his daughter now it’s in reverse daughter looking for mom now",
        "Will definitely be tuning into this movie when it comes out. Searching was such an underrated movie and a great one too! January can't get here faster ",
        "the team making these must be really talented to recreate all those computer graphics so perfectly",
        "That Mike Cambron guy at 2:10 has the face of a movie star, what a cutie patootie",
        "OMG!! CAN'T WAIT!!! ",
        "I am so hyped to see the first movie's main character is in that movie! The first one was pretty good and it is still one of my favorite.",
        "I feel like I just seen the whole movie from the trailer ",
        "Surprised this trailer is not at 1k likes",
        "Nahhhhh\nIm going to watch this yes or yes",
        "Sorry this looks bad",
        "Not really missing if you have a phone that fucking tracks you.",
        "This is not a movie, this is a documentary",
        "We already saw this movie but ol",
        "Searching it’s a masterpiece so I can’t wait for this one",
        "Searching 2022",
        "Oh shit is this the part 2 of searching",
        "The curious thing is... Colombia, actually, is one of the countries with the most missing people in the world.\nSo, this film is gonna be interesting.",
        "It is so entertaining just watching the chaos that occurs when they play with each other.",
        "Searching was one of my favourite movies of all-time. Excited for this one!",
        "nice, I love trailers that tell the entire plot so that I don't have to go watch it\nThanks",
        "If I see anyone who was on Euphoria in any movie I am clicking.\nBecause I can.",
        "Finally!! Some good black representation ️",
        "She is great actress",
        "I was really excited, I regret watching the full tralier Why do they always do that",
        "It gives me unfriended vibes to be honest",
        "Pope Duretti?",
        "The police really don't be doing shit most of the time",
        "Amazing",
        "Ooooo",
        "Fun fact: the protagonist and antagonist played a mentor-mentee role in the British tv show Industry",
        "Glad the actress from Euphoria getting more roles!",
        "0:08, 2:08 is the alien subplot is still going in? I'm totally in.",
        "What’s going with the likes?",
        "Absolutely loved Searching. Can't wait for this!",
        "Whoever voiced that Grandma boss needs a raise, the voice acting is spot on. I felt every emotion =:-*",
        "I already see the twist. Mom was legit involved in the shady shit. Calling it now. Trailer kinda spoiled it.",
        "damnnn daniel henney ages like foine wine",
        "we need a trilogy with the last one titled \"Founding\"",
        "Searching was great. This looks so interesting.",
        "There is one such film from India (Malayalam) know as c u soon.... completely short on iphone....",
        "Wait what happens if you text the number at the end of the trailer??? I wanna do it but idk lol",
        "bro not one person in existence has ever said youre better than faker .",
        "I really respect Mick for standing up for himself and his work. MVP. GOAT. What a guy",
        "This looks like it will drive me insane",
        "15:45  Have a nice day my friend \n\n**00:01 intro **",
        "How does this have 3 million views",
        "so the dad from the first one is the killer in this?",
        "This is scary from both side of the coin, when is information to much and when is it not enough.",
        "i will see he moive",
        "This looks really bad, with poor acting.",
        "Definetly reminds me of Unfriended",
        "damn it comes out on my birthday thats lit",
        "unfriended: taken ed looks like shit lol",
        "aah gak sabar keknya seru juga. searching aja udh seru bgt gue ampe rewatch pas on going. semoga ini sesuai ekspektasi ",
        "I hope it ended with happy ending like the 1st one..",
        "Storm Reid is a great actress. Can’t wait to see her in this.",
        "This looks so good",
        "Um, cool...I guess",
        "\"this is actually a legit theory\" - me",
        "Meowscarada is my choice still despite the bad match-ups with types. I really do love the design as it reminds me of a mix between a cat, Dark Magician, and Tuxedo Mask.",
        "this looks good. cant wait to watch",
        "Searching ",
        "I was just about to mention the movie SEARCH which u will add is one of my favorite movies to date and now this by the trailer alone and stars I am all for it",
        "Rewatching this stuff not in remembrance but to see if I can still enjoy his content without feeling down that hes gone. I can safely say his videos will forever be a joyful watch for me, even with the knowledge of his passing.\nBloody legendary skills to make people laugh. Legends never die",
        " TY",
        "The first one was great, can't wait to see this one!",
        "A fucking joke is what this movie gonna be ",
        "Nice, I know 80% of this movie from the trailer alone!",
        "this looks so good \ncant wait",
        "Looks interesting but did they have to sell out the twist?",
        "Lol I came here to say it’s a copy of Searching. Turns out it’s made by the same people  I like this concept. I’ll definitely watch this movie ",
        "This reminds of Unfriended to be honest.",
        "holy this is one of the ads i actually watched. now im excited",
        "DAMN THIS LOOKS LIKE SHIT ",
        "remake ?",
        "So basically “Taken” except without Liam Neeson ",
        "There a clue in this trailer she says keep your location on at all time",
        "January 20th???? Too Long!  Wow! I will see it from \"Red Box\" a month after release....",
        "It's nice that Hbomb is experimenting with short-form video. Good for him.",
        "I can't wait to see this, it looks so good. I loved the first one!!",
        "I can’t wait to watch this movie after enjoying Searching!!!!",
        "YES. ALL I NEEDED TO READ WAS THAT ITS THE SAME CREATORS AS SEARCHING. Haven't even watched the trailer and I know it'll be amazing.",
        "I can’t wait but wish the trailer was a teaser and not the whole thing ima just leave my comment and dip",
        "I like the idea that this time a daughter has to save her mother, usually in all kidnapping or disappearance movies the father or mother must rescue their children, but I am interested that this time it is the other way around. <3",
        "Will there be an alien subplot in this one too??",
        "Thank you for this movie! It is SO REAL! People need to know how to thwart the “real life” bad guys under their noses!",
        "CAN'T WAIT",
        "Well, and I thought the director couldn't do it again",
        "cant wait",
        "Ouuu can’t wait",
        "RATED PG-13 \nfor some strong violence, language, teen drinking and thematic material.",
        "The first one made me cry",
        "Bet I don’t need to watch the movie because I just did",
        "Jimmy is a real life saver when it comes to Wednesdays",
        "Look it’s angrabora",
        "lol trailer's a bit revealing huh?",
        "I just wanna know when this is actually coming out! ",
        "I'm ready to watch",
        "She had it coming. Who the heck goes on vacation with Juntao",
        "Excited for this movie! Please don't make Jun Tao do it.",
        "Storm Reid is so talented and underrated in Hollywood.",
        "It’s scary asf bc this is an everyday thing but with a twist!!!",
        "Searching and now this, it's destined to be a banger!",
        "Searching was AMAZING. I can't wait for this sequel. Im glad its a whole different story.",
        "I don’t trust the friend",
        "Searching the next chapter",
        "I am a fan of Searching_   I hope this is as good as the former.",
        "So... It's like 2016 \"Searching\" but with the roles upsidedown, right?",
        "Can someone please tell me how is this movie connected to Aneesh Chaganty’s previous works Searching and Run? I saw on Wikipedia that both of these films are connected to the upcoming Missing. Thank you.",
        "Supppper spooooky  🫣",
        "Thanks for giving away the whole damn movie in a 2 1/2 minute trailer",
        "omg her mom was in colombia yes!",
        "i liked the 1st very much, hope this is as good ",
        "Euphoria girl homes missing lol ",
        "Searching was the kind of movie where I was bored out of mind before watching it but later coming out like I just watched the best movie ever made.",
        "Storm Reid ",
        "The fact that people originally believed a CEOs attempt to shift blame to an individual well loved composer is insane to me.",
        "y’all js like showed us the whole film",
        "This movie looks so unbelievably fucking bad",
        "Saskaraib Karo Bhai chenal you have to go to sleep",
        "What would make this movie so good is that if a searching easter egg shows up in this movie to connect the to movies together as if it was in the same universe like she can have a Facebook friend of Margot from searching or when she is having trouble finding her parents she could find an article of David Kim finding Margot Kim",
        "LOOKS INTERESTING",
        "I hate screen movies  they're clever at first but now I just hate",
        "so excited to see Storm Reid in this, she's been killing it on Euphoria! also what a perfect way to do a sequel to such a one-of-a-kind film. the first one had so many twists & turns I did not see coming and it looks like this one will too. but the emotional core (a parent searching for their child/a child searching for their parent because the law let them down) is still there, just reversed.",
        "Let me predict Ken Leung's character will be found not guilty",
        "This trailer was chilling...",
        "Why this remind unfriended",
        "YOOOOOO!!!! I'm super late, but this trailer just gave me Goosebumps  Omg,  I would literally lose my mind if I was in this situation. HOLY SMOKES",
        "9.1M views and just 6k likes?",
        "This trailer looks very good. Excited.",
        "Most of the movie is in the trailer lmao",
        "Searching was a wonderful film.  I'm pretty skeptical that this will be on its level for a few reasons, but I'm excited to give it a chance anyway.  Even if it's not as good it should be a fun watch.",
        "Yo they making a movie about my dad let's go",
        "Whoever casted them as mother and daughter is a genius",
        "I’ll pass. Or maybe after a couple years I’ll see it.",
        "It's like Unfriended, only different.",
        "trailer gave away almost the whole movie",
        "A friend in college said she went to one of his shows in Toronto, she liked some songs he played, but the crowd had to sing literally entire songs for him. She described it as \"I forgot the entire show right after I saw the show\". Definitly one of the performers of all time. :P O:-)",
        "Nice video",
        "Ugh, I want to see this in the theater so bad but i'm picking my mom up from the airport that day!",
        "These videos leave a smile on my face when thinking of Technoblade, because no matter how much he will be missed his legacy will never be forgotten. Rest in peace technoblade",
        "The song is “Booty” by Saucy Santana.",
        "Great Casting!",
        "Nah this is def gonna be",
        "Why can’t it be an actual movie and not from the camera of the phone",
        "Who is actually texting this number? What happened if you do?",
        "W movie like searching",
        "*MISSING*\nTick. Tock. Tick. Tock.\n\nTime's Up 1/20/23",
        "So is the mom evil or the bf?? Idk! Halp",
        "Searching was excellent.\nI'm very skeptical about this one though since Aneesh isn't returning to direct and he's one of FOUR writers credited for this. And then there's the January release date. Usually not great signs.",
        "Searching = Asian version\nMissing = Black version",
        "If you enjoy this kind of content CONSIDER Subscribing! <3",
        "daniel henney",
        "AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH\n:)  deal twan",
        "I feel like the trailer gave too much away",
        "is she from god of war",
        "This looks so good!",
        "So this trailer is basically the whole movie but shorter.",
        "What is with Hollywood and unnecessary cash grabbing sequels with “diverse” female lead/cast?!",
        "Rip off from searching",
        "WOW. This looks good!",
        "I knew something was up with this guy after he tried to kill soo yong",
        "ok, why did they reveal that the mom had major secrets? that would have been a neat twist. now it's spoiled. i bet that's her mom in the doorway to their home.",
        "there was a story about an asian american kid and his dad was looking for him what was the name?",
        "Intresting... finally showing what's been going on. Nothing new under the sun.",
        "WOW LIKE FILM, MEGAN IS MISSING",
        "That trailer is maybe one of the best ones i have ever seen in my whole life",
        "So this is just like Searching, but the exact same",
        "I wish the trailer didn’t show the whole movie",
        "Huhhh",
        "they just spoiled the entire bloody story!!!! ffs",
        "it seems like this movie takes place this June and the movie's events really started on June 10th, and it's awesome seeing the movie take place in the current year.",
        "Holy shit this Is sick!!",
        "Searching is one of the best and most underrated movies I’ve seen in quite a long time. It still gets me every time I watch it. The way they did that movie was genius and this looks just as good!",
        "This movie reminds me of “Searching” I have been looking forward to seeing more movies of such kind!",
        "Just once again projecting human trafficing an other things they have been gett8ing away with for 40 years",
        "Nice vedio",
        "I really loved searching so I’m looking forward to this",
        "WAS THAT DANIEL HENNEY????",
        "This is the girl from god of war ragnarok. Guess she decided her own destiny.",
        "All you had to do was say from the people who made searching and I was down, instead you gave away the whole movie in one trailer, I'll definitely wait to watch this on Amazon or Netflix when it comes out",
        "Hyped",
        "Sold",
        "I might be seeing this",
        "Now this seems like innovative film making...makes me want to watch it",
        "Searching is one of the best and most underrated movies Ive seen in quite a long time. It still gets me every time I watch it. The way they did that movie was genius and this looks just as good!",
        "It’s gonna be hard to get the cinematic details like the first to a T, but I’ll watch this. ",
        "Storm Reid is about to go God of War Ragnarok on them! ",
        "Searching the extended version was great, and this actress was awesome in Don't Let Go. I might have to watch this when it drops.",
        "This looks pretty good. Love Nia Long ",
        "This doesnt seem horror like the first movie?",
        "they've already made a movie like this",
        "I can’t wait for it so excited",
        "From the minds behind searching",
        "don't need to see this one, they just spoiled it all here.",
        "The production budget for this movie also seems to be Missing..",
        "This reminds me of Searching. I loved that movie",
        "This reminds me a lot about Taken. But it's the Mom that's in trouble instead of the daughter.",
        "Yes! Finally there's a hot man!",
        "Jia tries to get some help for family, because they are fighting all the time",
        "whoooo I'm so happy",
        "One of the best trailers I have watched, but i could be little bit more mysterious dont give every info dudeee",
        "This trailer literally gave us the whole movie?!?",
        "They always give too much info in trailers looks good tho",
        "From searching ️️️️ which broke me.... To this I can't wait...",
        "This reminds me of searching",
        "The first one was amazing",
        "I wonder what happened to the alien invasion that was happening in the background of the first film?",
        "I love it already great plot great cast",
        "What happens if u text the phone number there?",
        "SEARCHING WAS FUCKIN AMAZING, THIS IS GOING TIO BE TO",
        "in colombia most people will encounter some sketchy shit for sure",
        "I already know 90% of the plot",
        "The scary thing is this been happening in real life people be going missing on these vacations.",
        "It could show a little less...",
        "The plot seems to be not bad, but it’s a bad idea to take the main role of blacks. They don’t know how to act at all",
        "Since when is the child searching in fear for the parent?",
        "Can u guys plz stop using this as an ad. It’s killing me. Thx. Bye",
        "I live Storm Reid so I’ll definitely be supporting this and it looks great ",
        "At first I thought this movie was cancelled but now I'm so freaking EXCITED I been waiting for this",
        "Wait. Text that number to join what search??",
        "The first one was downright amazing with the way it showed it story. Searching was a cinematic success and I really hope this movie catches the same heavy weight the first one did.",
        "I really wanna watch this",
        "This film teaser already doing plot twist",
        "Interesante ! Gracias Sony !!!",
        "“Searching” ",
        "first part is ok",
        "Does anyone know more movies like thee that take place in a laptop screen?",
        "I watch searching and it was really good and thrilling and I can't wait to see part 2",
        "Looks awesome!!!",
        "Lol that lawyer should play Martin Lin from Spiderman!",
        "Ok I need This RN",
        "Searching was awesome! This looks good too",
        "I loved searching and these type of movies that are made with webcams and something scary happens like unfriended and searching.",
        "Plot of the movie home",
        "even tho its kinda like searching im hooked, it looks promising",
        "Gotta be the worst movie on the way no cap ",
        "so the trailer is telling everything?!",
        "I really loved the searching and that will be great too I am sure of it!!!!! I cant wait to see it",
        "This movie been so good!",
        "Looks like a good plot but I must say the trailer looked kinda cringe. Hopefully it's just the trailer tho",
        "ok guess what the ending = she's going to die enjoy movie :)",
        "Reminds me of hostel",
        "The first one was really good can’t wait for this one",
        "Looks Like A spike Jonze movie her.",
        "Ok that looks amazing. Now one of my most anticipated movies",
        "Still gonna be great unlike the obnoxious teens from Unfriended."
    ],
    "comments_disabled": false
}