{"video_id": "slXmb6_tD_8", "comments": ["Estoy seguro de que hay muchos argentinos en ese estadio pero la inmensa mayoria seguramente son de otros paises y llenan el estadio solamente para ver a Messi, que pedazo de idolo el 10.", "Cómo me gusta esta Argentina que juega mucho mejor ya nos hacía falta ver a la albiceleste jugar así. Desde Perú 🇵🇪 apoyando siempre a la Argentina. Saludos y éxitos en el mundial amigos. Se les estima bastante.", "vamos por ese mundial hermanos argentinos. saludo de un peruano que visito su pais y quedo mas que enamorado de la comida los artes el tango y el futbol.", "Messi tranquilamente podia hacer gol, pero decidio pasarsela a julian para darle la oportunidad  amo lo humilde que es.", "Vamos Argentina! Este mundial es de ustedes ! Saludos desde Perú.", "Gracias a todos nuestros hermanos latinoamericanos y de todas partes del mundo!! Sentimos su apoyo !! Gracias!! Aguante Argentina Papá !!! 🇦🇷🇦🇷🇦🇷🇦🇷 Vamos Leoooo!!! 🇦🇷🇦🇷🇦🇷", "Acá el botón de los que no somos Argentinos pero queremos ver a Messi levantar la copa loco, lloro de emoción solo de imaginar.", "Soy noruego, y desafortunadamente no llegamos al mundial normalmente. He sido del Barca toda mi vida, y Messi es mi ídolo. Mi papá tenía Maradona como su ídolo futbolístico. Por eso siempre he seguido argentina en los mundiales. En 2014 estaba súper triste cuando no pudieron ganar a Alemania. ", "Gracias a todos por el apoyo va ser muy dificil el mundial pero toda la suerte mi argentina", "La sincronización y el Orden son tan perfectos que da gusto verlos jugar como un gran Equipo Vamos Argentina! desde Venezuela!", "Tremendo partido en conjunto de todos\nEsta es la Argentina que queremos veeeer carajo🇦🇷", "Todo el apoyo del pueblo peruano para nuestros hermanos de Argentina.", "Me ilusiona ver a esta Argentina, tan organizados, jóvenes los cuales claramente tienen hambre de logros, Messi y Di María exponiendo toda su clase y experiencia. Gran equipo, muy buen entrenador y hermoso país. Todos los mejores deseos desde Perú.", "No soy argentino y mi  esta muy cabron pa'k gane la copa, admiro muchisimo a Messi y deseo la Argentina kede campeon por Messi, se lo merece \nSaludos hnos Argentinos", "Que grande seleção a Argentina, espero que tenham uma excelente participação na Copa do Mundo, saudações do Brasil 🇧🇷x🇦🇷", "Soy de Barranquilla, Colombia. Deseo de TODO corazón ️ que ARGENTINA alce la copa de CAMPEÓN!\nArriba muchachos!", "Que equipazo el argentino, serio candidato a ganar el mundial de Qatar, abrazos desde colombia", "Argentina tiene que traernos la copa a Sudamérica, todos somos Argentina ️", "Que Humilde Scaloni Sacando al Fideo Di María para q el partido no termine 10 a 0 🇦🇷", "Casi 4 millones de vistas, en 24 horas...Lo que genera Leo Messi, lo que genera la selección Argentina ️", "Sou brasileiro e tenho um amor pela Argentina.. tenho muito respeito por essa seleção . Amo a rivalidade entre Brasil e Argentina, acho que engrandece as 2 seleções . VCS tem todo meu respeito.", "Esto demuestra la gran calidad de jugadores que es la selección de Argentina un favorito para ganar el mundial saludos desde México ", "Vivimos esta ilusión de verte Campeón del mundo Leonel. Desde Venezuela te deseo éste mundial. Te lo mereces", "Soy de Paraguay pero me gusta el juego argentino..siempre argentina estuvo buenos jugadores  y estuvo en un buen nivel..mesi es un grande   saludos desde Paraguay a los hermanos argentinos ", "Que humilde tycsports, dándonos el honor de transmitir el entrenamiento de la selección argentina 🇦🇷🇦🇷🇦🇷", "MUCHA SUERTE A ARGENTINA 🇦🇷 Y BRASIL 🇧🇷 TRAIGAN LA COPA A SUDAMÉRICA PARCEROS.. SALUDOS DESDE TUMACO 🇨🇴", "Esta selección nos hará pedazos 🇲🇽 Ni modo, es lo que hay. Mucho éxito a nuestros hermanos argentinos, espero sea un gran partido, aunque ya todos sabemos las pocas chances que tenemos. Aún así, espero le vaya bien a México! ", "Argentina 🇦🇷  mi seleccion favorita pierda o gane, saludos desde Puerto Rico 🇵🇷.", "Desde el primer gol ya dije: terrible lo que va a pasar con EAU. \nSaludos desde Perú 🇵🇪, vamos Argentina los apoyamos.", "Desde Venezuela, nunca he podido disfrutar un mundial en dónde estuvo mi país pero argentina siempre en mi corazón, la alegria de la afa selección son las  mismas que siento yo...VAMOS ARGENTINA QUE ESTA COPA SE LLEVA A CASA!!️", "Di María es el alma de Argentina sin duda, verlo como juega como arma al equipo es un deleite.", "Como é bom voltar a ver a Argentina chegando bem preparada para a copa do mundo. Futebol precisava disso.", "El primer gol fue un acto de humildad pura", "Este equipo me llena de orgullo, vamos a ganar la copa del mundo, soy colombiano mi selección no pudo clasificar, pero creo mucho en esta argentina actualmente ", "Tengo familia en La Plata y sé que dejarán la piel en la cancha, aguante Argentina, tus hermanos peruanos a muerte. ", "Que bien jugo Argentina, aparentemente lo jugo en Buenos Aires, ante su publico. Los veia celebrar, cantar, gritar, bueno lleno de emociones.", "Como brasileiro torço pelo Brasil mas meu segundo time é a Argentina que também é favorita. Temos que trazer a copa do mundo de volta para a América do Sul! Vamooooo", "Soy hondureño🇭🇳 pero aqui todos vamos con argentina🇦🇷", "3.4 millones de visitas en 17 horas que ilusionados estamos los argentinos no nos decepciones argentina confiamos en ti", "Vamos selección con humildad siempre 🇦🇷️", "Denle ya la copa a estos genios...!!\nSoy  MX pero la neta me gustaría ver coronado a Messi en esta copa y a DI MARIA( pedazo de  Dios)....\n\n️", "Love from India 🇮🇳\nVamos Argentina 🇦🇷", "desde México, toda la buena vibra para la Argentina, deseo de todo corazón que regresen a casa con esa copa, Messi es el amo de este deporte y si alguien merece ganar el mundial es el. Venga!! Aguante Scaloneta !!!", "Argentina tiene todos los números para llevarse el campeonato, como Español espero que no se enfrenten pronto y que lleguen muy lejos. Un saludo a nuestros hermanos", "Que emoción ver a esos inchas árabes argentinos, sin duda tienen un corazón latino ️", "Mis buenos deseos para Argentina. Veo un buen grupo. Mis mejores deseos parceros. bendiciones desde Colombia.", "En paz descanse la selección mexicana", "Es impresionante lo que logran estos muchachos. Son un equipazo y siempre lo fueron. Hasta otros países alientan por Argentina, essss impresionante lo que trasmite mí selección Los AMAMOS. Pase lo que pase, son y serán ETERNOS CAMPEONES TE AMO SELECCIÓN. ME DESBORDA EL ORGULLO DE SER ARGENTINA .", "Descansa en paz México.", "VAMOS ARGENTINA!!! Gran partido hicimos.", "Seguramente nos van a dar una paliza tremenda el próximo sábado. Suerte, hermanos argentinos, y que se traigan la copa a casa! Saludos desde México! 🇲🇽🇦🇷", "Pase lo que pase con Argentina en el Mundial tengo que decir que estoy muy orgulloso de todo lo que están logrando estos hombres ", "Como mexicano nunca en mi vida pense decirlo, pero creo que en este mundial, Argentina golea a México, y estare apoyando a Argentina en cada partido hasta la final. Tienen un equipazo!", "Saludos desde Ciudad del Carmen Carmen Campeche , México \nMis mejores deseos para este Trabuco de Selección que es la Argentina, comandada por el mejor futbolista del mundo y de la Historia, Messi!\nAguante Argentina, tienen que traer esa copa al continente Americano", "Cómo argentina no hay dos.. \nSoy mexicano pero debo aceptar ese porte, esa forma de hablar, ese exquisito y particular forma de ser.. \nSon grandes, simplemente organizados y geniales jugando fútbol.. su orgullo tan bonito que tienen!.", "soy africano pero esta seleccion tiene todo para ser campeon del mundo", "Que humildad y sencillez de Messi, tenía para hacer el gol y prefirió regalarlo. Grande!", "Loco.. me va a hacer llorar la gente con los comentarios. Yo pensaba que nos odiaban.. gracias por tanto apoyo nos están dando una lección de humildad que el argentino siempre necesita recordar", "Vamos argentina desde peru alentando a esta gran seleccion latinoamericana me encanta este equipo , latinos unidos vamos messi ...", "No sé ustedes, pero desde que terminó las eliminatorias, sentí y siento que Argentina será campeón del mundo.\nHinchando desde Perú!", "Di María, el eterno infravalorado argentino. Pedazo de crack.", "Soy Peruano pero mi familia paterna es Argentina, le banco a esta selección con todo corazón , se están ganando respeto de muchos, Messi se merece ganar un Mundial, vamos Sudamérica, vamos Argentina carajo!!!!", "Cada vez juega mejor la selección!!! Gloria a Dios ", "Messi siempre humilde dejando anotar a sus compañeros, es un grande. Que bueno que ahora no llevaron a alguien que diga que es difícil jugar con el.", "Soy Méxicano pero para mí México y Argentina las tengo en mi corazón por igual, ojalá que argentina gane el mundial por qué Messi se merece eso más que nadie en la historia por qué en un fútbol ya a su tope y muy difícil Messi lo ha superado en todas la ligas más fuertes del mundo y se merece ese trofeo del mundial", "Força Argentina 🇦🇷️", "Cómo 🇵🇪 seré hincha más que nunca de Argentina, con un equipo de cracks. Tengo familia en La Plata y sé que dejarán la piel en la cancha, aguante Argentina, tus hermanos peruanos a muerte. ", "Vamos Argentina...mucho cariño para nuestros hemanos y hermanas ....saludos desde Peru 🇵🇪🇦🇷", "Excelente equipo , les deseo exito en Qatar y que vuelvan con la copa. soy chileno pero tambien sudamericano.", "Me ilusiona argentina y me encanta la humildad de Emiratos  para los 2", "La humildad de Messi para dejarle el primero a Julián pudiendo hacerlo con tanta sencillez el. Increíble lo de Messi", "Golazos de Di María. Que jugador más infravalorado! Un crack", "Te amo Leo, sabía que no te iban a lesionar, lo sabía, a vos Dibu, te amo con el alma, y a vos TyC Sports te agradezco por transmitirnos esta pasión", "Lloro de emoción loco vamos carajo Argentina", "Julian Álvarez la va romper ! Que brutal delantero ", "Traigan la copa a Sudamérica. Fuerza Argentina. Saludos desde Ecuador.", "Soy un colombiano 🇨🇴 que anhela ver a Argentina 🇦🇷 CAMPEÓN del mundo en este 2022!!! Se lo merecen y se que lo van a lograr. Éxitos!!!   ", "Felicitaciones a los muchachos ARG  por la goleada y la victoria!!!\nSiempre así muchachos, siempre así \nBendiciones y el mejor de los éxitos en sus próximos partidos,vamos argentina carajo!!!", "Soy Mexicano , Argentina se lleva esta copa seguro , ojalá y no nos humillen tanto , mucha suerte hermanos argentinos ", "Vamos Argentina!!, hincharemos desde Perú ️", "Todas las esperanzas en el equipo \nY mis fichas con Di Maria", "La copa se tiene q quedar de este lado del mundo ", "Soy 🇨🇴 pero se me aguan los ojos de la alegría de ver este EQUIPAZO de CRACKS y gente humilde  🇦🇷🇦🇷🇦🇷 Dios te Bendiga ARGENTINA", "Ojala este mundial sea para argentina  saludos desde Perú!!!", "Desde México y en honor a mi gran amigo argentino: Este Mundial será Argentino.", "equipo, muy buen entrenador y hermoso país. Todos los mejores deseos desde Perú.", "Soy Mexicano y la vdd mis respetos para los hermanos argentinos,juegan un partido como si estuvieran en un llano ..", "Vamos argentina..! desde Perú,messi levantará esa copa y llorare ", "Argentina merece ganar este mundial como ningún otro. Y Messi, sin duda alguna, el mejor de la historia, ojalá pueda sellar con el mundial una carrera de ensueño. Suerte también desde Colombia.", "Vamos Argentina  a ser campion . Peru está contigo 🇵🇪🇦🇷", "Es un espectáculo ver jugar a la selección de Argentina un saludo desde México.\nP.d espero que le den una goliza a México para que vean lo que es un verdadero fútbol", "Soy mexicano y acepto que argentina nos va a ganar sin dificultad pero ante todo apoyando a argentina y mexico vamos hermanos que esa copa es suya🇦🇷🇲🇽", "Agradable ver una verdadera selección con un nivel de lujo! Abrazo fuerte a los hermanos Argentinos desde México", "Los verdaderos fanáticos al futbol queremos ver a Messi campeón del mundo, incluso sobre nuestras propias selecciones, ojalá!", "gracias tyc por pasarnos estos entrenamientos previos al mundial, me suscribo para más", "Soy de Perú 🇵🇪 y alentaré hasta las últimas a argentina 🇦🇷 en este mundial les deseo lo mejor. ", "Tan solo di maria se lleva de calle a toda la selecion mexicana actual ", "Ese Di María es un Marciano, esa golazo merece un cuadro para la sala, saludos de Perú.", "Equipazo Argentina, Dios quiera este año la Copa llegue a Suramérica.. Saludos desde Colombia y muchas bendiciones para nuestros representantes.", "ESA SELECCIÓN NOS VA A TRAER MUCHAS MÁS ALEGRIAS!"]}