{
    "video_id": "slXmb6_tD_8",
    "comments": [
        "todos se quedan con messi pero lo que juega Dimaria es una locura y el trabajo de Rodrigo De Paul también es de destacar",
        "HAHAHHAA that Brok impression at 1:02:25 was so good hahaha.\n\nAlso, for Jack and anyone else who was wondering, the symbol after the omega at 1:07:34 is the Greek letter lambda, and it was put on Spartan shields. B-)",
        "las personas celebraban más los goles de argentina que los de su propio país, jajajajajajajaj",
        "Que golasos de Di María mamita querida...... El primero que habilidad",
        "🇦🇷🇧🇩",
        "Por el amor de dios. Di Maria es un absoluto crack. Incluso me atrevería a decir que infravalorado.",
        "YA LE F****RON A LOS JEQUES",
        "Este mundial yo hincho por Argentina!",
        "Bueno allí se comieron un Congo, es amistoso. Hay que ver si lucen así cuando choquen con los equipos que también tocan y defienden, ya en octavos de final, ni siquiera en la primera fase. Así que este juego no dice nada.",
        "3 doritos después...papá arabia saudita 2-1 hijitas argentinas",
        "Buen entrenamiento.  Pero en mundial a ponerle todas las ganas de traer esa ansiada Copa.",
        "La alegría de esas personas al ver el verdadero fútbol ojalá disfruten mucho más del mundial ️",
        "A friendly in the UAE?",
        "Ahora si están jugando como un equipo se merecen ganar el mundial!\nSaludos desde mexico🇲🇽",
        "Soy Mexicano y la vdd mis respetos para los hermanos argentinos,juegan un partido como si estuvieran en un llano ..",
        "Argentina 1 Arabia 2. En tu cara.",
        "I love your videos. Very entertaining . Hope you make more videos to entertain us.",
        "Saludos desde Chile! Todo el aguante para la Argentina de Messi, aguanteeeeee craaaack!!!!!",
        "Messi is the best!",
        "Juan Foyth should be benched. Remember his bad performance before 2021 Copa America so he wasn’t even called up and you know Argentina played better and won ",
        "مبروك الأرجنتينيين ، مباراة جيدة جدا! تحية من الأرجنتين",
        "Semenjak Qatar ditetapkan jadi host piala dunia banyak tim2 besar yg mau uji coba dg tim2 arab",
        "VAMOS ARGENTINA",
        "I havent watched Your videos in a while glad to know that youre still making these fun and cute vids",
        "Felicitaciones a los muchachos ARG  por la goleada y la victoria!!!\nSiempre así muchachos, siempre así \nBendiciones y el mejor de los éxitos en sus próximos partidos,vamos argentina carajo!!!",
        "Argentina is my favorite team ever in the world, that's why my fav! player is Messi...it's that simple ",
        "El dibu en la seleccion: \n\nEl dibu en el aston vila: ",
        "yahahahahahahahahaha wahyu",
        "Soy de chile y vamos argentina que se puede ",
        "2:34 ese pase es tremendo",
        "Que Masterclass dio Di María en este partido, no esperaba menos del jugador que le dio la Copa América a Argentina",
        "Es como jugar contra bots,\nParece FIFA modo amateur",
        "Que selección tan hermosa la de argentina se merecen la copa del mundo 🇦🇷",
        "Hay algo que no me gusta de este partido, poner a titulares para un partido que no lo necesitaba (de hecho era una buena oportunidad para probar jugadores), jugadores cansados antes del segundo tiempo, una goleada irrelevante que no representa nada pero se festeja como un titulo, parece que scaloni quiere demostrar ahora algo que después no sabe si va a poder en el mundial.",
        "EAU son los padres... O, mejor dicho, unas \"madres\" xD!",
        "Que bonito juega Argentina \n\nSaludos desde México",
        "Increíble el entrenamiento de Arg ",
        "Eso es cuando te metes con uno de sudamérica ",
        "Es duro ser peruano y ver con nostalgia y hasta envidia sana la calidad de Argentina. Lamentablemente en mi país la corrupción afecta hasta al deporte y no se le da las mismas oportunidades a todos, mezclado también con el poco amor propio y sed de alcanzar la gloria del peruano promedio... Escribe un peruano, que no se siente identificado con la mayoría de personas ni costumbres de su país.",
        "Que bueno estuvo el entrenamiento de Argentina! Ya quiero que sea martes 22, le tengo unas ganas al mundial. Vamos Argentina ️",
        "Emiratos dio mas pelea que brasil en el 2014",
        "Espero por messi que gane la copa del mundo vamos Argentina!",
        "Parecía que estaba jugando efootball con el narrador  Grande la Argentina Se merecen la copa éxitos Argentina️",
        "Angelito demostrando que es el mejor futbolista argentino",
        "Soy mexicano de corazón \nYo se mexico le puede ganar ala escaloneta \nAsí como le ganamos Alemania y eso que venía jugando bien y estaba invito pero todo puede pasar así (como el boxeo y el fútbol)",
        "Nunca vi a una argentina tan fuerte como está, la de Bielsa hizo una eliminatoria espectacular pero se fue en fase , y la de Sabela (q.e.p.d) fue lo mejor que ví hasta ahora , sin duda alguna argentina recontra favorito ",
        "Tiembla México, esto si es selección, la de México es decepción.",
        "Lindo partido espero qué sea así con las potencias más fuerte",
        "A quien le ganaron, hasta Venezuela le ganó a este equipo hace un mes 4 x 0",
        "Como mexicana es la primera vez q veo a la selección sin siquiera posibilidad de superar la fase de grupos, espero sea argentina campeona del mundo con el mejor fútbol",
        "locura mix",
        "Vamos 🇦🇷Argentina! Tienes que ser campeón en Quatar 2022, saludos desde México 🇲🇽",
        "Soy Mexicano y en mi humilde opinión;Desde partidos atrás, veo a una Argentina muy fuerte y un gran equipo en conjunto, espero este mundial sea el bueno y queden campeones del mundo.",
        "wtf que golazo de  angelito",
        "Traigan la copa a Sudamérica. Fuerza Argentina. Saludos desde Ecuador.",
        "Julian Álvarez la va romper ! Que brutal delantero ",
        "Si no son golazos no los anota Di María",
        "Argentina debe ser campeón por bien del futbol de messi saludos desde colombia .. Porque llevamos historia con ellos tambien",
        "Que bueno ver qué a Julián cada vez se le da más el gol; vamos Argentina por la tercera 🇦🇷",
        "7:18..... En un momento de las eliminatorias, se complicaron por los errores de Foyth que costó varios puntos. Eso también le costó que lo dejen afuera de la Copa América. Por favor que no lo ponga en la defensa porque es un colador y es ahora o nunca.",
        "Somos los mejores",
        "Que emoción, espero con ansias el partido Méchico vs Argentina.\nPd: soy mexicano.",
        "Casi 4 millones de vistas, en 24 horas...Lo que genera Leo Messi, lo que genera la selección Argentina ️",
        "Los argentinos train un equipazo pero cuando pierden no saben perder",
        "Inglaterra 6 - 2 a Irán....tranquilos",
        "Aguanteee el fideo, para todos sus haters este juego",
        "El fideo está loco carajooooi",
        "Que bonito ahora con  esas letras",
        "Hermanos argentinos tengan compasión de México ",
        "Convengamos que no jugaron con nadie pero toda la suerte para la selección",
        "Que equipazo tiene la Argentina y encima tienen a Messi, Esto deberia ser ilegal! ",
        "me enamoro la voz del estadio",
        "Que buen partido el de di maria",
        "MUCHA SUERTE A ARGENTINA 🇦🇷 Y BRASIL 🇧🇷 TRAIGAN LA COPA A SUDAMÉRICA PARCEROS.. SALUDOS DESDE TUMACO 🇨🇴",
        "Ojalá le metan 6 o 7 a México, soy de México pero la verdad la selección y sus patrocinadores necesitan una calentada de esta magnitud, la verdad se lo merecen.",
        "8:04 fijense como hasta el arbitro queria darle la mano a Messi y se quedo esperando a que fuera xd",
        "VAMOS ARGENTINA CARAJO LOS QUIERO ️️️️️️️",
        "Alberto y Kretina colgados de la copa..por Dios nooooo",
        "ya somos campeones!.",
        "No  quiero desmeritar la actuación del equipo Argentino y verdad es q no se podía esperar otra cosa puesto q ese equipo  Árabe en la cancha no fue otra cosa q un equipo de categoría  infantil B.",
        "El mejor del partido debió ser di María",
        "Descansa en paz México.",
        "gracias tyc por pasarnos estos entrenamientos previos al mundial, me suscribo para más",
        "Ami youtube tomader khache ektu help chai chi tomara amake ektu help korbe ",
        "I was sleeping all morning when this game was playing grasias team ARGENTINA start off excellent 🖒seniores si' seniores ARGENTINA 🇦🇷 🖒",
        "Acuérdense 5 de🇦🇷🇦🇷🇦🇷",
        "Edy Murphy en la portería se trago cinco y no se rió nunca de ese chiste.",
        "Messi!",
        "Esta selección nos hará pedazos 🇲🇽 Ni modo, es lo que hay. Mucho éxito a nuestros hermanos argentinos, espero sea un gran partido, aunque ya todos sabemos las pocas chances que tenemos. Aún así, espero le vaya bien a México! ",
        "6:02 si eso hubiera entrado, hubiera sido el mejor gol del partido",
        "La verguiza que le acomodarán a México realmente me preocupa. ",
        "vamos argentina, peru los apoya",
        "0:26 sean eternos los laureles 0:36\nque supimos conseguir... Que supimos conseguir.... Coronados de gloria... Vivaaaamos... O que juremos con gloria a morir. O juremos con gloria a morir...🇦🇷🇦🇷🇦🇷 Hermoso como siempre nuestro himno",
        "Se que Argentina tiene un cruadrazo pero los de Emiratos no marcaban a nadie jajajajajajaja, los miraban pasar",
        "Como fan de Messi no argentino, me gustaba la estrofa que cantaban antes",
        "Un lujo verlos jugar a Messi y Di María .!️️️️️",
        "Para mi foyth no esta jugando bien por por su culpa hubo varias ocasiones de emiratos imaginate en un partido importante se manda una cagada por suerte es suplente",
        "Ganoooooooooooooooooooooooo Argentinaaaaaaaaaaaaaaa",
        "Seguramente nos van a dar una paliza tremenda el próximo sábado. Suerte, hermanos argentinos, y que se traigan la copa a casa! Saludos desde México! 🇲🇽🇦🇷",
        "Que lindo es verte jugar Argentina! El martes 22 a levantarse bien temprano y hacer una buena picadita para disfrutar el debut contra Arabia ️",
        "Golearon caminando jaja .. me la juego por Argentina, ojalá sea su mundial, pedazo de equipo",
        "Soy chileno pero disfruto ver jugar a argentina vamos Messi que este es el mundial anulo mufa y todas esas weas que dicen ustedes ",
        "Vamos Argentina!!!! Anhelo que ganen el mundial, tienen tremendo equipazo. Saludos desde Perú 🇦🇷🇵🇪",
        "ESA SELECCIÓN NOS VA A TRAER MUCHAS MÁS ALEGRIAS!",
        "2-1 jajja",
        "Aguante Argentina!!! \nAguante Milei!!!!",
        "polonia 1-0 chile\nmexico 1-2 suecia\njajajajaja y se burlaban de argentina pobresitos!!!",
        "lo que hizo Di MarIia es un golazo",
        "APOSTÉ 200 DÓLARES QUE ARGENTINA HACIA 5 GOLES Y GANÉ 900 DÓLARES JAJAJAJAJAA. TE AMO MESSI",
        "Vamoosss messi vamooos Argentina",
        "Argentina no juga mal pero de ahí a ganar el  mundial creo le falta. Para mí puede llegar a Semis pero están Brasil Alemania Francia..",
        "Why are they nit too exited about the goals",
        "Di María y Messi son piezas muy importantes. No tienen reemplazo",
        "They could have scored more if they wanted",
        "Bien hecho Vasco por ir atrás y no levantar las piernas, toma un par de camisetas firmadas y todos los petrodólares que quieras",
        "emiratus equipo de barrio.",
        "Pensé que lo vieron 100 personas el partida jajajaj",
        "A ver yo como mexicano soy muy muy orgulloso de mi pais pero aceptó que somos lo que le sigue de malo en el fútbol, con que  Latinoamérica gane el mundial me conformo sea Argentina o Brasil",
        "Messi 🇨🇩️",
        "Di María es un Alien!",
        "Ojala cambien de relator para la copa del mundo",
        "Qué nivel mostrado por la selección están imparables 🇦🇷",
        "Ay México    se  bueno argentina",
        "Volvió el mejor relator",
        "Siempre pense q Dimaria es un jugadoraso y si uviera jugado la final en el 2014 frente a los Alemanes , Argentina se quedaba con la copa, ojala en este mundial no se lesione el Angel del futbol..",
        "Eses equipos se van clasifican fácil y se van al mundial argentina le dió páliza jaja",
        "Los problemas que tiene foyth para defender y atacar como lateral,no parece un jugador de selección 🇦🇷.",
        "Todos bien, atento Escaloni el unico que no rindio futbolisticamente hablando fue Fhoit, flogisimo parando rivales con empujones agarrones.El unico que no estuvo a la altura de las exigencias para integrar la seleccion.",
        "desejo que Brasil ou Argentina possam ser o campeão da copa só pra calar a boca dos europeus.",
        "Me gusto mas el primer gol de di maria y el fanatico pase qe le dio acuña justo a los pies de di maria \" lo q hicieron  es algo imposible de creer \" , quisiera qe lo vuelvan a repetir contra mexico y contra todos , y me gustaria q de paul se anime a tirar goles desde media cancha por si el arqero contrario se confia , y qe messi siga aciendo gol de culito ,ojala se anime a acerlo en la final, asi nadie lo olvida , asi valoran mas la copa mundial y lo recuerdan a messi \" qe despues de esta copa ya no lo volveran a ver mas a messi\"",
        "Argentina le saco la ñex, como decimos en Panama ",
        "engañados el arquero ni se esfuerza",
        "Que es el todopoderoso emiratos, cuidado, con calma... Ya me se esto cuentos.",
        "cuando vi el gol de di maria de primera , ya sabia que iban a perrearle a EAU",
        "Argentina vamos 🇦🇷🇦🇷",
        "Loco no pueden subir algo con mejor calidad? Con razón no los mira nadie",
        "Que diferencia soy mexicano pero la corrupción en el futbol que maneja la selección es una pudrición total espero de corazón que argentina pase por qué  de verdad estos chicos están jugando con todas las ganas de ganar y en México solo están negociando mucha suerte argentina",
        "Tan pronto como jugarán un europeo - (Dinamarca?) - van a caer ….",
        "Para mi ángel di Maria es el alma de Argentina por el están donde están te mereces los balones de oro del pecho frío ojalá gane el mundial y con gol de angelito fan n 1 del angel del gol",
        "Bos is",
        "Messi ovnis",
        "Goooooolazo",
        "Soy peruano  y me subo a la escaloneta,  vamos argentina! \nVamos campeón !",
        "Saludos argentina. Los amo desde chile. Viví en su país hermoso y aprendí de la salud. Gracias por enseñarme humildad. Abrazos desde los angeles bio bio ",
        "Lo único malo es este relator. Le quiere poner más emoción de la q tiene. No es la final del mundo. Demasiado exagerado este tipo. !!!!",
        "Grande Messi, no le importa meter los goles, le interesa ganar. Buen asistente y goleador  ",
        "Vamos Argentina...mucho cariño para nuestros hemanos y hermanas ....saludos desde Peru 🇵🇪🇦🇷",
        "Di María es el mejor de argentina sigue así",
        "Ver esto me quita aún más las esperanzas de que México pase a más hoy perdieron el partido de exhibición, la verdad me dio vergüenza",
        "F por México ",
        "Sigo pensando que Di María no tiene goles, tiene golazos",
        "ni lo vi al partido porque era obvia la goleada y solo es para agrandar a la selección",
        "Xdddddddddd",
        "Proximo destino Arabia Saudita!",
        "Ptm Emiratos árabes...hasta la pepa",
        "Que canción es eso",
        "Privilegiados nosotros los mexicanos al tener como rival a una selección de primer nivel como Argentina y al más Grande a Leo, la verdad México la va a pasar muy mal, olvidense será la vergüenza, Argentina,Partido de MUNDIAL, un México sim nivel como mexicano lo digo, un México con la directiva corrupta uff mano la que nos espera.",
        "Soy mexicano, pero siendo sincero , mi selección no hay que acabe jugadas de primera intención así como el fideo, alguien que arranque pasando medio campo y que te genere peligro, argentinos tengo la sensación de que en este mundial ahora sí la van a hacer en grande",
        "Gracias Dios por hacerme ARGENTINO",
        "Di María será una de las estrellas del mundial y meterá el gol de la final, con jugada armada por Messi",
        "Porque no pudimos empezar asi el mundial? Porque demostrar grandeza en partidos sin importancia para que justo no se nos de al inicio del mundial?\n\nBajamos la guardia",
        "Soy de Paraguay pero me gusta el juego argentino..siempre argentina estuvo buenos jugadores  y estuvo en un buen nivel..mesi es un grande   saludos desde Paraguay a los hermanos argentinos ",
        "SUBANLO EN 1080 NO SEAN RANCIOS ENCIMA QUE ES SU CANAL",
        "Vamos Argentina.  Love from india",
        "Emiratos árabes unidos !!! No traían nada  parece Brazil vs Alemania:/",
        "https://youtu.be/hsxZH8ESNrM YO QUIERO DARTE CASTIGO ",
        "Vamos 🇦🇷🇭🇹",
        "DI MARIA Les hizo falta en la finales perdidas bueno esperemos ahora esten al nivel de ganado todo.",
        "Desde cuándo cuentan el tiempo como 45 parte 1 y otros 45 parte 2 y no los 90?",
        "Una berga pense que este era del mundial jajjajaa",
        "Bamos a ver si cuando enfrenten a paises que son potencia es igual aqui agarraron pollito estan igual que Mexico nomas golean a equipos malos",
        "Qué humilde Foyth marcando mal para que el Dibu se luzca y agarre confianza previo al mundial",
        "Hermano se puede cambiar a Foyth? No hay alguna resolución que nos permita devolver el jugador? Qué dolor de huevos da... No aprendimos nada de la copa América 2019, por algo no jugó más, y ahora vuelve a aparecer para no dejar dudas de que no tiene conexión con la idea ni las ganas de todo el equipo. Increíble la preocupación que genera ese muchacho. Lento, torpe, ingenuo, tibio, resongón. Un Francia o España no nos va a perdonar los horrores a los que quedó expuesto este pibe. El resto todo ok en mi opinión. Scaloni por favor no lo pongas más ",
        "Gente soy uruguayo \nPa mi argentina esta en la final \nAhi los quiero ver pero les tengo fe\nNosotros estamos pa otra creo.  Quizas entre los 8....",
        "Vamossss argentinaaaaaa",
        "Algo asi no espera a los mexicanos vs Argentina",
        "Seamos sinceros en ese estadio querían v3 a Messi había árabes gritando goles agitando la bandera de los emiratos festejando el gol",
        "There is just something so right & pure about this on screen couple. Their chemistry is dik.Si/romanzo & I love how we watch them grow throughout both films;  it’s so authentic & nothing is rushed. Loved both the films; don’t make me choose a favourite because I cannot!",
        "Saludos desde 🇦🇷",
        "Ami youtube tomader khache ektu  help chai chi tomara amake ektu help korbe ",
        "🇦🇷🇦🇷🇦🇷🇦🇷🇦🇷🇦🇷🇦🇷🇦🇷🇦🇷🇦🇷🇦🇷🇦🇷",
        "Di maria se la saco con ese gol de bolea",
        "DESTRUCTION ",
        "Bien por Argentina ",
        "Para mi, como colombiano exijo la final soñada latinoamericana BRASIL VS ARGENTINA\nAhí sería el último reto de Messi. Ganarle un mundial al eterno clásico rival sin duda sería algo comparable con lo que hizo el Diego contra los ingleses, ahora sí pierde, tendrá que asumir las consecuencias de la historia.",
        "Angelito es todo lo que esta bien ",
        "Di María es un crack. Qe jugadorazot.",
        "Love from India 🇮🇳\nVamos Argentina 🇦🇷",
        "Jajaja y los reporteros mexicanos se kejan de el técnico de la selección mexicana k porque no llevo otro jugadores y llevo los más malos al mundial para no ganarle a argentina Jajaja...argentina 4 México 1 así kedaran en el mundial.",
        "Que madriza espera a los mexicanos",
        "Foyth no puede jugar mas en argentina,no tiene nivek,malisimo,cada partido una cag....",
        "esto si es futbol",
        "Selección que lindo partido, y vamos con toda en nuestros partidos de la copa 🇦🇷.",
        "´´proceden a bombardear 5 veces a argentina´´",
        "🇦🇷🇦🇷🇦🇷🇦🇷🇦🇷🇦🇷10  11",
        "ميسي اللاعب الاعظم في العالم",
        "Grande fideo!",
        "Este Messi se ve con más confianza. Mi México 🇲🇽 se le viene una goleada. No tenemos defensas de gerarquia",
        "pinoy pride",
        "Puedo apostar mi vida y la de mi madre, que para el primero gol en la posición de Messi, cualquier otro jugador hubiese optado por tirar al arco y no dar el paso. Que grande Messi.",
        "Los árabes parecen mas contentos que los argentinos jaja.",
        "Siento que Argentina se lleva la copa. Tremenda calidad de siempre, pero por fin se entienden como equipo, y asi son a otro nivel.",
        "Soy uruguayo pero da gusto ver jugar argentina me paro y aplaudo este equipazo¡¡¡¡",
        "mejor ponen unos conos que defensa era para un 10 con esto no le alcanza a argentina para competir con francia, alemnania  o belgica, esos errores se vuelven a cometer",
        "GRANDE POBRERTINNA GOLEANDO A SELECCIONES QUE NI EXISTEN",
        "Apoyo a Messi por encima de Neymar y cr7 así que ojalá gane argentina el mundial",
        "Joaquín Correa de suerte hizo ese gol o mejor dicho de rebote en un jugador de Emiratos árabes mamitaaa ese Joaquín Correa era el otro correa scaloni",
        "Que humildad de Messi al primer gol con esa asistencia",
        "Di María es un super crack, de haber jugado la final contra Alemania...",
        "Esta seleccion pinta muy bien para ser campeona",
        "Horrible Foyth ..le ganó la espalda un tal Abdulah Ramadan..yo no me olvidó la cagadas que se mando en las eliminatorias..las mismas que lo dejaron afuera de la copa América, angelito correa llorando y lo Celso lesionado viendo como se llevó a este salame, Tagliafico recupérate pronto hermano",
        "Que pena da ver a los aficionados falsos en la grada...Pero la fifa se lo ha buscado solita.",
        "y pensar que en el gol de julian messi pudo no haber pasado la pelota y  haberlo echo el, pero no prefirio darsela a julian para que el haga el gol. por eso es el mejor del mundo",
        "Que Golazo de Messiiii ",
        "7:24 posta que mala leche que tienen los árabes que ni esa con el brazuca pudieron hacer y mínimo para que no parezca tanto un entrenamiento, se merecían",
        "La figura del partido fue Di María. Siempre tuve fe en él y eso que no soy argentino.\n\n\nTampoco Mexicano, xd.",
        "La figura fue di María pero igual lo votan a Messi,son más hinchas de Messi q de la selección",
        "Hoy soñe que perdiamos contra Chile 6 a 3 en un partido amistoso antes ddl mundial",
        "siisisi todo muy lindo... bien perfumador se rascan los huevos en el hotel comen kiwi.. vamos a ver cuando se enfrenten a brasil... alemania.. etc. aver si juegan o van a poner escusas como siempre",
        "Desde Panamá argentina campeón 2022",
        "Me ilusiona ver a esta Argentina, tan organizados, jóvenes los cuales claramente tienen hambre de logros, Messi y Di María exponiendo toda su clase y experiencia. Gran equipo, muy buen entrenador y hermoso país. Todos los mejores deseos desde Perú.",
        "pobre de mi pais cuando nos toque jugar contra ellos",
        "7:36 suerte del futuro campeón del mundo 🇦🇷🇦🇷",
        "Cuanta ilusión muchachos, lpm!!!",
        "Soy colombiano y estoy con argentina, ojalá ganen el mundial, sería una maravilla",
        "Vamos Argentina, tienes que ser nuevamente Campeón del Mundo, saludos de Peru.",
        "Amo ese país. Argentina is great!\nGreetings from Florencio Varela.",
        "Que les toque a los Argentinos selecciones como Francia, Alemania, Brasil, ahi recién se podrá ver si  está para grandes cosas.",
        "Ahora se entiende cuando Guardiola dijo q lo grande de Messi es q siempre pasa la bola…",
        "Angelito di Maria ",
        "Vengo de ver el resumen del partido de España y no veas el comentarista.. Este si que da gusto.. El comentarista de España parece que este en un entierro",
        "nah amigo el segundo gol fue una locura",
        "argentina siempre es favorita, sin importar si esta jugando bien o mal",
        " \nWhatta game against bots ",
        "y soy fans de messi es mi idolo",
        "Brasil y Argentina deben tumbar a equipasos como Francia, España, Inglaterra, Alemania, Holanda, Belgica y Portugal ufff que mundial que tenemos por dios!!!",
        "36 partidos invicta esperemos qué sigan invictos cuando enfrenten a España, Holanda, Francia, Inglaterra,etc,etc..... ojalá",
        "Legend has it that the referee is still calling messi after the final whistle ",
        "Espero q pongan en mute la vos del estadio en la transmición...",
        "Este es el quipo que scaloni tuvo que poner al principio de argentina vs arabia",
        "Jajaja y porque no juega con francia o alemania ",
        "شقوا منتخب اليوله ",
        "Es bueno que no vayan confiados que hasta los que están debajo del nivel juegan como si fuera Brasil",
        "Swear Di Maria dosent age...",
        "Pe pe pe perooo Di maria que golazo hermano, saludes desde Honduras, vamos argentiiiinaaaaa mi locoooo tienen mas 8 millones de aficionados de honduras a la argentina ",
        "Es un golazo de di María si lo hubiera metido Messi tenemos gol para rato",
        "Foyth ya quedó afuera",
        "Soy mexicano y deseo que argentina de la mano de messi se lleven el mundial",
        "Vamos",
        "Di Maria + volea = ",
        "Es hora ARGENTINA debes ser campeón",
        "Los arabes emocionados por los goles de argentina jaja,",
        "ENVEJECIO MAL ESTO XDD",
        "Soy de Perú pero ver a la seleccion argentina lo difruto como mi selección lamentablemente nuestra selección no mereces la mejor hinchada pero aqui apoyando con todo.",
        "Pobre México 🇲🇽",
        "I hope Brazil will revenged and win the World Cup..",
        "Que humildad la de los árabes ! Presentarse solo para el entrenamiento de Argentina \n🇦🇷",
        "SIENDO CHILENO me importa una mierda lo que opinen los chaqueteros , pero yo voy a alentar  por Sudamérica  y este equipo que tiene argentina creo seriamente que tiene muchas posibilidades de  campeonar...   sere uno de los que les va a alentar.",
        "Esto es algo sorprendente pero cierto si entre Messi y Di María estos Dos se Activan es de otro planeta Argentina....",
        "#Banalersomoy",
        "Hay que ser sinceros, ese arquero era una coladera",
        "Foyth: me invitó un amigo",
        "Me compré un 8K de 65\" para ver esas lágrimas argentinas full detalle. Es cosa de tiempo... Iré a burlarme al respectivo video el día de su eliminación.",
        "Das 2:0 von Di Maria damn Digga",
        "Todo el apoyo del pueblo peruano para nuestros hermanos de Argentina.",
        "Chicoss Genialll.️️️🇦🇷🇦🇷🇦🇷🇦🇷",
        "2:35    parce como que si hubieran distorcionado la fisica con el balon",
        "QUE LINDO VOLVER A VERTE ️🇦🇷",
        "SI LE GANAN A MEXICO ARGENTINA DEBE OLVIDARSE DE LA COPA DEL MUNDO PUESTO A QUE SE ACTIVARIAN LA MALDICIÓN AZTECA Y NO GANARIAN LA COPA DEL MUNDO.",
        "Angelito, la verdadera estrella de la selección de Argentina",
        "Aaa pero con bolivia XD ",
        "Ya va pero el mejor del mundo no es Benzema? :V",
        "مبروك الأرجنتينيين ، مباراة جيدة جدا! تحية من الامارات\n\nFelicidades argentinos, muy buen partido! Saludos desde los Emiratos",
        "Golazo de di maría, tremendo crack",
        "La seleccion argentina demostro ser uno de los maximos candidatos a ganar la copa del mundo...\nOjala se le de... Tambien por el messi... \nUno de los mejorrs jugadores de la historia... ",
        "Que equipazo papá !!!! Saludos desde Medellín ",
        "Pemain Arab Saudi minta tukar jersey messi,ternyata messi gak memberikan nya ",
        "Aquí en éste entreno hay que tener en cuenta a la única y excelente figura que tiene la selección Argentina que es el \"flakito\"...Dimaria!.. después que el \"flakito\"..este en su tarde, Argentina no tiene ningún problema para aplastar a cualquier rival,, ya lo vimos ganando la copa América aplastado al propio Brasil en su casa.. así que felicitaciones al \"FLAKITO\"..la única figura que tiene Argentina..",
        "Ah pero en el Mundial! jaja, Se Confiaron!!",
        "El partido contra México tendrá presión emocional, social, habrá peleas, drama, y mucho más. Me duele...",
        "El equipo de emirato árabe no juega a nada....así argentina no creo que llegue a la final, para mi los candidatos son Alemania Francia Portugal  Inglaterra y Brasil Argentina quedará en el camino.",
        "Q equipazo Argentina porq no llevarían a rossi por el dibu,",
        "Muchos ilusionados por este partido de Argentina, pero si el rival ni les hizo cosquillas. Argentina volverá a ser una decepción, probablemente lo más lejos que llegará será hasta semifinales y de llegar a la final la volverá a perder.",
        "Argentina y Brazil es un orgullo que sean de Sudamérica",
        "No sé ustedes, pero desde que terminó las eliminatorias, sentí y siento que Argentina será campeón del mundo.\nHinchando desde Perú!",
        "Hoy Suecia le gano fácil a México, la Argentina lo va a destrozar.",
        "Soy Guatemalteco, pero le pido a Dios que le valla bien al albiceleste Argentina. Desde que tengo uso de razón es la Selección que amo. Arriba!! Argentina. Viva! Argentina. Argentina Campeón Mundial Qatar 2022.",
        "Argentina es una máquina. Imparable.",
        "Di Maria como siempre demostrando la superioridad que tiene ️️️️",
        "No se si me gustaron más todos los goles que hicieron, o el hecho de que no hayan festejado ninguno de ellos, mostrando así la superioridad que tienen, dando por hecho que el rival estaba vencido desde un principio. Esa seguridad hay que tener para jugar un mundial.",
        "Tambien convengamos que este equipo de Emiratos es un flan, da todo tipo de ventajas, ojala Arabia Saudita sea igual o peor",
        "No jugó con nadie (el Vasco habrá dicho que ni se acerquen a marcarlos) pero ojalá mantengan ese nivel en los partidos contra rivales de jerarquía",
        "Émirat Arabic is better to play cricket but not football.",
        "Ojalá jueguen haci también el mundial ",
        "🇦🇷🇦🇷️ dale Argentina papá",
        "Si hubiesen ganado los emiratos, hubiesen celebrado descabezado infieles",
        "Somos nosotros",
        "Julan Alvarez no te perdona. Muy buen delantero.",
        "Soy Méxicano y este mundial re banco a la Argentina para campeón, venga carajo!!",
        "Este mundial se los inventaron los Qatar para que lo gane mesi ojalá si gana que gane más adelanté sin ayudas hay otros equipos fuerte ",
        "No soporto más a este relator ya se que él quiere que gane argentina pero es mucha mufa tiene que ser más profesional y no dejarse llevar por los sentimientos",
        "Despues viene chile y les saca del mundial",
        "Alguien mas se da cuenta que el himno de argentina se cambiando de sonido y partes miren del 2018 contra nogeria himno",
        "Cuiden al fideo porque se les va medio equipo, vamos Sudamérica",
        "en  ca  messi",
        "مسخرة الفريق الاماراتي",
        "Los verdaderos fanáticos al futbol queremos ver a Messi campeón del mundo, incluso sobre nuestras propias selecciones, ojalá!",
        "Como mexicano le deseo lo mejor a argentina y que gane el mundial todo por Messi",
        "Pedazo de gol Angelito Di María",
        "Escuchen...corran la bola...",
        "Viva argentina! Congrats to Emirates, they played this game, they didnt stay in defense and wait",
        "Como en Brasil 2014 hasta su lesión, como en Rusia 2018  vs Francia metiendo gol y levantando los animos del equipo como en la Copa America anotando en la final. Di Maria el Fideo cargando a la albiceleste. Y siendo el mas determinante aunque los premios y portadas de periódico se los lleve otro",
        "UAE good match I love you UAE team",
        "normal que ganen si esos turko  la ven cuadrada ala pelota  , re creidos festejando  mejor es probar con equipo de verdad",
        "La mejor  lo mejor para ustedes chicos ustedes pueden !!!  Los amó vamos argentina ",
        "¡VÁMOS ARGENTINA! MESSI ♡\nDesde Perú estaremos apoyando a ese gran cuadro de selección. ♡\n\nHincha Peruano.",
        "Mañana es domingo dia de descanso y no me da por despertar... Pero saber que empieza el mundial ya quiero que amenezca para ver el inicio ",
        "Vamos Lionel vas a brillar este mundial y soy del madrid",
        "Es muy bello lo que está logrando Argentina solo espero que la estrella de la historia Lionel Messi logre este mundial antes de su retiro ( felicidades Argentina)",
        "Di María ",
        "Soy colombiano pero tengo que admitir que Argentina tiene un hp equipazo lleno de cracks. Y mi favorito es  Di maria.",
        "jajaja los árabes festejando el triunfo de Argentina. Simplemente hermoso, es lo que despierta la selección y Messi en el mundo",
        "Se imaginan una final argentina vs Portugal dos leyendas disputando quien ganará su último mundial",
        "La session 50 de Duki y el 5-0 Argentina con gol de Messi.",
        "UAE Players are immigrant workers....hhh",
        "Que bueno ver el apoyo de distintos paises hacia la selección estamos todos muy ilusionados. ojala se cumpla el sueño de todo un pais y el maximo sueño del capitán a matar o morir vamos mi argentina querida ",
        "2:35 / 3:53 Di María \"es otro Messi\" cuando se ilumina y eso es una excelente noticia, VAMO ARGENTINA CARAJO! 🇦🇷🇵🇪 Abz desde Perú!",
        "Ahora con arquero...",
        "La sincronización y el Orden son tan perfectos que da gusto verlos jugar como un gran Equipo Vamos Argentina! desde Venezuela!",
        "Vamos selección 🇦🇷🇦🇷🇦🇷",
        "La forma en que el arbitro mira a messi jajajaja",
        "Para mí Di Maria es el jugador más importante de argentina incluso más que Messi .",
        "El árbitro viendo a Messi al final",
        "Meshi meshi",
        "Vamos selección con humildad siempre 🇦🇷️",
        "RELATOR RODOLFO DE PAOLI\nCOMENTARISTA ARIEL SENOSIAIN",
        "8:08 lo re miraba el arbitro a Messi jajaja",
        "I love Messi and Ronaldo, I'd be happy if either won 🇵🇹🇦🇷",
        "Tenía miedo de que los árabes sacaran un AK47",
        "Ayer me compré una moto, runnn runnn, salió un gato y miauuuu miauuuu, aprecio un pez y dijo gluuuu gluuuuu….\nCONTINUAR LA HISTORIA ",
        "Este será el marcador que recibirá México 🇲🇽 a manos de Argentina 🇦🇷 en Qatar 🇶🇦\nMessi se tiene que ir como un grande: ganando el mundial \n\nAtentamente, un mexicano ",
        "la argentina jugo su pichanga xd",
        "Esperemos que jueguen asi en el mundial.",
        "Ansioso de ver como Argentina goleara a México para que al fin la federación abra los ojos y nos muestren nuestra patetica realidad de futbol. Saludos desde México 🇲🇽",
        "El segundo gol del encuentro, el primer gol de Di María es sensacional. Bien descrito por el narrador, es  gol de un Crack. Espectacular.",
        "I think African countries can easily adapt the humid weather in Arabs. Even they install AC in football ground. It's still hot and humid.",
        "Pinche di maria buenisimo pero que no estaba lesionado broo ?",
        "Vamos sudaméricanos!",
        "Acto seguido: Los de emiratos Arabes se van llorando en sus ferraris",
        "Argentina país hermoso el mejor fútbol las mujeres más lindas la gente muy humilde quiero que salgan campeones del mundo, soy uruguayo",
        "Desde México: Argentina gran candidata a llevarse la copa... He de reconocer cuando un equipo ilusiona y además reafirma su categoría...y NO! No soy y nunca he sido fan de esta selección.\nAún así, muy bien porque esto es querer jugar fútbol... No como el patético desastre que es hoy otra selección dirigida por un tal Martino que se escapó de un pinche asilo...",
        "Increíble el amor de los indios, los árabes hacía Argentina. Todos con la camiseta Argentina🇦🇷🇦🇷 vamos Argentina!",
        "Argentina  🇦🇷 🇵🇦",
        "Soy de Barranquilla, Colombia. Deseo de TODO corazón ️ que ARGENTINA alce la copa de CAMPEÓN!\nArriba muchachos!",
        "El centro que metió Acuña es tremendo",
        "VAMOS ARGENTINA 🇦🇷🇦🇷",
        "Damn di Maria ",
        "Fútbol Argentino que golazo de Di Maria, Si que será un mundial emocionante.",
        "Vamos mi Argentina querida. Traenos esa copa. Messi .",
        "cómo van a elegir a Messi como figura del partido...¡AGUANTE DI MARIA PAPA!",
        "Ha fatto più Di Maria qui in mezza ora che nei primi 5 mesi alla Juve! Grazie tanto Angel !!!",
        "A mi no me interesa si los hinchas son de aquí de allá, agradezcan q su selección la quiere todo el mundo.",
        "Se van a topar con México ",
        "Soy mexicano pero estoy con argentina Bamos leo",
        "Foyth El jugador, del que nada esperábamos y nada hizo!!!!! GARNACHO TE ESPERAMOS CON LOS BRAZOS ABIERTOS",
        "Argentina tiene que ganar el mundial si o si vamos Argentina saludos desde Perú.",
        "Saludos de parte de un mexicano 🇲🇽️ que viva Argentina quiero verlos campeón y a mi idolo Messi verlo campeón por qué lo merece y lo merece tu familia y afición de todo el mundo.",
        "Excelente equipo , les deseo exito en Qatar y que vuelvan con la copa. soy chileno pero tambien sudamericano.",
        "Ese Foith es muy inseguro en la defensa ,  grande la Argentina",
        "العشق المنتخب الارجنتيني ️🇦🇷",
        "Tremendo equipazo el argentino!!!! No veo como México le haga cosquillas ",
        "Bueno , igual no vamos a ganar, seguro gana Brasil o Francia , Alemania, España, Portugal,.Holanda , Inglaterra, Bélgica, Croacia, Dinamarca , pero lo más probable es que Brasil gane su sexta copa del mundo , de hecho ya la ganaron , felicidades brasil por su sexta copa del mundo",
        "vamos argentina vamos messi siempre apoyandote a vos ",
        "desde México, toda la buena vibra para la Argentina, deseo de todo corazón que regresen a casa con esa copa, Messi es el amo de este deporte y si alguien merece ganar el mundial es el. Venga!! Aguante Scaloneta !!!",
        "Soy mexicano pero si digo en cuestión de boxeo somos los mejores pero de fútbol argentina tiene buenos jugadores des pues de Brazil Ovio ..",
        "يخرب بيتكم",
        "LE DABA LASTIMA FESTEJAR LOS GOLES JAJA",
        "NO ENTIENDO POR QUE ARGENTINA NO LE JUGÓ ASÍ A ARABIA SAUDITA!! SI SE PARÓ IGUAL QUE LOS EMIRATOS ÁRABES!! POR QUE ESCALONI NO REPITIÓ EL PLANTEL QUE LE ISO 5 A EMIRATOS ÁRABES Y POR QUE ARGENTINA CAMBIO LA TÁCTICA DE ATACAR POR LAS PUNTAS EN LUGAR DE ATACAR POR EL MEDIO CON UN MESSI MÁS RETRASADO!! SIN LUGAR A DUDAS QUE SE EQUIVOCÓ FIERO ESCALONI!! ",
        "Bamo mi argentina hoy gol de messi",
        "Yo solo quiero ver a Messi campeón!  saludos desde Messico!",
        "Argentina tan humilde como siempre",
        "bueno no canteis victoria ese equipo es como un equipo de segunda , de todas maneras ojala argentina llegue muy lejos en este mundial , .",
        "Soy un colombiano 🇨🇴 que anhela ver a Argentina 🇦🇷 CAMPEÓN del mundo en este 2022!!! Se lo merecen y se que lo van a lograr. Éxitos!!!   ",
        "Ojalá argentina corrija los problemas defensivos que tiene. Por qué este mundial el que mas se lo merece es Leonel",
        "JAJA CONTRA LA PODEROSA ARABIA ",
        "𝐀𝐑𝐆𝐄𝐍𝐓𝐈𝐍𝐀 𝐄𝐒𝐂𝐔𝐏𝐄 𝐅𝐔𝐄𝐆𝐎.\n\nYa no hay marcha atrás, todo lo hecho, todo lo dicho, todo lo trabajado llega a Qatar. ",
        "Tal vez mi país natal Panamá no haya ido al mundial este año, pero me alegro de que mas países hayan clasificado ",
        "Dale que argentina sale campeón",
        "La expresión del portero me hizo acuerdo al taxista de Deadpool ",
        "Existe un Mexicano capaz de destrozar a los Argentinos pero no fue convocado  \nDi María ten piedad de nosotros ",
        "Qué calor tan regonorrea debe estar haciendo allá,, el árbitro estaba que se moría.",
        "Fue solo una practica . Ahora vendran los partidos dificiles...",
        "Pase lo que pase estoy con Argentina  , que hermoso su Himno",
        "xq todos los goles de Di María son golazos q crack q es angel un fenómeno este mundial es para ustedes y toda argentina vamos ",
        "Di maría de lo mejor",
        "Foyth por el amor de dios, no te pueden comer la espalda los Emiratos Árabes Unidos.",
        "Que lindo ser argentino 🇭🇳🇭🇳",
        "Hay que ir despacio!!!!. Tuvimos grandes selecciones casi siempre, debemos tener un plus de suerte tambien",
        "Se siente un ambiente raro en la selección, no es esa misma energía que siempre nos tuvo acostumbrado en estos ultimos años al mando de Scaloni, hoy note nerviosismo y mucha seriedad (Jugadores y CT), como que paso algo internamente en el grupo. Uno podria pensar que tanto los jugadores como el cuerpo técnico no tenian ganas de jugar este partido y por eso estaban molestos, pero siento que pasa mas por otra cosa. Ojala me equivoque, pero siento que a día de hoy no vamos a empezar el mundial con tanto positivimos como se venia teniendo hasta antes de este partido.",
        "4:58 Messirve .",
        "Qué bonito juega Argentina, no tenemos nada con que competirles la verdad, no es espera una señora madriza, en fin...",
        "vamos argentina carajo este mundial es nuestro",
        "Que equipazo el argentino, serio candidato a ganar el mundial de Qatar, abrazos desde colombia",
        "Si colombiano pero les digo argentina por obligación será campeón no hay rival para argentina ni Brasil",
        "ahora con francia o alemania para  ver que pasa esta vez",
        "Bir Türk yokmu yorumlara bakan",
        "Este equipo es muy bueno pena que perdera para brasil en la semifinal",
        "Ay que cuidar mucho a los jugadores clave ojalá guarden mucho a Di maria DePaul Messi, que no se repitan esas lesiones mundiales Di María Messi la sustancia clave para una final",
        "Argentina en la casa papa",
        "Que bien por Argentina ,aunque en este mundial tampoco estará en cuartos de final.",
        "Este año , es nuestro mundial loco 🇦🇷",
        "Golazo de Messi ",
        "Dimaria pedazo de crack te mereces ese mundial ídolo como defines y organizas tu equipo. Fideo el mejor lejos en Argentina con el todo sin el nada",
        "What kind of defense is that on third goal.",
        "Aquí deseando que Argentina se cruce en fases finales con Francia y los eliminen y ver llorar a Mfrapé",
        "Un entrenamiento de Argentina.",
        "Que se agarre mexico",
        "Suii!",
        "Messi mete gol hasta los hinchas de Emiratos celebran",
        "Está es la gran Argentina que a todos nos gusta ver muchísimo  así se juega, 36 partidos invictos rumbo al récord de mayor partidos invictos a falta de tan solo dos para superar los 37 partidos invictos de la selección italiana, vamos  Argentina a superarlo.\nGran partidazo y buena actuación de Messi una asistencia sutil y un buen gol de derechazo, 50 asistencias ya ",
        "Que orgullo !! Dios mio de ser argentina !! Angelito Di maria un crack!!",
        "Leo Messi fan 🇦🇷🇦🇷🇮🇳",
        "Mac allister jugo muy bien también!!",
        "en este mundial van a hacer hasta lo imposible por que gane la copa argentina. para vender mas a messi. por fuerza lo quieren subir al nivel de maradonna.",
        "Que bien juega Argentina y Messi con  Di María un lujo, son grandes.",
        "Notaron que al acabarse el partido, Messi ignoró al árbitro? jajaj pobrecito el profe",
        "Esta es la Argentina ! vamos vamos Argentina! campeón del mundo en catar viejo!",
        "08:01 hasta el árbitro se queda a observar a Messi al terminar el partido. Sin dudas el enano es un ídolo mundial.",
        "messi nada le costo definir porque es un crack , pero asite , sin egoismos , el mejor futbolista de la historia lionel messi",
        "Soy de Perú pero QUE GANE ARGENTINAA🇦🇷🇦🇷🇦🇷",
        "0:51, yo tengo muchos amigos argentinos, pero ninguno tan barbudo como estos señores...",
        "I love Argentina!!\nU are the Best!",
        "3 doritos despues >>>",
        "Soy Mexicano pero le pido a Dios que Argentina nos meta unos 10 Goles para que deje la FMF de inflar tanto a jugadores que no valen nada.\n\nEn Argentina y Brasil si apoyan el talento futbolistico sin Importar si vienen de los barrios más pobres.",
        "Me gusta la actitud de messi...incluyendo a los mas jovenes...bien puso haber hecho par de goles mas...pero decidio asistir y disfrutar con sus compañeros de este postre...jajaja",
        "Partidazo de Argentina. Soy orgullosamente Argentino y Bético. Bien Julián Álvarez tenemos 9 para un buen tiempo. ¡Vamos por el mundial!",
        "Vamos  argentina 🇦🇷️ desde Centroamérica . Guatemala 🇬🇹",
        "Cómo argentina no hay dos.. \nSoy mexicano pero debo aceptar ese porte, esa forma de hablar, ese exquisito y particular forma de ser.. \nSon grandes, simplemente organizados y geniales jugando fútbol.. su orgullo tan bonito que tienen!.",
        "Impresionante como algunos acá se guían constantemente por si un jugador juega más en Europa que otro, Foyth de ninguna manera tuvo que ir a Qatar el pibe se nota que le falta mucho para ser de selección ya desde el partido contra Colombia antes de la copa América venia mal, hace que extrañe a Molina mira lo que te digo, Molina al que lo volvió loco Ben Brereton! Un 9 jugando por las bandas. Montiel es el más completo para mi debe ser titular en partidos pesados.",
        "indiscutiblemente el mejor equipo latino ojala y sean ellos los que se traigan la copa.",
        "DESDE MARTE APOSHAMOS ALALBICELESTE BIP BIP BIP BIIIP BIIIP BIIIIP !!!!!",
        "Vamos argentina, cada día más imparable, da igual cuando leas esto tenemos 36 (SIN PERDER)",
        "soy africano pero esta seleccion tiene todo para ser campeon del mundo",
        "El gol de dimaria xse parece el gol de pavar  cuando les elimino de mundial de rusia",
        "Así le ganó mi Colombia a ellos el mismo resultado y por fuera que buen recuerdo colombia",
        "Soy Peruano pero mi familia paterna es Argentina, le banco a esta selección con todo corazón , se están ganando respeto de muchos, Messi se merece ganar un Mundial, vamos Sudamérica, vamos Argentina carajo!!!!",
        "PONGAN ESE EQUIPASO PARA EL SABADO POR FAVOR",
        "Salvada del 6 muy bueno!! ",
        "que lindo los hinchas arabes y cataríes apoyando a argentina",
        "Bangladesh is always with Argentina \nOur 2nd Home",
        "Todo 🇵🇪 apoyará a Argentina para que Messi pueda levantar la copa ️",
        "En paz descanse la selección mexicana",
        "Soy Panameño, muchos aca anhelamos ver a Argentina levantar la Copa del Mundo.🇦🇷🇵🇦",
        "Vamos juntos Argentina, essa é de um de nós 🇧🇷🇦🇷",
        "Vamos argentina..! desde Perú,messi levantará esa copa y llorare ",
        "Soy peruano,pero de corazón quiero que Argentina  sea campeón, solo por Messi,se lo merece.",
        "Vamos Argentina! Este mundial es de ustedes ! Saludos desde Perú.",
        "Di Maria di Maria!!\nRuventus ",
        "Jajajajajajaja",
        "Lo que le espera a México .",
        "Argentina siempre fue buen atacante, eso no es novedad, pero... QUE DEFENSA QUE TENEMOS PAPÁ!! Vamos Argentina, que bien que te veo!!!",
        "Soy peruano pero a partir del 20 e este mes soy argentino.\nVamos Messi este mundial es tuyo.\nMe subo a la Scalonetta. ",
        "argenitina trapeo el piso con eau",
        "podrían meter un 1080p amigos",
        "El dibu está lento amigo...",
        "Pero lo que esta jugando argentina ahorita por favor, soy colombiano pero le voy a hacer fuerza a argentina en el mundial que pedazo de seleccion amigo ojala gane el mundial leo",
        "Vieron la cagada q se manda Foyth contra una selección amateur??? Eso en un Mundial te deja afuera y a dormir sin chistar",
        "Partido para correr. Porque no daba para jugar duro y lesionarse.",
        "Sida wanaagsan ee Argentina u ciyaarto, aad ayay u fiican tahay \n\nsaludos desde argentina!",
        " Algunos hinchas no parecen argentinos jsjs",
        "Que momento más hermoso para ser Argentino.",
        "Si ángel di Maria hubiera jugado en el mundial contra Alemania 🇩🇪. Messi ya tuviera un mundial",
        "Ese pase sublime de Acuña y la definición de Di María, que manijaaa",
        "No pues si nos va a ganar argentina pero al menos que sean 3 y no 5 a nuestro mexico ",
        "Di maria es un monstruo, como hizo ese golazo",
        "Got this recommended after the tragic events. You really made literally millions of people laugh and feel entertained, maybe after a long days work or something like that. Thank you, dude. Rest in Peace :* :-)",
        "Sono italiano e sfortunatamente l'Italia non ci sarà a questi mondiali ma tiferò per i fratelli argentini...... Vamos Argentina ",
        "Vivimos esta ilusión de verte Campeón del mundo Leonel. Desde Venezuela te deseo éste mundial. Te lo mereces",
        "Soy mexicana pero apoyo a Argentina por Messi mi ídolo, necesito verlo ganando este mundial, lo merece  VAMOS CRACK ",
        "que mexico vaya preparando la vaselina",
        "Dios se apiade de la Selección Mexicana",
        "Tengo una duda ¿Argentina puede llevar ése parche de el campeón de América a el mundial..?? ¿o no se puede eso? Porque sería genial si se permite",
        "Pensar que había argentinos en contra de Di María, como los hay hoy en día de Dybala. No se dan cuenta que son jugadores distintos, son cracks aún con lesiones y que en una jugada te pueden cambiar un partido pero no hay que olvidarse de todos estos que ahora se esconden.",
        "Tengo familia en La Plata y sé que dejarán la piel en la cancha, aguante Argentina, tus hermanos peruanos a muerte. ",
        "impresionante gol de di maria",
        "ARGENTINA tiene un equipazo ,candidata a llevarse la copa ,incluso encima de Brazil",
        "Di María es el alma de Argentina sin duda, verlo como juega como arma al equipo es un deleite.",
        "Pero menudo goles se marcaron ajajjaj fueron todos de pura calidad y majestuosidad, Saludos desde paraguay espero les vaya bien en el mundial",
        "Te Ámo Selección. Ganes o no ganes la puta copa 🇦🇷",
        "Este año levantamos la copa señores ,vamos argentina",
        "Qué zurdazo le salió al árabe, atrevido",
        "Демария пушка",
        "🇦🇷🇦🇷🇦🇷",
        "han jugado con cojos asi es mas facil meter goles",
        "Me agrada el titulo directo y conciso. No como el señorito espn \"con Messi en la cancha la escaloneta goleo y se proclama casi campeón del mundo\"",
        "Cuiden a di María ",
        "7:20 Acá lo durmieron a Foyth, pensó que la pelota caia antes, el rival siguió picando y le ganó la espalda. Hay que mejorar estos cierres, si jugamos contra una potencia dejar al arquero mano a mano es 80% gol.",
        "Saudi is different 🇸🇦 2-1 ",
        "Estos argentinos juegan muy bien al football joder! Espero mucho de ellos tio, saludos desde Argentina",
        "Vamos Argentina!!! Estoy muy ilusionada par favaaaar"
    ],
    "comments_disabled": false
}