{
    "video_id": "ta_O63tJ4nE",
    "comments": [
        "I love it when you all take cars to the track!  Can't wait for the progress of these builds.",
        "Love that you put a narrator! I love 100 days videos.",
        "Any coilover shock that can’t do hi-speed and low-speed dampening independently is going to be useless.  A good shock will be in the $4000 min range",
        "I want!",
        "Production on this video is so damn good. Such an informative video. Fantastic!",
        "Your consistency and quality of content never disappoints! ️",
        "Pretty good, they didn’t blow up",
        "You mean exactly seven times as much LOL!",
        "The other day I commented on a “Guess the driver/owner” video saying this isn’t what we wanted and we wanted you to go back to your roots and this right here…. This right here hits the spot thank you",
        "the problem with things like ebaymotors/rock auto is that YOU have to know what you need. ALWAYS TYPE IN YOUR VIN!!!! This is why part houses are still functional. We can get you what you need. we aint mechanics but we're here to help.",
        "Since u guys are in Inglewood y’all ever had foster freeze",
        "I've got Tein Mono's on my Lexus IS-F and couldn't fault them, they're fantastic, would have been good to see you use them with the EDFC PRO to show their full potential",
        "Can we get a copies of those Pumphrey headshots while we wait for our Stocky(s)?",
        "Need to ad a \"mid\" car too. Would be good to see what to completely avoid, what is really good and what you can compromise on",
        "2:15 Stop doing chest compressions! He is still breathing!",
        "Did anyone catch that at 2:12 ",
        "Remember kids: Good tires FIRST. Then start messing with suspension, brakes, etc.  ",
        "9:06 subaru :(",
        "why dont my boy nolen get a high car",
        "I unsubscribed a little while ago, but this won me back.",
        "Amazing start of the season!! I just hope to see a video in the future about the engine issues on hi car and how did you solve them",
        "Is this the 1st episode??",
        "Yet another set of Identical cars that are different at the start. Still better than the science of Super Size Me.",
        "alibaba..we all know that place isn't a scam.",
        "As a WRX owner, I love that you picked WRX and NOT STI.",
        "$2100 for tein??? What you do go to a rent to own? ",
        "Seriously tho, wheres the intro and outro?",
        "I want a shirt that says “All we gotta do is blast off these NUTS”",
        "The Teins should really be on the low car.... put some actual nice coilovers on high car. lol.",
        "for the first time in 2 years, Hi Lo cars are actually good. pls keep using the subi's",
        "We already got our answer as soon as Nolan said maxpeeding rods lmfao",
        "I mean.  Shouldn't we be using atleast a reputable cheap coilover instead of the shittiest ones you can find.  Not a great comparison imo",
        "Good old reliable subaru boxer engines",
        "When Zach threw the coil over off camera and someone was on the floor like they got hit in the next scene was so funny",
        "top notch editing shout out to editor great work! :D",
        "I really like how you spent the extra time and effort to go into detail about assembly quality, settings, types, and other details of the new components.",
        "where's aaron? ",
        "genuinely impressed by nolans performance love the hi-low series cant wait to keep watching",
        "my brother has the $300 coilovers and they siezed up in the back after 4-5 months",
        "Since its a scooby the progressive curve $300 should win on that point as its a classic WRC car",
        "I love this series but have a suggestion for the next season. What about y'all change the concept a bit and use the same quality parts but one newer more expensive vehicle and one older more beat up vehicle. Same make and models just different years and mileage.",
        "Hilow was a question answered in basically the first episode. How is it still so entertaining?",
        "Laughed too hard at 4:29",
        "What happened to Aaron? Is he not with donut anymore?",
        "10:15 thats what she said",
        "Coincidence with the post about my coilover breaking?",
        "Well they say Subaru is fragile......",
        "Y you hit him with the car part?",
        "This feel different without aaron ",
        "another idea, lo car gets cheap cyl 3 cooling kit (seen some that t off of existing coolant and oil lines to plumb to a OE plugged port.) hi car gets dry sump?",
        "Next video : wrx lefted offroad",
        "The suspension was fully setup after fitting the coilovers right?",
        "\"But now, with the war finally over, I'm free.\"\nThis quote holds such a different meaning now. I remember hearing it for the first time and thinking about how it added an almost humorous flare of drama to the video at the end. Now I hear it and hold back tears. I still can't tell whether they're tears of joy or sadness. Of course it wasn't meant to hold the meaning it does now, it was just about a videogame where he was fighting for a rank. For honor. Not for his life. Not a war with cancer. But Alex, the man behind the screen, the man giving us this content and joy, is now free. Which is a happy thing, even is it's hard for the people who he made smile in his life. And as for Technoblade... Technoblade never dies.",
        "Yess! Love how you picked Subaru’s for the next season of HiLow",
        "The whole thing with Novias and Zynx is LITERALLY the coolest, most poetic story moment I've ever seen in a Nuzlocke\nAmazing",
        "Please tell me this is a new season of birth car low car",
        "I actually put some 300$ coilovers on my miata because im on a budget and so far im really happy with them. Yea they dont ride good, but for autocross they are alot better than stock and they handle pretty decent",
        "Sense of humor is amazing! Lmao who ever thought of that clip around 2:06 deserves their props",
        "Should of gotten something else other the suburbs, I feel like they are both are going to go through 6 motors throughout this whole series but can’t wait to see it",
        "Subaru: exists",
        "2:05 I love what y'all did there! He got knocked out by the coilover D;",
        "Just Subaru things",
        "Like everyone else seems to be saying. The production quality and overall skill you guys have as a team to make content and deliver time and time again really breaks my heart that you don't have a TV show that you have at least enough control over to write your own scripts and make your own mini series as you've been doing here just on television as well!",
        "Where’s Aaron though",
        "going to love this series, i also have a wrx ",
        "It's T N",
        "Why couldn't low team become high team?",
        "dude i have this car lmfao",
        "Need to try a more mid range instead of going cheap!",
        "You guys haven’t try some Taiwanese brand that would blow your mind like BC or D2 those budget mods brands",
        "I’m glad you using those Subarus, they are my favourite ones",
        "Man. I'm working on an 07 wrx conversion. Love the hawkeyes",
        "Nolan deserves Hi-car one of these days :'(",
        "I got fucked over buying on eBay motors, now I'm disputing the charge with my bank because eBay and the seller wouldn't help me",
        "Do wraps. Cheap vs expensive",
        "\"How is this running\"\nNah man, a few assets aren't loading in just wait for it :-P",
        "for once id like to see Nolan on the hi side....Fu James!!!!!!!....even though i love u too!",
        "How can this be a Subie series without IMMEDIATELY blowing up an EJ?",
        "what kind of model is that?",
        "Definitely would look into fixing the oiling issues Subarus have stock with oil pan baffles and new oil pick up",
        "damn james is really slow",
        "Can we get a Raceland vs Bc Racing coil over video??",
        "wheres the crew tho",
        "Make them off road rally cars",
        "I miss my wrx \n\nplz do cylinder 4 mod so they don’t blow up",
        "Adding the segment with the diagnostics on the parts you're using was very cool and informative. Loved it. Glad you guys are evolving content and not just doing the same thing every time. Good stuff fellas.",
        "Good show like everything….. except that you changed the tries as well wish it was only the suspension that got switched",
        "I blame the motor blowing up on the monotube coilovers.",
        "Preload can only lower your ride height if you preload more weight than is on the spring from the car itself.",
        "Nolan is a pro driver  proud of you son ",
        "Ate we sure these are 2005 WRXs? This headlight style wasn't released until 2006.",
        "Anybody else notice that they pulled a set of KYB AGX’s with upgraded springs (FANTASTIC suspension combo) out of low car to put in the equivalent to hot dogs instead?",
        "I didn't even know this was a hi-lo series, I think the title could use some work lol",
        "I have the same yellow coil overs on my coup it drives great",
        "Better suspension, better traction, better lap times. Papa Nolan’s",
        "You guys need to add mid car!",
        "6:51 With that headshot you are the perfect person to cast in a live action version of Wreck It Ralph. ",
        "You're gonna tell me they can afford all of these cars, mods, production crew etc. But cant afford professional timing equipment? Why are they using an iphone stopwatch?️",
        "These cars are not identical.",
        "Anyone else notice the video and editing team really upped their game in this video? The lapse of the old coil over coming undone step by step was a great segment",
        "Nice, but i suppose that tires of cars have a diferent manufacturing date, so their specification are also diferent.",
        "what midpriced coilovers would you guys recommend for a smooth ride? the Maxspeeding ones were way too stiff and felt very bumpy. i like a smooth ride",
        "2:11 casualy Nolan or some one else dying working on the car lol",
        "Have you guys ever watched dragon ball? The guy with three eyes is named Tein pronounce them like his name ️",
        "Definitely buy the expensive coilovers.",
        "Ugh those cars are so Damn nice 🫠",
        "Is nobody talking about the cpr session at 2:20 ?",
        "The reason the cars keep failing is because people beat the shit out of them new till they are scrap.",
        "I feel like we’ve been here before",
        "You keep saying max speeding rods. They’re max Peeding rods.",
        "James claiming his signed headshots are worth $1200 is hilarious. If it's a joke it's well written. If it was supposed to be true then its even funnier that he actually said that out loud ",
        "When a YT vid starts out with a simple math error that a 5 year old USA child 2 generations ago could figure out with his fingers, the credibility is shot for the rest of the vid and channel. If you can't figure out simple math,---there really is not much you can figure out.  Sue your schools.",
        "to see more!",
        "In fairness to James, his times are the only with 2 people in the car.",
        "Do you have any idea how much I appreciate that this channel only takes on sponsors that will allow them to write their own ad read",
        "Slick editing! That bit where Zack is explaining how coil-over replacement works was really excellent.",
        "Next video idea who can build a better engine cheap vs expensive parts",
        "This guys are slowly but steadily generating a (classic) top gear vibe with their interactions between themselves. Congrats",
        "I put maxspeeding rods coilovers on my 12 mazda3 and they are absolute junk, 500lb spring rate springs on the rear-end of a lightweight car make for a bone jarring ride, granted it's not as bad now that I've got the rear shocks adjusted right, but still. I regret not spending the extra money for a good quality set of coilovers.",
        "Low-key appreciate the low lift joke.",
        "Wait did you guys just launch a new season of high low and not even make a big deal about it???",
        "i can't wait to see all of the engine failures they have.",
        "This series has changed my life so much that I now answer the phone by saying \"HiLow\" instead of \"hello\".",
        "To beat you I gotta improve me",
        "Up north here there's no way those are coming out that easy lol.",
        "Love the new cars and especially as it’s my fav gen of Subaru. \n\nAlso I assume it will be a long long way off but I thinks something like a bmw z3 would be a cool out of the box idea for a hi low series",
        "blown motor on a subaru?....nooo",
        "Wouldnt be a Subaru video without a blown engine!",
        "I love the return of this series, and I love how well constructed, informativce and entertaining they are. You guys seem to genuinely love making videos, and I can't get enough. Well done guys!!!!!",
        "Never get rid of High vs Low. This series is by far my favorite car series on YouTube",
        "I love how they get to basically have father-daughter time and it's almost adorable seeing them do this. The text is magical and just you know it's Ethan. You know he's protecting her the best he can and it makes it so touching cuz he sees himself in her with how stubborn she is.",
        "I like how the guys are wearing gold chains now lol",
        "Im about 98% sure tein is pronounced \"Tee-in\"",
        "Please EBay motors how many fake parts do they sell like spark plugs fuel injectors Sure the price looks good but if it destroys your motor is it worth it then ? Maybe the reason that motor in the high car keeps failing is because of all those eBay Chinese parts that`s in it",
        "Typical Subaru am i right guys",
        "Subaru problems lmao ",
        "2k and still buys garbage teins coilovers lmao.",
        "subaru has the best blue",
        "Wouldn't be a Subaru video without some blown Engines lol.....",
        "low car should be doing the mods the hard way! OG in a driveway with a single jack and jack stands!",
        "went off track. but at least their rally cars lol.. i think both cars should've had the same driver",
        "I need that shock dyno right now ",
        "The ending crack me up! Lol",
        "Donut artificially raises cool car prices with every new series",
        "2:17 as much of a gem this bit is, I can only imagine how much better it'd be if they did the \"CPR Twerk\"",
        "Jesus, yall got something great here. I've been watching car shows for literally over 30 years and this show even after only 5 minutes I connected to like that once in a lifetime feeling ya know! This show, the guys the excitement of it WOW!",
        "Coo",
        "What do you define as one deviation better? Then we can figure out how much better these shocks are :D",
        "Hi-Lo = Amazeballs!! An awesome twist would be to see Pumphrey on Low team one of these days and Nolan be on hi team  :)",
        "new hilow ?",
        "just dont buy maxspeedingjunk coilovers.",
        "Was the blue subi low on oil? Lol",
        "I love these compression viseo but you should do them will making low budget use low budget tools And high budget with the expensive tools (proper tools).",
        "You're basically done with the tutorial, Zeta. Once you've been given the three story paths you can explore the world how you like!\nDid pretty well for a first time. Have a good rest!",
        "Well I had 1995 Škoda Felicia 1.3 BMM (look for that car on internet) as my first car, used one from Germany and it had lowered KW set of coilovers for 800 USD in that time... Was it worth it? Nope, I once got stuck in a puddle, as my front was too low... then I had Seat Cordoba SX 1.8 16v (130+hp) with Bilstein coilover for 1500 USD... Was it worth it? HELL YEAH on nice new roads. Problem is, here in Czechia (Czech Republic), roads are still like in eastern block, so total thrash, pot holes everywhere. So you had to change everything around the coilovers every half a year.",
        "why didnt you make much comment about the ride quality/comfort between the 2",
        "Nothing",
        "this testing method is much more enjoyable and feels like more reliable information",
        "LETS GO!!! SUBIIIIIIIIIIII",
        "Those tiens had linear valving, not digressive. Also theyre just a decent entry product from a trust worthy company, not a high end option. Also the rods demo that showed them bouncing around os over-dampened is the opposite of true, the problem is gunna be that the spring wont be able to put the wheel back down fast enough after a bump bcs the damping is strong for it, as well the damper generating a too large portion of the compression resistance, meaning undue wear and heating of the oil in the damper. Finally, it will mean a jarring ride.",
        "im confused,  is this the first episode to these wrx'es? they should separate series of episodes of hi low for every car",
        "I'm glad to finally see the WRX get some love in this serries. I just lost mine to an unfortunate accident (Not my faults). Feels good to see them here.",
        "\"Cuz it's low lift\" ",
        "Love how Low Car started with STI struts",
        "Denuded can never play a game and not have a combo and I love it. Keep up the goodwork!",
        "Here I am thinking about all the things I'd like to change on my car, yet I don't have any money for them.  :/",
        "Low car 1 - High car 0 in reliability",
        "No one’s going to talk about the whole installing coil overs sequence?",
        "I got cheap coilovers off Amazon for my Mazda3. I knew it was a bad idea then and boy was I right. First, quality was very cheap, ride noise increased incredibly. Handling did improve but eff they are stiff. Way more stuff than any other coil over I've ever seen. And the front coilovers  started leaking fluid within 4 months and were gone by 6.",
        "You guys did flawlessly with this video.   the editing bringing all the ideas together. Using the full team's perspective to ensure the idea of why you'd wanna do this replacement yourself. And just how well you have all grown so naturally into your position. If every video has this quality of personal touch,  this will be the best season hi-lo has ever seen",
        "6:13 most likely if there is only one adjustment its bound.  Rebound is more about matching your springs and wheel weight, any decent shock maker can get you close on rebound.  Bound has the most control over handling and ride comfort so likely any shock that is single adjustable is going to be bound.",
        "Sooo sooo SOOO EXCITED FOR A NEW SEASON OF HI LOW!!! Guys y'all are so much more knowledgeable and experienced since the 350z days. Impressed how y'all grown in this industry since the OG days. Even the quality and editing of videos is better. Thank y'all for doing another season ",
        "Y’all was out in the Av man I hope I run into you guys one day!",
        "Lmao subie special one definitely had to blow up ",
        "6:20 this is why you should match up new parts mounting with the old stuff before you get too far ahead of yourself.",
        "I mean… y’all chose Subarus… those engines love to blast at 100K…",
        "When @zack said “cojenes” I liked",
        "get jimmy on camera if he can talk.",
        "2:18 ",
        "I might watch Baby Driver again after this",
        "Really showing all sides of Subaru. A real blast, literally.",
        "The cinematographer and story boarding are really good in this episode.",
        "Lift sounds like it needs a oil change",
        "2:18 lmaoo",
        "18 track days at 400whp in my miata and only problems have been very minor. \nTypical Subaru, engine blown!",
        "Hi/Low, great series.",
        "Low vs high is back ",
        "You forgot to put eggs in the coolant!",
        "So Tein is still entry level.. fortune autos, KW and Ohlins are the best from what I’ve seen. You’re comparing $300 coils to $700 coils in this video lol",
        "lmao good ol subaru reliability strikes high car haha",
        "I will say the production value of this video is fantastic. Not that previous High/Low was bad, but this is a huge step forward.",
        "Congrats on the sponsor!  These videos are very well written, produced and edited.  It’s been great watching this channel grow and it looks like you guys are in the zone.",
        "Tein? Really? Shoulda bought Cygnus. Same money, way better.",
        "ITS BACK WITH SUBARUS",
        "It seems you will have to change the engine several times",
        "Its feels so good to have thia series back! This is so entertaining! Thanks Donut !",
        "Aw man you guys got shaftworks to help dyno but you should have had him review your video. There are a few errors you should shoot him an email",
        "They blew the motor while testing? That’s the most Subaru thing I’ve ever heard",
        "I am so immeasurably happy that im getting the OG hi lo vibe from this and it is getting me really hyped to mod my car more, it is also inspiring me and making me happy to be in the car scene. Thank you donut media love you forever and always!!!",
        "Awesome cars for the series! Love the content.",
        "I LOVE episodes like this... brings me back to the days when I had friends around that knew how to (and loved) working on cars",
        "ITS BACKKKKKK",
        "Bro I’m not even gonna lie, Nolan is an awesome driver",
        "Geeks",
        "Anyone ever asked why Nolan always gets low car?",
        "Hilarious that the subarus had problems immediately",
        "Forgot how much I love this series ",
        "From personal experience best bang for your buck just buy quality stiff coil springs and fit them to cheap coilover shocks and you’ll achieve same ride quality as expensive coilovers.",
        "i have an 07 impreza wagon and it's given me so many problems. mainly wheel bearings",
        "Glad you guys did this but you just did cheap coil overs vs overpriced cheap coil overs. Wish you had done fancy ones that had been custom built like MCS, pensky or Motons to see the real difference in having real race suspension vs off the shelf stuff.",
        "Best Hi Lo video so far. It's meticulously put together and delivers great information at the perfect rate, super engaging. Looking at the episode lengths, I think it could easily be ported from YouTube to TV if a channel is up for it, it'd be better than most car shows that currently air.",
        "Thank you, Techno, for making my childhood so much better.\n\nRest in Peace, Potato King.",
        "About 10 years ago I had put tein lowering springs on my 2007 Impreza and then swapped them with BC coilovers.  This hit close to home lol",
        "can't believe i'm saying this but years later it's still clear this is a titan of a game and an overall exemplary work of art",
        "I love how these high-lows are just getting better and better!",
        "I wish you guys would do a 1.8t build",
        "Tell me why a subi video came up after he said he blew the engine talkin about reliability ",
        "I had the max speeds on my old z they were nice for a budget build",
        "Average wrx moment, the amount of times we've helped our friend Jason rebuild his engine lol",
        "I think Nolan should get high car for once",
        "I have almost every performance mod you can think of done to my Evo, the Öhlins coilovers was the best of those mods, my favorite anyway",
        "Okay why can't Nolan get high car?",
        "It’s pronounced “TEE-IN”",
        "Man, Nolan, fuggin dark horse Nolan with the fastest lap.",
        "Lmfao I have max speeding Subaru coilovers on my Saturn and the packaging was greasy AF ",
        "I used to have TEIN Super Street for my 1996 Honda Accord.  LOL",
        "Hi low is back baby!",
        "Hey man those aren't monster truck coils they're king springs with kyb agx struts I got the same setup on my 01 2.5RS it's a great street setup",
        "Good stuff",
        "Should have driven the Hi Car first and then the Low Car. This can be bias as you have more seat time and gotten used to the track more.",
        "Man I didn’t even know you could get $300 dollar coilovers. That price just scares me.",
        "I love the editing, so well done! ",
        "I hope one day/series Nolan gets the high car and James gets the low car",
        "You boys deserve your own TV show honestly the best series I've seen in a long time",
        "WHEN DO WE GET TO SEE NOLAN HAVE THE HI CAR COME ON HE DESERVES IT",
        "With low car you should have gone with BC coilovers, which I feel is an entry level/budget coil and what would be recommended by other enthusiasts",
        "This video seemed more informative and planned out than some previous as well as still keeping the Donut humor and Linleyness was a great video and am excited for this series.",
        "I just played you guys story on forza it was sick",
        "Gotta really question the $300 price from Chinese sweatshops with no real markup or shipping. I think we're at least $1000 vs $2000",
        "Cool to see you guys doing some track driving, I got into cars through your channel a few years ago and now I'm an HPDE junkie.",
        "It would have been nice to compare the OEM and see the internal parts of the stick dampers on this. Nice to know sick baseline. Wouldn't WRX come with something better than a stock Camry?",
        "I thought they were doing a rally hi low car and I got excited",
        "As someone that owned a sti bro the amount of engines u gone through iv never related more love this channel",
        "Babe Wakeup HiLow is back",
        "how do yall not have a drone for on track footage?",
        "Idk, but last time I checked $2100/300=7",
        "I think you should adjust both preload and shock body length when adjusting ride height in order to keep compression vs. rebound travel within spec (e.g. 2/3 travel available for compression when the car sits).",
        "I actually have Max Speeding Rods on my Cobalt SS, they're definitely a big improvement over stock parts, and it's not a track car, so for what I'm doing, they're just fine!",
        "Loved the new walk through for the install process",
        "You guys really stepped up the presentation and production value. Great job",
        "That continuity at 2:10 tho…",
        "Kinda funny they boast ebay motors but have a car(from ebay motors) that blows the motor day 1 and then got sent the wrong coilovers the first time lol go ebay motors!",
        "Those kyb red struts that came off are better than the high car coilovers",
        "Bro, the biggest selection of parts, sellers, and a money-back gaurantee... IT'S EBAY! I want my signed headshot! Donut doesn't seem like the false advertising type, right?",
        "i had the same cheap coils on my impreza, and had it slammed to the ground. they were pretty nice till they blew up, but to be fair i did jump that car and beat the shit out of in every way imaginable",
        "Bout the broken engine.,... bet you revvd it off a cold start. ;P",
        "Smant: *Trying to navigate a very difficult battle with a legendary\nShady: \"I took out a Jigglypuff and for some reason I'm very proud about that\"",
        "Every flying/levitating Pokmon needs two animations. One for when its in the air, and one for when smack down or gravity has been used and its forced to sit on the ground. It drives me nuts that there isnt. Even in Gen 3, it drove me nuts that there was a shadow until some Pokmon as if they float, but they are still hit by ground moves. Imagine levitate being a visible ability. Like, if Bronzong didnt have levitate, its animation sat on the ground. That would be such a huge improvement",
        "The older I get the more I see the validity of stereotypes. I've owned one Subaru Outback. And yes the f*** popped the motor inside 3 months of daily driving. Not even hooning.",
        "Great editing in this vid. Give that man a raise.",
        "SHouldn't time car against car, but car pre vs post improvement and see who had biggest gain/loss",
        "It always makes me sad when they get new cars because before they touch anything it’s cleaner than mine make the job look so easy with lifts and great tools when everything comes apart easily and isn’t  rusted together",
        "from watching james sit in no lighting telling us abt the history of cars and car companies back the day to watching the guys getting sponsored by ebday motors now, its just so awesome and great journey man, congrats to the whole donut media team for making it",
        "\"If you're gonna go off track, you're gonna wanna do it in your friends car.\"  - Words to live by.",
        "I feel much better about myself after hearing Donut also be terrified of the blind crest at Streets. That corner’s scary as hell.",
        "Finally i liked this channel and was wondering if it would ever come back.",
        "Y’all got Subaru’s and aren’t doing a rally build ",
        "Something tells me I could have a lot of fun with that Coilover tester.",
        "I guess I’m getting $300 coilovers",
        "lol i got the 300 ones",
        "Ethan and Simon sniggering and laughing together like two naughty kids at the back of the class is my favourite part of this video. I love how you can put any two of the Sidemen together and theyre just instantly hilarious because theyre all genuinely such good friends. 8-) :P",
        "14:40 THIS IS EXACTLY WHY YOU DON'T BUY A FUCKING SUBARU!",
        "Tein are absolute overpriced garbage shoulda got ohlins or something for high car  tein are basixsly racelands",
        "So glad Aaron is gone",
        "Your track time will always be slower due to the weight of an extra passenger, you guys should run solo for everyone to make it fair",
        "I love this series. But it would have been cool if you'd have done the analysis on the OEM shocks/struts too, so we could see the overall difference.",
        "I feel like the series came back with a fresh new coat of paint! I'm excited to see what my favourite brand can show in quality at different price points!",
        "Like hi low all over again.",
        "super supportive of this new Hi-Lo series as I have one of these cars, gonna be great!",
        "The editing on this one won’t go unnoticed. Awesome work!",
        "I believe not everyone has a huge chunk of money to get performance suspension there's gotta be a set that's a good price that you can get by on without breaking the bank",
        "Man, Nolan is getting to be a pretty serious driver with those times",
        "This eppy was hilarious  Stoked for this new season of high low. Lets see how many engines they need to buy by the end of it ",
        "Dead engine in the first episode. Real subaru things.",
        ":)",
        "MAN WHY THESE CARS!!! Dude you guys could have got EVOS! Man:(",
        "What I took away from this video after watching all the drama with the Hi car sometimes it's better to cheap out or leave certain things alone... \n   I was looking at BC Coilover's for my Nissan Juke. I just did new Control Arms/Ball Joints, and I am on a set of PCS cheap loaded front coilover's that are supposed to match the stock, but they ended up being better than stock, and it's a Mcpherson strut too so I guess I got lucky with them.. They go for like $1200 but they can sometime be found for under a $1000 on sale.. I never went with them though it's a Juke.. I changed out the exhaust and inner cooler piping, did a nice lower front mount Mishimoto innercooler and had her Dyno tuned.. I dumped all I'm going to dump into her.. ",
        "I ASKED FOR THE WRX FOR THE NEXT SEASON IM SOOOO HAPPY ",
        "You guys should do a high and low for 1976 Beetle Volkswagen With an engine swap to make them faster",
        "Not gonna lie. I've got a bet pool going on how many engines you guys will go through on these Subies before this video series is over. Thanks for the cool content, and the money it takes to keep these things on track.",
        "You guys are so funny. You have a good thing going here with this channel.",
        "I'm blown away how well the low coilovers did I expected them to perform worse than they did.  That being said if I were to buy one, tein would be my choice cause of their customer support.",
        "Ahhhh the good old Maxbendingrods",
        "I just wish you would separate the series by project car",
        "Daaaaamn Nolan driving by himself?! Brings a tear to my eye of the growth",
        "\"if you're gonna go off track you're gonna wanna do it in your friends car\".  Words of wisdom from James",
        "i seriously am stumped by the Jobe and Jobe shot. the reflections are in the car in the background do no green screen, and no split screen(that i can see) that was a fantastic shot, great job whoever was involved in that",
        "Didn’t know y’all were going to be on Forza till I was playing yesterday waiting for COD to update. Was awesome having y’all in there",
        "I use their rods in my Volvo no issues yet and it's seen the upper limits of a hx40 Ill be giving the coilovers a go soon",
        "So glad HiLow is back but I’d be lying if I said I didn’t miss Aaron on these",
        "Hi Lo is back!!",
        "great video. very entertaining and kept you interested the whole time. good job guys",
        "Nolan should of got  the more expensive parts this time round",
        "I saw this new season pop up a few days ago...\n...then I saw the \"So we blew up the WRX...\" video get uploaded.  \nHonestly, I wasn't surprised, haha.",
        "Are they copying Driven Media?",
        "Bro you guys got ripped off I bought those same ones off eBay for $200",
        "Old video reupload",
        "Sweet",
        "Missing my B2B and Up to Speed. More of this content please!!",
        "The red text on green background for hi car is really hard to read",
        "Umm where is Erin?",
        "This was great ",
        "Low car seems to be a much better trim, has the real leather limited heated seats, sun roof, etc...",
        "Nolan's lap time is genuinely impressive, pro driver only going 1 second faster. Never knew he was so fast, respect.\nEdit: must work on consistency though haha",
        "Nolan is always so positive, he's a gem.",
        "It blew up  Now you guys know our Subaru owner pain  So sick but unreliable sometimes for no reason lol, I have an 04 sti as a daily and has put 80k miles on it",
        "I'm so happy this series is back. and the visual comedy is the best it's ever been!!",
        "Didn't know knolan was a good driver",
        "You all are making me miss my Hawkeye so bad right now. I should have never sold it.",
        "6*300=2100. That new math.",
        "Love hi low. Can't wait to see what cars y'all do in the future",
        "Stance coilovers with inverted monotubes is alot better then ebay garbage,  and still better then Tein....but cost less then Tein",
        "How do you become a \"proffesional driver\"? Like do you get a degree or wut?",
        "WE'RE BACK BABYYYYY!!!!!",
        "love these videos give me extra info on which parts I should get my car and 100% of the time I like the options  ",
        "no credit card debt vs credit card debt. Your welcome, saved you from watchign this video",
        "Awesome series, would have been great to have them switch the teams up, or have the last seasons high team be the low team and vice versa.",
        "Just Subarus being Subarus.  Is there a way to make a Subaru not blow up?",
        "I had cheap Maxxpeading coilovers on an E36 I had.  Im pretty sure they are full of Canola oil.  They were ok for the money but the ride was pretty harsh.",
        "I installed Revelle coilovers (made by Tein) on my Civic and couldn’t be happier. They have 32-way adjustable dampers by simply turning a knob on the top. I probably have them set slightly too firm at the center but I just watch where I drive.",
        "Oh the fun part about subarus",
        "Where is the Hi Low intro? Where are all the intros for that matter?",
        "Editor needs a raise.",
        "You guys should do a civic HiLow series",
        "THE LONG AWAITED RETURN OF HILOW🥹️",
        "We need drag cars after these WRX's",
        "Lol it blew up what a surprise Subaru wrx was the worst car I’ve ever owned ten fold and a lot of my friends had constant issues them hate Subaru with a passion",
        "When did hi lo start?! If I’m not in the underground I’m screwed?",
        "I missed a bit of introduction episode for this - like, testing the stock cars, blowing up the engine and so. Also, it is not clear for me who is on which team this time  different but I like it!",
        "Why cant you guys ever let nolan have the hi car",
        "Finally some older style donut content. Ive missed this so much.",
        "Why do you guys keep mispronouncing Tein?",
        "What were the times when they were stock??",
        "KW version 3 ,you can have it all.",
        "Next gt86/ brz please ",
        "Pronounced “Tay- een”",
        "The coils didn't fit the knuckles cause you bought STi coilovers and not WRX stuff.",
        "Nolan, the track professional.",
        "Love this series, one of the absolute best automotive series out there.",
        "Love seeing everyone at donut improving their skills from the mechanics to how the videos are produced and edited",
        "Gotta get Jerry on the track next time, in his Camaro too",
        "Japanese cars are literal shit. It's years that i say this, and this is just abother example lol",
        "Tee in.",
        "2100/300 = 6 ?\nLOL",
        "Next video: full brake and suspension change",
        "It wouldn't be a WRX video without an engine blowing and coolant spilling everywhere in the first season - lol - I have an EJ25 on a stand in my basement right now after some similar shit...",
        "I never though I needed a \"shock dyno\" until I saw that shit in action - gaw damn 3:12",
        "Boooooring. It would be nice to see James take the lo car for once...",
        "this video seems very similar to Driven Medias video series",
        "i like the small editing details and transitions, nice",
        "Hi Lo is back!\nthis is by far my favorite series on this channel, can't wait to see what you do to these subies",
        "I love how they bought Alibaba coilovers and not the usual ebay coilovers even though there the same\neBay didn't want that on the record",
        "the next series with a new car give Nolan the high car",
        "Bro, the CPR slaps ",
        "is that a new high low?",
        "I love this generation of subarus. The Ej253 is kind of a biotch though they cost alot and like to eat bearings",
        "How long until the maxpeedingrods ones fail",
        "When u have a subie and  just fitted maxpeedin rod coilovers and this video pops up on your feed...",
        "Good to have the best seried once again! Also good to see that hicar is already busting it's engine lmao",
        "Next video : new rims",
        "new hi vs lo with my favorite car",
        "What a surprise a blown subi.",
        "Are yall going to install the motorcycle turbo from wish",
        "You guys' production quality is noticably improving, I really enjoyed watching this. PUMPED for hi/lo to be back. You guys really cover it all in these series, and they're very enjoyable to watch. I have learned a lot from this series!",
        "Classic Subaru",
        "Love that youre doing High Low Finally with WRXs \n\nIts funny that High car is a base model But low car is the limited and decked out model ",
        "We can really see how much the channel grow. The editing is just beautiful.",
        "that timing of vik hearing their plan was so elite lol",
        "I love how they compare the cheap to the more expensive parts for cars. \nDonut: can yall fix my 97 subbi 2.2L EJ 22. Head gasket.",
        "Next time, HiLow Deloreans.\nOr maybe gen 1 Ford Focus SEs...those are just a little easier to come by after all, and the hatchback Focus has already been done to death.",
        "Jeez these cars are so unreliable ",
        "Should've done the delete",
        "This season with these cars is feeling great! Super entertaining. Would be fun to see the donut team tackling some real team racing maybe time attack or something.",
        "9:26 gotta love those subarea’s and their reliability ",
        "The KYBs w/King Springs on low car are waaaaay better",
        "Did Joe go off-tack in the Hi-car lap?",
        "The thoughtfulness of the edits point to a care for us and I appreciate it!",
        "The best series returns",
        "I have a set of the maxspeeding coilovers on my ek. It is not a track car, but a daily driver. I Have about 5-6k's on them after about 2 year. I have had no issues with them and for the money they even have a fairly decent ride.",
        "So happy to have this series again can't wait to see what's up next in the following videos",
        "To see Nolan improving so much and getting so comfortable driving on the track is awesome. Love everyone's energy and for bringing hi-low back!",
        "I'd love to see them ad a Mod section to high low, like adding a third car with BC coil overs or Fortune auto bit I get it. It would be a ton more work and money!",
        "There's my big and strong Donut boys playing with Subaru's. ",
        "Hi Low is back! <3",
        "Love wrx, the trouble yall having is making me paranoid about mine. Nolan can drive !",
        "Donut : Yeah it's easy!\n\nRusted nut : I got other ideas......",
        "ebay motors sent me a broken vehicle speed sensor for my 1991 Acura legend i will admit it works more often than the old one but it still just stops sometimes very upset ️",
        "Wouldn't it be fairer, and cheaper, to just swap the shocks on the same car? Preferably not the blue one! ",
        "\"while you are enjoying turkey, Amio is eating shit\" Charlie is a man of wise words, a true poetic mad lad of our times",
        "This is peak Donut. Great video filled with useful information, hands on wrenching, and humor. This is great. Thanks.",
        "Been contemplating purchasing a Hawkeye you guys getting them is a sign",
        "Thank you for making real content again instead of bullshit reaction video obnoxiousness. Damn I missed HiLow.",
        "This episode is basically James being cursed for always giving Nolan the low cars",
        "pronounced (tee in)",
        "we jus gone ignore 0:17 liker it aint happen?",
        "You killed him ",
        "I think James is GAY",
        "So happy to have this series back again! Always been a favorite, and it feels like the production quality has stepped up even higher. Looking forward to the next one :)",
        "Cars are stupid. Invest into a piece of this earth..",
        "I wanna see y’all put “low” car parts that are determined to be acceptable compared to “high” car parts, onto “high” car.  This will further support that the “low” car parts will still work well and provide similar results to the overall build.",
        "They upped the budget by so much dude what the hell. It's phenomenal!",
        "Doing comparison this way isnt very accurate as the cars have 15+ years and the engine wear could be different you should mount both sets of coilovers onto same car and measure lap time.",
        "FFS  Preload isn't a thing... you just adjust the spring to not get loose while the damper fully decompressed... the spring rate is always the same, no matter how much the spring is compressed while the damper ison full length",
        "I love you guys chose subarus for the next hi low car",
        "I find a comical that low car  is the higher more desirable trim",
        "Hilow?",
        "new next video unequal length headers",
        "So stoked for more Hi-Low. And just another day with a Subaru boxer. ",
        "rest in peace techno. these videos still bring me so much comfort, thank you for everything you did for the community",
        "That Jobe split shot taking out the strut tower was cool as heck. Fantastic job editors!!",
        "Is this a new hi lo????",
        "I mean being a junior in high school and driving a kinda build 96 4runner at least at my school no one has a wrx just the lame ass lowered trucks smh",
        "The fact they’re doing WRX’s means they’re gonna be fixing them all season",
        ":Buys parts from Alibaba \n:Shoots a commercial for Ebay....",
        "A bunch of guys who like cars who don’t know how cars work I respect that",
        "Let's gooo rally time high vs low been waiting since they do the Toyota Tacoma",
        "Will forever love hi - low",
        "The bigger question is: how did you guys manage to get 2 non modified and clean Imprezas?",
        "How about Nolan on team high next time? Make James live like a proletariat.",
        "Nolan is getting pretty good. Good job bro",
        "and probably the reason the tein didn't fit was because they're meant for the sti bolt holes have more separation at the front than the wrx",
        "No ohlins? Chhhheeeaaaappp",
        "I love this new style of High Low. You got the explanation of the parts with Nolan and James. You got the details of the install and specific details with Jobe You got the tear do",
        "Both coilover damping adjusters control both compression & rebound together",
        "Man maybe hi-car wasn't as hi as we thought.",
        "Best comparison ever! \nLogical price means better. Always!\nSorry guys but  \n( 2:20 ) best way to save someone by slaping!",
        "$300 x 6 = $1800. At least it did when I went to school. That common core math probably screwed things up.",
        "300 x 6 = 2100 ?",
        "I'm really confused, did I miss a video introducing the cars and this season of hi-low? For the first bit of this video I wasn't sure if this was actually hi-low or not. With that said, great to have it back for another season! Can't wait!",
        "their trying so hard to bring it back but it just doesnt have the same feel, hopefully this time its gonna be good",
        "So expensive ones are great for a track and the cheap ones are just fine for a commuter car that you want to look better",
        "There are two things that kill Subaru engines; oil and greed \n\nThese cars are going to bankrupt the channel, turn back before it’s too late!!",
        "Fun stream as always",
        "I feel like james has unlocked reverse aging, i swear he gets younger looking every year",
        "Pretty embarrassing that Nolan is faster than the professional drifter ",
        "Zack helping himself remove the coil over was dope editing ",
        "Mad props on the epic animations. Has anyone noticed how great the editing is in the videos? Superb content...",
        "hey look it's not a list reaction video, hurray for real content!",
        "Blown engine? Subaru? Nothing new.",
        "you already did this same video.",
        "Maxspeedingrod like ISC ",
        "The tein shocks I installed on my AE86 still work as perfectly as the day I installed them.  And they were 2200 bucks in 2005. So if you can get them for about the same price now that's an absolute steal for tein quality",
        "I don't think I've ever seen a wrx sedan from America. They're always wagons or STI's",
        "I love this so much , also next video do what I just did , new master cylinder Lofl",
        "Shout out to the production this season. It's on point.",
        "Turbo diesel creep here i’m",
        "Definitely check out cylinder 4 cooling mods unless you want another cylinder to leave during mid chat and possible blast plates for those five speed cases lol. Glad to see another season of hi/low",
        "It would be badass if yall did a hi-lo motorcycle series",
        "Were each car on the same tire type for this test?",
        "Nolan is turning into a legit driver!",
        "I like japanese cars, but the subaru's boxer motor will cause a lot of difficulties :D",
        "They should switch the teams so Nolan has high car and James has low car.",
        "Hahaha no way. How embarrassing.",
        "Repent to Jesus Christ “Every good and perfect gift is from above, coming down from the Father of the heavenly lights, who does not change like shifting shadows.”\n‭‭James‬ ‭1‬:‭17‬ ‭NIV‬‬\nU",
        "Its crazy to see how much Nolan is growing! Whether behind the wheel or under the hood he is killin it!",
        "Hi Low is such a good series ",
        "The 'assistant' Jimmy looks like Pierre Gasly's little brother.",
        "As an owner of cheap coilovers that made my car feel like I bolted the wheels right to the body... yes, more is better in this case ",
        "Isn't it pronounced tea-in?",
        "is this the first video of subaru hilow?",
        "Identical more like Identicool!",
        "I need one them shock dinos totally for a friend",
        "does this mean that i shouldnt get the max speedingrods? cause i was thinking about getting them for my lancer but i dont have 2100 dollars just sitting around?",
        "Since the hi car engine is already blew up, why don't you check Ben's STI build from Gears and Gasoline. Maybe you can take some notes or idea about that engine.",
        "Pls more jimmy content",
        "The thing that seems left out here is tuning the suspension the have settings for a reason.",
        "did no one else notice the person passed put ",
        "Nothig can't beat nolan's first engine start up.That was amazing and really motivational and uplifting.",
        "This is the greatest series on YouTube",
        "The fact that I knew exactly why the Teins didn’t work just means I need to work on something else ",
        "Bro James is a menace",
        "YES, a new Hi vs Low!",
        "James is the only one that knows how to pronounce Tein correctly ",
        "Wait a minute, is Nolan a fast driver!?\nAlso, I approve of these new cars",
        "Can you guys work on a COOL Japanese car like a Honda or Acura?!",
        "Next time go with a 2019+ sti shortblock",
        "Where can you get a shock dyno?….. asking for a friend ",
        "2100 still seems low for a high end suspension when compared to high end 2 and 3 way shocks from penske and AST can you compare to a set of thoes?",
        "Im happy you guys brought this series back! Especially with some Subies ",
        "1:18 Already shows the new rims on the Low Car lol",
        "I watched their video every morning",
        "Great video boiz",
        "I’ve been watching you guys for a while now. This video is up there with the best. Production and direction as always been great. But this is a step up. Obviously some change",
        "man this is great shit, thanks for doing this.. you guys are hanging with your bros doing what you like making money and also being informative.. this is the future of media and entertainment. You guys, Jomboy Media does the same shit for baseball, and Red letter Media guys do that shit for movies and tv shows. You guys are the future. Thank you for posting.",
        "That fart sound in the beginning , I'm sorry I'm immature for 43, but that was funny",
        "Please use the same tires on both cars or there’s no point to the rest of the series",
        "i always called the tea-en. who knows how its meant to be said. we know they make quality parts.",
        "If your looking for someone to donate those stock shocks to I need some lol",
        "Petition to add a \"Mid\" in High Low.",
        "James should do a competition between cheap and expensive sunscreen."
    ],
    "comments_disabled": false
}