{"video_id": "ta_O63tJ4nE", "comments": ["I feels so good having this series back with new cars", "from watching james sit in no lighting telling us abt the history of cars and car companies back the day to watching the guys getting sponsored by ebday motors now, its just so awesome and great journey man, congrats to the whole donut media team for making it", "To see Nolan improving so much and getting so comfortable driving on the track is awesome. Love everyone's energy and for bringing hi-low back!", "The Directing and Editing on this video has been insane. I'd love to see more of the continuity and creativity! Good job Donut!", "Nolan is the definition of a car guy that has gone from 0 to hero. He’s really come such a long way mechanically & as a driver", "Nolan's lap time is genuinely impressive, pro driver only going 1 second faster. Never knew he was so fast, respect.\nEdit: must work on consistency though haha", "can we take the time to appreciate how good of a driver our boy Nolan is ?", "You guys have no idea how happy I am to see this series back WITH FREAKING SOOBS!️ can’t wait for the merch!", "Nolan is always so positive, he's a gem.", "Love watching you guys build because you actually educate and make it super fun so you don't have to be a car expert to understand the video. Can't wait to see how these cars turn out.", "You boys deserve your own TV show honestly the best series I've seen in a long time", "Sooo sooo SOOO EXCITED FOR A NEW SEASON OF HI LOW!!! Guys y'all are so much more knowledgeable and experienced since the 350z days. Impressed how y'all grown in this industry since the OG days. Even the quality and editing of videos is better. Thank y'all for doing another season ", "I love this new style of High Low.\n\nYou got the explanation of the parts with Nolan and James.", "Love seeing all the hosts involved in this. This Hi-Lo series MIGHT be Donut at their best. As a Donut OG, this is beautiful to see.", "Love how this episode has everyone doing what they do best, Jobe explaining how to get things installed, Nolan and James looking good for the camera and Jerry explaining the sciency stuff", "I’ve been watching you guys for a while now. This video is up there with the best. Production and direction as always been great. But this is a step up. Obviously some changes to the production team. Kudos.", "Love Hi Lo series n couldnt be more happier they are doing wrx's! I just dropped 9k into my 05 FXTs engine bay, from an iag closed deck shorty to grimmspeed lightweight crank pulley theres soo much you guys can do here, can't wait for next episode.", "So excited to have this series back, it’s the reason I got into cars", "Gotta say I’m always impressed by Nolan’s skills. He’s not a profesional but he managed to do an awesome lap time", "We can really see how much the channel grow. The editing is just beautiful.", "The quality of this video is immense, you guys must have put so much work into it. The visuals showing what you’re talking about especially are just really well done. Can’t wa", "Its crazy to see how much Nolan is growing! Whether behind the wheel or under the hood he is killin it!", "So happy to have this series back again! Always been a favorite, and it feels like the production quality has stepped up even higher. Looking forward to the next one :)", "Best Hi Lo video so far. It's meticulously put together and delivers great information at the perfect rate, super engaging. Looking at the episode lengths, I think it could easily be ported from YouTube to TV if a channel is up for it, it'd be better than most car shows that currently air.", "Hi-Lo is back and I am really excited to see what you guys do with them!\nEdit: good god you guys didn't have to like my post this much and what is the reply section?", "Loving the content, clear improvement every season. Just wish you guys did more laps on the track.", "Can we just take a moment to appreciate Corys hardworking and appreciate him uploading this frequently", "I'm so happy this series is back. and the visual comedy is the best it's ever been!!", "Thanks for bringing back another season of Hi Lo….love this series!", "I would HIGHLY recommend doing an oil pan upgrade. Wrx pans are known for starving in long corners, you can get an sti pan or a baffle kit, but that's probably what toasted the old motor. Do not get sticky tires before upgrading oiling", "The production and entertainment value has massively evolved from season to season. Love to see the progression!", "I was just thinking about how awesome HighLow is and how it’s probably really hard to find two exact cars in the same state of use/wear - and then you said you blew up the engine!  Love it!", "I'm blown away how well the low coilovers did I expected them to perform worse than they did.  That being said if I were to buy one, tein would be my choice cause of their customer support.", "Good fkin' show! I had so much fun watching you guys. It is awesome you involve the whole team with Jerry digging in the parts! And explaining everything nicely and thoroughly. You improved the already stellar Hi-Low series! Good job!", "That Jobe split shot taking out the strut tower was cool as heck. Fantastic job editors!!", "I forgot how much I've missed HiLow. One of the best series on Youtube.", "I love that Nolan had the fastest lap times, so proud of him", "Huge level up on quality guys, really well done, looking forward to the rest of the series!", "You guys are always taking it up a notch, great episode", "This series just gets better and better. Great stuff ", "Absolutely love these builds I think this is a very realistic build series most people who want to get into cars end up wanting a wrx or sti! I have a 2020 sti and love it", "Production looks to be stepped up.  Thanks for the content guy!!", "So happy to have this series again can't wait to see what's up next in the following videos", "I feel much better about myself after hearing Donut also be terrified of the blind crest at Streets. That corner’s scary as hell.", "This guys are slowly but steadily generating a (classic) top gear vibe with their interactions between themselves. Congrats", "Hoping to see a transmission episode maybe sti trans vs forged 5spd gears?! Sway bars would be another great one for handling and there are plenty of high-low options there. Great content as always guys!", "I hope ya have more of shop daddy in these series.   Awesome having a racing driver to set a baseline.  Wicked mechanic to.    Will be good viewing seeing Nolan trying to be as good a shop day on track. Haha", "I LOVE episodes like this... brings me back to the days when I had friends around that knew how to (and loved) working on cars", "Skeppy, you have been avenged just shows the close relationship they share and how wholesome they are to each other hurt because of other videos and how close they seem and u can see the pure joy and happiness in their voices and actions", "I think you should adjust both preload and shock body length when adjusting ride height in order to keep compression vs. rebound travel within spec (e.g. 2/3 travel available for compression when the car sits).", "You guys are showing  lot of advancement with your segment editing an overall flow of the show. Donut has always been good at teaching with a simplified style of explaining ting, without skipping too many important details. Now I can tell that the rhythm of the episode's progression is evolving to resemble a classic television show.  You guys are ABSOLUTELY murdering the production value and presentation!  VERY QUALITY... I love you", "im loving the new system of the hilow season and how it works, it seems a lot more fair than the last season that makes it so much better", "I actually have Max Speeding Rods on my Cobalt SS, they're definitely a big improvement over stock parts, and it's not a track car, so for what I'm doing, they're just fine!", "Love this series, one of the absolute best automotive series out there.", "Cool to see you guys doing some track driving, I got into cars through your channel a few years ago and now I'm an HPDE junkie.", "This video seemed more informative and planned out than some previous as well as still keeping the Donut humor and Linleyness was a great video and am excited for this series.", "Never get rid of High vs Low. This series is by far my favorite car series on YouTube", "I can't wait to see engine swaps and paint jobs for these cars. I'm very curious about how this low car is gonna be painted compared to how the last one was.", "Thank you, Techno, for making my childhood so much better.\n\nRest in Peace, Potato King.", "Wow..!  It's great to see that first episode of second High Low series is on trending ", "I've tried this combo in Assetto Corsa, didnt have a stock Hawkeye mod but used a Bugeye STi on street tires instead and got 1:31.13, actually pretty impressive how nolan was just a second off Adams pace in low car and then managed to beat him in high car", "that timing of vik hearing their plan was so elite lol", "Zack helping himself remove the coil over was dope editing ", "God this series will never get old", "Defintley like the comparison but it would be interesting to see like the super cheap option, a budget but like bang for your buck set, and the high end ones. Cheap ones can be complete garbage but mid range options from reputable brands are usually very good quality and can hold a flame to the high end comparison. This seems to hold true for way more than you might think and a series like this is perfect to figure that out ", "I love the Hi Lo series, but I do think a Mid car would be interesting. Like with coilovers it would of been very interesting to throw a mid level coilover like BCs into the mix. I think most of us kinda know the mid level parts are usually the best price to performance level.", "Man, Nolan is getting to be a pretty serious driver with those times", "I love this new style of High Low. You got the explanation of the parts with Nolan and James. You got the details of the install and specific details with Jobe You got the tear do", "I'm about 2:15 into this episode, and this is notably leveled up. The editors must have worked overtime! Loved the detail of the boxes exploding away to the posed coilovers on the table. That smooth time lapse of Jobe explaining the install while he does it was incredible! And tossing the coilover gag with the victim behind, perfect.", "Can’t wait for the engine upgrade episodes️", "Jesus, yall got something great here. I've been watching car shows for literally over 30 years and this show even after only 5 minutes I connected to like that once in a lifetime feeling ya know! This show, the guys the excitement of it WOW!", "The thoughtfulness of the edits point to a care for us and I appreciate it!", "Charlie acting like he's gonna get an F rank knowing full well all 10 million possible futures then pretending to be surprised when he gets an S rank just to finally reveal he was the chosen one sent chills down my spine. Definitely my favorite part of the saga. B)", "Being a GradeA suspension mechanic and building shocks for a living (also building the camera boom for the matrix), coil overs offer alot as you found out, the nm forces for each vehicle they are suited to are rated from standard to sport, that combined with linear shock force is what is going to keep your wheels on the ground, without getting into the math nd nm forces required, a track vehicle will set up completely different to a road car and the forces of the suspension reflect that, good job on the video.", "Love seeing everyone at donut improving their skills from the mechanics to how the videos are produced and edited", "That one shot of Zack explaining coilover stuff while also installing it behind himself was beautiful. Also as a Subaru owner I'm embarrassed that a motor blew literally in the first episode lmfao but the stock tunes on 07's were especially awful. I'm not sure about 06's but the 07's would delay swapping between open and closed loop fueling on wot to eek out some better emissions numbers cause the ej255 was failing new requirements at the time. From what I've read pretty much every 07 WRX that was left stock blew up. I had one and it was blown when I bought it lol. I have a bugeye now and the ej20 despite being older seems to have an easier time not committing automotive seppuku", "This series literally couldn't have dropped at a better time, I'm currently pulling an ej255 from a totalled out Baja to shove in an old 04 outback to do irresponsible things with it!", "That shot at 1:48 of Jobe explaining the work simultaneous to timlapsed Jobe doing the work is really good.", "I daily MaxPeedingRods in my 99 Mirage (CE series Hatchback) and aside from being a little bouncy I've found them to be excellent", "Nolan is driving incredible well, nice to see!", "Production levels and overall quality of the videos just keeps getting better and better, you guys are killing it", "I really like how you spent the extra time and effort to go into detail about assembly quality, settings, types, and other details of the new components.", "This makes me want to get back into putting parts on my car. Just wish there were more options for it. It’s really slim aftermarket for an 09-13 Toyota Matrix XRS.", "props to Nolan for getting such a great lap time!", "The cinematographer and story boarding are really good in this episode.", "Could you test lowering springs one day? Some people get lowering springs instead of full suspension just to give the car a nicer look. But you never hear about the performance. Would be interesting to see if just the springs can improve the handling of a car.", "Next video: New head gaskets", "Hi Low is such a good series ", "love these videos give me extra info on which parts I should get my car and 100% of the time I like the options  ", "I will say the production value of this video is fantastic. Not that previous High/Low was bad, but this is a huge step forward.", "Honestly didn’t think we’d see a blown engine so early in the new series ", "Subies do as subies do  love seeing hi-lo back on the channel! And I like the choice of vehicle! Even if it does mean a lot of repairs…", "Proud of Nolan, if I remember right he used to be not super confident in his driving overall but he was out there laying down some of the best track times .", "I've got Tein Mono's on my Lexus IS-F and couldn't fault them, they're fantastic, would have been good to see you use them with the EDFC PRO to show their full potential", "So glad HiLow is back but I’d be lying if I said I didn’t miss Aaron on these", "Production on this video is so damn good. Such an informative video. Fantastic!", "Love the editing and production of the video ", "great video. very entertaining and kept you interested the whole time. good job guys", "You guys did flawlessly with this video.   the editing bringing all the ideas together. Using the full team's perspective to ensure the idea of why you'd wanna do this replacement yourself. And just how well you have all grown so naturally into your position. If every video has this quality of personal touch,  this will be the best season hi-lo has ever seen", "I've had my own Maxspeedingsrods for aver a year now and the difference is huge vs stock. Very stiff at first and now they feel slightly softer."]}