{
    "video_id": "TfaMLqEh1qM",
    "comments": [
        "If we all tried to be a little more like Brendan, the world would improve tenfold overnight.",
        "Have a soft spot for this dude. He was a big brother to so many of us.",
        "I can say that Brendan is one of the men that formed what my ideal man looks like. I can't remember how many times I have watched The Mummy when I was young - and I still do. He was such a stud then. It's also good to know that he has a great heart. I wish you nothing but happiness and success, Brendan!! ️️️",
        "We must protect this man at all costs.",
        "It's awesome how much the internet loves Brendan Fraser. Dude just emits good vibes and makes you wanna smile. I'm glad he's back at it and making movies again. His range and talent are insane.",
        "god I miss this guy!!!",
        "One of his underrated films I love is Inkheart.",
        "He seems like such a good dude.",
        "As a kid growing up, The Mummy was such an amazing movie; I don't think anyone else could have played Rick other then Brendan Fraser.",
        "I just want to step back and admire how kind, compassionate, thoughtful, and praising this man is of his peers, and how genuine and authentic he comes across, with no ego. I’m glad he’s getting to have another moment, it seems few deserve it more than he.",
        "He was smoking hot in this!!  I love him in Bedazzled the most!",
        "This interview made me love Brendan Fraser even more. I hate going to movie theateres, but will go to theater to watch any movie he is in.",
        "Fire",
        "MIss this actor",
        "His John Cleese is pretty incredible.",
        "Wow HE HAS NOT AGED WELL!!!",
        "Brendan Fraser deserves all the love with his comeback!",
        "Mummy 1 and 2 were one of my favorite childhood films, seen them probably as many times as Harry Potter or LOTHR, so huge respect to Brandon, hope to see more of him in the future",
        "\"I know not all that may be coming, but be it what it will, I'll go to it laughing.\" What a wonderful way to summarize Brendan's career, and his recent Renaissance. He is such a humble, kind, talented man, and I can't wait to see what he does next. Welcome back, Brendan; cinema wasn't the same without you.",
        "The Mummy movies were surprisingly good. Funny, making fun of themselves. Romance, drama, horror, thriller, all in one.",
        "His John Cleese impersonation is brilliant, such a humble guy!",
        "What can I say? Feeling how the blisters on my torso began to shrink within 3 days was very soothing, I applied what I talked about the other day and in two weeks the pain was gone. I just go’ogled Kaena Ramingler’s Shingles Solution and now I feel as smooth and relaxed as I've ever been.",
        "This man is such a beautiful soul, he's so kind. Can't wait to see him again in this and any future projects (in or out of movies) cause you know he will pour he's heart in it.",
        "What a sweetheart. With a surprisingly solid John Cleese impersonation.",
        "Love the dog in that shot of Encino Man getting clocked with the rake:  \"You okay, pal?\"",
        "George of the Jungle and the first Mummy movie are 2 of my favorite films, largely because of Brendan Fraser and the charm of his characters. Something so special about how the films balanced  humor, adventure, and just pure fun.",
        "I have so much love and respect for this man! He's simply an amazing, wonderful human being",
        "The person that assaulted Brendan, and the depressed person he became because of it, could never erase the impact he had on our lives and the core memories he was attached to in all of us. Nor could his personality and relatability. Nothing could erase nor take away the actor he has always been and has yet to become. Im so grateful for his “return”. He could never begin to imagine the icon that he is to so many of us.",
        "With Honors belongs on this list. It struck a solid chord with me as a teenager. Growing up in an environment where you were constantly told the only thing that matters is how far ahead you get \"for your future\", i.e. grades and earning power. This movie gave me validation that the main things that matter are following your inner voice, letting yourself be guided by the right voices, and kindness. And I started reading Walt Whitman after watching this movie. Monty's journey was my journey as a young almost-adult. And Fraser nailed it.",
        "would be awesome to se him enter in a good shape to play another The Mummy",
        "I don't think there's a single movie Brendan has done that I haven't liked. Grew up with School Ties, and The Mummy fueled my love for Mythology and historical aspects.",
        "He is amazing, good to see him back.",
        "What a phenomenal person; so humble, kind & passionate. I’m truly happy for him in his recent resurgence. The Mummy franchise was so important to me as a kid & Bedazzled is still one of my favorite comedies. Cannot wait for The Whale!",
        "Brendan pretty much nailed John Cleese off the cuff! ",
        "His best movie has to be Airheads",
        "I worked with Brendan as an art department production assistant on Monkeybone. We talked about the Mummy mostly and what he hoped to achieve as his character Stu Miley in Monkeybone. While it's a cult classic (finally), his range in that crazy flick is most impressive. What a great and very approachable gentleman who happens to be a fine actor.",
        "I love this guy.",
        "What a sweet man!",
        "This is one of the best interviews I’ve ever seen. He speaks highly about everyone involved, his interpretation of the characters and scenes, and he is such a humble human being.",
        "“Oh! Your strength gives me strength”  and with the full strength, He takes part in the Olympics Marathon single race.",
        "What a lovely man, I would love to have a sit down conversation with this guy, so articulate and down to earth",
        "He looks like a truly good hearted person. I would love another movie of The Mummy franchise with the original cast",
        "This is legit the best interview I’ve seen in 20 years by far!",
        "The last genuine celebrity, don’t take it for granted people because we won’t get anymore",
        "Seeing the amount of love and appreciation Brendan’s been receiving since his comeback makes my heart so happy!!️ He was such a huge part of most of our childhoods and deserves nothing but love️",
        "This man is a freakin' delight <3",
        "Monkeybone deserved better than to get left out of this.",
        "Rock on Brendan!",
        "I think one of the most clever things they did to show that Kratos isn't dumb is the riddle topic in GoWR. He gets riddles, he just finds no enjoyment in them. It was a great little piece. :-P",
        "This man needs to know how much he means to us. Definitely honored being raised to his movies. The Mummy Trilogy, George of The Jungle, Journey to the center, and even looney tunes! Such a legend",
        "The Mummy (1999) is still one of my favorite movies of all time. I've rewatched it a thousand times and I'm still not tired of it.\n\nAnd I'd be lying if I said Brendan wasn't one of the main things that made the movie so iconic. Protect this man at all costs!",
        "He has done some fun movies.  The Mummy movies are still some of my fav - all the actors were perfect for their roles!",
        "Get your copy of the GQ Men of the Year issue before it's gone! https://bit.ly/3V44fdY",
        "He has not aged well at all.",
        "We should all petition Hollywood to make another Brendan Fraser Mummy movie. He was so excited and happy at the thought of making another movie in the franchise, and I think we can all agree that would be fantastic. You go Brendan! Thanks for making such great movies for so long!",
        "Brendan’s soul radiates warmth, generosity and genuine humility. I’m so happy he’s on the big screen - I hope his return is meteoric; he’s so deserving. Brendan, your fans are here for you - we’ve never left. ",
        "14:06\n“which Elliot do i like the most?” \n“the one he turned into” \nthis man put all of his cast and coworkers on a Pedestal throughout the entire video all the way to the end what an absolute legend",
        "Love  him so down to earth",
        "You can tell how much he identifies with his characters.  He even had positive things to say about the CGI team for the scorpion king!  What a class act.",
        "His impression of John Cleese was spot on  Love Brendan! I'm so happy he's back",
        "Monkeybone was so good",
        "Brendan Fraser was my favorite actor growing up, and still is. The passion and gratitude he has for what he does has always shined through the screen. As a life time fan it's so exciting to see him back, and see this more personal side of him. The way he talks about everyone else, not just the actors but the crew in it's entirety is so refreshing. You don't hear any celebrities talk this way, just a truly cool dude that's just happy to be here ",
        "great video but no Monkeybone or Gods and Monsters!!!",
        "OMG HE WANTS TO COME BACK TO THE MUMMY. HRRRRRRRRRRRGNNNNN.\n\nwe need a script PRONTO",
        "mummy perfected what action comedy is back in the days. sure other have donne it but in the west, this was a masterpiece",
        "I just love him, I would love see him winning an Oscar. And he WILL!",
        "He's amazing. I love the way he still gives off the feeling that he's a young starving 22 year old waiting for his big break. He's an amazing actor because he still has that heart and that hunger.",
        "Im so glad he's back, he deserves all the support and love.",
        "The view show he is well loved!!!",
        "It really touches my heart how this guy doesn't realize or didn't realize anyway, how much he solidified in the hearts of most '90s kids",
        "He is so beautiful.",
        "Brendan deserves a comeback right now in Hollywood. Your role of John O'Connor in the Mummy is unforgettable. Thank you ",
        "He is an amazing human.",
        "I remember being a kid, reenacting movies with my friends like The Mummy. We'd beat the crap out of eachother in the playground, and we'd take turns being the hero and villains. Those memories are worth more to me than gold.",
        "The bad part of being semi-old is that all your favorite actors are old and doesnt film anymore or dead  :(",
        "His performance in George of the Jungle is so underrated. \nYes he has to portray a cartoon character, but there were so many moments in the movie where he displays well acted raw emotion. Just something you don’t expect out of a Disney film like that. ",
        "I watched Bedazzled again last night and I was absolutely doubled over in laughter. He is SUCH a good actor! You can almost feel how sincere he is behind all the goofy characters that he plays.",
        "Such a humble guy.",
        "We love you Brendan",
        "O Brendan é um lorde. Que homem incrível e que entrevista maravilhosa.",
        "I Love that man! ",
        "God bless this dude. The Mummy and \"George of the Jungle\" still stay in my memories after more than a decade. It was nothing but positive memories. I pray that he gets more success than he could have ever hoped for, he deserved every bit.",
        "The John Cleese laugh tho, incredible",
        "Awww I love him. Then, now, forever ️",
        "14:44, He reminded me of Hugh Jackman as Wolverine.",
        "Airheads will forever be my favorite",
        "Ungortunately he didn't age that well. He is not like wine.",
        "Thank goodness, I knew I had some sort of extension but it wasnt this. I send my prayers to everyone who got hacked",
        "Brendan Fraser is a jewel we cannot let go. Keep him relevant. He gives us so many joy on the screen is beyond compare.",
        "I had the pleasure of seeing some of these movies at the cinema and wow such a good guy glad has gotten back on his feet",
        "️️️️️",
        "Best actor ever. A nice person too.",
        "The first Branden Fraser movie I saw was Journey to the Center of the Earth , a true masterpiece of an actor  I have seen The Mummy series but I still gotta watch the rest of his movies  lol",
        "im so happy hes back",
        "Where is Journey to the center of the earth???",
        "I like the Brendan acknowledges all the pitfalls and challenges of his movies (i.e. the bad CGI, Rachel not coming back, etc.) in such a positive way. Dude is an absolute legend and a delight. I bet Brendan would be a great dinner guest.",
        "What a fantastic interview - I hung on every single word that Brendan said in this. Thank you for being such a brilliant actor and wonderful man Mr Fraser. It's a privilege to have you back on our screens.",
        "I can't stand Matt Damon",
        "This man is the definition of humble",
        "To hear an actor as talented as Brendan Fraser be so humble and so congratulatory of others is heartwarming.",
        "he says that he’s the most unfunny person ever but thats just not true. his laughter is very joyful & contagious.",
        "Not a movie but don't forget about Scrubs! His role as Ben, Jordan's brother, was fantastic and one of the most emotional Story Arcs in the entire series! Brendan is so humble, so sweet. The sheer depth he added to each of these characters is astounding, even for the goofier ones! Ugh! He's such a vibe, man. The world needs to protect this man, he's too pure for Hollywood. If I became a film director like my father did, I'd love to have him star in our movies.",
        "He is so awesome!!",
        "I would love if Brendan had a podcast, he's such an engaged speaker. He's got the type of earnest charm that you could listen to for hours, and he's got so many stories!",
        "I love how much respect he has for all disciplines of film. The puppeteers, actors, SFX and VFX artists.\nIt's so obvious how much he respects the crew, and it's very refreshing to see an actor talk about so openly.",
        "I never realized how much of my childhood he had a role in. A true treasure. Also, where the heck is MonkeyBone? That was another one of my faves.",
        "I am so so so so so happy to see Brendan making a comeback, he is one actor that truly deserves it. He was wronged and then blacklisted because of one man and I hope that his star rises again even higher than before. I've been a long-time fan since school ties and I have loved all his movies, god and men, Mrs Winterbourne, the mummy series, air-head, the list goes on..",
        "We need The Mummy Reunion!",
        "We need The Mummy 4!",
        "I love how they get to basically have father-daughter time and it's almost adorable seeing them do this. The text is magical and just you know it's Ethan. You know he's protecting her the best he can and it makes it so touching cuz he sees himself in her with how stubborn she is. =( :P",
        "He is soo humble. Make you wanna respect him more.",
        "great",
        "Beddazzled man! What a Great Movie, So Funny and Entertaining!",
        "Not discussing Looney Tunes Back in Action was disappointing, but can’t complain about Brendan discussing his passion. So talented and a good dude",
        "One of my favourite actors growing up. Glad to see he's still well and passionate about movies.",
        "i grew up with george of the jungle, don't deny me that",
        "His words for others, his attitude, the stars in his eyes... He is a very beautiful human being, that is so obvious. I wanted to give him a bear hug then beg him to be my best friend so bad. :)",
        "Omg I love and miss him ",
        "To hear his authentic and genuine...thoughts, was so refreshing. It reveals his character of selflessness in an industry that rewards a single role. He spotlights his cast mates and speaks so highly of others, such a good guy.",
        "You missed out DJ drake",
        "So humble. So kind. Love how he always has a compliment for the people he works with, Brendan may you always stay humble and kind but also know how absolutely adored and supported you are. ",
        "The Mummy 4 should happen then. Would 100% watch it with Fraser in it!",
        "I had George of the Jungle on REPEAT throughout my entire childhood That and Cars where on place 1!",
        "Awesome man. There should be totally another Mummy reboot or something...with same actors returning to their roles. I'd totally watch the heck out of it. This world needs more movies and shows starring Brendan Fraser!!!",
        "Not only is Brendan such a nice and humble guy, He’s obviously incredibly passionate and knowledgeable about film and acting. Great to see his contribution continuing to be appreciated",
        "I remember seing the resemblaces of Brandon in The Rock and loving it when they were casted together. Crazy",
        "Brendan is possibly the most humble and wholesome human on the planet. Not one time did he talk about himself in the whole video it was mostly about the other people he worked with being great and how much he enjoyed having just an opportunity and lived in the moment. We need more people like this.",
        "Whats a toxic trait of yours?\nMe: Being late for everything",
        "This man is a treasure",
        "This is the reason why so many have cheered Brendan on, because of just the person he is - which is just an awesome human being.",
        "What a lovely man",
        "Whenever I feel like snapping people in half out of rage, I think of Brendan. Brendan is cool. He is nice regardless. I need to be more like Brendan.",
        "The mummy felt like 5 complete movies, ",
        "Still breathing is one of his great accomplished films",
        "I love this actor, his is such an amazing actor and also, a wonderful person! We can just feel how his heart is through his eyes, speech and body language. I loved all his movies!! Specially George, he is amazing! But also the Mummy, it was a great film!",
        "As a amazing actor he is, he's not one to take all the credit, he includes those that he worked along with unlike most other actors. He's unique and we need more like this guy",
        "That 1st Mummy movie is absolutely fantastic. So entertaining.",
        "Never heard of The Whale before but guess I'll have to watch it now. Brendan has always carried his roles with an authenticity that shined past the characters themselves.",
        "A beautiful soul.  Brilliant actor. I think he chose a few wrong projects to be associated with.  A lot of them were B movies that relied on sight gags and bad writing which stunted his career.  Love him ️",
        "We love you Brendan and you have brought so much joy into my life and my wife's. We will always support your movies",
        "I’ve never watched one of these GQ videos but Brendan Fraser’s personality and kind demeanor drew me in to want to hear him talk about his most iconic roles. He did not disappoint at all. I love Brendan Fraser all my homies love Brendan Fraser",
        "What's really cool is seeing how well spoken he is about the underlying themes of every movie he's been in. And his stories really give away the fact that he makes connections with many crew members not only has an appreciation but an understanding of each of their roles; which just adds to his ability to give the best movie performance possible.",
        "Brendan was one of my favorite actors when I was a kid. I loved the mummy series. I can't count how many times I watch Encino Man growing up. I'm so happy to see him doing what he loves and receiving the praise I always thought he deserved.",
        "Brenden was a tan, ripped, beautiful movie star. He was the lead in a huge movie series and here he is. Older aging the way normal people do, not getting hair transplants and surgery to keep his youth. He had a great run in his 20-30s and I can’t wait to see him as an older brenden able to play so many more different roles. PROTECT THIS MAN AT ALL COSTS!!!! We love you B! ",
        "What a lovely man. He took every opportunity to talk up everybody he's worked with, and remains grateful he was there at all. Such a gentle heart.",
        "No monkeybone?!",
        "I felt that \"The Whale\" really is a big deal for him not only because it signs his comeback to the main stage but because of the aura of the film for him. I've never heard any actor on those GQ interviews talk about any of their movies with such contained emotion and difficulty and heartfelt blurry words (well maybe the only other one was Adrien Brody and \"The Pianist\"). I felt his passion for it and the people involved, like something magical was made. That was a beautiful thing to bear witness off.",
        "I love this man. What he's gone through, what he's been through. He can still meet the world with a smiling face and that gives me hope for humanity every single day",
        "Encino Man was my first time seeing him on screen, one of my all time favorite movies ",
        "Brendan has always been so humble and kind. He never pats himself on the back even though he deserves it.  I think every movie he was in; he was always great partly because of his personality.  He was able to be serious and funny all at the same time.  No matter what roll he had in his movies, it always felt like his part was perfect for him.  Thank you, Brendan.  I hope I see you in another movie again. ",
        "Brendan Fraser is such a good guy and I’m so happy that he’s slowly coming back into the spotlight. The fact that he’s still able to stay all positive and humble even after all he’s endured is nothing but admirable. Would love to see him in another Mummy movie as long as they also bring back the rest of the original cast as well.",
        "There's some people where you can truly see their inner beauty and kindness shine through, no matter what life stage they're in. Without a doubt, Brendan Fraser is one of these people, and this interview shows that. I'm so happy to see him back in the spotlight after all these years. I can't imagine any other actor who deserves it more.",
        "You rock, Brendan Fraser, and it's high time Hollywood acknowledged you with the respect you deserve.",
        "You can see the pain and the wisdom pain brings, in some people's eyes. Brendan is one of those people. I just want to see a movie about HIS story.",
        "Very good",
        "Absolutely should've included Robotman in this. Arguably the dawn of Brendan's resurgence in Hollywood",
        "School Ties was the first movie I saw him in back in the day. At the start of the film, when his name came on the screen, all I could think was \"'Brendan'...huh, I love that name\". I didn't know who he was or what the movie was going to be, but four years later I named my last child after him.",
        "I had the absolute pleasure of meeting him in London in 2019 and he is the most humble human I have ever met. I’ve loved him since the 90’s and I’m overjoyed to see the love he’s receiving since coming back.",
        "Im glad I didnt even know about this extension because I would probably be dumb enough to download it. I wasnt one of the people who got hacked but all of my prayers to everyone who did, stay safe and have a blessed day ",
        "Would love to see brendan on the big screens again! Such a cozy and amazing person! And this is the most wholesome interview ive ever seen.",
        "With honors with him and joe pesci  is one of my favorite’s movies maybe because i was in college",
        "I loved Brendan Fraser in all The Mummy movies and Mrs. Winterbourne. He’s a great actor.",
        "What happend to the man?",
        "So nice. Proud of him.",
        "He truly is one of the \"icons\"..",
        "WHY DOES HE MAKE ME CRY EVERY TIME?! He's just beautiful inside and out. Encino Man remains one of my favorite movie, largely due to the sheer earnestness he brings to Link, and every role he does. There is NOTHING fake about him. He's a genuine, gentle soul. I adore him and I'm so glad he's getting the accolades he's due.",
        "he was a huge part of my childhood and i want to welcome him back to my adulthood ^^",
        "George of the Jungle was my little brother’s favorite movie. After he died, whenever I miss him too much I put it on and laugh because it’s hilarious and I can still hear him laugh at his favorite parts. I miss you Josh, thank you Mr. Fraser for all the laughs. Loved everything you’ve done and can’t wait for your future roles.",
        "During my childhood he was my favourite actor and is still one of them to this day. His personality is one of the best out there, it makes him so humble and nice when he's praising everyone else for their roles when arguably he could be taking all the limelight. Hopefully we see more of Brendan soon, he deserves this comeback",
        "Brendan Fraser breaks down his most iconic characters - while building up everyone that he was around. \n\nIt felt like he never stopped giving credit to other actors/esses, directors, crew members… etc. And what’s crazy, is it didn’t feel like it was at all two-faced, you just felt like he had such an appreciation for not just being chosen for a film, but being able to be around all these other talented people (regardless of wether or not the world sees/saw them as talented).",
        "This man is a legend! He is charming and very kind!!! His life has been hard, but he keeps being that same kind person! He seems to be truly happy these days!! And glad people are finally there to defend him! Took long enough :O",
        "Had a smile on my face the entire time. Only one I haven't seen is the new one.",
        "Love this dude",
        "I came back to the comments to say I watched Bedazzled finally because of this interview and it's the best movie I've seen in SUCH along time !!! Seriously a great movie !!",
        "I cannot understate how great it is to see this man looking so happy, and confident and just doing so well after everything he's been through.\nIf anyone deserves to make such a massive comeback, Brendan Fraser absolutely does, in every way.",
        "The way Brendan speaks about his costars is so beautiful. Such a wonderful heart.",
        "The fact that this was uploaded a week ago and has nearly 6 million views really highlights how many millennials are still obsessed with this man.",
        "I love this guy .. made my childhood so amazing!",
        "You can tell he has a sincere and deep love and enthusiasm for the art of film making. So fascinating listening to him, I wish him all the best and can't wait to see what he has to offer in the future.",
        "Love this guy",
        "I love how he mentions himself not being funny. Yet, his corky upbeat humor had me smiling the entire video. This guy has no earthly idea the impact he has made on so many people. I wish I could get a chance to have a simple conversation. And instead of him praising others and thanking others for opportunities and experiences, and rather let him know how incredibly thankful people are for what he’s done and continues to do. Thank you!! You’ve truly helped shape the lives of so many people.",
        "In HIS interview, he spent it talking up the other artists he worked with. I fell in love with him when I was a kid and I am in awe of him now. What a man.",
        "Brendan doesn’t have any Oscars but his films are all iconic. What an amazing career this man has made for himself. Truly inspiring person, you feel his humbleness and authenticity as genuine and that’s what made his characters so fking remarkable to me growing up. You never saw Brendan, you only saw his character. THATS an ACTOR. I would cry meeting him lol.",
        "He's precious!!",
        "I must have watched the Mummy every day after school when I was in middle school. Had a huge impact on my life....Hope for a lot of good things for Mr Fraser",
        "Where's Airheads? Underrated movie, I think.",
        "His decision to speak to and boast about supporting characters through this whole piece really speaks to his character. This segment is about him and his career and he chooses to expound upon how impactful the people around him (especially those normally not featured - like the suit actors in George of the Jungle) is so impressive to see. What a beautiful and humble professional.",
        "Brendan is so wildly genuine. The fact he was chewed up and spat out of Hollywood, and he's still this nice is a testament to what a good person he is. We as an audience are happy to see him back, and even more grateful that he seems happy too. ",
        "Darn, no Doom Patrol, no upvote.",
        "Seriously funny guy",
        "V",
        "I know it's just a small part, but I loooved him in Scrubs. ",
        "I love this man, what a legend. My original action hero!",
        "Its hard not to love Brendan, you can clearly see how smart, humble and talented he is!",
        "The 1st time saw Brendon Frazer was in the movie \"Encino Man\" then I saw \"George of the Jungle\" after long gap saw him in Mummy and Mummy Returns he was sporting good. But sad to see him out of shape and grown older.",
        "Love Brendan's humility. It's refreshing. Need more like him in Hollywood.",
        "this dude is not again gracefully...dam",
        "I have always loved Brendan and still do what an absolutely gorgeous genuine man ️",
        "he's so precious. i love him",
        "What a lovely guy",
        "These videos leave a smile on my face when thinking of Technoblade, because no matter how much he will be missed his legacy will never be forgotten. Rest in peace technoblade =O:)",
        "There is something beautiful in how Brendan retold each of his stories. The way he recalled cast, and moments as if they were yesterday. How each seemed to be a special point in his life and that these memories have greater meaning to him. A shared experience that made those times all the more worth while.",
        "We need to see him back on the big screen soon!!",
        "He is a hero and kind soul",
        "I love this guy Brendan Fraser",
        "Always had a crush on Brendan Fraser and I still do, that man can make you listen to every word he says, and he’s so kind. I’m really glad he’s back doing films again, we need him.",
        "This is so heartwarming hearing how he talks about each film he’s so precise and gracious protect him at all costs also his John Cleese impression is on point",
        "I absolutely love this guy and wish him nothing but the very best",
        "Brendan is literally a national treasure. Most people in this position don't even come close to this man's kindness and level of humility.",
        "I loved watching Encino man with my dad as a kid",
        "I just love Brendan. He is the type of actor that you know you could sit across the table with and just chat... about all kinds of things. I'm so glad that he's making a comeback!",
        "Only Brendan Fraser could make a children's movie around so incredible. ",
        "The Mummy is still one of my favorite films of all time. It has adventure, horror, romance, and comedy.",
        "best acting advice = Listen",
        "Brendan and Keannu are the nicest celebrities that one could come across.",
        "Brendan...I love you as a person and I'm glad you are coming back to our lives",
        "How can you not love this guy. So glad he’s getting back in the spotlight. He deserves all the love he’s getting.",
        "I am SO HAPPY he's been able to be bounce back and completely get back into the spotlight. Very very well deserved.",
        "I love him so much ",
        "What a lovely man. I had a mega crush on him in HS.",
        "I just love Brendan Fraser. He is an amazing actor and a good human being.",
        "I love the energy of this man, it feels like he is so kind-hearted and sweet. And the fact that instead of talking about himself he was praising his castmates and directors speaks for itself!",
        "1 of my fave Actor and Iconic movie. ",
        "That man is a damned national treasure.",
        "Brendan Fraser is a gem!  The John Cleese story made my day.!",
        "This man is a wonderful soul. Glad he's back on the screen. Legend. ️️",
        "He is such a lovely human on top of being a wonderful actor  he's so complimentary of his casts and crews too",
        "Sending lots of love to Brendan Fraser ",
        "I don't think I've ever watched a interview with brendan fraiser without tearing up. He is such a nice and wholesome man who deserves nothing but the kindness and happiness he gives to others. He is an amazing actor, and an even more amazing person. And that should tell you how great of a person brendan is.",
        "most of the movies he's been in are kinda mediocre but i love seeing the enthusiasm he had while making them, i feel you wouldn't really get that with a typical A-List actor. It's more than a job to him, it's a passion. Having that in mind kinda makes the movies better in it's own right.",
        "I think I watched George of the Jungle at least 600 times as a kid.",
        "I grew up watching his movies, I was devastated when I realized he was not around the popular hollywood movies anymore but it's so amazing and refreshing to see him again. I love his acting skills and how genuine and kind he is in real life !!!",
        "Love you Brendan!!!!",
        "The Harry Potter quote and saying she can do what she wants now has me crying, seeing how relived and free she feels. In a world so full of bad endings I'm so happy that, by the looks of things, she got the good one <3",
        "Bedezzeled is one of the most underrated entertaining movies of all time.",
        "I miss him acting.",
        "Thank you to the whoever got Brendan Fraser! Brendan has earned himself a place in everyone's hearts with his smile, charisma and joy! He deserves all the praise in the world!",
        "gotta love Brandon Fraser. Really happy he's involved in projects worthy of his talents again. couldn't happen to a nicer guy.",
        "We love you!!! So many great movies and so kind",
        "Brendan Fraser is one of those rare and hard to come by celebrities that literally everyone loves. No scandals, no accusations of inappropriate behavior, no arrogance, and no yelling and screaming about his political views. He's just a good guy who made good movies and has finally decided to come back. Oh and he likes archery",
        "️",
        "He was a handsome devil as a young man!",
        "I was looking up who the stuntman was that did the Bay Bridge swing in George of the Jungle. Apparently he did it himself. Twice!\nI bought GotJ after finishing this. Watched it twice already. I am dangerously close to going on a Brendan Fraser movie shopping spree :)",
        "Man, he's super wholesome lol",
        "no air heads or monkeybone!! boo urns",
        "OMG WE NEED A GOOD SCRIPT FOR AN UPCOMING MUMMY MOVIE ASAP",
        "YES DO ANOTHER MUMMY",
        "School ties is really good so underated",
        "What a gem of a human being! My favorite BF movie has been and probably always will be \"With Honors\". Stellar cast of Brendan, Moira Kelly, Joe Pesci, Patrick Dempsey & Josh Hamilton. Amazing film!",
        "It's really nice to see that Brendan is doing well despite what he was put through in life. We, his fans, will always be here to support him and praise his movies and acting, because he is a truly talented and overall awesome human being.",
        "My fav Canadian loved u then and love you more now",
        "Needs his role in Scrubs here!",
        "Brendan is one of the most humble and inspirational actors out there and I grew up with his movies",
        "Wow. Reading through the comments makes it clear that Mr Fraser is loved and respected for who is he and not because of his celebrity.  Truly unusual and edifying.",
        "this is so wholesome, thank you brendan fraser.",
        "That John Cleese imitation was so spot on!! Also what a kind and positive soul. I'm so happy that Brendan is back!",
        "God bless Brandon Fraser I love him so much and God bless what had happened to him but I am glad he came out and gladly talked about his movies especially the mummy and George of the jungle I love both of them and God bless him so much.",
        "I forgot about Encino Man. Yes!",
        "Justice for him!",
        "This man is a national treasure. I'm so glad he's having an amazing comeback.",
        "Love this man so much. Such a kind soul  my favorite actor of all time, hands down.",
        "you didn't add monkeybone and that movie is INSANELY good, so underrated!! but i love this man, i love how humble and kind he is and how he praises everybody else and how his retelling is so vivid and sweet. LOVE HIM",
        "He is so awesome!",
        "one of the rare videos on the internet that will not have a single negative comment",
        "The mummy holds up, even better now honestly and much more appreciated today. truly one of the last real Hollywood action flicks. It has everything, action,adventure,tension, comedy, romance, overall fun and Brendan plays the action hero perfectly.",
        "aww man was waiting for airheads haha",
        "Brendan: \"I'm the least funny person I know\"\nAlso Brendan: continues to be the most delightfully fun guy possible",
        "I love this man, he's a part of my childhood. He deserves nothing but good things moving forward after everything that happened to him.",
        "I want to go on a Brendon movie marathon",
        "What a sweet, funny and caring person he is!",
        "He fundamentely feels human in his discourse. You can feel the emotions being conveyed in a sincere and deep way. He's my childhood, the childhoods of many more and i love seeing him succeed in a different way than with George or The Mummy. I wish him the best really.",
        "i knew it would only be a matter of time before he made a comeback, we need this right now, its good to have you back, im happy for you.",
        "School Ties and With Honour are very underrated films imo.",
        "THAT JOHN CLEESE LAUGH",
        "I'll always be a Brendan Fraser fan.",
        "Dude was handsome and unique looking enough to be the roles he became. Dude is talented and an awesome actor. There's a reason why he was so iconic in the the Mummy films it's because he literally is those characters. He gave them life and felt more than acting. It felt real. Glad he returned.",
        "I'm super glad you guys got Brendan Fraser to do this series. He must be protected at all costs.",
        "The mummy is one of my favorite movies",
        "brandon got that Keanu level of fandom goin on at the moment",
        "Bag and stick bum tools",
        "God this man is such a gift. He's still so full of love and joy despite his hardships. He's not just a great actor, he's a great man.",
        "Such a genuine, heartfelt guy.",
        "THE RETURN OF THE KING",
        "Quite possibly one of the few genuine, pure, and wholesome people remaining in show business/Hollywood. If anyone deserved a comeback, it’s him. The way he speaks about people with such sincerity… it’s inspiring.",
        "My favorite actor ",
        "13:58 Bedazzled is quite frankly his best movie. He portrayed so many different characters and the message in the end was great. A really \"feel good\" movie.",
        "The Mummy 1&2 will forever be iconic for me. Brendan was incredible and those movies will go down as cult classics. Wasnt a fan of 3 at all but if they got him and Rachel back for a 4th...I'm in. This guy is just an all around good person.",
        "Not including \"Journey to the Centre of the Earth\" was a hate crime fr",
        "SO happy he's back. WAY too long without him on the silver screen.",
        "What no monkey bone! That one and bedazzled where my favorites!",
        "Such a brilliant actor.",
        "Too bad they didn't include \"AIRHEADS\"",
        "George George George of the jungle, watch out for that tree!!!",
        "“I’m sorry, I don’t speak spanish.” Said in spanish  That look he gave himself was priceless, I need to see that movie.\n\nGreat dude, definitely seems like the kind of guy you could just chill and talk about anything with and he’d understand and be supportive",
        "I could continue watching that interview for another 2 hours. I’m sorry for everything what went wrong in his personal life but I’m happy seeing him back on screen. Bedazzled is criminally underrated and still one of my all-time favorite movies out there.",
        "Awesome John Cleese laugh",
        "I LOVE this man, have done for years, great to see him again <3",
        "The Mummy was first movie I ever saw in theaters! for my fifth birthday!",
        "Someone put this man in a movie right now!",
        "So casual, the definition of down to Earth. And his John Cleese impression was spot on!",
        "He is one of my favorite actors by far. He had a tremendous impact in my childhood and getting to know more about how kind he is outside of acting is very inspiring and amazing to hear. Such a wonderful guy I wish to meet and have a good chat one day.",
        "Wow...I could listen to him explain cinema forever..what a great orator",
        "Most other actors pale in comparison to this mans character.  This is who we should be looking up too not just plastic fake shiny people.",
        "I am utterly living for the Brenaissance",
        "The mummy is still and always will be one of my favourite flicks, and I’m a bit of a film snob. Preserve this man at all costs!!",
        "This interview is another testament that while he fell off the radar a while it was never because we stopped loving him. We had his back at all times and will continue to have it, because he deserves it.",
        "I’m borderline ashamed that I’d no clue Brendan was such a consummate, highly trained actor let alone radiant, passionate and genuine. Imagine sharing a meal with Brendan Fraser and Keanu Reeves.",
        "What a lovely spirit. I always enjoyed his movies, I didn’t know he was such a nice man.",
        "He was such a outwardly beautiful youth, but I think we’ve discovered that Brendan Fraser is just an all around beautiful man, inside and out. So kind and generous to everyone he’s worked with. Not just costars, but suit actors, SFX, makeup and costumes. You can tell he just loved the art of movies!",
        "The way he talks about story, he's so happy.",
        "We must protect Brendan Fraser at all costs. I'm so happy he is back, he was sorely missed. Might watch Airheads.",
        "No inkheart????",
        "I love Brendan Fraser!!",
        "The way he talks about his thoughts on each movie... he shows us how deeply he engages with each part, how much he values each experience. It's so refreshing and honest. I really adore him! Such a likeable guy",
        "I love the respect he has for his past coworkers and the many different professionals of his film crews. He talks more about their contribution to these movies then he does of himself. Great guy.",
        "by the end of this video, i would have thrown myself in front of a train to protect this man.\nHe seems like a great, sensitive dude in a big, mean world",
        "This guy is a reminder that life is filled with peaks & valleys. I'm in something of a rut myself & this reminds me that I should dust myself off & get back to what I'm good at.",
        "Loved it, loved him!",
        "His role in The Mummy was iconic. A much loved favourite of mine as a child and now at 30.    I wish I knew he was this cool off screen before now. What a lovely man",
        "An incredible human being.",
        "I am absolutely stoked for The Whale. Definitely my must see!",
        "Love that he pulled out his John Cleese impersonation. Brilliant. That laugh! So good.",
        "Totally genuine.",
        "Man, it is SO good to see Brendan so relaxed and animated. Considering all the crap he has been through, it;s nice to see his personality showing through again.",
        "this man has the face of nostalgia",
        "He's so humble, kind and gentle. As a teen, I had a deep crush on him and as an adult, it's still there. There is something so charming and sweet about Brendan and Im so glad he has gained admiration and a resurgence in his career. He deserves it.\nAnd can we get a Mummy 4 with him back. Pleaaaaaase. Need it. Need it so badly. No to do stunts anymore but just to see him as Rick O Connell again.",
        "🥹. Bless this man's genuine heart. ️",
        "I’m glad he’s in the spotlight again. If you’re in your 20s or 30s, this man was a part of your childhood.",
        "This man is probably the only actor that I would love to sit and have dinner with just to talk with. I get the feeling he has so much wisdom to share",
        "This is the wholesome interview I didn't know I needed.",
        "Great interview! Sign me up for more Mummy films with Brendan!",
        "i thought it was a shame he wasn't able to talk about the quiet american.  interesting film and interesting role.",
        "So ... um. THAT was an Amazing Interview. Bless this guy. Much good fortune & good health goes his way..Amen.",
        "amaizing interviw",
        "I have aspergers and adhd.\n\nWhen i found out my grandma died, i did not shed even a single tear, and recently when my moms close friend and coworker died.",
        "Why is \"With Honors\" never mentioned?",
        "So good to see Him getting his comeback.",
        "Can we take a moment to appreciate how much time and effort he puts in the videos for us",
        "genio te amo",
        "I love how she gets inspired by movies, anime, and all types of popular tv shows to just keep us entertained. We love you Jess",
        "The world needs more Brendan Fraser.",
        "He is so adorable. What a sweet human. Not many of those left!!",
        "Gotta love this man",
        "Such a pleasure to listen to Brendan Fraser.  He is so well-spoken and seems genuine and attentive.  Lovely interview. Thanks.",
        "Give this man an oscar",
        "The greatest",
        "So happy to see him again. The Mummy, Journey to the center of Earth, George of the Jungle and more. Thanks for the great memories.",
        "love him but what happened to him ?  love the mummies",
        "YOU DESERVE ALL THE LOVE AND KINDNESS IN THE WORLD MR BRENDAN FRASER. Thank you for George of the Jungle and The Mummy trilogy, they made my youth and made me fall in love with cinema. Your standing ovation of 6 minutes for your movie The Whale was far too short in my opinion. We all collectively love you Mr Fraser, you are so kind, humble and genuine with an amazing sense of humor. Hearing you laugh and giggle while reminiscing in your past roles magnetically brings me a smile and a soft chuckle <3. Thank you so much for being who you are and thank you for the movies you have made. ",
        "None of national treasure?",
        "Bloo's knowledge of all the facets of the game and awareness is what makes him such a skilled player #myopinion also plays better when his mood is calmer",
        "This man is so selfless and such a huge role in so many people's childhoods. He constantly praised his peers and bosses. Such a great actor.",
        "Hey Mr Fraser do you want to come over for dinner ? We'd be so honoured to have you",
        "What a kind, generous man. He never had anything negative to say about anyone, and if he did he came at it with a gentleman's manner of speaking. He always seems so eager and excited to talk about his experiences and to try new ones. Brendan deserves so much more love than he has gotten.",
        "Super underrated performance by him is George of the Jungle. I know that sounds silly but his super genuine kindness and charm come through in a way that make the silly love story between him and Leslie Mann really pop. The scene where they dance around the fire to Dela is an all time scene.",
        "He is a gem of a human being. The best episode of this show thus far...",
        "i love this guy",
        "Brendan is another Canadian gift to the world",
        "I love this man! I truly believe hes a good person.",
        "The Mummy wouldn't be what it is without Brendan Fraser",
        "When do you ever see an actor be so effusive with his praise for his coworkers and co-creators. Such an absolute gem. Wish they would've done more movies and TV shows, I would've watched an hour of this.",
        "It seems like Brendan's life has been quite difficult at times, and yet he still spoke about his past experiences with so much gratitude and humility. We are fortunate to have him. I hope he sees some of these kind comments on this video and knows how much we appreciate him and are rooting for him!",
        "Im so sad they didnt touch on looney toons back in action",
        "Respect for Brendan! Such a rare gem in his field: talent, humility, character, humor and just overall a decent human being. He has gone beyond being a movie hottie and has transcended genres and generations. He exudes kindness, I wish him nothing but the best!",
        "It seems like he's always been conscious about how rare success in the movie realm really is, and now years later, an even deeper appreciation after the struggle and comeback. Can't wait to see what he will do in the future!! I'm thinking he'd be a fantastic voice actor, its so deep and rich, I loved listening to him tell all these stories ",
        "Rewatching this stuff not in remembrance but to see if I can still enjoy his content without feeling down that hes gone. I can safely say his videos will forever be a joyful watch for me, even with the knowledge of his passing.\nBloody legendary skills to make people laugh. Legends never die",
        "Brendans ability to convey emotions. To calling out his tormentors in School ties,  his breakdown in the museum  in EncinoMan. I was awed and sad at the same time.     one of the reasons I will always love and Support him.",
        "Superb",
        "Good informative video",
        "What a beautiful extraordinarily talented human being ",
        "His performance in School Ties was absolutely riveting.  He should have won an Oscar for it.",
        "Brendan is wholesome.",
        "His movies are such a big part of my childhood memories. It's so comforting as an adult to see someone who has brought so much laughter into your early life not be a joke of a person now. His sincerity and genuine positivity is just such a wholesome, nostalgic hug. Excuse me while I go binge watch all his movies now.",
        "Such a humble man. I always loved him and found that he was totally underrated since he is really a great Autor!!!",
        "He's looking and sounding much better than few years ago when he came out of hiding. Nice to see, Brendan was a big part of our childhood and teenage years with his awesome flicks, legend.",
        "I love how he remembers every actors name, every director every animal…shows he was  grateful and in the moment every second of his career. ",
        "He’s so charming and wholesome. Every interview I watch of him I can’t help but get a smile on my face",
        "Why do I get the feeling that he’s being groomed for politics",
        "no airheads, im disappointed",
        "Brendan Fraser is simply my childhood, and actually an actor that makes me really sad what happened to him. Whatever people accused of him lying. I trust him, and I'm really happy that he finally find an equilibrium in his life",
        "This is easily the best one. So much nostalgia, and Brendan's breakdowns are filled with so much love for his colleagues and the films themselves. Bedazzled is legitimately one of my all-time favorite movies, and I'm glad Brendan has fond memories of it too.",
        "They never mention Monkeybone ",
        "I could literally watch Brendan talk for hours on end he's such a natural storyteller. Not to forget how incredibly talented,  humble and kind he is too. As I'm sure a lot of people have shared, it's great to see Brendan back doing what he clearly loves. #legend",
        "Such a sweet, likeable man.",
        "I remember watching Journey to the center of the Earth religiously as a kid, and I've loved Brendan ever since. After seeing his other works, I can say that he is such an amazing actor and I'm so glad that he's back doing what he does best!",
        "love him! legend!",
        "Yay! Love him. ",
        "this is one of the actors who i wish i could meet irl but never will and talk to and tell him about the impact his movies had on me growing up.",
        "Give this man a good script and a good director and make Mummy 4 ... Pleeeeease! ️",
        "The Mummy will always have a special place in my childhood. One of my favorite movies growing up, and Brendan was the absolute man. I wish him all the success and happiness in the world.",
        "Brendan Fraser's impression of John Cleese had me rolling. He's a great storyteller, he's humble and always remembers to give credit to cast and crew alike for each film. I don't care how sappy and fangirly I sound, I freaking love Brendan Fraser.",
        "Great guy, great Cleese impression. Two thumbs up.",
        "Brendan is so kind. He spent the entire interview applauding others and mentioning their achievements. This man is just incredible and I hope he knows how unbelievably loved he is.",
        "this interview was captivating. I had to watch it. I usually just listen while doing other stuff.",
        "I love how he was aware of the bad cgi of Dwayne",
        "This is the only one of these I watched cause it's Brendan, I no longer support Pedowood but this guy deserves it all. Him & Keanu are the only 2 actors I think are genuinely good people.",
        "Te quiero mucho Brendan ",
        "Bedazzled was my favorite. 110%!",
        "I’ve been head over heels for Brendan for over 30 years. He’s not just immensely talented, he’s pure heart. Im so happy he’s getting the recognition he deserves. ",
        "This man is a national treasure ",
        "Brendan Fraser was my biggest idol ever as a kid, especially once The Mummy came out; I wanted to grow up to be like Rick O'Connell when it came to facing adversity in life.",
        "The absolute humanity of Brendan Fraser is deeply moving. He lauds the creations of others, he shows true interest in his performances, the complete heartfelt nature of his honesty, it warms the heart truly.",
        "I love Brendan!!! His movies are awesome, and he seems so cool and down to earth",
        "He was so beautiful in his 20s",
        "Aww. I just love him. I've missed seeing his face.",
        "And just when you think Brendan Fraser couldn't get any greater, he does a spot on John Cleese impression... Priceless!\nThis guy is just so sweet, so genuine... We need more people like Brendan Fraser...",
        "Ah, I just love him.",
        "Seriously, this is the best GQ interview by far. I love how much he understands his fans. He really has a pulse on the fans and that’s just one of the many reasons he is just the best.",
        "Kinda so sad he suffer severe back injury and make him can't do intense workout to play Rick in The Mummy",
        "He is amazing.",
        "been following this dude's carrer for so long... \ni'm so glad to see him making a comeback and being at his best self.\n\nstay well, Brendan.",
        "What a great guy!!! I'm so glad he's back.",
        "I really hope Brendan Fraser reads the comments on this video. He mentioned that he wasn’t aware so many people were super excited to see him return and how much love and support his fans have for him. He’s such a humble, talented man. He really embodies what an actor should be.",
        "Monkeybone?!?!?",
        "Truly a national treasure. I love the sweetness and vulnerability he brings to his characters.",
        "Love him. The entire time I wouldn’t have guessed this was about Brendan. He leaned on all his cast and crew more then himself. Next to Keanu Reeves this man is a saint. Wouldn’t know he is an actor because his personality is always thinking of others. Love this man and for god sakes get him a mummy 4 script please ",
        "Huh... should have asked him about Monkey Bone. That movie left an imprint on me as a 12 yr old, aha.",
        "I love Brendan Fraser he makes my heart so happy ️️️️",
        "I'd always hoped there'd be more \"The Mummy\" movies and even branch off into just movies about Bendans character travelling the world as some sort of monster hunter Indiana Jones type splice.\n\nI know they all have the same \"Evil monster walks the earth, good guy beats evil monster\" plot but that's ok and there's so many great locations, myths and legends around the world for great movie scenarios.",
        "lovely",
        "Brendan is such an amazing man. And, on the side note, his Cleese impersonation is spot on!",
        "Absolutely love this man between Bedazzled and The Mummy I can't tell you how many rewatches I've had",
        "Brendan deserved an oscar for Bedazzled",
        "Bring Brendan Fraser back Hollywood! One of my favorite actors.",
        "As a young kid I loved George of the Jungle and the mummy. I'm excited to see his biggest new movie as an adult and really appreciate his acting.",
        "Brendan rules",
        "I can't describe how much I've missed this man over the years. He was such an integral part of my childhood. So glad he's back :*)",
        "What a humble and beautiful human being. I've missed him dearly.",
        "6 млн!!!",
        "Regardless of the junk people say brendan Fraser is one of my all time favorite actors..  Just love him....",
        "Brendan was is and will always be my childhood actor hero and I will always be grateful and thankful ",
        "I love Brendan Fraser my childhood was so influenced by his movies. I've really missed him. I named my daughter after the mummy her name is Evelyn",
        "Brendan Fraser on the trilogy of the mummy is iconic",
        "I love Brendan's roles in George of the Jungle and the Mummy, but he was first recognised as a serious actor in Gods and Monsters. I am surprised this film was not mentioned.",
        "Interesting that whenever Fraser mentions School Ties, he never makes a comparison between the character and his own 3 Jewish sons.",
        "This dude made so many hits. I miss those days. Even his terrible movies were still watchable.",
        "I think he should do a biopic of Rodney Dangerfield next! He's got the chops and with a bit of styling, could definitely look convincing.",
        "Rofl, his Cleese was on point.",
        "Brendan was my childhood action hero. Being a big history nerd, The Mummy was one of my favourite movies. I love seeing him coming back. What a genuinely lovely guy, the way he talks about other people and can articulate his experiences. Please let the fans have another Mummy film!!!",
        "I love him , he is just the best , so great that he come back :)",
        "i would have liked to see him talk about duddly doright",
        "Brendan seems to be a lot happier these days. Thats awesome!",
        "The fact he can still intricately remember so many details and feelings about the films he's been in, and just how much he gives credit to others over himself, really shows how great of an actor and person Brendan is. I will never get tired of seeing this man win whenever he can.",
        "We want Brendan back! Such a great human being! Seeing this gives me so much nostalgia as many us grew watching these movies",
        "There is something very genuine about Brendan Fraser, which is why I think people love him and rooted for his triumphant return.",
        "He must be one of the nicest, most loved actors in existence. I hope he knows how much we appreciate him ",
        "Seeing him reminisce and smile and laugh knowing what he has gone through makes me tear up and smile that he’s making a comeback, he deserves the best for being such a great human",
        "He is so humble and kind. Great!",
        "Wtf? No Airheads? That was his best movie. Adam Sandler also.",
        "I hope he knows how much we all love him. This man is unendingly gracious, humble, joyous to be doing what he's doing with the people he's doing it with. I want to be him when I grow up.",
        "an actor with a pure soul!",
        "My dad and I got to meet him on a plane trip to Durango Mexico where he was headed I’m imagining for filming. He was so incredibly kind and open for conversation and it was the coolest moment of my tiny child life",
        "Gods and Monsters?",
        "Great segment and interview. Brendan Fraser is a class act.  I just wish they would have discussed his role in \"Gods and Monsters\" (1998).",
        "No mention of inkheart..?",
        "My favorite actor of all time️",
        "Shoutout to Mick for not only keeping his head down to the grindstone but turning around and putting out some of the best engineering on some major albums in the meantime, dude seriously turned around and made some incredible projects even when people were doubting him ;)",
        "I bet he gets a lot of really big roles after The Whale. You just wait, this guy is going to be huge moving forward",
        "I’ll have to concur with a lot of other folks making comments about Mr. Fraser. He really does seem to be a really humble man who puts others above himself. I can’t speak for others of course, but that matters to me. I also like it that he doesn’t say a lot of cuss words in his movies. After being a soldier for 12 years, and seeing too many movies with too many gratuitous “f bombs”, I’m tired of needless cussing. It’s kind of ignorant, to me at least. Well anyway, have a blessed day you all.",
        "Mexicans, we LOVE the spanish speaking scene, it's SO popular and so loved by us; it's wonderfully hilarious",
        "Guys, please don't WAIT til after this man is dead to tell him how much we love him. Tell him NOW, today. Let him know he is AWESOME",
        "the Mummy and Bedazzled  my favs",
        "Compulsory engagement comment",
        "Brendan Fraser is up there with Robin Williams for me, in terms of someone who can just appear on screen and make me smile. I love to watch him act and he brings such a great personality to every role he takes on. So happy he’s back full time in acting!",
        "I love how his face lights up when he talks about The Mummy films. You can tell that he LOVED making those films. He gets a burst of energy and pure joy talking about them. ",
        "I will forever be madly in love with him",
        "this man will make me cry without even trying, his humbleness gets to me everytime bc he was always my favorite actor as a kid",
        "A very humble gentleman. I've always loved his movies.",
        "holy crap he really is an infectious person. I hope he becomes a director...and a producer...",
        "we watch the mummy all the time. love it. he was so good-looking and nice. He did a film with Michael Caine called the American. So good and worth seeing",
        "Through all his ups and downs, Brendan has remained such a humble, class act and still seems happy to be working on his craft.",
        "NO LOONEY TUNES BACK IN ACTION ?? >:(",
        "The humility, the talent, the heart warming way he speaks about his experiences is just so wonderful to listen to. And also, very rarely do you hear someone prop up their co-stars so much. What an absolute gem he is.",
        "We love you!!!!",
        "He is such a humble and kind soul . I’m so glad that I grew up watching his movies",
        "Brendan coming back is one of the best things to happen to me as an adult.",
        "We shouldn't forget about Still Breathing or Extraordinary Measures. \nAn observation about the ending of Bedazzled: One can re-incarnate and re-invent oneself even within the context of a single life. \nEliot wanted Allison, but in the end, as soon as he stopped trying, the right person just \"happened\" to him.",
        "When they asked him if he would return to The Mummy franchise and he gave a resounding yes and then asked \" Do you have a script\" my heart jumped for joy! I felt like a kid again going to see one of the greatest summer block busters!! Someone please get this man a script for The Mummy 4!!!",
        "Heartbreaking whathappen very interesting to me this video",
        "Ethan and Simon sniggering and laughing together like two naughty kids at the back of the class is my favourite part of this video. I love how you can put any two of the Sidemen together and theyre just instantly hilarious because theyre all genuinely such good friends. =3:)",
        "No matter what happens, how old I get, what happens in my life, who comes in and out of it, these videos will always be here for me, and for all of us. Techno was a light that shone brighter than any other out there, and he was a real beacon of hope for many of us. I'm just very glad that he's resting now, and doesn't have to suffer anymore. Props to you, Techno, and as the saying goes, \"Technoblade nevah dies!\" =(",
        "We love you Brendan Fraser",
        "Brendan has actually slimmed down significantly as of late, he looks health and happy compared to the past few years, I’m happy for him he looks good, showing flashes of his younger self, so happy to have him back he was part of my childhood",
        "Such a cool guy man",
        "Loved all these movies",
        "They're currently 4.5 hours into the stream and have reached 88% of the goal amount.  Good on Charlie for caring and doing this for Lance and his family.  Looks like they'll make the goal easily. :-(",
        "I hope Brendan knows that 6 million people love and care about him. He's a gem. So humble and kind and selfless. He was and still is an actor like Keanu Reeves in terms of his humble nature.",
        "“I’m exited to get to know my peers in a meaningful way” that’s about as close as he got to saying he did good, what a great guy, his humbleness and enthusiasm for life and the people around him just makes watching him talk a real event for good feeling,",
        "Brandon, you're of my heroes.",
        "I got Doom Patrol  because Brendan is in it, along with a lot of other amazing actors who I love, but I love Brendan  so much. He is just so wonderful.  There should be a movie with Brendan & Keanu Reeves.",
        "I wish they would have included the Quiet American such an underrated film.",
        "Think alot of us feel guilt over joking about his crying face, not knowing Brendan's struggles, yet always being that childhood hero.",
        "Next role: Rodney \"No Respect\" Dangerfield!",
        "I love Brendan, I love that he is getting back to filming",
        "Guys , did you seriously not ask him about Doom Patrol? \nDoes the GQ even do the research?",
        "It's funny I never knew for a long time he was wearing a wig for the majority of movies. I think it was Journey to the center of the earth was the first one after he got a hair transplant and things started going downhill for him",
        "Beautiful human. I personally think he’s so much more attractive now than he ever was. Beautiful, beautiful man. ️",
        "no AIRHEADS!!!!!!???",
        "Brendan is a treasure. Thank you to everyone who brought this.",
        "Encino man.... Wasnt it called california man??"
    ],
    "comments_disabled": false
}