{"video_id": "TfaMLqEh1qM", "comments": ["Get your copy of the GQ Men of the Year issue before it's gone! https://bit.ly/3V44fdY", "Brendan is so kind. He spent the entire interview applauding others and mentioning their achievements. This man is just incredible and I hope he knows how unbelievably loved he is.", "I had the honor of meeting Brendan once at a cosplay contest. He is as kind as he appears here. Very sweet. Even asked for MY photo! He took time to speak to all of us cosplayers, always gave compliments, and introduced himself. So humble and courteous. Beyond a gentleman. He is a priceless treasure.", "I met Brendan when I was working as a deckhand on a local tour boat. I ran into him at an island buffet. He had taken a private boat to the island, and out of the hundreds of passengers I had serviced that day, he was the only one to ask me how my day was going. What a guy.", "Only with Brendan do you get a synopsis of the contributions of everyone when you're interviewing him, about him. I love his appreciation of the team and the collective effort that makes a film. He's a good guy, and absolutely deserves the fame.  The absolute passion he has for everything he does and positivity he has. It’s just a joy just to watch an interview like this.", "What a beautiful person. Sensitive, empathetic, gracious, generous, grateful… He spent the whole interview saying the most wonderful things about the people he’s worked with. I teared up at certain points because you just can’t help but feel your heart grow as you listen to his stories. The world needs more people like him.", "Not a movie but don't forget about Scrubs! His role as Ben, Jordan's brother, was fantastic and one of the most emotional Story Arcs in the entire series! Brendan is so humble, so sweet. The sheer depth he added to each of these characters is astounding, even for the goofier ones! Ugh! He's such a vibe, man. The world needs to protect this man, he's too pure for Hollywood. If I became a film director like my father did, I'd love to have him star in our movies.", "1.1 M views in just 14 hours. For an actor who's not in the big screen for years, this just shows how much he is actually loved.", "You can’t help but adore Brendan Fraser. He truly is a treasure of a human being.", "What struck me while watching this is how warmly he speaks of his peers, and the genuine appreciation he has for them and for being involved. The man is a class act, I’m excited to see him working again and hope we get to see more of him!", "This man was a big part of my childhood and seeing him back on the screen is just so great. The way he talks about all the people he worked with and the fact he says so many positive things about them just shows how genuinely lovable he is. I hope we will see more of him for many more years to come ", "I love Brendan so much, and I’m so glad that he’s having a come back. Such an authentic and empathetic person.", "You just feel his authenticity through the phone, his attention for details just shows his passion and his real humbleness is so rare to see in actors", "He’s so charming and wholesome. Every interview I watch of him I can’t help but get a smile on my face", "He’s genuinely one of my most favorite actors. Anything he’s in is phenomenal in its self.  Glad to see he’s still around & relevant (: I wish him the best tbh", "Seeing Brendan Fraser talk about all of these roles with such introspection really just makes me want to cry. He’s such a wonderful, thoughtful human being who really does just deserve to succeed. I love that we get to peer into his mind about how he approaches these characters as well as the tireless appreciation he gives to those who were on that journey with him. He is a treasure nationally (and internationally I would argue), and I hope he feels the love and support of everyone who watched this and left comments for him.", "This man is a national treasure, it was heartbreaking watching his personal life fall to shambles when his wife abandoned their family.", "This guy is truly someone to admire. He's so humble. He's very smart and severely underappreciated. He's genuine. I hope we see more of him as he ages.", "He is so down to earth and eloquent. Amazing to hear how aware he was in all of his projects. Very observant of others too. All the makings of a truly kind man.", "This man is a national treasure and deserves all the love, support, film roles, etc. I hope we get a Mummy 4 and takes us back to Egypt.", "What a comeback, I’m so happy to see Brendan again 🥹 I loved The Mummy, I’m glad he said he would return for another one because with all the love and support he has going for him now, it’s actually possible. ", "His depth and devotion to every single one of his characters. He’s able to find meaning in every interpretation and appreciation for his colleagues. Admirable, professional, humble.", "I've watched all of his movies minimum 30 times. They are what you play when you just want to watch something familiar, then one day he just disappeared. I was always sad about that. Glad he's coming back", "Not only is Brendan such a nice and humble guy, He’s obviously incredibly passionate and knowledgeable about film and acting. Great to see his contribution continuing to be appreciated", "We all love Brendan. So glad and thankful he came back in the public eye. He deserves all the love and recognitions he's getting and more. Can't wait to see what he does next :)", "It's awesome how much the internet loves Brendan Fraser. Dude just emits good vibes and makes you wanna smile. I'm glad he's back at it and making movies again. His range and talent are insane.", "I didn't really grow up watching any of these films, but he seems like such a kind and wholesome guy.  I really hope he continues to do films and find more success", "This man is a true role model. I grew up watching his movies and I hope he realizes how much joy he's brought to people throughout his career.", "What an amazing person. Love how truly heartfelt and humble he is.", "I love Brendan so much. I don’t know him personally but I’m 100% certain that he is such a kind person. I’m really happy to see him get the recognition he deserves after all he’s been through. I really do hope he’s awarded the Oscar and hopefully many many more amazing roles come his way. Without him our childhood would not be the same, he’s loved by many and hopefully now even more people will support him. You’re amazing Brendan ", "Brendan Fraser is a wonderful man! He has made so many childhoods and impacted so many lives. He is truly one of a kind.", "Brendan Fraser is such a talent and pure soul. Blessed to have his films raise me and can't wait for the future.", "Love, love,  LOVE Brendan ️ He's so thoughtful and kind and feels very authentic. I hope to see him in more films. Oh or even TV?!?", "It's really is comforting and heartwarming to see him again. He is an awesome human and made a bigger impact on others than I think he realizes. My God continue to bless him", "This man has been a treasure in the land of celebrities in my life, since I was a kid. Since I watched George of the jungle, Encino Man, and the Mummy series of movies. I was so sad when he fell out of the limelight, and so happy when I heard about what he went through, and his comeback story. To see him be so appreciated by everybody. A man with seemingly no skeletons, no dark past, no name on a list, just a guy doing the best he can to be the best he can.", "I used to get sad when I thought about Brendan, this overwrites all of it, I’m so happy to see him happy. Such a naturally enchanting person.", "I can honestly say The Mummy is my absolute all time favorite movie and Brendan is such a pure soul  I cannot express how happy I am that he is finally getting the love and praises he deserves\nHe did a phenomenal job playing Ben in Scrubs too. Some of the most incredible episodes in the series. Definitely ugly cried watching them", "Brendan is the kind of actor we should put on a pedestal, he's genuinely sincere, proven throughout the years that he's such a empathetic person.", "I don't really know Brendan, but seeing him in interviews for the past few years, he comes off as such an honest, caring, gentle and humble human being.  What a great guy.  I'm gonna love revisiting his films.  I hope he gets to read the great comments people leave about him.", "I had the HONOUR of meeting Brendan at a charity gig once. He was surprisingly down to earth and VERY funny!", "What an absolutely amazing human, him and his roles were and still are a huge part of my life! Love him!", "I have so much respect for Brendan. What a wonderful interview and insight into some of his performances. He’s got so much kindness and compassion towards others, it truly is infectious. The world is a better place because of people like him.", "I’m not the most positive person but his optimism and genuine excitement is infectious in the best of ways. I want nothing but good things for him", "I can't overstate how much I missed Brendan Fraser. He's always been like this, and it's why he can play those \"Babe in the woods\" characters so effectively. He emits kindness as his natural rest state. And someone get a script and Rachel Weisz on the phone, let's do the Rick and Evie show one more time!", "So glad he’s back.  Bedazzled was such an underrated film.  All of his incarnations of Elliot were amazing.  Especially Jefe.", "It's so impressive how genuinely delighted he is with the whole concept of making movies after all this time and everything he's been through. It's so wonderful to see him back and doing well.", "You can see how deeply Brendan not only connects with his characters but with the films as a whole. Such and incredible interview!!", "Quite possibly one of the few genuine, pure, and wholesome people remaining in show business/Hollywood. If anyone deserved a comeback, it’s him. The way he speaks about people with such sincerity… it’s inspiring.", "If you've watched Ted Lasso, I love that he is  so wholesome, genuine, and just oozing adoration and gratitude for life and everyone in it, without any sense of ego. Brendan Fraser is the real life version of Ted Lasso. In a world that harbors such synicism, experiencing that type of person is almost cringe inducing, but on the rare occasion when that is truly what the person is, you can't help but be drawn to it.", "O Brendan é um lorde. Que homem incrível e que entrevista maravilhosa.", "I miss this man!\nSo glad he came back to acting.\nHe's so good at his craft and so kind. And the way he gives acolades to everyone else, really shows his true character. ", "He is so pure hearted, definitely made my childhood and the fact he is still an genuine kind soul matters. ️", "Brendan Fraser truly is a gift to the world. There's very few actors that are as purely good as him. Truly altruistic. Also, he's incredible actor.", "The mummy still holds up so well even now it's crazy.  I've rewatched the first movie so much since I was a kid and I can still rewatch it today.", "He's so humble and kind, I'm glad he's alive, media has been so toxic to him. Brendan is a hero and I would love to see him in a new The Mummy film as the main character, I don't care if he put on some weight, I don't care if he's losing his hair... I'm putting on some weight and losing my hair too lol. I love you, Brendan.", "Man, it is SO good to see Brendan so relaxed and animated. Considering all the crap he has been through, it;s nice to see his personality showing through again.", "This is such an early Christmas gift. He deserves all the accolades and he's such a great person. I'm glad he's back in the limelight.", "I'm always so glad when I see new content/interviews with Brendan. Been so happy since he made his comeback :)♡ I hope he's here to stay!!♡", "I love Brendan. The Mummy is one of my favorite series ever. Such fun movies to watch, the comedy, action, romance, silliness all wrapped up into an awesome package.", "This guy is part of my childhood! He’s one of my childhood crush and I totally love his wholesome persona on screen! Gotta love this guy!", "What a humble man. Seems genuinely like a great guy and has very high level emotional intelligence and empathy.", "I hope Brendan knows how much we all have missed him, love him, and are all ecstatic that he’s back. He was a huge part of the childhood of an entire generation & will be immortal because of it.\n\nThank you, Brendan. It’s wonderful to have you back.", "Ok, he is so gosh darn adorable. You know how sometimes you don’t realize how much you missed something or someone until they re-enter your life? I have missed Brendan Fraser so much and I’m thrilled he is back.", "I’m so happy Brendan Fraser is coming back to acting again, he is so talented, empathetic and down to earth… I wish it could have been mentioned the movie “With Honors” a beautiful movie with Joe Pesci and my favorite romantic tv movie “Mrs Winterbourne”", "We love you, Brendan! It's been great seeing you in more roles the past few years", "He is authentically one of the best actors because he puts his heart into it. Thank you Brendan and holiday blessings.", "Brendan is such a beautiful person. He’s a humble hard working actor who was always able to bring a sense of fun and magic to every role he played.", "You can tell how much he identifies with his characters.  He even had positive things to say about the CGI team for the scorpion king!  What a class act.", "He seems like such a wholesome soul. Always enjoyed watching his movies.", "Good to see this man happy. Reminiscing on his past career of great movies he helped to give us. You are an inspiration Brendon thank you Sir.", "I love how humble he is, and how generously he praises others.  I remember School Ties.  He knocked it out of the park in that one.  Frankly, I didn't even know Afleck or Damon were in it. :)", "What a great interview. Really enjoyed reminiscing his greatest films.", "He made so many good movies but the one I'll always associate him with is the mummy movies. It's not just a movie for some of our gen people it's an emotion.", "I love how he remembers every actors name, every director every animal…shows he was  grateful and in the moment every second of his career. ", "I hope he knows how loved he is and how much impact he's had and still has on people's lives through his movies.", "Great personality, loads of talent and a very humble man.  I grew up watching the mummy and I remember seeing George Of the Jungle in a theater when I was a kid.  I've always enjoyed whatever he worked in and I hope he'll be back for more movies after the rough patch he went through.", "Brendan was truely one of my childhood heroes growing up. I know we can't bring his whole career down to only the Mummy but those movies had such an impact on me back then. To me he is my generation's Indiana Jones. Also, they didn't mention it in this interview but I used to watch \"Looney Tunes: Back In Action\" literally ON REPEAT!", "He is such a good guy. Im so glad he's getting a current career resurgence now. He deserves it so much.", "We love Brendan! Great actor and a kind soul that has been through much in life. Such a good interview with a very sweet man!", "Met him at a convention a few months back. Got his autograph and his assistants kept telling people to move along and not talk to him or ask him for a customized autograph. He listened to every person and customized every autograph if he was asked. He made eye contact with everyone and he was so appreciative of each person in line. Absolutely fantastic person.", "Brendan definitely makes the most best movies that can be re-watched over and over.", "I was nonstop smiling throughout this interview. I love you Brendan Fraser. Please take good care of your health and continue finding happiness in your life! Because you bring it to all of ours.", "I am so happy for this man and I’m hoping he gets the Oscar next year, he truly deserves it, his ex-wife almost ruined him financially and so did the man that sexually assaulted him", "This man deserves more credit than he receives. Absolute legend.  ", "Brendan Fraser is a legend. Hollywood should give him more roles. As an actor, he has an infinity in America's cinematic heart.", "Watching Brandon Fraser’s comeback is truly a heartwarming experience… this man has done so much and I’m glad everyone is taking notice and appreciating", "Brendan is such a gem, I'm so glad that he's making this massive Comeback.", "We need more Brendan Fraiser! He’s an absulte gem and great actor!", "Loved this video. Probably more than many of these I see. You hear people talk about Brendan Fraser about how down to earth and genuine he is, but you really don't realise how much . He's so complimentary of other actors, he understands the difficulty VFX artists have and appreciates how far its come since the 90s. Brenden is too humble for his own good.", "Love Brendan Fraser.  Wish he could have been in more movies, the mummy movies hold a special place in my collection. Im glad hes getting the love he deserves .", "Thank you Brendan for making my  childhood and adulthood full of wonderful magical moments ", "I’m so glad Brendan is now getting the love he deserves. The Mummy films and George of the Jungle were massive parts of my childhood, and looking back, it was all Brendan. He made those movies fun with his acting and comedy. ", "\"The way you talk about other says more about you than them\" Brendan is so charismatic and humble that makes this saying 100 % true, i truly want to see people give him more opportunities in the future.", "His impression of John Cleese is absolutely perfect. Love Brendan Fraser in movies, he was an essential part of my childhood", "brendan is out here killing it with serious roles but i would absolutely 100% watch any christmas movie he'd be in.. the man has such a good wholesome vibe", "An absolute legend this man is! He's the man we need, but, not the one we deserve. Very wholesome and a great watch!\nCheers to GQ and thank you Brendan Fraser for making my childhood better with George of the Jungle and The Mummy!", "The Mummy series was some of my favorite movies. Encino Man- also great! And how could I forget Bedazzled!! Brendan is a great actor but he also seems like such a fun-loving person!", "The fact that this video has 3.3 millions views in just two days just proves this man still have tons of fans that never forgot him. It's pretty easy to tell that when you're in situations like this, you did a great job", "Such a kind and humble man. Brendan you’re my hero!", "I will watch Bedazzled all day long on repeat. Amazing!  So glad to see Brendan Fraser in film again!"]}