{
    "video_id": "tjIZ6euxqdc",
    "comments": [
        "",
        "i played for several hours and never got shoothouse, why isn’t there a 24/7 playlist???",
        "Cyber Attack has been a thing.",
        "Stickers, Weapon charms, War Tracks, Vehicle camos.... I can't be the only one who's not bothered about these in the slightest (and has never used them at all).",
        "They should make a calling card for completing all challenges, im not gonna go for it but it would be really cool",
        "what's up lego ",
        "Combat record?",
        "Cyber Attack has been in the past few CoD's. I believe MW2019 was the first game they added it to",
        "So excited for this game and your videos.  Glad I found you at the end of Vanguard.",
        "\"i cant show you the new unlock because i have all the camos\"",
        "Still no Acr 6.8 or Honey Badger",
        "I hate Sbmm in warzone. I get my first match and I’m shot out of the air. I’m tired of it. I quit mw2 now. I’m done with COD. They said there was no SBMM but of course those lying bastards put it in their to get their grubby hands on more cash.",
        "So glad they brought back cyber, best game mode out",
        "Was playing throughout the night grinding some camos and attachments. One thing I noticed is a lot of players levels said 56 when mine only said 55. This is before season one dropped",
        "Call of Duty and Battlefield are ass now.\nMatchmaking is garbage and cross platform invites too many cheaters off pc.",
        "Lego there was also free items given out last time to people who play warzone. It was 3 weapon emblems, 3 double weapon xp, 3 double xp, and 1 battle pass Xp. And also two knife blueprints. They were all free. \n\nEdit: I just noticed there are 3 free Calling cards and 3 emblems as well. All rewarded for playing original warzone",
        "I play alot of mmos i was looking for a grind but  damn i was hoping to carry my achievements over lol that was wishful thinking. So i basically i have to play the game over, i got plat smgs an assault rifles. Luckily im enjoying the game i havent played mw since 2010 i think.",
        "Make a video on how to level battle pass fastest",
        "When does the season go live?",
        "battle record?",
        "Also no way to see kd or combat records",
        "Is this game on mobile yet ",
        "If I can say anything, Aphmau not only has a very consistent post schedule, but also some really nice videos. Overall, this was a funny video to watch. Keep the good work up, Aphmau",
        "Is there hardcore mode?",
        "First :)",
        "The slimline pro is finally available but says it will be unlocked with lachman sub to level 11 but I already have it at level 11 and it is still locked ",
        "I hate that I can’t reload cancel",
        "I wish you could turn off the tracers on some of the blueprints. sometimes I like a blueprint but im not a fan of tracers",
        "Do you ever get sleep?",
        "So you have to purchase finishing moves, shouldn’t there already be base finishing moves that’s was promised upon release????",
        "It’s like they put no thought into the game, not being able to preview finishes ? Boring ass similar sticker for 1000 wins ?!? At least make it a super cool big decal sticker that’s some regular ass boring sticker tht shit ain’t even worth grinding for u wouldn’t even be able to see that shit on ur weapon smh cod ya put in no effort a",
        "Has anyone talked about how the shitty big map(forgot the name) is literally just grazna raid reskinned?\nI actually really like this cod but the maps I’m not sure about yet\n\nI also gotta say I don’t see the point of calling cards and emblems anymore. Going for emblems use to be so fun, but who cares if lobby’s don’t stay together? The new gen of cod players need to know how it felt to have a lobby go for hours and be able to check the leaderboards and emblems of the players it added so much",
        "One life only is a real turnoff for newbies. Not everybody is an xpert.",
        "They changed the path for unlocking the minibak in the kastov platform.",
        "I clock 400 to 500 finishing moves per season, so no problemo",
        "Charcoal camo would look amazing on blueprint weapons",
        "Wouldn’t that be for DMZ? That seems a little more realistic and achievable than BR wins.",
        "Is the poly atomic not working for anyone else?",
        "No nerfs of stuff like decoy nades",
        "Everybody usin that slime green camo cause of youngboy",
        "Is hardcode in the update yet ?",
        "Tarnished, Are we?",
        "They removed my longshots",
        "Where da combat record?  And does the UI still lag and crash on console?",
        "finally cod bring back the og challenges",
        "\"Rapid format\" 12 minute video",
        "My favourite new part of the update is where my 10 hours of campaign data and achievements got deleted\nthanks Activision for your great game ",
        "So Much content  if u see som1 with a sticker for 1000 BR wins Just Run ️",
        "Nice Showcase...covered every new stuff without wasting any time...",
        "Why is rapid fire 10+ minutes? Trying to farm that sweet sweet ad revenue I see....",
        "I absolutely loved iw I need the Ethan operator skin",
        "so do the new weapons count towards poly and orion or do i still have to do launchers? i've been seeing people say different things.",
        "That’s dumb af that it isn’t tracking. I literally dropped my first nuke last week. God knows when the matchmaking is going to let me get a lobby good enough to get one again.",
        "I looked through the original charms in the cdl game modes before most of them even had models, and to my surprise I saw the name of the old Mr. SmuggyPuss charm (The one that M3rkmus1c made a vidoe about a while back during IW). I was going to take a screenshot but brushed it off hoping there would be a full modle for it in one of the next updates, but as you can all see now he has been removed. :/",
        "Oh boy... Jev is going to have a \"FUN\" time lmao",
        "Thanks for covering all this man. Very informative",
        "Does anyone noticed that they changed camos? If u didn't get the mastery camos before the season launched then it got significantly harder for us.. Which is unfair.. Not everyone is a streamer and plays games for a living...but now there are challenges for platinum and I think the purple one. Before it was automatic if you get all in a category u would get platinum.. Now there is a challenge for platinum.. When I hoped on playing a bunch of people were complaining.. And my camos disappeared I no longer have platinum... Instead I have to do a challenge for platinum",
        "5:10 it's for a CHALLENGE, so the base camo challenge, he did not unlock gold yet, so it won't show, normal camos arent interesting either",
        "“The calling card menu is confusing to get to”\n\nYou press two buttons lol",
        "Rip solid camos",
        "Would also be nice if the bxp had a timer, defenatly wasted a hour or 2 ",
        "What map is that in the beginning?",
        "ngl",
        "Thanx lego, i wish mw2 have zombies",
        "Again, Thank you sir for the amount of hours you put in to make these videos for everyone.",
        "3000 devs people remember 3000 devs……",
        "What happened to win 100 TDMs ",
        "E3N!!",
        "I wish they’d hurry up and add a way to save a weapon load out… there are soooo many attachments and it makes creating a new class take forever",
        "ay bro this videos was good asf, i don’t have time to play the game and this helped to what’s new. subscribed.",
        "The calling cards are great but they need to reset everyone’s calling cards to the starter set. Kinda takes the coolness out of it if someone does a glitch to get any emblem and lvl 1.",
        "Good morning, Lego!",
        "Disappointed that there’s no nuke calling card or barracks.",
        "Does anyone misses the watches and sprays from mw 2019? Why did they not include that in mw2022?",
        "Was hardcore released?",
        "Main thing I’m hoping for is combat record",
        "Love how they add so many skins and bundles and dont fix the bugs",
        "This game obviously geared toward war zone and dmz look at the calling cards and emblems, endless Ls is all these devs produce. This call of duty had me thinking it’s back baby, and this update has me tempted to uninstall. I HATE CONSTANT CHANGES. Fucking ruining games",
        "When will the season go live ?",
        "Sheesh ",
        "Cyber attack isn't new lol it was in mw2019",
        "Bro said Pogba Jr... ",
        "Like how all the melee calling cards are anime girls",
        "Where’s shipment tho",
        "Dude skipped over the black character",
        "hardcore mod?? nothing??",
        "okay i have to say it.  \"Rapid style format\", yet everytime the video is 10 mins+.\nIm not bitching, just seems kinda pointless lol.",
        "\"it goes up to 500 DMZ extractions only\"\n-> that's cause they're not sure yet if the mode will persist to exist after soo many games xD",
        "Hey Lego! If I upgrade to vault on pc but I own it on Xbox will I get a total of 100 battle pass skips?",
        "this is gone sound stupid but how can you see all of that stuff?",
        "“New game mode called cyber attack” lol",
        "Pogba isnt a junior",
        "Glad MW2 is finally getting out of early access.",
        "Dude some of those calling cards I will definitely be grinding for they look fire",
        "1:09 XM4?",
        "Is it just me or is social (friends list) not opening up since the update? I can’t inv any friends. If anyone knows anything or a fix it would be greatly appreciated",
        "Games still shit and still unfinished major L",
        "I love how you order the video with the rapid-Fire format and great content, clear and direct",
        "Theres somthing wrong with xbox it says finishing things up and u cant play",
        "When does the update actually launch",
        "no way the challenges are just now starting to track, rather than before the season started and immediately unlocking what you’ve finished, that is fucked",
        "Bounty sounds awful even more ways to punish good players",
        "Camt wait!",
        "Still no combat record?! ",
        "Bring me anime skins",
        "I havent seen anything about hardcore mode is that even coming out today?",
        "I mean I don't care about any of this stuff but you get a like because your video was the first one iv seen, stay hungry. Once again IW has punished doing good lmao.",
        "Anyone else having issues with it not tracking the progress for camos anymore?",
        "Love you videos they always make my day better  :P",
        "The challenges are there you just can’t make any progression or even level up yet so that’s annoying from the uk no idea what time I can actually level up at and do challenges",
        "before cold war snd vanguard, you were able to view the excutions. they cut them out to make space cause that was when the game was getting close to 300 gigs and people were pissed about that so they started cutting bits here and there",
        "How do I use my battle pass tokens or where do I even access my 50 battle pass ranks",
        "Can u get the prestige 5 blueprint at a later season",
        "Am I the only one who doesn’t see any changes on Xbox or will it come on a later date ?",
        "What times does the season start?",
        "Are you still playing on controller or did you go back to M&K? I’m trying to decide if I should switch",
        "So cant save custom blueprints still...wtf.",
        "2.5M is 250M for him xd.",
        "No way they added my boy ETHAN in MW2, that's so sick MANNN",
        "If you go into private match, tab over to league play, then select CDL Control, then just wait until \"start game\" is available, dont press play, instead press options/start scroll to your calling card/emblem and you can EQUIP any calling card/emblem combo you choose. Literally broke the game instantly",
        "1:40 DoOd my po teem LOL",
        "22 mins lets go p.s love your vids lego",
        "They four weapons in season 1 which is 16 new camos",
        "Are excutions fixed. Oh they did thank god",
        "Love how they have broke cammo challanges already",
        "1000 warzone wins for a damn sticker wtf is that",
        "is anyone else getting error code DIVER after the mw2 update on series s",
        "Also they re enable pings.",
        "So what was the point of buying mw2 at launch? Feels pretty messed up literally all the content was tied to the season launch.",
        "W VIDEO",
        "About time they bring back cyberattack",
        "My heart goes out to jev bc I know he's going to lose his mind when he sees these challenges",
        "Thing is turning out to be my favorite cod probably ever.",
        "I've barely played yet, today, it begins!",
        "that was actually helpful. most people these days wouldn’t dare go as in depth as u did. well done sir!",
        "\"Tell me you've never cooked without telling me you've never cooked\" B-)",
        "Was that a pitch black cdl operator?",
        "Cyber Attack is from MW 2019 but I’m glad they added it back",
        "Thanks for always informing me (:",
        "Let’s go",
        "Does anyones game on old gen keep crashing",
        "Is it me or did the colors change? White used to be white but now looks off white. Neon green is now pale green.",
        "They broke this game, I didn't have issues to this update. Freezing,  the game closing on its own and delays in sound. How is it the break more then they fix",
        "This new shoot house looks insane",
        "No combat record still",
        "Hopefully my shadow ban goes away when I wake up. Had it for 3 days now.",
        "Does anyone know how to unlock the finishing moves?",
        "Pog",
        "Go outside and touch grass",
        "can i buy the new gun in a blueprint? i’m not trying to play DMZ",
        "I love this rapid fire style video, you really take into consideration people’s schedules. I work all day and only have a few minutes to watch videos, thank you.",
        "Can you believe you cant play splitscreen in hardcore",
        "they’ve done something to the all solid camos, they look so bad",
        "& now it won’t let you play with friends, this game is a failure…",
        "I updated ,why I can't see new maps and battle pass, still  not released??",
        "All this and we don't even have the official patch notes yet ",
        "i dont see most of the emblems or calling cards i got the vault edition as well",
        "I’ll be excited when hardcore gets put in the game.. as anyone heard when it’s coming yet?",
        "When are we getting Hardcore and the dang barracks/Combat Record...",
        "7:24\nI love the attention to detail! His arms go right through the text.\nGive your editor a raise, Jimmy!! :-/",
        "Anyone else not seeing the honey badger yet in the game I thought it was gonna come out this season it’s literally in the picture we got for season 1",
        "Vanguard was stupid broken",
        "anybody else lose progress on camos? i had long shots on my ARs and now they’re all at 0?",
        "Still have to reset my game after every match when playing with friends",
        "Executions are still not fixed",
        "First",
        "Make the UI Better. I don’t want to have to scroll for 8 years to get my calling card I want",
        "Shoot house feels clanky as hell. They somehow found a away to ruin that to in my opinion smh",
        "I need that Ethan skin",
        "Hidden bruh i literally had to install 58gigs",
        "Solid black, or charcoal I was waiting for..",
        "Does using a double xp token actually track it in game with the time left",
        "I can’t progress my plat camos even tho my gold camos are all done. It’s telling me I need to complete all gold camos on my assault riffles when I already did. Is there a bug??",
        "Am I trippin or does the prestige 4 mastery calling card look like Kurapika?",
        "Have they added the new ranking up system or is level 55 max",
        "I hope DMZ takes place in a darker environment….",
        "Didn’t even talk about the breath taking start up video",
        "Hi do you if i will be able to progress the battle by playing TDM, KC and DON and not just warzone?",
        "I love your content man thanks for workin so hard",
        "When is hardcore coming?",
        "Is anyone else having problems with being kicked out of your friends lobby right after you start match making",
        "Cyber attack is awesome it isn’t new but it’s still super fun",
        "Wheres gunfight at",
        "notification gang where you at?",
        "Smii7y and his friends are the type who would create chaos in a weekend >:(",
        "I’m ready too grind an get too prestige 5 too unlock that MW2 calling card looks dope asf️",
        "A brand new game mode… cyber attack… modern warfare 1 : am I a jk to u",
        "cyber attacks not new was on MW19 as well",
        "Ethan my baby boy is back ",
        "Why at 06:44 does it say 'Dallas Empire Clayster' ",
        "No new maps beside shoothouse are u fing kidding me this should be talked about more. the cod maps we have now are trash and no content creators are talking about it, they aren’t doing anything about it they being call of duty.",
        "number 11 on trending? let's freaking go lego",
        "Ok but where is hardcore TDM????",
        "This game is surprisingly realistic. As the weapons available are the only logical way to deal with spiders.",
        "Hows the hacking in the MP since COD is now on steam?\nDo cheating accounts receive VAC bans?",
        "These get better every week I swear, I almost lost on the second video I'm so glad Jhimbo always keeps his cool",
        "I had the 725 as my last weapon to do in gold I pop the xp token that they gave us and then the update happened bruh ",
        "Cyber attack isn’t new.",
        "1000 br extractions = getting the jokr polyatomic",
        "Anyone unable to install 3 of the content packs on ps5?",
        "Charlie is determined to never fail to entertain us every day",
        "i need cyberattack in multiplayer RN",
        "The new update it’s still bullshit",
        "thanks boss",
        "I hope we can use finishing moves on every operator instead of having them locked to each character",
        "Big W ",
        "great fast paced vids lad,easy to watch when eatin HAHA",
        "YEE ",
        "I have downloaded ready and infinity ward  tweet that they release season 1 content early at 6am PST",
        "3:18 more better then 19 version. Most of the time u barely see colors of the tracer rounds",
        "Okay my biggest question is...with these new guns being added, do we still have to get mastery camos for classic weapons or can we do new guns. For example new smg, can I get that for gold and will it contribute to platinum?",
        "If you're on Xbox and your season 1 download is painfully slow, delete the game and reinstall everything.\n\nUpdating had me at 5mb download. Reinstalling was at 300mb+",
        "My man said “Brand new game mode called cyber attack” like it wasn’t in MW2019 and then continued to explain it again like it wasn’t in MW2019.",
        "Cant wait to grind",
        "I played mw2 for 3 hours straight after the update and didn't play shoothouse 1 time. Pretty good update",
        "The melee calling cards look really good in my opinion",
        "The grind is real in this game ",
        "the camos look really good",
        "NOTI GANG let’s gooo @legounlocked fuckin stoked to get home and play today ",
        "Is one the ability to mark again? That was useful.",
        "Does any one else hate that they replaces customizable character watches with these silly unrealistic gun screens?\n\nI like my guns to look real, I liked being able to pick your watch, this shit is such a huge downgrade",
        "Did they patch the calling card glitch where everyone can equip whatever calling card and emblem?",
        "all this and i still don’t have a job",
        "I think your member counter behind you is bugged",
        " love to see it Lego",
        "Pinned his own comment lol",
        "It would dope if you became the only person to actually look up what the guns are irl for the lore aspect. \nThis game is so dope with the mock up names and platforms and literally nobody covers that. Sometimes even say things that dont make sense because they dont know. Like the new ar and smg are both sigs and actually have civilian versions. ",
        "get a haircut bro",
        "I swear, Cory is one of the few YouTubers who make games more entertaining and energetic. Even the calmest games turn into hype sessions.",
        "Lego you da  bro .. ",
        "It's such a bummer calling cards don't take into consideration the stats/progress  since launch. You gave the example of longshots",
        "Just got my 4th sniper gold and the platinum challenge didn't unlock it still says 3/4 snipers gold even though I double checked through the 4 base game snipers and they're all gold",
        "The new camos and calling cards look amazing! Can't wait to jump in a start grinding. Cheers Lego.",
        "I will now be able to skip the joker and the shield for poly",
        "Dang bro, be less greedy. How many commercials was that 30?",
        "Does anyone know what time hardcore is coming out in the UK time cause I'm struggling to find out",
        "Dark violet looks like cross fade from r6 on valks gun",
        "I heard that you can change the main menu theme is that true?",
        "Bunch of trash, there is no new multiplayer maps!?",
        "1:10 \nThat isn't a new mode, it was in MW 2019",
        "Pro player specific stickers?! Absolutely amazing they even had one for zoomaa!",
        "Man I'm downloading the update now. Thanx for showing what's new. Can't wait to hop in and play. See y'all soon",
        "Solid camos go hard, happy I don’t have to buy any bundles to get them.",
        "WHERE IS GUNFIGHT",
        "Season 1 is a whole lot better than the full game of vanguard.",
        "In bounty players who do the best get punished? sounds familiar to every other gamemode in this game with sbmm so nothing new",
        "Yoo I was right about Ethan lmao thank you Lego",
        "Can you save gun loadouts yet?",
        "Im doing the download know it’s a two hour download for me",
        "Is there a way to see all these skins and stuff myself or did they gift wrap them all for you in one bundle for you to be able to do this. I really want to see these items on screen myself.  But I don't think I should even bother.",
        "Holy cow a lot of people are going to have to have a patch of grass next to there desk while unlocking these calling cards and stickers ",
        "They should have done the original MW2 prestige emblems, I'd love to see those again.",
        "Lego, I always look forward to your videos. Thank you for everything",
        "That game mode, if you remember, is what sabotage was in the OG MW",
        "8:02 not really :/ I wish it was 1k also I get alot but my Id is thebootywarrior",
        "So I just hopped on and it won't allow me to access my platnium challenges for AR's, I'd been waiting for shoot house to come out and when I looked at the progress before today's update I had all 8 AR's done and had 10 Longshots for only the m4, now none of my AR's allow me to access the challenge dispite having every AR gold excluding the new dlc weapon, even my longshot progress on the m4 reset so I have no idea what the problem is, luckily its my only category I had all gold but still frustrating.",
        "Just wanted to say that I am so glad I found your channel. Your videos on getting gold/platinum on launchers/riot shield/knife have helped me a ton! Keep up the great content!",
        "Great content but I don't approve of the PAID battlepass and weapon Blueprints/Operators in a P2P game. If it was F2P I wouldn't mind so much but this is awful,  they do it eac hyear and it's why I won't buy till a deep sale.",
        "The ui got even worse. I didn’t think it was possible. Also the challenged for the calling cards are horrendous.",
        "This makes my heart feel warm ngl, it was worth waiting and buying the vault edition. I haven’t played the new season 1 yet, but i sure hell can’t wait. I’m so looking forward to it ngl",
        "Still no combat records!!!!! Still no point in playing then!!!!!!!!!",
        "Man said Pogba Jr",
        "wtf where do you get this early footage from",
        "still no hardcore",
        "If you think that 1000 br extractions is the hardest thing to unlock in cod history you never grinded black out operators……..️",
        "There is no need to see what camo you unlock… you will unlock it by the time you get to another one.",
        "Cyber attack is old",
        "Bro thank you so much no homo love you bro",
        "Cyber is back! Literary 1 of 3 game modes I played in modern warfare",
        "Thx for info as always",
        "is there a way to view what challenges to do for unlocking stickers?",
        "I don’t like how they dumbdowned the solid color camos they’re not as vibrant",
        "Thanks for covering all this man. Very informative ",
        "W",
        "Here's a tip get 95% of emblems and calling cards!\nGo to multiplayer - private match - create private match - call of duty league - CDL hardpoint - click but don't start. Then go to calling cards and emblems. All unlocked.\nCheers ",
        "They didn’t add the double ex token timer",
        "Finally some content games been dry the last weeks",
        "U look like my aunt",
        "Lol no, they are like vanguard, weak and they aren't tracers, mw 2019 had actual tracers and they were the best",
        "Can we save blueprints?",
        "Hey I need help. So before the update I already had all my 8 assault rifles in gold and now I wanted to do the Platin challenge and it says I have 0/8 gold challenges completed. I can still put the gold camos on my weapons tho??",
        "Oh boy. That black on black CDL skin is going to be trouble in dark corners lol",
        "still no hardcore aka tier 1????",
        "Anyone know how to fix the issue of 0/8 guns gold on my Assault rifles there all gold I can't continue my camo challeges",
        "The gamemode punishes you for doing the best? Well atleast that’s representative of SBMM as a whole",
        "There is a bug where I can't see the progression on camo base camos challenges, still says I am at 0 on double kills for the Lachmann-556",
        "Funny my shit aint poppin up not even battle pass nothing n i pre ordered the vault edition, never got my beta skin but got all the useless fkn charms and stickers, i hate cod devs, 186 dollars down the fkn drain",
        "I can't wait!!!!",
        "1000 wins… god",
        "i noticed orion moves faster it looks so good in game",
        "bro said pogba jr",
        "I'm confused as to why I don't have my 50 battle pass tiers like the vault edition said it would give",
        "Cyber attack isn’t new just saying",
        "DMZ extractions are way easier than BR ones",
        "my game runs worse now",
        "bro they fucked up the solid color camos.",
        "I really like the new gun screens. Being able to see how I'm doing in game without having to check the scoreboard and obscure my vision is very nice",
        "I'm gonna try warzone 2 but I'm never going to get the calling cards because I hate battle royales",
        "I want Cyber Attack back in multi-player!",
        "I wonder if that ribbon above weapon unlocked notification is just a placeholder for the proper image and name of camo?",
        "I unlocked some calling cards and emblems that aren't on that list. No idea how I got them",
        "Did they fix the offline mode ive reported it but not sure if it got through to them",
        "Hope they don't hide the k/d tracker behind a paywall again. They eventually put the watch in the battle pass after push back last time.",
        "cdl thieves skin looks like roze 3.0",
        "thanks for the info man, good vid. btw u need a better haircut my boy.",
        "Ghastly Green would be a sick camo for the Honey Badger. A suppressed, stealthy weapon with a ghost themed skin",
        "did you notice they made the NEON LOUD camo less green/less neon/less bright \n\n:( it was so perfect before",
        "If you have 1k BR Wins and DMZ you need to touch some grass. I feel like thats what you were thinking ",
        "Cyber was in mw2019",
        "ugh, the Modern Warfare aestethic is already done for",
        "I really like how well they organized all the challenge calling card and camos for this game so far its satisfying! Good job Activision, to bad the other UI is still clunky!",
        "So this confirms it ..... launch was a beta",
        "Nooooo stupid tracer bullets again!!!?? Noooooo this gonna turn into 19 and warzone 1/ fortnite all over again",
        "Dude, you're a sweat.",
        "And just like that realistic cod has went down the toilet with one update",
        "Will the prestige calling cards & Emblems be limited or like the Cold war system?",
        "I hate this nerd so much but he gives news so fast",
        "Did they add hardcore? I’m stuck at work for another 6 hours",
        "Still waiting for mine to update \nEdit, also wanted to say, this dude is very positive and I love positive content creators.",
        "Why don't they put cyber in multi-player that shit smacksssss"
    ],
    "comments_disabled": false
}