{"video_id": "tjIZ6euxqdc", "comments": ["All this and we don't even have the official patch notes yet ", "Again, Thank you sir for the amount of hours you put in to make these videos for everyone.", "I swear, Cory is one of the few YouTubers who make games more entertaining and energetic. Even the calmest games turn into hype sessions.", "I love this rapid fire style video, you really take into consideration people’s schedules. I work all day and only have a few minutes to watch videos, thank you.", "The new camos and calling cards look amazing! Can't wait to jump in a start grinding. Cheers Lego.", "Just wanted to say that I am so glad I found your channel. Your videos on getting gold/platinum on launchers/riot shield/knife have helped me a ton! Keep up the great content!", "Charlie is determined to never fail to entertain us every day", "Was playing throughout the night grinding some camos and attachments. One thing I noticed is a lot of players levels said 56 when mine only said 55. This is before season one dropped", "I really like the new gun screens. Being able to see how I'm doing in game without having to check the scoreboard and obscure my vision is very nice", "If I can say anything, Aphmau not only has a very consistent post schedule, but also some really nice videos. Overall, this was a funny video to watch. Keep the good work up, Aphmau", "I really like how well they organized all the challenge calling card and camos for this game so far its satisfying! Good job Activision, to bad the other UI is still clunky!", "Nice Showcase...covered every new stuff without wasting any time...", "This makes my heart feel warm ngl, it was worth waiting and buying the vault edition. I haven’t played the new season 1 yet, but i sure hell can’t wait. I’m so looking forward to it ngl", "Ghastly Green would be a sick camo for the Honey Badger. A suppressed, stealthy weapon with a ghost themed skin", "The melee calling cards look really good in my opinion", "that was actually helpful. most people these days wouldn’t dare go as in depth as u did. well done sir!", "I hope we can use finishing moves on every operator instead of having them locked to each character", "5:10 it's for a CHALLENGE, so the base camo challenge, he did not unlock gold yet, so it won't show, normal camos arent interesting either", "I love how you order the video with the rapid-Fire format and great content, clear and direct", "Thanks for covering all this man. Very informative ", "Still waiting for mine to update \nEdit, also wanted to say, this dude is very positive and I love positive content creators.", "These get better every week I swear, I almost lost on the second video I'm so glad Jhimbo always keeps his cool", "Main thing I’m hoping for is combat record", "That game mode, if you remember, is what sabotage was in the OG MW", "They should make a calling card for completing all challenges, im not gonna go for it but it would be really cool", "Thanks for covering all this man. Very informative", "It's such a bummer calling cards don't take into consideration the stats/progress  since launch. You gave the example of longshots", "before cold war snd vanguard, you were able to view the excutions. they cut them out to make space cause that was when the game was getting close to 300 gigs and people were pissed about that so they started cutting bits here and there", "Lego there was also free items given out last time to people who play warzone. It was 3 weapon emblems, 3 double weapon xp, 3 double xp, and 1 battle pass Xp. And also two knife blueprints. They were all free. \n\nEdit: I just noticed there are 3 free Calling cards and 3 emblems as well. All rewarded for playing original warzone", "This new shoot house looks insane", "Man I'm downloading the update now. Thanx for showing what's new. Can't wait to hop in and play. See y'all soon", "I love your content man thanks for workin so hard", "I’ll be excited when hardcore gets put in the game.. as anyone heard when it’s coming yet?", "Will the prestige calling cards & Emblems be limited or like the Cold war system?", "Love how they add so many skins and bundles and dont fix the bugs", "3:18 more better then 19 version. Most of the time u barely see colors of the tracer rounds", "7:24\nI love the attention to detail! His arms go right through the text.\nGive your editor a raise, Jimmy!! :-/", "Wouldn’t that be for DMZ? That seems a little more realistic and achievable than BR wins.", "If you go into private match, tab over to league play, then select CDL Control, then just wait until \"start game\" is available, dont press play, instead press options/start scroll to your calling card/emblem and you can EQUIP any calling card/emblem combo you choose. Literally broke the game instantly", "The grind is real in this game ", "So excited for this game and your videos.  Glad I found you at the end of Vanguard.", "Cyber Attack is from MW 2019 but I’m glad they added it back", "Hope they don't hide the k/d tracker behind a paywall again. They eventually put the watch in the battle pass after push back last time.", "Pro player specific stickers?! Absolutely amazing they even had one for zoomaa!", "This game is surprisingly realistic. As the weapons available are the only logical way to deal with spiders.", "I want Cyber Attack back in multi-player!", "Cyber Attack has been in the past few CoD's. I believe MW2019 was the first game they added it to", "Charcoal camo would look amazing on blueprint weapons", "I looked through the original charms in the cdl game modes before most of them even had models, and to my surprise I saw the name of the old Mr. SmuggyPuss charm (The one that M3rkmus1c made a vidoe about a while back during IW). I was going to take a screenshot but brushed it off hoping there would be a full modle for it in one of the next updates, but as you can all see now he has been removed. :/", "Does anyone misses the watches and sprays from mw 2019? Why did they not include that in mw2022?", "i noticed orion moves faster it looks so good in game", "Lego, I always look forward to your videos. Thank you for everything", "The calling cards are great but they need to reset everyone’s calling cards to the starter set. Kinda takes the coolness out of it if someone does a glitch to get any emblem and lvl 1.", "Love how they have broke cammo challanges already", "I wish you could turn off the tracers on some of the blueprints. sometimes I like a blueprint but im not a fan of tracers", "Does anyone know how to unlock the finishing moves?", "Anyone else having issues with it not tracking the progress for camos anymore?", "Love you videos they always make my day better  :P", "Would also be nice if the bxp had a timer, defenatly wasted a hour or 2 ", "There is no need to see what camo you unlock… you will unlock it by the time you get to another one.", "So you have to purchase finishing moves, shouldn’t there already be base finishing moves that’s was promised upon release????", "My favourite new part of the update is where my 10 hours of campaign data and achievements got deleted\nthanks Activision for your great game ", "Stickers, Weapon charms, War Tracks, Vehicle camos.... I can't be the only one who's not bothered about these in the slightest (and has never used them at all).", "So glad they brought back cyber, best game mode out", "is there a way to view what challenges to do for unlocking stickers?", "Dude some of those calling cards I will definitely be grinding for they look fire", "Did they patch the calling card glitch where everyone can equip whatever calling card and emblem?", "“The calling card menu is confusing to get to”\n\nYou press two buttons lol", "No way they added my boy ETHAN in MW2, that's so sick MANNN", "There is a bug where I can't see the progression on camo base camos challenges, still says I am at 0 on double kills for the Lachmann-556", "Just got my 4th sniper gold and the platinum challenge didn't unlock it still says 3/4 snipers gold even though I double checked through the 4 base game snipers and they're all gold", "I’m ready too grind an get too prestige 5 too unlock that MW2 calling card looks dope asf️", "1:10 \nThat isn't a new mode, it was in MW 2019", "I clock 400 to 500 finishing moves per season, so no problemo", "They should have done the original MW2 prestige emblems, I'd love to see those again.", "I had the 725 as my last weapon to do in gold I pop the xp token that they gave us and then the update happened bruh ", "DMZ extractions are way easier than BR ones", "Shoot house feels clanky as hell. They somehow found a away to ruin that to in my opinion smh", "The gamemode punishes you for doing the best? Well atleast that’s representative of SBMM as a whole", "Holy cow a lot of people are going to have to have a patch of grass next to there desk while unlocking these calling cards and stickers ", "I wonder if that ribbon above weapon unlocked notification is just a placeholder for the proper image and name of camo?", "the camos look really good", "Thanks for always informing me (:", "Is anyone else having problems with being kicked out of your friends lobby right after you start match making", "They changed the path for unlocking the minibak in the kastov platform.", "finally cod bring back the og challenges", "ay bro this videos was good asf, i don’t have time to play the game and this helped to what’s new. subscribed.", "About time they bring back cyberattack", "In bounty players who do the best get punished? sounds familiar to every other gamemode in this game with sbmm so nothing new", "i need cyberattack in multiplayer RN", "Is there hardcore mode?", "Cyber is back! Literary 1 of 3 game modes I played in modern warfare", "They didn’t add the double ex token timer", "Smii7y and his friends are the type who would create chaos in a weekend >:(", "I wish they’d hurry up and add a way to save a weapon load out… there are soooo many attachments and it makes creating a new class take forever", "Can we save blueprints?", "If you think that 1000 br extractions is the hardest thing to unlock in cod history you never grinded black out operators……..️", "Am I the only one who doesn’t see any changes on Xbox or will it come on a later date ?", "It would dope if you became the only person to actually look up what the guns are irl for the lore aspect. \nThis game is so dope with the mock up names and platforms and literally nobody covers that. Sometimes even say things that dont make sense because they dont know. Like the new ar and smg are both sigs and actually have civilian versions. ", "Is one the ability to mark again? That was useful."]}