{"video_id": "toBTPGfurLc", "comments": ["It’s the uncomfortable choreography, it’s the drip, it’s the color scheme, it’s the loneliness, it’s the cowboy Kenny era and I LOVE IT.", "Veo elegancia, veo soledad, veo paranoia, veo frustración, veo debilidades intrapersonales. Awesome video brother!!!", "A real artist. These are the ones who keep hip hop breathin\n\nBig ups to Kendrick! This Album was dope. Artistry.", "kendrick é um belo filho da mãe mesmo, né?! o cara compões poemas, escreve histórias, revoluciona a indústria (dnv) com um novo álbum e ainda entrega isso tudo no clipe??\nGOAT, apenas.", "Las letras, la estética, lo hace tan hermoso, gracias kendrick por tu gran aporte al arte♡", "exactly how I be dancing to this banger in my room bruh, there’s no one like Kendrick, the fit, the colours the freedom of movement, another masterpiece", "Kendrick never disappoint us", "It makes me so happy to see how he is evolving artistically, his integrity to his craft is truly inspiring. As well we can see how comfortable he is with his creative expression. \n\nThis is one of my favourite songs on this album.", "Kendrick nunca decepciona 🇧🇷", "Kendrick, é um verdadeiro ARTISTA, ele vai muito além da musica.", "Kdot is such an important artist!!! God, this man is a genius in every aspect!!!! Glad to get these beautiful visuals to this track!!! Love this track!!! This is how you make a \"Commercial\" track!!! This is too dope with a great message and not selling out!!! This needs to be on every radio station!!! Real music for the youth!! But Grown man music at the same time!!! Kenny is for everybody!!! King Kendrick!!!", "His cadence and body movement are just impeccable. Kendrick is an artist.", "Man if this ain't that relatable state of mind, the state of loneliness but also kind of enjoying your own company, I don't know what is. Overthinking everything when alone, the deep true thoughts, the random dance you do to when no one is watching to release the stress, the anxiety. Thinking about life-good and bad. Kendrick will take you on a journey and make you feel a certain way, a true artist, a true gem. KDOT a real one", "The visual, the beat , the lyrics are all ", "Kendrick is becoming this other thing!!! I love it.. a shifting energy ️ ", "I love Kendrick. His artistry, the words he says, his spirituality, his KDOT side, the way he will rap about God & how he speaks to angels, he doesn’t disappoint when it comes to his music bc he seems to rap from his spirit so of course this is a vibe. It’ll never be another Kendrick.", "I love this song and this video. It's motivational. The idea of dispelling the negative self targeted thoughts. Because the path of loneliness is the one chosen. There's nobody to validate or criticize you. And it's a struggle figuring out the balance of doing it to yourself. Maybe it isn't healthy, but it's all that's known.", "Always persistent in making these powerful videos,Nah for real he knows how to explain his music ️", "One of my fave joints off the album. I love the art he invokes in this visual", "I love you Kendrick Lamar. Through your art I've become who I am today.", "His music always hits my soul differently!!!!!", "Assisti esse clip, dançando junto com ele. ️", "As a film student, Kendrick is an amazing source of inspiration. The shots, the color, the dance, the editing, everything is CLEAN.", "EVER TIME HE POSTS …no matter how long he takes it’s always WORTH THE WAIT NO CAP  BRO JUST GETS BETTER WITH TIME. IM PROUD OF YOU BRO ", "S/O to the filmmakers on this project! This one and DNA are my favorite. Kendrick is our voice of self awareness. This man makes you tap into your inner self. If you have any sort of lack of emotions, go listen to Kendrick’s music. He’ll open your mind to some S#%$ you forgot about or tucked away. Because in the end you gotta work through all your emotions. You can’t run from them, they’ll most of the time catch back up with you and put you through hell. His music is therapy to my ears. I’m grateful to say I’ve witness a man of music like him. This man stays away from the spotlight, puts out music when he’s ready to, every album was a masterpiece in its own way (to me), he’s still one of the top artist with all the gap space on released music, and… I can go on and on about what this man can and had done, but imma just leave it at that. King Kendrick ", "My Man is really developing his artistry to another level, keep it up Ken, one love.", "No lie, this is me in the house every time I hear this song…. This man and his vision! ", "This man is simply incredible and he never disappointed me !", "Muito sucesso guerreiro sou seu fã", "Never ever going to disappoint his fans that's why his fans love him ️", "This brother is well into his higher self Lyrically mentally he’s rapping he is in his higher self respect man continue to make great music. I’m not alone when I say this. I 100% support you’re music sir thank you.", "When it's all said and done his reign will be the most meaningful. He really did it his way and held that top spot down.", "impecável, brabo dms ", "Man if he doesn't win all types of awards this year something is wrong with the music industry. He's a musician lyrical genius.", " 10 years ago \"Swimming Pools\" was my ringtone for the longest time on my phone (1-2 years). I think \"Rich Spirit\" will be the next one Another masterpiece. Your music is nothing but a pure art! ", "The Visuals are so amazing, the creativity is unmatched", "Na moral esse cara é extraordinário", "Everything about this is pure artistry", "Kendrick Lamar will never repeat himself with his album sound, he’s always evolving and that’s just impressive on it’s own, that’s why we always look forward to his albums.", "inspiration he is to not just me - but so many new artists today. Influencing the next generation of artists! Big respect and love for Kendrick", "my favourite song on the album. blasting it in a droptop during the summer... unparalleled", "A song to shape feelings and thoughts. Take a chill and feel the ground move with only words  and rhythm.", "Kendricks music is always powerful ️ ", "Choreography, color theme, perfect edit, the song itself wonderful work", "There's a reason everybody loves Kendrick's music. He's a true musical genius.", "Kendrick Hit's HARD He Never Dissapoints", "I love him...his concert was everything", "The whole album saves me from suicide everyday ", "This song is so Therapeutic, out of this world this man, really walking ,in his calling, and growth, the fact that  it’s Relatable, Speak so many Volumes, Kendrick your music is so nurturing & healing alot people", "Kendrick consistently gets the best cinematographers around. His music videos are more like music movies. Cinematic masterpieces.", "I can't stop listening to this, Kendrick getting better with age, damn.", "Kendrick's showing us once again, \nHow it's really done.", "Obra de arte!", "Honestly I don't think this album will ever be majorly popular or have the same crazy radio play or replay value but the songs feel deeply intense to listen to", "This is powerful. It’s like every time you get into a zone, there’s always a distraction to snatch you out of it. This world is designed so that you never take the time and focus on yourself.", "People just take Kendrick's genius for granted... he's such a singular artist.\nMr. Morale is an absolute masterpiece!", "This is one of my favorites from the album, and Kendrick never disappoints with his visuals. Freaking love it all!!!", "Minha nova música favorita.", "Still best album of the year don't see any hiphop album beating this for year 2022", "Maaan,this will be going on replay for a long time. Thank you for this gem,mr. Lamar <3", "Oh my god! Why does he move me with the lyrics + videos! He’s beyond the word artistic ~ “ just legendary”", "If Mr Morale himself doesn't win the Grammy, that's it for the Grammys. We know he already won in our hearts", "Phenomenal song paired with a phenomenal album", "Kendrick don’t just make music he makes ART", "He's so subtle and consistent with his imagery . He's the definition of an artist. He just happens to be one of the best rappers of all time.", "Kendrick deserves another grammy forsure ", "Todo lo que saca se convierte en Joya, larga vida a Kendrick", "One of the greatest albums ever made", "Love that amazing vibe. Thank you Kendrick", "Haven't been too big on Kendrick, but this joint is hard. Video topped it off! Everyone who was a part of this song / video deserves credit!", "This song is   and the director did the justice CALMATIC", "Bro you and your\nMusic just make life easier and more acceptable if it wasn’t for your face words and voice to see and hear my life would be in a very different place my hearts goes out and goes deep to the real lyricist who pour their heart and soul into this blessings to you️", "The growth in your craft is truly inspiring my brother ", "King Kendrick has blessed us once more with his legendary artistry \n\n\nAb-Soul’s Aye compliments the track immensely", "Gonna miss him at TDE, but man did he have a hell of a run with them. Can’t wait for what the future holds for him! ", "OH. MY. GODD!!!! Never expected such a tragically profound cinematic experience from a simple rap about a man just talking to his thoughts! ", "Love his rhythm, love his style ", "K. Dot is pure art. The lyricism is elite!", "Legendary track and visuals. I am so grateful for Kendrick Lamar", "I gotta say this is hand down my favorite album of all times.", "I swear not matter what period of my life I'm in when I'm feeling like shit kdot always drops something that gets my spirits through.", "retrospective vibes. deep into the rabbit hole. rap is a filter. Mr. Kendrick keeps his common sense on the edge and portraits it with a rich taste. respect from Baku.", "This album is going to age incredibly, mark my words.", "Meu espírito agora está completo e rico ", "Album so damn underrated, you get my props for bringing deep rap back to the forefront without sacrificing beats or choruses", "I told my best friend when this song came out that it was my favorite of the album. I’ve listened to it EVERY DAY since MMATBS dropped. Everything about this song (and now video) is perfect.", "Kendrick!! A whole vibe...it's what I been missing! Keep'em coming...", "Lord bless this man, he's not a rapper he's a spirit medium. This video is work of art best video in my view in a long time a true breath of fresh air", "Mi album favorito del año", "One of the best songs on the album  congratulations on the Grammy nominations", "The greatest meaningful lyricist of our lifetime while making it fun to watch.  Kendrick is the GOAT. ", "You are so special Kendrick we all love you deeply", "Thank you Mr lamar allow me give you flowers when you can still breathe,your music is insanely medicine to my soul.", "One of my favorite song on the album thanks kendrick", "What can I say...PURE TALENT", "Kendrick is a cultural icon. A defining voice of the 21st century. So glad to be alive to experience his art <3", "Man always kill it with the artistic visuals", "saw you perform in toronto in 2012! So proud of how far you’ve come this shit is fire ", "Gran canción", "This video just makes the song even better, like I get it even more and just feel it so damn much"]}