{
    "video_id": "toBTPGfurLc",
    "comments": [
        "️️️️",
        "Why can't I stop listening to this song.",
        "Damn, straight fire!!",
        "This sh!t hard!",
        "I like how this videos depicts his isolation and him avoiding social interaction. He understands that solitude is healthier for his spirit in the long run but it's clearly taking a bigger toll on him than he expected.\n\nHe clearly loves the freedom being alone gives him, but still craves community. This is symbolised by the phone or a knock that LITERALLY snaps him out of his groove. As if social relations disturb his peace which is hella relatable.",
        "you fell off",
        "Finally put the Drill down and listened to Kendrick again.... Wow!!!! I needed this!!!!",
        "SUPER AMAZING",
        "Keep being real!! ",
        "Spectacular work of art by the artist",
        "I've watched to 10 x plus I've shared it to everyone I love...\nThank you MR Lamar",
        "greatest rapper ever hands down i love every song you make i went to his concert it was some of the greatest stuff i have ever seen he is the G O A T",
        "He speaks about grieving , talking to the ones we lost  , how angry it makes you in the inside , dealing with the shadow version of yourself , and staying focused on the things you need rather than what you want and the battle of staying against his shadow , when he talks on the phone he’s talking to someone who can’t answer back. Rich soul attracts money, he’s speaking to other African Americans to load up with knowledge and protection.",
        "🇰🇰  ",
        "Best video of the year",
        "🇮 ",
        "His cadence and body movement are just impeccable. Kendrick is an artist.",
        "uuuuuuuuuuuuuuuuuuuuuuuuh",
        "HE IS ART, this was such a beautiful album. The video topped it off.",
        "real cali music",
        "  🇷🇷",
        "It’s funny how I was dancing like this to the song before the visual .  he’s in a mansion all alone with a home phone aka land line . The concept is deep . Basically nobody is home . I love it .  the phone is not connected cause he feels disconnected. Nobody is listening to him when he speak . They do their own thing . So he fasting from the toxic ppl. “ I pray to god she knows them Cabo trips don’t last forever “ he wrote this before a girl was killed in Cabo by her “ friends” . Kendrick is so intuitive. Not saying he knew that would happen. But the fact that he knows how the ppl in this world can kill you. Even those close to you.",
        "To warp up being rich yet the pain of loneliness to checking the ego to feeling disconnected …etc masterclass",
        "No one realizes how he’s in so rhythm and how he deliveres with his beats to where u cannot stop watching it. He takes his time with his music .",
        "this song always felt like a tribute to drakeo the ruler to me. vid has no explicit references but i still feel drakeo’s influence",
        "Finalmente algo bom para alegrar o dia ",
        "Incroyable (sans parler de cette coupe de cheveux qui lui va parfaitement bien !)",
        "K dot saved rap he’s at he’s most genius now",
        "I loveeeee it 🫶 on repeat.",
        "This Song deserves the Grammy \nLet's hope he wins all the 7 nominations...",
        "best popular musician by a distance",
        "Bro them earrings Have to go",
        "Heard him from Humble\nAnd never left ",
        "Am I the only one who has to hold back tears everytime they watch a Kendrick music video? What a blessing",
        "Kendrick's creativity and ability to draw beautiful pictures through his music, art, and story telling is amazing. He's in his own lane.",
        "Whether it's a stadium show, a video or just a 1 on 1 interview....everything this dude does is captivating and inspiring ",
        "Kendrick is really precise with what he puts out and how he depicts his artform , the message behind the artistry is on a Godly level of Christ consciousness , his sound is forever evolving I'm glad to witness the era of Kendrick",
        "My fave song from this album getting some love.",
        "One of the best songs on the album  congratulations on the Grammy nominations",
        "Legendary!!!",
        "The best song on the album when first heard it but now don't like it cuz it's everybody bout to play it",
        "we’re looking to a 2022 mulitple grammy winner right here.",
        "Kendrick Lamar at it again  I LOVE THIS SONG!! It’s one of my top 5 on Mr. Morale!  Next to Crown, this song was beautifully made! ",
        "This track is crazy good",
        "So sad how well this song fits what happened to Shanquella.  Especially at about the 2:15 mark. He literally mentioned: (1) The entourage is dead (2) Cabo trips (3) praying (compassion) when someone dies",
        "He's so fucking good",
        "K-dot always gives different vibes.. Beat production is ...",
        "8 grammys, absolutely deserved one of the greatest of all time and people still won't admit it.",
        "im so sad this song is underated",
        "I love him...his concert was everything",
        "yoo I dont know whats up with this track but it put me a mad trans.I LOVE IIIIIT its just ....DAMN!!!",
        "I am loving this era of Kendrick, this album came at a special time . . . I ain't got words honestly to describe",
        "Yeah!!! Kendrick Lamar always been on another level not sure who can compete they need a rocket  to get to his level!!! Goat keep making hits like this big bro 2022!!! #Richspirit",
        "I absolutely love this",
        " 🇷🇷",
        "Yooo..put him in his own movie already ....he did great in power series anyway..",
        "Kendrick, é um verdadeiro ARTISTA, ele vai muito além da musica.",
        " ",
        "Not all that long ago peeps was asking where Kendrick was and how long till he blesses us with some new music. Well...... He was finding and working on music worthy enough to put out and what a treat it is. Thanx man :)",
        "This is why you're one of the greatest artist on the planet. Being vulnerable, true to yourself in isolation & comfortable in your skin no matter how it goes.",
        "exactly how I be dancing to this banger in my room bruh, there’s no one like Kendrick, the fit, the colours the freedom of movement, another masterpiece",
        "Guys let’s get this guy to win album of the year he deserves this",
        "HE DID THAT!!!! ……Loved it so ArtisticAnd different unexpected….What’s Next Cowboy????",
        "This part was too clean 1:34 \n\nTryna keep the balance I’m staying strong ",
        " 🇨🇨🇹",
        "Bitch am attractive... 🇰🇪",
        "Kendrick is a cultural icon. A defining voice of the 21st century. So glad to be alive to experience his art <3",
        "we need a savior music video!!!",
        "Favorite Track On The Album",
        " 🇮",
        "Wow!!! Masterpiece!!!",
        "Now that you've played the album more than once. Do you realise why we were hyping it from day one now?",
        "07:22",
        "Looking at these visuals...I can safely say Dot has entered a very rare dimension where hes made peace with his vices and completely don't care about outside opinions of him. Congratulations Mr. Morale",
        "This Shii a banger gotta keep it on repeat ",
        "0% models\n0% mumble \n0% nudity \n100% pure talent",
        "This definitely one of the best songs on the album",
        "I love you Kendrick Lamar. Through your art I've become who I am today.",
        "Kendrick never disappoint us",
        "This is now my favorite song ",
        "Kendrick has such a unique presence in his videos. He def a character  I like the satire in his videos",
        "Taking my baby to school then I pray for her!",
        "The album is still on repeat. Incredible work!",
        "Help send a box of skate gear I'll get it done.",
        "This man is a legend ",
        "Now I want some cowboy  boots haha. Concrete jungle is the new country life.",
        "bruh, for some reason hes giving me jack sparrow vibes. love tf outta kendrick man. keep doing you and making great music. wouldve been awesome if a good feature came in at the phone ring in the end.",
        "True shit ",
        "this man is so talented, i hope he keeps making music for a long time.",
        "This is the first time in a very long time I've watched a music video more than once in a very long time... Kendrick embodied people like me that stay home and work on themselves and enjoy the company of themselves,. Looking at the phone ring, not wanting to pick up because they interrupting the vibes.  \nThis is the dopest piece of art in a while",
        "🇰",
        "It's the feeling, the pain behind the lyrics, the way he takes us on this ride through the reality. I mean, this is surreal. A true masterpiece. you've already won. Grammys 2023",
        "3:11 could be a fire alternative album cover",
        "Easily one of my favourite songs off of the album. Kendrick is the true definition of an artist. Love the video and how well it fits the song ",
        "Thanks for the likes, I´m gonna go buy a toilet seat with them.",
        "🇮",
        "One of the few genuine musicians never watering down a vision. Thank you Kendrick",
        "cada vez que escucho me gusta más",
        "Dope ",
        "Man this song is good. It helps me get over anything. Thank you King Kendrick ️",
        "This a Bangger Brother!!!!",
        "His acting ability  hard",
        "I'm convinced that KDot watches Pirates of the Caribbean",
        "Whoa!! The symbolism in this video was amazing. The colors. Red (sinner/deviant) to White (enlightened/cleansed). The choice of timing. Night to day. It seems as if Kendrick was really \"fasting\" from something. The life of lust, pride, ego, and temptation? (Based on the theme of the album) To now focus on things that make him feel like a better person? Ex. being a father, abstaining from adultery, etc. Right when he gets to that cleansed, bright, and wonderful stage of breakthrough where he was wearing white and freeing himself from the darkness the phone rings again. Symbolic of all of our vices, and how it's able to turn into a cyclical battle. Right when you're ready to change you get sucked back in.. or at least tempted to. Anyways, I say all that to say that I enjoyed the visual aspect of this music video a lot! ",
        "He got tha high power in this video ....yaaaaaa tha Lord ",
        "He went super Saiyan with them earrings 1:43",
        "yo",
        "Esse álbum só melhora com o passar do tempo...",
        "I like the sound of that",
        "This masterpiece is top tier. Thanks king!",
        "🇰🇰🇰",
        "Humble, DNA, King Kunta where are follow ups to those hits....",
        "와~ 정말 개간지 핵간지 씹간지 3종 셋트 늦덕 갑니다",
        "Sir, you are beautiful. Love your physical performance in this piece.",
        "He's definitely an artist, transcending spoken word to visual metaphors . Absolutely love that progression, salutations from the 254🇰🇪",
        "No words can explain how much I love this one , holy $#!t ,",
        "I kno Jack sparrow loves the opening",
        "Damn I love Kendrick",
        "Somebody needs to stitch this to the OG version",
        "I see theater, I see music, I see art, I see Kendrick!!",
        "THE STORY LINE I WATCHED LIKE 12 TIMES",
        "Gotta love artist who still appreciate the art of music videos ",
        "Show me a Artist who gives us this chill vibe other than Kendrick the GOAT ",
        "The fact that the fourth wall of the stage is a mirror is so poetic. Every thing he says and does is focused on the larger message this is one of the greatest artists of all time. we are witnessing here a poet that rivals the likes of Dante and Shakespeare.",
        "This guy has replaced Kanye! Love his music. A genius..",
        "me when i'm home alone",
        "That’s real art ️‍️",
        "best song on the album",
        "O MELHOR rapper da atualidade!🇧🇷",
        "This and the whole album is just a piece of art. Since his concert the best artist on this planet for me. Glad, I saw him live ",
        "This day 28.11.2022 this was my song all day from  5 in the morning !  clock 20:59  ...still here #respect",
        "Please NEVER change, sir! I'm a rocker mostly but this man and Shady are the reason why I keep coming back to hip-hop! #808",
        "when you leveling up with the Holy Spirit you separate yourself from others . I love it ",
        "Takin' my baby to school, then I pray for her\n'Cause you bitches ain't never been cool, writin' testament\nPaintin' pictures, put me in the Louvre, that's a definite\nUniversal shift, I'm in a groove",
        "Love how Kendrick continues to push his artistry. Aesthetics, Fit, Word play, Persona. We are witnessing greatness unfold ",
        "Kendrick dropped the video for Rich Spirit in the same day Drake dropped the video for Rich Flex. \nIn the video Kendrick dances alone in hes house, like Drake does in the Toosie Slide video. \n\nStop playin with me fore I turn u to a song.",
        "",
        "the goat of rap",
        "Kendrick got moves",
        "This shit majestic bro.",
        "2:40 I bet it's the fruity pebbles.",
        "Kendrick doesn’t just do music! He is an Artist superb performance.",
        "Im a hermit, been like this for a while now, i feel like this was made for me. People need to understand : \"broke phone - rich spirit\", disconnect. When you distance yourself from the world, or at least control your interactions with it, youll understand people better. You will so easily see the fake people in your life and this wont hurt or offend you. When you fast, you become so powerful in thought that you realise yourself as Gods will/purpose on earth. Its great seeing frontlines niggas like Dot relating.",
        "1:35-1:38 ",
        "This kendrick era is about growth and its amazing ",
        "My man kdot killing it spitting straight bars legendary  ",
        "TEMAZO",
        "Kendrick's music always hits me deeply. Always happy to hear more art from this deeply human man.",
        "Stop playing with me before I turn you to a song",
        "Este tipo es musica un genio ",
        "  🇳",
        "It makes me so happy to see how he is evolving artistically, his integrity to his craft is truly inspiring. As well we can see how comfortable he is with his creative expression. \n\nThis is one of my favourite songs on this album.",
        "Already singing all the lyrics alongthis one here's award winning",
        "Need a music video for Count Me Out",
        "Damn Kdot really saved money on this video, running around a room for 3mins. Fave song off the album !!!!",
        "My favorite song off the album the vibe is perfect",
        "Probably one of the only artist living to day that will still be heard in like 100 years. \nThis is real art . That only happens once . \nI really appreciate it that I am fortunate enough to listen to his music",
        "Kendrick Lamar go in sooo hard on this right here, straight up BANGER! He aint like all them artists who just be goin HAM ON THE GRAM by usin dat IG rocket     to get followers up on the gram like them Island Boys dun did",
        "Even without doing much in the video, he does so much. Crazy video especially paired with the lyrics. Don't let them go over your head.......rich ni**a, broke phone.",
        "Kendrick Lamar's videos have never once disappointed. This is art.",
        "I remember having THIS SONG on repeat the day MM&TBS dropped.  Quality music. Beautiful. My favourite cut in the entire album.",
        "His music always hits my soul differently!!!!!",
        "Snapped🫣",
        "So my mood rn",
        "Not bad, nor good.\nNot Hip Hop, nor Pop.\n\nAnti-music music kinda, fitting the zeitgeist. Just like his outfit.",
        "He tryna tell us that what we chasing ain’t shit and what we wana turn away from is the life we need to build",
        "Kendrick's artistry is mind blowing, he his so ahead of his time but I'm so inspired to have been able to witness his creativity throughout the years",
        "NOT TO MANY RAPPERS CAN HAVE SUCH A CLEAR CONSCIENCE FOR BEING REAL IN HOLLYWEIRD....HE CAN LOOK IN THE MIRROR AN BE CONFIDENT.. HES BEYOND AMAZING....I followed him since the beginning of time....alrite was SHYT like all-day everyday repeat...when my bro got out of jail we went crazy with that song...",
        "Лала",
        "This is powerful. It’s like every time you get into a zone, there’s always a distraction to snatch you out of it. This world is designed so that you never take the time and focus on yourself.",
        "0:32 me in my room at 3am acting like i’m in a music video",
        "This guy is just a legend man.",
        "Thank you All for being  godbless godspeed godgrace godson godsend",
        "''I will never live my life in front of a computer'' \nThat hit me hard like a ton of bricks",
        "The minimalist approach mixed with the intentional art directing is perfect for the lyrics and the vibe of this song. Kendrick is a true artist.",
        "Today as been one of the worst days I've had in a very long time. I can't tell you how much I needed his music today. \nI've lost everything and I feel like a king when his music is bumpin my headphones. ",
        " 🇱🇱 ",
        "  🇮🇮🇮",
        "Very symbolic. He is representing introspection at it’s finest. The last part when the phone rang was his lower self (red chakra) calling on his higher self (hence the white suit and boots which relates to your crown chakra) … Kenny is always tapped in. Pay attention! #PGLangGang",
        "My favorite artist for life, the emotions and art he puts into his music is unmatched that’s what makes him different that’s what makes him Kendrick forever the GOAT",
        "YO MEC COOL SONG",
        "i swear in the dream world i make as good music as kendrick & we friends !!",
        "He is a gift. Thank you-",
        "Damn ",
        "Low-key concept ",
        "This album and his approach with making it timeless. At lot of us process information in various ways, with each method having its own incubation period. K.Dot is a musical genius, confident enough to put our life in bars like art. Some art is ugly to the untrained eye, yet the more you see it, the more it appreciated. Kendrick Lamar has a seat at the Royal Table of Hip Hop.",
        "Na moral esse cara é extraordinário",
        "Uhhhhhhhgh️",
        "That \"hey\" set the visuals ",
        "This is the second time he's done that flow with the Hogan \"brother\" at the end and it still catches me off guard ",
        "This is literally the definition of an artist! This gent does everything purposeful and it isn’t just for vibes. You can also tell he had a say on things are in his music videos.",
        "I played this album out on my own. This video just brought be back. Damit Kenny.",
        "There's a reason everybody loves Kendrick's music. He's a true musical genius.",
        "SchoolboyQ REMIX  PLEASE!!!!!!@@@",
        "I love Kendrick so much ️\nHe's one of the few artist who actually speaks to me and I will listen to him on repeat over and over.",
        "It's the natural vibe for me. iykyk",
        "GOD!!!!",
        "Kendrick can just make anything look more interesting and I'll have to say he is a good actor better than Drake",
        "no one does it like you big bro ",
        "Inspired ",
        "Faz a mente relaxante ️",
        "Kendrick its the definition of what a true Artist is, every video, every song, its just unique, forever the  for real",
        "🇷🇷",
        "Spiritually overload ",
        "KKKKKDOOOOTTTT PICK UP THE PHONE IM ALIVVVEEEE",
        "🇪",
        "that is ART ! and i know why is differente! serious work ! bravo !",
        "This man better win a shit ton of Grammy’s. This new album is incredible.",
        "My favourite artist ",
        "GOAT MODE.... I was able to define the implacable while listening to Lamar's work... he speaks right through your soul... he is a Gem ",
        "I seen him live 2 days ago it was amazing, his energy is real",
        "Love the the added effects to freshen up the track ror the video. Been loving the song for months and the video didnt disappoint, love his moves, still in his element",
        "Iconic",
        "Yes sir ",
        "This the vibe I had before the vid when I’d jive to it ",
        "🇮🇮",
        "KENDRICK SAVED THE DAY, AGAIN",
        "Video doesn't look too expensive but you can tell the artistry is just on another level",
        "️🇧🇷",
        "🇷 🇹",
        "Such a beautiful and artistic video.\nWe love you Kendrick.",
        "bro never misses!!! ",
        "Love this song...",
        "People just take Kendrick's genius for granted... he's such a singular artist.\nMr. Morale is an absolute masterpiece!",
        "grammy cook under quiet flames️",
        "free spirit moruk nicht rich spirit",
        "🇷🇪🇪🇪",
        "Might be wrong but it looks like a representation of deep depression, when you truly find your spirit and you see the world for what it really is. Feeling so lonely and out of place, feeling dead but your finger still tapping. The end when the phone rings feels like a message to any and all of us that suffer through it, that there is hope we just have to fight through the chaos. Just don’t give up. Such a sad video from my eyes, but so inspiring.",
        "The growth in your craft is truly inspiring my brother ",
        "I kinda prefer listening to this without the video just because both art (video and song) are so powerful on the own and honestly take on the own character that I feel you don't fully enjoy one when they are together.",
        "I don't always listen to Kendrick Lamar but when I do so do my neighbors",
        "You’re a legend man! This is a masterpiece",
        "The goat is back",
        "So what I got from this video is: \nThe part where he's dressed in all red signifies he's a Pyru. \nThere's a dance he does where he turns round with a hand gesture that looks like he's shooting. \nThe cowboy boots signifies he lives like a cowboy; shooting, killing, robbing, etc.",
        "Kendrick will always keep us entertained and motivated ",
        "This paints such a good and vivid picture of the concept that money can't buy happiness. You can feel the richness and the loneliness at the same time",
        "Best English to say what I wanna say  thanx Kendrick Lamar..",
        "These music videos just never fail to amaze me. \nThis roll-out, this album, the tour, these music videos.. Everything about this beautiful piece of work is incredible.",
        "Kendrick Lamar has transcended beyond the title \"rapper.\" He is an artist. An artistic genius. In this visual alone he takes you through various moods/feelings/expressions all so gracefully; that's ART.\n\nArt compels you to pay attention + tune in. He captivated me so well.",
        "his way of expressing his art goes beyond words already, we are so lucky to be contemporary of him ",
        "Damn",
        "Kendrick Lamar go in sooooo hard on this right here! He aint like all them artists and trappers out here these days who just be goin HAM ON THE GRAM by usin dat IGROCKET dawwwt cawwwm to get mad followz on the gram",
        "Oh Kendrick. I adore you and your team. Amazing music, video, everything. Such a vibe ",
        "el feeling q da esta canción de vdd q es inexplicable",
        "Everything this King says, how he chooses to show up is poetry. He is a representation of God's child through artistry. Peace and light to him and his beautiful family. *Thank you for sharing your heart with us K Dot! ",
        "KL is a genius..",
        "Need a worldwide steppers and savior music video",
        "King Kendrick, pure Legend",
        "#KendrickLamar",
        "I’ve had this album in my cars CD player for a few months now and it never fails to put me in an emotional mood, most of the time in a good way and sometimes in a way that’s harder to let myself feel. Mr. Morale won my heart",
        "Truely the best thing I've seen and heard in my time alive. Legendary.",
        "Fella got silly barz .shouts out from Zimbabwe🇿🇼 please don't get this man took out,jus stop killing please",
        "I've just come back from his last european show of the tour and I have to say this man and his team are geniuses in their craft. The choreography, effort, coordination/planning and above all the music was top class. I wasn't disappointed and I'm anxious to see what's next for him. Truly an unforgettable experience,  I'm grateful I've managed to see him live",
        "Magnífico ",
        "i didnt really get this video the first time but the second time i loved it, it's funny sad powerful absurd empowering; all the things",
        "One of my favorite on this album such a good song.",
        "Thank you Kendrick for always providing us with your beautiful art and making us think.  Love the video.",
        "Cool song love it..I wondering is people going to start back using land lines?",
        "I used to be a fan, But after hearing this masterpiece, I'm a whole air conditioner️",
        "Dave Free and Kendrick never disappoint when it comes to music videos",
        "🇱🇱 ",
        "️️️",
        "Kendrick Lamar goes so hard on this, never disappointed. he is not like other rappers who are going viral by using authentic views to get the views up. Thumbs up who agree",
        "🇹🇹🇹",
        "Is he even trying every song he puts out is a MASTERPIECE , he is a genius and mastermind.",
        "Love you from Kenya. Figh harder.",
        "Hits to my core ️️️️️",
        "Tenemos que proteger a Kendrick todo el tiempo.",
        "His ability to move people through his craft is everything ",
        "Love you king Kendrick",
        "🇹🇹 ",
        "An ARTIST ",
        "Thank you Mr. Lamar.  You are a genuine man and your music has gotten me through some difficult times.  I hope the Lord’s will is done in your life and everyone around you.",
        "Kendrick sempre mandando bem em todas as músicas, palavras por palavras, cara é foda. Infelizmente a indústria da música sempre dão valores aos rappers modinha.",
        "Kendrick is on another level",
        "Fico triste toda vez que essa música acaba.",
        "It’s the uncomfortable choreography, it’s the drip, it’s the color scheme, it’s the loneliness, it’s the cowboy Kenny era and I LOVE IT.",
        "LOVE YOU KL️…”RICH SPIRIT”️",
        "My favorite song on this GREAT Album! Honestly Nevermind could NEVER!",
        "The total madness that comes with being an artist In its purest form\nI pray for you Kendrick ",
        "Dope  as hell.. no matter how you feel..facts",
        "Kraft Kay Kire Kry Kore Kleen 🫥️️️️️️",
        "The more I listen the more I realise how much folly exists in society ... lost souls to think another earth can make a difference and too preoccupied with their constructed reality to truly enjoy the LIFE given ... good luck rap brother",
        "K .   Amazing ",
        "This song on the album symbolizes a spirit of richness that makes him feel alone the broke phone symbolizes him not being able to connect to his spirituality hence the reason why his wearing the crown of thorns. At the end the phone ringing symbolizes that the connection to his spirituality is coming back. It's a deep song many layers to this the awkwardness in this video is used to show how the \"rich spirit\" is changing his perception ( almost as if his going insane) hence the reason why he was talking to himself on the mirror.",
        "A celebrity don’t mean integrity ️",
        "Kendrick e sua excelência em invocar a arte e tocar minha alma em profundidade.",
        "What a video. Kendrick passionately dancing with his soul in what seems like a empty house is a feeling we could all relate to. Coming home to a empty house, at first happy with the freedom. So we turn on our favorite song on blast and repeat to overreact to every little adlib. Then towards the end of the song periodically you start to realize it’s just you. No one to share the energy with but the singer. Beautiful video K Dot",
        "I got this on repeat!!!!!",
        "This song is just beautiful man",
        "He is beautiful",
        "I love this song, the way he expressed himself vocally, lyrically, the music video and that beat sends your soul into this mode that I can't explain. Very dope, I'm more and more impressed with each album, yet I can still bump Section 80 on repeat today, it still goes hard.",
        "I love so much try to discover the universe that Kendrick shows in every song <3 Love ya",
        "Hits to my core",
        " 🇱",
        "KENDRICK IS THE ART ",
        "The body movement is astounding, we feel the whole rhythm of the song with him and as usual I'm sure the video has a profound meaning ",
        "DAMN, Kendrick is an artist!",
        "I'll never get tired of this song, it's perfect.",
        "This song was an unexpected highlight of his live show. He gets more and more intense with his delivery as the song goes on and the visual/choreography was cool.",
        "Kendrick is without doubt a very talented writer and rapper, but the sound of the music and the production is off and the subject matter isn't that deep. If you didn't know who Kendrick was already, and you didn't already idolise him, then it's a lot harder to buy into this music. A lot of it's just hype. If people love the video and the fashion and the colours, then good for them, but when people choose to comment on that rather than the music, then it's saying something pretty obvious.",
        "God damn bro. I cannot express how much Kendrick's music continues to impress me. The visuals in these videos are fantastic too.",
        "Been waiting on a video for this one. I just knew Kenny would deliver an equally impressive video to compliment an already impressive song. K-dot has been one of my biggest inspirations since I started rapping years ago. My dream is to gain a big enough following one day to open the door to some day meet Kendrick and let him know how big of an inspiration he is to not just me - but so many new artists today. Influencing the next generation of artists! Big respect and love for Kendrick ",
        "KING KENDRICK  \n~\n\"Rich nigga, broke phone (ah)\nTryna keep the balance, I'm stayin' strong (ooh)",
        "Let's go king fu kenny!!!!",
        "This shit a banger my favorite rapper for a reason ",
        "K Dot ",
        "Everything he does is like a puzzle piece and each time you see the connection... Beautiful art ",
        "Las letras, la esttica, lo hace tan hermoso, gracias kendrick por tu gran aporte al arte",
        "what are thoooooosee??",
        "that shoose O.D.B. on Brooklin ZOO song",
        "His music always hits my soul differently!!!!! ",
        "Kendrick consistently gets the best cinematographers around. His music videos are more like music movies. Cinematic masterpieces.",
        "I had this song on repeat for weeks after the album came out!!! One of my favs ",
        "The ear rings say he’s changing to another bad example ️",
        "That Frat part of this video is DEEP️",
        "TE AMO",
        "KENDRICK LAMAR, em meio a decadência de tantos artistas rappers, O CARA SE MANTEM NO TOPO DESDE 2012.... LENDA!",
        "he’s reached that level as an artist where just his presence speaks volumes",
        "Siempre brilla con todo lo que saca. Larga vida a Kendrick Lamar.",
        "Dope album",
        "Just know it's good when you like the song before you listen to it",
        "This song is so fire",
        "He’s only getting better! His artistry is unmatched and he is in a league of his own",
        "Killed this shit ️",
        "Fighting with his higher self on the phone \nGods will leaves it feels like dead dialtone\nGods love is always there for us all you choose to see it .",
        "I can say this with confidence not many artists that can touch the soul like this man's music. True master of this craft!",
        "He a genius ",
        " 🇰🇰🇰",
        " 🇨🇨",
        "Mind blown  Continues to impress and never let us down. Very few can hold a candle to his genius ",
        "This shit hot I listen to way too much street music this was refreshing and deep this hot but idk about KDot dance moves lol",
        "Kendrick is becoming this other thing!!! I love it.. a shifting energy ️ ",
        "I love this guy",
        "Hey , Kendrick. You’re attractive.",
        "Kendrick is an artist through and through,  always pushes the art and never limits himself to one sound",
        "My new obsession <3 \"Universal shift, I'm in a groove..\"",
        "Downloaded this when it dropped, been on repeat! #LoveIt",
        "And the grammy for the best rap song goes to........",
        "Felt like I was watching the early stages of a breakup. Confidence, insecurity, paranoia, regret, hope, etc… it was dope. 3 cheers for oklama",
        "this is amazing",
        "Everything everything ️,,, with love from 🇿🇲",
        "Kendrick really is a once in a generation type artist.",
        "Being yourself is liberating.",
        "It’s giving “black phone” vibes. He’s an artist. Interpret how you want but THIS is art.",
        "Save this Masterpiece for sure be safe legend ken ur a good man .. more fasing songs plz love this vibe",
        "Keeping hip hop alive  poetry",
        "Mano isso tá foda pra caralho!!!  \n \nMano ascendi aquele verdinho e tô escutando esse som... imagina a vibe q esta aqui hehe",
        "I did a fast remix of this if anyone wants to check it out, always been a huge fan of Kendrick ",
        "Protect this man at all costs",
        "    ..... All around this video went dope with the track. Of course K-dot killing it.",
        "Kendrick is art!",
        "Showing some light in even the darkest situations we've been through.",
        "NEXT TIME ANSWER WHEN I CALL LOLOLOLOLOL HAHA I GET IT they said you like humor",
        " 🇪🇪",
        "Kanye only wishes he could make music like this",
        "Kendrick can never fail",
        "Him never stops....Don't never stop",
        "The end brought tears my second time watching",
        "Kendrick, my Brother i want to Thank you for your role, & for the impossible efforts of becoming who you were meant to be.\nI have a plan Brother, to take down the Success Blockers holding our people down. People realize that it was never about you becoming rich that was important, so after you Humble yourself's[something we all need to do often]",
        " 🇷",
        "MUITO BOMMMMMM",
        " 🇨 ",
        "Kendrick never disappoints ",
        "To attract and or reject girls you must fast your lower chakras. Brilliant Kendrick.",
        "The phone that kept ringing despite having a severed cord may mean a multitude of things. \n\nThis mv is all about isolation, the helplessness, comfort and loneliness in it, and when in isolation, we tend to converse or deliberate ourselves. It may mean that Kendrick is displaying that we receive answers from ourselves only at a time that we have ourselves to call, contemplate with, ask and no one else.",
        "The whole album saves me from suicide everyday ",
        "Amazing video... Kendrick moving and flowing",
        "A rich spirit is made in divine reasoning and in persona and identity.",
        "“The call is coming from inside the house” is all I could think. So much to interpret with this video. Love it",
        "️️",
        "Era lamar♡",
        "Ecstatically waiting \n\n*Laborer4LOVE",
        "im fasting , madness lmao, Kendrick always been lyrical , he bein himself w the spiritual conscious lyric",
        "Kendrick’s art  is just so refreshing. EXPRESS YOURSELF",
        "Th guy doesn’t need validation ",
        "Minimalist, Simple,Subtlety, Powerful video\nAnd we thank you very much because some  aspiring sensitives médiums can capture through your song and vidéo, some messages from higher sphere, dimension.\nGratitude  ️",
        "It's funny how you'll hear a song & you just know that it's gonna make it big after album release. LOVE THIS SONG!!!",
        "That ending was everything ",
        "Listening to this album for the first time… I told myself I’m not going into this album in FAN MODE. NOTHING moves me today musically! When I heard this song I was IN TEARS I swear! How TF did Kendrick’s life align with mine like that? I did a 14 day water fast.. NO FOOD.. NOTHING BUT WATER… The hardest 2 weeks of my entire life & I got through it how I came in this world ALONE with the help of the most high!! This song hit on a level That I can’t explain to you beyond this comment! You’ll never know until you fast!",
        "This guy is just fucking artistic ",
        "…THIS VIDEO IS “DOPE”️",
        "Full Rap, Full Lone choreography and the best rapper Kendrick ",
        "I've been saying that Kenny is a good looking kid for over 10 years. Not only attractive, beautiful as well. God bless him.",
        "Thats why when you mention kendrick you always rate j-cole as his equal this two should drop an album together featuring each other this album would go multi diamond platinum but for know cant stop  jamming to this song its super duper dope.",
        "I hope Kendrick Lamar lasts with us forever I'm pray to Allah he saves his soul",
        "No one is as special as Kendrick",
        "Fan since OD",
        "THE TALENT️",
        "Him staring at his shadow, the solitude. It’s lonely on that spiritual path. Beautiful work.",
        "2:40 Day one Kdot fans only understand this part. “Cartoons & Cereal” ",
        "Alhamdillulah",
        "The way he portray his art is just genius, Kendrick is Art himself ",
        "Incrível o que Kendrick Lamar com esse flow consegue fazer, o cara é um monstro!!",
        "Legend",
        "I kinda want to see Kendrick to collaborate with FKA twigs eventually. I They both have an amazing artistry that would complement each other pretty well. Also would love to see them do some dope choreography. ",
        "every kendrick song is a poem and every video is a movie ",
        "The minimalist approach mixed with the intentional art directing is perfect for the lyrics and the vibe of this song. Kendrick is an authentic artist.",
        "Veo elegancia, veo soledad, veo paranoia, veo frustración, veo debilidades intrapersonales. Awesome video brother!!!",
        "He is the best MC 🇭🇹",
        "Absolutely ",
        "I’m a rapper and Kendrick inspires me to make my own music. I want to rap as good as him one day, but I have a really long way to go.",
        "\"Can't Fux with you no more I'm fasting\" is the mood for 2023 with all do respect ",
        "nothing but love for this man",
        "🇨 ",
        "I wonder who teaches him those choreography really cool",
        "Why does this sound like some type of beat drake would use",
        "Song would fit right in with Jordan’s peeles films.",
        " 🇱🇱🇱",
        "  🇮",
        "Ayyyy ",
        "what have we done to deserve all this....King Ken",
        "A king just doing his things",
        "Stop playing B4 I turn you to a song* Barz",
        "he's always got it",
        "This is a guy who smokes a blunt and remembers everything he thought of during the high… get a hotel room and make a masterpiece! So amazing!",
        "So many messages in one video beautiful thing about art is you're free to interpret how you want perception is important in life",
        "🇮  ",
        "He goes straight to the heart everytime man. Such a powerful artist. ",
        "Excellent theme thanks ",
        "Forever ️️️️️️️",
        "I like how he has a different hairstyle on each album. It’s a way of marking different eras. Smart marketing",
        "In Germany, we call something like this \"Meisterwerk\"!",
        "Great jam like the Aura album by play01",
        "Man out here turning into Thom Yorke in Lotus Flower.",
        " 🇨🇨🇨 ",
        "Kendrick really is our generation’s peak Kanye…as it should be.",
        "This is Healing, I can't explain the connection to this poem",
        "Kendrick e sua excelncia em invocar a arte e tocar minha alma em profundidade.",
        "Kendrick brings a Nostalgia that’s brand new ahead of it’s time but classic, it’s hard to describe! ",
        "The fact that 2 days ago I was in his concert vibing to this song 🥹🥹",
        "One thing about Kendrick, he’s gonna give a PERFORMANCE EVERY TIME!! ",
        "Hell yeah!!!!! I love this!!! Another hit from the legendary Mr kendrick Lamar.",
        "Kendrick  is a GOAT",
        "Creative , art and Lamar is the real ",
        "Kendrick nunca decepciona.\nkendrick never disappoints",
        "Imagine @kendricklamar and @Johnnydepp working together ",
        "Love Kendrick & his handsomeness",
        "Godo",
        "Praise to mohmmad...",
        "Thank You For This Whole Album!! Helped Me Thru Some Rough Times This Year !!! ️‍",
        "Kendrick will always be the  in my eyes.",
        "DISO LAMAR",
        "Absolutley blessed and privileged to see Kendrick live last week in London. His music saved me and continues to do so. The night was indescribable and I will remember it for as long as I live.",
        "The visual, the beat , the lyrics are all ",
        "The guy never ceases room amaze and he does it effortlessly. Taking a 5 year break and then dropping one of the best albums this year is insane. The guy constantly knows how to do different concepts and still retain his cadence. The guy doesn't have a wack album",
        "BFFM we got next ! blackfamilyfirst Muzic new YouTube channel ",
        "this is what it looks like when you're alone at the house with music blasting",
        "To be alive to see this luminary work and create new work and grow as artist... how lucky are we.",
        "Isso em fez lembrar uma cena... 🫥",
        "Brooo never thought this day would come where he made an official music video to Rich Spirit, had it on repeat the whole summer. Good vibes mane",
        "Pure art. Kendrick getting legendary day by day.",
        "I like how this videos depicts his isolation and him avoiding social interaction. He understands that solitude is healthier for his spirit in the long run but it's clearly taking a bigger toll on him than he expected.",
        "I'm counting on how long before Drake steal this song   then add aii at the end of each line and make it look like his own new single.",
        "One of my fav loa mainstream bangers keep it coming Kendrick",
        "Kendrick is way too too unique ️",
        "Até o kayne west ouviu e falou caralhoo essa tá muito foda.... 🇧🇷🇧🇷🇧🇷",
        "This song and “Clover Cage - Make A Difference” are the only two things keeping me sane through these tough times. I just want to send love to everyone and I want everyone to know things will get better...We are in this together...I love you...️",
        "Rich Spirit Lyrics:\n\n\nTakin' my baby to school, then I pray for her",
        "Feels very inspired by Twin Peaks and I love it.",
        "Kendrick a real one ",
        "Kendrick, a house, a phone, a mirror and a song. That's all we need!️‍",
        "3:03 I hope that's Sherane calling",
        "I love me some him ",
        "We Absolutely love this song  ",
        "Ayy!! ",
        "He’s not else but the greatest!",
        "Kendrick is art. Kendrick is a story, he’s mortal magic. It’s fascinating how captivating something so simple can be so metaphorically complex and profound. Details, details details details. It’s heavy, it’s smooth, it’s graceful, it’s memorable. Every angle is a moment",
        "Just…….wow",
        "Kendrick is a mastermind, very talented, turning a video into art. The way he moves in the video is creative and entertaining. And good lyrics, well e all know how that goes",
        "Kendrick é outro nível.",
        "Love ya Kendrick. Thanks for the grown and development",
        "🇹  ",
        "My favorite till now️",
        "Man if he doesn't win all types of awards this year something is wrong with the music industry. He's a musician lyrical genius.",
        "Lil Tjay , I LOVE YOU",
        "Why his earingsook like airpods bruh",
        "1:42 when the phone rang, shows the anxiety we all feel whenever our phone rings even though we’re lonely…\nGo ‘head brother Kenny!!!",
        "My Man is really developing his artistry to another level, keep it up Ken, one love.",
        "Haven't been too big on Kendrick, but this joint is hard. Video topped it off! Everyone who was a part of this song / video deserves credit!",
        "Simply the Greatest Rapper of All Times..... ️",
        "My favorite song on the album",
        "At this point K dot can't miss!!!!!!!!!!!! videos, lyrics and albums take your pick!",
        "I dread for the people who value garbage music over lyrical artistic masterpieces like this.",
        "This is powerful. Its like every time you get into a zone, theres always a distraction to snatch you out of it. This world is designed so that you never take the time and focus on yourself.",
        "🇳🇳🇳  ",
        "The artistry behind this! Love the feeling of loneliness and symbolism reflected in the visuals. Masterpiece",
        "You're trying to hard mate. Take a look a Cole.",
        "  🇳🇳",
        "Kendrick is a genius. This album is a masterpiece, an emotional wave.",
        "Crazy i was doing this dance when it first came out",
        "I was worried when I saw the thumbnail and title. I'm so glad that we're doing thanksmas, you have helped so many people. Let's help some more!",
        "This album made me realize how many traumas, triumphs, and love a person can experience in one life ; the growth, the self-doubt, I feel it all when I listen to Mr Morale.\nKendrick Lamars music has always been out at moments in my life when I needed introspection and it never failed to help me understand who I am and what I want my path to be",
        "Pulitzer PRIZE winning “RAPPER”. \nTHATS IT. THAT IS ALL!! The only one in HISTORY! #blessings",
        "Its like this video was pulled from our own lives. When we’re home we say \"im attractive\" as we dance around our own shadows, until someone shows up and we don’t know who to be anymore. Some of us want attention from friends and family but when it comes do we even answer the phone? I love this video and it’s making me think more about why I should love the shadows of who I am.",
        "Uuuuuh",
        "From 2016 and up",
        "Muito sucesso guerreiro sou seu fã",
        "when he used reverb in the middle of the song and then took it off his voice it felt like a dialogue between him and his subconscious, like the voices in your head and the anxiety are always there even when all you can hear is a blurry white noise. Kinda like talking to a broken mirror,  thanks kendrick <3",
        "2:03 when a person walks by thats wearing a tshirt the color of their skin"
    ],
    "comments_disabled": false
}