{
    "video_id": "tR-3BMignl4",
    "comments": [
        "wtf is taylors tea???? it's got to be yorkshire!!!!!",
        "Even when burning his hand, MatPat is still musical. You gotta love that.",
        "you know what you should do. do this but with hot chocolate.",
        "Cup\nSugar\nTea bag\nHeated water",
        "Try Indian tea",
        "5:32 \"This channel is built on the premise that I can overthink anything and then write it off as a business expense.\" The most accurate summarization of the theory channels I've ever heard.",
        "This Brit has never put the milk in first. I have a mug with a PG Tips teabag and a couple of spoons of sugar in, add the boiling water and then a large splash of milk and I prefer it weak so I take the bag out shortly. In fact I get two cups out of one bag.",
        "To get the best tea infused hot water the method is to get the most infusion in the lest amount  of time possible and that can be done by vibrating the tea bag at the surface of the water (leaving half of the tea bag out of the water) in a vertical motion which creates some what of a negative pressure pulling the teafushion downwards ,,,,, thats if your using tea bags",
        "Hot leaf water= hot leaf juice......... uncle Iroh would be furious.",
        "IDEA: Coca cola tastes sweeter when its christmas season.",
        "MatPat:Your tea sucks\n\nTHE BRITS:YOU UNDERESTIMATE MY POWER",
        "ONLY 3-- IN MY HOUSE ITS LIKE 20 CUPS PER PARENT- oh yeah i'm British:)",
        "0:40\nRelatable, I use the same cup for pretty much everything.",
        "One way to make sure there's a low (if any) amount of Tannins in your tea is by cold brewing it #NotMyFoodTheory",
        "Not sure why one would put tea with both water and milk.  Plain water and plain milk together does not taste good.  Plain milk and tea I do not believe would taste very good either.  Water and tea is how I have had it and that is fine.  An addition of milk would seem to just make it less enjoyable.",
        "At least there's Twinings in the kitchen. If I'd have seen a shred of Lipton I'd have trashed the internet.",
        "As a British person I think I know why tea from a teapots colder, usually when you drink tea from a teapot you are at a cafe or a public place and you want to drink it straight away while at home when you pour straight to the cup it’s because your on the sofa watching tv or chatting to people coming over so you’re drinking it less / ignoring it for a while until there’s a break in conversation",
        "Agreed. Best milk in tea is no milk",
        "When boston couple, offers you join their tea party....",
        "You guys forgot to take into account hard or soft water and temperature of the water",
        "As a Brit' I've never seen or heard of anyone putting the milk in first in the 31 years of tea drinking I've experienced! Just some more disapointing british history ",
        "As an Indian, our typical tea, which is called chai, is much different.",
        "Interesting to see if you mention the bsa (the British standards agency) has a ebook that details the official process on brewing tea. That they sell for like 50 pound or something",
        "I love tea but I think my favorite hot drink is apple cider.",
        "Anyone else literally just brew their tea in a mug filled with hot water and drink it without adding a single thing to it?\n\nNo? Just me? Okay. ",
        "17:12 to much milk",
        "In my opinion, Indian tea (chai) is the best tea.\nAlso we don't even use tea bags except for green tea",
        "i have never drinked tea with milk, and never knew anyone did till now.",
        "Nice TEAhory",
        "7:15",
        "️Britain starting opium war do to tea",
        "Part of me was hoping that they would use the \"Hitch Hiker's Guide to the Galaxy\" perfect tea",
        "My tea doesn't taste like anything after only 3 minutes...",
        "Sugar or honey now that’s next ️",
        "In the last experiment, you preheated the glass by using it to measure the hot water for the other cups.",
        "I’m British and I have never once in my life seen milk first. It’s always water on tea, followed by milk. You just proved the British way is best.",
        "Thank you MatPat my first reaction was. “Who on earth puts milk in their tea?!?”",
        "wtf u put MILK?! in your tea?",
        "it is quite simple to figure out when the milk goes into the tea... NEVER\nkeep your cow utter liquid away from my tea, if its because its too hot; let it sit and cool down like that, or use cold water. that way you don't get a weird flavour in your hot leaf water",
        "Seriously what is the problem with microwaving the water...hot water is hot water ",
        "You should've looked at the Chinese or Japanese tea ceremonies. The temp of your water, pouring out the first bloom, things like that make a big difference according to the people who do it.",
        "What about Japanese green tea? My Japanese heritage demands an answer",
        "7:02 I can't help but wonder why would anyone wear fancy shoes inside their own kitchen..?",
        "Unless Thai or matcha tea milk on tea is gross",
        "My mom always makes me tea when I'm chilling playing video games so I don't care what math or science says otherwise, mothers home tea is always the best",
        "The fact that it goes from getting dark at 10pm, to now being dark at 5:30pm in the course of about 2 weeks, is indeed a total body shocker.",
        "I didn't even know it was possible to make a theory on tea somehow matpat always finds a way to theorize something and I'm all for it",
        "Steph:  I drink three or four cups a day.\n\nMe:  (after drinking roughly a half gallon so far today)  That's adorable.",
        "Mmmm melted leaf juices..",
        "3-4 a day.... try 3-4 before lunchtime!",
        "13:30 matpar spitting facts",
        "Gotta love the consistency of the theory channels",
        "Taste test needed to be done blindly, I doubt it actually makes a difference.",
        "An entire episode about tea. Uncle Iroh would be proud",
        "Visiting Bangladesh, I've had the best tea over here, no matter whose house I'm visiting. The whole Bengal region is mad about tea, I'm sure that's true for most of South Asia and east asia. They boil the tea in a pot with the leaves, sometimes use jaggery goor (unrefined cane sugar with molasses etc) instead of sugar and use milk powder a lot rather than milk. Tastes amazing. In the UK, malty biscuit Yorkshire tea is the only thing that comes close.",
        "8:30 have... Have you thought of shaking your teabag?",
        "Hey I was just watching the video and I was wondering what's the best way to stack a dishwasher?",
        "Tea press all the way, 1st brew is for your enemies  Give them the bitterness.",
        "I like sweet tea :D",
        "milk always goes in last XD even i look at people who do milk first as a British person and think they re weird XD",
        "You FORGOT one important detail: \n\nHOW MUCH WATER ARE YOU USING?",
        "Felt the need to watch a video on tea as a Chinese person. ( I feel like people forget Asian countries like China and Japan are also really specific about tea probably more than Britain, with elaborate ceremonies and rituals, specific teapots, equipments, tea leaves, and so much more)",
        "he has to make a vid on that new lankbox kitchen lol",
        "i dont wanna hear no Americans telling me how to make the perfect cuppa",
        "Guess who's washing the dishes from now on...",
        "I want to see you guys tackle Asian tea methods, Chinese, Indian, Japanese etc.",
        "I get that it’s sacrilegious to heat the water in the microwave, but the video never goes into why. That seems like it would have been an excellent variable to test! Does it actually make a difference how you heat your water?",
        "Oh come on! Nobody but THAT woman in the whole world makes tea that way. You can't use one crazy woman's Tic Tok vid  to judge America.",
        "A part two involving traditional Asian methods would be nice.",
        "Matpat you need to do a detailed explanation of the jack in the box lore",
        "You missed another controversial decision point: Does the teabag come out before or after the milk is added? Makes more of a difference than you'd expect.",
        "Fun fact: tea only has two names across all languages.\n\nIm serious. Its always some variation of \"tea\" or \"chá\"",
        "You know, as a part of the IB program, if you take chemistry, you have to design and complete your own chemistry experiment, write-up included. Because I'm a tea addict, I decided to look at the chemical reaction between the polyphenols in tea leaves and calcium carbonate in hard water that form a yucky, scummy skin on the top of your tea if you leave it too long. Turns out, adding just a few drops of lemon juice can keep your tea significantly fresher.",
        "Meanwhile I'm learning I've scientifically engineered the worst way humanly possible to make my tea :P",
        "My dad's ex was from the Philippines. She told me that they boil tea bags in milk. Never looked up if it was true or not, but I really like it. Camomile boiled in milk sounds real good rn being that I can't sleep.",
        "Never clean your teapot, the flavour from the older tea stains adds flavour.",
        "As someone who also drinks 3-4 cups of tea a day, I'm just grateful to you for making this. Now I know how to make perfect tea! Not even the tea-rific ammount of puns is gonna change that.",
        "3 top 4 cups of tea a day is nothing lol I drink around 1 to 2 liters of tea each day",
        "Ok but if you are going to have any more British themed episodes, you need to bring Tom back, he’s delightful ",
        "Mat is right, the best amount of milk is no milk! I mean, it's nice with chai or other teas that have appropriate blends of other ingredients, but milk takes away a lot of the tea's own flavour, or downright ruins it if the tea isn't meant to be drunk with milk. Be mindful of the type of tea you drink before ruining it with dairy! Always taste your tea without any additions first. This has been a PSA.",
        "Do Mate next ",
        "okay it may just be me but i’ve never put milk in my tea and it sounds pretty umm unappetizing",
        "I don't know anyone who puts the milk in first even in teapots as the milk is usually in the small jug. Milk usually goes in last so you can nab everyone who wants a brew and let them judge by the colour how milky they want it",
        "Iroh after reading the title: your tea in nothing but hot leaf juice!\n\nAlso, I wanna say that tea originated in China. Legend says that an emperor and his servant were under a tree. The servant was boiling water and a leaf fell in the water. The emperor, who was an herbalist, tried the concoction and thus tea was born. I did a project about how tea became an important part of British culture and it’s really interesting. I forgot some of it, but I think a duchess from Portugal grew up having tea as the perfected drink and others drank tea from her influence. I grew up drinking chai, but without the spices or masala. We boil water and add the tea leaves and milk (I don’t brew the tea so idk the order) and then when the tea is a tan-ish color with a layer of milk cream on top, we pour it into mugs and add sugar (brown to be specific). Then we eat it with a biscuit called cake rusk (rusk is pronounced without the k, so it’s rus). I plan on trying many more recipes of tea to try and see my taste preferences since this is the tea I drank growing up and I like to experience new things. The tea project made me want to try other variations.",
        "Maybe should have tried with different types of milk. Skimmed 2% or whole and other.....",
        "As a British person who is yet to drink tea I will make sure to tell my family about this",
        "I knew this would be interesting when he already had 6-7 tea jokes in less than two minutes",
        "I learned not to let it sit to long the hard way...",
        "0:28 Me, a British person, shocked that anyone would think 3 cups a day is enough, let alone too much ",
        "As a Brit who works in a tea shop. Yes they exist…\n\nThis is how all brits make tea! Your scientific method of making the best tea. Is actually how almost everyone I know makes tea. 3 mins, milk  old porcelain mugs were brittle to heat differences but modern ones aren’t so milk went in first back then!",
        "I like strong tea so lose leaf all the way. I have a tea pot for lose leaf and I have tea eggs if I don't want to make a whole pot.",
        "I was watching this entire video, ready to rant in the comments but y’all actually arrived at the EXACT way I make my tea  as a person who also 3-4 cups of tea each day, I am very very happy ",
        "Fun fact: teh tarik is the way to drink a tea but with skill. Or using a Chinese method, brewing the flavor till the leaf is come out rich.",
        "Take a sip every time they say  \"wow\"",
        "I can tell from all the puns that this video will be very high qualitea.",
        "Ooo! Maybe Food Theory could do an entire series on different tea types and best ways to have them? That would be might-Tea amazing! ",
        "just started this hope its not a tragetea...XD  but seriously you've been the best with your videos",
        "All Tea Drinkers I know (as a British person myself) put the milk in last, I do believe the cheaper cups may have been the only reason as water then milk certainly appears to be the British way now. Milk goes last.\n\nLike with cereal.",
        "If just one of you is sick",
        "This works with any mugs I have but try it at your own risk, my tea goes a little like this:\n\n-Fill the mug with hot water from a kettle almost to the top.\n-When putting in a teabag it should raise the water level right to the brim.",
        "If you steeped the tea in the mug during the milk before vs after experiment, the difference is likely from the boiling water cooking the milk in the \"before\" cup, making it taste off. It likely wouldn't make a difference if you steeped the tea in a teapot instead, then poured it into a cup with milk at the bottom.",
        "Matpat, you should try South African Rooibos tea, steeped for at most 1 minute with 2 teaspoons of sugar and no milk but with cold water. It is delicious.",
        "My dad drinks like a quarter gallon of tea some days",
        "wait...youre supposed to put milk in tea?",
        "No this is how to make tea\nTurn on the electric kettle\nPut two teaspoon of sugar \nThen the circular tea bag ",
        "The only thing they didn't consider are the microplastics in the pyramid teabags (& most regular teabags) & the fact that loose leaf tea is much more sustainable",
        "Tea without milk is better as you said",
        "I don't use milk for my tea",
        "I've been feeling under the weather lately, so it's just perfect that Matpat makes a video on my favorite sick drink :)",
        "Spot on the splash.",
        "I agree that the best tea is the one without milk :)",
        "4:50 to 5:00 - #LOL",
        "mat, the western way to brew tea is too thick and doesnt leave any room of other flavour other then catechin (the bitter) flavour in the cup of tea and plus adding milk to the tea will cover the natural tea flavor. I suggest a chinese method to brew tea using gaiwan, those step brew tea very thin even more into watery (very dilute) but in that way it's more pleasant to the tongue",
        "Loose leaf is the best way to go. It can also be used twice so it lasts longer.",
        "Na the one she made is wrong everyone make a tea team in my comments and we British or where you are from we will make the ultimate teaaaaaaaaaaaaaaa",
        "Ngl the real controversial test would be trying the brands in the UK and deciding ur favourite! That’s the real hot button issue! I’m a Yorkshire/twinnings gal",
        "That's not tea, that's hot leaf juice",
        "My gosh I love them >< thank you editors, this was truly beauTEAful",
        "I drank tea watching this🇬🇧",
        "Mat’s opinion of milk in tea is the Chinese way, the original CORRECT way ",
        "best milk is no milk in tea, I strongly agree",
        "Bro was wearing pilgrim shoes  at 7:02",
        "MatPat's Diet Coke is to Steph's hot tea.",
        "I think the pyramid teabags are wrongly named, they don't have a square base but only regular triangular surfaces and are therefore tetrahedrons and not pyramids. \nI could imagine that some children in geometry class who accidentally swapped the shapes because of these bags.",
        "For as scientific as you claimed to have done all these comparisons, you didn’t actually compare the water heated in the microwave versus a kettle… you tried the TikTok version that you knew was terrible but was it the microwave that made it terrible? I guess we will never know.",
        "Lol, here is one you don't seem to have thought of: \nI brew it in my COFFEE MAKER (well, it used to be my dad's coffee maker before he passed away in 2013- but I am allergic to coffee, so I invented a reason to use it) when I plan to have more than 1 cup a day.  ",
        "Ah, the real reason for FoodTheory... Writing food off as a business expense. MatPat is amazing",
        "I recommend brewing for at least 10 minutes and to squeeze the bag best tea you get. \nGives you that nice poisonous bitter flavor with the after tangle.",
        "Anyone else find their familiarity and synergy just so heckin' cute ^-^",
        "I whole heartedly disagree with the milk results. \n\nNone of those were anywhere near enough milk. ",
        "thank you for the puns, they were epic",
        "0:35 Amateur. I Go through 3 - 4 Teapots a day.",
        "Matt : \"your tea sucks\"\n\n\n\nBritish people : so you've chosen death",
        "matpat is so father having that he is the father",
        "The fact that the paper bags dont actually let the water pass through the leave is why I take the tea bags by the strings and gently pull the bags back and forth through the water. Of course, that only works when you're using a cooking pot rather than a tea pot. But, those of us who drink cheap tea and dont have expencive kettles must make due with what we have",
        "As an American tea drinker, I am actually invested in this episode.",
        "Even as a non tea drinker, I enjoyed the video and I just wanna add that I really enjoy Steph in all your videos. Every time she’s in a Theorist video she’s always insightful and very funny. I’ve seen YouTubers bring their spouses in on videos before and a lot of times it’s awkward and uncomfortable but Steph always is so cool in these videos. Thanks for the amazing content.",
        "Using science, they came to the correct way to make tea. This is how you make a cup of tea, straight out of the kettle, this is how I, a British person, have done it my whole life. \nBut when doing it from a pot, I think it tastes better, with the milk on the bottom. It also bubbles a little bit, which makes the first couple of sips feel and taste slightly different.",
        "Do you think this also applies to herbal teas (teas that do not use parts from the tea plant)?",
        "The best way to make tea is...\n\n... the way that makes the taste you prefer.",
        "I'm Scottish and I can indeed confirm that everyone makes tea wrong, except from us ",
        "Start |-",
        "Ugh, your tea puns are TEArrible.",
        "I was totally waiting for Uncle Iroh to show up........",
        "Nice episode!! In my family, if you put the milk in first, it’s a big no-no! Always milk in last  you basically made tea the way we do as a family!  🇬🇧",
        "Not gonna lie, was kind of hoping this episode would also cover herbal teas because the lack of caffeine makes quite a big difference when it comes to optimal steep time.  Maybe a follow-up for both this and Iced Team would be cool",
        "My favorite tea is Arizona ice tea.",
        "Love this episode don't know why but eh",
        "Very very likely not the first to point this out but somewhat disappointed you didn’t include the temperature of the water as a factor. Definitely not something talked about frequently in English tea but most certainly a factor in other teas. If it’s a factor elsewhere, it’s likely a factor in English tea too!",
        "Great video! I’m surprised you didn’t test pouring water over the tea vs dipping the tea after pouring. That’s one of the main tea debates I’ve known of.",
        "oh OH MY GOOD GOD! that mini vid of that woman making tea that way triggerd me so hard I nealy lost my right arm and right lung!",
        "\"Best milk is no milk in tea\"\nWords of a true tea drinker.\nmilkless tea people assemble",
        "am i the only english person who hates tea or maybe its my cameroon ancestors",
        "Grandma used to tell me never pour boiling water on tea bags... always wait till the water stopped boiling - this lowered the temp of the water about 5 degrees, which also turned out to be the same time it takes to pour water into the cup with no bags so heat the glass... so proceedure was... Boiling water into empty cup, wait 5 seconds, pour out, add tea bag, pour hot water on bag, let it seep 30 seconds, add sugar and milk, stir, leave bag in cup or remove with 1 finger to lightly press the bag...  no too hard.",
        "Matt : \"your tea sucks\"\n\nBri'ish people : so you've literally chosen death",
        "Wait they didn't test for  : if Microwave or boiling  water  tea is better ? Did they ?",
        "Something to add as a note is the pyramid tea bags are often made out of plastic and micro plastics as a result with the boiling water is something you want to avoid (plus more plastic waste) so paper bags are far superior",
        "you'd actually have to redo the cup test to determine the temperature, since the two non glass cups had the water poured twice, which would cool them more, as compared to the glass cup that received the water directly from the kettle.",
        "Theory idea: How long can you survive on only Thanksgiving leftovers?",
        "I've been drinking tea for about a year now, as coffee began giving me HORRENDUS heartburn. I was very apprehensive about using milk in my tea, but always felt like my plain tea with sugar was too light, if that makes sense. I went out on a limb and added a splash of milk to the top of the cup, and was pleasantly surprised. It didn't counteract the flavor, but instead complimented and gave it a very satisfying creaminess. ",
        "I might be special but I like a teaspoon of honey without milk but that is just how I was raised to drink tea from my grandfather",
        "Milk first?! Wtf I'm British I put it last too cool down the boiling water, plus not many people use tea pots anymore. Even if we do it's always milk last",
        "I live on tea, a couple of litres per a good tea-day.\n\nI approve of this episode.",
        "2:55 She has horrendous taste in improperly Prepared Tea.",
        "I started drinking tea from this video and now I'm addicted to tea",
        "Okay, now do it again with green tea from a traditional Japanese perspective!",
        "Balkan tea:boil water pour the mug, put the tea bag in,let it soak/cool after a little bit put sme lemon juice and a little honey and walla",
        "As someone who works in hospital in London, and makes tea and coffee for a living, I have never see anyone put the milk in the cup before the tea.",
        "Stop making the tea joke!!!!!!!!!!!!!!!!",
        "Don't give up on sprouting your avocado! It can take 2 - 3 months for them to sprout, the ones that I sprouted typically took that long at least. They really like to take their time :P\nAlso you should sprout like 10 of them, then choose the best 4 or so to grow, you want multiple trees for pollinating later on as they don't give good fruit from self pollination.",
        "Them: warm leaf water\nMe: hot leaf juice!!!",
        "Its the opposite here in Australia mate'",
        "6:32 Matt's face when it first happens oh goddd",
        "Having boiled and then microwaving tea there isn't a huge difference. At least not to me.\n\nFor me though I don't add anything to my tea, I just drink the tea by itself",
        "This reminds me of an essay by George Orwell, \"A nice cup of tea\" He kinda was on point",
        "I have a huge mug that I use for my tea, and I drink it a liter at a time. ",
        "Asking this at the start of the video. Does pouring hot water in your mug/pot first to warm it up, pouring that water out, then pouring more hot water over the tea improve or change the taste? I read it in a novel once.",
        "The best cup of tea I ever had was from a tea house at the end of a Chinese tea ceremony. While the Japanese tea ceremony is mostly about the beauty of the ceremony, the entire purpose of the Chinese tea ceremony is to maximize the enjoyment of the tea.\nIf you get the opportunity to experience a Chinese tea ceremony I highly recommend.",
        "But the pyramid tea bags are horrible for the environment!",
        "I would love to see this experiment with cold brew vs. regular brew vs. sun brew. each has it's own unique flavor. I would love to see a contest to see which one everyone thinks taste better.",
        "As a British girl I easily drink 5 - 7 cups a day",
        "So, something I've noticed with my tea since I steep the tea without a strainer in my cast iron tea pot and pour it through a strainer into my cup, it tends to come out hotter since the tea pot itself was used to heat the water. I've found that adding the milk first, tempering it with a small amount of tea and then adding the rest in is better because if I add the milk last I've had it curdle before. I haven't had this issue with rice milk which is what I prefer but it's happened a good number of times with cow milk.",
        "Well I'm British",
        "MatPat: \"... leaf water ...\"\nUncle Iroh: \"so you wanna catch these hands?\"",
        "I can just picture all the Asians watching collectively cringing at everything they're seeing.",
        "Happy birthday to you Matpat",
        "A flat plate is the best way to enjoy tea",
        "BEST MILK IS NO MILK !",
        "No milk or sugar, you should put honey in tea",
        "But what about the type of milk. What about using whole milk vs 2% or skim. And what about milk alternatives like soy, almond, or coconut.",
        "Love the theory. I'm actually part of #teamnomilk too! So MatPat, you're not alone my friend. Since I don't put milk in my tea, I'm wondering if: I should put the teabag first, then the hot water OR hot water first, then the teabag?",
        "The puns in this episode were TEAdious... ",
        "Wait? Why did the pyramid keep being recommended over the loose leaf?",
        "Why didn’t you do water temp…",
        "As a Turk, I am proud to say that putting the milk on top of tea is our tradition. Btw I was kinda hoping you would also use tulip-shaped glass called ince belli (slim waist) for the shape test.",
        "I can already see Master Wu clicking the subscribe button along with Iroh and Master Splinter",
        "Was the final test with the milk order, brewed in the mug or in the pot? There is one variable you missed out. In the UK, we have builders tea, most common way of drinking tea here hands down. The bag is added to the mug, hot water is added and then the milk after brewing has finished. Some heathens add the teabag in with the milk first, then pour the hot water in.",
        "I can’t wait to see Matpat in making a Chinese tea :p gonna learn how different type of tea pots and how to clean tea before pouring balanced hot tea afterwards.",
        "11:50 the glasses push-up lmaoo",
        "I'm like Steph too. Though most of the tea I drink throughouth the day do not contain Caffeine or else my sleep will be totally destroyed.",
        "wait you actually use regular liquid milk??? where i’m from most people just use either powdered milk or condensed milk lmaoo",
        "For my birthday my husband got me a subscription to tea around the world love it",
        "I would love if matpat made a history channel, then he could write visiting nations as business expenses",
        "The Kenyan way is the right way 🇰🇪🇰🇪🇰🇪🇰🇪🇰🇪🇰🇪",
        "I’ve literally never put milk in my tea unless I’m making Boba ",
        "Milk in Tea is For PSYCHOPATHS... But That's None of My busyness",
        "I'm sorry Stephanie, I have to heat my water up in the microwave  I don't have a kettle and I don't trust myself to boil water in a pot",
        "I quite like the bitterness which comes form squizing the teabag. My teabags are in flat circular Shape so you missed one",
        "3:00 you can just see the concern in their faces",
        "I love the whole episode, except for one thing. I have always been taught you put the teabag in first and pour the hot water over the tea.",
        "I wanted to learn the optimum southern sweet tea not this disgrace :c",
        "3-4 cups of tea ha them be rookie number lol",
        "As someone who has never had coffee or tea. This episode was quite irrelevant to me.",
        "As a British person this video is not ruining my tea experience",
        "My subtitles when he says \"why am I here\" says why am I hair",
        "0:56 \"Warm leaf water\"\n\nSteph: \"How could a member of my own family say something so horrible?\"",
        "arabs drink tea 5-10 cups a day",
        "As a Brit, I’ve always been told milk last, as back in the day the upper classes would use sugar cubes, and adding milk first wouldn’t be hot enough to dissolve the sugar properly.",
        "Milk? Give me cream or give me death.",
        "\"not in a microwave\" what's wrong with boiling water in a microwave, it's MADE for boiling water, boiling water is how it heats things, it is the IDEAL thing for boiling water.\n\ngiven the known absorption of microwaves in water if you have a known quantity of water you can get to your desired temperature quicker and more consistently than a range or electric kettle. and it's not going to go OVER 100 c because water, so boiling is boiling.",
        "I love how the final result was pretty much how I make tea anyway",
        "The absolute distress on Tom's face at the milk bit in that viral video. I can't. ",
        "Steph wouldn't like me because I do make my tea in the microwave",
        "for me, the best way to steep tea is leaving the bag in until it's cool enough to drink, then drinking it with the teabag still in, lol",
        "Now that's a good american stand up comedy",
        "Well, I eat my pizza on paper plates and it tastes better then on a regular plate",
        "What type of milk?",
        "Why????????",
        "I'm British and I looooove tea, and I've never heard or seen anyone put their milk first LOL \nAlso I'm a no milk type of drinker XD",
        "2 minutes in and there's so many tea puns... It'll drive me to insanitea",
        "as a brit, everyone i know does exactly this, never seen anyone put milk first, I think that tradition has been toppled already",
        "1:25 If this channel ever does a video on a food or meal including fish, I hope that MatPat makes a \"gill-ty\" pun.",
        "I find it odd to use milk for tea but for years I use milk for hot coco so who am I to judge",
        "this guy made a sucsesfull chanal from talking about hiw tiktok and chuckeceese is poisining us and other very random things",
        "The fact that Matpat had to explain that there where different types of tea made me realize exactly how British I am. Like????? This isn't all common knowledge????",
        "I'm gonna get myself some alcohol and take a drink any time this man makes a tea pun",
        "I want this man to be my science teacher. Is that just me?",
        "Yooo You put milk in tea have been lied to",
        "No no no you got to use Yorkshire tea bags that sink to the bottem",
        "I would have loved a teapot vs in cup brew with both milk before and after comparison because my head cannon is it makes less difference with a teapot because of where the brewing takes place.",
        "My grandmother makes tea with the coffee pot lol",
        "You had the perfect opportunity to call it hot leaf juice and you said warm leaf water.",
        "In Scotland we use *CIRCLE* Tea bags, no string",
        "Love from India 🇮🇳🇮🇳,,, and stop calling your (tea) British. it's.  Indian.  too!!!!!!",
        "I can safely say that as a British person, neither have I or anyone I've known ever in my life put milk on the bottom we all agree that milk on top is better",
        "Hello Food Theory, when i was younger I used to not like spinage soup, so I used to guess how many spoons it would take to eat it up. The question is: what is the best method to guess the amount of spoons it will take? (Im swedish so my english is not so good)",
        "How a British can be a Tea expert, as an Indian I feel outrageous.",
        "Brits also pour milk on top. And I'm kinda surprised you've got pretty much everything right",
        "I was always taught milk goes in last as it would 'clog' the tea bag making it harder for the flavour to come out. No idea on the science there haha but I'm English and already do that ",
        "no milk in tea",
        "I'm going to troll here and say eastern tea is better.  Give me a silk oolong any day.  And for all that is good in the world, do not use boiling hot water!  That would be as bad as using boiling hot water to make coffee.",
        "\"We needed someone born in it. We needed someone British \"\n\nThe Chinese: Sadness noises",
        "Try Arabic tea you boil the water in a kettle WITH THE TEA LEAVES you ditch the milk and put 1-5 teaspoons of sugar depending on if you want it sweet or not then you enjoy it's very tasty with kaak aka bread sticks",
        "TEA HAS MILK IN IT?? SINCE WHEN??? WHAT??? I NEVER EVER SEEN THAT EVER UNTIL NOW??????????????????!?!?&:$3833!38:!:&& (context: am Mexican American ig? And I don't care for gea unless my stommy hurt, but also in media I've never seen people ever use milk wtff)",
        "not my britsh self being offended when i read the title",
        "I only drink tea with milk when it's chai latte.",
        "when making tea in a teapot your supposed to warm the pot not for some fancy hoidy toidy reason but to prevent it over cooling the tea once the pot is warmed you can pour the water into your cups to have them warmed whilst you add fresh hot water back to the now warmed pot to commence brewing ",
        "I'm not certain who here knows what a tisane is but those have a few episodes of material.  From exploring chamomile to seeing how hibiscus is used in different cultures.",
        "I would love to see this happen again but with other types of teas",
        "This is literally how I've been drinking my tea since I was a teen. I feel SO VALIDATED",
        "I don’t drink hot tea often, but after watching this I’m craving hot tea️",
        "You are adding the teabag after the water...wrong on all levels, you add the water after the teabag. Watch doc brown's proper cup of tea on youtube guys, he can tell you how it's made ",
        "Lactose intolerant. What about nondairy?",
        "I drink lot of tea",
        "glass mug, water first, then milk, that's how far a lifetime of optimising tea has got me.",
        "For those of you who are English, about 5 teaspoons of milk.",
        "3-4 cups a day? Or as we say in Britain, breakfast!",
        "Tom let his intrusive thought win with dropping that tea on steph's hand ",
        "The background illustrated for the animation with the food theory things but also trying to look very old timey British is super cute! Kudos to whoever made that! \nI say that as a brit!\nAlso as a British person who is also half Iranian (another nation of tea) milk is optional, but a small amount is good, I also prefer to sweeten tea with honey if I sweeten it.",
        "OK I have a new theory\nMe and my friends debited about \nis ice cream a solid or liquid?\nyou don't bite the ice cream and u don't drink it so is it solid or liquid?",
        "It is cool to see a more international food theory episode as food varies a lot around the world, food theory often focuses on very US only foods.",
        "I'm from America. I've never been anywhere else. I've always been in America. Don't use microwaves to make tea. For God's sake. No.",
        "If I may, my family has found that a) tea tastes MUCH better if you warm the milk too (eg 30 seconds in the microwave, b) put milk at the bottom, and c) brew the tea separately in a pot before adding it to the milk. If you put the milk in then the water and teabag it will taste sour, as I believe happened in the episode, but if the tea is brewed to completion in a separate vessel and THEN added it will taste magnificent. ",
        "So as an American  I can safely say that Southern sweet tea is the best. Super simple, Ice, tea bags, and a boatload of sugar with a touch of lemon.",
        "Hot water is hot water, so I'm surprised you didn't experiment with microwaved water. And then there's the American way to make tea you didn't touch on: throw teabags in pot of water, bring to boil. It's how we make it, because we make a gallon at a time and drink it from warm all the way to fridge temp. Oh, and sugar, cause milk does NOTHING to tea. Sugar needed to make tea not just dirty water.",
        "I eat the tea leaves",
        "3-4 cups of tea a day?  Those are rookie numbers. I have a 22 oz teacup. I have 4-5 of those a day....\nMost of the pyramid bags are, unfortunately, made of a plastic cloth, and leave microplastics in the tea....",
        "I think I know why the milk first tea isn't as good, why it tastes sorta \"sour\". \nThe same effect that we see in rapidly cooking egg, scrambling, is true in this setting. The boiling water rapidly heats the milk, causing it to begin to spoil. On the other hand, adding it last exposes it to the heat more slowly and prevents the spoiled flavor. That's why adding it second makes it noticeably smoother and richer- you're not cooking the milk (as rapidly). ",
        "putting milk in tea is wrong.",
        "not sure if using the glass mug to measure the amount of boiling water to add to the other mugs would make the glass one be the hottest, it's essentially getting boiling water in it twice and then a 3rd and last time meaning it had the shortest time to cool down as well before consumption ( unless you used a separate glass mug top measure)",
        "0:35 w h a t.",
        "Ok, but what is the best type of water for tea? Anyone who’s had plenty of water that not all water is the same.",
        "Now they just need to try ALL the different kinds and blends of tea",
        "No one in Britain puts the milk in first anymore!!!!!!!!!!!!! We’re still one step ahead of you!!!!!!",
        "Sort of an update about water. Some of the alkaline water (Essentia and Body Armor) are chemically altered to make the pH seem like they are at around 9, and when you drink them, the stomach acid will make the water acidic.",
        "I'm irish and that woman on tiktok must be arrested",
        "I'm from South Africa and we drink rooibos tea to me is way better healthier and no caffeine taste better too, u can add cinnamon,lemon slice and pieces ginger help when u not feeling well",
        "Take a teabag, put it in a mug. Add the amount of sugar you want. Then pour your water (boiled in a kettle) aiming at the bag to diffuse the tea a bit. Add a splash of milk. Stir and press the bag against the side for some more flavour. You can leave it in a bit but that’s just preference. \nThat’s how I do it, I hope it’s not too controversial.",
        "This meme was a masterpiece",
        "Dude the British stole tea from china the true OG tea connoisseurs",
        "at 18:46 matt pat uses the glass cup to dish out hot water, he basicaly pre-heated the glass mug. no surprise its hotter than the others",
        "4:36 ooh AHHH it’s HOT!",
        "Milk in orange pekoe? Y’all are monsters! That’s for chai!",
        "Want a creepy weird Video\n just search up how to Effectively Apple",
        "I would have liked to see variations in temperature. 200, boiling, 180. I know many teas have suggestions, but that could have been tested!",
        " Please spread the Gospel ",
        "can't believe a video made me drink tea again. thank you so much I missed tea more than I thought I would",
        "The best way to make tea is just to put sugar in it.",
        "You didnt try microwave vs kettle. You guys talked about it a few times but never tried it. Also one thing ive heard about tea is you have to do a first steep and throw it away because the second steep is better.",
        "I just put a big mug with three teabags in the microwave and add like a billion gallons of sugar",
        "Those pyramid bags leach microplastics into the watet",
        "YOUR SUPPOSED TO PUT MILK IN TEA WHAT I don't put milk in my fruit flavored tea from Walmart",
        "I'm British and this video was really insulting. ",
        "I use an electric kettle, no sugar no milk just honey.",
        "Never thought we'd get a tea episode like this but it is very much appreciated.\nAlso,no milk in the tea for me ️",
        "Am I the only Brit who puts the milk in last?",
        "I remember when my grandma got like 10k on tea leafs good times ",
        "I think you mean \"Hot leaf juice\"",
        "What about the water temperature? And tea leaves to water ratio?",
        "11:11 The UK Loves their tea so much that they made a whole academy",
        "I watched this while drinking English breakfast tea wondering what our society has come to.",
        "I'M NOT EVEN FROM THE UK YET I'M OUTRAGED BY THE AUDACITY OF THOSE US WOMEN ",
        "Sorry Matt but Indian tea is better",
        "Man you should of had an expert help you on this. The Chinese have had this figured out for thousands of years until the British took credit for everything tea related. Youtube actual experts on the history of tea and how to make it properly. Mei Leaf and Tea House Ghost are two channels that know how to make tea properly.",
        "Steph is a God-tier parent, seeing Tom's wobbly hand and out of the corner of her eye and catching that tea in a split second.",
        "Right. Basically you only put the milk in first if you are pouring from a teacup since it makes it taste nicer however this wouldn’t work with a kettle which is why milk second became the default, second you have to compare brands not just shapes, a Tetley teabag will never compare to a Yorkshire tea and third there is no correct amount of milk, I love a good milky brew but my mother prefers it builders style. Thank you for coming to my Ted Talk",
        "I couldn't give you any stats but I 1000% remember being a teenager and being told to NEVER put the milk in first with coffee or tea because it somehow spoils the milk faster?  I thought it was impossible to be true and tried both ways and surprise surprise, the milk on the bottom had a sour taste to it.",
        "Should have had simplynailogical on this one",
        "The temperature you get the water to and how you pour the water over the tea leaves are big parts of Chinese traditions. It would have been cool to see them tested too.",
        "Funny thing is I don’t know any british person that puts milk in first, myself included. We always put milk in second so i think milk was ever only put in first to protect the ceramics, but have changed the order since then for better tasting tea. This was a great video and I definitely learned a lot, great job ",
        "So going to get grilled for this. Boil water in kettle , put tea(earl grey either bag or loss leaf depends on what I have,  bag in mug and let it step for a few minutes. no milk, no sugar.",
        "Loose leaf  tea no milk  or sweeteners.  Just my preference",
        "Being British, me and my family have always put milk on the top. That way it just generally integrates itself better into the mixture.",
        "why would heating in the microwave make any difference ?",
        "MATPAT WHAT ABOUT THE WATER QUALITEA",
        "As a British person I've never met a single person who puts milk first.",
        "I feel that they should have done a final test: heating water via microwave vs boiling it with the kettle. Sure, they tried the TikTok version but that one not only had the microwaved water but also the portions completely wrong.\nSo now that they have the correct portions they should have had Mat create a couple of tea cups, one with microwaved water and another one with boiled water, and let Steph and Tom taste both to see if they can tell which is which and if either of them is better. This would avoid their negative bias against microwaved water and see if they can really spot a difference.",
        "As an American from the south, I can’t get past putting milk in tea. I have to try it",
        "They prolly heard about milk tea and just guessed how to make it ;-;",
        "if you take off the avocado skin, wrap it in a wet paper towel put it in a ziplock and chuck it in your closet, it'll sprout in a week!!!!!!",
        "I always love a new food theory video!",
        "I currently live in Sri Lanka. We are known for having the best tea. I prefer high grown tea from Nuwara Eliya. To me adding milk and sugar dulls the flavor of the tea. I would recommend that you get a hold of tea from here. It may be labeled as “Ceylon” tea. There are many levels of tea. The Orange Pekoe label has nothing to do with the flavor. OP is generally the best outside of Gold Tips and Silver tips. This is a full leaf tea. The next level is Broken Orange Pekoe which is larger pieces of leaf. Broken Orange Pekoe Fannings  is smaller pieces with Tea Dust being the smallest pieces. As the pieces get smaller the tea will get stronger. In Sri Lanka tea with milk and sugar is called Kiri Te or Milk Tea. Nikong Te is plain tea with nothing added. Tea like wine will have different flavors based on the ground, amount of sunlight, altitude, etc. Teas from different parts of the island have different notes to it.",
        "Maybe it’s because I’m Asian but unless you’re drinking milk tea, milk in any tea tastes terrible lmao",
        "No you actually don’t make lemonade you make life take them lemons back you make your scientist make a combustible lemon and you know the rest if you play portal two",
        "As a life long Brit you just told me what I already knew. And just to be clear, I don't know a single person who puts the milk in first and I have no idea where that myth that we still do comes from.",
        "Waiting for the coffee version",
        "Can we go a coffee version of this episode I would love to see if I’m drinking my coffee wrong",
        "“Leaf water” brilliant words matpat, absolutely…brilliant",
        "british people dont actually put the milk in first anymore",
        "some tea's [that ive tried when sick with a bad throat cold] honey is a really great binding agent for you to add more or less into the tea, granted its all up to you to add the honey into it and the same goes for milk just like how most coffees are okay without the milk or require a special brand of milk, so it wouldn't surprise me that some tea's would end up requiring different and varying amounts of honey [most Walmart's in the USA sell probably the same honey just in a differently shaped bottle tbh-]",
        "3-4 cups a day…”looks at my 4th pot brewing… “how quant…",
        "Wait a minute.  They did milk on bottom and milk on top, but not poured at the same time. Video needs to be done again for science",
        "great video, matpat, but you left out a method; it's a lot less common, but I swear it brews a better cup: the percolator. You wouldn't think so, you'd think it would over brew but actually, I think it actually keeps the tannins at bay, especially if it's the urn variety. (seriously, look at your urn after you've brewed tea in it, and you'll see where all the tannins went. tea stains like a mother..",
        "Despite being born and raised in the U.S. I have never heated my tea water in the microwave",
        "This caused me to put milk in my tea for the first time. I didn't really love it, but i liked what the milk added. The only downside is i used sugar, when i normally use honey. Im sorry anyone in britan.",
        "nice to hear I'm doing everything right with my fav tea UwU",
        "British people don’t put the milk in first anymore tbh",
        "The fact i almost poured water into my cereal while listening to this is reason enough why i watch these videos….now i wonder what cereal with water tastes like",
        "I love how many dated memes are in this video, MatPat is truly a Dad.",
        "Make turkish tea my guy.\n\nTurkish Tea: ",
        "What about sugar cubes?",
        "3-4 cups a day? Those are rookie numbers, you gotta pump those up.",
        "Who puts the milk in first then tea?? Ok I thought everyone made tea the “right” way… I’ve personally never seen the opposite way",
        "Only the Brits would think \"Wow this LEAF WATER is too intense, I should add some milk\"",
        "Also depends on the water that you use, in the north of England/ south of Scotland it's Beter when you add mil at the bottom",
        "Just living for the thumbnail saying \"Your tea is wrong\", but as a Brit their optimised tea method is basically how I make my tea anyway ",
        "But whats the difference between microwave and kettle water?\nAlso if you have another avocado pit, put it in a bag with a damp paper towel till pokes out a root. You can also peel the dark brown skin off the pit after soaking it in warm (but not hot) water to help with mold.\nYou could do an entire theory on avocados ",
        "Check mate I drink ice tea",
        "Twinings brand is super awesome qualitea especially with Earl Grey",
        "FYI many of those pyramid tea bags can leach microplastics in your tea.  Just buy tea and use a tea pot or a tea strainer for your cup.",
        "2 and a coo is the only way to have tea",
        "Every topic on Food Theory feels like a science fair project people do in Elementary School. And I’m all for it",
        "As a British person I always felt milk in first was blasphemy. Now I can point them this way in future. Thanks for winning my tea based arguments in the future!",
        "You are missing one variable that I use every time I make my tea: honey. It soothes your throat when stirred in, but to avoid it being too sweet I squeeze the teabag after brewing it for 3 and a half minutes. Milk is inferior, and I refuse to put it in my tea. Even Matpat agrees with me here. Anyways, I am still making my tea with honey until you disprove me.",
        "Nice to see Matpat got a special guest on this episode so that Steph isn't the only one suffering the entire time from her husband's wacky antics.",
        "Matpat: tannins are SUPER bitter.\n\nFernet Branca: Are you challenging me?!",
        "I heavily avoided this video because the title of the video made it look, very, very bad. Like I thought this was going to be some kind of superiority or bashing or whatever. I kinda wish the title of this video was more honest. Though it's really sad that in the 'tea preparation comparison video' no one thought to try, like methods from china or japan. Or using whole leaves vs the ground stuff.",
        "M T",
        "Microwaving to boil the water doesn't make a difference, but milk before tea bag is pure evil",
        "but what is the best type of milk tho??",
        "The last test he warmed the glass mug, also test a terricota mug that’s the worst for tea",
        "And then there's Midwesterners brewing tea in a reused pickle jar by leaving it in the sun all day.",
        "You forgot Japan. Shame.\nOk, I assume there will a follow-up episode. Also for India, Middle East, China, etc.",
        "Omfg I'm pretty sure Steph's mom senses kicked in at 6:29 right before Tom spills his tea leaves.  Her face screams \"This man will not be able to stop himself from opening that thing and I had better be there to catch the mess.\"",
        "My family thinks im insane for putting milk in my tea",
        "Wow I have been making British tea my whole life without knowing it-",
        "Alternative title: “Your tea is not my cup of tea”\n\nEdit: 15:47 lmfao bunny matt",
        "Loving the cuphead reference 6:11",
        "As a daily tea drinker brit. I'm happy to see I am drinking my tea correctly. \nTeabag and sugar. Then water. Brew for 2-3 Minutes. Then Milk.",
        "13:00 wait, excuse me. If you have 1/4 cup milk and 1 cup water that's a 1:5 ratio",
        "I'm from the UK and I don't drink tea...",
        "I have never tried adding milk to Tea, I didn't even know it was a thing. I'll have to try that next time. I've read cooking your Tea in the microwave, if you include the Tea bags, does help to release it better.",
        "as a British person, i dont put milk in first, and barely anyone does",
        "I did a lab assignment with a 20+ page report on tea and coffee as antioxidants earlier this year. When Mat mentioned that tea is made from Flavonoids and Polyphenols all the memories came rushing back.",
        "I can’t believe I’m saying this but I’m joining the Brittish and other tea lovers to fight MatPat in the name of tea",
        "That sauna joke at around 9 minutes, made me think @matpat should really make a theory about sauna myths and try to use different kinds of saunas for it (electric and wood burning sauna stoves and an infrared sauna). I don't know which channel it should air, but it still might be fun. Or would it be too \"mythbustery\"? Even better, come to Finland to make the episode as a GT not live :D",
        "Can you do a video on the sustanabilyt of eating ramen every meal? Do NOT STEAL THIS +TRADE MARK QUESTION BY ME",
        "okey but steph noticing a small wobble and catching the tea was so impressive and satisfying",
        "Lotta sus vibes in this episode",
        "6:55 Steph doing something important: not just dunk the tea into the cup but slightly stirring it from time to time helping it open up the leaves and extract more taste.\n\nAlso the quality in leaves and if they are whole leaves or grinded changes a lot",
        "Bruh you guys drink tea? I drink hot water. Yeah you heard me right. Plain HOT WATER. The best drink.",
        "do people add sugar to tea?",
        "tea is supposed to have milk?",
        "what about sugar? do you put sugar into the tea and if so is cube or granulated better?",
        "11:06 \nPulling an Abbacchio",
        "my British boyfriend also steeps tea in water first, then sugar to dissolve so it doesn't ruin the amount of tea that can be absorbed, then a splash of milk on the end. My favorite cup is a double walled glass mug. It keeps it hot, but you won't burn your hands on the mug.",
        "These titles are starting to get personal",
        "I don't like hot beverages or tea.",
        "Me when the intro comes : ",
        "I agree wholeheartedly that best tea is with no milk at all.",
        "As a tea drinker I loved this EP. If they revisit this I would love for them to try some other brew types and vessels.",
        "“Lets find the best tea”\nMy head: BESTEA BESTEA BESTEA",
        "The Food TEAorists.",
        "Wait, why isn't Steph using the same tea mug throughout the day? My mum has multiple cups of tea a day, and she always uses the same mug for them.",
        "Ye im British and I love my tea and coffee very milky but thats just how I enjoy my drinks.",
        "The thumbnail is wrong. Us Brits drink tea with milk.",
        "I miss GameTheorist",
        "im american, so disregard my opinion if you want, but i just heat water up in the microwave, pour it into a mug w/ tea bag and sugar.",
        "I see the wife of the owner of this channel actually have quit a good taste, something that actually is pretty impresive",
        "Even I, a technical Spanish/Dominican and my brother in law, who is a pole (I learned tea drinking from him) know and understand this is abuse to this flavoursome beverage.",
        "strong tea often has a bitter kick to it... Milk and sugar curbs the kick",
        "first you ruin my childhood, then you ruin the next generation's childhood, and now you're ruining my tea?",
        "I have like \n2-4 cups of tea every day",
        "Wait a minute... I'm a Brit that's how I make tea!!",
        "I reckon you could have also brewed the tea with different water temperatures to change your flavor.",
        "\"Just rinse em out.\" Easily the hardest I've laughed all week because that totally struck home. It's not like it needs scrubbing guys, just rinse it out and save whoever you live with a headache (or 4).",
        "Love how Steph's mom instincts kicked in to catch the tea leaves",
        "Actually the British were correct with the order of milk and tea in the past, but it was the rich enough people that could do this, in that time that was less than 15% of the population at least, therefore,  the way do it stayed in part, probably should look into what experts says, maybe the knowledge hasn't been lost, but the way the information you gathered was made was by the majority knowledge which came from one branch of british tradition, I think, to lazy to look it up",
        "I have been begging every youtuber I know for ages. I am so glad to finally have this.",
        "today i learned people adding milk to tea is more common than i thought. i did not know people added milk to tea until last year when i started making london fogs. i for the most part just add honey or sugar to my teas.",
        "Several thoughts as a britsh tea drinker.\n3-4 cups a day is nothing. A cup an hour until dinner is my normal limit. \nMilk after has long been the normal when pouring directly to a mug. \nMilk first is predominately when using a teapot. The cooling the teapot gives means the milk doesn't scald, like you found in your test in a mug. ",
        "As a Brit I want to say that I have never seen anyone ever pour there milk in first it may have been an old tradition but not anymore ",
        "here you all are steeping your tea like proper people for jsut a couple minuets, while i am over here leaving my tea bags in my hot water thermos for up to 3-5 hours...idk what you all are complaining about, it tastes better to me, but maybe im a mutant???",
        "I'm British and i was always taught to put the milk in last! It makes a huge difference to the taste!",
        "Not satisfactory",
        "Upset in britishnes",
        "The weird sour note with the milk on bottom probably came from the fact that hot tea was poured on the milk most likely slightly curdling it turning some of the lactose to lactic acid",
        "So I recently did a coffee cupping which is basically the wine testing of coffee and the person who was doing it gave a very in-depth conversation about where coffee comes from and how it's grown. I think that would be a really interesting episode for you guys and I'd love to hear you guys take about it",
        "Fun fact: In India tea is as popular as tea in UK. We drink 2 mandatory tea and whenever we feel like. When someone is starting to cook people ask \"do you know how to make tea\". It is seen like the first thing to learn in culinary.",
        "The best way to brew tea is to use loose leaf tea and a teapot. Teabags are more convenient but the bag should be steeped in hot water for at least 3 minutes. With regard to putting the milk in,this actually depends on the type of cup.used as the upper class had very fine China cups and so put the milk in first to cool the tea down as they thought it would crack the cup. Lastly,regardless of whether you use teabags or loose leaf tea,always use a quality tea ( I.e NOT Liptons)",
        "The flavor in food is in its moisture.  By adding the milk after using the thermal mass of the teacup to lower the temperature, you lose less of the moisture in the milk, and therefore, its flavor.",
        "I'm with Matt on the \"no milk\". If you want milk tea, brew the tea in the hot milk.",
        "As a British person, I've rarely ever seen or heard of someone putting the Milk in first and I think the default for people became to put the Milk in last, didn't know the detail about the Mugs/Cups breaking though I imagine that as soon as the better Mugs/Cups became available that's when they changed it, would love to see a video on the differences between brands (especially flavour, I've run a small test on that myself), the other things added besides Milk like Lemon (as mentioned in The Da Vinci Code), why we don't have tea machines that can make a variety of different Teas like how coffee machines do with coffee and how Tea is made in Asian cultures and how the different flavours affect things",
        "I do Tea, or some times Hot Chacolate.",
        "im so glad for steph, shes gone from eating christmas trees to making tea. Happy holidays",
        "“3-4 cups a day” \n\nLaughs in British rookie numbers",
        "My wife was happy to see Steph getting a positive video experience. In her words \"That woman is a saint for putting up with Matpat, he made her eat trees!\"",
        "Indians right now- MY TEA YOU BRITSSSSS",
        "2nd time asking how long can you live of soup of pho",
        "Theory idea: Do doritos and mountain dew actually have any game-improving nutritional impact? If not, what drink and snack combo is optimal for gaming?",
        "I agree no milk in tea is best.\n\nAlso would love to see an episode about micro plastic in food/water.",
        "6:36 To whoever the editor was that did that, you just made my day!",
        "I agree no milk is the best (for me) :D I would love to see Matpat try gongfu. No theory, just curious what he'd think. I found out about it earlier this year and bought a mini set (just the gaiwan with a smaller and a larger cup) for drinking tea through the day.",
        "You're all wrong, the pefect cup of tea is actually how my dad makes it when i'm hungover on a sunday morning",
        "matpat really delves into the abyss of the internet to find the most absurd tokens of lore no one knew. this guy is a legend. never ceases to amaze me how much lore he can scoop out",
        "Tea,i love tea",
        "Y’all adding milk to tea? *Gasps in southern *",
        "British subscriber here. I have it mostly with less milk and I squeeze the bag when it's taken out (but I add sugar so maybe that counters the tannins?) but everything else for the most part I agree with, and most people I know add the milk last already ",
        "You should have done sugar vs honey",
        "can you make a video about how long you should boil pasta for? or about if people should have died from eating food from Total Drama? maybe both",
        "This is exactly how I’ve always been drinking my cha ",
        "The way I (an American) make tea is:\nHeat water (WITH KETTLE!!!!)\nPut tea in for 3 minutes\nPut half & half in until tea is beige (stirred)",
        "I am certain @thespiffingbrit will have something to say about that.....",
        "I agree with mat I don't like milk with my tea",
        "This is going to make me sick",
        "I am sad that you didn't use the French press to prepare tea. It's the objectively best way to prepare tea and save so many tea leaves from being wasted!",
        "There is one test that mat pat forgot about and that is dose stirring matter",
        "Just because it’s the same brand doesn’t mean the taste is different because of the bag. I’ve tasted regular paper, organic paper and loose leaf earl grey from my brand of choice and they all taste vastly different with different bergamot and tea flavors. It’s not the brewing either it even smells different dry.",
        "They could of tested microwave water vs kettle water to see if there is a taste difference.",
        "2:18 why did they photoshop such a tired picture of him? the original photo does not look this sad! who did this to my manpat?",
        "As someone without a kettle or teapot, what would be the best way to heat water? I know that microwaving is highly discouraged, but how much of a difference (if any) will there be if I heat it in a pot on the stove?\nWith that, how hot should the water be before I use it? My family has a history of bringing the water to a boil, then pouring it directly into the cup with the teabag.",
        "i am not from Uk but i love breakfast tea uk of course and i didn't use milk for once but honey i was love in instant",
        "I just need to say that the glass cup has always been the superior tea",
        "Great video!  Tea is best cold brewed in Boston Harbor.",
        "I'd have been curious to see if there's a difference in using water heated in the microwave. Other than the issue of heating the mug too much, does it make any difference with the water if it's heated to the same temp as with the kettle?",
        "He lied those are not all identical. They all have different letters on them.",
        "Did they forget about the water they used to steep the tea?  Mineral water, filtered, tap, etc.",
        "Mas msa sam sma asm ams",
        "Pov tea is just a leaf/vegetables soup",
        "I love that Steph's spider senses compelled her to save the loose leaf tea before it could hit the floor. Only to throw it at Tom Lmao!",
        "I've Never heard of a British person willingly putting the milk in first. So I'm not sure why this was the assumption here? \nIf anything you'd get accused of being a psychopath.",
        "Watching all of the tea mug exchanges and shared drinking still during times when covid is dangerous really made part of this harder to watch JUST because of those still-ingrained fears from the 2019 era. Not sayin anyone did anything wrong, but remember to stay safe Team Theorist friends!! Covid is still very much a world issue even though we dont get news on it anymore and even with vaccinations. My dad is fully vaxed and came down with it hard literally last week",
        "All I know tea is tea and that a FACT",
        "Me: Is it going to be hard to make a subtle Ryan George reference?\nSteph at 8:58 : Super easy, barely an inconvenience!",
        "We dont put milk on the bottom of the mug. That would be like putting milk before cereal which is wrong in every way",
        "happy birthday to youhappy birthday to youhappy birthday oh happy birthdayhappy birthday to you(sorry. I'm late by 1 day)",
        "Those tea puns, were just brew-tiful.",
        "Nice teaory matpat",
        "You forgot clockwise or anti-clockwise swirling as this is a VERY big argument in England",
        "You had one uncontrolled element in the final experiment.  Your glass mug was hotter because it was used to pour for the other two cups transferring more thermal energy to it before your taste test.  However, I'm sure you caught this after you did the episode.  I've noticed this from personal experience with my Keurig.  If I run hot water to clean it first and use the same mug to catch it, when I finally make my coffee it is hotter than an usual.",
        "You put milk in tea?",
        "My parents call our milk measurements a 'glug' which is when the milk bottle makes one 'glug' as you pour",
        "For the record, since I am not sure it was mentioned, pouring additives before or after only actually matter based on the type of drink. If you want a drink where flavor is fully distributed, you pour the main substance last so everything mixes properly. If you want more of what all of you liked, you are having a drink that is surface cooled enough to drink faster. You taste the sweeter cream flavor which then more subtly introduces the lesser sweet (or savory) flavor. Just wanted to mention that.",
        "I think this is my new favorite food theory video! It has everything I appreciate. An interesting topic, Matpat VO, live experiments, delightful Steph appearances, tea, the appreciation of good tea, jovial Tom, Tiktok failed experiments, inquisitive Matpat, and Skip!",
        "5:57 none",
        "as a modern brit if someone made me tea with the milk in first id cry",
        "I know this is in the end a channel targeted to grasp younger audiences but claiming to create the perfect cup of tea when you only try 3 different variations per variable, the lack of variety weighs down on how accurate your final approximation of perfection is. one example would be the amount of milk, using only 3 measurements with a range of 40+ ml gives nothing more than a lackluster approximation and gives a lack of credibility for the final conclusion. this could be due to time constraints or to make the video more entertaining but in the end, it would have given a much better answer to the question \"what is the perfect cup of tea?\"",
        "What temperature water did you use? Very curious so I can replicate the perfect cup of tea. ",
        "Ok so not a big tea guy and that was my first time seeing that viral tea video guides\n\nBut I have some words to say about that video.if it helps I ak from the uk",
        "Loose-leaf tea - most teabags have some plastic",
        "Me, enjoying my icy, diabetic-coma inducing sweet tea from a Slurpee cup: \"Interesting.\"",
        "Over-brewed tea  is my personal fav",
        "a turkish man : What people add milk?",
        "But what about if you move the flat tea bag up and down, thus moving the leaves around. Also, am I weird for not adding milk to my tea? I TOTALLY agree with Matt. Milk weirdly \"waters\" it down. This video left me with so many questions  #nomilksquad\nEditing this a 3RD TIME (never comment mid episode), I'm shocked that the cup made no difference. Glasses make a huge difference in draft beer, at least I believe so. Guiness made their own glass for that reason. I would have thought tea was the same. Another food theory???",
        "What about the type of milk?",
        "i've always love when steph is in the vid, she's so funny and never in an annoying way, just over all a lovely person.",
        "Wrap it up with the dong tea.",
        "Matt is right. No milk in tea is best tea.",
        "I'm with Matt Patt keep the milk out my tea!",
        "channel idea , suprise theory a channel where you post what you want that either does not fit in the other channels or is sooo huge it is a big suprise"
    ],
    "comments_disabled": false
}