{"video_id": "tR-3BMignl4", "comments": ["Step away from my leafy soup and no one gets hurt!", "Matt: ‘Tea is nothing more than hot leaf water’\nSteph: ‘How could a member of my family say something so horrible?’", "Not gonna lie, was kind of hoping this episode would also cover herbal teas because the lack of caffeine makes quite a big difference when it comes to optimal steep time.  Maybe a follow-up for both this and Iced Team would be cool", "I love how this episode went with everyone's reactions to finding new ways to make tea, or confirming they already had the perfect way.", "Never thought we'd get a tea episode like this but it is very much appreciated.\nAlso,no milk in the tea for me ️", "okey but steph noticing a small wobble and catching the tea was so impressive and satisfying", "Nice to see Matpat got a special guest on this episode so that Steph isn't the only one suffering the entire time from her husband's wacky antics.", "21 minutes watching, and I don't even drink tea.  That's how good this channel is.", "Now we need a Part 2 where Matt tests which milk/milk alternative and sugar/sugar alternative are the best combination with this recipe.", "But what about if you move the flat tea bag up and down, thus moving the leaves around. Also, am I weird for not adding milk to my tea? I TOTALLY agree with Matt. Milk weirdly \"waters\" it down. This video left me with so many questions  #nomilksquad\nEditing this a 3RD TIME (never comment mid episode), I'm shocked that the cup made no difference. Glasses make a huge difference in draft beer, at least I believe so. Guiness made their own glass for that reason. I would have thought tea was the same. Another food theory???", "Funny thing is I don’t know any british person that puts milk in first, myself included. We always put milk in second so i think milk was ever only put in first to protect the ceramics, but have changed the order since then for better tasting tea. This was a great video and I definitely learned a lot, great job ", "I love everything about this - I'm a tea fan as well, but also the fact that you used your channel and time and research to learn how to make something that would make your wife happy - 10/10 great content.", "Fun fact: Tea Time is such a universal practice in Britain that their power grids actually have to account for the spike in consumption from everyone heating up their kettles at once", "i've always love when steph is in the vid, she's so funny and never in an annoying way, just over all a lovely person.", "This is literally how I've been drinking my tea since I was a teen. I feel SO VALIDATED", "There's a problem with pyramid shaped teabags: they're usually made with plastic. Under the heat of hot water, they leach microplastics into your cup. It's generally best to make sure if you can, that your bag doesn't contain plastics.", "The Boston tea part joke at 6:29 is so underrated", "6:30 i love how steff put her hand under his tea leaves just in case and perfectly catches it in time like she knew it was going to happen", "A part two involving traditional Asian methods would be nice.", "Theory idea: Can you survive on only Thanksgiving leftovers until the new year after everyone had their fill?", "I love this video's positive energy/vibe (I don't know which word fits better). You can feel the surprise and excitement from Mat, Steph, and Tom. I had a smile for most of the video.", "Also, if you enjoy the drink, the best vessel is always a rounded one - with tea, a ceramic mug is the best option, but choosing a globular shape where the hole at the top is smaller than the girthiest part of the mug all the aroma gets bottlenecked heightening both senses of taste and smell. (It's the reason wine tastes better out of glasses with such a shape, thus why so many wine glasses have them)", "As a British person who is yet to drink tea I will make sure to tell my family about this", "Just living for the thumbnail saying \"Your tea is wrong\", but as a Brit their optimised tea method is basically how I make my tea anyway ", "Matpat: Your tea sucks. But that’s not of my business\n\nAlso Matpat: makes a whole video about it.", "3-4 cups a day is about how much I drink too. Also, I was a bit shocked that one of the tea mugs you used is the same style as the one I’m drinking tea out of right now.", "Now they just need to try ALL the different kinds and blends of tea", "I would like to note an interesting thing I discovered living with my grandparents in Spain, they add cold milk first to the bottom of the coffee cup, but don't stir after they've added the coffee, this means that you end up drinking boiling coffee and then finally cold milk. This can be counter acted by \"sucking\" the coffee in, instead of just tipping the cup into your mouth.", "Some other points to consider when making tea is the temperature at which you steep the tea, amount of tea leaf and water used for steeping and size of the \"tea leaf\" (fine tea dust vs whole tea leaf). I would agree with Mat that tea with no milk is the best. The unadulterated stuff is just awesome.", "I've been drinking brewed tea for years and I never knew people put milk in it nor that you're suppose to. I love my milkless tea.", "As a British person this video is not ruining my tea experience", "Hopping on the tea train. One experiment that would be fun to try is how different things taste when blocking certain receptors. A good way to do this is with Gymnema tea, which blocks all the sweet-receptors in your mouth. Coming from personal experience it is super bizarre to taste all the food group, especially the one being blocked. Love your vids Mat!", "Thank you, food theory, for actually teaching me how to like tea. ️", "I am sad that you didn't use the French press to prepare tea. It's the objectively best way to prepare tea and save so many tea leaves from being wasted!", "British subscriber here. I have it mostly with less milk and I squeeze the bag when it's taken out (but I add sugar so maybe that counters the tannins?) but everything else for the most part I agree with, and most people I know add the milk last already ", "\"The perfect tea doesnt exist, it cant hurt you\"\nThe perfect tea:", "Iroh: Spittake \"This 'tea' is just hot leaf juice!\"\nZuko: \"Uncle, that's what all tea is.\"\nIroh: \"How could a member of my own family say something so horrible!\"", "This episode was just so delightful, insightful, and fun  Food Theory at it's best!", "As someone who has been drinking loose leaf for years and has been getting into Gong Fu tea recently I didn't expect to get as much out of this as I did.", "I’m British and I’ve been pouring my milk in on top for years, finally I have a video I can show to my peers to prove them wrong. Adding milk first also carries the risk of being absorbed into the tea bag so you lose some of that goodness. The way I make tea is to put the tea bag in first, then pour the hot water over it, stir it around for a bit then take it out, add my sugar and stir it in and then lastly add my milk. It has never failed me yet.", "can't believe a video made me drink tea again. thank you so much I missed tea more than I thought I would", "Usually with the teapot method, you warm the pot with water from your kettle first, empty it, then fill it again and steep your tea.", "Matpat: \"warm leaf water\"\nMy brain:\nUncle Iroh: \"How could a member of my own family say something so horrible!?\"", "The background illustrated for the animation with the food theory things but also trying to look very old timey British is super cute! Kudos to whoever made that! \nI say that as a brit!\nAlso as a British person who is also half Iranian (another nation of tea) milk is optional, but a small amount is good, I also prefer to sweeten tea with honey if I sweeten it.", "So, something I've noticed with my tea since I steep the tea without a strainer in my cast iron tea pot and pour it through a strainer into my cup, it tends to come out hotter since the tea pot itself was used to heat the water. I've found that adding the milk first, tempering it with a small amount of tea and then adding the rest in is better because if I add the milk last I've had it curdle before. I haven't had this issue with rice milk which is what I prefer but it's happened a good number of times with cow milk.", "Don't give up on sprouting your avocado! It can take 2 - 3 months for them to sprout, the ones that I sprouted typically took that long at least. They really like to take their time :P\nAlso you should sprout like 10 of them, then choose the best 4 or so to grow, you want multiple trees for pollinating later on as they don't give good fruit from self pollination.", "Would have love to see an test on cup shape similar to the wine episode!", "I'm surprised you didn't test a gravity pot for brewing. A lot of loose leaf drinkers (myself included) prefer to use them for the convenience alone, and I'm curious if there's a taste difference between a gravity pot and a traditional teapot.", "My wife was happy to see Steph getting a positive video experience. In her words \"That woman is a saint for putting up with Matpat, he made her eat trees!\"", "Watching this for the second time to bask in the success of a nice cup of tea. I used to steep tea for way to long because all I knew was that my mom had told me that if I want it stronger I should steep it for longer. Just made some tea(the way I normally do) but only steeped it for 3 minutes. I only changed that one thing and it made it so much better", "My dad's ex was from the Philippines. She told me that they boil tea bags in milk. Never looked up if it was true or not, but I really like it. Camomile boiled in milk sounds real good rn being that I can't sleep.", "Best yea in my opinion is East Frisian (North West Germany) Tea, where you pour the tea on top of a Kluntje (compressed sugar) and then add half a teaspoon of cream. The slowly melting sugar is enough for several of the small teacups used and adds a nice layering effect because you traditionally don’t stir the tea. First you have the nice creamy layer, then the tea with a little bit of both and then the last sip with a nice sweet aftertaste. There’s really a lot of East Frisian Culture connected to these tea times and the East Frisian Language also shows a lot of similarities to old English (this video shows that really well:", "As an Aussie here it was very enjoyable to sip my hot cuppa while watching this, even paused to make a second !\nI love so much that I hate when I do keto, intermediate fasting purely because I love having 4- 7 milk teas through out the day", "4:39 from my experience, the handle gets hot depending on the manufacture of the mug. My guess is they make the handle out of a cheaper material in some factories.", "Fun fact: The idea of a tea bag was created by accident. It used to come in big blocks that they would just shave off a little at a time and long story short someone started selling it in a bag to transport it and the customers didn't realize they were supposed to open the bag", "I love that the thing mat doesn't think we'll believe is what his wife drinks and how much a day. Twas cute", "My gosh I love them >< thank you editors, this was truly beauTEAful", "That tea catch from Steph was impressive", "Theory idea: Do doritos and mountain dew actually have any game-improving nutritional impact? If not, what drink and snack combo is optimal for gaming?", "It's as Iroh said, the best tea tastes delicious whether it's served in a porcelain pot or a tin cup", "Iroh: This tea is nothing more than hot leaf juice!\nZuko: Uncle...that's what ALL tea is.\nIroh: How can one of my own family say something so horrible?", "The best way to brew tea is to use loose leaf tea and a teapot. Teabags are more convenient but the bag should be steeped in hot water for at least 3 minutes. With regard to putting the milk in,this actually depends on the type of cup.used as the upper class had very fine China cups and so put the milk in first to cool the tea down as they thought it would crack the cup. Lastly,regardless of whether you use teabags or loose leaf tea,always use a quality tea ( I.e NOT Liptons)", "The Tiktok tea made me nearly throw up and I only watched them make and taste it.\n\nHearing them find the milk on top is so amazing to hear since in baking things turn different based on order so to me it makes sense drink mix also would change taste. Also makes me happy I put my milk on top already unless I’m doing southern tea", "The fact that I’m British and i don’t even use milk in my tea ", "I would have liked to see variations in temperature. 200, boiling, 180. I know many teas have suggestions, but that could have been tested!", "some tea's [that ive tried when sick with a bad throat cold] honey is a really great binding agent for you to add more or less into the tea, granted its all up to you to add the honey into it and the same goes for milk just like how most coffees are okay without the milk or require a special brand of milk, so it wouldn't surprise me that some tea's would end up requiring different and varying amounts of honey [most Walmart's in the USA sell probably the same honey just in a differently shaped bottle tbh-]", "I’m British and I have never once in my life seen milk first. It’s always water on tea, followed by milk. You just proved the British way is best.", "What a tearific episode, thanks.", "I'm with Matt on the \"no milk\". If you want milk tea, brew the tea in the hot milk.", "Wait for it when Steph and Matt both realize that their avocado won't grow true to seed and they'll eat the worst avocado in their entire life.", "That's cool. I learnt a fair bit on how the flavour of the tea can vary especially for variables I wouldn't have expected to make a difference (the tea on top of milk part for one although I actually do that). I would have done the first experiment on the steeping tool used  (regular tea bags vs pyramidal vs the spherical tea infuser) differently though. To make the type of tea leaves used exactly the same, I would have chosen one of the tea sources e.g. loose leaf and repackaged the leaves accordingly or cut open one of the pre-packaged, ready-use tea bags and repackaged the leaves. (I get that it's messy and somewhat inconvenient to do though).", "As a British person, I have yet to meet someone who puts milk in the bottom of the cup.", "Every topic on Food Theory feels like a science fair project people do in Elementary School. And I’m all for it", "Okay, so I generally drink herbal teas, since I don't have the spoons in the mornings to make a cup of caffeinated tea. But I do have a suggestion. If, like me, you can't access pyramid tea bags, you can get a similar shape and effect by taking your leaves(I get herbs from my garden and grind them in a pestle and mortar), putting them in a coffee filter - one with a flat bottom - and pinching the top up together and tying it closed with kitchen twine or clipping it closed with a small clip. ", "Glad to know I've been making tea the right way", "as a relatively newbie tea drinker, this was both entertaining and helpful! though, i’ll stick with no milk :)", "Steph: “wow, wow wow wow.”\nMe: having flashbacks to Pitch Meeting episodes ", "Being British, me and my family have always put milk on the top. That way it just generally integrates itself better into the mixture.", "As a British person I've never met a single person who puts milk first.", "I started drinking tea from this video and now I'm addicted to tea", "Can we go a coffee version of this episode I would love to see if I’m drinking my coffee wrong", "There is not a single person in the entire commonwealth who puts this much thought into their cup of tea.", "Y'all are teaching me more than my science class", "Ah yes I hate it when my cup cracks in two when I pour tea ", "as a brit, everyone i know does exactly this, never seen anyone put milk first, I think that tradition has been toppled already", "My mom always makes me tea when I'm chilling playing video games so I don't care what math or science says otherwise, mothers home tea is always the best", "I've been drinking tea for about a year now, as coffee began giving me HORRENDUS heartburn. I was very apprehensive about using milk in my tea, but always felt like my plain tea with sugar was too light, if that makes sense. I went out on a limb and added a splash of milk to the top of the cup, and was pleasantly surprised. It didn't counteract the flavor, but instead complimented and gave it a very satisfying creaminess. ", "y’all gotta try the algerian mint tea, you guys won’t regret it because it’s so good and refreshing.", "In Germany they tell you to steep the tea for up to like 10 minutes, which I guess explains why I have to put in 3 spoons of sugar to taste anything but hot water", "This was pointless and i love it. Im here for it. And turns out ive been making my tea right for 20 years lol", "as an Australian, a lot of our culture is steeped in British traditions and lemme tell u. 3-4 cups a day is not a terrible amount. Using a different mug each time is an interesting choice though. I have one mug i got given by my sister for my 19th birthday and i’ve used it every day since (im 24 now)", "Barista here. I noticed two things in this vid. First off, yeah, the 1/4 of milk in tea is getting into a London Fog or Tea Latte territory. A normal cup of tea shouldn't have that much milk, but there are drinks where you want that much. ", "Okay, now do it again with green tea from a traditional Japanese perspective!", "You didn't check whether you should put the water in first and then add the teabag, or put the teabag in first and then add the water. That last one is how I do it, and I've heard it makes a difference.\nAlso, four cups? Get on my level, Stephany, I sometimes drink an entire liter of tea in the morning. ", "Your friend from across the pond was a really good add. This whole video answers questions I never had", "I would have loved a teapot vs in cup brew with both milk before and after comparison because my head cannon is it makes less difference with a teapot because of where the brewing takes place.", "Mat: Likes Coke\nSteph: Likes Tea\nMat: Impossible.", "Happy birthday, MatPat! Hope it's absolutely tea-riffic! Here's to many more years of theories and fun. :)", "Visiting Bangladesh, I've had the best tea over here, no matter whose house I'm visiting. The whole Bengal region is mad about tea, I'm sure that's true for most of South Asia and east asia. They boil the tea in a pot with the leaves, sometimes use jaggery goor (unrefined cane sugar with molasses etc) instead of sugar and use milk powder a lot rather than milk. Tastes amazing. In the UK, malty biscuit Yorkshire tea is the only thing that comes close.", "Lol, here is one you don't seem to have thought of: \nI brew it in my COFFEE MAKER (well, it used to be my dad's coffee maker before he passed away in 2013- but I am allergic to coffee, so I invented a reason to use it) when I plan to have more than 1 cup a day.  "]}