{"video_id": "tRRTx_jXaWQ", "comments": ["These edits are amazing", "I just wanna say this guy spend a lot of money and spends a lot of time working on these types of videos and to post a new video every Tuesday really impresses me so how about we get matthew to 3 mil before the end of 2022", "We all have to appreciate the work that he done for us", "Very impressed! Is there ANYTHING you guys can't do? great job;)", "This should be in the guinness world record", "Let’s appreciate how he literally built the LARGEST COMPUTER for us!! Like he puts in so much work to make us happy!!! Love you Matthew!", "Somebody go and get this guy a Guinness world record for him and his team", "Absolutely INCREDIBLE stream DOC !!! Much love to you and  Z thank you for a amazing experience!! Yayaya!!!", "Matthew never fails to entertain us", "Can we all appreciate how Matthew Beem Never fails to entertain us! Love u Matt", "Another insane build!", "These ideas keep getting better and better ", "Karl’s reaction is just priceless lol", "This deserves WAYYY more recognition.", "amazing work matt, your'e an inspiration!", "Your videos are very unique and incredible! I really like them! I hope you can inspire and help more people! God bless you Mr. Beem! All the way from the PHILIPPINES!", "this was such a cool idea! and the execution was so good. nice video.", "This man’s dedication is literally insane.", "Soo COOL! It's been hard to find some good original content on YouTube these days, GOOD JOB!", "Wow that’s insane man Great Job!", "Good job love the effort you put into your builds and videos.", "You did really amazing matt. This is one of my favourite projects of yours so far. Keep up the awesome work.", "This man grew so fast and he really deserves that. I remember when he was At like 400k", "That’s insane! Keep up the good work and beam team for life!", "I can’t believe his bank account can keep up with this and making videos every Tuesday! Thanks for making amazing content and for the extreme dedication :D", "thank you for making these videos for this youtube comunity i see how much hard work and detecation put into this project congradulations", "Can we all appreciate how Matthew Beem Never fails to entertain us! Love u Matt", "Everytime I watch this series I'm always so impressed by Techno's creativity, ruthlessness, and dedication to achieve his goals. Even after his passing his ingenuity continues to have an impact on Youtube and its creators. Rest easy, King. TECHNOBLADE NEVER DIES:_TechnoSalute:", "love to see the work that's put into this", "the dynamic between lachlan and simon is amazing", "Cheers man for your extreme hardwork ", "This is still crazy to me how they can do all this in such a small amount of time", "I can't even imagine how much work went into this  Congrats Beem Team!!", "It was really cool seeing you guys put it together... good job!", "You gotta appreciate, we gotta value corys efforts and work. My mans eyes are red for working hard on those videos. I love you cory. Greetings from mexico", "Keep up the great work Matthew ", "That is such a cool build Matthew!", "Such a cool build. Love your videos. ", "As always you guys pulled it off.\namazing work guys , keep it up", "I can’t wait to watch this video I love your channel and how much work you put into them thank you so much beem team", "I love how he said “I brought in one of the biggest gaming creators in the world” and Karl shows up", "I just think that them getting crazy amounts of wood from their local home-depot-hardware store is hilarious. ", "Oh I watched this live and it was brutal. I loved it and I hope SmallAnt and Shady will return to ace this challenge. I believe with the acquired experience they can ace this.", "Loved working with you guys!!", "Love how Cory is always being hyped and energetic in all of his uploads, I also greatly appreciate his consistent uploads", "I like how much money he spends just for his projects", "That is Amazing it looks so cool congrats ", "Awesome video  Matthew beem can't for the one you never failed to disappoint with a new video", " that was so cool to see it ACTUALLY WORKED!\nNice job dude!", "Bro will do anything to make us happy It never fails he always keeps us entertained", "the edit is so cool too! such an efficient video, v entertaining to watch, gj boys!", "This man is so smart uploads every tuesday to keep his viewers by them knowing when hes gonna upload. Gives himself a week plus more to make the video. And the content is good. He gains subs quickly. Amazing channel!!", "What an awesome video as always!", "actually cried a tear at this one. cinematic masterpiece papa", "Bro this man is the GOAT nothing can stop him!!! He spent 3 months on a giant computer Sub to Mathew Beam!!!", "This guy is a content machine. Keep it up my man", "the effort that the team put in wow", "Hey Matthew keep on doing what you are doing love your vids", "I enjoy your videos everyday and I want you guys to keep on going keep on working hard and I'll always be there to support you", "I hope your channel grows Matthew because your content influences all YouTubers and us as a fan. To make people happy is what your content is all about. That it is impossible that ever build in your channel that no one ever build before. I believe in you and bring home the SUB to everyone", "I love how beem never drives he always flies", "I love your YouTube videos. They are so good.", "nice video! Keep up the good work!", "Love your videos keep it up!", "This is awesome! Keep up the good work Mathew! ", "amazing project\nI'd love to live in it...\nThe only thing I'm worried about is that idk if this can survive rain", "There’s nothing you guys can’t do! ️", "This is awesome, I love your computer guy he's actually really good! First video I have seen of yours and I'll be subbing! I gotta say 3 dollars an hour is about what Apple pays their warehouse employees probbably too...", "Amazing job! ", "This guy is unstoppable. He has never given up. He'll soon be the next MrBeast. Great Work Man!", "He literally never disappoints us I enjoy is videos so much", "Dude I remember when this guy didn’t even have 49k subs. It’s amazing to see how fast he grew", "Keep up the good work you do what ever it takes to do it", "Congrats to everyone for making it", "You never seize to amaze me tbh... great work bro..", "one question how do you do these videos so fast and they are so great and amazing ?", "Don’t give up Matthew you are amazing at this stuff. I love that you’re always trying to do the largest thing. My favorite was this giant Mac computer. Love your videos Matthew. Keep up the good work. #BeemTeam", "Matthew is just crazy and his work is just amazing  btw great job Matthew ", "buen trabajo matthew todo lo que haces es maravilloso, felicidades", "This is the craziest project you guys have ever done and it’s also coolest project please make more videos like this", "1 word: This is EXTREMELY CRAZY\n\nPretty crazy I had to use more than 1 word to describe Matt Beem’s video", "you can tell he cried after they attepted to put layer 2 on poor guy works so hard and isnt even at 10 million he deserves it i hope hes happy with the cumputer", "Keep up the great work", "\"what do you need all that wood for?!\"\n\"We're building a computer!\"", "Only if techno is here nothing would stop him from completing the game of Minecraft on the world's biggest computer", "Funny how they wanted the kid for a lot of help", "This video needs real props wow very impressed ", "I love your videos. You guys are so creative expiring and you guys do awesome videos watch it every day.", "Congrats Beam Team.", "This is the craziest thing we have ever done! Turned out amazing ! #beemteam", "He deserves way more subscribers I love his videos and all the money and hard work he puts into them ", "Hey Mathew I love your vids and I love how you work so hard to make everyone happy", "You worked on this for 3 MONTHS! Im proud of you :D ", "When the world needed him most he came back.", "Matthew , I CANT BELIEVE UR WASTING YOUR MONEY FOR US TO SEE THIS AMAZING CONTENT YOU ARE TRULY CRAZY! THIS TOOK ALOT OF HARD WORK! keep it up!  Karl must freak out!", "Still doesn’t compare from the computers in the 1930’s", "Hi matthew i've been following you for more than 3 years now and i love your videos keep up the good work ", "this is literally what I’ve wanted to do lmao this is amazing", "gongrats mathew beem! i know you worked very hard", "I like how you guys don't give up keep going "]}