{
    "video_id": "tRRTx_jXaWQ",
    "comments": [
        " that was so cool to see it ACTUALLY WORKED!\nNice job dude!",
        "No matter what happens, how old I get, what happens in my life, who comes in and out of it, these videos will always be here for me, and for all of us. Techno was a light that shone brighter than any other out there, and he was a real beacon of hope for many of us. I'm just very glad that he's resting now, and doesn't have to suffer anymore. Props to you, Techno, and as the saying goes, \"Technoblade nevah dies!\" :(",
        "Clearly never watched Guide to the Galaxy before. That is the biggest working computer.",
        "I love how beem never drives he always flies",
        "Hi",
        "I LIFE IN DENVER CO",
        "I love ur guys videos i watch all of them im subcribed and i have post notifications on\nKeep up the exellent work",
        "Matthew makes the best construction video ever I only can build a Lego ",
        "Why does there say Macintosh",
        "I just learned that a is for subscribers",
        "computa",
        "Where is Cordova?",
        "Why did you not put us last week? I’m not saying it in a mean way",
        "the fact karls hands are painted are consering",
        "gongrats mathew beem! i know you worked very hard",
        "the dynamic between lachlan and simon is amazing",
        "Y do u don’t make the thing in north carleaina",
        "now make 2 giant hands to play it",
        "This is awesome, can I play Apex on it?",
        "Quite impressive, although how come Matthew gets to fly every time and the others have to drive the parts lol. Great vlog!",
        "Mrbeast if he did meth and built stuff",
        "I can't wait for a video titled \"I beat Minecraft on the worlds Largest Computer\"",
        "i love this vieod i love you matthew",
        "Incredible!",
        "Congrats on building the worlds  giant computer!",
        "Can you please build a giant statue of red for me girlfriend",
        "Teamwork More Like Beemwork ",
        "What the hack man 1m views and like 35 lol man",
        "Might be the best last 5 mins of a video I’ve ever seen..wow",
        "ÆŒ",
        "You are always complaining in your videos",
        "please giant lego black",
        "This is the craziest thing we have ever done! Turned out amazing ! #beemteam",
        "Were you doing this in october",
        "You never seize to amaze me tbh... great work bro..",
        "I guess gta 5 loading times can now be 10 seconds faster now.",
        "Aaron‘s joke made my day",
        "Type in P no reason just asking and then O",
        "Watching paint dry was probably the most fun thing they did",
        "No offence but my house this coming Christmas is going to have dancing lights along with music on a radio station. (Active at night) and plugging in and setting up the lights on a Christmas tree is nothing compared to what we are doing this year.",
        "Mother ship LOL",
        "You could have saved a lot of time and money if you made it a laptop...you know cause of the flat screen....",
        "Y'all goated",
        "Because if you did",
        "i want the energy drink plssss",
        "Nice one",
        "You worked on this for 3 MONTHS! Were proud of you :D ",
        "Love it ",
        "done",
        "Next you should make a huge lego man bigger than the computer",
        "Mathew in 2100 we build all the glaxys",
        "We already know the answer is 42.",
        "The keyboard without the letters looked like a white chocolate bar ",
        "mr beast's brother fr",
        "Yo nice work keep it up and youll prob have 10 mil in 7 months or 2",
        "this one of the best things you guys built",
        "Beem  team support",
        "#beamteam",
        "screen zip",
        "WOW ",
        "Where’s the power source to power it?",
        "this was such a cool idea! and the execution was so good. nice video.",
        "son: mom can we get a mr. beast?\nmom: we already have a mr.beast at home.\nmr.beast at home:",
        "I click 1billion time ya I am Lieing",
        "I love how he’s stood watching with his sunglasses on lol",
        "Can you make the worlds largest milktea?",
        "Broooooooo I bet",
        "2",
        "I like how I look like the kid at 4:23 and probably a genius like they stated. And literally is 12 (I am those 3 things). Is it me or is this a hella coincidence?",
        "i subscribed",
        "I want to see you guys to make the biggest phone in the world with customizePaintings",
        "amazing work matt, your'e an inspiration!",
        "its lego not legos",
        "let me get one",
        "Pls do a 50 hours in a flying aeroplane",
        "Well they must be Home Depot‘s favorite customers",
        "This man grew so fast and he really deserves that. I remember when he was At like 400k",
        "Where are your old freinds\\engeeniers",
        "amazing project\nI'd love to live in it...\nThe only thing I'm worried about is that idk if this can survive rain",
        "Am a new subscriber",
        "Bruh I want to play on that computer",
        "Appreciated the work",
        "Matthew should get a award for the 2 second best youtuber",
        "Karl’s reaction is just priceless lol",
        " hahaha",
        "The subscribe key is the ctrl key",
        "This reminds me of a mr beast video just by the editing",
        "TeamBeem!!",
        "What an awesome video as always!",
        "Pooooooooooooooooooooooooooopooooooooooooooooooooooooooooooo",
        "WHTA have I won ? And I have tellgraned",
        "He shud be the necst Ilon musk",
        "BIG SMOKY? LOLOLOLOLOL",
        "Let’s appreciate how he literally built the LARGEST COMPUTER for us!! Like he puts in so much work to make us happy!!! Love you Matthew!",
        "You're too creative \nWish to meet you one day ️️",
        "Wouldn't it be cool if you put the giant computer in a mall",
        "8:58 i heard space monkey not big smokey",
        "STILL CAN'T MATCH THE 1930'S COMPUTERS ",
        "Can I have one for free please ",
        "Mathew’s new video: I will make another planet in space",
        "I can’t believe his bank account can keep up with this and making videos every Tuesday! Thanks for making amazing content and for the extreme dedication :D",
        "Where's cordova?",
        "Hey Matthew Beem I wonder if you could like make 1 of the big slap bracelets I'm sorry if you don't wanna do it cause I'm making the big slap bracelet lying It's Just that I want to make 1 but I can't because I don't have the materials",
        "rain ",
        "Every video he says it’s his hardest challenge yet lol",
        "This is amazing",
        "I love howdelivers aggressive positivity to get the message across everyone, to do something good for those who need it",
        "Wow that is awesome!",
        "day $3.50",
        "You should 100% try to speedrun Minecraft on this GANT computer",
        "Just a question where is Cameron?",
        "Can I get one",
        "Its beautiful ",
        "Mat: knows that mr beat did team trees\n\n\nAlso mat: uses a lot of wood in his videos",
        "This guy is the Albert Einstein/Elon Musk of YouTube",
        "Just earned a sub",
        "this is just NEXT LEVEL ! omg",
        "Wowww!!! its INSANE.... CRAZY!!! ",
        "See's Carl nails ",
        "Speechless ",
        "can i have 1",
        "Damn! This vid had a lot of ads...Beem cashed in for all of the wood that he bought",
        "I want you to live a real life Minecraft house",
        "video idea:can you make huge paintings of youtubers and give it to them?",
        "one question how do you do these videos so fast and they are so great and amazing ?",
        "Mathews bank account- why are we still here just to suffer",
        "Computer for god",
        "Love ur vids!",
        "Is this the first invention where it actually has technology into it?",
        "All of his videos are his hardest challenges",
        "Carl works with MR.beast",
        "I DID!!!!!!!",
        "I just subscribed..please I really need the money please please please",
        "Andza",
        "Another insane build!",
        "You deserve way more subs!",
        "okay thats cool and all, but where are you putting this after this video is out",
        "only thing that would have made it better was if the screen actually worked and you could play minecraft on it",
        "Awesome video  Matthew beem can't for the one you never failed to disappoint with a new video",
        "Wow just wow. You kill it everytime",
        "WHEN IT IS 23:35",
        "Im so worried about one member you used to have. Where is Cordova?????",
        "Make the largest phone in the world",
        "Bro i literally can’t believe that they put in this MUCH work for our entertainment and created with a working 36 feet screen and this is like things that nasa would make",
        "B",
        "That video was awesome!",
        "wanna be mr beast i'm just being honest",
        "OMG",
        "why are people doing this? like what's the point?",
        "Yahoo",
        "No frog was hurt in this video",
        "Mr beast next video first person to beat mincraft on this gets 1 milllion dollars",
        "bro said one of the largest gaming creators then showed karl ",
        "I live in Ohio..",
        "Gfuelllll",
        "Lots Of Love From America’s DairyLand!",
        "Bruh to many wires",
        "they spent sooo much money i bet",
        "#Subscribe.",
        "Been",
        "Oh I watched this live and it was brutal. I loved it and I hope SmallAnt and Shady will return to ace this challenge. I believe with the acquired experience they can ace this.",
        "there's actually 104 keys on a keyboard",
        "Speaker audio",
        "MaKe Me A hOuSe LoL",
        "Hello, I love your Videos It Would Be Awesome To be in one of your giveaways keep working your Awesome.",
        "New subscriber here",
        "Are you have to do is put the worlds largest PC",
        "Benm",
        "not too long ago you were at like 50k then now your youtube is at 2 million, keep up the good work, i've been subscribed for a while now and i hope you reach 3 million by the end of the year",
        "HAYDEN:did you just call me big smokey? calls his truck the \"mothership\"",
        "Why are you making a computer from long time ago. Its 2022",
        "Why did you deside to do an older Apple than the newer one?",
        "Matt can i have one computer? I need a new one for mibecraft",
        "I'm Done",
        "isnt it amazing how matthew beem does his videos every time?",
        "New subscriber",
        "Karl:“Now we just have to beat Minecraft”\nMe:”call dream over I beat he can speed run Minecraft on the huge computer”",
        "Lazarbeam matthew beem",
        "Mathew in 2060:  I Created the biggest Solar system planet",
        "BRO USE A PROJECTOR",
        "Wow you just took the game to another level\n\nLove from Asia Nepal 🇳🇵",
        "do a working phone",
        "Hey Carl if it is sick give it medicine",
        "Wow ",
        "Bro will do anything to make us happy It never fails he always keeps us entertained",
        "this guy is intelligent!",
        "i remember when matthew has 2k subs and now he has 2.2 millinon",
        "Love your videos keep it up!",
        "this becames the tallest building alternative",
        "can you make a giant ps5",
        "one of the most popular gaming creators in the world…. idk about that",
        "Phone give me bro AsUs",
        "Bro I think dreamed that I'm there",
        "Omg Karl must speedrun minecraft hardcore now",
        "Hey Matthew keep on doing what you are doing love your vids",
        "Amazing!",
        "If carl is gonna play minecraft on a biggest computer he has to command the people to know what movements he wants And other stuff.",
        "I subscribe and turn all the Notifications on",
        "Mrbeast wannabe?",
        "Dude these edits are amazing!",
        "Were is cordova",
        "Inga ung ut buh Ubuntu",
        "I am going to North Carolina to!",
        "That's to much woods",
        "I feel bad for tha boys cause their doing all the driving and hard work (no offence mathew )",
        "Just subbed that thing is crazy",
        "WOW",
        "Bro he is a genius that would take me more than a year to make bro Matthew you are seriously the best also nice vids",
        "OMGWODDDD",
        "8:36\nDid you know I did sub!  today!",
        "He literally never disappoints us I enjoy is videos so much",
        "Woah another massive masterpiece from the goat",
        "I live in Westminster Colorado!",
        "If That screen actually worked… +1,000,000£",
        "Haha lol why did you face time yourself in the start",
        "KARL IS THE GOAT",
        "Sorry I triggered something wrong",
        "Please I'm done.",
        "Can i have one my  name is Blezzy Marthina B. Reyes",
        "IFAILEDNONUTNOVEMBER this stream changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience :O",
        "Beemteam",
        "can your make words largest amongus character pls",
        "This was awesome",
        "Both of you look the same",
        "Build the enormous Dragon Slayer",
        "Hello",
        "I'm in Malaysia",
        "This guy is unstoppable. He has never given up. He'll soon be the next MrBeast. Great Work Man!",
        "I don't want a $1000",
        "Imagine playing in a. minecraft server with a 1930s computer",
        "Bean",
        "Does anyone notice Mathew looks like Carl?",
        "that was posted on my birthday",
        "me watching videos at home and being lazy while some dude named Matthew Beem is making the world's biggest computer",
        "Dude how rich are you? You had enough to pay for all that lumber, the Uhaul bill and renting the Crane. Also don’t you need to pay for a permit to use that land? I dare you to do a project this big in California, see how much money you’d be spending there!",
        "This was like the computers in the 1920 or something like that ",
        "Congrats that this didn’t fall",
        "Please I want a cup in a million dollars",
        "I’m a new youtuber",
        "Sheeeesh!!!! Keep it up man",
        "Don’t give up Matthew you are amazing at this stuff. I love that you’re always trying to do the largest thing. My favorite was this giant Mac computer. Love your videos Matthew. Keep up the good work. #BeemTeam",
        "Respect for the Beem team",
        "Hi I subbed and this is crazy",
        "Yeah seems like a giant waste of lumber and everything else just wasteful.",
        "Hey I’m a big big fun",
        "Bruh wow",
        "LESS GO MATTHEW",
        "This is awesome! Keep up the good work Mathew! ",
        "You going broke!",
        "Can you do good guy doll pls And give it away to me",
        "127 BUTTIN",
        "Do they pay you??",
        "You should make an able to be walked into and have a couch and they’re seeing a tiny TV screen that shows what the screen outside sows",
        "Bro Karl with the plot twist at the end “now we just have to beat Minecraft, witch will happen”",
        "What game is this.......\n Wait Am I dumb",
        "Is it bubbly",
        "Why is it always carl️",
        "good job man",
        "I'm just hoping that someday I'll win that 1000$ so yeah testing my luck unsubscribing and then subscribing everyday just for a pc setUp",
        "I love how he said “I brought in one of the biggest gaming creators in the world” and Karl shows up",
        "I wanna say something if you know this dude just know something he spends so much time on these vids and also spend so much money and edit everyone that see's this subscribe to him what are you waiting for also they have to do a lot of math so everyone like and subscribe and share and thank you for reading this.",
        "Better be a windows gigachad machine",
        "I GOT THE 1K YOOO",
        "mat can you do the world's largest i phone",
        "I would love a 1000 dollars I’m 10 plz",
        "Is he getting paid for this by the YouTubers requesting it",
        "Its BIG! Maybe lay a foundation and reinforce it inside and it could be a studio",
        "Build a plane",
        "42",
        "THis is so cool keep it up matthew",
        "Can  I have one of the cops . I never got enythaning",
        "Done 1,000 Here I come",
        "I subscribed now wheres my money.jk",
        "Can you give me 5000k buy next week ",
        "I subscribe",
        "Bro this guy’s videos are so cool he literally builds giant stuff",
        "That’s so cool",
        "Woahhhhhh",
        "️️️️️",
        "Wow!",
        "Bro that's not the spring you should on the video ",
        "Only if techno is here nothing would stop him from completing the game of Minecraft on the world's biggest computer",
        "OMG dude",
        "I hope im the next person to win the 1000 it will really be helpful to me ",
        "#BeenTeam",
        "I’m pretty sure a YouTube made GFUEL",
        "It’ll be funny if apple sue you for copyright the name “Macintosh” lol",
        "Happy Thanksgiving",
        "It may be a good idea to beat MINECRAFT with this giant computer in A TEAM WORKKKK",
        "the new mr beast:  (Mr Beam)",
        "next bill gates",
        "Keep up the great work Matthew ",
        "Coolest thing ever",
        "sub",
        "I am subd and nodvkio",
        "Imagine someone saw and said*hey this is cool",
        "Bro karls reaction is sooooooooooo appy",
        "how?",
        "I want you to spend all your money in 24 hours",
        "Funny how they wanted the kid for a lot of help",
        "There’s nothing you guys can’t do! ️",
        "Loved working with you guys!!",
        "You shouldn't use metal that's the strongest material",
        "Me chance of winning is 2.21 million",
        "You always say they’re in a building thing",
        "1 please",
        "Okay I subscribe because I need the money because my family is poor",
        "Lol",
        "The top of the buttonn",
        "1",
        "It takes 24 hours for paint to dry",
        "Not gonna watch. I bet you'd get better results from a laptop hooked up to a theater screen. The keyboard is the only thing worth noting.",
        "My friend is no where to be found when we get into engagements the other day.  I asked, \"where are you?\"  He replied, \"I had to go get loot.\"  *with no team awareness.\n\nThe casual and common br looter. B)",
        "I can’t wait to watch this video I love your channel and how much work you put into them thank you so much beem team",
        "68 keys",
        "I have been subed for 2 years and I never got 1,000 dollars",
        "NASA supercomputers being left out ig",
        "Huge RESPECT MY GUY ",
        "We need to help them get 3 mill so they could be the best YouTubeber",
        "Man's looks 39 in highschool",
        "Can you give me 5000k",
        "And why did you build it ... What was the point...",
        "Did you destroy it after the video?",
        "I Wana win pls",
        "This is perfect!",
        "If you see that on jour house i play minecarf when i see it",
        "Wow that's amazing. Imagine of you put that money to good use by helping people in need",
        "yo hold on last time i watched u were thinner, can u do a biggest gym build?",
        "This is still crazy to me how they can do all this in such a small amount of time",
        "I mean it’s more like the worlds biggest keyboard and mouse. It’s not really a computer the same way screens at a movie theater aren’t tvs",
        "Alway,s Think About Rainy Days That Would Happend",
        "carl from mrbeast",
        "I cant stand the new wz you gotta fight bots and actual ppl and the fucking loot system armor plating is a knock off apex the leveling system is shot I mean I dont got 3-4 hours every time I jump on I still have love for the game but ima just jump over to insurgency sandstorm or ground branch :O",
        "Dude I remember when this guy didn’t even have 49k subs. It’s amazing to see how fast he grew",
        "To many people do adds by stopping the video. Love how you incorporate the add into the video. Once again a great video. Keep up the great work.",
        "Why Karl tho",
        "can i have £1000",
        "Can I have one",
        "Just buy five big TVs then connect a PC to it",
        "I live in another country",
        "Matthew be like\nVideo A hardest video we ever made.\nVideo B hardest video we ever made.\nVideo C hardest video we ever made.",
        "Why is it macintosh? Macintosh doesn't play minecraft",
        "how did u did that??? im spechles",
        "iPad?",
        "This videos are crazy amazing !!! You guys are great",
        "ssssssssssss",
        "You guys need to make a bigger technoblade since he is the King ",
        "CPU AMD Ryzen 9 5900x 32 Core x2 cpu",
        "OMG I WANNA PLAY ROBLOX ON THAT COMPUTER ",
        "??",
        "This is funny when. The kid said: \"you. Don't know ur letters\"",
        "your awesome",
        "Can you build a Pac man maze for Namco?",
        "Good job btw ",
        "Bros literally mr beast took his whole flow but I can’t get mad mr beast sells so it’s smart",
        "m",
        "you guys astound me you somehow post every tuesday and every time you do something that sounds near impossible i just want to say thank you you entertain millions of people and you deserve millions upon millions of subscribers your just incredible watching you do this just proves that you are one of the most dedicated youtubers ive ever seen congrats guys",
        "I bought a cup not even a hour into this video and I got it today no cash WTF did anyone get any money?",
        "mathew you never do any work your team does",
        "There’s Karl from mr beast",
        "YOU DESERVE MORE VIEWS AND SUBSCRIBERS! ",
        "looks insane \n\nand pricey",
        "Let’s GO new video IVE BEEN WAITING ALL DAY FOR A NEW MATTHEW BEEM VIDEO",
        "Me wondering if there were arrow keys",
        "the money wasted hurts me",
        "bros too big and has to wear a shirt like a bib XD",
        "I like how you guys don't give up keep going ",
        "Sheeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeesh",
        "Amazing ",
        "big computer",
        "I enjoy your videos everyday and I want you guys to keep on going keep on working hard and I'll always be there to support you",
        "Can y’all please do web shooters",
        "Underrated content,thats all i say,i just watched this menace's video and im addicted to it already.",
        "Don't u get a world record for this",
        "Big pikachu",
        "Wow haven’t watched a Mathew beem video in a minute",
        "do you ever get rewards for all of this?",
        "Mrbeast gaming should be on your video",
        "I like and subscribe to your channel",
        "I subscribed :)",
        "i subed for 2 years know",
        "Video suggestion: I made the world's  \nLargest pencil case ",
        "You guys are legends and specially the kid he's a real one yo",
        "I dont know how you dont have 4 million or 5 mill",
        "actually cried a tear at this one. cinematic masterpiece papa",
        "Bro doesn’t even look like a person with the photoshop overhaul in the thumbnail",
        "I'm surprised with all your build you don't submit most of them to the record book",
        "A serious banger ",
        "Bro made a giant modded keyboard while i cant even mod mine respect",
        "Is this a world record build ?",
        "how many days did you take to build this",
        "I wish I had that computer ",
        "We all have to appreciate the work that he done for us",
        "I just wanna say this guy spend a lot of money and spends a lot of time working on these types of videos and to post a new video every Tuesday really impresses me so how about we get matthew to 3 mil before the end of 2022",
        "You guys never have a hard challenge cuz you always  good and strong",
        "2m! subbbbbbb!!!!!!!!!!!!!!!!!!!!!!",
        "I watched your videos when you had 16K Sub your channel has grown so much Matt",
        "Lol it reminds  me of my x",
        "I love your video so much can l pleases be in your videoand if l do l w would be so happy",
        "Good work man great job",
        "macOS It’s big",
        "This is the best build of all it  looks so good i could waste my entire life savings for that {I am 20 YEARS}",
        "Hi love your video",
        "Matthew  can you build me and my friend  a zombie apocalypse",
        "Now beat Minecraft on it",
        "Keep up the great work",
        "Make me some stuff and I'll tells the boys to subscribe to you 1 is Sapnap no cap",
        "I love this man he goes through so much to make people happy",
        "Dude I was a subscriber before 62k",
        "Hey matt i'm your new subscriber and i am from the philippines. I dare you give me 9999usd",
        "A is the first letter of my name",
        "big   phone",
        "so cool man",
        "This is the coolest thing I’ve ever seen",
        "Can we all appreciate how Matthew Beem Never fails to entertain us! Love u Matt",
        "best video",
        "Love this video, striaght into the point an not clickbait.",
        "Please  I subscribed. I stay in Nigeria n winning $1000 will help me a lot",
        "Just Subscribed to page, actually has very cool and creative ideas to surprise his fans and other YouTubers! SUBSCRIBE now everyone! ! !",
        "Why?",
        "Cup",
        "at first i thought he looked like dream but now idk abt that",
        "That’s the old fashion Apple Macintosh",
        "Can you do a video where you build the most largest hotwheels car.",
        "hi i have a youtube ch",
        "Y",
        "I love it",
        "Question:how do you do dis",
        "Where can i get g fuel?",
        "You are amazing you are my favourite youtuber",
        "Now you gotta beat minecraft with it",
        "Is it still in northern carnulineu",
        "I \"C\" you don't know your letters",
        "Man Give This Guy Best Builder of the Year 2022",
        "A",
        "Reminds me of night at the musuem.",
        "That is soo sick️",
        "It ain't no Matthew Been video without something going wrong",
        "For God so loved the world, That He have His only begotten son, so that whosoever believes in Him would be saved. (John 3:16, Bible). We have all broken God’s moral law and have gotten the death penalty. However, Jesus lived a perfect life in order to take our place and endure the wrath of God. He did this because He loves us so much! Repent from sin and trust in what Jesus did for you so your sins can be forgiven and forgotten. <3",
        "\"WE\" or \"My team\" Built. :)",
        "Mrbeast",
        "motherboard asus rog",
        "Yout mom",
        "Next up we get a keyboard that only has \"O P R N ENTER\"",
        "Matthew I need a 10000 dollars",
        "Genius",
        "To whoever reading this, never stop chasing your dreams you can do it. Keep pressing and thriving you will make it! Consistency is the key to achieve your goals.",
        "hi i love you mathew beem",
        "Very bad video",
        "Ta noce",
        "Matthew never fails to entertain us",
        "Subscribed ",
        "So when you guys finish building  and vidios done what do you guys do after with it",
        "Such a cool build. Love your videos. ",
        "We've?",
        "Mathew plzzz make worlds biggest pencil and shoprener",
        "I respect your team and your videos because you do hard work",
        "So cool and amazing",
        "Mathew in every single video: this is the hardest thing we’ve ever done",
        "What does one do with such a giant computer after the video is done?",
        "Can I get a 1000 dollars?",
        "Matthew does the most random stuff",
        "I subbed now what I need 1k",
        "wait but then what happens to the giant computer",
        "Still doesn’t compare from the computers in the 1930’s",
        "Good question M a r k",
        "where is the worlds guinnesses records? huh",
        "Build the teen titans tower please Matthew and the beem teem !!",
        "Your favorite animal gets it",
        "Karl Jacobs ",
        "Imagine it started raining when it was outside ",
        "That is such a cool build Matthew!",
        "I c that the twelve year olds a savage",
        "now kill the ender dagon",
        "Matthew Beem I’m your biggest fan and I just bought the shaker right now",
        "This guy really puts a great effort in his video please everyone subscribe and appreciate his work of art @BeamTeam is great️",
        "No hate, like I love Mathew beem, but how many times he got to say “THIS was the HARDEST project yet. Lol still love it tho",
        "Love From INDIA 🇮🇳",
        "Weres Cordova?",
        "Im back",
        "they're doing lottery for kids with the gfuel shaker cup, sicckkk!",
        "mat is a legend",
        "Doomsday is on the horizon. «These things I have written to you who believe in the name of the Son of God, that you may know that you have eternal life, and that you may continue to believe in the name of the Son of God». «Whoever believes in the Son has eternal life, but whoever rejects the Son will not see life, for God’s wrath remains on them». So, believe in Jesus",
        "The minecraft screan is a projector",
        "Bro the kid is smart ",
        "We have Mr.beast at home:",
        "this has to be a world record right?",
        "Good job love the effort you put into your builds and videos.",
        "I built the worlds largest working “computer” (peripherals)",
        "One of the best videos on YouTube I have seen. . How come I didn’t know about this channel. Subscribed ️",
        "\"One of the most popular gaming creators\" you wish",
        "World best show ️",
        "Great work bro",
        "You are nice",
        "The title should be \"we built the worlds largest working computer\" not \"I built the world's largest working computer\" in the video a whole team build it why should it be titled \"I built the world's largest working computer\" when a whole team made it???",
        "Nice",
        "Hi im from phil i need money in rush",
        "Bouta go bench press a storm cloud so my dad can come back with the milk",
        "The last time I watched you yiu had 800k followers now j\nYou have 2.2million!",
        "these guys never give up"
    ],
    "comments_disabled": false
}