{
    "video_id": "TybjwLS1VtA",
    "comments": [
        "I love my Jewish People but Dave Chapelle is a comedian you can’t compare that to Kanye or Kyrie being blatantly antisemitic in a serious setting.🇮🇱🇮🇱",
        "\"You look like E.T. when they dressed him up for Halloween.\"   I still haven't recovered from this one.",
        "One of his best sketches ..",
        "Funniest SNL has been in 25 years.",
        "The thumbnail looks like Pete Davidson impersonating Dave Chappell",
        "The playa haters don’t get much love. They were iconic. PLAYA HATERS BALL",
        "I was laughing so hard when the \"surprises\" showed up in the sketch lol :) Very much well-enjoyed!",
        "Smoking that Dragon Rock \nListen to that sizzle!!",
        "Always love it when Dave brings back his characters for SNL sketches.",
        "LOVE IT ",
        "05:35 Let's just appreciate how much effort and time he puts in these videos to make our day huge respect! <3 :O",
        "Omfg yes!!!",
        "this man is gonna single-handedly revive the OG trollface memes",
        "I WAS TRYIN SO HARD NOT TO BRAG... BUT THANKS FOR THIS WHOLE ENTIRE EPISODE OF SNL.. YOU REALLY LOVE ME.. AND I REALLY LOVE YOU TOO...",
        "\"That's that dragon spray\" has meme potential.",
        "Cocaine's a hell of a drug.",
        "Dying at the little white boy nodding and mouthing the words \"I am.\" He has a can do attitude. ",
        "A true legend.... I don't have a bucket list but if I did seeing him do stand up  in person would be the only thing on it",
        "I clap harder when I saw Tyrone Biggums than any other cameo",
        "Finally a good episode of SNL this season!! ",
        "It’s crazy how one man can make so many people happy. Looking at all these comments and you can truly see the love we all have for him. Dave Chappelle you are a legend and we need you now more than ever.",
        "All you super sensitive people need to move to a cabin in the woods. This was an epic skit, if you have a sense of humor and watch House of the Dragon.",
        "Chappelle never disappoints",
        "BLWHAHAHAHAHAHAHA, I mean the wardrobe was on point",
        "Dave’s voice has gotten so deep that his Rick James impression is even better now lol",
        "I was kinda hoping Sir Rickon James would sit on the dragon and kick it with his dirty ass boots saying “Fuck yo dragon..!”",
        "My heart is full \nMy life complete \nI’m so much love!!!",
        "i'm sure there's a lot of people out the loop as to why this sketch was so funny but as someone who watched The Chappelle Show, i thought this sketch was awesome",
        "LOVE THIS!   If this was the actual show, I'd be watching it.",
        "Finally something funny on snl besides weekend update",
        "This was freaking classic!!! ",
        "This was a classic!!!!",
        "Blacks in certain roles just looks wrong out of place and rediculess. It's like your mocking blacks ... Light Larry Targerian lol spot on",
        "The dirty boots on the couch Rick James moment, pure gold!",
        "I love the way he introduced this like a Chappelle's Show clip.",
        "We just witnessed in real time, an instant classic",
        "4:05. I lost it.",
        "We need the Chappelle show back! Right now! This was gold!",
        "“Take me to Flea Bottom, so I can check on my hoes…”  omggggg I WILL ALWAYS LOVE YOU DAVE!!!\n\nReal talk, this dude is clearly a legit ASOIAF fan. Chappelle’s Show x Game of Thrones is the mashup I didn’t know I needed!! ",
        "I can't wait for the proximity chat montage, and the next Devil in Me video, life, and Jev is good",
        "Saturday Night Live actually funny??!!!?",
        "Doc was feeling himself in this one baby :",
        "Dave Chapelle never disappoints!",
        "I really wish I found this as funny as the comment section would have you think it is. This had nothing on the old Chappelle show. Felt like watching every other thing that gets brought back for nostalgia but can’t quite live up to what came before. Oh well.",
        "Oh man as a kid growing up watching I watched The Chappelle show all the time. Its dope seeing this skit again",
        "The Matrix",
        "I'm in tears. This was hilarious! Classic TV meets current hit show. Well done.",
        "Holy Crap...SNL hasn't been this funny since the days of Farley.",
        "It’s like SNL dropped their woke script writers and hired MadTv writers from 2003-2008",
        "He said I came here for some dragon rocks  ",
        "Fav characters ",
        "The Player Haters Ball Season 2!!!!",
        "No white face Dave?",
        "Aww.. Charlie Murphy would've been awesome in that skit ",
        "First time I've watched SNL in a long time because it was starting to suck.  Chappelle is their only way back   ",
        "Comedic platinum",
        "I love Dave Chappelle and house of dragons ",
        "I’m so happy to see Dave Chappelle bring back his old characters",
        "Player Haters gone back in time....",
        "I fucking love Dave",
        "Well, Dave Chapelle has officially jumped the shark… besides the ET joke it wasn’t funny at all",
        "Chappelle actually made Snl hilarious",
        "Finally SNL was funny. Next week back to your regularly scheduled cringe.",
        "Dave Chapelle always hilarious",
        "Damn that wasn’t funny at all. Yikes",
        "Bro Dave CHAPPELLE just made this show his show",
        "Love dave and all the classic skits but this wasnt funny at all. As with most SNL skits. Remember mad TV? That was actually funny. SNL usually comes off as stale but I guess they need to appeal to a WIDE audience. Jokes and acting come off as stiff a lot with this show.",
        "Felt like he was reaching pretty far there",
        "Got no problems with ships no problem at all.  Damn all this woke shit.",
        "Died when Kenan started talking about boats ",
        "OMG! That made my day. I forgot all about my mid-term paper about race in the U.S. ",
        "I miss the good old days man TV used to be funny",
        "The only criticism I have is that they forgot Daemon is the father of Rhaena and Baella. Yes, indeedy. Just the whole 'Jace and Luke' being able to satisfy Baella and Rhaena sexually on a whole different dimension LOL.",
        "Game of Thrones meets Coming to America!!! Love IT!! ",
        "Player hater’s ball game of thrones style aye Aye Aye aye Ye",
        "Loved how it kept escalating to the point that that spun entirely out of control and ended with CHP pulling over several dragons.",
        "Funny shit, let those writers walk...give chappele and his friends the show!",
        "Man - you know Charlie would have been all over this - RIP CM",
        "Well if it isn’t our cousin, Light Skin Larry Targaryen ",
        "if just Buck Nasty could've been in this...",
        "Man, Chappelle can even make SNL funny. Props",
        "These costume designers are always on point.",
        "Finally, something funny!!!!!",
        "Did Jace say \"Yeah\"?",
        "the funniest part to me was i literally had to turn my brightness all the way up to even watch this sketch ",
        "Dave Chapelle nostalgia overload.  Loved it!!!",
        "waaaahh! the dragon set Tyrone Biggums crack pipe a blaze!",
        "Rip Charlie Murphy",
        "RIP to Charlie Murphy. I’m sure he’s up high teaching someone’s insides some style while watching this skit. ",
        "This was great how did I miss this",
        "lmao I already know if Charlie murphy was still alive, he would be right there with iconic character",
        "It takes Dave Chappelle to do the entire show, all the skits to have some decent ratings ",
        "This was incredible ",
        "Literally the best SNL skits in like a decade are the ones where Dave brings back his characters from his show",
        "Do ya thang Dave lmao",
        "goes to show how the GOT's franchise has gone south quickly when the \"Woke\" crowd joined in... what's next Transgender Dragon? enjoy Millennials...",
        "The way the little kid mouthed “yeah” got me",
        "Legendary, Dave is back!",
        "I wish you had the rights to all that content from comedy central. That ish is still funny",
        "Bruh I’m dead! ",
        "The \"Yuck\" caught me off guard lol",
        "This should be enough evidence that the Chappelle Show needs to make a comeback!!! ",
        "Dave Chappelle is a national treasure. America could use another show from him right about now.",
        "By far my favorite skit, it was great seeing Donnell and ice T again",
        "The Jews...",
        "Good ol Chappelle Show vibes gave me chills. Love it",
        "Unforgettable",
        "Imagine if that was a little girl. \"I look at my future wife and know that she will definitely satisfy me... sexually\". Is it just me that finds that weird both ways.",
        "Oh man. If he could do a Chappell Show reboot and heal the world with laughter.",
        "Seeing Tyrone and Rick James just gave me LIFE",
        "I saw a post about how black people call the show House of dragons even though it's the dragon. This is reiterating that sentiment.",
        "Oh my I love it at F your Dragon",
        "I love love lovez!!! Dave Chappelle, his killin them softly stand up is my all time favorite!!!",
        "Not the jokes I thought they would make, but entertaining nonetheless",
        "Omfg this is the first time I’ve laughed during SNL in years and it’s thanks to Dave Chapelle and this HoD themed Chapelle Show reunion. “Lookin for some Dragon rocks” killed me omg. I really wish he’d get a show again. Rip Charlie Murphy. Still though I’d die to see him have a sketch comedy/standup show again. He’s still one of the top three most funny comics alive now or ever, holy shit xD",
        "I see Dave's still proliferating the stereotype of a black man.",
        "PLEASE!! Can we please have ED SPELEERS playing Hugh Hammer or Ulf the White?!??  I NEED to see him riding dragons again!!!!!!",
        "Dave Chappelle should be the only one who writes for snl",
        "I can watch this show with just Dave's characters, and tbh, I miss cast members. Kate, Leslie, Cecily, even Pete, etc., because they would've actually not only have left all the funny on the shoulders of Dave, Kenan, Ice T(who really does resemble ET when he wore that wig for Halloween )Donnell Rawlings? Man, Kate and Leslie would've helped eat this skit up, but nevertheless, gotta love Dave as Rick James yelling \"F**K YO DRAGON!\" Tyrone talking about dragon stone crack rock, and telling the king he can get money for a \"banana\" that has just falling on the floor? ",
        "Light skin ned cousin. I spit out my salad    OMG Dave you are something else my bruh.  The audience laughing is insane   ",
        "Everything about that skit but Chapelle was awful.\nThey're still cramming woke garbage into their show.\nIf you're going to make a joke about slavery, make it funny. You guys are forcing the joke in for woke points and it's not even a joke.",
        "Best skit they’ve done in so long lol",
        "Damn Chappell being used by the left, it’s the only way he got back in , lmao",
        "Dave Chappelle should replace Lorne Michaels",
        "Dave is the man",
        "U can tell this is a Chappelle skit and not a SNL writer skit. He is so awesome, brings back memories.",
        "That ET line was gold",
        "Chappelle is a living legend.",
        "Classic Dave Chappelle! I love it!",
        "OMG I freaking died ",
        "This was 100% nostalgia fan service—and I loved every second of it.",
        "This was wholesome. Loved seeing the old characters again!",
        "1:54 i just wanted to comment that it is extremely uncanny to see a child emoting like a soy pmc adult",
        "1:52 The kid nodding is perfection.",
        "I actually really like dva as a whole even fighting her. She feels like an actual tank but not too overkill and the idea of her having a second chance if she could survive just make it bettwr :D O:-)",
        "Man, only Dave Chappelle needed to make this show actually good again.\n\nThis was gold right here.",
        " bruuuuuuuu bring back Dave Chappell show ",
        "Awesome that Donnell is involved.",
        "get it dave!",
        "One of the greatest comedians to add to that list Dave Chappelle the show was off the chain",
        "It’s such a treat for us every time he’s willing to do this. Hilarious",
        "Dave Chappell always have that comedy gold",
        "who is the queen   what is her   instagram  ?",
        "Not going to lie all the jokes were GOD awful until Dave walked through the door then it was nothing but pure gold",
        "Dave's simply the best.",
        "That was the best the show has been in years.",
        "SNOOP DOGG POT FARMER DANCE SONG $$\n\nI got out my pipe stuffed it with pot\n\nYou better believe it held a whole lot.\n\nI whipped out a lighter thumbed up a flame",
        "Damn. Not even Dave Chappelle can save this show. Well... Looks like that's it. Bye.",
        "Lol Dave Chappelle nailed it \"They look out of place\"",
        "When Dave last hosted was the last time I watched snl as it's not funny without him.",
        "so when chappelle show comin back",
        "I love how the band members behind Dave are afraid to show positive emotion for fear of being cancelled. Brahahahaha!",
        "SNL haven’t been this funny since Eddie Murphy was apart of the show",
        "Such a huge fan, he called it “House of Dragons”.",
        "I just watched the part when they depart on their dragons again 20 times. That character and his voice has always made me piss my pants.",
        "The multiverse is a concept if wich we know frightingly little about",
        "Yes this is perfect!",
        "I didn’t watch the SNL. This was 110% Chapelle Show!!!",
        "The cast of snl must have been amazed to hear real laughter for once.",
        "1:50 when she says the little boy we going to satisfy her, he says \"yup\". ",
        "Fukn awesome:')",
        "We missing Buck Nasty  RIP Charlie Murphy",
        "Ye is right Ye is right ye is right ye is right",
        "It's been so long since I actually LOL'd at an SNL skit. D.C. is a legend",
        "I love snl for allowing him all this freedom to create and bring his characters",
        "God I love Dave never fails to make me laugh ",
        "Dave is a damn fool!!!!  ",
        "They should do a new scary movie , movie lol they don’t make films like that anymore. I think it’ll be good lol",
        "Whats with the laughtrack the enitre skit?  Ruined it.",
        "SNL recognizing GREATNESS!!!  Dave Rocks so hard here. ",
        "Love that they got Rawlings and Ice T to cameo  its a Chappelle Show reunion",
        ":D",
        "GOAT",
        "The Time Haters ain't the same without Charlie Murphy",
        "Loved it was hilarious ",
        "Wow man this was crazy to see",
        "The \"Fuck yo dragon!\"  While kicking the dragons seat  gotta love Rick James",
        "RIP CHARLIE MURPHY this was awesome to see all these characters again and I'm glad he was able to bring them back",
        "I love me some Dave Chappelle.\nGlad he came back to SNL.",
        "The quality and the production values of the sketches just get better and better. I always feel as though I'm watching a movie.",
        "Chapelle show preview??",
        "Chapelle show....whooohoo whooo hoooooooo......lets start the show",
        "Boi they should have been done this one amazing",
        "Yes! So he’s cooking up something. Can’t wait to see what he brings next ",
        "Just let Chappelle take over SNL",
        "I came here for some dragon rocks.",
        "Dave is a living legend!! Never change Dave!",
        "Omg I’m literally crying he is crazy ",
        "Bro Ive been watching ssundee since I was like 10 or 12 back in his original crazy crafter series however long ago that was again and this man still makes me smile to this day, bro got all the good vibes and great personality to go with it, props to my man ssundee keeping it strong and still having the same attitude as in the past unlike some YouTuber, I am forever a fan",
        " Dave and Donnell Rawlings\n is back ",
        "Thank goodness for Lorne for this preview.",
        "As if SNL had any other reason to prove the sucked ass, they came out with this. Like holy shit, wtf did I just watch",
        "your content never seems to disappoint me,keep it up!",
        "The loud laugh track pretty much ruined the skit.",
        "Okay mind blown!!  I haven’t had a good gut laugh like that, in a long time!! \nI’m just so thankful that I was on top of everything I just saw!  I guess I’m not so out of touch with the world as I thought.\nThank you Dave Chapelle, for all that you do, and all that you have done bish! ",
        "Finally you get someone that is actually funny! It's about time!",
        "i love how they nailed the lighting exactly",
        "The word is, he's strongly considering  a new Chappelle show",
        "ET when they dressed them up for Halloween. killed me :)",
        "damn SNL was actually funny for once",
        "\"The anvils are falling!\"\ngets looney toon'd",
        "wow that was…. bad \nso funny how the nostalgia itch was scratched for all the simpletons \n\n“but its game of thrones too!”",
        "This is comedy!!! ",
        "Didin't laugh, But I suppose it was nice seeing dave doing these characters again.. even if it wasn't the funniest",
        "We need some more if this may it never end",
        "Watching this and noticing the trio were one man short, shout out to Charlie Murphy, may he and Rick James continue their antics in the afterlife!",
        "I love that Tyrone is back in action. ",
        "The messed up thing is Tyrone smokes \"Rocks\" not meth but he damn sure had a meth pipe. Must've borrowed it from someone on set! That or he evolved to ice... perhaps it's why he has hair now",
        "This is funny as hell",
        "love you dave",
        "Dave Chappell KILLED IT!! ",
        "“F yo dragon  “ ",
        "we need a new Chappelle show where all the characters just sort of pick up where they left off",
        "Keenan is shown why he is still stuck on stupid in the s.n.l hallways",
        "I haven't laughed this hard since the dice competition with ashy Larry  Chapelle is a genius",
        "Lmao. He'd save that show if they made him a regular",
        "Ice-T is the greatest",
        "This was magnificent ",
        "....sick'azz dude",
        "When Ice T appeared, I blew a gasket. Great sketch!",
        "Man I swear Dave needs to do his own show it would be fire",
        "hahah love it thanx Dave and Kenan",
        "Just missing Charlie. RIP ",
        "Yep. That is what SNL needed, to BECOME Chapelle Show.",
        "It is shocking how a show that was last funny over 25 years ago is still on the air. kenan thompson the longest serving cast member and very unfunny is an epic joke not in a funny way.",
        "I have not laughed at a SNL scit in a long time, but Dave is the bomb ",
        "I’m weak lmao the player haters!!! Man I wish Charlie was still alive. Man RIP",
        "Haha I memba",
        "If Dave came out with a weekly show- it would be event television. When it comes to standup/sketch/music combo- no one does it better than Chapelle.",
        "3:26 I came here for some dragon rocks. I’m down to my last one ",
        "OMG i died laughing this is Gold",
        "Loved it",
        "Aww man he should have did Prince too.",
        "That was so damn funny I am still laughing . The dragon lighting the crack pipe hilarious",
        "Damn they were figuring the show out with the new cast since the beginning of the season and there walks Dave and makes it legendary",
        "Literally screaming with happiness when Dave and his boy rolled through that damn door!",
        "Dave Chappelle takes SNL to another level of funny",
        "Oh no no no no wease no ho ho!",
        "\"Dracarys\" - lol im fucking dying",
        "I can’t help but think this skit would’ve so much better if Charlie Murphy was with us still R.I.P",
        "The POLICE XDhahahahahaha",
        "Dragon Rocks! ",
        "Dave's such a legend I love this!",
        "Lol this brought a smile to my face. Long live Chapelle's Show.",
        "I love that dude! Love those characters ",
        "Well that was awesome, like a Chappelle's Show skit. All you were missing was Charlie Murphy",
        "The writers should go threaten to go on strike/boycott more often. Best show in a while.",
        "Dave comes through and completely takes over and we love it",
        "I haven't watched SNL in years, but I couldn't resist Dave Chappelle.  This brings back fond memories of his old show, although I bet this would be even funnier if they gave him full control.",
        "So dope",
        "I cannot imagine how fun it must have been for everyone to walk onto set that day. That set,  those props, those costumes, holy crap you know it had to have been non-stop laughter. Probably went off schedule and they didn't care.",
        "Yo keep it just like this fr fr",
        "no matter how high you fly they always find you,  sorry Dave",
        "Just not the same without Charlie :(",
        "Priceless- Dave is a true comedic genius -  jerry curl dragon spray  dying —",
        "I can’t breathe I laughed so hard. This was definitely a classic to keep forever.",
        "We definitely need a season 3 bad! Lol this just shows it's still gonna be great and that cornhole skit was fucking hilarious",
        "Rick James had me dying laughing!!!",
        "No matter how high I fly, they always find you don’t they?",
        "Omg I love ice t ",
        "Best skit in snl history, hands down- pumps up",
        "    ",
        "I never thought he would pass on. it seemed like he would never die, and would continue to make us all laugh and smile. rest in peace, techno  :[",
        "True Dave Chappelle fans know this is a minor spinoff of the \"Haters Ball\"",
        "bringing back the player haters club lmaoo",
        "My favorite skit from The Chapelle show\n“ the player haters ball”",
        "Charlie Murphy would've been proud. This was great",
        "Bro why isn't any body talking bout how Tyrone switched from crack to meth. Then he smokes his ACTUAL HAND. Just like in real life. Funny as hell and character progression is just ",
        "I'm done",
        "This is the only time SNL is watchable",
        "This is the player haters ball all over agin",
        "Aww  Lord Buck Nasty was still there in spirit RIP ",
        "This affirms  that we need another Dave Chapelle show ASAP!",
        "How do we make snl funny? Make it the Chappelle show",
        "Hate hate hate hate hate",
        "3:03 \"...you look like E.T. when they dressed him up for Halloween ...\" ",
        "The little kid stole the scene for me. That was the best nod and silent \"yep\" when his future wife was saying he will definitely satisfy her, haha.",
        "Notice how he left and gave up billions of dollars to not look stupid from the same exact industry he is now back in, paying him billions, looking stupid.\n(You can't buy your soul back from where you sold it. ️)",
        "The rick james was best haha",
        "Because of modern times, and in a real reality check of the age he was portrayed in the Chappelle Show episode, Clayton Bigsby must have passed away. Otherwise,  I still don't think there was no fuckin way Clayton woulda made a cameo. ",
        "too short. lol",
        "Dave Chappelle can and never will be canceled!",
        "Petition to bring back Chappelle show for just 1 season? ",
        "DAVE IS GOATED FOR BRINGING ALL OF HIS OLD CHARACTERS TO SNL ",
        "This Nostalgic Vibe Is Everything Man, The Chappelle Show Raised Us",
        "They need to do more of SNL Dave Chappelle show.",
        "This was weak garbage, he's long lost his touch if he has to keep dragging out tired characters from the show he walked away from every time he's on SNL.",
        "the best SNL skit in over 20 years",
        "David Chappelle on SNL is epic!",
        "Rest in paradise Charlie Murphy",
        "Chappell’s single skit is funnier than the entire SNL season.",
        "They brought the Playa hater’s club to House of Dragons lmfaooo",
        "Haven’t laughed at any SNL skit until now.",
        "Can Dave host the show every week lol he is hilarious",
        "Ice T stepped on the laugh/rushed his 1st line...haha.",
        "Bring back Chapelle's Show!  Awesome",
        "If Chappelle never has a sketch show again, hosting SNL every other year might be the next best thing we can get",
        "I just came here for some \"Dragon Rocks\"",
        "BEST Comedian and writer  ! Thank you Dave you never fail",
        "Best SNL of the decade",
        "Classic",
        "Can We just appreciate how much time he put into these videos",
        "This is the best thing to happen to SNL since the last time Dave Chappelle was on SNL",
        "In case Dave chappelle wants to know why he got canceled he just needs to come back and watch this over and over and over again so he couldn't tell me when exactly he was ever funny",
        "SNL would have died a long time ago if it wasn't for guest appearances from people like Dave",
        "Brought Chappelle Show right to nbc  ",
        "That was amazing lol",
        "God this was incredible ",
        "Guys make sure she gets 15M.!! She deserves it :-(",
        "This has me laughing  so hard I had to rewind it just to get all the punch lines. Damn this really took me back",
        "i died in laughter, daves the GOAT",
        "Dave Chapelle is an absolute PHENOM!!!",
        "ISHOWSHUTUP,  this stream changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience. >:(",
        "Dave just needs to host snl permanently.",
        "$Tsuka",
        "The only time SNL is funny is when Dave is on",
        "Yeah not funny.",
        "The fact that we never got a re-boot of the Chappelle Show is depressing. It was iconic.",
        "Great sketch.",
        "Dave Chapelle doesn't know there are black British people. Its not an \"old time\" accent. They have British accents. Maybe to your ears it's sounds jarring, but you need to change your perspective. They sound natural since I'm sure it's their natural accent just like you have an American accent.",
        "This was my favorite epispode of SNL in a long time and this was my favorite sketch it was great seeing classic characters from the Chappelle show they're still hilarious but  I was officially  done after \"Light skinned Larry Targaryen\" ",
        "Player haters ball 2.0, Tyron Biggums, and Rick James OMG that would be the absolute best crossover ever!!! R.I.P Charlie Murphy and Patrice O'Neal. We miss you two!",
        "Glad to have Lui back to the crew, this was such a great and remarkable moment for everyone.\n\nAnd that damn High and Squeaky voice. Just ah. Very Nostalgic.",
        "I was waiting for him to say diabolical. Gotta love him",
        "When ever Dave brings his friends and his characters on SNL, you know your going to laugh hard.",
        "Clayton Bigsby in this sketch would have been craaaazy",
        "Miss Dave Chappelle, it's awesome to see him bring back the spirit of his old show. This shit is hysterical ",
        "When Tyrone had Dracarys light up the Crack pipe ",
        "Legends never die! Long live Chappelle",
        "lol",
        "I love it when SNL is actually funny",
        "This whole family look like the sun took a look and said “no, thank you”",
        "Rip charlie..",
        "And Dawnell Rawlings ",
        "Lmao Donnell with the wig broke me ",
        "Dave is the GOAT!",
        "“This whole family looks like the sun took a look and said no thank you”  bruh",
        "Love that they made this SNL with the Chappelle Show-format: having Dave give a short montage before showing the skit",
        "This sketch is so good it got me interested in the real series lol!",
        "He said it was gonna be the blackest SNL episode ever and he delivered. #chappelleshow",
        "Please bring back Chapelle Show.",
        "Let’s petition for the return of Chapelle show",
        "we miss you charlie murphy .",
        "What TRULY could have been icing on the cake is if buc nasty appeared in this sketch, LMFAO. RIP Charlie Murphy",
        "I had to turn up the brightness. Excellent",
        "This is magnificent and so true, great skit.",
        "I miss him being on tv ..  he’s just so darn funny.",
        "YOOOO!! ICE T!!! ",
        "That was amazing omg lmfao",
        "I never thought I wanted Rick in house of the dragons until now ",
        "reminds me of how much I miss Dave Chappelle show, this should come with a chocking hazard warning, if you're eating food while watching lmao",
        "I CANT STOP LAUGHING ",
        "     ",
        "Mark: \"I'm not a masochist\"\nAlso Mark immediately after he finishes Getting Over It for the second time: \"Well, let's go again!!\"",
        "I can honestly say that I haven’t found SNL funny in YEARS (besides the Elon sketch’s) but this was greatly needed. Chappelle needs to come back with a show somehow. He is pure gold. He pisses excellence",
        "Now I’m waiting for the blacks vs the greens basketball game",
        "I assume Chapelle was deliberately embarrassing the SNL writing staff by showing how funny he is and how unfunny they are.",
        "Oooohhhhhhhheeeellllllzzzzyyyeah!!!",
        "My ñinja Dave, the GOAT, is bringing the c show back,... Just watch out!!! Can't wait",
        "The Chapelle Show needs to come back on an uncensored network.",
        "the kids are so adorable. its so hilarious",
        "Thats the best thing snl has done in years",
        "I’m in tears  not since Pryor, Red Foxx, Eddie Murphy ( Delirious, Raw Murphy) Robin Harris and the last time Dave brought his characters back for SNL. That time it was the Walking Dead ",
        "I'm Aegon Targaryen bitch\n\nOMG am dead ROTFLMAO  Dave Chappelle is just beyond a genius at comedy. Love this.",
        "Best SNL Sketch in years. man I miss the Chappelle show",
        "Dave chapelle is a genius  ",
        "I came here for some dragon rocks TYRONE BIGGUMS MY NIGGA",
        "the all piece is very funny but damm you for bringing children and insinuating they would have sex with adults ... propaganda is huge those days specially from those medias .",
        "Okay the skit was just dumb",
        "Probably the best episode they’ve had in a decade.",
        "Best thing to come out of SNL in ages!",
        "Isn't Dave Chappelle antisemitic? That's an issue.",
        "I could give two shits about SNL but for the love of God bring back the Chapelle Show full time!!! ",
        "Dave Chappelle just puts his characters into an SNL skit and it’s the funniest thing they put out that season.",
        "Chloe Fineman is perfect here. Obviously, Dave Chappelle is absolutely hilarious. When he says, “yuck,” and “your Jheri curl’s getting a little dry,” I fucking lose it.",
        "If they wanna just gon head on and rename it \"Saturday Night Chappelle,\" I think we're all good with that. \n\nEveryone agree?",
        "Dave needs to come out with skits again ",
        "I’ve been a huge Dave Chapelle fan since my childhood. I’ve loved his wit his evolution into the comedian he is now. This skit was horrible it just shows he just doesn’t care. It was just a lazy oh let’s put my characters with this and improv. At least the walking dead skit had an impactful juxtaposition. This was just a nostalgic jerkoff.",
        "THIS IS GOLD! I can’t believe SNL let this rock. ",
        "DAMN, Dave is the MAN!!! Cancel who??? That man is comedy!!! No one can cancel Dave Chapelle, EVER!!!",
        "Dave killed it",
        "Possibly one of the BEST sketches, EVER!! Now I gotta go re-watch every episode of The Chappelle Show!!",
        "I may actually watch house of dragons now..   coincidentally tho! To hell with comedy century.",
        "No for real that was the funniest sketch I've seen on this show in decades.",
        "They all just start roasting each other hahaha .",
        "\"The Matrix.. \" ",
        "Missed opportunity to have the jheri curls catch on fire when he lit his pipe.",
        "Him: “Allies have come to pay their respects to the true Queen…”\n\n*The Haters enter the room*",
        "These look awesome.  My wife is hoping for Shy Guy Bazaar to make an appearance!",
        "This makes me miss Chappelle's Show so much. Great seeing these characters again!",
        "Lord, I love Dave Chappelle! He's golden - everything he freaking touches, for real",
        "Lmaoooo   ",
        "Best skit on SNL in 30 years.",
        "RIP Buc Nasty.",
        "I knew someone was gonna joke about it. The only way black characters could get in lot game of thrones is by having blond hair ",
        "This is one of the best skit mash-ups ever.",
        "I loved seeing Dave bring back out the Chappelle show characters! They'd fit right in",
        "Omg plot twists lol",
        "The best SNL has been in a while.",
        "Love Dave Chappelle. That skit was terrible.",
        "Dave is the best lmao ",
        "Mind if I get a light? \"Dracarys\"   ",
        "Props to SNL teams of lighting, costume, animation, makeup, and everyone in everything for this skit. This looks amazing and the actors did an amazing job",
        "“LightSkin Larry”",
        "Hahaha ",
        "Dave touchs anything it's become gold! He must be the greatest",
        "Fvck yo dragon",
        "Loved it!! ",
        "I swear!!! Watching Dave, Donnell, and Ice T play those characters never gets old!!!",
        "This is a page from old school SNL...Dave Chappelle slayed this episode!!!",
        "I stood on the edge of my seat waiting for ashy Larry and Rodney \" quills \" dinkins to walk in ....... R.i.p Charlie Murphy ",
        "So happy Dave is still doing his thing",
        "I was wanting to see Prince too",
        "Haha awesome",
        "I love when Sean playthrough these games, his charisma passes the time while we all take in the impactful moments together B)",
        "Better then anything SNL has done in decades",
        "Nailed it  ",
        "Love Dave but this skit was a miss for me. Felt rushed and like they were in a crunch to get the jokes out. But that's just me.",
        "\"the sun took one look at them and said, no thank you\"",
        "When the Player Haters ball, Tyrone Biggums & Rick James meets House of Dragon ",
        "In my car dying laughing and hoping nobody thinks I just smoked PCP.",
        "Wow , he has so much energy his voice almost sounded back to normal",
        "This short skit is better than anytime SnL put out in years",
        "Two of my favorite shows merged ",
        "Every time he rages, Mark completely reboots and just re- pitches the cloakbrand mystery box =:-*",
        "Bring him back every week!  Best stuff ever.",
        "They need a sequel to this!",
        "Sorry there wasn't a single thing funny about it. Chapelle is Don but this was dry and cheesy.",
        "Mannn Dave has been directing all the skits. And it’s perfect. It’s bringing SNL. To a new level",
        "Seeing Tyrone bigums brought back so many good memories haha. Man I miss the Chappelle show",
        "What messed me up the dragon lit Tyrone Crack pipe lmaooo I'm done hilarious ",
        "Cool to make slave jokes but not holocaust jokes.",
        "SNL has fallen so far!!",
        "hilarious",
        "Dave never disappoints and I mean never ",
        "funniest SNL has been in 20 years",
        "This is so classic!",
        "️️️️",
        "Great sketch. Best part is when the dragon lights the crack pipe. Nice to see Chappelle bring back some of his most beloved characters.",
        "Gotta love Dave",
        "For fans of Chappelle Show, who watched it obsessively when it was on, this is like striking a nostalgia nerve.",
        "Wasn't that funny ..",
        "You need to turn the whole show into this!!!",
        "As a fan of Dave Chappelle's work for the last 18 years and a fan of House of the Dragon, this was EPIC!",
        "This skit was vastly better than House Of The Dragon.  That show utterly sucked.",
        "I like you Dave, this wasn't funny.\n\nYou always have something to complain about.  That's not always okay.",
        "Dave as a crack head is the funniest eva",
        "So far every skit has been great!",
        "this is funny asf! this what happens when you let dave chappelle runs the show.. the master of all skit!",
        "When you watch something that is this funny and don't realize that it came from SNL I must say SNL took a risk with nothing to wager and made this ONLY episode funny. Comedy is always about having fun and being funny.",
        "SNL is only good when it's the Chappelle Show.",
        "This lone skit from Chapelle is better than anything SNL has made for the past 20 years.",
        "It's mostly a chaotic tribute to characters. Fine, but they could've done better if they spent more time developing these sketches.",
        "Hell yea chappelle show is back !!! Fuck the haters with there brittle feelings!!",
        "Ok, yeah, this was just a test to see if people want Chappelle Show back. SNL was just the test stage. Loved it!",
        "Omg I love GOT/HOD I’m so glad they did it on SNL",
        "The kid going “mhmm yep” after that satisfaction comment had me rolling ",
        "I dont even think I can watch snl after this !!! Its going to fall so short from this iconic greatness every show after!! ",
        "It shouldn't take me having to watch an SNL skit to put into perspective just how disturbing this show really is. Maybe I'm just broken. It all started with hentai.",
        "I got teary eyed when Silky Johnston walked in.",
        "Haha! Dave Chappelle. Back at it again.  He never gets old.",
        "great sneak preak",
        "I can't remember the last time I saw a funny SNL skit. Chapelle is a Legend!!",
        "SNL’s audience not getting it all is funny asf ",
        "Dragon rocks lol",
        "The editing is getting better, along with the RAAGNHARROOKK in the intro. Keep making bangers Cory",
        "Love how he formatted his episode like his show",
        "SNL sucks but Chappelle makes it tolerable.",
        "That was amazing ",
        "Can we just make SNL the Chapelle Show? Maybe someone would actually laugh at it then",
        "I love watching smi77y play games when I get home on the evening",
        "Dave is the best",
        "Best thing ever",
        "I haven’t laughed that hard at SNL since the Will Farrel days. Welcome back Dave!! ",
        "You mind if I get a light? Drackaris  ",
        "I can feel Charlie Murphy was watching this and laughing in the hereafter. Rest in peace and rest in power!",
        "This sums it up perfectly…its confusing as fxxk I thought I was the only one.",
        "sorry guys youre not allowed to laugh at this if youve tried to \"cancel\" dave before...weird i wonder why its mostly likes? its almost like the offended babies dont actually stand for anything :o",
        "Haha see we have truely lived if you saw this sketch I’m surprised SNL, well done.",
        " legendary",
        "Lol",
        "\"Well if it isn't our cousin, light skinned Larry Targaryen.\"\n\nI'm wheezing ",
        "Dracorys ",
        "Anyone else almost cry?",
        "Where have you come from?\n\nThe Matrix",
        "I got yelled at 3 times cause I kept rewatching this and laughing my ass off",
        "Damn hard to see donnell like that considering the request given to dave that sparked the end of the Chapelle show… still remember watching first few episodes of season 3 as they had other cast hosting it talking bout previous seasons like WTF?!?",
        "I cried laughing",
        "Come on wit the Chapelle show Dave!! ",
        "love it, the monologue was pure dragonfire",
        "This tower is quite possibly some of Grian's best work ! It looks like a building out of a Ghibli movie, you know the kind, one with hundreds of sticky-outy bits and bobs poking out of every corner, looking like a pile of house and structures built upon one another of all styles and architectures under the sun grafted together, clashing yet flowing into a strange harmony, broken down and then repaired a tousand times, all held up by planks and beams, and that could only hold together by some sort of spell. I can't wait to see more of it on the next episode.",
        "Dave gettin' that real smokers' voice ",
        "This was perfect. I’m so happy Dave brought his characters back ",
        "Gotta watch this episode",
        "Just noticed something, which honestly fits perfectly into the entire theme of this video: at 1:37:07, you show Tommy's signature on the legal document from his court case, and his name is listed as Thomas Andrew Tallarico and signed as Thomas A. Tallarico. At 1:48:00 while discussing the Terminator soundtrack, he is listed as Tommy V. Tallarico. I checked his Wiki page and it eschews a middle name entirely, referring to him as just \"Tommy Tallarico\". So my question is:",
        "Fire!!",
        "Amazing!",
        "THAT'S PURE GENIUS!!!!!!!! WHAT HE DID AND HOW HE CRAFTED THE TRUTH. WAKE UP BLACK AMERICA. SHIPS! SHIPS! GENIUS!!!",
        "AND HE DIDNT USE THE DAVE CHAPPEL NAME",
        "Tyrone Biggums makes me love crackheads I swear"
    ],
    "comments_disabled": false
}