{"video_id": "TybjwLS1VtA", "comments": ["Even the way Dave introduced the sketch was like old school Chapelle show.", "I swear!!! Watching Dave, Donnell, and Ice T play those characters never gets old!!!", "Just made me miss Charlie Murphy again, but seeing these characters again is great.  Probably the first time in a long time I wanted an SNL sketch to be longer.", "\"You look like E.T. when they dressed him up for Halloween.\"   I still haven't recovered from this one.", "the fact that he brought out those characters is awesome. love you dave", "Dave Chapelle never disappoints!", "Omg, he straight up took over SNL and turned it into the Chapelle show.  Loved every second of it!!", "This Episode was Epic. I don’t know what type of relationship Dave has with Lorne but it must be awesome. He lets him do his thing and I’m so here for it . We all needed these laughs.", "I can’t breathe I laughed so hard. This was definitely a classic to keep forever.", "Smiled from ear to ear the entire skit", "DAVE IS GOATED FOR BRINGING ALL OF HIS OLD CHARACTERS TO SNL ", "Absolutely fantastic, great acting and great callbacks to old characters, a ton of fun!", "They literally turned SNL into the Chappelle Show, and I’m here for all of it!", "After this sketch, all that I could hear in my head was, \"we're gonna take a quick commercial break and we'll be back with more Chappelle Show\" ", "A true legend.... I don't have a bucket list but if I did seeing him do stand up  in person would be the only thing on it", "I've missed these characters over the years. Glad to see they are doing well.", "your content never seems to disappoint me,keep it up!", "Can We just appreciate how much time he put into these videos", "The Chappelle Show characters never disappoints.", "Dave you got that unforgetable voice. Best tv movie comedy vocals.", "Always love it when Dave brings back his characters for SNL sketches.", "“Yes, I look at my future husband and think he is definitely going to satisfy me sexually.” The little “yep” that Jace gives has me SCREAMIN ️️️️", "This is by far the best SNL skit I have seen in a long time. I laughed from beginning to end.", "Thank you, Techno, for making my childhood so much better.\n\nRest in Peace, Potato King.", "Dave Chappelle just puts his characters into an SNL skit and it’s the funniest thing they put out that season.", "Dave is a living legend!! Never change Dave!", "I never thought he would pass on. it seemed like he would never die, and would continue to make us all laugh and smile. rest in peace, techno  :[", "Dave Chapelle always hilarious", "Miss Dave Chappelle, it's awesome to see him bring back the spirit of his old show. This shit is hysterical ", "It’d be amazing if they offered him a permenant roll on SNL  this was great", "Charlie Murphy and Patrice O'Neal would have definitely made this sketch god-tier. RIP", "I haven’t laughed that hard at SNL since the Will Farrel days. Welcome back Dave!! ", "This is great!! I laughed through the entire video!!", "Love your effort in these videos keep the great work 8-)", "Legends never die! Long live Chappelle", "I can not stop replaying this.   “What up Tsar (sp?), I gotta dragon now.” \nIt’s killin me hahaha", "This affirms  that we need another Dave Chapelle show ASAP!", "Probably the best SNL in a loooooonnnnngggg time. Thanks Dave", "Seeing Dave Chappelle & Donnell In A Skit Again Warms My Soul Unbelievably", "Classic I laughed the whole skit", "Best SNL skit in a while <3", "Dave's such a legend I love this!", "I'll never get tired of Chappelle skits. It's like the season we never got.", "Missed this so badly!!!!!! This is what we need!!! I wish Chappelle had his own show back or anything like this! Dude got screwed!!", "Dave done did it again...always top notch!!!", "The best part was Darnell popping up with the curls lmao", "Priceless- Dave is a true comedic genius -  jerry curl dragon spray  dying —", "Lord, I love Dave Chappelle! He's golden - everything he freaking touches, for real", "This whole family looks like the sun took a look and said no thank you. \nWhat a legend", "I will never not die laughing at Tyron Biggums. That character and Clayton Bigsby are my favorites of Chappelles.", "Love that Donnell was there, he's hysterical too ", "\"Well if it isn't our cousin, light skinned Larry Targaryen.\"\n\nI'm wheezing ", "This was freaking classic!!! ", "This is magnificent and so true, great skit.", "\"...You look like ET when they dressed him up for Halloween.\"  My favorite line of this sketch.", "I love love lovez!!! Dave Chappelle, his killin them softly stand up is my all time favorite!!!", "This is the funniest snl has been in at least a decade. Thanks Dave.", "Haha! Dave Chappelle. Back at it again.  He never gets old.", "OMG!! I haven't laughed that hard since The Dave Chapelle Show ", "Man I swear Dave needs to do his own show it would be fire", "I love snl for allowing him all this freedom to create and bring his characters", "I loved this, I am a big fan of the new show. But this sketch was genuinely good.", "This is amazing. Never stop dave", "Best skit in snl history, hands down- pumps up", "I have not laughed at a SNL scit in a long time, but Dave is the bomb ", "38:41 Lets just take a minute to appreciate how much time and work she put into these videos?\nIt's unbelievable, and I think they deserve a lot more than that", "Excellent tribute to some of his most iconic characters. Dearly missed Charlie Murphy in this one , R.I.P.", "Love it! ", "The dirty boots on the couch Rick James moment, pure gold! ", "Wow that is Literally how Dave presented sketches in Chappelle Show! This is great to see as Big fan of his shows. I wish he could get the rights to have the show come back full time on Comedy Central or some other TV broadcast channel willing to give him a shot. It would be totally successful. The world needs Chappelle show back!", "Gotta love Chappelle! He should be on SNL more often.", "Tyrone!!!! Omg I was not expecting that  I got chills man hahaha amazing skit! Dave is the king ", "I don’t recall anything after hearing “Lightskinned Laerry Targaryen” because I died a little...  ️", "Omg I cried of laughter I love old chapelle characters.. bravo", "Man, Chappelle can even make SNL funny. Props", "That sketch was hilarious  ", "Dave is the Man. Love his stuff.", "Yes! So he’s cooking up something. Can’t wait to see what he brings next ", "Love that they got Rawlings and Ice T to cameo  its a Chappelle Show reunion", "This is the best skit they've done in years", "I didn't know this existed is there more of this I had no idea that was freaking awesome I have not laughed so hard since season 2 of the chappelle show", "Loved this ", "Damn I needed a good laugh! Love you Dave Chappelle!!", "I love Dave Chappelle and house of dragons ", "Great sketch. Best part is when the dragon lights the crack pipe. Nice to see Chappelle bring back some of his most beloved characters.", "Dave has always been awesome. Lol", "No for real that was the funniest sketch I've seen on this show in decades.", "Brilliant!   Absolute gold!", "I loved seeing Dave bring back out the Chappelle show characters! They'd fit right in", "Dave gave the people what they want with this one. Perfect.", "I love how he hosts SNL like he hosted Chappelle's Show", "Never thought I would like an snl skit ever again. Well done Dave", "He’s still got it! Give us more Chapelle Show!", "This whole family looks like the sun took a look and said no thank you ", "im not gona lie dave chapels character was the only one that got a laugh out of me. great stuff", "I grew up on these fools! Im so happy SNL did this. ", "The cops behind Chappelle on a dragon deserved infinite laughter", "I haven't laughed out loud in awhile!", "Thank you, brought tears to my eyes.\nTHIS IS COMEDY!", "We definitely need a season 3 bad! Lol this just shows it's still gonna be great and that cornhole skit was fucking hilarious"]}