{"video_id": "U1IjYUlS-aw", "comments": ["This is the prime definition of \"Never return to your ex\"", "Sad to see it end like this. I will never forget what he did for the club. Watching that freekick live against Portsmouth will always have a place in my heart. Farewell Ronny.", "“You Either Die A Hero, Or You Live Long Enough To See Yourself Become The Villain” The story of CR7 at Man United right now", "I'll always remember his first game back when he scored 2 goals. Seemed like a sign of good things to come. It sucks to see it end this way. His salary is so massive I don't see how his career can continue if he's not willing to take on the super-sub/part-time starter roll.", "There is never a dull moment in the world of football.", "All good things come to an end, sometimes to a sad end as well. Nobody is bigger than this club, and you should know that. Farewell Cristiano, you will always be a legend at this club.", "Yikes, that's the last time we see him again in the Premier League ", "It takes one Man to tell the truth And it’s Ronaldo ", "He’s doing what most of Man Utd fans has been asking for years, which is for someone to come out of what is happening inside closed doors because there are definitely many terrible things happening. For all the slander he said about the club which was direct attack to the board, I agree with almost everything or even everything.", "Sadly, as much as I'd like to believe he's said this for the benefit of the fans and for the good of the club, I doubt he would've said anything if he wasn't pushing for his release and the timing of this interview tells me all I need to know.", "Really sad, everything he says about the club as an institution is right and he does ultimately want what is best for us. He is the last player left from what United used to be and should be and it's sad to hear him talk about the club in this way. .", "So Sad to see the man who made me love football going true all this right now ", "Consider the timing, That's most likely his last interview as a man united player. Farewell Cristiano.", "This absolutely pains me to say because I love the guy and will always respect him. He is a club legend and deserves and has earned his place in united history......\n\nBut time to say goodbye. We can't have this anymore players going out and stating stuff.", "We all have to admit - it's over now. With this interview with Piers alone, it's sealed it. I don't see a way back now for CR7 honestly.", "Thank you for all you've done Cristiano. You will be missed and I hope you have a great retirement.", "I am happy he talked. He mentioned his side of the story. It would be good to hear the other side now. I am sure he will not be back to United. I had the opportunity to visit United and City Stadiums last summer and I was a bit in shock when they shown the \"jacuzzis\" or \"metal bath\" in United. The stadium is full of history but in terms of renovations there is a lot to do. I am not an United supported however for the amount of money they spend on players and the season tickets prices, the owners should do more.", "He was pursauded by his old boss to rtn, but the set up was so different. His old boss should take some responsibility for this debacle. Ronaldo has a soft heart is wearing it on his sleeve. He is passionate, just like the fans. It's a shame many of them are dismissive of his opening up. It isn't as if he's made a habit of this. The club wouldn't let him go in the summer, instead forcing him into regressive mindset by not playing when in his later yrs. It is like having wonderful sex with a partner, then they demand commitment. The commitment is given, then the sex dies but you can be trapped.", "You Either Die A Hero, Or You Live Long Enough To See Yourself Become The Villain", "I love Ronaldo with all my heart it's such a shame its come to this , he will always be remembered as a legend for United", "Wishing CR7 all the best as any Club will be honored to have you as you made MU feel what winning is like after losing badly over the years before you join!", "I think all of us Utd fans agree with his points - we already know the club isn't where it should/ could be, and that the management is still bad. Had he done this interview after he left the club, we would say brilliant/bravo etc. But saying these things while still under the employ of the club.. that's really made his own position untenable. Not that you can't offer feedback and etc, but c'mon. He's clearly positioned himself against the club, and ultimately burnt his bridges. I'll always be his fan even after this, but this wasn't the best way to exit", "Do people forget he was Man U's top scorer last season with 24 goals? It's incredulous that fans nowadays have such short memories", "Being benched is not being disrespected", "Everyone:\"Lukaku has disrespected his club and given the worst interview ever.\"\nRonaldo:\"hold my beer...\"", "It’s sad to see CR7 and Man U end things like this.", "A lot of what Jose said as well, it all comes from the top at the club. I’m not a United fan but I would like to see them back where their legacy deserves.", "\"No one's bigger than the club'' Sir Alex Ferguson", "The truth is, you and I will never know exactly what transpires behind closed doors.   We get the \"run-off\".  That said, it's sad to see someone of Ronaldo's portfolio going through such an ugly pre-retirement.  I think he should have wanted for better but again, I don't know what exactly has happened at Man U.  He was appreciated, well paid, enjoying life with Juve.  He wanted to go to Man U.  This turned out to be a horrid mistake.  Perhaps he didn't realize how big a mistake that would be.  Clearly, he knows that now.", "As a United fan, unless Ronaldo can get a time machine and go back to being 17 years old, he's not going to be part of their long-term plans.", "Those were his last words as a Manchester United player. Farewell Cristiano you made some of us fall in love with football and even at your worst we'll always be on your back.", "What is tragic about this is he could've had a good season. Before it all got out of hand he had 2-3 performances where he was not only useless, but mardy, and so mardy that he lost chances. A ball wouldn't fall to him, he'd throw his hands around, get mardy, we would win the ball back, pass it to him... but he's offside because he was being mardy.", "We were saying bad about him and he is struggling there so it’s hard for him he is big player no doubt ", "About time someone told the truth about the club. Well said Christiano ", "God bless you CR7\n\nForever in my heart ", "First of all, I totally respect him for calling out the owners of Manchester United. Something needs to change after 17 years of this shite. I am looking forward to watching the interview with his good friend Piers Morgan, which is going to be very interesting, but unfortunately, I have to say that CR7 is the past. Alejandro Garnacho is the future, and we need to move on. We make super stars at the club, and we all believe in Eric Ten Hag 100%. It has been a pleasure watching him over the years as the best player in the world, but nothing lasts forever. Well, life goes on, I guess.", "As much as I don't want Cristiano to leave, these words practically sealed his fate and pushed the relationship between him and the club beyond the point of return. Both sides may have rights and wrongs, but what is done is done, what is said is said, when it comes to this it is fans like us that are hurt the most. I just hope the parting process could be as swift and effortless as possible, and maybe give him a proper farewell match so we fans could cherish the best memories he has given us, and both sides could retain the decency they should have.", "I am a diehard RONALDO fan and like I would tell most supporters, it's very easy to mistake sentimental views for passion.\nTruth be told, Ronaldo just hasn't been clinical in front of the goal lately and he needs to speak the truth to himself.", "If he feels betrayed by Manchester United, he should also understand how the club and fans felt when he decided to leave the club. Yes, there are some problems in the club's ownership and management but talking about respect, . Farewell CR700", "wrong timing...he should have waited until he retired to speak out...there's still so much he can do with other clubs..", "He is still the best player we have. Disgusting treatment of a club legend. Everything he said in his media statement is correct. Our squad depth is rubbish..", "He's the best attacker in history, especially this season ... He attacks and attacks, and attacks, and occasionally, plays some football.", "As a fellow Portuguese all I can say is that it’s a shame to see Ronaldo in this state the biggest mistake he made was leaving RM after that his fall from grace has been due to him hopefully he can have a deep run in the WC and end his career in a positive note!", "Please respect the goat. No matter what he is still the legendary player. Hopefully he finds a better club for winter transfer.", "Glad my man is speaking up in a world everyone is afraid of standing up for themselves. ", "Gonna wait for the full interview. Gonna watch the World Cup. Then we wait for the media to throw questions at Erik. And then see how the transfer window plays out. Exciting times", "I thought Romelu \"Judas\" Lukaku gave the worst interview, but this is just a defrent level.", "I want Maguire to come out with an interview next saying the club is disrespecting him by putting him on the bench ", "Imagine having an interview from Piers Morgan in 2022 :/ He walked out early from a match, was rightly dropped for it, was brought back in and even given captain for a match, and now he's coming out with this bs? I didn't think I could lose so much respect for someone who's been a club legend until this season", "We shall never forget you Ronaldo", "Right from the start, it was a mistake for Ronaldo to come back to Man United. Even though he was top scorer last season, it was because everything had to go through him. From memory United scored about 35 goals less than the year before and it had obviously become the Ronaldo show. It affected the team developing. Unfortunately, he has lost his touch and has become a handicap to the team. For everybody's sake, it's better if he goes and all the best to him. He won't be missed.", "I honestly believe that if he was getting goals, then he'd be starting games and wouldn't have any issues/complaints.\n\nHe's not playing regularly because he's not getting the goals when United need them", "Ronaldo’s position is now untenable at United.", "Although Ronaldo has contributed alot in Man Utd in the past. However we have to admit that he has past his prime as a footballer but I believe with his abilities and skills, the young players could inherit and learn a lot from him. And to all CR7 haters, Ronaldo play for passion, not money like someone.... No doubt, he is the best football player of all times due to his versatility and adaption.", "Can such an end be allowed? I don't think so. Because I know how much Ronaldo has contributed to Manchester U so far and how he has continued to have a positive impact on the whole footballing world. It would be very unfortunate if Ronaldo ends his career somewhere that is not Manchester U or Madrid. It would be very hard for me to feel again the great sadness I felt when Messi was forced to leave Barça in tears.", "It's so sad to see Ronaldo's career end and not at a high but a low", "It's shameful if he's treated that way. He wanted to leave but they didn't let him. He came in while the season was already on and still became the highest goal scorer for them.", "He's not being forced out, he's forcing United to let him go.", "He is almost 38 years old and you can already see the age catching up to him in this sport. This happens to every footballer, no shame in that. There is no way a manager will play an almost 38y old week in week out. United are rebuilding and Ronaldo is clearly not part of it. The manager didn't disrespect Ronaldo at all, never said a bad thing about him.", "He will still only be remembered as a Manchester United legend, Premier League legend and football legend. Its sad that its happening this way but in 15+ years, CR7 will be remembered as a legend and loved by all just", "Well, first thing first. Thank you for what you did in last seasons, facts is you saved us. However, another facts is you missed Pre-seasons traninig and no performance through those months. I known you always tried your best when you are on the field but as a super professional should you always found a ways to get into the new system? It is always feel so sad to see a legend end like this, I always want you to retired in MU. If you decide to go, I am fine with this. I will still respect for what you did to the club. Farewell Legend.", "If the club resigned him, a United Icon, they should respect him fully no matter of performances. Sad to see this situation occurring.", "I would have to agree with Ronaldo's passion on United. The best fans want the club to have everyone's interest in making competitive and achieving success in every endeavor but United is being used a cash cow. Imo the heads see it as a brand and little beyond that. My point being Ronaldo sees what's going on behind the scenes and understands why they have been struggling to be more successful; probably what Mourinho saw as well. Either way I think Ronaldo is being passionate about wanting to have everyone push in the same direction and many seem to not care which is very frustrating to passionate fans and might explain his pissy behavior. Aside from that, he will most likely explain more when he's out the door and we may or may not change our opinions till then. I still disagree with not putting on your best behavior, or attempt, since they are still paying him to do his job and he has a responsibility to his teammates too. This attitude is toxic and detrimental to the whole team regardless if he's right or not. He just needs to go but United does need to be fixed. I believe the speculation around poor management at the club.", "I think utd thought cr7 was the player he once was and tried to utilise him in that way when he is a very different player now than he was last time at utd and didn't use him to his strengths he now has ...that said he is still a player and no player is bigger than the team and you should always respect the manager and your team mates ...he could have handled the situation differently if he is unhappy....shame it ends like this", "This is really sad to hear from my supper christiano Ronaldo, I love him so much", "Messi talks on the pitch , Ronaldo used to talk on the pitch , now he does in interviews.", "Would have been a different story if he landed at City. You cannot lessen the play time of the previous top scorer.", "its the opposite.. the ego wont admit it.. ", "He handed a transfer request.. And he said the club forced him to leave?? Bruh the club forced him to stay when he wanted to leave.", "Definitely!! They need to respects CR7 . He deserved more game play on the pitch.", "He’s just speaking the truth. One of the best players ever that deserves more respect", "I have been a united fan since the 90s.  I have nothing but respect and gratitude for Ronaldo.  Anyone could see something has been wrong with him this season watching him on the pitch.  I figured it was just a combination of losing a child and a lack of minutes to get his form back.  Turns out there was even more eating at him.  It is such a shame to see the state man u is in and an even bigger shame to see how a club legend has been treated.  Best of luck to Ronaldo in the future where ever he might go.", "As much as I love Ronaldo I’m still hurt that he even considered joining Man City last year ", "With this interview CR7 has done trust me NO Manager would want him in his team even if the club desperately needs him", "The only positive I can see about this interview is that he exposed the lack of investment in the club by the owners to improve infrastructure. The rest, he wanted out from day 1, EtH probably wanted him out too since he did not want to stay, how is that betrayal? It is also very funny that it came out after MU had won.", "It’s sad news but life goes on,let him focus somewhere else not everyone will love you", "There is never a dull moment in the world of football.", "I'll always remember his first game back when he scored 2 goals. Seemed like a sign of good things to come. It sucks to see it end this way. His salary is so massive I don't see how his career can continue if he's not willing to take on the super-sub/part-time starter roll.", "Sadly, as much as I'd like to believe he's said this for the benefit of the fans and for the good of the club, I doubt he would've said anything if he wasn't pushing for his release and the timing of this interview tells me all I need to know. ", "I am happy he talked. He mentioned his side of the story. It would be good to hear the other side now. I am sure he will not be back to United. I had the opportunity to visit Unite", "Oh Ronaldo..it’s true since SAF left, I even stopped watching football. Then I heard you coming back and I fell in love again with the game. Sad to see this ending like this. All the best...Not stopping to watch football this time though..", "Don't understand some people. He scored some memorable goals last year and was top goalscorer then everyone on his back from pre season perhaps as press made it look like he missed tour because he wanted to leave rather than his daughter being ill.", "I just think he’s fighting and battling with his own Demons, the harsh reality and frustration of his body not being able to do what his head wishes which has now led to his ego far exceeding his talent! He’s gone into self destruct mode.", "He really made a mistake by returning back to the club. His love for the team kept gave him what he deserve", "Dont really understand how United are forcing him out,what do they want him to pay his own transfer fee to leave,United could have terminated his contract when he wanted to leave before the season started but they didnt and kept him as a 500k bench warmer,seems like they wanted to give him a chance to earn his place but he didnt feel he needed to being who he is.", "Ronaldo: \"How can I cover the fact I'm just not as good anymore and that's why I don't get games?\"\nAlso Ronaldo: \"I know, I'll go on Piers Morgan and say I'm being disrespected\"\n\nClass act!", "So painful. You deserve better Ronaldo. Hope you find a better club...", "How can the club do like this to the Legend?", "CR7 got balls to go with his ball skills.. fair play from an arsenal fan.. man deserves to be respected wherever he goes.. best footballer that's ever been arguably", "He tried to force a move during summer. He didn't want to stay at manchester united. There's nobody to blame but himself.", "Cristiano showing how important Cristiano is to him.", "Whether he likes it or not, the main problem for Ronaldo is that he’s not the same Ronaldo as he was at 28. But he still thinks he is. It’s that simple. If he was in his prime he’d be playing every match and he’d be scoring goals and United would be winning. That’s that. But the ice cold truth is that we’re a better team without him now. He shouldn’t have come back.", "Find it strange that in the week before the world cup, CR is ill and not available.  He just did not want to get injured before his last world cup.  Add to that him being unavailable for pre-season as he tried to engineer a move to a Champions League club to boost his own position as leading goal=scorer.  Sad but CR7 has played for himself for a little too long.  Let's remember his greatness and forget his last disappointing half season.", "They are not trying that hard to get him out, they could have let him go in the summer", "All I know is if Pogba was moving like this, man they would be calling him to be burned on the spot like he is a witch. Keep the same energy guys……", "He's partly to blame. He says he doesn't know who Ralf was but still went there.", "But he is very right about the internal issues of the club.", "It's been a good run but thank you CR7.", "What Ronaldo did for MU last season was unbelievable, MU should be ashamed.", "“I want Champions League football” “United are forcing me out ”"]}