{
    "video_id": "U1IjYUlS-aw",
    "comments": [
        "What Ronaldo did for MU last season was unbelievable, MU should be ashamed.",
        "imagine treating ronaldo like this !!!!!",
        "How can he feel like he's being forced out the club when these times he's the 1 that wanted to leave???",
        "Cooked himself",
        "Look I love ronaldo but his got to go like we got to rebuild this club no matter , no matter how big he may seem I feel like we do play better without him , his not in his prime anymore I'm looking forward to seeing him in the world  cup I'm Portuguese myself and I hope he does well and good luck to his future",
        "Desperation, No one with half a thought process would desire Ronaldo at the Club every week",
        "He sounds just like Rangnick tbh",
        "He is not the player he was...he's had an incredible career and  his team mates at man utd have long since retired...he did incredibly well to play for so long...Real Madrid or no other team are going to be interested in you it's now over Cristiano time to realize it",
        "I honestly believe that if he was getting goals, then he'd be starting games and wouldn't have any issues/complaints.\n\nHe's not playing regularly because he's not getting the goals when United need them",
        "Yet to where? Because no one wants him.",
        "He wasn’t ill. He pretended that to not get hurt in the last 2 games before World Cup.",
        "He deserves more",
        "He was the first to betray us when he left for Madrid",
        "It's best that Ronaldo leaves Manchester United. It's a sad way to end this way since returning last season when Manchester United are in complete shambles. No point of keeping a player that causes nothing but chaos to the squad.",
        "It’s the sporting world who have a lot to answer. \n\nStop paying huge wages for these pre Madonna’s then maybe they might come down from their pedestals of “I’m bigger than the club/team and it’s my way or no way” attitude.",
        "Sooner your gone the better Ronaldo",
        "Lets see what Roy Keane and Ferdinand has to say about this",
        "No player is bigger than the club, shouldn't be disrespecting players, coaches, etc - that's an unfortunate end to his Manchester United career\nAlways love you Cristiano, but this is out of line, trying to force himself out of the club earlier this season - kept to be in plans, walked off the pitch and didn't show up to games more than once, and when he's played we've been below average, what a decline, what a sad way to end his relationship with a lot of fans",
        "CR7's ManU legacy is over!! Dead!! The end!! He ruined it himself!!",
        "Dude skips pre season, has his agent offer him to several champions League clubs, walks out of a pre season friendly (manager publicly backed him) refuses to come in as a sub and then leaves the stadium.. sorry but he has a strange idea what respect is",
        "When you unable to outgrow the man child in you. Let's blame everybody else for your own failure.",
        "Sadly, as much as I'd like to believe he's said this for the benefit of the fans and for the good of the club, I doubt he would've said anything if he wasn't pushing for his release and the timing of this interview tells me all I need to know.",
        "Never forget that Ronaldo plays for Ronaldo, and Ten Hag knows it.",
        "He is not respecting himself, so he doesn't deserve the respect. Man u is better than him Ronaldo is too rude let him work on himself",
        "Bye CR7 and welcome Garnacho! It's business Ron business ",
        "Great players don't get forced out of clubs!",
        "About time",
        "I knew one day he`ll spill the beans and here we Go",
        "Ronaldo betrayed himself when he refused to join the team for preseason, the coaches tried all he could to keep him but he continued wanting out and being indiscipline, now he wants the coach to respect him when he disrespected the coach in the first place and the team at large",
        "People calling Ronaldo \"a hero\" for \"exposing\" man united are just idiots.\n\nHe doesn't care about the club anymore, doesn't care about the fans or outdated facilities or having the same kitchen stuff for 17 years. He just wants leave on a free transfer because no one wants to pay for him.",
        "He IS being forced out.  Never should have been brought back.  He's an aging superstar well past his prime.  Overpaid, overhyped, and with an ego that simply doesn't allow him to accept the obvious... he's not the player he once was.  And based on this reporting, he's played his last match for the club.  I'm hesitant to say it didn't have to end this way, but it did.",
        "I wish he goes to city or Chelsea or Liverpool n he revisits old Trafford under a different EPL team",
        "Ronaldo will be joining LA galaxy,I don't see any top European team going for him,so it's safe to say his European football is over.",
        "Messi could never",
        "Funny how he would have won the epl with city if he didn’t answer that fergie call",
        "We were saying bad about him and he is struggling there so it’s hard for him he is big player no doubt ",
        "Ronaldo spitting facts",
        "This was maybe the last interview as a football player in an international top club...",
        "Happy new year Ronaldo! Fresh start ... question is where will he go? MLS..? Or back home to Sporting Lisbon?",
        "Maybe he will go back to Sporting Lisbon ",
        "I love Ronaldo with all my heart it's such a shame its come to this , he will always be remembered as a legend for United",
        "Of course they are trying to get you out look at this madness ",
        "Ronaldo...snake",
        "The legacy is gone. Goodbye and good luck.",
        "This interview can be taken as a fatewell match for ronaldo. From now on no club would ever sign him.",
        "Taxi for Ronaldo.",
        "Listen to this guy talk is like pulling teeth. It's like watching someone experiencing a Stroke.",
        "He is the GOAT, he wants the best of the best from his club but cannot fulfilled his needs",
        "Ralph Ragnick said United needed a heart surgery in his assessment of the situation and how the club is ran, the truth is we have no picture of how damaged this club is. Jose Maurinho had words, Pogba was sent in as a quarterback with no runners or shield yet was expected to work magic tricks, we dance to the mediocracy of Olè, he should have never been made permanent, another indication of a lack of a sound plan, just vibez",
        "this is for sure the last time we see him",
        "Ronaldo betray manutd by looking at another UCL club in the summer",
        "Whilst Ronaldo is right about the state of the club and how it’s run most of what he talked about was stuff that was already known about and talked about. As for his comment about Ten Hag disrespecting him…. He did not need to say that on a public medium. That is definitely what will prompt Man U to sell him but then Ronaldo has already shown several signs he wants out of Man U. ",
        "When You talk about Drama queen \nWhen You talk about Ego \nYou mean CR7",
        "You can.Force Ronaldo out of the Club now but if anyone in football is know to Haunt clubs it's Ronaldo \n\nThey will regret it",
        "Prime example of “ never take back your ex”.",
        "He is business, what does he think he is accountants run Manchester",
        "Mi nimshabiki wake mkubwa lakini ina bid angalie umri saivi muda wa kuwaachia all young prayer for pafomas ganacho antony rashford martial suport to team man utd now",
        "Idk why anyone who puts in a transfer request during preseason who feel betrayed, says another about the man ",
        "There is a reason Legends bow out when the ovation is loudest. CR7 should realize that this interview will do more harm to his reputation than good. This will also definitely put undue scrutiny on the Portuguese national team and if his performance there is below his known standards, he will feel the heat for years to come. Nobody is bigger than the club. NOBODY!!!",
        "Let’s be honest here, I’m a Ronaldo fan, will always be, but I’m a arsenal supporter, nobody electrified the epl like he did, but he is past his prime, but he is not wrong here, bad board, bad owners and bad managers, eth I’m not sure yet, it’s better for him to leave, have a good World Cup and retire ",
        "Ronaldo can’t face the fact he isn’t very good anymore. Even Rashford is clear of him.",
        "What about the disrespect when he refused to come on and walked out. If you're a United fan you cannot defend him unfortunately. The club is always bigger than the players.",
        "I hope that Christian is able to work things out so he doesn't have to leave. If he doesn't want to go then why is he being forced to leave? I don't follow these stories much, so forgive me for asking because I don't know what is going on.",
        "Now iam just not United fan !!!!!",
        "He has no right to BS about ETH because he has been poor this season but yes his comments on how the club has been run is spot on.",
        "I’m gonna be real he’s an egomaniac. He was the one forcing the move earlier this year, and now he blames the management that they want him out. He’s finished. Still can’t wait to see him score a 90+6 minute goal with Trabzonspor in the conference league tho.",
        "Why are there people talking in the background",
        "They are not trying that hard to get him out, they could have let him go in the summer",
        "Weirdly I believe him. He’s an icon of the game, so Manchester United should really get him involved more often.",
        "Oh Ronaldo..it’s true since SAF left, I even stopped watching football. Then I heard you coming back and I fell in love again with the game. Sad to see this ending like this. All the best...Not stopping to watch football this time though..",
        "Ronaldo OUT now. Sick to death of him. Hes the head clown in is own circus",
        "He needs to go cause we lose when he plays",
        "Force him out? Didn't he try and leave to any club in the champions League..... A 37 year old truly needs to grow up and accept his downfall",
        "If he said , he wanted to leave, then he should be happy that he’s being forced out d door. No bad feelings. This guy has put d team thru he’ll with his behaviour on d pitch. He’s done very well for d team in d past but this season must be his swan song. Basically he doesn’t fit into this new system which has seen d team doing well. It’s better for d team to do well than just one player scoring 20 goals but d team finishing in 6th. That’s too bad for d team.let him go now or force him out! ",
        "Some of us will always be by your side, Cristiano Ronaldo.",
        "Ummm if last season \"Cristiano Ronaldo\" would not be top score player them today's Manchester United would be out of <Premier league >.  Even messi was terrible in his time. You can't stop ronaldo to give his opinion.",
        "I don't necessarily like Arsenal, but at least they let Auba go for free when the situation became untenable. \n\nWhat United did, keeping CR7 over the summer and not let him go, and then not giving him minutes, is really unprofessional. Shame.",
        "United were doing so much better without Ronaldo, better for him and the club to part ways ASAP",
        "playing victim, not realized he's finished",
        "He should go to a better club and then destroy Erick ten  we know how ronaldo can do it ",
        "Which one do we take now, before he said the club doesn’t want him to leave now everybody is forcing him out even last season",
        "\"EtH disrespect Ronaldo\" <- HOW??",
        "Bro who tf cares ",
        "People scoffed and laughed at Mourinho when he spoke about how poorly the club is run and now everyone admits he was right. \n\nPeople are scoffing and laughing at Ronaldo but in a few years time people will again be admitting he was right.",
        "Big thanks to Ed Woodward.",
        "cr7 big cry baby. his form is down and he can't do anything rite",
        "as an old united fan, i am 100% backing Ten hag on this! I never want to see you in the red shirt again cr7. please leave!",
        "acting like such a child, i know hes competitive but if you want to play every week then go to the MLS or a lower team. Just face it hes just not got the fitness to keep up with top level football anymore. what a petulant man, hes probably got the playing ability to move in a deeper role and learn to be more of a playmaker but his ego wont let him, thats why Messi is such a more complete player. It shows me some players play for the love of football but i guess ronaldo plays for his ego happy for to never see him in the premier league",
        "I like how indoctrinated the average person is, how gullible and naive they are. Organisations can and do disrespect individuals all the time and no one calls it out. Ronaldo has been shaded and disrespected by loads of British sports media unfairly for ages now and it's because he represents something that the media execs aren't for. So yes he has been severely disrespected at a club that is run worse than any football fan could imagine before.",
        "Good bye ronaldo clubs always bigger than any player",
        "Ronaldo might be class but nobody's bigger than the club",
        "He should sign other club, he can still goal a lot...compare to young players",
        "Ronaldo thinks the whole world revolves around him. Get him out of the club",
        "He's getting paid too much money that could be split between a few players. Lov CR7 the GOAT, he must just leave and find peace!",
        "As a Liverpool fan I’ve ordered more popcorn for Wednesday & Thursday evening.",
        "As Man United fan I feel betrayed as Ronaldo want to leave the club before the season starts, and we lost almost every game when he’s in the starting squad",
        "You mean the man who was trying to force a move away two months ago is being forced out? Funny how he says this right as the season takes a break until pretty much January where no doubt he’ll try and force a move again. If I were edh I would keep him in the reserves until his contract expired for this",
        "Oh Ronnie Ronnie.... When will these players regardless of stature learn that no player is bigger than the club.\nCR7 was going off the boil and he can't blame ten hag in switching play... But Cristiano assumes he gets to play every game because of who he is.... You're still a great player but you're older now and your experience is just as vital behind the scenes than on the pitch, it's a shame that you have started to speak publicly about your emotions and biting the hand that feeds you.",
        "he betrayed himself by failing to impress the manager and having that superiority ideology because he feels he is a club legend. i am glad that ten hag is getting reed of this drama queen.",
        "Respect for Ronaldo means playing him day in day out with the team losing and finishing outside champions league. They should not give him what he wants. They should suspend him until his contract expires.",
        "Maybe he need the whole world playing around him, but this is a team game, not a player game.",
        "Ronaldo has failed to realise that he’s getting old and the coach has it own vision and him (Ronaldo) is a boden to ETH plan Cus of his age.      I’m his biggest fans but he should tell his self the truths. Trying to be the best forever is not a good thing.",
        "Sad to see it end like this. I will never forget what he did for the club. Watching that freekick live against Portsmouth will always have a place in my heart. Farewell Ronny.",
        "In my opinion he has not be given enough game time to prove he can still do it at his age, one last season starting regular up top I think the interview with pierce wouldn’t of happened",
        "he wanted to leave in the summer and he feels betrayed now...lmao",
        "All I know is if Pogba was moving like this, man they would be calling him to be burned on the spot like he is a witch. Keep the same energy guys……",
        "Biggest mistake he made was goin bk it never usually works out.",
        "Let’s be honest this is the first time he said something about anyone. Shows how bad united is at the moment",
        "He is almost 38 years old and you can already see the age catching up to him in this sport. This happens to every footballer, no shame in that. There is no way a manager will play an almost 38y old week in week out. United are rebuilding and Ronaldo is clearly not part of it. The manager didn't disrespect Ronaldo at all, never said a bad thing about him.",
        "Truth is: penaldo thought fergie time is still at man u",
        "It’s Over He’s Leaving ",
        "Lets not turn a blind eye to the truth...his being forced out,its clear as daylight",
        "Ten Haag has done a good job. Ronaldo is over the hill and can't handle it.",
        "Cr7 for liverpool",
        "Shame. What the current United Regime are doing to him are beyond words.",
        "MUFC have destroyed some talented players’ careers over the past 5 years. No vision, no long term plan at all.",
        "now repeat it w/out crying ",
        "The truth is CR7 refuses to accept that he can't play well anymore as he used to, he should understand that he is grown to play competitively.",
        "The way Chelsea are playing at present I would take Ronaldo in January ,might improve our goals scored.",
        "He's obviously made up his mind and it's time to let it rip. Glad he's doing it now to clear the air and to be fully concentrated for the world cup. I hope he and portugal win the WC. CR7 is a legend and nobody will remember the gouda head in 5 years.",
        "Where's Ronny Rolls Royce's Johnny Cochrane's now ?",
        "If Piers is involved, we surely have to believe without question",
        "What a nice role model he is for thousands of kids",
        "Nobody betrayed him he can never be bigger than Manchester united, are can stand to lose game just because we want to please Ronaldo, we have be giving him game time in front of millions fans it's quite clear that he is old and he can't perform anymore, we have a lot of young relented youths who can do the job better, we thank him for his efforts in the club during his staying at Manchester united, thinks has changed now and he should understand better.",
        "What nonsense, disrespectful....you don't own the football club Christiano and if you don't like what's  going there, then leave...and pouring your heart out to Piers Morgan, that's not very clever!",
        "Who would want someone at the club that goes on like Ronaldo does.",
        "This dude reading it out is struggling… ",
        "If you compare him to similar players that came back to their old club drogba Henry they both played limited minutes as a sub",
        "Gone in January and rightly so for both parties, no need for this crap before he goes. He’s a great player that sadly isn’t deadly enough anymore to compete with the big clubs. Lots of others also need to go.",
        "So then bets are open who's the next near 40 year old utd is gonna bring in",
        "There was a lot of turmoil in Manchester United even before CR7 got there. Do not blame Ronaldo for forcing his exit now",
        "Ronaldo is only making it harder for himself. He should leave with respect and keep his legacy.",
        "I believe there are those who seek to damage his reputation for their own gain. Ten hag flexing his muscles in a way to get control of the rudderless ship from the minute he arrived it was clear he wanted and needed CR7 out, SO WHY did they not let him go in the summer? I get the fact he can be a baby at times but hell given what they have there he is by far their best player, given the support and opportunity from those around him he would have continued to do just that. Such a shame this is the ending of his story at UTD, could have been so much more. This is from a Liverpool fan as well not a CR7 fan boy but a fan of world class players where ever they may have played. Move on CR7 find your strength and carry on else where.",
        "Wait until Gary and Jamie open their mouths and start criticising him yet they are one of those who have been waiting for him to speak his side",
        "Bring him to Arsenal. He’ll turn Martinelli into a monster.",
        "Problem I have with this as a united fan. Ronaldo made it clear he wanted to leave. No one wanted him and now united are trying to force him out? Ten Haag had to play a different way which is was not part of",
        "He'll definitely not be playing for United ever again now !!",
        "His big mistake was to go out Real Madrid the way he did!!!",
        "I would force him out to. The money he is being paid can easily pay 4-5 players",
        "won’t be missed…",
        "Dont cry for me Argentina the truth is I never left you...",
        "Ronaldo will end his career on a high note but not with Man united.\nAll the best CR7.",
        "He’s doing what most of Man Utd fans has been asking for years, which is for someone to come out of what is happening inside closed doors because there are definitely many terrible things happening. For all the slander he said about the club which was direct attack to the board, I agree with almost everything or even everything.",
        "I like the part when he said if u want to begin with me, TS ok..please man utd, include Rashford,Maguire,shaw and Phil Jones on that list",
        "He would be a decent stand in for Mitrovic",
        "He is set to sign for Liverpool in January",
        "Mu forcefully brought back Ronaldo to club and for that he saved it ass but the new boss constantly benched him ,u have to Handel legend like him and a star performer for ur club last season",
        "Feeling for Ronaldo the best player, his work ethics are unbelievable",
        "Come do a season in the MLS!  Zlatan and Rooney were Gods!",
        "If you in the lime light don’t go talk to piers",
        "Not sure if people realise the interview would have taken place a week to 2-3 weeks back after he clearly stated he was 'To reveal all' through a social post made a few months ago. Clearly many of the criticism thats come his way was significant after recent events, which shows a cemented stance behind Cristiano's perspective on the situation of him being pushed out of the club and being treated unfairly - which in my opinion seems to have been MU Executive and Coaches agenda from the beginning of the season.",
        "No one can escape the cruel hands of time, not Ronaldo nor Messi. Last season, he was great. Scored 20+ for United. But this season, he's been abysmal and ETH has been fair to him. \nI think it's a case of him unable to come to terms with reality. He could have gracefully retired but he is Cristiano Ronaldo, he'd rather go down with the ship than wave a white flag.",
        "Bruh this video is just the guy repeating 10x of what Ronaldo said. Could have read it myself...",
        "the only people who are betrayed here are the fans.",
        "It is easy to see Ten Hag wants Ronaldo to leave. He  doesn't give him more chances, to play, he  substitutes him at the last few minutes of the games. He wants people to think that Manchester United will win when Ronaldo is not playing and vise versa.\nBest luck Ronaldo. You deserve happiness.",
        "Where is the audio",
        "When ronaldo does great in quata dont call it a comeback",
        "He's only making excuses. I don't believe a word he says",
        "finished player ",
        "Ronaldo: \"How can I cover the fact I'm just not as good anymore and that's why I don't get games?\"\nAlso Ronaldo: \"I know, I'll go on Piers Morgan and say I'm being disrespected\"\n\nClass act!",
        "He wants to leave then he doesn't  just piss off they play better without you anyway",
        "Oooohhhh crash and burn, the club is partly to blame, but unfortunately we are not 22 forever, he will always be a legend, and he has had a massive career, but it comes that time when it's done, sorry Ronaldo we will miss you.",
        "Ronaldo shares a similar aura of Mourinho's attitude and fans. They both always complain, they both always blame people other than them and they both have sets of fans that are completely blind and out of their depths who defends them blindly. The guy is a legend just like Mourinho, but when you lose it you lose it, no need to sugar coat it and say otherwise. Most probably the guys who defend him haven't seen his early career and mostly highlights.",
        "No one is or should be bigger than the club. Don't let the door hit you on your way out.",
        "This guy is the problem in Manchester United he should go",
        "He's on to much money.",
        "He's an extremely selfish 'has-been'.\nAway!!!",
        "Man United hierarchy should be held accountable, in bringing CR7 to OT only to ensure that he doesn't land up at Etihad !! He shud have been at OT when he quit Madrid, not now. Despite his GOATness, he is known to be egotistical and well, none of United's managers were 10% of SAF's calibre and stature. This was bound to happen. Ronaldo too should have introspected what he did in past few months to warrant a prima donna status. Sad to see this day !!",
        "Me parece genial que Cristiano lo haya soltado (no lo trataron bien desde que llego, y no hubo empatia, buen trato y humanidad en el tratamiento hacia el, tras el fallecimiento de su hijo, y solo salia en los medios que porque no participo de la pretemporada [ejm: Sky Sports, Espn UK, etc] no es parte del plantel ni tomado en consideración, cuando se sabia que lo pidio por un tema de salud de su hija) y asi como es dificil saber sobre el Barza, Messi en lo negativo y demas temas en Latinoamerica, con él es lo mismo, solo unos cuantos ex compañeros (Rio Ferdinand, si mas no recuerdo, fue de los pocos que explicó el porqué). La verdad el merece más, pero así como esto él debe valorar a ex compañeros como Karim, y felicitarlo pero creo no está en un buen momento anímico ni mental, pero debe darse un espacio para ello y valorar a quienes lo valoran ",
        "He should take revenge and join their rivals like Man City, Liverpool or Chelsea for free.",
        "Instead of just saying that there are videos to prove his performance has not changed from when he took someone's place till now and thank them for not for picking him then although he was not talking to them about anything",
        "I will not surprised if I see his contract terminated within this week.",
        "Man U be treated C Ronaldo like he was you amateur football player the lack of disrespect when Messi get treated like a Boss in PSG",
        "How can Ten Hag disrespect someone who was your highest scorer last season ",
        "Manchester United has not been the same since Ferguson left. Clearly they’re board doesn’t know what it’s doing. Even Jose Mourinho joked about winning a Trophy at Man U, but there is some truth to jokes.",
        "This situation with Ronaldo and Man U is now untenable, with Ronaldo's  voluntary interview with the media.",
        "No player will be like ronaldo and messi and our legend pele",
        "The worst club and coach that people will remember for not respecting the world's best player. Ronaldo has and will continue to shine.",
        "Well done Ronaldo for speaking the truth",
        "Wishing CR7 all the best as any Club will be honored to have you as you made MU feel what winning is like after losing badly over the years before you join!",
        "As a Messi fan I feel bad for what Man Utd have done to Ronaldo. He wanted to leave in Summer but Utd kept him",
        "CR7 think he is too big for any club. That's why other clubs refused his service. This is the end of CR7. The world Cup is his last venue. See if he respect his Portugal coach. Eric 10 Hag is only focusing on rebuilding the club and winning next game. So CR7 thinking and Eric are miles apart. Eric don't live in history. Eric dwell in the present day and plan for the future, not in the past.",
        "Man Utd must decide what to do with him.  \nArsenal had a problem in Aubameyang. And I understand that Ronaldo is miles better than him and a much bigger star but now they must let him go and build the future without him. United are good without him, it’s not beautiful football but you can still pull off a win. Get him off the wage bill and ETH will send a message to the team that no one is bigger than the club.",
        "he was a great player but sometimes you have to admit age is catching up with you. and man u have to look to the future with younger players",
        "I have been a united fan since the 90s.  I have nothing but respect and gratitude for Ronaldo.  Anyone could see something has been wrong with him this season watching him on the pitch.  I figured it was just a combination of losing a child and a lack of minutes to get his form back.  Turns out there was even more eating at him.  It is such a shame to see the state man u is in and an even bigger shame to see how a club legend has been treated.  Best of luck to Ronaldo in the future where ever he might go.",
        " omg - what is he doing?!",
        "Wait for the full disclosure on Thursday and Friday",
        "His come back was  wrong from day 1.\nUnited never need a player with the ego he has. Everything  is always about him, and  loves to complain like a baby.\nFrom my point  of view even in his best year at Manchester(last season) his influence wasn't good on the young players.most of them lost thier confidence in front of goal, you've got to pass every ball  to him , his body language wasn't good when they go for  themselves. He ended up the best player of the season united as a team was terrible yet.",
        "ETH made CR7 captain and then threw the team under the bus ️",
        "did the united market value drop down?",
        "Haha.. he wanted the best for the Club..!!\nSo he left for Real at the prime of his career.. Good that he gave this interview.\nWon't have to suffer his presence at the club from here on..",
        "We all have to admit - it's over now. With this interview with Piers alone, it's sealed it. I don't see a way back now for CR7 honestly.",
        "Viva ronaldo ",
        "Until people realise that something is wrong with Man U. First it was Pogba now CR7. Ya'll need to start changing the way you see the club",
        "He will not come back again in manchester united after world cup",
        "Thank you for bringing out the statistics let's hope he performs well at the world cup where he is needed",
        "This gives me so much joysuiiiiiii",
        "Let's see if ten hang could win anything ,or at least finish in top 3  ,this time Newcastle is a better team now",
        "Ronaldo is sooo petty wtf?",
        "Erm, am I missing something here? He feels he is being forced out but I'm pretty sure, unless I was on a completely different planet for the entire summer, he made it very clear he wanted to leave!?",
        "For another words, the Americans owners converted Man United in a third class club, because they don't know nothing about football, perhaps baseball, since CR7 left the club they won zero Champions and the club are fighting for the biggest ambition in the Premier League, be fourth,, instead  CR7 won more four Champions and played in top teams with highlevel of excellence, so when he came back is like to return to the past that never came, facts.",
        "Love those that say “Ronaldo finished” but will also say “but he’s not being played” about players they have a love agenda for",
        "Ten Hag hardly plays Ronaldo and then tried to embarrass him by sending in the game in the last 2 minutes of play vs Spurs...completely disrespectful. ",
        "End of an era\nI've always loved you \nViva Ronaldo️",
        "Wish he got Champions League Club this summer as this is where he wants to be be. Full stop",
        "I think the desire he has to be the best might just be his downfall.",
        "I love Ronnie been supporting him since that friendly against sporting. But there seem to be a pattern here, always leaves teams on bad terms and we won't see him in a united kit again. He seems to be his own worst enemy.",
        "Ronaldo needs to retire, plain and simple. He's a month from 38.  Non football players look to retire at 40 let alone sports people.  I can almost guarantee since Messi is going to Inter Miami next season, Ronaldo will end up playing in the states too. It's almost a guarantee. And of course it's never Ronaldo's fault, he ruined the dynamics at Juventus and now he's ruined the dynamics at Man Utd. I mean before he came along Juventus were winning everything in sight in Italy, Man Utd finished 3rd.",
        "well done for Cristiano showing what is exactly MU now to the fan and supporters, no respect for the fans and for him",
        "Manchester united were never in for Cristiano Ronaldo they only bought him to avoid him going to Manchester city.",
        "Ronaldo need a better team. United making him look like he's finish",
        "No matter how Great you are as a player your attitude matters and Ronaldo has lost it",
        "Cr7 ",
        "Is this part of the wider plan to get rid of the glazer? Think about it, cr7s following is huge. Surely something like this could potentially rock the boat",
        "I’m just glad Piers Morgan isn’t working in the USA.",
        "PLEASE STAY",
        "For if Sir Alex Ferguson time maybe Cr7 return but if another coach maybe he leave can imagine player legendary give direspect for him its good to he leave",
        "I'm an liverpool fan all I what was to see ronaldo vs liverpool we me there etc watch it",
        "He is being forced out by the players and manager",
        "Powerful people rule rest dance to their tunes. \nNothing has changed",
        "Pretty much proves that he is not coming back to Manchester united in January but I'll won't be surprised if he doesn't get moved because the owners look at him as a cash cow",
        "",
        "Bye Ronaldo",
        "I don't see anything bad from ETH towards Ronaldo. Ronaldo missed entire pre season and lacked game fitness. ETH gave him good chance to redeem but Ronaldo leaving games early really spoilt everything. Good luck Ron!",
        "GRANDE CRISTIANO",
        "i wondered why he was not on the team today.  I thought WC protect but maybe theres more to it.  At this point in his career hes more trouble than he's worth.",
        "Childish. Throwing his toys out of the pram. Past his prime and he can’t deal with it. Highest scoring player last season but that doesn’t mean he deserves to start every match or build a team around him. Should be absolutely ashamed of the way he has handled himself and the disrespect he has brought to united.",
        "poeple are so quick to write off CR7 off cos he lost pace. I'm telling you if you build the team around him, he can still make the difference. the only problem is it is natural for the average person to hate on this guy cause of his achievements and proclaiming that he is the best. i mean you cant hate him for that , can you?   I'm a Messi fan btw. major respect for CR7",
        "This is \"old Trafford\" why do you expect new technology and infrastructure? ",
        "You cost to much and that's probably something that they have in mind, love United hate the glaze, Americans burning out the UK as per, the fans love you, like we value every one, who puts the shirt on, they don't give a flying about the fans",
        "Cr7 out, Garnacho in simple as that!",
        "If do not have teeth, didn't destroy port.",
        "Let him go!!! Period",
        "Bad timing",
        "Should move to Chelsea",
        "Haven't heard anything else from sky sports after this,his PR must doing hard work clean up this mess",
        "He's the best attacker in history, especially this season ... He attacks and attacks, and attacks, and occasionally, plays some football.",
        "He was never going man City. It was all a ploy to get more money in the contract...",
        "Ronaldo is the boss ...no one will watch this news channel that's about Ronaldo we are here ...the GOAT cr7 ",
        "He's partly to blame. He says he doesn't know who Ralf was but still went there.",
        "What I see, he don't want to have pre season training with man utd.. \nhe refuse to play for man utd..\n left the stadium early.. \nWhat kind of respect you want, when the club pay millions your salary",
        "\"Force him out\"...dude he is playing victim. All the big European clubs no one wants to accept him.",
        "Try harder ronaldo",
        "Goodbye CR7 the last pogba of Utd",
        "Still I have to agree with Ronaldo, the club is stuck in it's old ways, it needs to change completely, start with the head",
        "You're not going to talk about poor infrastructure and technology about the club bcz you're in glazer' pocket",
        "The way Ronaldo says it. He literally disrespected his teammate and his manager. It’s time to go, he is toxic.",
        "His leaving that's why his spoke this out",
        "he expensive, they tryna bring messi back to manchester XD",
        "I feel sorry for him but the best way to solve this problem is just leave the club in January since he is no longer happy at Man Utd. Stop making drama. Sick of this issues. We should focus on how to improve our club, not this stupid drama",
        "\"The club are trying to force him out\", says the player who wanted to leave all summer but only stayed because no one wanted him. Old PR merchant.",
        "I can't wait to watch him in the World Cup!",
        "It’s sad to see CR7 and Man U end things like this.",
        "We’re looking at a journalist that is looking down the whole time.. feels like talking to a child on their phone. \nThe screen should be near the camera so it’s not so non-personal",
        "Remember what he said before that he gonna speak the Truth so yeah respect to him,True man never afraid to speak the Truth.",
        "Consider the timing, That's most likely his last interview as a man united player. Farewell Cristiano.",
        "Breaking news Ronaldo still thinks he is 22 years of age",
        "“We have to destroy it before you rebuild it”\n\nAs a guy who despises United I wouldn’t mind if they went through that destruction process for the next 7 years LOL.",
        "CR time to quit.....football takeup coaching",
        "I don't know what's going on in his mind. As if this interview would solve anything, this will destroy his complete carrere and everything he has done for his legacy. Pretty sad that some human beings can't put their ego behind their club and think they own the world. Your done mate.",
        "I used to say Manchester is red, now I will say Manchester is blue. Manchester United is the worst club in the world. They have Rooney and Gary Neville who are always booing Manchester United players including former team-mates. It's a shame. Now Ronaldo has told the truth. May Manchester City stay the best forever.",
        "HE IS RIGHT GLAZER OUT",
        "Is this not the same guy whose agent offered him to Champions League clubs around Europe all summer?",
        "Problem is Ronaldo is to big for man u back in the day was other way about man u at present are in a crap situ must be hard to take when dominated European football for as long",
        "Sky u was apart of it too, always reporting he wants to leave, united ten hag and media have treated hin like shii, hes thebgoat have some respect, hope he finds sonewhere who will appreciate him",
        "Let HIM go",
        "He is now becoming a “has been”, thinks people should show him respect for what he’s done in the past, but is acting like a spoilt brat in the present, CR7 the has been.",
        "Ronnie hasnt got it anymore",
        "His ego is bigger than Utd",
        "A MLS move looks likely now cause no European club will want to sign him, he's finished.",
        "CR is not for sale, but u don't play him,this says it all,he's bn only used to make utds name sound",
        "Merchandise United only wanted him for media and merchandising revenue.  They said 36 year old - very fit still and not injury prone - get the cash in the till and see how long it’s good for.  Any talk of wanting him as a regular first teamer was to tell him what he wanted to hear.",
        "I really don't understand why he returned to Man utd this guy is a world super star hid retirement days are close he deserves a trophy winning club",
        "Straight after United's last game before the World Cup and the next transfer window. The timing is on purpose",
        "It hurts.  Captain last games. I  have had his back. It tough . It bad",
        "Ronaldo needs to catch a wakeup. His glory days are over and he needs to hang up his boots. Same like Rafael Nadal in tennis. Their best days are over. It was great while it lasted but time to move on. Come play for Kaizer Chiefs in South Africa Ronaldo, you've got a good chance of scoring more goals in our subpar league.",
        "No one shut out Ronaldo.  Hi arrogance did.  You are not scoring goals and you want to be fielded because you Ronaldo.   The club is bigger than him and cannot operate on emotion",
        "No one respects ronaldo as he is now. Time to retire",
        "He's being forced out for very good reasons. I can't believe he's 38. I dont think he knows he's 38. He's game has changed so much which is understandable and unfortunately doesn't fit with Man U anymore. We all see it, except him and his fans apparently.",
        "if he care about the club, why come back after getting old? surely united need him more when he's on top of his game.",
        "More proof messi is the goat",
        "Perfect timing, before the world cup :P",
        "Cant believe that we are here talking about cr7 his team was busy playing he is busy making tenhug look bad leave man have never felt this about u cr7 we love u bt when  u disrespect ur coach ur going to leave",
        "I have a friend, he is a Man U fan. He is also insulting Ronaldo, what an insult on their former hero.",
        "Come on this is all about him not winning it's clear as day if untied we're winning he wouldn't care about anything until it affected him",
        "This guy is unbelievable. CR stated during pre season that he wanted to leave because he wanted CL. No one wanted him so now he acts like a child Well off you go and pick your toys up on the way out. Ten Hag is right 100%. Very sad to see after an amazing career.",
        "CR7 should've never returned. Arsenal took over a decade to reach the level they are at now. It's naïve to think United would've stayed dominant after Sir Alex's departure. Football is a young man's sport now and unfortunately 37 year olds in the EPL start from the bench even if they're CR7. They're trying to get him off the payroll. For CR7 it's hard to accept the end of his career is near. Time is truly cruel.",
        "this is what money and fame does to you at the end, think he is above the club, its like he has forgotten everything utd has done for him. Respect the manager, respect the club rules. He has shown brutal stupidity with all his actions this season",
        "It's Maguire",
        "This is what happened when you let your ego control you.",
        "This is so ridiculous wasn't he the one wanted to leave and yet again his behaviour hasn't been good so anything is expected",
        "Its unreal that the people who claim as a True  Manchester United fans treating the  CR7 like a rubbish, bringing downfall to the team...its so frustrating to see our other Manchester United Supporters blaming all the problems to Ronaldo....The Man who rose from This Club who felt the love of The Club who came back to his home Club with a Positive mindset hoping and humbly ready to give all his best and to achieve great things for the team again....but these toxic Fam* Base still blaming to Ronaldo....after being 36 years old!!! He'd still able to compete....how many times did he rescued us from almost losing to those games from the last season....hes the one that we won to those last minute of the games.... the Fact is CRISTIANO RONALDO is not the problem for all this seasons....the true problems who brought downfall to our Club are, the boards, directors, the top management, the fans who refused to blame the true victim instead blaming the One's who give all the best trying to help this club to reach its Best again ....After Sir Alex Retired this Club is instantly LOST!!....The truth is After the Sir Alex Retired....the only one the only manager who brought Manchester United better was Jose Mourinho....and the Fans the management still blame that guy who gave all his best for this club who let us win European Cup, F.A Cup and League Cup....hes the only guy that almost bring back Manchester United to its true level....but still the fans dont appreciate what he had done.... instead blaming the true guy again and let him get sacked....just like this happening to Ronaldo... The fans and all others who put blame on Ronaldo are the fools again...im so happy for Ronaldo finally Understand the Situation he's been put on....he deserves to be RESPECT....Sadly but the Fact is with these trash players with these negative surroundings, he'll never ever achieve trophies or anything....We don't deserve Ronaldo's Hardwork, Winning Mentality the true mindset that all player's must have ...but sadly that most of our players dont have....",
        "Definitely inappropriate behavior but Ten Hag shouldnt have said he is part of his plans when he cleary wasnt.",
        "Great movie the first time around. Tried making a sequel, terrible movie.",
        "The thing is Man UTD fans get rid of Ronaldo and start winning like what Arsenal have done",
        "Get him out, he has been a shambles this season. Always love him but he’s not the force he was.",
        "The fans know the truth. He’s not good enough anymore and his fragile ego can’t take it. He should never have been given a second chance after refusing to come on. Let’s fine him another million for this interview then ship him out asap if we can find anyone to take him in the next window! Garnacho has played 2 games this season and done more than cristiano. Goodbye and good riddance Ronaldo!",
        "Cristiano behaved badly that interview is not a proper action from him no one is bigger than the club .. But he may be right here I remember same thing happened to lukaku but he responded after leaving the club .. This  manchester united club is the worst club in England now ... Just look at the situation with jose, vangal, lukaku, cr7 etc..",
        "I want ronaldo to go",
        "That means he got his contract elsewhere!",
        "Should have kicked his arse out as soon as the blasted egomaniac refused to come to pre season. Don't think his personal recent tragedies have anything to do with his recent united choices.",
        "Can't stand Ronaldo now",
        "If he feels betrayed by Manchester United, he should also understand how the club and fans felt when he decided to leave the club. Yes, there are some problems in the club's ownership and management but talking about respect, . Farewell CR700",
        "Cant wait to see speeds reactions to this ",
        "CR7 got balls to go with his ball skills.. fair play from an arsenal fan.. man deserves to be respected wherever he goes.. best footballer that's ever been arguably",
        "Really sad, everything he says about the club as an institution is right and he does ultimately want what is best for us. He is the last player left from what United used to be and should be and it's sad to hear him talk about the club in this way. .",
        "United is a better team without Ronaldo, he can attest to this fact.....bye cr7",
        "Christiano made a very horrible move.",
        "He should have gone to man city",
        "Utd have been known to kill the end of a player’s career over & over ",
        "00:47 This sounds like some communist BS. Means nothing, and by respecting just for the sake of respecting leads nowhere.\n\nDid you have a communist revolution in England?  Can you say respect on loop for 1 minute? ",
        "I think utd thought cr7 was the player he once was and tried to utilise him in that way when he is a very different player now than he was last time at utd and didn't use him to his strengths he now has ...that said he is still a player and no player is bigger than the team and you should always respect the manager and your team mates ...he could have handled the situation differently if he is unhappy....shame it ends like this",
        "His form has dropped off a cliff in the last year",
        "Seems Ronaldo is raging at the dying of the light...He'll be 38 years old shortly and can't see him gouging half a million quid a week at any other club. He must be worth millions himself. He should retire gracefully while his legend is still intact",
        "I love CR7 ️️",
        "Dude talking about betrayal but said he even thought of going to man City... smh",
        "This is kinda sad",
        "Wasn't he United top scorer last season ? Needs a bit of respect ",
        "The timing of this interview ",
        "gg man u? ",
        "I mean, he wanted to leave so he forced himself to leave ️",
        "I just think he’s fighting and battling with his own Demons, the harsh reality and frustration of his body not being able to do what his head wishes which has now led to his ego far exceeding his talent! He’s gone into self destruct mode.",
        "It's so sad to see Ronaldo's career end and not at a high but a low",
        "He’s so far up his own backside. All players that are at the end of their careers are forced out. Get over yourself and accept that you’re finished.",
        "My guess is that MUFC made him by far the best offer last season.  If he wanted to leave in the summer and was going to take a significant pay cut, as MUFC, I'd want some compensation.  If that compensation wasn't there (transfer fee or something else) there's no reason to release him.",
        "Make sure you report the other content from the interview! Don’t flake out!!!!!!",
        "old Manchester Goatnited: Ronaldo score much goalsGives him trophées\nthis Penchester Urinited: Ronaldo saving them form relegationhmmm hot bench + disrespect",
        "This is what happens when a player thinks he is bigger than the club.",
        "I'd be forcing the greedy sod out at £600.00 a week .scandalous.",
        "Ronaldo is right… Man Utd aren’t heading in the right direction, it’s just all false hope. He sees a lack of desire in the players which is true and most of them are sub par. Then you’re not starting someone like him who’s loved by the fans and would acc give everything to win for utd is crazy…",
        "I'm done sitting tight for the award advance since i acquire$23,000 every 12 days of my investment.",
        "Ronaldo is crazy \nHe acts like a child",
        "I want Maguire to come out with an interview next saying the club is disrespecting him by putting him on the bench ",
        "He has no options he has to leave. You're too old man it's EPL not German league. Go away.",
        "Maybe media should spend more time checking out and vetting owners who bleed a club dry like the Glaziers. A lot of what Ronaldo said was true Glaziers out",
        "Over payed and over rated ",
        "Ronaldo believes he's bigger than United that's why he will never be the GOAT in my opinion.",
        "Darwin Nunez has played just 80minutes in total more than than Ronaldo's \"minutes per goal\" and scored 5 already in the league. Ronaldo fans who think he's a good player even now are deluded beyond measure.. and no I'm not a Liverpool supporter..",
        "It's shameful if he's treated that way. He wanted to leave but they didn't let him. He came in while the season was already on and still became the highest goal scorer for them.",
        "CR7 = Wasteman",
        "Arsenal gotta pick him up this January",
        "The Princess Diana of 2022",
        "Thank God he left the club.. He was not getting any pitch time..and he was likely to lose his touch which would effect his world cup performance. Let's see where he fits in other clubs.. personally as a huge messi fan..i don't wanna see him like this...",
        "Ronaldo to Chelsea or Bayern Munich",
        "His stats show that he shouldn't be on the pitch. We're sitting higher on the table now that he is playing less. It's clear that he wanted to leave long before this, namely in the last transfer window, so not sure what he expects from the club now? He want them to run after him and show him \"respect\"? After walking down the tunnel early, refusing to come onto the pitch at times, etc. He's not a team player and hasn't earned the respect he wants this season. He thinks everyone should auto-respect him because he's one of the GOATs, but it doesn't work like that does it? He can take his complaining, dramatic self far away from Man U, thank you very much.",
        "Facts.",
        "Just seems like an old player struggling to grasp that he’s finished at the highest level. The only club that ‘wants’ him is Chelsea, not even because of footballing reasons just commercial.",
        "Thanks for the effort but now give chance to young one's coming, I am your big fan but the team needs to win compete, goals score, etc, you were not betrayed don't say that, the coach is a good manager humble Dutch man, ten haage make big changes in united.",
        "We still love you Cristiano",
        "He has nothing to do with United ..leave aside ...cr7 focus on your national team ...",
        "The thing is Ronaldo isn’t good enough to be a starting striker in any EPL team. The sad reality is probably no top 5 league wants him, if he goes back to Serie A no top team wants him. Even last season he had good numbers but they couldn’t get a UCL spot.",
        "As a huge fan to CR7, I really don't understand his mindset. His return to ManU was a fairy tail, and could have been ManU's biggest legend. Last summer, he decided to chase Champions league, and that's fine. But unfortunately, no team wants him, and he lost all his leverage to ETH. More sadly, he's going downhill like a rocket this season. Instead of accepting the fact, he chose to blame everyone except himself.",
        "With this statement, he only showed his unprofessionalism, the club is in the first place and priority, I think it should be like that. I think it is now clear to everyone why the little cr7 is warming the bench.Slowly his huge ego and complexes come to the fore!",
        "Oh dear, United still have the same kitchen ",
        "Finally lost all respect for Ronaldo.",
        "Bye then",
        "Come to Bayern ",
        "He right but Ronaldo bit this new man utd manager is very like the England manager sticks to the same players week in week out that wjy they were stuggling and still stuggle in most games",
        "He's only still there because no other team was willing to bow to his wage demands.",
        "I'm a big Utd fan and a fan of Ronaldo but I see him doing this only for himself. No player wants a team mate who is always sulking when you do not give them the ball. He is also now too old to play the kind of game Ten Hag wants. No individual player can be bigger than Utd, maybe he should try Sporting !!",
        "They should have just let him leave in the summer window but insisted in keeping him... now they want him gone.....",
        "RIP Speed. The week is he in Manchester / London... this happens LOL",
        "What a prima donna - he will be 38 ( THIRTY EIGHT ) in Feb - how much longer can he expect to be valuable in the premier league - he should have a chat to Gary Neville and go play\nfor Salford",
        "Wish this was revealed before the Villa match so I didn’t have to witness Man Utd losing and they would’ve been in top 4 right now. Good bye Mr. outdated ego.",
        "“I want Champions League football” “United are forcing me out ”",
        "CR7 was never betrayed,  he jus needs to accept that he's is not the same Ronaldo",
        "Ronaldo going out sad, and I idolised this guy. Either adapt or go",
        "Eric is simply scoumbeg",
        "CR7 is a legend and bigger than Manchester United ",
        "Whole premier league combined can't match Cristiano, don't disrespect our  otherwise,whole PL will suffer .....",
        "This is acc mad ",
        "Don't understand some people. He scored some memorable goals last year and was top goalscorer then everyone on his back from pre season perhaps as press made it look like he missed tour because he wanted to leave rather than his daughter being ill.",
        "Hes comeback was like a Dream..And theese idiots ruined our dream",
        "All soccer players are jealous of him, except for Messi ",
        "As a fellow Portuguese all I can say is that it’s a shame to see Ronaldo in this state the biggest mistake he made was leaving RM after that his fall from grace has been due to him hopefully he can have a deep run in the WC and end his career in a positive note!",
        "If he was doing it on the pitch this season then it would throw weight behind his statement but he was a great player not anymore. He wanted out if the club well you just got it.",
        "  This is how spoiled bratts speak. He failed the leadership test. He didn't want to do the pre-season. And what he is saying makes absolutely no sense. The club is on the right path under Erik Ten Hag we can all see that. I have always questioned his leadership skills even at Madrid. Contrary to what he thinks he wouldn't have played much at City nor Liverpool.",
        "Romans 3:23 states: \"For all have sinned, and come short of the glory of God;\". We are all sinners, that have committed at least one sin in our lives, which earns us an eternal punishment in Hell. Revelation states 21:8 \"But the fearful, and unbelieving, and the abominable, and murderers, and whoremongers, and sorcerers, and idolaters, and all liars, shall have their part in the lake which burneth with fire and brimstone: which is the second death.\". God sent his Son, Jesus, to Earth as a perfect sinless sacrifice. To take on all the sins of the world; both past, present, and future sins. Shedding his blood on the cross as a blood atonement for all sins. After dying on the cross, he rose from the dead on the 3rd day and rose to Heaven. To show life after death. To show everlasting life through Jesus's sacrifice. John 14:6 states: \"Jesus saith unto him, I am the way, the truth, and the life: no man cometh unto the Father, but by me.\". Romans 10:13 states \"For whosoever shall call upon the name of the Lord shall be saved.\". ",
        "Goat",
        "Ronaldo and Bruno are still friends \n\n   Stop making agenda against Ronaldo and Bruno . Media is trying to make agenda against to Ronaldo because they wanna some attention.",
        "The Ronaldo show again \nGet rid \nThe bloke is past it",
        "Wtf, weren't he trying to leave a few months ago ",
        "He is going to score many more goals where ever he is going next. ",
        "Force him out?\nHasn't he been trying to force a move since the summer?\nSeems the Utd players are as delusional as the fans.",
        "Love Ronaldo such a great interview now we have something to talk about for a couple of days :)",
        "I hope he has a massive world cup",
        "Sad that there’s so many Utd fans so quick to forget what he’s done. The man’s not making this up out of nowhere. Half the stuff he said about the owners and Ragnick are what Utd fans have been banging on about for years. Now ronaldo openly says it and Utd fans are fuming. If Ronaldo is feeling disrespected by ten hag there’s a reason. Don’t blindly side with ten hag and hate Ronaldo. There’s more to this than the camera shows. Ronaldo may be egotistical but he’s never spoken out against a manager like this.",
        "Viva ronaldoooooooo",
        "he has no respect.. and everyone will not respect to him. NO PLAYER IS BIGGER THAN THE CLUB.",
        "“I really cant score is because ten hag fault” - ronaldo",
        "\"No one's bigger than the club'' Sir Alex Ferguson",
        "Siiiuuuuuuu",
        "With this interview CR7 has done trust me NO Manager would want him in his team even if the club desperately needs him",
        "Biggest mistake in his career was going back to this club ... what a shame ...",
        "CR7 is right",
        "For athletes, arrogance and old age don't mix very well. CR7 is just now learning that. Remember Sergio Ramos at Madrid?",
        "He says he wants what's best for the club , the people say he wants what's best for him. No new Bugatti for you buddy.",
        "The clubs shown that they don't need him so he's having sook aw poor penny pincher , take your ego and jog on ,",
        "Find it strange that in the week before the world cup, CR is ill and not available.  He just did not want to get injured before his last world cup.  Add to that him being unavailable for pre-season as he tried to engineer a move to a Champions League club to boost his own position as leading goal=scorer.  Sad but CR7 has played for himself for a little too long.  Let's remember his greatness and forget his last disappointing half season.",
        "He would've gone to ANY champions league club that offered him what he wanted in the summer, but everyone who could afford him knew it would not be worth having such a baby at their club. Look at how United have turned it around without him. This seems like a desperate move, because he knows he won't play at United anymore, and he needs to try and make other teams believe it's not his fault. Unless is he willing to take gigantic paycut, he is not going anywhere in January",
        "The dude was toxic, sad to see someone of his class devolve like this.",
        "He tried to force his way out in the summer, now he’s saying the Ten Hag is forcing him out… ",
        "We haven't seen the last CR7 in Manchester just yet. Wait and see.",
        "To be proud of trying...\nBEING the best...\nisn't as GO(O)D...\nAS GO(O)D IS.",
        "This is just disrespect",
        "Dont really understand how United are forcing him out,what do they want him to pay his own transfer fee to leave,United could have terminated his contract when he wanted to leave before the season started but they didnt and kept him as a 500k bench warmer,seems like they wanted to give him a chance to earn his place but he didnt feel he needed to being who he is.",
        "Cr7 is trying to help the club but they are just hate him for speaking up",
        "It all started with him leaving the pitch against the Spurs.",
        "What did he want..a two year extension?!",
        "Ronaldo should understand when to step down. He is not bigger than Manchester United. Players will come and go but United will remain.",
        "I think Ten Hag already gave Cristiano the chances he needs and deserves, and still he couldnt perform. If he means loyal is by giving all the chances, all the minute play and wait for him to give result than it makes me wonder whether he is a pro footballer or not. Football nowadays demands result, and its not work with him this season.",
        "Can't wait to see how Roy Keane defends him this time, and I'm sure he'll find a way.",
        "honestly, not too surprised about this. when you bench and ignore a player of that ego, this was expected. ten hag should have sold him in the summer.",
        "This is a disgraceful way to leave a club where you're loved and respected. He has done great harm to his reputation and he is done at United.\nNo one betrayed him. He chose not to show up for preseason which led to this mess. He claims nothing has changed at United while attacking the man actively rebuilding the club. What a shame!",
        "Oh no...anyway atleast were in the top 5",
        "Can't wait to be rid of the narcissistic egomaniac that is CR7. Everything is always about him. All that BS about the fans loving him will end completely. Making it seem like he's making these statements for the good of the fans when it's all about him and his ambitions. He should just get out and there goes his legacy forever too. He has ended his relationship on a bad note and that is what most will remember",
        "He left Manchester in the past. And now he wants love hahaha. Cry baby",
        "Ffs let the man go before he pulls rest of team into his toxicity.\nIt's a sad sight to see him acting this way.",
        "Anyone seen that new comedy \" The world according to Ronny\" the man is a joke.",
        "All the CR7 slander in the comments aren’t understanding the point he is saying… this man played some of the best clubs in the world, the best facilities, environment to succeed. He knows what it takes to win things. If Manchester United takes what he say’s as an insult rather than a sign to improve the club behind closed doors they will not catch up to the likes of City.",
        "Ronaldo and Fergie are bigger than Manchester United according to some of their plastic fans",
        "No player is bigger than the club At 37 even Renaldos best days are behind him",
        "He was refusing to play and tried pushing through a transfer and now he is complaining!!! I love the guy but all he does is moan lately",
        "Speed won’t be happy ",
        "Eth primary assignment is to win games and bring Manchester United to the top, he is not to be running around to please a player in the hurt of the club.",
        "His interview basically admits he was happy to go to City..... where is the respect to the united fans there?",
        "We all knew this .Cristiano loves man u but some people in the club don't want him there.ronaldos words are absolutely right .he tries to give his best for the club.ten hag literally don't want Ronaldo at man u.Yes there trying  make  the media point their fingers at cr7 make him the bad  guy.Ronaldo deserves better.Amd many ex players ,staffs, and media,and critics knows Ronaldo is right",
        "My first question is \"When was this actually filmed?\" Ronaldo said a few months back the truth would all come out in a few weeks. It's past that now. If this was the interview from then, how current are the facts and why wasn't this released earlier as he said it would?",
        "Does this make him a good a bad player to put in your Fantasy World Cup team?",
        "times",
        "Thank you for all you've done Cristiano. You will be missed and I hope you have a great retirement.",
        "It is amazing how much difference one person can make. Since sir Alex Ferguson left,  Manchester United have tried all the football recipes from Christian Ronaldo to hiring different coaches but nothing works..",
        "About time someone told the truth about the club. Well said Christiano ",
        "Ronaldo thought he would be the one, the hero, who took Utd bk to top. When it went wrong, and he realised that he wasn't going to be that her, taking all the praise/worshipping, he spat his dummy out because he didn't like it. He should not have returned and left his legacy intact. He has really stained that now with his childish, spoilt attitude!",
        "One of the greatest players of all time but has really handled his decline embarrassingly unprofessionally.  Am a Liverpool fan but good on Ten Hag and Man Utd, no one is bigger than the club.",
        "Waah! This is terrible, Cristiano the hero at Man U, we honor your contribution not only on Manchester united but all over the world you have made football great, we accept what will happen since we will not change it",
        "I’ve never heard Ronaldo say something about a manager or members of the club since the day he started playing until now. It’s good he’s spitting out everything. Clearly he’s fit and the best to play all the games but yet he’s in bench. It’s all stupid political inside the club trying to ruin him",
        "Goat ",
        "Surely the water was changed in jacuzzi, can't imagine that staying same for 17 years!!...",
        "You should have gone to City mate",
        "Why doesn't anyone seem to factor in that he's nearly 40!? He's one of the best to ever grace the game, but he's no spring chicken - we're just seeing natural age-related decline.",
        "Maybe it’s for reasons like these that the club doesn’t want him at the club.️ It’s annoying that when the team is getting results without him he goes and does this and shifts the attention to himself because to some degree he feels that he’s on top of the club.",
        "Idgaf what Ronaldo did or said, he’s the GOAT and deserves respect, he was the reason Manu even surpassed last season without being in serious trouble, 20+ goals at 36 years old in the best damn League there is, who else does that? People just wanna hate.",
        "Man U and ETH are a disgrace for how they treated Ronaldo",
        "No coincidence under ETH we lose more games starting Ronaldo than without him. Just part ways",
        "Now I am waiting for All or Nothing series for ManU .",
        "Sad to see someone of his statue is shaming and blaming using media. When love is over, divorce and start something new.",
        "I saw many a brilliant CR7 play foiled by his incapable Man U teammates. No idea why anyone would make him the scapegoat for the club's '21-'22 problems.",
        "This is the most over the top game trailer Ive ever seen and I love it",
        "I knew he wasn’t sick it makes sense why he wasn’t playing, but Ronaldo is speaking facts about United they are a mess from top to bottom and yeah rightly so ever since sir alex left they’ve been s..t",
        "Thanks for everything Ronaldo️ love you so much Idol",
        "Ill and unavailable for matches except for bs interviews.",
        "No-one was \"forcing him out\" when he announced that he wanted to leave. His conduct this season has been very unprofessional, the sooner he leaves the better for everyone.",
        "It's disgusting how they're treating him",
        "Maybe he should ask himself if his performance under ETH deserves the respect he demands.",
        "He rejected city ",
        "I’m sure he won’t come back to the club until he made it transfer to\nOther teams   He is right he should respect him as klop respect James Milner. Can’t see ten hage respect over him",
        "This guy has toxic on money written all over himself, he can’t see passed his own nose.\nFootball isn’t about him\nIt’s about football and quite simply Erik & the young lads are 100% correct for not playing him. He’s completely lost his play… almost every game they don’t play him they win/score",
        "Only a real GOAT can expose their own club. Fearless",
        "crazy to think he made juve fans united fans and madrid fans hate him ( ronaldo fans dont count they will always have his back no matter what he does )",
        "At this point Hes ruining his own legacy everyone knows what his character is like if he doesn't get his own way he turns into a little kid... & how can anyone force you out the club when you made a statement b4 ETH even play his first match saying you wanted to leave  at this point hes not the same Ronaldo from b4 hes clearly on a downwards spiral and willing to blame anyone rn.. very disappointing",
        "Messi > Ronaldo",
        "Ronaldo, you got great career, one of the best players ever!\nTell them good buy, and enjoy your life!",
        "Cr7 is right...he could easily go to City",
        "Penaldo's sense of entitlement is breathtaking. Have you seen how many chances he has squandered this season? Ten Hag has treated this old diva with nothing but respect and been disrespected in turn.",
        "Ronaldo is right. If people don't respect you then Don't respect them too. Ten Hag Deserve that!",
        "But he is very right about the internal issues of the club.",
        "time to retire or go to inter miami",
        "Big players need top class managers. Unfortunately Man Utd haven’t had one since Fergie . They should have made him player manager.",
        "As great a player Ronaldo has been over the years, nobody is bigger than Man utd, and openly saying you have no respect for eth, then it's thank you and goodbye, club needs to move on from this ego, and allow eth to build his team",
        "i agree with this views on the lack of investment, but the digs towards Erik and Rooney!??? sigh.... anybody who prefers him over Erik is simply not a United fan",
        "He should consider retiring after World Cup because there will be more humiliation if he plays club football",
        "ARE YOU SERIOUS RIGHT NEOWWW?",
        "He's not being forced out, he's forcing United to let him go.",
        "Who does he think he is , it seems the Italian players might have had a point.  Ronaldo is a rotten fruit that needs to thrown out of the basket immediately. Imagine having to play with him for country. Nobody must say anything bad about him even if it's TRUE. Then you are off the friends list.",
        "It was a mistake for senior CR7 to return to his former club.",
        "Says someone who failed to get a club in the previous transfer window",
        "He still thinks he's better than the club",
        "What a END.  \nI'm a Liverpool fan, but to treat such a proud and historic club like he has (especially one that made him) just shows how little class he has and that he is no longer worthy of respect.",
        "CR7 come to Liverpool, you will be appreciated.",
        "someone's goat yunno",
        "life gets its momentum when it goes down.\nan apt saying to describe ronaldo's football ending...",
        "He should cut his wages and sign for clubs like Brentford, Aston Villa, Everton",
        "United have fully tumbled now ",
        "Haha he waited until the last game before the worldcup to make that statement, so when the seasons resume he will get his  transfer",
        "Trapped in a golden cage like an out of favour tudor duke",
        "Cristiano and ten Hag Netflix documentary when",
        "Throwing his toys out the Pram again ",
        "Ohh thank you..i think we won’t see you again at united ..big baby",
        "He did this purely for self preservation... not for the fans, not for the club. Period",
        "He'd of broken his Premier League goalscoring record last season and City probably would of won the Champions League. Ronaldo for his age would of won the Balon Dor. And the rest is history.\nInstead he let his heart rule his head went back for Sir Alex was by far the teams top scorer and now is being treated like a player past his best.",
        "So sad. I don't wanna cry. Will miss you Ronaldo . Never trust a club that has no roots",
        "Ok sooo if you feel that way get your own back and join Man City ",
        "Didn't he try everything to leave before the season began? He was selling himself to anyone and everyone who was playing in the Champions League. He is past his best and he should have retired in the MLS a few years ago. He is strangling United creativity.",
        "He handed a transfer request.. And he said the club forced him to leave?? Bruh the club forced him to stay when he wanted to leave.",
        "Proof again that Ronaldo is just in it for himself, no other team wanted him, guess why?",
        "Because Erik not treat him special so he just decide not to respect Erik? ",
        "If your ambitions beat your talent. Casey Stoner to Valentino Rossi.",
        "He still has 3 good years. I hope he gets a great club.",
        "I made a bit with my son 1 week ago , that Ronaldo will move away from January, Ten will be fired latest by the end of this year, Clopp will bring Lev to 4th place, new castel will finish 2nd place and Chelsea coach will get fired. Let's see if my magic ball spells the truth "
    ],
    "comments_disabled": false
}