{
    "video_id": "UeKxAYVkOHE",
    "comments": [
        "How can I get that mod , i also want to play such that my pp never recharges",
        "Please make this a playthrough!",
        "The Butterfree clip killed me",
        "ShadyPeguinn and SmallAnt in one video! I love it!",
        "Yo what is this and where can I download it?",
        "which ROM ? Can we use it in My Boy emulator",
        "Bro I swear SmallAnt and his friends are on a quest to add multiplayer to every game in the world.",
        "This was a huge stream doc this is why youre number one and two .think about it !!!",
        "Hi Smant, I challenge you, to (let Crafty (Hi Crafty)) make a mod in Mario Odyssey, in which you die, if you step on the path of someone else (I suggest Crafty (because he made the mod) or Fir or CJ (because of the Speedrun-Brain)).",
        "14:38 why wouldn’t he just Encore again lol, he can keep this locked in for 4 more encores",
        "The best thing about pchal career is that now everytime a mon dies to a crit, chat 5heads and says \"welp, shoulda played around your crits\"",
        "keep trying, would watch every single episode trough!",
        "Is there a way to get the Mods for it or is it an exclusive deal with the Modder and Smant?",
        "Can you play pokemon this gym of Mine?",
        "If that plush was your profile picture icon it would sell like crazy",
        "ARE YOU TELLING ME YOU ARE DOING A SOUL LINK SHADY LOCKE WITH THE SHADYPINGGUIN. WHAT A GENIUS VIDEO",
        "Pokecenters not restoring ur PP?\nWhat form of Masochism is this?",
        "The Harry Potter quote and saying she can do what she wants now has me crying, seeing how relived and free she feels. In a world so full of bad endings I'm so happy that, by the looks of things, she got the good one <3 :o",
        "How do you download these mod versions? I want to try this multiplayer nuzlock with some people. Think it would be a fun challenge.",
        "This is exactly how I thought initially the Link Cable should work. Fantastic to see someone made it actually into reality\n\nFantastic video as always Ant!",
        "This is so fun to watch. Love the team strategy!",
        "Do more of these!!",
        "How does defeating gym leaders work in the multiplayer?",
        "Moreeee",
        "I can't tell you how excited I was to see this video pop up in my subscription feed. I came for the Roblox discussion, stayed for the meltdown, and was hit with unexpected feels at the end. Thank you so much for talking about women in the gaming industry. Considering how much of an impact music and especially video game music and video games in general have had on my life, it also hurts me to think about how many hardworking (many pioneers in their field) creators and developers will ultimately not get credit for their work and/or get lost to time. Thank you so much for this incredibly enjoyable video",
        "Are you able to do this with romhacks that are firered based",
        "Why Shady Penguin look like the Haircut I gave Trevor from GTA 5?",
        "Why is SmallAnt playing against Virat Kohli.",
        "At 24:25 I decided to watch from 23:59 again, but at 0.25x speed. It was so hilarious I watched the whole rest like that ",
        "Is this mod available to be downloaded?",
        "this was the best",
        "This is so much incredible",
        "Don't traded Pokemon level faster then regular ones?",
        "pokémon hide and seek when?",
        "Shady is one of my favorites, used to watch him all the time! Great seeing another collab!",
        "Its stupid that a multibillion company didnt do this in the first place... im expecting huge things with pokemon and the next switch launch.. they cant get away with ''open empty worlds'' especially",
        "\"This is probably the hardest challenge I've ever attempted\"\n\nWhat shade! Poor Pokemon Challenges.",
        "You r not fastest pencil sharpener in the world anymore",
        "That was fun!",
        "Imagine waiting for Gamefreak to release a multiplayer pokemon game when Temtem already exists. Honestly don't think there's anything Pokemon does, aside from nostalgia, that Temtem doesn't just do better.",
        "We have to think about moves and pp\n-2 gays before a night out",
        "Please do more of this its fun",
        "100% do this with jan",
        "Should have just spawned in Rare Candy if you weren't gonna grind. I get that it makes the whole \"PP don't get healed\" thing easier if you can just level with rare candies, but still. Take the second attempt for example. You didn't struggle because you fought wild Pokemon but because of the unfavorable matchup. I guess I understand if you wanna try without, and sure it adds a challenge, but it essentially enticed what we've seen - rocking up to a pretty hard rival fight with a level 5 because you can't afford to waste the PP to switch train, then having bad luck and getting the one Pokemon that's levelled properly hard-countered",
        "\"we are fine\"\nNarrator: They were indeed \"not\" fine.",
        "bro i grew up watching shady and now small ant is my fav worlds are colliding",
        "i love your content smant",
        "people that wanna play this, look up \"Huntermanx\", find AND follow his how to play tutorial.",
        "Arguably.... if you use up a single pokemon's pp, won't that just mean you can use it to switch train other pokemon that do have pp, by taking out wilds with struggle?\n\nI know it's not really in the spirit of the challenge, but it is within the rules and seems like the optimal play to make.",
        "28:11 That happened to me plenty in Pokemon Red/Blue/Yellow. d:",
        "Some other streamer: Hmmm…quagsire…\n\nS-mant: that’s probably the weakest Pokémon ever made.",
        "I don’t understand why they can’t replenish pp from the poke center?",
        "I feel like an unofficial pokemon server would be common sense. this has to have been around forever. its just too good.",
        "Can we just appreciate how much effort he puts into this video! - Shut up ",
        "This is great, because a friend and I are planning on doing a blind soullocke in scarlet violet.",
        "Moltres bursting out of drowzee's chest to keep the dream alive!",
        "To be honest my favourite part of watching Pokémon videos is them saying po",
        "Where is the game download? How do i download it, and how do i play with a friend on it?",
        "That was funny",
        "Dude I'm happy you did this cause I grew up watching shady",
        "PINEAPPLES TASTE GOOD!!!!!!!!",
        "ITS A SHADYLOCK",
        "15:15 is peak content",
        "Daaamn, a video with shady! What a joy.",
        "Shadyyyyy! The og",
        "SmallAnt, I love your videos. You are very good at Pokémon and you are my hero.",
        "I just started my first nuzlocke. Been playing a ton of pokemon since the gen1 came out, and somehow i haven't done one. Was a hard choise on do i do it vanilla or randomizer, i'm going vanilla ruby. It's a gen i'm comfortable with, but don't know every grass patch, so some surprises, some playing from memory. It's been fun so far, not too rough yet.",
        "How to play online multiplayer too?",
        "This is so cool",
        "Pokemon: Communism Edition",
        "Nice videos gaming",
        "I don't watch the streamer Ant was playing with, but was 15:30 a team fortress 2 reference when he said sawmill?",
        "Shady: If you just sent me into like a Mewtwo I'm going to be very upset\nBug catcher: sends out a Mr. Mime\n*30 minutes earlier\nBug catcher: Mom, can we get a Mewtwo on the way home?",
        "In another world, in another time, somebody would've been VERY happy to have obtained that gengar in a soul link with shady...o7",
        "BROOOO 15:20 MADE ME SCREAAAM :D What a fight sheeeesh",
        "is there a way i could set this up with a friend?",
        "Was there a rule against fighting wild pokemon to level? because I feel like so many of the deaths in the beginning are the fault of not grinding at all lol",
        "dude has a beard i only can wish I could have",
        "Shady doing a Soul Link with someone other than *****? Amazing, glad to see him doing these again",
        "3:50 Money in FR LG is really bad too ",
        "Whwre can I get this game to play with friends",
        "How can i play this with my lil brother?",
        "We did everything we needed to do in the install guide video. Anyone found a fix or is there a problem that we may be having that were not thinking of? We have our IP addresses the same, and were on a local wifi",
        "Can any gamers in the comments explain how they set this up? Is this all publicly available?",
        "what program are you using?",
        "Oh I watched this live and it was brutal. I loved it and I hope SmallAnt and Shady will return to ace this challenge. I believe with the acquired experience they can ace this.",
        "EEE",
        "Shady penguin back on the soul link, lets just forget his last one even though its what got me into soul links",
        "I love how he makes a child-friendly game into a traumatizing game",
        "\"Stereo's thick!! Stereo's built different!!\" lmao",
        "Thats called a soullink.\nJust in the very very same world",
        "nice",
        "Where can I get it? Rly want to play it !",
        "getting pp-stalled by a jirachi here is next level",
        "Smant and Shade??? Let's go!!",
        "ISHOWDONATION, You made that Kid's Day. Thank you Speed!",
        "The constant changing of layouts between shady and smant talking gave me a headache not even 5 minutes in as much as I'd like to watch this it's too excessive..",
        "I want to see this again with @shady",
        "YAY NEW VIDEO! LOVE YOU SMALL ANT",
        "Love seeing these two together",
        "That trading dude is the dream of every kid on GTS",
        "Trading dead pokemon ",
        "This reminds me of the old FRLG MMO from a while ago.",
        "I actually like how Shady traded a dead Drowsee for a Moltres with Revival Herb. That's too poetic.",
        "25:16 reminds me of Alpharad’s Hypno the Phoenix.",
        "Schrodinger's Moltres",
        "Does anyone know how to play this? Maybe not the nuzlocke part but I'd love to play multi-player with my boyfriend",
        "Charmander seems like a good thing to light a cigarette",
        "MY BOY SHADY. LETSSS GOOOOOOOO",
        "Hardest challenge I’ve ever done.\n\nNo damage run ………",
        "of 'course' ant didn't grind...he rarely grinds....AAAAARGH DX I love his vids but I wished he'd just grind for once at the start and in b/w ><",
        "Evolutions restoring all PP could be fun twists in these nuzlockes..",
        "can’t wait for pchal to talk about how the optimal play is to either use rare candies or to not be lazy and grind on wild mons",
        "you're really doing all the coolest pokemon nuzlocke challenges right now huh",
        "Really cool mod and a team-up with Shady? This was a great watch and hope you guys come back to this in the future sometime soon.",
        "16:02\n\nGood guy Smant checking up on what really matters",
        "How",
        "Didn’t know cinnamon toast was into Pokémon",
        "Another Please",
        "Would this work on real hardware? The multiplayer bit, not the other 200 mods and randomizers installed in.",
        "“There’s a wild Groundon in the grass”. Wtf",
        "Over a mil views and #40 on trending, nice",
        "Omg, you could do hide and seek in this. If you somehow added in a way to change your character into an NPC sprite by talking to NPCs. Then having every NPC only fight you if you talked to it. Would be cool with like 8 players.",
        "okay but like\npokemmo exists already?",
        "This looks lit",
        "Moooore haha",
        "Shady! Longtime no see!",
        "Fun fact: Multiplayer already existed in a kanto game, its called pokemon lets go pikachu/eevee",
        "You didn't mention the randomizer.",
        "I was worried when I saw the thumbnail and title. I'm so glad that we're doing thanksmas, you have helped so many people. Let's help some more!",
        "Camman18: (finally gets rid of birch in his inventory) IT COULDVE TOUCHED ME, I COULDVE DIED!!!",
        "What mod is this?",
        "I don't really get why they waste all their PP on random trainers, you gain nothing from that as you need to find new pokemon sooner which need pokeballs to be bought, so the earned money will go down the drain again...",
        "Imagine if the game out out like this back when it released",
        "ok how can I play this multiplayer?",
        "Please release a tutorial on how to do this it looks like such a fun time!",
        "Definitely need more of this.",
        "Love how they unintentionally named one of their mons 'girlfriends' in Spanish (novias)",
        "Shady and Smallant is the team up of the century ️️ love you both!! ",
        "rom hack name",
        "this was a lot of fun, incredibly difficult though haha I really enjoyed the dynamic between the two of you! :) Maybe do it next time without the PP limitation",
        "Bring the ROM hack link to me! Please!",
        "Shady Ant or Small Penguin?",
        "i can’t get this mod working",
        "I swear u never post the part 2 to this stuff even though we really want to see them please do.      Like so he sees",
        "The whole thing with Novias and Zynx is LITERALLY the coolest, most poetic story moment I've ever seen in a Nuzlocke\nAmazing ",
        "Thank you for the butterfree edits they were amazing",
        "\"Could you trade the corpse?\" \"I think that's illegal.\"",
        "2:10 Oh neat, natural movepools.\n3:17 Oh good, natural catch rates; That means no cheesing & taking the easy steamrolling route with a legendary.:\n4:04 Lol, limited PP?",
        "how is this possible",
        "They should have multiplayer pokemon like this",
        "Cool concept but handcuffing with no PP is just lame",
        "Just curious, why wouldn't he be allowed to trade a dead Drowzee? The guy didn't specify it had to be alive.",
        "22:36 the ultimate trade offer ! ",
        "Smant: *Trying to navigate a very difficult battle with a legendary\nShady: \"I took out a Jigglypuff and for some reason I'm very proud about that\"",
        "\"This is the probably the hardest pokemon challenge ive ever attempted\"\nFlashbacks to Ants 4th most viewed video",
        "NOOOOOOOOOOOOOOOOO NOT THE SAD BUTTERFREE CLIPS",
        "multiplayer pokémon lockout????",
        "Since watching all your Pokémon videos it makes me replay all the old Pokémon games! I miss them!",
        "You guys didn't defeat brock... you defeated cyclist Tristan lol",
        "I always think about my Moves and PP :)",
        "Man took some time, but replaced Nappy and made it better",
        " 16:03",
        "This is so cool, have been watching Shady since I was 14 or 15 (23 now) Have stayed subbed to him all these years but haven't had as much time to watch recently. Saw this on recommend, so glad that another class of kids gets to enjoy his content, and thanks shady for the literal hundreds of hours of enjoyment. shady people for life!",
        "Not a whole lot of people that originated as a meme go on to remain so successful and get even more popular. It's been a fantastic trip seeing this channel grow more and more, and it never ceases to amaze me how a community can be so cursed and so wholesome at the same time. Doing fantastic work man, keep it up o7 :O",
        "I find it mind blowing how far mods have gone in the last 2 years or so, allowing for online multiplayer in games that never had it. Mad props to the ones who figure this stuff out.\n\nEdit: ok, according to the replies, these have been around for longer than I thought. That doesn't make it any less mind blowing, but I guess it also means we should thank these content creators for giving it publicity. Or it's possible that they did have publicity in the past and I didn't know about it, I haven't been watching YouTube for that long.",
        "I love this format",
        "as an old viewer of shady its nice to see him getting some revival when it comes to content!\nvery nice video",
        "I love how there’s just a kill button",
        "For a split second the moment when  i saw the title i thought the whole game was going to be a mod where double battles would be mandatory for all battles where both players had to work together for every battle.",
        "The moments when trade a dead drowsee by an living moltres i laughed and im watching the entire thing at 25% speed and jirachi x porygon battle is legendary...",
        "What’s the point of the PP restriction? Seems like a random restriction that doesn’t fit in with the rest of the challenge",
        "How does one do",
        "Wait so the mod maker is named and credited in the desc. (TheHunterManX) but why not in the video? We all know hardly anyone reads descriptions and Atsign (the person who usually makes a lot of the mods Smant does) is as far as I've seen always mentioned by name and even has something named after him in each run, this guy made proper multi player Pokemon and he's just called \"Someone\"? ",
        "Minecarts after seeing this:\nMy time as come",
        "Please put a link to this mod or whatever. Would love to try a nuzlock multi with someone",
        "Ants luck is off the charts",
        "Rip",
        "this is so brutal lol, you should slacken the rules so you actually get anywhere",
        "What software was used for the multiplayer?",
        "HOW DO I PLAY THIS",
        "ShadyPenguin is giving me Jake Gyllenhaal vibes, ijs",
        "9:26:34 doc invents a new word",
        "how do i download this and play it?",
        "just ordered my smant plush, thanks for uploading the video btw :3 was so fun to watch u guys :3",
        "OK now play a 3 way nuzlock with someone who has never touched pokemon before, this is what I am experiencing. ",
        "as good as this video is it aint the same seeing shady do a soul link without nappy lol",
        "PLEASE do this again this is sick",
        "Scarlet and voilet, which is the pokemon game coming tommorow, has multiplayer so no need for modding lol",
        "The anime reference for butterfree was was great. Keep up the good work",
        "Dude I really want the link of this game",
        "This mod makes Pokémon seem so fun, if only i had access to it.",
        "A wild Groudon in the grass.",
        "Raising from the dead body of Drowzee ",
        "Hey I bought the newest pokemon game and I found out that you can do the gyms out of order I accidentally did the water type gym 2nd when I'm pretty sure it is supposed to be 3rd or so. You should do a video trying to do all the gyms out of order in scarlet or violet",
        "the beard",
        "It’s really cool, also super impressive how hard you’ve made it. It’d still be cool if it was less hard too :P",
        "How can we play this?? I want to play it with friends! It has to become the hottest nuzlocke on the block :D",
        "the bye bye butterfree bit was sooooooo good",
        "The Bye Bye Butterfree Bit \n\n26:50",
        "All soulinks should be like this",
        "16:02 is the moment your family comes in and listen to your video.",
        "If anyone is hating on keeping Novias, I’ll fight them. It worked so perfectly.",
        "\"Our legend\" communism lol",
        "The no pp recovery is probably the hardest part of the challenge its great, i love the energy with you two",
        "Y'all really couldn't wait till Friday for Sc/Vi multiplayer to release \n\n\nIn all seriousness this is actually sick! Love the concept and the execution. Great video.",
        "I can feel the plot armor through my screen",
        "i wish i could play this with my friends it looks so cool",
        "The amount sus things said in this video",
        "Why would you hurt my soul like that with the butterfree clip",
        "How do you get this?",
        "If I wanted to do this with my partner what would I have to download?",
        "Please do a second attempt on this, this was very entertaining to watch and it looked like you had fun too!",
        "𝖕𝖗𝖔𝖒𝖔𝖘𝖒 ",
        "Oh my god, the lack of PP recovery is an AWFUL restriction. That's just masochistic.",
        "Cool",
        "I would love to see you try an Ironmon Kaizo - Challenge!",
        "can someone plz tell me how can i get this rom? ty :)",
        "damn, I wish we could download these custom hacks",
        "That was an amazing concept! Would love to see more!",
        "20:34 Ah, Sage´s wisdom was requested so here goes! So, to win you must... uh...not die? Get lucky? You know what, forget that this comment exists.",
        "DUDE WHATTTTT SHADYPENGUINN THERE’S NO WAY I LOVE THIS GUY",
        "Pokemon Quetzal exist",
        "I'm gonna need way more videos of this smant",
        "Yooo how to Play this game ?",
        "Stereo is built different ",
        "WHERE CAN I GET HIS OR INSTALL THIS ROM",
        "What’s going on with the unlucky run? Will it be posted on YouTube at all? Want part 2 bad",
        "How are they playing this",
        "What is this rom hack called",
        "Why the episode of bye bye butterfree i don’t know how to spell it but why",
        "my humor is hearing \"hows your PP, is your PP okay?\", and then giggling. but this is a very cool mod/gen",
        "The thing I did not like was that they could not use pp if they did I would be more invested",
        "Novias just went to sleep for no reason\nThe yawn the last turn: Am I a joke to you?",
        "The ammount of happiness I get when Smallant uploads a new video is rediculous..\nKeep up the amazing content! <3",
        "684th",
        "What’s the website to the game because I rlly Wana play it with my friend",
        "this was really fun!!",
        "What are soul link rules again? This video didn't have them and Im totally lost.",
        "Always good to see Shady!",
        "WILD GROUDON LMAO",
        "where do i get this? lol",
        "Thats alot of AA batteries stuffed in that Seal.",
        "Oh a challenge that actually is hard! Love it",
        "Jirachi shall be hereby known as the Anteater",
        "Mod it so the chat controls the rival so chat really is the rival",
        "\"Mum says it's mum turn on the pc\"\n\n\"I will pick up the phone right now.\"",
        "i would love to see more",
        "omg it's so cute, I want the plushy but I don't have money:(",
        "Yo smant.. for when you inevitably speedrun scarlet and violet just saw this on reddit.. In Pokémon Scarlet and Violet, you can greatly increase your running speed by connecting a second controller and using both left joysticks at an angle.",
        "So I don't play pokemon at all, but I'm like... 90% sure Groudon is not meant to be one of those pokemon you find in the long grass outside a small child's house",
        "where can we get it :D",
        "I was enjoying until the trade for a dead Drowzee. Kinda seems like cheating which is lame at least do the challenge properly",
        "This makes me miss SoulLinks from Shady so badly. I understand why they’re gone but this brought back that nostalgia for me. \n\nYou two did an amazing job and kept it extremely entertaining the entire time.",
        "Where is the mod?",
        "The PP thing seems kinda lame even for a nuzlocke tho.",
        "Did he just really try to synchronize poison on an Arbok?",
        "Check out TheHunterManX and become a Patreon so we can fund this incredible breakthrough in gba pokemon",
        "I’m sure Scott’s Thoughts approves of your fossil choice  “All hail the dark lord.”",
        "How did the starters go \nTop: bad good middle\nBottom: good bad middle",
        "But why now? With scarlet and violet, which has multiplayer, coming out tomorrow...",
        "8)",
        "Jirachi Vs Stereo was like Neo Vs Agent Smith",
        "Future version of this mod should have 2v1 double battles for gym leaders, elite four, and champion",
        "Kid: Mom, can we get Scarlet and Violet?\nMom: No, we have Scarlet and Violet at home.\nScarlet and Violet at home:",
        "You should do a scarlet and violet challenge. It’s new and it would be a challenge since nobody has a lot of experience with it",
        "This is HIGH quality content ",
        "Wow, i loved shady penguins soul links back in 7th grade and 8th grade, awesome collab to see!",
        "My favorite thing to do in the space stage was to visit alien planets and raise the water level up to max, then lower it again. It wipes all the life off and you can take over freely. You get those terraforming abilities before any of the super offensive abilities. >:O",
        "This is such a cool challenge. We have long since reached a point where normal Nuzlocke is just too easy, even though it was originally meant to be a \"hard mode.\"\n\nStacking the no PP recovery with the rule that you can't use the same type twice in your party, in my opinion, hits a sweetspot in difficulty. It's super duper hard, but feels like it's possible, and that makes it entertaining.",
        "Where is nexr episode with pokemon challenges??",
        "Interesting chat message at 26:03 wonder if they cheated",
        "Shady has some seriously blood curdling screams when his poke dies",
        "was really fun",
        "You don't have to release a your team mates non fate pokemon just be your has. Is you could swap,give pokemon to each other, that a better use of the multiplayer aspects of the game.",
        "Would love for you guys to give this another try!",
        "The only thing that could potentially make this cooler is if all the battles were double battles that you fought together.",
        "Can't wait for pchal to \"review\" this",
        "I really want to know what emulators they use for all of these roms but they almost never list them",
        "I love this collab, ur both so fun to watch",
        "19:33 what a visceral scream",
        "This was intense ",
        "This was amazing to see a group of young men just enjoying spending time together. They have all this money and fame and they just chilling we love it",
        "We need a series of these",
        "Can't wait for Jaiden Animations redo the pokemon silver HeartGold soul link again",
        "Doc pulls through with 2 super long streams with endless entertainment. Gotta love it and respect it  :",
        "You need to do more of this",
        "wow pokemon, haven't seen this in a long time. how many years has it been, is the flim finished??",
        "Editing is uppermost S tier lately man! You’re pushing the content to the next level and we’re all taking notice.",
        "My brother in christ, where is the download link?",
        "can we download this mod I want to play it with my friends???",
        "14:09 \"That's a tough one, Quagsire...\"\n\nMe: Meant say something right now about Quagsire's inferiority",
        "Bro i want to do this with my friends is there a download link for this ROM hack?",
        "Mod hobbyists in their free time have access to technology Nintendo/GameFreak does not possess.",
        "Small ant have you ever thought of if botw2 will still have boomie zoomies?",
        "The microwave one hit deep for some reason  >:O",
        "SMALL ANT TRUST ME PLAY POKEMON PLANET. ITS A MULTIPLAY POKEMON SERVER WITH EVERY POKEMON STORY",
        "Very nice vedio",
        "How dare you invoke bye bye butterfree and ruin my day",
        "@ant, i started watching you about 4 years ago, and also watching shady and nappy 4 years ago.. but this is crazy ive been waiting for this calab",
        "You 2 are truly soul-linked.",
        "Why didn’t you guys just hack in infinite Rare Candies and use level cap for this challenge? To mitigate the grinding issue?",
        "is there a way to download this somewhere? xd",
        "I'm 99% sure SmallAnt has real life plot-armor with all these odds against him and still prevailing",
        "what romhacks are these new ones? player controlled AI multiplayer i wanna play that with friends XD",
        "i gotta admit, as an adult, i still got a chuckle when SmallAnt said “how’s your PP?”",
        "Where can I play it",
        "Pretty soon we will have amazing mirror online co-op i just know it",
        "who made the mod?",
        "How can i play this too ?",
        "\"How's your pp?\"\n\nThe shit they say in this run XDD",
        "I want to play this mod so badly",
        "16:03 ",
        "The \"are you serious right now\" got me dying",
        "This is honestly something I've wanted nintendo to add to pokemon games since black and white but I'm glad this is now possible",
        "I feel like the PP restriction was too much",
        "More mario Odessa vids pls",
        "what happened to the skyblock video",
        "I love shady I've been watching him since I was little and loved his soul links and shadylocks",
        "I would like your video anyway, but hell yeah, shady penguin. Together with zwiggo my favorite pokemon tuber",
        "Very fun",
        "smant u inspierd me to start practicing smo speed runing i no good tho",
        "\"Take the rare candy pill\" - PokémonChallanges",
        "Minecraft Skyblock",
        "lol you encountered sneasel and gligar like that my two favourite mons ever",
        "Spanish speaker here: “Novias” means Girlfriends hahaha it’s so funny to hear them with that pronounciation",
        "Man, I used to watch Shady religiously years ago. Crazy to see him colabing with smant",
        "should give more credit in the actual video to the person who made the mod instead of just saying \"so someone\"",
        "How can we get this mod!!?",
        "Can I get this rom hack link pless",
        "I really don't care but wouldn't you not be able to use the Moltres?  Drowzee died so the one he was linked to would have died which would have killed the Moltres lol.",
        "31:16 pretty much sums up the entire video",
        "Very enjoyable to watch ",
        "17:27 Thank me later",
        "They should make it so that you all whiteout at the same time",
        "Awesome video SmallAnt!!!!!!!!!!!!!!!!!!!!!!!",
        "Smant : \"This is the hardest pokemon challenge\"\n\nLater....",
        "I think this could be interesting and difficult enough without randamizing the pokemon",
        "this is really cool!",
        "You should do this with poke MMO",
        "At the start of the run already a nail biter  another cool vid",
        "Someone start making an animated story of novias coming back from the ashes of a revival herb into moltres",
        "Bad speedrun idea:   Movie 100%:\n\nWatch EVERY SINGLE cutscene in the game ( start from zero)",
        "Ps.... this is Fing entertaining  ",
        "Thank you, Techno, for making my childhood so much better.\n\nRest in Peace, Potato King.",
        "Such a cool idea!",
        "i used to watch  shady religiously during XY/ORAS, it makes me so happy to watch you two play together",
        "can someone give me the download link for this ?",
        "\"I'm not gonna risk the scientist.\"\nRisks the scientist.",
        "My two favorite tubers",
        "watching Tanner is like hanging out with a stepbro who goofs around and cheers you up in dire times",
        "Two grown men discussing their PP. CONTENT",
        "How do I connect to a friend ?",
        "As a person who speaks Spanish, I never thought they would pronounce \"novias\" the way that they did.",
        "Plz keep doing this",
        "Shady looks like Ant's Dad",
        "Can you download this",
        "When I was a kid I thought this was what the game link cable for the gameboy would do.  Me and my brother were so confused when we connected our gameboys together and went to the same town and couldn’t see each other.  It took us a long time to figure out how to use it properly.",
        "They look a lil chubby :)",
        "How is this possible",
        "So how do we get this?",
        "where do i buy this at with 2 players or online sent a link?",
        "The Nuzlocke etiquette of trading a \"dead\" Pokemon for a living Moltres is questionable, to say the least; but the fact that it happened to be a Moltres specifically, an actual Phoenix, with a \"REVIVAL HERB\" in it's inventory... yeah, I think it's fair to keep that, that's like Shiny Clause or something, man. It's too perfect to pass up.",
        "Awesome video",
        "Weird YouTube recommended but good video",
        "This made me realize just how fun gen 9 is gonna be from interacting with friends alone",
        "Sigrun and Baldyr were epic bosses to fight. It was nice to see Kratos have compassion for the wolves too. This game is so fun to watch Sean. It just keeps getting better and better. Cant wait for the next part.",
        "This looks like an AWESOME ROM Hack!!!!! How can I get this?????",
        "Love to see shady on pokemon challenges",
        "OOOOOOO A SOUL LINK LIKE JAIDEN'S BUT WITH NO RANDOMIZER AND SOME MORE NICE",
        "I love how they get to basically have father-daughter time and it's almost adorable seeing them do this. The text is magical and just you know it's Ethan. You know he's protecting her the best he can and it makes it so touching cuz he sees himself in her with how stubborn she is. 8-) :-o",
        "This turned from Grian into the server-verse to Grian no way home",
        "who made it whats it called",
        "This could totally change the perspective on nuzlocke versus! Would love to see that!",
        "I love how Smallant has extremely in-depth knowledge of some aspects of Pokémon and other times he's like \"I thought Gligar was poison type because it was purple\"",
        "Quick to upload this. I'm pagging",
        "Shady penguin looks like he’s gonna tell to get RIIIIIIIIGHT INTO THE NEEWWS!!",
        "crazy",
        "\"HEIGHT LIMIT LETS GOO!!\"\n\nAlso jumped into the void",
        "do this again",
        "Jirachi strikes again.",
        "Happy birthday, tanner",
        "This video was a game of emotions.",
        "My two favorite youtubes made a video together! This is gonna be lit",
        "This would be so cool to have a full playthrough of!",
        "4:33 NPC looks at Smant, then at Shady, then decides to let Smant take his place like a true gentleman, only to join the end of the line when Smant goes to the front. Three cheers for the good guy.",
        "I've been waiting for this for a while. I saw the soul link in the clips channel.",
        "This sounds way better than the old Pokémon mmo projects",
        "Holy shit this dude is loud. Why do most streamers scream all the time? One of the reasons I like SmallAnt is because he doesn't do that.",
        "Is this mod available to the public?",
        "You should change stereo’s name to steroids",
        "I would watch every episode of this Soul Link with you both untill you beat it. Super entertaining collab vid to watch ",
        "So is this 2 player Pokemon thing a public thing or no",
        "What's funny to me is that Scarlett and village will be similar",
        "is it possible to play this yourself",
        "This was awesome tho  don't get me wrong. Great watch",
        "Robots",
        "The corpse drowzee ",
        "Multiplayer pokemon... Game freak would never.",
        "this was so cool! hope to see more of it",
        "Speaking of multiplayer... Does anyone else remember PokéMMO? That was legendary!",
        "I love that this soul link was turned into a video hope to see more like it smallant great job!",
        "I am incredibly disappointed that you didnt pick me",
        "Hey Ant what headset are you using?",
        "Multiplayer? Yall just using each other as trainer shields lmao",
        "So it’s a soul link but in the same game?",
        "THISSSS. I LoVE THIS",
        "i found the download link to the Mod, Since Ant mentioned the creator is TheHunterManX i googled that up and found the github page for the mod",
        "Bro just couldn’t wait 2 days",
        "Shady is my first YouTube sub, it’s good to see him staying strong.",
        "Project polaro on roblox>>>",
        "Please! Another try!",
        "moar",
        "I think rare candies would have been better under these restrictions.",
        "I FORGOT TO TELL YOUTUBE SUBS ABOUT THE PLUSH. IT WAS LIMITED RUN AND NOW ITS ONLY AVAILABLE FOR LIKE 3 DAYS\n\nGO LOOK BEFORE IT IS GONE FOREVER: https://www.makeship.com/products/ant-plush",
        "Can you tell atsign that me, me in particular he is awesome. although you will never read this ever :)",
        "pro rlly speedran his plug “i have a plush go buy 4 days”",
        "This seems impossible",
        "hope there will be more!",
        "Nuzlocke idea: regular nuzlocke, with normal level caps, but all of your pokemon \"won't obey you\" so there's the chance they won't attack, etc",
        "14:11 I actually laughed out loud",
        "Honestly, I wanna see what Pokémon Challenges has to think of the Moltres res",
        "Super fun concept, really hope you guys do it again!",
        "the no PP is very very different, that could be it's own challenge",
        "I reckon the Pokémon should be normal encounters but buffed maybe and why do you have  to kill your team mates equivalent Pokémon  when yours faints.  Didn't like that rule. Should have made it so every trainer has double their Pokémon and make it double battles or something",
        "Is it possible to get this Multiplayer romhack somehow to play with my friend?",
        "I want this right now",
        "Smant and Shady in one video? I didn’t know I needed this!",
        "Who else though this was gonna be a Scarlet/Violet video lmao",
        "Pokémon hide and seek coming?!",
        "I haven’t watched him in years, but it’s good to see Shady’s still around",
        "I honestly respect Andrew now for how professional he acted at that moment.",
        "my question maybe someone could help is, how do i do this with a friend?! I NEED THIS",
        "Is this mod available somewhere public for download?",
        "i see starter pokemons being resold for markup, as there are limited number of starters",
        "He could always try one of the dozen of pokemmos online. Just not sure if youtube TOS allows it",
        "i thought pp was pokemon point",
        "how could i play this i would love to try this challenge with my friends ?",
        "Ant can you plz play Pokémon emerald kaizo?",
        "Looking back on these videos 2 years later after techno has passed it puts a smile on my face on how he truly entertained us all.\n\nWe miss you Techno. Rest in peace. We wish your family is recovering well",
        "My goodness, this is good.",
        "16:02  \nAnt: How's your pee pee\nShady: My pee pee is fine xD",
        "What a beautiful roller coaster of events! Ahaha Fun to see muliplayer Pokemon, and that \"jynx\" trade was the cherry on top!",
        "i was hot on Shady before the nappy controversy he got roped into (for no reason cause his \"friend\" lied to him for 2 year) but it is really good to see he is doing well and is respected again. XOXO Seel",
        "I have a video idea. Pokémon black 2 but all battles are hordes.",
        "is this mod going to be released to the public? i wanna get absolutely eviscerated taglocking with my friends",
        "GameFreak: takes 30 years to add multiplayer\n\nSome guy named Hunter: codes it in a week",
        "The Majora's Mask reference was a nice touch",
        "I wonder if Multiplayer in Scarlet and Violet will be as good as this xD",
        "...mario galaxy minimum spins? ",
        "Unbelievable stream from the one and only Dr. Disrespect! Thank you for providing such incredible moments",
        "that camera uhhhhhh maybe go back to a lower quality",
        "anyone know where to get this rom?",
        "I'm really excited to see other people try this if it goes public!",
        "16:11.\"two grown men discussing their pp\" lmao",
        "( o o )                                                               U",
        "misty: where my togepi Brock? Brock: Uhmmm i fought with a trainer and it died",
        "i think that \"pokemon quetzal\" is a better co-op\n\nsorry, i don't speak English very well xd",
        "I'm just imagining the old man, fully excited to meet his new drowsee after trading his most valuable Pokemon, only to be greeted by a rotting corpse when he unlocks the Pokeball.",
        "This was awesome to watch. Would love to see you finish off the nuzlocke if it hasn't been done already",
        "This video was really cool hope u guys continue this",
        "Nice",
        "16:02 just bros checking up on the bros, so wholesome",
        "Hey, where's your version of the Manhunt you did with CJ?",
        "I love your videos,",
        "PP",
        "How can I play this? Is there a download link?",
        "Two of my favorite Pokémon YouTubers/ streamers in a single video yea it’s going to be a great day",
        "how to play with friend ?",
        "please room link :)",
        "how smallant pls i want to play with my best friend ;u;",
        "If possible, make it so that you automatically fight each other if you step on top of each other, and do a manhunt/nuzlocke. One player has to beat the elite 4, the other has to kill the runners pokemon",
        "damn i want more of this!",
        "This video is just one long PP joke ",
        "Shady!!!",
        "I want to see more of this!",
        "It's honestly crazy how much bad luck both shadypenguin and smallant had. If their luck was a little better, they probably would have gotten further.",
        "you both got rolled lol",
        "wow these young men sure love to shout",
        "Smallant brought shady out of soullink retirement. Legend.",
        "22:44 The foreshadowing",
        "I would watch a 2 hour version of this challenge with these two",
        "So happy for SmallAnt to get a rub from a poketuber powerhouse like Shady. He needs the exposure.",
        "How do u play this game myself",
        "Smant you make everything look so much better I would love to play this but I have no friends ",
        "Oh man I need to have friends...",
        "I'll be honest, I don't think doing this set up with the center not healing pp is possible. Strong moves come with less pp, and the soul link part is unforgiving at best. If you pull this off, that's incredible.",
        "That Magcargo escaped from Blaine’s gym in Pokémon Gold and just swam across the water",
        "Is there a way to download this it look so cool i want to play it with my lil brother",
        "How do you get this rom",
        "Shady experiencing Smant's insane luck firsthand was glorious",
        "E",
        "Please do this again with shady",
        "Anyone know whether we can download this mod to use for ourselves??",
        "The moltress",
        "This was super fun to watch!",
        "Huh, I wonder why the Natu synchronize didn't put the rival Gengar to sleep?",
        "Idea for a video/ stream: \nPlay through a Pokémon game using only not very effective moves to deal damage. Leech seed, poison and will-o-wisp are not allowed unless no move on your team can deal not very effective damage. You cannot heal in battle and you cannot go more than 3 levels over the gym leaders highest level Pokémon. Enjoy!",
        "WHY  EVERYONE is doing challlange like that in fire red/leaf green",
        "bro imagine if this was possible for the newer generation, \nlike you play multiplayer pokemon for black and white and\nor Heartgold, it would be so interesting to watch another soullink for games like that"
    ],
    "comments_disabled": false
}