{"video_id": "UeKxAYVkOHE", "comments": ["I FORGOT TO TELL YOUTUBE SUBS ABOUT THE PLUSH. IT WAS LIMITED RUN AND NOW ITS ONLY AVAILABLE FOR LIKE 3 DAYS\n\nGO LOOK BEFORE IT IS GONE FOREVER: https://www.makeship.com/products/ant-plush", "I love how Smallant has extremely in-depth knowledge of some aspects of Pokémon and other times he's like \"I thought Gligar was poison type because it was purple\"", "The only thing that could potentially make this cooler is if all the battles were double battles that you fought together.", "That dead drowzee trade for a moltres with a revival herb is just lore.", "This was a blast ", "I find it mind blowing how far mods have gone in the last 2 years or so, allowing for online multiplayer in games that never had it. Mad props to the ones who figure this stuff out.\n\nEdit: ok, according to the replies, these have been around for longer than I thought. That doesn't make it any less mind blowing, but I guess it also means we should thank these content creators for giving it publicity. Or it's possible that they did have publicity in the past and I didn't know about it, I haven't been watching YouTube for that long.", "Smant: *Trying to navigate a very difficult battle with a legendary\nShady: \"I took out a Jigglypuff and for some reason I'm very proud about that\"", "This is so cool", "Smant and Shady is an UNREAL pairing. Smash like on this vid we need more of them", "This is so cool, have been watching Shady since I was 14 or 15 (23 now) Have stayed subbed to him all these years but haven't had as much time to watch recently. Saw this on recommend, so glad that another class of kids gets to enjoy his content, and thanks shady for the literal hundreds of hours of enjoyment. shady people for life!", "Sometimes it feel like Ant forgets he’s a YouTuber but then other times he drops amazing videos like this", "Dude, seeing shady hit me right in the feels for some reason. His content was my childhood.", "The no pp recovery is probably the hardest part of the challenge it’s great, i love the energy with you two", "Haven't watched ShadyPenguin since back in the OG Soul Link days, so this was a huge blast of nostalgia", "One of the best things is that he never takes credit for himself when he achieves something. He always respect us, the audience, and his team, and he is always polite in all of his videos. We congratulate ourselves on this achievement. More to come and everything to come =3:)", "I never expected to see a SoulLink Shadylocke with Smant. Good stuff!", "I'm really excited to see other people try this if it goes public!", "This made me realize just how fun gen 9 is gonna be from interacting with friends alone", "watching Tanner is like hanging out with a stepbro who goofs around and cheers you up in dire times", "Not a whole lot of people that originated as a meme go on to remain so successful and get even more popular. It's been a fantastic trip seeing this channel grow more and more, and it never ceases to amaze me how a community can be so cursed and so wholesome at the same time. Doing fantastic work man, keep it up o7 :O", "The whole thing with Novias and Zynx is LITERALLY the coolest, most poetic story moment I've ever seen in a Nuzlocke\nAmazing ", "Oh I watched this live and it was brutal. I loved it and I hope SmallAnt and Shady will return to ace this challenge. I believe with the acquired experience they can ace this.", "This is going to be amazing. The possibilities.", "Goated duo! Shady is an OG and you're a pioneer, what am awesome collaboration every time", "I would watch a 2 hour version of this challenge with these two", "Smallant brought shady out of soullink retirement. Legend.", "The crossover we never knew we needed, been a blast seeing all these collabs between channels from different eras of my life lately.", "i wish i could play this with my friends it looks so cool", "It's honestly crazy how much bad luck both shadypenguin and smallant had. If their luck was a little better, they probably would have gotten further.", "This makes me miss SoulLinks from Shady so badly. I understand why they’re gone but this brought back that nostalgia for me. \n\nYou two did an amazing job and kept it extremely entertaining the entire time.", "Words can’t describe how much I love this collab", "I love shady I've been watching him since I was little and loved his soul links and shadylocks", "It has been years since I saw Shady! Gives me nostalgia", "I wish I could like this a million times, love both of these creators so much", "Really cool mod and a team-up with Shady? This was a great watch and hope you guys come back to this in the future sometime soon.", "Shady experiencing Smant's insane luck firsthand was glorious", "Learning the process for playing this version was invaluable", "SO cool to see Shady in one of these videos! Great video!!", "I just wanted to say thank you, I'm going through a rough time and your content is really helping me out. It's just hard sometimes, you are really helping me out.", "the Shady and Smant combo never fails to get me in my feels", "Smant and Shady in one video? I didn’t know I needed this!", "As someone who started watching right before mc monday this was probably the best summer of my life.  It's so sad to hear that techno has passed, but he really does never die.  With our memories and his amazing videos still here, we can keep him with us.", "Y'all really couldn't wait till Friday for Sc/Vi multiplayer to release \n\n\nIn all seriousness this is actually sick! Love the concept and the execution. Great video.", "Omg did not expect Shady in this video right after the Cagelocke. Can this video get any better after just 10 seconds?", "This is honestly something I've wanted nintendo to add to pokemon games since black and white but I'm glad this is now possible", "Unbelievable stream from the one and only Dr. Disrespect! Thank you for providing such incredible moments", "Shady and Smallant is the team up of the century ️️ love you both!! ", "This was such an emotional and impactful story. The obstacles that the protagonists went trough, the loss of friends and the outstanding character development of Albert all combined into a wonderful experience. I can't wait for the sequel. -d-dev >:-(", "Appreciate the crazy dedication you guys have been showing on this series! =)", "It's so nice to see Shady on your channel! I love this dude! :D", "Thank you for the butterfree edits they were amazing", "Need more Shady and Smallant videos", "Shady is my first YouTube sub, it’s good to see him staying strong.", "as an old viewer of shady its nice to see him getting some revival when it comes to content!\nvery nice video", "God i forgot how much i loved Shadypenguinn this is such a good collab", "Dude this was SO FUN please more of this!", "Speaking of multiplayer... Does anyone else remember PokéMMO? That was legendary!", "What a beautiful roller coaster of events! Ahaha Fun to see muliplayer Pokemon, and that \"jynx\" trade was the cherry on top!", "never thought id get to see shady do a soul link again after the situation. great to see it!", "Super fun concept, really hope you guys do it again!", "Great video Ant, this was so much fun to watch live!", "You better continue this with Jan! This was hilarious and it was clear that you both had fun :D", "Looking back on these videos 2 years later after techno has passed it puts a smile on my face on how he truly entertained us all.\n\nWe miss you Techno. Rest in peace. We wish your family is recovering well", "You guys have great chemistry I’d love to see you play with shady again", "Editing is uppermost S tier lately man! You’re pushing the content to the next level and we’re all taking notice.", "Amazing collab. Amazing editing. Great vid. Butterfree part had me DEAD", "This is exactly how I thought initially the Link Cable should work. Fantastic to see someone made it actually into reality\n\nFantastic video as always Ant!", "I would watch every episode of this Soul Link with you both untill you beat it. Super entertaining collab vid to watch ", "Epic! I was hoping so bad they'd make the real games like this on the switch.", "Super interesting ruleset! Would love to see you two give it a go again ((:", "Hey SmallAnt! Love your videos! I've never seen someone so dedicated and passionate about pokemon", "The ammount of happiness I get when Smallant uploads a new video is rediculous..\nKeep up the amazing content! <3", "Love seeing these two together", "“There’s no guarantees in life”\nWise words Shady, wise words", "I am SO GLAD mick came forward. The gaming industry owes mick a big ass apology", "I love that this soul link was turned into a video hope to see more like it smallant great job!", "This is so fun to watch. Love the team strategy!", "I feel old, watching shady penguin play a soul link for the first time in years", "Two of my favorite Pokémon YouTubers/ streamers in a single video yea it’s going to be a great day", "OMG!! i was waiting for these two to pair up - I'd love to see a complete soul link series with these to!!", "Shady is one of my favorites, used to watch him all the time! Great seeing another collab!", "Please release a tutorial on how to do this it looks like such a fun time!", "I can't tell you how excited I was to see this video pop up in my subscription feed. I came for the Roblox discussion, stayed for the meltdown, and was hit with unexpected feels at the end. Thank you so much for talking about women in the gaming industry. Considering how much of an impact music and especially video game music and video games in general have had on my life, it also hurts me to think about how many hardworking (many pioneers in their field) creators and developers will ultimately not get credit for their work and/or get lost to time. Thank you so much for this incredibly enjoyable video", "it's been so fun seeing ant do more collabs with other YouTubers! it always looks like he has such a fun time hanging out with others and it's introducing me to some very cool channels so thanks ant", "Dude I'm happy you did this cause I grew up watching shady", "So happy to see Shady on here :D", "Smallant: makes a marketable plush\nAlso Smallant: forgets to market it", "28:49 Let's just appreciate how much effort and time she puts in these videos to make our day huge respect!\nIt's unbelievable, and I think they deserve a lot more than that 8) >:-( 8)", "Would be cool if this mod turned every battle into doubles and you got to fight together", "this was so cool! a shame it didnt go further! id love to see more double playthroughs!", "Never do I look forward to an upload more than when it’s Smant", "What a bloody blast from the past having Lui on, we definitely need to see more of him again!!", "This was hype AF, please do more of this! Something about the odds of loss being hung on both parties made this hit harder than usual when you lose something.", "Always enjoy the Pokémon modding videos, or just the normal Pokémon videos in general.", "Shady!!!!!!!!!!!!!!!!!!   Nice to see him continuing to collaborate with other streamers.", "Please do a whole playthrough of this", "I'm just imagining the old man, fully excited to meet his new drowsee after trading his most valuable Pokemon, only to be greeted by a rotting corpse when he unlocks the Pokeball.", "When I was a kid I thought this was what the game link cable for the gameboy would do.  Me and my brother were so confused when we connected our gameboys together and went to the same town and couldn’t see each other.  It took us a long time to figure out how to use it properly.", "ShadyPeguinn and SmallAnt in one video! I love it!", "So happy for shady he gets to work with you again he has deserved this clout for like a decade"]}