{
    "video_id": "VfLxs6kPK5M",
    "comments": [
        "Gamepass day one",
        "The problem with the open with and performance issues was due to the day 1 patch not being out at the time, and people playing hacked versions of the games",
        "@gameexplain Quick Question: If this game wasn't Pokemon, would you guys really give it the score \"Like it alot\"? These performance issues are immersion breaking to a huge degree. The world looks pretty bad and uninteresting. Anyway, love the channel. Keep up the good work.",
        "No excuse for the poor performance in the open world. Especially when you look at games like XC3.",
        "As someone who has never played any pokemon game, all I can say is that this looks incredibly bare bones and the graphics/textures are really ugly.",
        "Is it me, or did I keep seeing a shiny Golduck pop up?",
        "Great review, but in regards to the performance issues did you play this on the version one or with the patch ?",
        "That first game was the best game ever watched",
        "I was worried about performance turning me off, but it seems they did that great with everything else enough for me to make the leap lol",
        "Everyone forgets to give the new the pokedex entry photos and hand-drawn ui (sprites, objects etc) the spotlight they deserve 🫣",
        "How many school uniform costume changes do we get?",
        "The game is broken. It's absurd that Nintendo/Pokémon Company decided to release the game in this state charging full price.\n\nIs the Cyberpunk 2077 situation all over again.",
        "Can't believe you thought the designs for the new Pokémon are good.",
        "Big bummer about the performance issues. Though was pretty expected",
        "A region having multiple champions kind of takes awe out of the title champion, only One super bad ass per country please",
        "That \"I'm free\" quote at the end really hits different after his passing. Rest in peace, Techno. You will be missed dearly.",
        "It's a bit ugly.",
        "Looks and performs like a mobile game ",
        "I feel like treastilizeing is way better than giagantamax, it more interesting. but that's just me. ",
        "Can we just appreciate how much of time and work he spends on making videos to entertain us?",
        "It looks as though Game Freak is quickly becoming Nintendo's Bethesda... XD",
        "It’s upsetting to hear that the gym leader battles don’t scale to the current level; to me why even allow us to battle them in any order in the first place if the levels are predetermined and imply a set order.",
        "Saddens me that Nintendo and Game Freak just can't accept that they need to invest in more powerful tools be it new hardware or game engines. It is becoming a bit of a joke now about how badly the games perform and look in certain areas. Nintendo only gamers may not know what they are missing out on and I'm not even asking for 60FPS or 120FPS modes, but when you also play on PS5 and see how games can run like Horizon FW or God of War Ragnarok then it just makes you think what this game can really be. Gameplay and design choices like the implementation of the open world is subjective and it might be for you or might not be - but a game simply not meeting modern standards of a stable framerate is just inexcusable now.",
        "Big pass for me on this. The performance issues are one thing, but S/V just don't do anything impressive. Legends Arceus was more of a step away from the usual formula. I think I'll wait for the next legends game. Mainline pokemon games just don't do it anynore.",
        "Getting violet",
        "Yall remember when Tim used to body roll when he got a sub/dono? DJ TURN IT UP!",
        "Why Gamefreak Why dont you learn how to manage the framerate!!! Why!!!",
        "I love these games they were awesome ",
        "I just bought the game before this review came out. I shouldve waited. ",
        "Is it just me or do the graphics look rougher than PLA?",
        "Bruh...since you did like this game. It has a lot of issues and the game sucks as hell.",
        "Played it on Emulator a week before and I thought the issues where Emulated related. Played it today on real hardware and boy oh boy I considering getting a refund.",
        "Oof, gamefreak what’s goin on with your optimization there buddy?",
        "Sick of the furry pokemon",
        "\"it's the largest world of pokemon world, and yet the most emptiest\"",
        "Do you play on regular switch or the portable switch with out removable handles",
        "Time to release a more powerful console Nintendo",
        "\"Liked a lot\"",
        "Eh considering this is the first true open world Pokémon bugs are a given considering this is a journey for the developers and players and I for one can’t wait to start my new journey November 30th\n11/19/22 Edit: updated opinion upon checking with a trusted gaming news channel 24 hours after release I will be keeping a more analytical eye on the state of this game and it’s graphical stability due to a chilling feeling of déjà vu",
        "But ur gameplay review is before day 1 patch correct",
        "Reviews are getting worse and worse, this is obviously not a pc so why waste time mentioning the obvious \n\n\nIs it works of art that people spend their time on so why the hell did you spend like this whole review complaining about things that we never had another games",
        "Three years since Sword and Shield. The textures and animations still look so terrible. Still no full dex or voice acting. \nTo think three years ago some fans were optimistic GameFreak would fix the games with patches post release. ",
        "good vid but i feel your threshold for \"good\" is far far far too low for what pokemon should be by now....\n\nhave decided to buy violet a month ago but my expectations have been HEAVILY tempered",
        "Pokemon scarlet more like Sonic Unleashed",
        "Ign is gonna give it a 5/10",
        "you caught your lead Pokemon in a great ball. if you change your lead Pokemon the ball in the entryway will change to whatever you caught it in. if I had to guess, it may relate to how they spawn your Pokemon for the \"lets go\" feature since you can't use that feature inside building",
        "The speed lines on a literal rock at 12:56 cracks me up.",
        "I really wish nintendo would step in and get this to run better. This is a really bad look for pokemon and Nintendo. Like who signed off on this performance?",
        "It's probably just bad luck in your game that you're experiencing those issues because mostly everyone else who has played it didn't complain as much as you have. Hopefully they will have updates to fix said bug issues.",
        "I'll give the game another try today, but last night I was disappointed by how slow the movement of the game was that I nodded off. Granted, I was tired, so hopefully that feeling doesn't remain when I play the game later today. But even when I figured out how to run/jog, the movement speed seemed a tad slow to me.",
        "Gurl you nerds played the old version, mine works fine, you're just haters",
        "It’s 2022, time for GF to get it together! Next main game which will probably be on the next main console needs better graphics and performance. But can’t wait to play as well.",
        "Do they test/play their own game before they release it.....? Or do they just say F it, they can deal with 15 fps in the year 2022.....??? Unbelievable...",
        "Theres also a 1 gig day one patch, so.",
        "Dammmn. What happened between SV and LofA.... This is a bit rough GameFreak...",
        "Yea, the technical issues I was completely expecting. The Legends game preformed better then this and could handle more Pokémon on screen. It could be because there are more assets to load in S & V then there was in legends. In regards to that Great Ball spawning in when you walk in a building, it is more likely a reference point for the developers to know where the player would spawn in when the room loads. Usually those kind of things are hidden from the player, but if you see it happening on a regular basis, that means the dev team overlooked quite the glaring detail ",
        "The game seems almost perfect. I’m just hoping for them to fix the performance issues in later updates. Mainly just so everyone will stop trashing the game because of it. Guys. Graphics. Don’t. Make. A. Game. Sure, I wish they were better, but it doesn’t put the game off for me. They’ll release some sort of patch eventually.",
        "For me the game is unplayable… it’s to laggy… gives the feeling of walking with 50 pounds on your back, the character is heavy. Not to mention moving the camera is choppier and stuttering. Sad but true ",
        "framerate switch",
        "This is the first pokemon game i'm going to watch someone play online and not buy myself.",
        "oh no...somekind of reminded me of cyberpunk with the performance issues....",
        "The Assassins Creed Unity of Pokemon! lol",
        "Very informative",
        "I WAS SCARED OF THE EAR ONE THANK'S FORRR THAAAT!!!!",
        "I love the game if u expected it to run like a game on ps5 that’s your fault this game is amazing they did everything correct it’s completely immersive and addicting I’ve had 0 performance issues with my oled but I also always play handleheld literally every game besides mario party has performance issues when played docked ",
        "Billion dollar company and yet they make games that look like ps2 graphics and can't even get a stable 30 fps on it. But yeah it's Pokemon so nobody cares and will still sell 20+ million copies.",
        "Worst Generation",
        "The reset your view behind the player button is L.",
        "I will miss not having the ability to chuck pokeballs, outside of battles, to catch Pokemon.",
        "I feel like the review could have taken a moment to mention that *there is no clothing option other than the four uniforms*, because GameXplain, you said, and I quote: \"Outside of academy uniforms, there is a ton of clothing customization, it seems like the most than any pokemon game so far. Players can purchase and wear different *shirts*, shoes, gloves, hats, socks, backpacks, and even different phone cases. \" As it turns out, no you cannot wear a different shirt, or anything outside of the 4 uniforms. Every pokemon game (that had customization at all) since X/Y back in 2013 (which means, all of them except OR/AS) had real clothing customization. This is a massive downgrade that will not be obvious until after you've bought the game. Buyers deserve to be informed before they make a purchase, that's what the review is supposed to be for.",
        "looks like a gamecube port that runs like flaming garbage   we should just not buy it so the developer learns to not release crap games every 7 months",
        "So Nemona is more of a mentor than a rival... noted.",
        "Ive been a massive pokemon fan in my youth. I remember when my dad bought pokemon heartgold and together with the DS. That was my happiest moment as child. Sadly, pops passed away and I never had the chance to buy pokemon again due to financial struggles as someone who works minimum job. Still happy that my cousin gave me his switch lite to play free to play games now and then. I'll be buying switch games when times get ease. Miss you pops, and thank you for the childhood memory that i will never forget...",
        "LOOKS BEAUTIFUL! But please fix the FPS GameFreak!! ",
        "This is utterly pathetic from this company.",
        "Which version did you play 1.0.0 or 1.0.1? Which switch did you use?",
        "Aight bet. Play in portable mode til patch",
        "Because I'm happy\nClap along if you feel like happiness is the truth .\nI love these games already",
        "GF straight up charging full price for an unoptimized beta lol",
        "I can't wait to get these games question do the version of the game you got come with the day 1 patch or no?",
        "After you said rightfully intimidating in regards to the league I got a Sonic Frontiers ad that just made me think omg imagine if this game also had metalcore boss music lol",
        "Will only buy IF they patch out the performance issues. I don't think the gamecube graphics are going anywhere though...",
        "How are we getting a game that looks this terrible visually in 2022 ",
        "After watching several reviews today, the pop in and frame rate issues are pretty distracting. While I get the Switch is aging and we seriously need a Pro model to bump up those framerates and load ins (Hyrule Warriors needed it way before now!), Game Freak are once again sadly showing their budget and staffing doesn't match the quality and depth the franchise should be getting as the biggest in the world. Sonic Forces can make excuses as lower down the ladder in profits and sales, Pokemon simply can not...",
        "The cat will stand",
        "Ima skip this one again ",
        "it literally looks worse than swsh and LA WTAF",
        "6:33 simp to the rescue, no one cares about a friendly rival, we want a rival that talks trash and is actually good at Pokémon battles like Blue.",
        "17:55 \"Strangely enough, the performance issues are less prevalent in handheld mode\".....You're kidding right? This has been a running theme with Switch games since the system released. Performance has traditionally been better in handheld mode, likely due to the Switch's CPU clock speeds staying the same regardless of whether you're handheld or docked and the memory clock not being increased enough when docked. It'd be stranger if performance was the ",
        "Imagine pokemon on the ps5 and series x performance",
        "The way u speak of nemoa reminds me of Bianca and Hugh",
        "The transition from the Pixar lamp to the boat train, that was incredible",
        "Are you guys playing on the first version 1.0.0?",
        "Just so everyone knows the day one patch came out days ago so every reviewer has played with it installed. This is the performance after the day one patch. It was even worse before",
        "Press the L button to reset your camera angle. 4:05",
        "It is a tradition in the Paldean region to leave a Pokeball at the door... to ward off VAMPIRES!",
        "I am going to wait til a patch comes out... which sucks",
        "Sorry to ask but… Is there anything to actually do when you’re exploring? Besides catch and battle Pokémon? Open world sounds great on paper, but I don’t see the appeal if there aren’t reasons to actually explore the world except to hit the main objectives.",
        "Nice",
        "Note\n\nU can also refill ur terra orb by touching the raid crystal (u don’t need to enter the raid)",
        "As much as I would like to play this I can't for the life of me in 2022 play something with sub par performance",
        "Tris over here showing off their shiny Golduck.",
        "Yeah I was going to grab day one but I will wait for them to iron out the bugs and hopefully have a more polished experience in 6 months or so",
        "I don't know they didn't ask Nintendo or Monolith Soft for help... Game Freak is hurting their reputation.",
        "So they never explained what coop will be like?",
        "Great….everyone favorite fear  ",
        "Definitely not getting it like it this… I’ll wait for a patch though my hopes are low…",
        "this game is a tragedy. 9/10 game with 1/10 performance",
        "I really hope we get a patch to fix the performance issues. I really hope GameFreak smooths out their optimization in the future.",
        "First!",
        "Hi Tris great review. I will be getting this tomorrow",
        "Genuinely don't know how Pokemon is the only franchise on the switch that hasn't figured out how to optimize their games for a somewhat stable performance.\n\nIt looks like it runs worse or just as bad as Rune Factory 5, and that was made by a small dev team.",
        "there is going to be a day one patch fixing alot of the performance issues",
        "Still looks pretty boring.",
        "Catch ‘em all at 4fps",
        "Looks like a generation I’ll be skipping. My last Pokémon game I bought was sword.",
        "Something that people should know is that while yes the performance could be better it's not anywhere near as bad as people are saying it is. I've had my game slow down slightly but only for a few seconds and never anything too bad. That also being said pop in and terrible animations in background characters are very noticeable. People are complaining as much as they are because it's gamefreak/pokemon.",
        "The only issue I find with the whole Gyms having freedom of choice, what’s the point of challenging the “final or hardest” gym first cause once you beat them the game is just easy since they don’t scale to your lvl right?",
        "probably the worse part of S/V is deff how the online battle timer's still 20 minutes just like in bdsp and sword and shield.\nthat literally just kills players who want to play competitive 6v6. I've no doubt everyone will complain about this, unless they've just accepted it, which is actually really sad, cuz that really needs to be changed back to 60 mins.",
        "The switch is absolutely adequate. If it can handle BOTW and a stripped back witcher 3, it should be able to handle a blocky effort like this. I mean...it doesn't look too different from Ape Escape 2 on PS2. Just a terrible terrible company regurgitating and empty, unambitios and predictable title again and again. ",
        "this intro is going to give someone a seizure i think",
        "Thank god I’m a competitive player and I don’t have to worry about anything in game.",
        "Game freak needs to figure out their issues with working on Nintendo hardware….",
        "That microwave one is just too real, I really felt it when it went mmmmmmmmmmmmBbmmbmbmbmmmmbbmmmmmmmmm DING",
        "I really wanted to love this and it does look fun, but the performance issues are just too hard to ignore. A few issues here and there is forgivable, but from the footage I’ve seen it looks really distracting. There’s just no excuses for it anymore. So disappointing.",
        "I can't wait to be playing these games tonight at midnight.",
        "Let's just blame alot of the optimization issues on the console. I'm sure pokemon would shine hard af on any other console",
        "It's time ",
        "I like the game a lot besides the performance issues. I’ve been playing Scarlett for 2 days and Im having wayyy more fun than I did with legends. Not saying legends wasn’t good, it just wasn’t for me.",
        "I recently finished Metroid Prime. That game is 20 years old and looks better than this.",
        "at 4:00, you mentioned the lack of reset view button, isn't the \"L\" button reset your view?",
        "Is the first gen starters in this game. I want charmander and bulbasaur",
        "Not loving it but in the end still liking it a lot, thats the whole problem people keep giving this good ratings despite of the laziness of GameFreaks, if we keep doing that, they will never step up there game.",
        "I honestly wish they could let us have the ability to jump while playing as the trainer. It just feels weird being restricted with no ability to even have a tiny jumping possibility. Hopfully the next game will have it...",
        "If bugs and glitches that are very likely to be fixed in updates are the biggest issues, then im not worried ^_^",
        "I can't take this review seriously after he said the new designs are great. Every single new pokemon sucks",
        "Yoo",
        "disgustingly bad they need to abandon this garbage engine they are using its at most worth 30 bucks",
        "I really miss 2d Pokémon games I really wish they didn’t abandon them completely should’ve went the route Zelda went by making both types. They could’ve made some super pretty 2d Pokémon games with the tech they have now compared to the bland play dough looking 3d games",
        "The great ball is probably a programming thing to indicate where the entrance of a building is for you to spawn on.. but it shouldn't be visible if so",
        "Intro too good",
        "temtem exists, don't settle for less\ndon't get this game\njust more half steps, not worth it",
        "Im kinda disappointed as to how many Performance issues there seem to be. Everything else in the game looks great though im excited to get my copy!",
        "I'm not sure why they don't make the style of graphics cel shaded like the cartoon. I feel like it would be easier to do that style and hide blemishes and keep performance up.",
        "I hate map and mini map.  They really need to put fix rotation on the mini map.",
        "They should just make one huge game with every gen Pokémon",
        "Game freak needs to grow up and make a game like Pokken graphics with mechanics from BOTW or RDR2.",
        "When a day 1 patched game still feels like an alpha release. Even matches the previews where the game still were janky and had bad performance",
        "Impossible impossible impossible",
        "Yea we’re kinda due for a switch pro now",
        "I dont think gym badges matter in terms of catching pokemon, but maybe how disciplined they are like ignoring orders, I caught a lvl 39 pokemon when my highest was 34 at the time and only had 2 badges.",
        "Can player character walk barefoot?",
        "It’s almost like Gamefreak is physically incapable of polishing a game in the time they are given to make it and that fact will never change as long as the games keep selling.",
        "Even though it may be a bit on the choppy side sometimes, it’s not going to bother me. I can look past it to enjoy what I know will be my game of the year. A patch or two would be good though. I know it can do better.",
        "Performance Issues really don’t seem like too big a deal… well, at all, really. It’s a Pokémon game, it’s not like you’ll be making precise maneuvers or forced to have quick reactions, it’s an RPG, after all.\n\nPlus, they’ll likely polish the game up more and fix bugs, especially with a Day One Update.",
        "Well than, thanks to the open world stuff, lack of proper scaling and STILL missing ingame support for challenge runs... this will be the first Pokemon game I am not going to buy !",
        "I need to ask because this video confuses me: Can you create an older avatar? I thought you only have the option to play as the pre-schooler from the trailers, but here in the video the avatar looks much taller. Can someone explain? Thx.",
        "Gamefreak is a disaster. It’s such a shame that they don’t dedicate the care and resources to fixing their performance issues. This is the flagship product in the most valuable franchise in the world.",
        "Pokemon Scarlet and Violet looks good on the surface, like most Pokemon past Titles, however it doesn't really appeal to me atm . Might see if they have a demo first before purchasing on day 1",
        "This is the 3rd large scale Pokemon game on consoles. You would’ve thought they had the optimization issues figured out by now. It’s almost as if they didn’t even care to play test the games enough before a release. Hoping they can patch the issues. Still looking forward to playing through the game.",
        "The gen already needs its remakes ",
        "I’m hoping next Pokémon game will look more like Sword and Shield in terms of art style. And they fix all the performance problems",
        "Pokemon Bethesda edition",
        "Let’s keep in mind he played beta version of the game. 1.1.1 update will be available to play on the 18th.",
        "This game will probably play better on PC when it gets hacked over to it.",
        "The randome Greateball spawning im every doorway is the kind of funny randome glitch i love xD like ... How !?",
        "Nintendo really needs a new console.. its getting hard to look at these games. they look worse than mobile",
        "Yo Nogla, the guy that made the one backrooms game (the one with that party area that you guys were stuck on with wildcat) it’s being updated with new levels and some redesigns. It seems like you might enjoy a 2nd go round with it, but I dunno, it’s up to you guys.",
        "Imagine setting an picnic on a flamable place with the “this is fine” meme ",
        "It’s sad that Gamefreak can’t do things right the first time around, especially given how huge Pokémon is, it’s really hard to imagine that they missed all of these game bugs, it’ll all get fixed hopefully pretty soon with game patches, although they shouldn’t have to patch as much as they do, but the games still look really amazing, and I am very excited to play these games at the midnight release tonight.",
        "That wasnt a punt it was a kickoff",
        "There is a camera rest button",
        "I wonder what dlc be like what there did in Pokémon sword shield  I hope there have the anime for Pokémon Scarlet and Violet",
        "Nice and thoughtful Review.  \n\nBut yea, while I love this game and the sheer delight many of its explorative moments can bring - I am a little embarassed by its Performance quite a lot of the times as I'm playing through it and need to chill to some of the Great music to make me forget about it lol.",
        "The graphics/design/performance are a total deal breaker for me. I'm sure the open world concept is better but I'm gonna wait for a new switch and hope the next pokemon runs and looks better.",
        "It is important for many reviews to seriously address the performance issues. GameFreak seriously needs to take action in releasing a performance fix patch. \n\nI know they have a reputation of not listening to their audiences and I used to believe that. ",
        "29 on trending on a dying channel lol",
        "Nope. Can't do it. Can't get on board with a motorcycle pokemon. They crossed the line.",
        "After playing Xenoblade 3 I don’t think it’s fair to blame the switch for these performance issues even breath of the wild. This is a game, freak issue.",
        "I am starting to think if this game had no performance issues we’d probably be looking at an average review score of like 86 it feels",
        "@4:00 If you tap/hold the L button it centers the camera behind you just FYI",
        "I spy a shiny Golduck. Nice subtle flex.",
        "These games are open world but not true open world because true open world Pokemon game would have every region and every single pokemon in 1 game so all 9+ regions so yes it may be open world but it is not yet true open world",
        "4:04 there is in fact a button to auto put camera behind the player. Its the L button/bumper.\n\nLmao error 4:04 and L",
        "I wish it didn’t look so ugly. The performance issues are unacceptable",
        "RUN IT THROUGH SYSTEM MEMORY, NOT SD CARD!!\nI'ts weird but it makes it way smoother, idk why it just does",
        "Did they even play it, no reset your view button…it’s mapped to L.",
        "Plus Nemona is hot",
        "Why you gave a good score if CLEARLY this isn't a good game...",
        "Lmfao “I had a blast and couldn’t put the game down.” “I was so close to loving scarlet and violet. But I don’t”\n\nWhat?",
        "Here's to hoping they fix performance issues like Nintendo did with Xenoblade 2\n\nPokemon swsh didnt have any real performance issues outside of the wild area when online.",
        "Perhaps the real pokemon were the crappy one off mechanics we met along the way.",
        "Its so weird to have multiple masters in the same region.\nNot even having special fields i find it quite like a participation title.\n\"Here you go. You beat one of the best. You are now one of the best. So technically its like the league was enough and those who beat them make an own league that gets bigger than the 1st one to get into the 2nd. Like huh?",
        "The worst thing is taking away being able to freely catch Pokemon in a Pokemon game, I don't understand that kind of stupid. Best thing that happened to Pokemon in many, many years and makes all the sense and they didn't even put it in this game. No freely catch Pokemon in a game where you catch Pokemon.",
        "Of course, a generic world with bad performance, but its pokemon am i right?",
        "This game looks legit worse than games from around 2007...way worse.",
        "I love how Markiplier went from an awkward, shy nerdy guy to an awkward, shy nerdy guy that's hot enough to make steel boil. He didn't let his glow up affect his personality outside of maybe being a tad more confident. Dude is a beacon of positivity and integrity. =(",
        "did you play with the day 1 patch",
        "I just dont like most of the new pokemon. They dont seem organic to the world of pokemon itself. Innovation gone wrong?",
        "Will you still be able to control pokemon you caught at a lower level example level 50 starter before you have the first badge",
        "All the performance issues is more of a reason why Nintendo needs to make a new switch model that can handle the increasingly expansive games releasing this year and beyond. If this game performs sub par how do you think Tears of the Kingdom will perform? Cmon Nintendo!",
        "Yeah was expecting performance issues this happened in Gen 8",
        "lol i didn't get a chance to play it yet now he make me don't wanna  play it",
        "You really need to work on sounding natural in your reviews. This is rough sounding",
        "Can't believe we've gone from xenoblade 3 which looks great and runs perfectly to this state of bad performance.",
        "When I read the title, I was like wtf, it hasn’t even come out yet?!?",
        "I'll wait on this game till the performance gets patched, or hell it might play better on a emulator whenever they get it running on that.",
        "I just heard there are not even sidequests in this game. How do you make an open world game and don't include any side quests at all?",
        "does the Elite Four return?",
        "I didn't know there were upgrade options. I just barely made jumps to get to areas I wanted to go to. XD",
        "Looks eons better than sword and shield at their launches",
        "How much of your playthrough/footage captured was done before the 1.0.1 patch was available if any?\n\nEDIT: I asked Tris on Twitter and they said most of it was with the patch.",
        "It's not like this is a small indie developer that no one has heard of. Shame on you game freak. What a let down.",
        "No matter how shitty they look and play, we should just be glad that they’re better than sword and shield. F those games.",
        "Would love to see a comparison video of how quickly you can catch 3 Pokémon in Legends compared to this game",
        "Is there still no toggle for the exp. all? If there ain't I'm not getting this game and never will because of that!",
        "Skyrim still looks better even though it was made ages ago. Gamefreak needs to improve or outsource Pokémon.",
        "Why is there no animation for throwing out a pokemon, arceus had a great animation for throwing out pokemon as well as good performance so I don't know what happened",
        "Not gonna support this. Make a gen5 remake and i might come back",
        "They like to hire graduates straight out of college for some reason\nThey need experienced people working there",
        "Massively disappointed with the Pokemon designs. Truly the worst in the franchise so far. Not only uninspired, but ugly, incoherent and simply bad.",
        "How is everyone getting this game early? I don't get mine till tomorrow =[",
        "I set my system to 720p as there is no major difference between 720-1080p in this game, it doesn't completely remove the issues... But it makes it much smoother at least",
        "I find it weird that there isn't any puzzle solving using your Pokemon's type or abilities in an open world version of the game. Like an ice Pokémon that can freeze objects or water or use your fire Pokémon to burn rope to release a platform or an electric one that can either add or take away charge or power from machines or lights to reveal areas. Seems like you could do that on a fairly basic level like it's not even that far from something like the Lego games where each character has an ability that can be used to solve puzzles but the potential to do that with Pokémon could be amazing.",
        "I can already hear the fan of my switch",
        "Honestly, if the game's going to have any predominant flaws, it could do a lot worse than assorted instances of lag in docked mode. It sounds like the kind of lag that, while not necessarily pleasant to look at, doesn't make the game outright unplayable. Lag is a much worse issue in live online multiplayer because that's where it makes games outright unplayable, or if it takes a whole minute to load what's five feet in front of your character, and if that's what's happening, then yes, those evil people at Game Freak that regularly commit the unforgivable sin of physically and psychologically harming longtime Pokemon fans by having a budget to make their games with on the Nintendo Switch need to step it up. As far as I'm concerned, however, with everything else you loved about the game, lag's not too different of a criticism from \"too much water,\" and for all intents and purposes, you gave Pokemon Scarlet and Violet a perfect score.",
        "this is what i'm saying... lol despite a lot of issues a nintendo exclusive is guaranteed a good score.. and gowr got a \"mixed\" rating.. and the only mixed rating from any reviewer from this site..",
        "It’s weird, apparently GameFreak made it so the WHOLE MAP is loaded while you are anywhere in the game, it cannot unload, this causes these issues, if you don’t know, in open world games—they make it so the game’s map unloads and loads as you make your way through it, otherwise the lag will be abysmal, since the lag is so bad, I believe GameFreak might have to step up and fix this. It’d be funny if they actually forgot to do this because wow",
        "Oh man I am so excited to see my shadows fade in and out of existence that's gonna be funny lmao, I'm definitely getting the game",
        "Another thing i haven't seen people mentioning is that, despite the customization being advertised as one of the games' strongest points, it seems like you only get 4 uniform through the entire game... It's even worst than BDSP's customization.",
        "I don't much with Terastalization, but it sure looks nice.",
        "Really disappointed to hear no level scaling for the gyms\n\nHow hard is it to set completion flags? I really dislike the idea that it's supposed to be our own adventure, but if we want to go rogue then it feels like we aren't supposed to/being punished for it",
        "H I G H  Q U A L I T Y  A N I M A T I O N S",
        "A lot of these issues will be fixed with a patch or 2",
        "Is this performance on base switch, or OLED?",
        "People need to stop acting like the performance issues are due to the Switch.  The legend of zelda breath of the wild, Xenoblade Chronicles 3, Dragon quest XI and Starfox: starlink battle for atlas are all open world games that look and run smoothly on the Switch.  The reason why this game underperforms is because game freak still isn't used to working on console games...... They honestly need to outsource to Namco.",
        "I'm glad they released this game now because the amount of hate they're going to get might just be what they need to make a decent game.",
        "All I know is Gen 10 needs to have the option to travel to different regions and allow you to amass a huge Pokédex and badges",
        "As big as a franchise Pokémon is… you’d expect a lot bigger game. This looks like an indie title. Almost like a flash game.",
        "In regards to not being able to reset your view behind the player. Doesn't 'R' stick click do exactly this?",
        "does the review include the day1patch nintendo pushed?",
        "Why didnt Nintendo/Gamefreak enlist the help from Monolith to optimize the open-world’s performance?",
        "I prefer the old style, the 3d style is not working as well as it could, or perhaps it never should.",
        "I heard about a day one patch. Did you have that update?",
        "I lol’d at that great ball",
        "Can you rebattle the trainers you find in the world ?",
        "I find it funny that pokemon has technical issues and people are giving it a 7,meanwhile cyberpunk 2077 was literally broken and was scored a perfect 10 by everyone.this is the hypocrisy of the gaming industry.",
        "So basically if they fix the bugs this game would be one of the best Pokémon games so far?",
        "I have no issue with the core gameplay with the game (outside of no level scaling). The performance is the thing that’s really embarrassing about this game. You can’t tell me they made the game look and work like this after BOTW came out 5 years ago on the same system",
        "Im really hoping this is the best game in the post-renaissance era Pokemon and a turnabout for the series, and to that end I can already tell the game is better than SwSh at least and I will always be a little bit happy to see things improve instead of continuing to become worse, but to be fair that is already a pretty low hanging fruit. With all the reoccurring steps backwards like EXP.Share, Trainer Customization, Online systems, and quite embarrassingly, performance, I hope that the steps forward, few and far between, are hefty enough to make the difference.",
        "I'm going to wait to see if patches are released but what is the history of Gamefreak releasing updates?",
        "It seems like the devs overused copy/paste in this game. Every NPC and every building looks exactly the same. Every mission is exactly the same. Looks like a 2/10 pokemon game.",
        "Another rigged review.",
        "If game freak was having trouble creating a stable game engine i wish they would just ask Nintendo or monolith software for assistance...... -_-",
        "beginning of game was agonizing with all the talking, you talk for 3 hrs, game allows you to take 5 very slow steps then talk again for 3 more hrs. i hate the whole school setting. you can hardly see the pokemon in the field they’re so small. then after literally an hr of nonsense the game finally gives you that motorcycle pokemon and it doesn’t go much faster than running. all the new pokemon are really uninteresting. battle mechanics are a downgrade from arceus. pretty much hate all the characters. pokemon centers look like gas stations. this game sucks.",
        "Honestly considering how successful these games are... Looks so bad. Think about if other RPGS came out looking like this",
        "You lost me at \"so many amazing new designs\"",
        "so all in all the game is an unpolished trash. people DONT BUY IT NOW. wait a year for them to fix it .",
        "I can’t believe people are bashing Sonic Frontiers Performance issues, when this game seems to have it way worse.",
        "Hello",
        "Why in the world aren't the gyms programmed to have dynamic levels? That seem like such an obvious self-inflicted injury. This and the performance issues make the games a huge turnoff.",
        "Sounds like what the switch is capable of graphically and performance wise is starting to get outstripped by what is considered standard for AAA games. Not the first game this year where being on Switch has hurt it performance wise.",
        "A machine with power to move breath of the wild or odissey can do better than that.. lazzy programation (and it is just a Arceus 2.0) is sad the see a game like this one on 2022.",
        "No national dex  no point",
        "Wait, the game performs worst docked? That's surprising. I guess the increased resolution is the threshold for the performance issues.",
        "Thank you Tris for the review! looking forward to playing the game myself",
        "●Poor framerates \n●Bad textures\n●Non-enterable buildings\n●only ~400/over 1000 total Pokemon are in the game",
        "I call upon Nintendo to do the altruistic thing and find a new developer before I send a scathing letter to GameFreak in which I call them all bad words",
        "The game looks really interesting. I'm just gonna wait for either a patch or a discount. I ain't paying full price for its current state.",
        "I really hope they fix the silly bugs which shouldnt be there in the year 2022!!!\nEven old games havent sucht bad bugs.",
        "I'd sooner they spend an extra year or two perfecting the game, fixing performance issues and ADDING MORE POKEMON than have this unfinished mess of a game! No doubt there will be dlcs as well like sw/sh. Just another cash grab.",
        "Great review!\nHow long is the ”vicotry road” path? :)",
        "The game graphics are really bad.. Just as i figured from the trailer.. Such a let down and a step backwards for pokemon games.",
        "However, the game still offers the same as before... Battling, collecting items/Pokémon and that's it. The lack of things to do in the open world is disappointing. No puzzles to solve, or actual dynamic interactions between Pokémon in the wild... The game feels disconnected at times until you reach Area Zero which is probably the best portion of this game. The world isn't empty in terms of assets and Pokémon models, but still lacking actual things to do other than what we've been doing for years now... The raids become repetitive, and there's actually nothing new to do in the overworld...",
        "Eh enough people said it's pretty good. I'll get this when I'm not broke.",
        "The Association to Investigate China Organ Transplantation held three seminars in Nara, Yokohama, and Tokyo from October 20 to 24, 2022. Canadian human rights lawyer David Matas was invited to speak at the seminars. Mr. Matas explained in detail the current situation of the Chinese Communist Party’s (CCP) organ harvesting from living people, prisoners of conscience incarcerated for their beliefs.",
        "With the weak hardware of the switch and the incompetent development at GF. You get a PowerPoint slideshow. \nTaDaa!!!",
        "Looks like step in the right direction for the franchise even if it's fair bit unpolished.",
        "Great review thanks buddy",
        "Even as a huge Pokémon fan I really can’t defend the performance issues. No one expected them to do another Pokémon game this year they easily could have pushed this another few months to a year even and most people would be fine with it. And the excuse of merch and anime doesn’t really work cause the plush’s have been out for months online and the tcg  does not come out til next year. The only reason I think they will even attempt to fix the performance issues is because it’s supposed to be the VGC game for the next few years.",
        "Ayy noice",
        "Pokemon battles downgraded compared to legend arceus. Contact moves lost the contact part returning to the previous sloppy animations. This should have been mentioned. As usual for pokemon 2 steps forward and one back.",
        "they shouldve gave it ONE more year of development",
        "Would this also be a good Pokemon game if let's say that this was your first one?",
        "\"in depth\".. so can you give any information that matters for competitive? is the breeding as good and accessable as it was in s&s? can you get all the items (stat and nature changes and so on) easily in the game in some sort of tower like in s&s?",
        "How does a PSP game, Final Fantasy Type 0 HD, look better than this game.",
        "I can’t justify a $60 purchase with this level of jank. Pokémon games shouldn’t be “expected” to have performance problems. They need to do better.",
        "With all of these performance issues, I have to ask...\n\nIs the game even finished? This feels like another Sonic Colors Ultimate issue, minus the seizures.",
        "Anything on local co-op? Can you play the campaign together?",
        "Before I watch, does anyone know if this contains spoilers? I don't care about plot, but if it has Evo spoilers, I would like to know first.",
        "i think Egoraptor says it best about Legend of Zelda: A Link to the Past:\n\n\n\nWhy do you give me this world to explore and have a good time in...and then you tell me to do these super-specific things?! You don't throw a six-year-old into a sandbox and say...\"Hey, you can only make poopy castles.\" You know when you take wet sand, and you just let it drip on top of a pile of sand? It's a poopy castle. I mean, exploration still exists in Link to the Past,",
        "Looks like I’m right to wait for 2 patches / updates to play this",
        "It's a real shame/disappointed that some of my favourite Pokemon like :\n\n\nFire Type: Vulpix, Ninetales, Ponyta and Rapidash.\n\nWater Type: Milotic, Lapras, Lanturn, Starmie, Sharpedo, Goldeen and Seasking.",
        "graphics is terrible",
        "unplayable... i softlocked in the first 30 mins of play. super glitchy",
        "gamefreak about to get ate up for the performance problems",
        "And this is yet again why I've been saying this is why we needed a switch pro, for technical issues that the current switch just can't handle. But nope everyone in the industry just keeps harping on how much sales the switch has so why would they need a new one,  as if sales correlates to why we shouldn't have a better performing switch ",
        "11:43 And Mega Evolutions",
        "\"You can't reset the camera.\" BRO, EVER HEARD OF THE FUCKING L BUTTON???",
        "Auto batteling sounds terrible to be, I'll have to see how it feels in game",
        "Game looks like crap.",
        "Thank you for the honesty, Triss, saying the good things AND the bad things.",
        "This is proof the switch needs upgrade in hardware . It's dated at this point.  But I still think I'll be a good game.  People don't play pokemon for graphics",
        "It’s disappointing that it’s not perfect, because I was really hoping it would be this time, but I’m still thrilled to jump in. Too bad my copy has been delayed.",
        "Did you know that Pokémon was created by Satoshi Tajiri’s obsession of bugs?\n\nFunny that now we have this game full of bugs, huh?",
        "Don't blame the hardware. Just look at the other games like BOTW, astral chain, FE Engage,  Splatoon 3, MH Rise and alot more. Just look how smooth looking they are. \nI always say this time and time again, they should have just stayed with 2d. GF is not ready for full 3d yet. look at those muddy trees, ground and rocks. ",
        "A nintendo game with performance issuess........",
        "Was that a shiny golduck?!",
        "Still, there's no voice acting.",
        "Pokemon Colleseum Remake on the Switch or XD Gale of Darkness would be ",
        "They only gave this game a bad review so people could stop accusing them of being Nintendo fanboys (and girls).",
        "There's a reset button for your camera in the openworld. Just click on RightStick Button (or Click)",
        "Not gonna lie. My hype kinda got killed here. ",
        "See we also have to go in very open minded, knowing that what we got in Legends Arceus is unique to Legends Arceus, and that we shouldnt just simple compare SV to Arceus in what it lacks. But instead look at SV on its own in terms of mainline games and what do these games improve on in comparison to Sword and Shield. ",
        "Is it a step in the right direction, by any chance?",
        "Personally, like with Legends, i know it's not right to get a game with Jank and minor glitches that can ruin the fun but i think as long as it doesn't completely hinder my fun, kick me from the game or is unplayable: i am still gonna have fun with it. I mean I've played and enjoyed games like Hyrule Warriors on the 3DS when people said it was bad.",
        "Yeah, he for sure didn't have the day one patch. I've heard people say that while it's still not perfect, it has significantly less issues with the patch installed.",
        "I've said it before, let Monolith develop a Pokemon game.",
        "I don't quite know what it is, but Pokemon hasn't really looked or felt like Pokemon to me over the past few years or so.",
        "How are they just throwing this at us with horrendous technical issues for a full price game? That's disgusting",
        "Honestly this kind of looks like the best 3D Pokémon yet. Hopefully they can patch some issues, but I don’t really expect much, because I don’t think they’ve been ever really put out a patch like this before.",
        "I've seen the new Pokedex thanks to leaks and honestly think this game has the worst designs",
        "I was playing Sword this week and absolutely hate when pokemon pop up right in front of you out of nowhere. Was really hoping they fixed that. In PLA you can see them at a distance, albeit with a lower frame rate but I think I’d actually prefer that. ",
        "Performance is a shame, but to see the praise in other areas is great.  Can't help but wish the Switch was a bit more powerful.  \n\nBefore anyone starts flaming me, obviously there's likely more GameFreak could have done in the performance department. But a lot of recent Switch games have been struggling with performance, Bayonetta 3, Sonic Frontiers, Mario+Rabbids 2, and those aren't even open world in the same sense Pokemon is. Not every dev is Monolith Soft, and open world is a hard game to pull off correctly on Switch, moreso if you're trying to pack it with lots of Pokemon.  Obviously it's possible, Breath of the Wild is a clear example of what a great engine can do. However, better hardware benefits everyone, the devs who are kings of optimization and the ones who struggle.",
        "Everyone did hate the \"friendly rivals\" but when it's a girl, then everyone is fine with it.",
        "Did this guy said he liked those new designs. They look like abominations more like bootleg digimons or beta stripes",
        "Pokémon more then deserves it’s own Zelda Breath Of the Wild Quality game . This is madness",
        "I just can't do the performance and graphical issues; definitely looks miles worse than Sword and Shield and a slight step better than Arceus. I feel we don't need a \"realistic\" based graphics, the previous was just fine. Terrastilization is actually intriguing and so is the new raids, but without a dynamic leveling system for a challenge, it's just a waste. That was the only thing I hated about Sword and Shield, was way too easy.",
        "So everyone can agree that performance is the biggest issue. I do wonder if it can ever be fixed",
        "Nintendo playing to their own beat as far as tech goes is one thing but when the severe tech limits of your weak mobile hardware gets in the way of the vision of your games, that’s another. This is one of the reasons Yuzu and Ryujinx are one of the more, literally increasingly by the day, popular options of playing Nintendos games.  Imagine this game, Xenoblade, Bayonetta 3 and others on proper powerful hardware…..man…",
        "I feel the same it feels like there alive with you",
        "Yeah, we all know the issues will be patched a few weeks in like an every other switch Pokémon game",
        "Why can't we get a nitty gritty Pokemon",
        "For me, the biggest 2 issues with the game were the performance issues, and the butchering of character customization.\n\nYou can't customize your top/bottom at all.",
        "Incredible new Pokémon designs? Idk… I’m guilty of seeing the leaks and I’m not a fan of any of them. There were alright ideas and themes, but the execution and actual designs are awful",
        "khaby lame is seriously a perfect\"no emotions guy\"",
        "to put it simply\nthe game has quite some issues with camera and performance\nbut the adventure and everything new, just outshine the issues",
        "Performance is a gamefreak issue. People blame nintendo, despite playing no role in developing the games, and then willfully ignore all the other nintendo titles that have open areas/worlds that run/look great. Gamefreak needs to step their game up. It's not a nintendo problem.",
        "I think what everyone really wants to know is.. Does Wiglett evolve into Wigtrio?",
        "This finally feels like a fully realized Pokemon game. They're playing to their actual base, which is fans who have been with the series 20+ years. Hopefully this change brings hardware change as well.",
        "Judging from the reviews and stuff, this feels like a forced release of a beta game and we are paying a good price to test it for them. Game freak is insanely wealthy and powerful company but dishes out garbage. Nice",
        "Why does the UI remind me of Pixelmon for Minecraft? The Pokémon list on the side, fullscreen menus, the camera panning, and whatnot all seem kind of similar if you look at it closely ",
        "\"some of the most interesting stories we've ever had in a pokemon title\"\nPepe: \"I feed my dog with sandwiches to heal him\"",
        "Despite the performance issues, For the first time in a long time, I can genuinely say that I absolutely love this game. I haven’t been able to say that I’ve been absolutely immersed into a mainline game since Gens 3/4/5 . XY were bland, absolutely HATED S/M/US/UM and Sword and Shield promised too much and accomplished nothing.",
        "How did you get that uniform?",
        "I am sad about level scaling absence.",
        "The performance issues are ridiculous. Wtf am I watching right now?",
        "Very unusual for Nintendo to allow something so half baked to be released. This is the sort of standard you'd expect from Bethesda from a few years ago.",
        "I was so scared after hearing about the performance issues because I’m almost exclusively a handheld switch player. But then you mentioned it’s actually more stable on handheld and I’m like “well damn I’ll stay winning”",
        "This game has my favorite Pokémon in it: Skippit",
        "I assume you got a demo copy from Nintendo I am not gonna watch the review yet as I don't want to get spoiled but I will rewatch it once I play through it. Games coming out tomorrow hype!",
        "A lack of polish is what you get when you release a game every single year! Overall, still a solid experience tho.",
        "Hmmm there must be a release day patch right? That great ball is just… unacceptable",
        "It's 2022, they really should've solved the graphical issues by now",
        "1:19 shiny Golduck? nice",
        "love the music choice in this review!",
        "Hubert… Brassius reminds me of Hubert from Fire Emblem.",
        "This is starting to tell me that the switch is getting out of date even for first party games",
        "Lmao STOP blaming the switch for the performance issues when it was GF being incompetent as usual. We have a lot of games that look better than pokemon and open world while also have a stable performance on switch",
        "ScVi looks like a dream come true except for the visual department.\n\nPoor performance is one thing but poor camera work is another. Camera clipping through bounds etc is incredibly frustrating esp in an open world.",
        "L button put camera behind you the slow down is real",
        "forget...",
        "Games not actually out though",
        "Performance issues are unacceptable for a Pokémon game stop making excuses guys",
        "Yeah… for a world described in game as beautiful, it looked awfully meh.",
        "Did this man just say the new Pokémon are good? I saw the list… 98% we’re so unbelievably bad idk who to even catch",
        "Why are people complaining so much it just came out like give nintendo some slack",
        "Correction: You CAN catch pokemon of higher levels, they will not listen to you in battles however. ALSO there is a button to reset the camera, both in the open world and in battle.",
        "100 billion dollar company that can't hire a few more devs to help optimize the game.  Sad",
        "Mobile games have better graphics ️",
        "Wow. Nintendo REALLY needs to release a 'NEW' Switch. Or Switch 2... This looks like a Gamecube game.",
        "another pokemon game? it feels like the last one was just released this year",
        "Just a little tip I want to give other people that will play, terra raid dens also recharge your terrastalization when you touch them.",
        "The amount of performance issues is worrying. If it was any other game other than pokemon, it wouldn't be released with such issues.",
        "I feel like we should mention that exploring can be tedious here too.  Many pokemon are so small, that you won't see them before running into them.  Flabebe is about as easy to spot as a mosquito IRL.",
        "If the performance issues make it hard to play the game I think you might need to go see a doctor as your brain is just not working right cyberpunk was much worse and people are enjoying it now Pokemon has issues yes but maybe stop and think this is the first open world Pokemon game it’s more of a test to see how it works so in the future the issues should be much more streamlined",
        "The best Pokemon game in years.",
        "We need a switch pro",
        "Too bad I've already been playing it, needs a day 1 patch it struggles so bad with a stable framerate",
        "Is your review based upon the game BEFORE the day one patch? I assume that it is as others have mentioned that the patch removes/decreases any lag in the game. Either way though I’m really excited for these games!",
        "I am a few hours into the game, and i really want to love it but the performance issues are just really annoying. I feel like if they took some extra time working on the game, it could have been a masterpiece. Hopefully a patch can clean up some of the bugs in the game, but part of me just wishes they took more time to polish the game.",
        "I pretty much solely play handheld, so I guess I'll still enjoy this! lol",
        "Why’d you spoil that Nemona has champion rank, that was defined supposed to be a reveal towards the end of the game.",
        "We still don’t have update yet that’s tomorrow for performance",
        "Wait does he L button not reset the camera behind you?",
        "they really need to take pokemon away from game freak",
        "I think nintendo should start releasing, or quickly make another version of nintendo switch with improved performance (and battery) for about 100 bux more than current nintendo switch (like how they did with new 3ds)",
        "Honestly, the issues in the game are probably due to Nintendo, and in turn, The Pokemon Company and then GameFreak, pushing for the game to be released earlier then it should have. The Switch will probably be around for another 2 - 3 years or so, so it makes sense that they'd push the game to release now... but I can't help but imagine what this games would be like on Nintendo's next console.",
        "Great Review! Well structured, informative and honest! Thank you, Tris!",
        "Their setting up its first patch the day of release so for the visuals, cant really have a review on that yet.",
        "I'm confused, how is this any more open world than any other mainline pokemon game released ever? The lack of loading zones?",
        "\"There is no traffic jam along the extra mile.\" -Roger Staubach",
        "Pokémon Scarlet and Violet are here soon, Im so hype for friday. ",
        "Performace has not been a prime aspect in pokemon so i dont mind it",
        "Cool!",
        "If the performance issues impacted the game so much that you couldn't say you love it\nYou're not a real Pokemon fan\n\nBut nonetheless, still excited myself.",
        "This game looks like absolute crap visually",
        "I want game freak to fire all of their coders",
        "Pokémon is an annual series, we can expect some bad glitches becoming increasingly common until we hit a breaking point one year and they're forced to delay.",
        "If you have to unlock areas than the game isn't really open-world.\nYou know what Switch game is really open-world? Snowrunner!",
        "World's biggest franchise worth billions and they make a game that looks this bad.",
        "The performance issues are there because people were complaining abbout the graffix. Gamefresj has clearly focussen more on graffix and the pokemon campany just gives them not enough time. I personale don’t care si nuchter abbout the graffix as long as the game is playable with almost no bugs or slowdowns.",
        "The number of people who didn't see the performance issues coming is too darn high. Look, it's Gamefreak. They're not great graphical developers to begin with, and they only have 2 3D titles under their belt. There was no way they were going to get this right.",
        "Is it out?",
        "remember MissingNo? that was a fun glitch that was forgivable  even of this game \nis fun this is still a technical  failure   in  2022!",
        "Why do I feel like the game is so rushed since legends arceus background looks better than S&V…",
        "hoping if next year we got a revision for the switch, this game will also update for better fps",
        "If gamefreak capitalize on the successes of this game and iron out its flaws, the franchise will finally reach its true potential.",
        "What about the post game?",
        "I'm very surprised by the lack of criticism for the \"modernized\" dialogue. Like characters saying \"that's an L for me\" and other nonsense.",
        "I wonder if Ash will take the role of Nemona in the anime ",
        "Technical issues aside I’m genuinely excited and can’t wait to get my hands on this in three and a half hours when it launches here in Australia",
        "Did the day one patch improve performance at all?",
        "So the new Pokemon game basically became the Cyberpunk 2076 of Nintendo switch?  To many bugs and it should've spend more time on the oven baking. Maybe another 6 month?",
        "This game looks disgusting, there’s no way around it.",
        "Give monolithsoft the entire game",
        "And y'all be complaining about Frontiers' Graphics..",
        "I believe there will be an day 1 patch and it’s too be expected sadly all games will be buggy which they shouldn’t be and fully tested so this doesn’t happened but still even with these issues I will be enjoying Pokémon Scarlet and Violet tomorrow. Also did it occur to you that the Greatball just liked following you around???? ",
        "But is it better than Arceus?",
        "Odyssey and Breath of the Wild are absolute masterpieces with a few hiccups here and there. How does it make any sense for Nintendo titles to be degrading in their quality instead of improving? I'm not overly interested in buying Nintendo Switch games these days because of the sheer lack of quality. It sucks because I used to love Nintendo back in the N64 Gamecube and Wii days.",
        "This game looks so unfinished…but what do u expect with pokemon games",
        "3:44 \"Alot of characters in the screen\" \n\nOnly 4-6 people are being rendered and yet the game stutters like some insane stuff is happening on screen..",
        "I thought it released tomorrow\n\nMaybe I am wrong",
        "They need to ask a competent dev to make the open world in these games",
        "Can we stop using performance as a reason to lower a game review at least with Pokémon it’s something we are use to now we all need to learn to ignore it because everything else is solid",
        "Performance issues have never been a big issue for me (unless you get constant crashes) as as long as the game is fun and the the soundtrack is bangin’ I’m all good (and I’m sure it’ll get somewhat smoothed out over time)",
        "Ah, the GameFreak special. Cut content, performance issues, jank, lack of options, constant inconveniences, etc.",
        "I get the feeling these technical issues will get patched. They can't be unaware of the performance of these games, and the day 1 patch is going to require a big 1 GB in order to download it. Something tells me that they'll get taken care of.",
        "Is it true the open world, do things in whatever order you want is a lie? Im that, you gotta do certain events like team star bases before you can progress?",
        "The Yip game, of KND season 5 ep.9 had better performance (stability)….",
        "There is a button to reset behind you. L.",
        "Was there a day one patch when you played this? If not then maybe you should redo the review when you download it.",
        "Looking forward to the next two years of war zone 2 with jev :/",
        "Sad that people keep trashing Nintendo graphics. dokeV and palworld are killing Pokemon",
        "Thank you for being honest with this review. I feel like all of the problems you've experienced will be fixed. I think dlc might come for this game just like they did with pokemon sword and shield",
        "Great review! This sounds like it has faults but is still a good game! Looking forward to it",
        "Gamefreak should collab with Monolith Soft for their next mainline Pokémon game.\nWould be amazing!"
    ],
    "comments_disabled": false
}