{"video_id": "VfLxs6kPK5M", "comments": ["Performance is a gamefreak issue. People blame nintendo, despite playing no role in developing the games, and then willfully ignore all the other nintendo titles that have open areas/worlds that run/look great. Gamefreak needs to step their game up. It's not a nintendo problem.", "I really hope we get a patch to fix the performance issues. I really hope GameFreak smooths out their optimization in the future.", "I find it weird that there isn't any puzzle solving using your Pokemon's type or abilities in an open world version of the game. Like an ice Pokémon that can freeze objects or water or use your fire Pokémon to burn rope to release a platform or an electric one that can either add or take away charge or power from machines or lights to reveal areas. Seems like you could do that on a fairly basic level like it's not even that far from something like the Lego games where each character has an ability that can be used to solve puzzles but the potential to do that with Pokémon could be amazing.", "It is important for many reviews to seriously address the performance issues. GameFreak seriously needs to take action in releasing a performance fix patch. \n\nI know they have a reputation of not listening to their audiences and I used to believe that. ", "I honestly wish they could let us have the ability to jump while playing as the trainer. It just feels weird being restricted with no ability to even have a tiny jumping possibility. Hopfully the next game will have it...", "I'm not sure why they don't make the style of graphics cel shaded like the cartoon. I feel like it would be easier to do that style and hide blemishes and keep performance up.", "Pokémon is an annual series, we can expect some bad glitches becoming increasingly common until we hit a breaking point one year and they're forced to delay.", "It’s upsetting to hear that the gym leader battles don’t scale to the current level; to me why even allow us to battle them in any order in the first place if the levels are predetermined and imply a set order.", "Despite the performance issues, For the first time in a long time, I can genuinely say that I absolutely love this game. I haven’t been able to say that I’ve been absolutely immersed into a mainline game since Gens 3/4/5 . XY were bland, absolutely HATED S/M/US/UM and Sword and Shield promised too much and accomplished nothing.", "Technical issues aside I’m genuinely excited and can’t wait to get my hands on this in three and a half hours when it launches here in Australia", "Note\n\nU can also refill ur terra orb by touching the raid crystal (u don’t need to enter the raid)", "Even as a huge Pokémon fan I really can’t defend the performance issues. No one expected them to do another Pokémon game this year they easily could have pushed this another few months to a year even and most people would be fine with it. And the excuse of merch and anime doesn’t really work cause the plush’s have been out for months online and the tcg  does not come out til next year. The only reason I think they will even attempt to fix the performance issues is because it’s supposed to be the VGC game for the next few years.", "Great Review! Well structured, informative and honest! Thank you, Tris!", "The transition from the Pixar lamp to the boat train, that was incredible", "I am a few hours into the game, and i really want to love it but the performance issues are just really annoying. I feel like if they took some extra time working on the game, it could have been a masterpiece. Hopefully a patch can clean up some of the bugs in the game, but part of me just wishes they took more time to polish the game.", "That \"I'm free\" quote at the end really hits different after his passing. Rest in peace, Techno. You will be missed dearly.", "I feel like we should mention that exploring can be tedious here too.  Many pokemon are so small, that you won't see them before running into them.  Flabebe is about as easy to spot as a mosquito IRL.", "Big pass for me on this. The performance issues are one thing, but S/V just don't do anything impressive. Legends Arceus was more of a step away from the usual formula. I think I'll wait for the next legends game. Mainline pokemon games just don't do it anynore.", "The amount of performance issues is worrying. If it was any other game other than pokemon, it wouldn't be released with such issues.", "Thank you for the honesty, Triss, saying the good things AND the bad things.", "Correction: You CAN catch pokemon of higher levels, they will not listen to you in battles however. ALSO there is a button to reset the camera, both in the open world and in battle.", "I really wanted to love this and it does look fun, but the performance issues are just too hard to ignore. A few issues here and there is forgivable, but from the footage I’ve seen it looks really distracting. There’s just no excuses for it anymore. So disappointing.", "Here's to hoping they fix performance issues like Nintendo did with Xenoblade 2\n\nPokemon swsh didnt have any real performance issues outside of the wild area when online.", "It is a tradition in the Paldean region to leave a Pokeball at the door... to ward off VAMPIRES!", "Perhaps the real pokemon were the crappy one off mechanics we met along the way.", "Honestly this kind of looks like the best 3D Pokémon yet. Hopefully they can patch some issues, but I don’t really expect much, because I don’t think they’ve been ever really put out a patch like this before.", "Just a little tip I want to give other people that will play, terra raid dens also recharge your terrastalization when you touch them.", "Great review! This sounds like it has faults but is still a good game! Looking forward to it", "No excuse for the poor performance in the open world. Especially when you look at games like XC3.", "It's a real shame/disappointed that some of my favourite Pokemon like :\n\n\nFire Type: Vulpix, Ninetales, Ponyta and Rapidash.\n\nWater Type: Milotic, Lapras, Lanturn, Starmie, Sharpedo, Goldeen and Seasking.", "I think what everyone really wants to know is.. Does Wiglett evolve into Wigtrio?", "Thank you Tris for the review! looking forward to playing the game myself", "Really disappointed to hear no level scaling for the gyms\n\nHow hard is it to set completion flags? I really dislike the idea that it's supposed to be our own adventure, but if we want to go rogue then it feels like we aren't supposed to/being punished for it", "When a day 1 patched game still feels like an alpha release. Even matches the previews where the game still were janky and had bad performance", "Looks like I’m right to wait for 2 patches / updates to play this", "Even though it may be a bit on the choppy side sometimes, it’s not going to bother me. I can look past it to enjoy what I know will be my game of the year. A patch or two would be good though. I know it can do better.", "All I know is Gen 10 needs to have the option to travel to different regions and allow you to amass a huge Pokédex and badges", "I was worried about performance turning me off, but it seems they did that great with everything else enough for me to make the leap lol", "It’s 2022, time for GF to get it together! Next main game which will probably be on the next main console needs better graphics and performance. But can’t wait to play as well.", "So Nemona is more of a mentor than a rival... noted.", "I'm glad they released this game now because the amount of hate they're going to get might just be what they need to make a decent game.", "Nice and thoughtful Review.  \n\nBut yea, while I love this game and the sheer delight many of its explorative moments can bring - I am a little embarassed by its Performance quite a lot of the times as I'm playing through it and need to chill to some of the Great music to make me forget about it lol.", "The great ball is probably a programming thing to indicate where the entrance of a building is for you to spawn on.. but it shouldn't be visible if so", "I really miss 2d Pokémon games I really wish they didn’t abandon them completely should’ve went the route Zelda went by making both types. They could’ve made some super pretty 2d Pokémon games with the tech they have now compared to the bland play dough looking 3d games", "I've said it before, let Monolith develop a Pokemon game.", "Imagine setting an picnic on a flamable place with the “this is fine” meme ", "●Poor framerates \n●Bad textures\n●Non-enterable buildings\n●only ~400/over 1000 total Pokemon are in the game", "This is the 3rd large scale Pokemon game on consoles. You would’ve thought they had the optimization issues figured out by now. It’s almost as if they didn’t even care to play test the games enough before a release. Hoping they can patch the issues. Still looking forward to playing through the game.", "They need to ask a competent dev to make the open world in these games", "Yeah was expecting performance issues this happened in Gen 8", "The game looks really interesting. I'm just gonna wait for either a patch or a discount. I ain't paying full price for its current state.", "Big bummer about the performance issues. Though was pretty expected", "It's 2022, they really should've solved the graphical issues by now", "Ive been a massive pokemon fan in my youth. I remember when my dad bought pokemon heartgold and together with the DS. That was my happiest moment as child. Sadly, pops passed away and I never had the chance to buy pokemon again due to financial struggles as someone who works minimum job. Still happy that my cousin gave me his switch lite to play free to play games now and then. I'll be buying switch games when times get ease. Miss you pops, and thank you for the childhood memory that i will never forget...", "I love how Markiplier went from an awkward, shy nerdy guy to an awkward, shy nerdy guy that's hot enough to make steel boil. He didn't let his glow up affect his personality outside of maybe being a tad more confident. Dude is a beacon of positivity and integrity. =(", "There's a reset button for your camera in the openworld. Just click on RightStick Button (or Click)", "The game seems almost perfect. I’m just hoping for them to fix the performance issues in later updates. Mainly just so everyone will stop trashing the game because of it. Guys. Graphics. Don’t. Make. A. Game. Sure, I wish they were better, but it doesn’t put the game off for me. They’ll release some sort of patch eventually.", "I am sad about level scaling absence.", "The randome Greateball spawning im every doorway is the kind of funny randome glitch i love xD like ... How !?", "Hi Tris great review. I will be getting this tomorrow", "This is the first pokemon game i'm going to watch someone play online and not buy myself.", "A lot of these issues will be fixed with a patch or 2", "Yeah I was going to grab day one but I will wait for them to iron out the bugs and hopefully have a more polished experience in 6 months or so", "I like the game a lot besides the performance issues. I’ve been playing Scarlett for 2 days and Im having wayyy more fun than I did with legends. Not saying legends wasn’t good, it just wasn’t for me.", "Gamefreak should collab with Monolith Soft for their next mainline Pokémon game.\nWould be amazing!", "Im kinda disappointed as to how many Performance issues there seem to be. Everything else in the game looks great though im excited to get my copy!", "I'll give the game another try today, but last night I was disappointed by how slow the movement of the game was that I nodded off. Granted, I was tired, so hopefully that feeling doesn't remain when I play the game later today. But even when I figured out how to run/jog, the movement speed seemed a tad slow to me.", "I will miss not having the ability to chuck pokeballs, outside of battles, to catch Pokemon.", "After you said rightfully intimidating in regards to the league I got a Sonic Frontiers ad that just made me think omg imagine if this game also had metalcore boss music lol", "I wish it didn’t look so ugly. The performance issues are unacceptable", "I wonder if Ash will take the role of Nemona in the anime ", "I am starting to think if this game had no performance issues we’d probably be looking at an average review score of like 86 it feels", "I set my system to 720p as there is no major difference between 720-1080p in this game, it doesn't completely remove the issues... But it makes it much smoother at least", "With all of these performance issues, I have to ask...\n\nIs the game even finished? This feels like another Sonic Colors Ultimate issue, minus the seizures.", "The number of people who didn't see the performance issues coming is too darn high. Look, it's Gamefreak. They're not great graphical developers to begin with, and they only have 2 3D titles under their belt. There was no way they were going to get this right.", "Would love to see a comparison video of how quickly you can catch 3 Pokémon in Legends compared to this game", "See we also have to go in very open minded, knowing that what we got in Legends Arceus is unique to Legends Arceus, and that we shouldnt just simple compare SV to Arceus in what it lacks. But instead look at SV on its own in terms of mainline games and what do these games improve on in comparison to Sword and Shield. ", "I was playing Sword this week and absolutely hate when pokemon pop up right in front of you out of nowhere. Was really hoping they fixed that. In PLA you can see them at a distance, albeit with a lower frame rate but I think I’d actually prefer that. ", "Great review thanks buddy", "ScVi looks like a dream come true except for the visual department.\n\nPoor performance is one thing but poor camera work is another. Camera clipping through bounds etc is incredibly frustrating esp in an open world.", "The graphics/design/performance are a total deal breaker for me. I'm sure the open world concept is better but I'm gonna wait for a new switch and hope the next pokemon runs and looks better.", "This finally feels like a fully realized Pokemon game. They're playing to their actual base, which is fans who have been with the series 20+ years. Hopefully this change brings hardware change as well.", "@gameexplain Quick Question: If this game wasn't Pokemon, would you guys really give it the score \"Like it alot\"? These performance issues are immersion breaking to a huge degree. The world looks pretty bad and uninteresting. Anyway, love the channel. Keep up the good work.", "After watching several reviews today, the pop in and frame rate issues are pretty distracting. While I get the Switch is aging and we seriously need a Pro model to bump up those framerates and load ins (Hyrule Warriors needed it way before now!), Game Freak are once again sadly showing their budget and staffing doesn't match the quality and depth the franchise should be getting as the biggest in the world. Sonic Forces can make excuses as lower down the ladder in profits and sales, Pokemon simply can not...", "Can't believe we've gone from xenoblade 3 which looks great and runs perfectly to this state of bad performance.", "love the music choice in this review!", "I can't wait to be playing these games tonight at midnight.", "hoping if next year we got a revision for the switch, this game will also update for better fps", "Yo Nogla, the guy that made the one backrooms game (the one with that party area that you guys were stuck on with wildcat) it’s being updated with new levels and some redesigns. It seems like you might enjoy a 2nd go round with it, but I dunno, it’s up to you guys.", "Is it a step in the right direction, by any chance?", "Can you rebattle the trainers you find in the world ?", "Very informative", "Personally, like with Legends, i know it's not right to get a game with Jank and minor glitches that can ruin the fun but i think as long as it doesn't completely hinder my fun, kick me from the game or is unplayable: i am still gonna have fun with it. I mean I've played and enjoyed games like Hyrule Warriors on the 3DS when people said it was bad.", "I dont think gym badges matter in terms of catching pokemon, but maybe how disciplined they are like ignoring orders, I caught a lvl 39 pokemon when my highest was 34 at the time and only had 2 badges.", "Something that people should know is that while yes the performance could be better it's not anywhere near as bad as people are saying it is. I've had my game slow down slightly but only for a few seconds and never anything too bad. That also being said pop in and terrible animations in background characters are very noticeable. People are complaining as much as they are because it's gamefreak/pokemon.", "to put it simply\nthe game has quite some issues with camera and performance\nbut the adventure and everything new, just outshine the issues", "they shouldve gave it ONE more year of development", "Great review, but in regards to the performance issues did you play this on the version one or with the patch ?", "Why is there no animation for throwing out a pokemon, arceus had a great animation for throwing out pokemon as well as good performance so I don't know what happened", "Pokémon more then deserves it’s own Zelda Breath Of the Wild Quality game . This is madness"]}