{
    "video_id": "vIV8-m-iYTk",
    "comments": [
        "Why did you release the shiny Gyarados",
        "Poor Timmy, there was a perfect opportunity to say You are admitting size is more important to Joel, hes just not catty enough! Loving the chaotic, hope you bring some empire folk back with you",
        "Can you try beating pokemon sword or shield as hop",
        "huhuh9j",
        "weed cat is best",
        "Shout outs to 24:12 where you accidentally walked by a shiny Cetoddle",
        "There so many new pokemon and Pokémon variations now xd i can't catch them all nintendo xD",
        "I’m choosing sprigatito because the dark typing for the final evo is unique and the design fits and it’s cool",
        "I'm so happy Lui and Velocity is back, hopefully we get more Gta videos again. It would be so refreshing since it's been ages.",
        "If you keep on hating on sprigatito I’m going to have to sue you",
        "Just realized after watching this that i like, cannot play Scarlet, the one i like more. And am now impressed of how dumb i am. But this video was actually fantastic and hilarious. Keep up with the good work!",
        "king krab",
        "C🇦🇷🇦🇷",
        "Love a lot of the new Pokémon, but gameplay hasn’t improved significantly enough for me to pick this up at full price",
        "Lechonk=bidoof",
        "Your rival picking the weak type is a big pokemon L",
        "Since when the starters were revealed I knew I would be picking fuecoco and o my god its evo is awesome",
        "I caught a raiulo lv23 without any gym badges ",
        "Him getting rid of his starter is unforgivable",
        "The best starter is Feukoko",
        "WEED",
        "grass",
        "folk back with you",
        "The crossover we never knew we needed, been a blast seeing all these collabs between channels from different eras of my life lately. :O",
        "I never said I'd like the video, if you released your shiny gyrados! That being said, I actually enjoyed watching your playthrough, so here, a like for you! Good job, are you also going to do the other game?",
        "I’m gonna sell my weed cat to smokers for cash",
        "Grasd",
        "I like to play with tsunamis.",
        "The reason I chose springatito, was because the others were good in attack or Defence, I wanted a good balance, plus the final form’s signature move is broken, always Crits(and springatito looks my real life cat but green)",
        "really not a fan of the new gen. getting the legendary that early just seems... wrong, somehow. i'm gonna go back to gen 5",
        "I love love pokemon",
        "Idk",
        "KLAWF",
        "Do violet and use fucoco",
        "Nobody:\nMe with my army of sunflora: when me and my gang pull up",
        "Poor qaradose ",
        "Hail to the crab king ",
        "When he released the shiny I was physically in pain",
        "Cats are my favourite animal",
        "absolutely love it, the suspence before you get to 0 players ahead of you, heartbreaking knife twisting server disconnects, relaxing and almost meditational waiting on the loading screen - all of this is so ground breaking, a true anthem to minimalism, just one single loading animation, counter, muted grey background and a logo of the game, what a masterpiece!",
        "I'm a cat person",
        "Getting the game next month for Christmas because I decided to let my parents buy it for lol",
        "Sprigatito because it is a cat.",
        "personally, pika clones are a tradition and i love every pika clone, and pawmi is no different.\n\nexcept for emolga, nobody likes you, emolga!",
        "Crown emoji. (Sorry can’t put it in I’m un happy )",
        "Wow! This video is GREAT!!!",
        "hail Klawf",
        "imagine people simping for the streamer",
        "The jagginess of that npc at the start was painful to behold.",
        "I like all",
        "This will be antlerboys favorite game no question thanks to the normal gym",
        "Dujd",
        "Dude, the plot at the end is so cool",
        "16:27 not ram ranch",
        " King \n Klawf",
        "If ur playing pokemon vilot water teal",
        "I wish they took advantage of the switch to allow local multiplayer",
        "Don’t know",
        "I play Pokemon violet.",
        "The cat",
        "I like fire  types since I ever saw one in sword and shield that was the coolest fire type it hits one hit",
        "I unlocked the video the second he released the video",
        "You have very good taste in pokemon (love Bellibolt and Quaxly",
        "You love dog or no",
        "That's a WILD story for a Pokemon game, I love it. Actually really enjoyable",
        "Seeing Jev genuinely enjoy a game while he does a camo grind is such a wholesome thing to me.",
        "damn that was a fair deal man",
        "duc",
        "So sad you killed cetitan when you could evolve cetoddle",
        "Sprigatito’s final evo is a furry; I can already see the fanart. Disgusting",
        "Sprigattito is cool not the jojo duck or  coco",
        "This new Pokemon game is inspired in my area. I'm from Portugal.  LETS GOOOO",
        "People normally pick the fire type starter but keegan picked the water type",
        "The grass and water starter evolutions look so weird XD",
        "Sprigatito has the best design even final the rest look REALLY bad",
        "king   is the best  ",
        "i like that the gym leaders use one pokemon that isn't their type but terastalise to their type. The levitating electric mismagius and the hilarious real grass type sudowodo are clever. makes battles less easy and more entertaining thematically",
        "I don't know why but I feel offended after he released  that shiny (he still getting my like because of him not holding back)",
        "Funny xd",
        "why is the touros sus because its black???????",
        "Did you know that grievard actually drains the Life force of humans",
        "Quaxly gang",
        "I absolutely love the evolution of Bisharp.",
        "Ruh is it wears that I kan inglich if I’m a boy 10 years old and I speek duch",
        "Dam the plot is on level",
        "Please beet scarlet with only starters",
        "Sprigatito is godly",
        "15:40 ",
        "It's crazy how laggy his game is compared to mine ",
        "What makes this video better is at 16:06 he even gets a half bed spawn",
        "Me only choosing florgetto to pray it stays on 4 legs.",
        "Kratos getting down to Brok's level to present the spear and Brok agreeing to the blessing is one of the greatest examples of character growth I've seen in a game. I thought the game couldn't top the Freya therapy session in Vanirheim and then it just keeps getting better. It's so well written.",
        "What happened to you?Why are you not making anymore vids.",
        "It's ALBERT FLAMINGO",
        "If you haven’t seen weed cat is one of the good starters in that gen fuecooco is the best and quackxlys final evo sucks\n(To summarize fiecoco has he’s final evo with weed cat)",
        "The weed cat",
        "I will pick the citty",
        "yes, king clodsire. and im sir_clodsire at your service o, king clodsire",
        "Kitten is best starter pokemon",
        "I love cats that’s why I’m picking the glass type",
        "for once the fire starter isn’t the favorite.. we don’t talk about x and y though",
        "The name Arven sounds a lot better than the german version... Pepper.",
        "I want to watch it... But I don't want to be spoiled \n\nEdit: why are some people so hostile just cuz I said I don't want to be spoiled? It's my opinion, I'm literally a grown woman just not wanting to get spoiled on a game I like. I don't care if \"it's the same story over and over\". The mechanics, the characters, the Pokemon, the basic plot, ect, they can all be different. It's a nostalgic franchise to me since the Sinnoh region. So please, stop being so hostile twords each other and twords me for having a basic opinion. Have a good day or night. Though I highly doubt some of you have a good life since you wish to get so hostile with me just saying \"I don't wanna get spoiled\" on a freaken game.",
        "All hail king klawf! ",
        "Why would you do that. Gyarados is beautiful and it was shinyyyy",
        "Sprigatito is god",
        "Do a play through in pokemon sword as Goh",
        "The fact that you have a psuedo, named baxcaliber, is the coolest thing I have ever seen.\nI also was surprised when you released a shiny gyarados",
        "I think he missed a shiny at 24:13 because the whales one of them is gray and they're shiny is Gray",
        "Bro takes me so long to find a shiny then I see him releseit and I’m heartbroken",
        "LEGATO IS DA BEST AND A GOD AND NO ONE CAN SAY ANYTHING ABOUT IT OTHER THAN YESSSSSSSS!!!!!!!!!!",
        "information as you possibly can. I seriously learn so much from you O:-)",
        "Here as a representative of girls and girl friend groups, the slapping one wouldnt have any hesitation",
        "Klang was very easy because I evolved fuecoco",
        "2:11",
        "Sprigtito is not bad your biased because of incinarour.",
        "Candy cat",
        " QUESTION: Which starter are YOU picking in Pokemon Scarlet / Violet? \n NEXT: Can JUST ONE Magikarp Beat Pokemon Legends: Arceus? https://youtu.be/QE_DJ-zA2pA",
        "Tauros:Who are you?\nBlack tauros:im you but stronger",
        "All hail the Krab king ",
        "I like sprighetto It's a really cool pokemon and deserves to be loved because",
        "I didnt like the video...  because you murdered that poor gyarados",
        "Ehh I think I would wait for the games to be more refined and actually playable without any glitches",
        "Flacoco is the best starter",
        "I’m going to choose a water type starter and you chose a a water table starter so we’re the same",
        "Yuh good job beating first demon car thing idk",
        "I would pick quaxly",
        "F For Larry",
        "Who wants a lechonk only run?",
        "This was amazing",
        "Evolving Charcadet took me ages! I had to try twice since my game crashed while hunting Sinistea to get the things needed to evolve it; I did find a shiny during that hunt so that's a plus",
        "all hail king crab ",
        "No one can argue that they made fuecoco a fire Lyle",
        "yes sir \n            ",
        "fuecoco",
        "It's corn  a big lunp of nobs it has the juice it has the juice i can't amigan a more buitful thing",
        "I feel ya against flinching with marnies morpeko who somehow can’t be seeded or poisoned idk why",
        "The grass cat is the best",
        "thank you for not puting spoilers in the thumbnail, i appreaciate you not going for those extra views at our cost",
        "Crab king never deads",
        "I wanted the cat it is the best",
        "depends on what the first 2 gyms are for what starter im choosing, best in gen 8 is scorbunny for it can be used against milo and u can catch a grass type for nessa or whatever her name is",
        "Keegan: I would literally die for this duck.\nMe: I would literally die for this cat.",
        "1 Gyarados release = 1 Like ",
        "I'm a sucker for cats and I couldn't resist it",
        "All hail King Bo- Sorry King Klawf!!",
        "Am I the only one that thinks this story is awesome not like any story we ever had before kinda crazy. Also does that mean that there won’t be paradox Pokémon in future games, don’t hate that choice but I thought that was gonna be a new thing in Pokémon. Guess we got to wait like 3 more years",
        "I can't wait until tomorrow. I pre order both of them and I'm so excited. I just want it to be tomorrow already so I can just plsy them. I'm going to spend so much time in the open world. And I brought both BC it's s ritual for me. Plus one will be for s normal plsythrough and one will be for nuzlockes. Which I can't wait to do. Nuzlockes are going to be interesting in this gsme",
        "When I get a quagsire I'll name if quagmire",
        "I'm definitely choosing spaghettito for Pokémon's scarlet and violet",
        "I WANT LITTLE KITTY WHEN ME GET GAME",
        "cant wait for the challenge runs of this game",
        "Me laughing with my great tusk that sweeped my 5 gym leader",
        "All I did to beat the E4 + Champion is catch a level 75 Ice terastalyzed Lucario",
        "He should’ve played Violet\nIt would mark gigachad musics whenever the professor shows up",
        "FINALLY a YouTuber that chooses quaxly",
        "E",
        "Iam laughing so hard  chill cant breath  WTF WAS THAT SMOGMOG HERB EDITION ",
        "24:12 this whale was SHINY !!!",
        "i'm picking sprigitato because i like cats and it's a cat",
        "The transition from the Pixar lamp to the boat train, that was incredible",
        "Sprigarito- my cat is called willow, willow is a tree name! Amazing name for sprigarito!",
        "That’s Shiny Garyados just hurts.",
        "BRUH YOU MISSED SHINY",
        "his videos. We congratulate ourselves on this achievement. More to come and everything to come",
        "Pokemon scarlet -> Cavemen pokemon in a hollow game with ZERO interaction to the history until the very end + Robot Shakira; \nPokemon Violet -> Phyrexian compleated pokemon in a hollow game with Zero to the history until the very end + Robot Piqué; ",
        "I don’t now:l",
        "Give me that cat for I can love it forever",
        "I’m picking the Sprigs.\nYes, it’s 4x weak to bug.\nBut I love cats.\nAnd it’s a Pokémon I’d love to have as a pet.",
        "Id rather see the review on the game with the day one patch I highly doubt this is based on the game with the day one patch",
        "A child in the elite four more like elite child",
        "Did you know, if done correctly, someone who is skinned alive can actually live for up to 4 days afterwards? Most people who are skinned alive actually die from hypothermia because they have no skin.",
        "My game had better quality",
        "DoNt CaLl LeChOnK tRaSh",
        "Qaxley is the best starter ever",
        "weed cat come on dude",
        "Weed cat cuss i use weed cat every day i totally not dying im lahving and crying",
        "You know, there's plenty to comment on in this video that was funny, but I'm gonna mention how when I was recording my game for my channel and got to the grass gym, I somehow missed the npc that you talk to to spawn in the sunflora and spent literally 10 minutes trying to find even 1.",
        "Hopefully when updated there will be less glitches",
        "All hail the crab king",
        "I love woopers evolution in scarlet!",
        "Why do you make so so much bad decisions",
        "I swear once I took a look at Clavell, I was like: \"Damn he's evil\"",
        "hi",
        " I  fear  that  crab ",
        "So, @ 24.13 you run past a bunch of the new Citoddle Pokémon, & 1 was shiny….. You literally ran right past it.",
        "sprigattito has insanespeed and flower trick is op.",
        "Fenrir crawling closer and closer while Kratos and Atreus argue is both hilarious and cute as hell.",
        "11:30 this is exactly the type of boss we needed in sun and moon vsing the nihelego fusion",
        "5:57\nJames>Koridon (it’s a joke plz don’t kill me)",
        "cuz i cAN NOT EMOGY IM GOONA SAY IT CRABS ARE KING",
        "I only want the cat",
        " ",
        "All hail king crab",
        "I don’t keep up with Pokémon news very much, but keegan claims he played 30 hours, when this video came out the day Pokémon violet came out. And at the beginning keegan photoshopped the tposing people.",
        "Where’s 30hrs in Pokémon violet",
        "You be having me laughing way too hard",
        "Picking sprigatito, i was opting for a physical grass attacker, and u-turn via level up is really nice to have. however, quaxly is absolutely busted.",
        "hello crab king ",
        " CRAB ON TOP",
        "Sprigatito because i always chose the water or grass(not that i hate fire type starters) but i like sprigatito's evo more than quaxlys evo",
        "We could always count on ethan to throw and give us these priceless moments",
        "Me: I'm just too excited. I don't want BIG spoilers so I'll just like half pay attention while I multitask\nMe: oh that's a big one right off the bat. Oh, that's a big spoiler. Oh. Oh wow. Ok well now I'm going to tune out for a bit...\nMe: tunes in for the biggest spoiler of all right at the end",
        "Wait he weighs 600 pounds?\nOf course, I’m a Reddit mod",
        "meouwscarada",
        "With in the first 5 minutes of the game I encountered a shiny lechonk",
        "One of the best things is that he never takes credit for himself when he achieves something. He always respect us, the audience, and his team, and he is always polite in all of his videos. We congratulate ourselves on this achievement. More to come and everything to come",
        "sprigatito gang fl also im so happy they brung back flebebe cause i never got to play any game with it",
        "Nunu milk nunu milk nunu milk nunu milk nunu milk nunj milk",
        "dinosaur!!!!!",
        "hehe, i love watching these videos. keep up the awesomeness.",
        "Speiggateto",
        "Keegan j do a nuzlocke but with team rocket's pokemon",
        "I'd probably go for quaxly or spinatito (also crab king )",
        "This game is ridiculously good so much so I got it",
        "Quaxly is obviously the best starter",
        "I Picked The Fire Stater In Pokemon",
        "MOANS",
        "i liked subcribed and writed somthing soooooo i got all of them",
        "I chose the grass type starter and it was the right choice",
        "Look at this time 28:15 what is the Pokémon in the background",
        "Because I’m stupid",
        "She or he is a cat",
        "I vibe with grass type starters so I choose weed cat",
        "TECHNOBLADE NEVER DIES",
        "S",
        "Quaxly is the best",
        "The champion was so easy also I love dondozo",
        "Cat",
        "Sheesh",
        "I think I've been put under mind control. Every time I see one of grays videos, I instantly click on it.",
        "Frigibax is the pesudo",
        "paldea is just hisui with teraforming,gyms,and an elite four.",
        "let’s gooo king crab",
        " ALL HALL KING CRAB!!",
        ".  All hail klawf the crab",
        "Sprigget duh",
        "You dare insult that plant cat how dare you",
        "0:14 Ah yes, finally I can play as a Team Galactic kid",
        "Not gonna lie, Tinkaton is appearing to be my favorite from this gen. Can't wait to start playing it tonight.",
        "F for Larry such a legend",
        "Releasing that shiny hurt my soul",
        "They did dunsparce dirty with that evo. They literally just made it a bit bigger",
        "Very offensive chat Pokémon are favorite",
        "YOOO YOU MISSED A SHINY CETODDLE! AT 24:10",
        "please tell me you didn't actually release the gyarados at 38:24",
        "Dummy choose sprigatito",
        "look i  love cats and grass types so it fits in with me",
        "Le",
        "I wish there was a game where you aren't the main character and you just a normal person where you can do what you want",
        "He told me to comment why I chose sprigatito. I have a real life cat named Flora, sprigatito is grass type, Flora and fauna is >plants< and animals, I named it \"Flora\". So basically, puns :)",
        "i chose sprigatito literally just so i could name it weed cat. my whole team is named like that now.(LSD, Morphine, Stimulant, etc.)",
        "🫅🫅🫅",
        "Crab kingggg",
        "sandwitches does make friends.\nit worked with my friend at islamia",
        "quaxly op on the late game his speed is deadly. Can kill spriga with ice attacks.",
        "why did you not pick fuecoco he his the best",
        "24:13 you ran past a shiny",
        "yay",
        "Finally , someone finally chose quaxly",
        "️",
        "Bro I think you passed by a shiny certodle",
        "Wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww",
        "I love Dudunsparce. It's like a troll to people who want Dunsparce to evolve into some kind of majestic dragon like it does in a number of fangames. Shit's hilarious.",
        "I mean i want fire and grass",
        " Klawf our lord and savior\nEdit: \"Amigo\" means friend in portuguese, so Flamigo is literally a friend :)",
        "ALL HAIL WEED CAT",
        "Respect to the crab",
        "           ",
        "️️️ I love this",
        "WHY",
        "the cst is bad",
        "it is cat me love cats",
        "ALASKAN BULL WORM with arms",
        "Im still undecided about whether or not to nuzlocke this game as a first playthrough",
        "At 24:13 he ran riiiiight by a shiny. Don’t know if anyone else saw that but I died laughing when I saw that",
        "Sprigatito’s great and you can’t convince me otherwise",
        "hello",
        "He missed a really cool shiny in the crowd of pre evo cetitan",
        "I love how Markiplier went from an awkward, shy nerdy guy to an awkward, shy nerdy guy that's hot enough to make steel boil. He didn't let his glow up affect his personality outside of maybe being a tad more confident. Dude is a beacon of positivity and integrity.",
        "Finally, a ferrofluid magnetite form",
        "i like cats so shut up >:(",
        "This might be the hardest pokemon game to hardcore nuzzlocke",
        "Tinks line hands down MVP-mon of Gen 9. I always appreciate more physical fairy-types, but this little menace to society takes it up a notch by being the sleep paralysis demon to the entire Corviknight line. The Pokedex says they put the birds out of a job cause they kept getting shot at by these trolls and I had to reach for my inhaler when I first read that.",
        "All hail crab KING ",
        "Y’all might hate me but courage gotta go",
        "My first pokemon will be drugs",
        "Can We just appreciate how much work he put into these videos",
        "O.o Gyms don't scale? Crap my team is over leveled from running around catching every new pokemom I see on the right side of the map...",
        "What a certified good boy had me dying",
        "    ",
        "Does the new games still have stuff like revive/potions/super potions or do you just ignore that sort of thing? Because you totally could have won more if you did have those items.",
        "why... why did you release an op shiny garados? just... WHY",
        "Whoever wants to hate on quality, go ahead, just know I am coming for you if that's what you choose",
        "13:37 dont mention it roblox is better than minecraft and fortnite, and if you didn’t notice I’m in my dads account",
        "Yo Nogla, the guy that made the one backrooms game (the one with that party area that you guys were stuck on with wildcat) it’s being updated with new levels and some redesigns. It seems like you might enjoy a 2nd go round with it, but I dunno, it’s up to you guys.",
        "I ️cat",
        "Plant cat so i can sell weed",
        "I chose weed cat",
        "Endeavor works wonders to the titans. Just catch a staravia",
        "give me the cat",
        "I’d chose sprigatita because I have a cat named Ed",
        "sudoowoodu's trailblaze makes everyone feel like hell for 5 minutes",
        "I really love horror games, vanoss and his crew make it even better",
        "omg you have to do a video where you can only use lechonk like you did with bidoof pichu and magikarp",
        "\"Grusha is way out of my league\"\n\nMe too man, me too ",
        "Dude i didnt do the starfall bases till endgame so me and my level 80 lucario swept(it was hilarious)",
        "22:38\nBecause you didn’t use Aqua Jet? That has +1 priority? You LITERALLY could’ve avoided this whole mess if you plugged your brain in for one second.",
        "watching mark's blood pressure skyrocket during this is truly an experience live",
        "I picked fuecoco as my starter I just like fuecoco",
        "I just want a cat that evolves into a real cat.",
        "Ok I looked at the moveset for weed cat spoilers",
        "crown",
        "Man out here catching Fat Lssss",
        "Pokemon",
        "This new Games are so much fun, no matte how many bugs or bad frames they are. <3",
        "Great walkthrough",
        "He missed a shiny at 24:13 …",
        "  ALL HAIL THE CRAB KING!",
        "Sorry but sprigatino is actually cool as hell that also goes for the other two so yea",
        "I don’t know why but I am picking the Godzilla apples of gold nose lighter",
        "Weed cat.",
        "crown emoji",
        "Sprig a Tito is the best",
        "I love suffering",
        "That ancient salamance looks absolutely beautiful",
        "I love cat",
        "I would’ve picked quaxly but I was hoping to get a froakie from home on my team (I chose sprigatito)",
        "king",
        "premier ball gang",
        "Why always make bad decisions in Pokémon games cause I always pick The grass starter",
        "gg",
        "Forced to leave a comment representing the Sprigatito game, and yes I do plan to get lit as all hell when I finally get my hands on Violet. Blazin' with the weed cat. B)",
        "playing rom hack sounds good :/",
        "Quacksly is our king",
        "I like how 61K people would want fuecoco\n\nEdit: comment what you would name your fuecoco, I'm naming mine chilly pepper",
        "Ye",
        "if you insult the weed cat I will find that quaxly",
        "F",
        "Frames intensify",
        "The reason i chose sprigattito is simple. Magic Weed. I would choose Quackly as a second option tho.",
        "We finally have an electric fighting type. And it’s not even electivire.",
        "I love your videos",
        "I feel like a Guy Manuel helmet would’ve made more sense in the Kalos region.",
        "I almost cried when the shiny garados was released after the hour I spent on arceus for one",
        "poor Gyarados",
        "I will take the grass type",
        "I love quaxly, its so cute and its evo's are dope. They quickly became my favorite moms oat",
        "Baxcalibur is the new Godzilla pokemon. Tyranitar has been dethroned",
        "Well, that was unexpected. But another youtuber Pokeferlax predicted that the professors were evil.",
        "Grass cat in hopes for all 4s has the most broken signature of the starters and will sweep if set up right, so therefore the only CORRECT choice thank you",
        "Just awesome ",
        "🫅",
        "Weed Cat is amazing and I refuse to look at his evo's",
        "I always choose Grass pokemon. Just so when people say \"Cash, Grass, or ass\" I can just choose my Pokemon and save my money and my ability to have loud and obnoxious farts.",
        "ohhh my heart hurts so much....the character development...the doggo friend...the fact that they almost ended up like that sailor and son quest and then they pulled together before it was too late....you can see how aged kratos has become...absolute masterpiece",
        "all hail crab king",
        "This video commentary is so interactive lmao ",
        "This is my essay about why I make such bad decisions. First of all, it is a plant cat. I love the plant starters (except for snivy). And since the first team Star boss is fire type, I instantly regretted my choices.",
        "you made a fun and wholesome experience out of a game that annoyed, saddened, bored me and made me wince harder than pokemon insurgence, good job.",
        "i'll wait for Keegan and the almighty Pichu beat the game.",
        "3:09 ",
        "I would chose it because it's full evolution form has a move that get crit 100 percent of the time",
        "ola",
        "Sprig literally has a free crit with Flower Trick WYM!!!!! ",
        "The cat because I love         ",
        "Because cat",
        "Nice",
        "Quackery is the best",
        "Watching your playthrough it's so similar to my Violet playthrough. Like not just in what order you did things, but your reactions. Particularly to the car hahaha. I remember thinking \"ok... Did I fall asleep and I'm dreaming?\" haha",
        "The pain I felt when my favourite shiny guarados was released",
        "7:50 Lui making light of his situation is priceless",
        "the legends are objects",
        "Crab ",
        "This is honestly the best scarlet and violet video I've seen so far",
        "Bruh why show James from Thomas and friends",
        "Il commenting cuz my shu shu picked spirgitto",
        "How dare you not take the weed cat! I will find out where you live and I will live in your house and watch you sleep",
        "Sprigatito will be my starter. It’s the best one.",
        "I love all the mouse pokemon in this game",
        "Ben is c",
        "KING  CRAB ",
        "I WANT A WEED CAT TO GO WITH MY BIG MUSCLE CAT",
        "“He gets bullied for having to much money poor guy” no TO rich guy",
        "Tat baby cryTat baby cryTat baby cryTat baby cryTat baby cry",
        "also how she a trainer aren't you suposse to be 10 years old",
        "Ok",
        "I like sun curn i have always like it since i got pogo",
        "i picked all three",
        "Camman: okay so mojang noticed me. Minecart?\n\n\nMinecart: it's my time to shine :D",
        "The game looks awesome",
        "It was painful watching him release a shiny",
        "the king of fish",
        "laughs in still loves sprigatito despite the insults",
        "Released a shiny....you earned my angry like.",
        "I like sprigitito. I am grass",
        "Ha once I found out the story was healing Arven’s doggy….I completed that story line first. Lol it was almost the last thing I did, wasn’t aware about the level diff hahaahha",
        "i beat pokemon sword i am happy",
        "Anyone else notice he missed 2 shiny pokemon?",
        "oh my god this is like playing pokemon scarlet and violet in a nut shell",
        "52e",
        "  respect for the crab king",
        "I named the hemp cat Basil btw well you have to do to basically get like 50%  Way through the game is just with a wooper I kid you not a paldean wooper is legit the most powerful thing in the game",
        "1: GRASS IS NEGLECTED.\n2: wooper isn't new.",
        "Woooow",
        "Quaxly is the best starter",
        "I would choose Fuecoco and plus a youtuber comfirmed thats its the best stater to choose to beat the game. Quaxly is in the middle or Sprigititoo and Fuecoco i also love the final evolution of Quaxly it reminds me of a dancing peacock.",
        "Crab king",
        "It’s only November 17 how have you spent 30 hours in Pokémon scarlet",
        "U missed a shiny cetoddle lmao",
        "Because funny cat",
        "KJ I need your help I can't beat the Electric Ball and I'm in Pokemon Arceus I live in Illinois okay please help",
        "I choose because it has a fricking weed leaf on it",
        "Koraidon sounds like this wind announced kor-ride-on that’s what it sounds like not to hate just wanna tell",
        "Dudunsparce is the single largest disappointment I’ve ever experienced.",
        "I spent 30 hours on Pokémon Scarlet which is a part of a major franchise that pumps out games more than what a Chinese sweatshop produces on a good day.\nI progressed through the game with my personality being a screaming crack addict and eventually I realized that after I made some huge progress! Wow! Amazing! The game progressed you along and you became way more powerful! Now I am going to show everyone that this a monument to human innovation, and that this totally doesn’t happen commonly in other video games! Especially since I think a person can do this in like half the time you did.",
        "at least u didnt miss a shiny lechonk like purplecliffe",
        "I what the cat green cat",
        "Guy got Godzilla on his them",
        "If you insult the cat . I will be under your bed",
        "I’m picking spriggatito because it has actually good evos",
        "Im actually picking sprigatito ",
        "What the heck you died by a freaking car",
        "There’s no possible way you could’ve done this 30 hour thing yet. The earliest version of the game isn’t more then 18 hours earlier then other release times",
        "🫥🫥🫥🫥🫥🫥🫤",
        "speed run any% of fastest time for a fully edited video of the new generation",
        "Are we just gonna not talk about the shiny pokemon at 24:12 he passed?",
        "Bro did something worst than a crime 38:26",
        "The best paldea IS meowscarada",
        "Also Larry might be my favorite gym leader ever haha. Seriously he 100% embodies normal type. I just imagine a bored office worker voice like the original Jake from State Farm.",
        "alt title \"Kilowattrel is broken!\"",
        "Keegan J you live in Australia u got the game early",
        "Hi Keegan, \nI love your videos! I think you would love the game Temtem. As its very similar to pokemon. But the npc's are so much better. And so is the battle style.",
        "First time he said this to like chunk when he was loading in the air wait a minute, is that a low holy shock",
        "I like Sprigatito for a few reasons,\n\n1. I love cats.\n2. It makes the game more challenging.",
        "I like that Rose actually reacts to the environment. Her breath gets heavier when its spooky and she also stops and comments on stuff like the hands hanging from the ceiling and the messages from the teddys. Makes it more immersive that the characters themselves are also creeped out and not completely unfazed by it.",
        "COCO AND SPRIGATITO THE BEST ONES >3<",
        "rip shiny garydos",
        "Crown emoji",
        "Hope you have big",
        "How did he play the game for 30 hours, record and edit it before the game even released?",
        "Is it even playable with all the performance issues? I'm holding off until the worst gets fixed.",
        "can we agree that quaxly is the best starter",
        "9:51 I can't tell if this is just the lightning of the game, but I'm pretty sure you missed out on a shiny giant pig...",
        "Well the grass gym would be easy for me, I'd send out my Fuecoco(Chad), which has a charcoal which boots fire type moves, I wouldn't  Terastallize immediately but save it for when the Sudowoodo comes out so I can the wipe it off the earth. Pretty good plan if you ask me.",
        "HE LET GO OF A SHINY!!!!!!!!! THIS GUY HAS NO RESPECT",
        "The amount of emotions this episode put me through had me full of tears. these heart to heart moments between kratos and atreus alone are the reason i love this game so much.",
        "Listen can we just agree sandwiches  are just they key to life now",
        "I only ever lost once, which was against the arven fight.",
        "Sprig",
        "The cat the best no argument",
        "The fact that people originally believed a CEOs attempt to shift blame to an individual well loved composer is insane to me.",
        "KLAWF LEGEND",
        "Hiiiiiiiiiiiiiiii",
        "# Crabking",
        "69 k likes",
        " all bow down",
        "I enjoyed the game, granted the plot armor at the end felt bit tooo much for me, just let me do it on my own",
        "give me weed cat. GIVE ME WEED CAT",
        "First generation where I’ve boxed my starter immediately. Used the spider dude as my starter",
        "spirgatito filnal evo best base stat spread of the three",
        "Cute",
        "I smoke weed",
        "Scarlet and Violet look beautiful can’t wait to play tomorrow",
        "I chose the grass type starter for my nintendo version of Scarlet. I think that a magikarp can beat legends arceus",
        " Lets Go Klawf!!!!",
        "I would choose quaxly",
        "pick me NOW PLS",
        "3:15 I don't remember ever being able to dress up as Cynthia or any other of the other trainers in previous games ",
        "I will choose the grass cat",
        "I'll be playing the game tomorrow but I cannot resist the urge to watch you play it. This is just so beautiful",
        "Yeeeeeeess finally someone who likes quaxly",
        "Im mad",
        "I choose sprigtito because I like it and it reminded me of my cat so yeah and also it’s better then your qaxly",
        "I watched your videos like 1 million times I love them keep up the good work",
        "You missed a shiny at 24:13",
        "I KNEW IT the professors were sus this whole time because they were not named after trees.",
        " the crab king",
        "It’s so funny when he mispronounces stuff",
        "The cat Magician has recently been the MVP of my run so I love him so much",
        "Crown Emoji",
        "Man ion try to sound old or anything but i need a pokemon game like pokemon silver or even ruby ffs",
        "Good commentary, jokes and showing the actually important parts of the game. Since I don't like this game, yet want to see what it has to offer, this video is perfect",
        "Can we get only grass type Pokémon in Pokémon scarlet",
        "This game may be a broken mess but I love it",
        "\"And it turns out that the professor is actually a robot with an evil AI that want you to battle and defeat it!\"\n\nThat part actually threw me for a loop.",
        "you should have used salt cure with naclstack. Its an op move",
        "DOMINENCE to all the g pokemon that saved this man",
        "That first game was the best game ever watched",
        "Starter",
        "I wont watch it until I played it myself, but can you please tell me if you found a chinchou or lanturn?",
        "For the first time, this fire type isn’t the go to starter Pokémon and the only decent one, quaxley is the only decent one now, but Ngl none of the starters are good",
        "38:28 WHAT",
        "klawf the crab KING!!!",
        "Sprigatito because it has a mariuana leaf on its head",
        " crabs",
        "looking at these new pokemon starters, I feel like choosing a grass type for my first time",
        "Insult Spriatito one more time and I will unsubscibe  >:(",
        "Wow people are already playing it right off the bat. I’ll play it once finals are over for me. I can’t wait to experience it for myself",
        "I pick the grass cat"
    ],
    "comments_disabled": false
}