{"video_id": "vIV8-m-iYTk", "comments": [" QUESTION: Which starter are YOU picking in Pokemon Scarlet / Violet? \n NEXT: Can JUST ONE Magikarp Beat Pokemon Legends: Arceus? https://youtu.be/QE_DJ-zA2pA", "We could always count on ethan to throw and give us these priceless moments", "I like that Rose actually reacts to the environment. Her breath gets heavier when its spooky and she also stops and comments on stuff like the hands hanging from the ceiling and the messages from the teddys. Makes it more immersive that the characters themselves are also creeped out and not completely unfazed by it.", "I love Dudunsparce. It's like a troll to people who want Dunsparce to evolve into some kind of majestic dragon like it does in a number of fangames. Shit's hilarious.", "I love how he can never disappoint us with his content", "Crazy how things can go from a yiff joke to a well written emotional ending. Well done and I can't wait to see the end of this arc. :-(", "One of the best things is that he never takes credit for himself when he achieves something. He always respect us, the audience, and his team, and he is always polite in all of his videos. We congratulate ourselves on this achievement. More to come and everything to come", "What I love most about the Zoren kill counts is how they have such a different style and vibe to the James ones. Same when Chelsea does one too. They don't just feel like a different person reading a James script. They all feel unique to the person hosting it.  That's awesome. =O:) :]", "I'm new to the channel but I wish I had found him sooner. His dry humor, the roasting of his peers, the commentary about random things, his genius fight strategies.... I love it. May his family find comfort in this sad time :-(", "Not gonna lie, Tinkaton is appearing to be my favorite from this gen. Can't wait to start playing it tonight.", "Kratos getting down to Brok's level to present the spear and Brok agreeing to the blessing is one of the greatest examples of character growth I've seen in a game. I thought the game couldn't top the Freya therapy session in Vanirheim and then it just keeps getting better. It's so well written.", "Can't wait for the pain Keegan will experience in challenges.", "absolutely love it, the suspence before you get to 0 players ahead of you, heartbreaking knife twisting server disconnects, relaxing and almost meditational waiting on the loading screen - all of this is so ground breaking, a true anthem to minimalism, just one single loading animation, counter, muted grey background and a logo of the game, what a masterpiece!", "I want to watch it... But I don't want to be spoiled \n\nEdit: why are some people so hostile just cuz I said I don't want to be spoiled? It's my opinion, I'm literally a grown woman just not wanting to get spoiled on a game I like. I don't care if \"it's the same story over and over\". The mechanics, the characters, the Pokemon, the basic plot, ect, they can all be different. It's a nostalgic franchise to me since the Sinnoh region. So please, stop being so hostile twords each other and twords me for having a basic opinion. Have a good day or night. Though I highly doubt some of you have a good life since you wish to get so hostile with me just saying \"I don't wanna get spoiled\" on a freaken game.", "I'll be playing the game tomorrow but I cannot resist the urge to watch you play it. This is just so beautiful", "Can we all agree that ancient salamance is one of the coolest looking Pokemon ever?", "First few minutes in: I beat the champion, and got the legendary… I think we just made it to the end game.\n\nBro that cracks me up, haha ", "you made a fun and wholesome experience out of a game that annoyed, saddened, bored me and made me wince harder than pokemon insurgence, good job.", "Seeing Jev genuinely enjoy a game while he does a camo grind is such a wholesome thing to me.", "The amount of emotions this episode put me through had me full of tears. these heart to heart moments between kratos and atreus alone are the reason i love this game so much.", "Thanks!!! Ive absolutely enjoyed learning about this game from you! Cant wait for more. \n\nBeen a Pokmon fan for 20 years but I sometimes feel like since I wasnt the biggest into gaming that I miss things and dont have good strategy skills. I really appreciate that you tie everything together to all your previous Pokmon knowledge while also telling as much information as you possibly can. I seriously learn so much from you O:-)", "watching mark's blood pressure skyrocket during this is truly an experience live", "looking at these new pokemon starters, I feel like choosing a grass type for my first time", "Can We just appreciate how much work he put into these videos", "11:22 I'm actually not too surprised since ultra moon(my second Pokemon game after alpha Sapphire lol) there was a Pokemon that possessed your I think Pokedex and was basically your talking menu. I always figured they could of do more with that with I'm guessing the ghost types as I can't see Pikachu fusing with a car .", "by the way I love your vids you always keep us entertained even when your struggling. I know you put sooo much effort into your videos. good job :)", "I love how siglis can't do anything bc he's always trapped, It really made my day, I also love how he's just tormented! :*", "Fenrir crawling closer and closer while Kratos and Atreus argue is both hilarious and cute as hell.", "the fact i really want to play with them some time makes me so happy", "You be having me laughing way too hard", "7:50 Lui making light of his situation is priceless", "I love to hear in ur voices that you are energized and giggle \nHappy is a good emotion, I can tell in some videos you see as work and ones like this as playing with friends.\nStay mentally healthy and don't over work yourselves.", "This is honestly the best scarlet and violet video I've seen so far", "has been a while I have laughed so much haha. you deserve a sub!", "Ending is actually INSANE...", "The fact trainers don’t see you to battle anymore but use their own strategies to lure you in", "3:38 has been a while I have laughed so much haha. you deserve a sub!", "Watched every single of your videos gotta stay loyal to your favorite channel", "his videos. We congratulate ourselves on this achievement. More to come and everything to come", "NO SPOILERS!!!\n\nBut that ending is actually pretty mad", "i got sprigatito, even though i knew it wasnt gonna be bipedal in its final form i just really like cats and that animation where he cuddles the player while on the latters arm just killed me too cute", "The transition from the Pixar lamp to the boat train, that was incredible", "I havent watched Your videos in a while glad to know that youre still making these fun and cute vids =)", "cant wait for the challenge runs of this game", "I'm so happy Lui and Velocity is back, hopefully we get more Gta videos again. It would be so refreshing since it's been ages.", "I think I've been put under mind control. Every time I see one of grays videos, I instantly click on it.", "You're more helpful than you realize.", "I never said I'd like the video, if you released your shiny gyrados! That being said, I actually enjoyed watching your playthrough, so here, a like for you! Good job, are you also going to do the other game?", "My boy getting the recognition he deserves", "Banger as per usual king keegan ", "This game looks epic!", "Hi Keegan, \nI love your videos! I think you would love the game Temtem. As its very similar to pokemon. But the npc's are so much better. And so is the battle style.", "This new Games are so much fun, no matte how many bugs or bad frames they are. <3", "The fact that you have a psuedo, named baxcaliber, is the coolest thing I have ever seen.\nI also was surprised when you released a shiny gyarados", "Love the vids, keep it up!", "Wow people are already playing it right off the bat. I’ll play it once finals are over for me. I can’t wait to experience it for myself", "i like that the gym leaders use one pokemon that isn't their type but terastalise to their type. The levitating electric mismagius and the hilarious real grass type sudowodo are clever. makes battles less easy and more entertaining thematically", "33:58* Lets just take a minute to appreciate how much time and work she put into these videos?* It's unbelievable, and I think they deserve a lot more than that", "Seeing Velocity HD play with them again really brings back memories.", "Hey. American here. Its night and tomorrow we get this game here in North America. Just wanna say your videos helped me a lot. Been going through school stuff and it was hard, but your videos made it seem….. Somewhat easier. Thanks bro ", "11:30 this is exactly the type of boss we needed in sun and moon vsing the nihelego fusion", "What a certified good boy had me dying", "ohhh my heart hurts so much....the character development...the doggo friend...the fact that they almost ended up like that sailor and son quest and then they pulled together before it was too late....you can see how aged kratos has become...absolute masterpiece", "I did NOT expect Lui to return at all. \nAnd add VelocityHD as well... perfect.", "Spigittito is such a good Around Pokémon for this game. There is a lot of ground and rock type areas same with water. The titans also have weaknesses to her type.Quaxly is a close second because of the rock and ground areas and overall design. I was going to pick the fire croc but I dislike it’s evolution. I enjoy the design of weed cat and I been wanting a better cat then meows or purloin the dark cat mon for a very long time.", "I wanna watch so bad but I want this to be the first Pokémon game I go in without spoilers", "Finally another Quaxly enjoyer can’t wait to pick up my version tonight", "I watched your videos like 1 million times I love them keep up the good work", "I agree that Quaxly is the best starter! Also all hail clawf ", "The crossover we never knew we needed, been a blast seeing all these collabs between channels from different eras of my life lately. :O", "What makes this video better is at 16:06 he even gets a half bed spawn", "Dude, i cannot wait for Tinkaton to be one of the most busted non-legendary pokemon of all", "This dude is the best pokemon youtuber and the content is so funny", "The fact that they made me cry about Sarah.. a character that you know for only ten mins total is one of the most impressive moments in storytelling ever 8-) 3:-)", "Marty: Writes the open letter in an hour saying why Mick sucks\nMick Gordon: Proceeds to take 2 years writing a harry potter sized novel on why Marty sucks", "Evolving Charcadet took me ages! I had to try twice since my game crashed while hunting Sinistea to get the things needed to evolve it; I did find a shiny during that hunt so that's a plus", "This game may be a broken mess but I love it", "The pain I felt when my favourite shiny guarados was released", "I can't wait until tomorrow. I pre order both of them and I'm so excited. I just want it to be tomorrow already so I can just plsy them. I'm going to spend so much time in the open world. And I brought both BC it's s ritual for me. Plus one will be for s normal plsythrough and one will be for nuzlockes. Which I can't wait to do. Nuzlockes are going to be interesting in this gsme", "I swear once I took a look at Clavell, I was like: \"Damn he's evil\"", "Me: I'm just too excited. I don't want BIG spoilers so I'll just like half pay attention while I multitask\nMe: oh that's a big one right off the bat. Oh, that's a big spoiler. Oh. Oh wow. Ok well now I'm going to tune out for a bit...\nMe: tunes in for the biggest spoiler of all right at the end", "The reason I chose springatito, was because the others were good in attack or Defence, I wanted a good balance, plus the final form’s signature move is broken, always Crits(and springatito looks my real life cat but green)", "The fact that people originally believed a CEOs attempt to shift blame to an individual well loved composer is insane to me.", "When he released the shiny I was physically in pain", "The narration is top notch. Liked the vid because of that Gyarados.", "That's a WILD story for a Pokemon game, I love it. Actually really enjoyable", "Love a lot of the new Pokémon, but gameplay hasn’t improved significantly enough for me to pick this up at full price", "That Nacli is built like a mushroom from Mario combined with a rock ", "I'll bet that he will make a video named: \"can you beat pokemon scarlet with only lechonk?\" using a team of lechonk would be bomb", "Does the new games still have stuff like revive/potions/super potions or do you just ignore that sort of thing? Because you totally could have won more if you did have those items.", "May shiny gyarados rest in peace", "Great walkthrough", "this guy is amazing ", "depends on what the first 2 gyms are for what starter im choosing, best in gen 8 is scorbunny for it can be used against milo and u can catch a grass type for nessa or whatever her name is", "I've now spent several hours in it and I can safely say that I like Legends Arceus MUCH more. Its not even remotely close for me right now. Legends was such a special game, adding in tons of new mechanics, and this game doesn't have any of it. I could spend countless hours in Arceus just walking/sneaking up behind pokemon to catch/battle them, and have a blast. In this game, you simply walk up to the pokemon and start the battle. No catching them from the overworld, and no sneaking around etc. I don't even think the performance is that bad, so I don't care about that at all. I just think it's a major step backwards. It's basically like Sword and Shield but instead of certain open zone, the whole thing is an open zone. However, I am having a hard time even wanting to spend 20 minutes in the open fields because catching/battling pokemon is literally 100 times less fun than it was in Arceus. I also liked the story of Arceus much more too. ", "I almost cried when the shiny garados was released after the hour I spent on arceus for one", "i got so excited when i refreshed my subscriptions tab and saw this pop up! wasn't expecting any s&v content from anyone till tomorrow lol", "I really love horror games, vanoss and his crew make it even better", "This is my essay about why I make such bad decisions. First of all, it is a plant cat. I love the plant starters (except for snivy). And since the first team Star boss is fire type, I instantly regretted my choices.", "\"In its current form it can't battle\"\nHoundoom: \"Are you sure about that\""]}