{
    "video_id": "vXSxvuJAa8I",
    "comments": [
        "NGL, I expected something about NNN",
        "HAHAHA",
        "The christmas primal has been summoned, all that hear her sing shall be tempered.",
        "Instead of getting another half-assed Michael Meyers movie next Halloween, let's get a film where the true horror is the looming threat of Christmas creep that occurs before Halloween.",
        "I feel like she was right though. It’s like you need time to mourn something that only gets one day a year. And even then, there’s this aggressive push to “move on” to Christmas; it’s just unfair.",
        "Lucky... It usually happens Mid October for me.",
        "When ever I hear all I want for Christmas I can’t stop hearing the collective consciousness mashup",
        "At 0:32, I fell off the bed .",
        "Christmas has overtaken thanksgiving/most of November and July, I have no escape.",
        "If i see any christmas charolers at my door before december 16th i will literally slap them",
        "Love the cutesy vibes, even as the Carey approaches",
        "souds about right",
        "Yay, Christmas. I enjoy it more than Halloween mainly cause Halloween is not a thing where I'm at even if people try to make it a thing",
        "Hahaha  \n\nYep, literally that. On November 1st all the stores that had Halloween decorations on sale started selling X-mas decorations...it is scary how fast they can made this transition man ",
        "No little Jocat, don't go towards the door!\nOh mine got, she's thawed out too early!",
        "Halloween is always in our heart",
        "fucking gold",
        "I'm getting my broom incase for this massive pile of humbug (cause it's invaded spooky month already) \nP.S the animation is adorable as always keep it up",
        "Man it do be like that. The greatest holiday is over, now we are subjected to two whole months of... Christmas. Shudders",
        "This is exactly what happens in my neighborhood. No exaggeration. Christmas wall of death and all.",
        "I think I overestimated this \"extreme bass\".",
        "There is a War on Christmas and christmas began it by invading Thanksgiving, if we don't fight back it could take over Halloween next, and if Halloween falls there isnt a Holiday strong enough to stop Christmas from invading all the way to the 4th of July.",
        "Scariest part of Halloween is the coming of Christmas.",
        "Every year Halloween ends.",
        "BECAUSE NOVEMBER IS JUST A PREQUEL TO CHRISTMAS RIGHT!? . . . .",
        "Black Friday \"Christmas\" committing BnE again this year it seems. \n\nI hate Black Friday, both October is better and you can even do the gift giving and feasting on Samhain just like Black Friday Presents Day. Oh, also that holiday that's in Black Friday, I think it's called \"parade day\" or \"your welcome Thursday\" or something.",
        "As someone who works in a discount store that has just started playing Christmas music I feel every bit of your pain.",
        "No little cat boy not the mariah carey cave!",
        "IT'S CHRISTMAS SEASON JOCAT!! AND YOU CAN'T STOP IT.   WHOOOOOOOO!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "Halloween is over? Isn't it still October 45th?",
        "Wasn't there supposed to be another Holiday between Halloween and Christmas?\n\n....... eh it probably wasn't important anyway. Lol.",
        "i cant believe Mariah Carey breached containment again this year, my condolences to you Jocat",
        "I guess Santa Claus is coming to town.",
        "Fact",
        "Base boosted mariah scares me",
        "Wait, that's the 'i like big girls' guy",
        "The Goths hold the line",
        "People always forget thanksgiving",
        "True so true",
        "Legit got me cackling this morning. Great comedic short.",
        "Yep. I experienced this at work last night. WM Radio played a Pop/Punk version of that song.",
        "This is why I have grown to hate Christmas. People (mostly corporations) have pushed it so far down our throats that it is almost year round. From Halloween to mid January and the. Half the summer for Christmas in July.",
        "I was born on Halloween and I love it.\n\nBut I LOVE Xmas, cause it's a time for love and warmth.",
        "I DON'T CARE ABOUT THE PRESEEENTS UNDERNEATH THE CHRISTMAS TREE",
        "lol",
        "Remember folks.\nEvery time you mention Christmas in November, Santa has to execute another elf.",
        "I was just like, “GET DOWN MR JOCAT!” But I was too late…",
        "I find it funny how everyone just skips Thanksgiving these days. Like hell I was at Disney World for their Halloween party and the very next day they had Christmas lights and decorations set up already.",
        "NO LITTLE JOCAT DON'T OPEN THAT DOOR!!!!",
        "FELT. THAT. JUST GIMME LIKE AT LEAST 2 WEEKS INTO NOVEMBER OHH GOD NO- dies",
        "Honestly I hough Joecrap was gonna burst through that door with. Christmas tree and a horde of goblin bringing presents but his works too",
        "Unfortunately the foundation was once again not able to contain Mariah Carey god help us all.",
        "Halloween is over when we say it's over. Since Christmas insists on expanding beyond its December borders, the citizens of Halloween must respond in kind. Charge forward, boys and ghouls! Meet them where they are! Vengeance for Thanksgiving, so cruelly annexed! Vengeance October, whose borders are violated!",
        "She’s so cute!",
        "It's in fact getting even worse! I found some stores that had Christmas stuff mid October",
        "Stores : oh it’s 11:59 on October 31, 2022 better get the decorations ready\n\nMe : oh no you do-",
        "My friend and I drove from California to Oregon on November 1st. We were both admiring the beautiful fall foliage before I saw, looming over us through the fog, a snow covered mountain. And before we knew it, BAM! SNOW EVERYWHERE! And if that wasn't the most perfect visual metaphor for that day, I don't know what is.",
        "Or you could be like my workplace. Getting the Christmas inventory put out before Halloween and then gradually phasing the Halloween stuff out throughout November.",
        "I knew where it was going",
        "tbh there is absolutely no time between the end of halloween and the start of the rest of the holidays  there is zero time to really mourn the death of halloween just like echo said ",
        "Yes! It’s so much better cause it’s snowing today!",
        "thanksgiving: Crying in corner",
        "NO TIME TO BE SAD! CHRISTMAS NOW",
        "Mariah approaches. Prepare.",
        "1 of October: yayyy halloween :D\n1 of November; CHRISTMASSSSSSSSSSSSSSSSSSSSSS YAAAAAAAS",
        "I love Chrisman though",
        "Jocat has a sword hanging on a coat hook by the front door, just like me!",
        "What the consumer see's isn't as bad as what corporate sees. Back rooms and grocery corporate HQ getting stocked and prepared as early as August. It's all about competitive money making in the end.",
        "Bro this Halloween I literally saw a Christmas add, like bruh can you not wait for Halloween to be over, you really gotta invade a Holliday?",
        "Ah yes, when the Superstores switch from halloween merchandise to Christmas merchandise ^.^",
        "One electronics retail store in my area didn't even wait for Halloween to be over to start putting up the Christmas decorations! It was only the 16th of October and they had all the decorations up XD",
        "comm for algo",
        "Mariah is thawing out from her tomb, run.",
        "I felt that ",
        "Well you’re not wrong",
        "SHES DEFROSTED!!!!!",
        "This just made my morning. Thank you JoCat ",
        "Once you take off your Halloween costume, Christmas music is already playing and it drives me insane! ",
        "This had me laughing out loud xD\nUnfortunately I only know one if these lovely voices, who is the other?",
        "Even hearing that song muffled through a door gives me chills.",
        "Yessss <3",
        "In my country we don't celebrate Halloween so if october starts, Christmas decorations start appearing like they are spawning in stores.",
        "Truer words have never been spoken in the history of true words",
        "They didn't even wait that long this year there was Halloween stuff being taken out of the stores before Halloween even happened... I saw Christmas stuff like the week before Halloween entering my local shops!",
        "XD I agree though",
        "",
        "Halloween is over and the real horror begins XD",
        "I don't want a lot for Christmas...\nYou heard it in your head as you were reading that.",
        "I work at a grocery store. Literally a couple days after Halloween, the store started playing Christmas music. But the weird part is that, halfway through my shift, the Christmas music cut out, and regular music started playing. It's been over a week, and still no sign of the Christmas music (tho there is plenty of Christmas themed food/candy in stock)",
        "Without fail. soon as the clocks hit 7am the next day. this.",
        "Remember guys! Thanksgiving isn’t real",
        "People just love excitement so they want to skip right to the next holiday.\n\nThough it's sad no one does anything for Thanksgiving.",
        "Lol there's already eggnog in stores. I got some! No regrets, it's good :)",
        "You forgot about thanksgiving",
        "This is the third animation I've seen now where Mariah Carey is the equivalent of a Christmas Nuke",
        "I felt this in my soul",
        "If it helps, in some places Christmas can be celebrated like an extension of Halloween.  There are Christmas tales of horror.",
        "omg nicssses time so cute!!",
        "She is the one primal we cannot slay, though we can hold our own by holding Halloween in our hearts... That and scream This is Halloween at speakers blairing the song.",
        "I remember a few years ago I saw some houses with Christmas decortications, in mid October... The spooky season needs it's time, otherwise the joyous season will see some crime!",
        "literally",
        "I am dreading when my workplace replaces the garbage music cycle with repetitive Christmas stuff for the entire month. Nothing but like 6 songs playing over and over and over and over...",
        "I deal with gas stations selling Christmas Scratches and Cakes by Oct 10th at the latest.\nHalloween gets no respect and Christmas invades and overtakes EVERYTHING",
        "OMG! FKN YES!!!!  No better depiction of the truth!",
        "Its NNN brothers",
        "The goth kids hold the line",
        "That was great.",
        "u have somehow managed to add so much bass to the point of none at all",
        "Do no one celebrate THANKSGIVING FOR GODS SAKES",
        "Wait you all get to Nov 1. Before that happens? Shoot that's starts happening closer to when school starts up.",
        "Aw Yea, time for the best time of year. I must go join the seance to awaken Michael Buble.",
        "SO RELATABLE OMG",
        "Protip - May I suggest Spongebob's \"Very First Christmas To Me\" as your holiday song of choice?",
        "Rip Jo and other person who I was not able to identify (my apologies) they were crushed by the weight of an eerily accurate meme.",
        "Halloween is the only bulwark against the Christmas music playing multiple times an hour. Unfortunately, each year the bulwark weakens and a few songs slip through before the 31st",
        "Well time for Mariah Carey to have a career for the next 2 months",
        "As I like to say, you know it's almost one holiday when stores are decorating for and playing music for the next holiday, lol.",
        "That's one way to start off my morning.",
        "Halloween can be every day if you keep the spooky in your heart and your decorations up.",
        "Shoutouts to Halloween. Our final champion after the defeat of Thanksgiving.",
        "Winter is coming.",
        "I have friends who were singing this song in September",
        "this is a certified retail moment.",
        "meh the bass couldve been worse",
        "Bro make a alternate version where you play collective conciessness synced to all I want for christmas",
        "The Goth kids hold the line",
        "THE BEST HOLIDAY IS COMING",
        "Average christmas fan when November hits",
        "If anyone want to know the reason Christmas decorations go up in September:\n\nAny big event in December needs to be budgeted for in September, so stores need to have inventory out on the shelf or they lose out.",
        "funny, 'cos it's true good stuff, Jo!",
        "I love Christmas. There's just something about the feel of the Winter holiday that hits different. It probably has to do with my childhood and my Mom. The little rituals we had that carried on through the years and gave it a unique feel. Hot chocolate after shoveling the driveway, skin prickling as it warmed near the heat of the fire, or the heater vent any time we didn't have a fireplace. Opening a single present on Christmas Eve, at least on years we could afford them.  The list of movies Mom insisted we had to watch because of 'tradition'.",
        "JoCat, you are too freaking innocent for this world. Not to mention really funny.",
        "As the last bastion falls, Mariah Carey begins to stir from her slumber once more",
        "I knew exactly where this was going.\nI'm not bragging; Just stating a fact.\nA lot of you probably did, too.",
        "My mom",
        "I’d like to pour one out for all of the “Jack Skellington as Santa” merch for covertly sneaking Halloween into the local Walgreen’s every December.",
        "me",
        "SPC#01225 has breached containment",
        "This made my day, it always feels like Christmas is smothering out thanksgiving and I hate that. Love you vids tho Happy Holidays! =P",
        "Each year, in the darkness of winter…she returns. Her siren call, a portent of her dreaded reign…echoing in the halls of every retail store…",
        "It’s not even thanks giving!",
        "Ah. The retail workers bane. I know it well.",
        "Trust me Jo, I work at a grocery story and I certainly feel that. No joke, came back Nov 1 - Christmas cookies were already on display where the halloween candy had been!",
        "One day Christmas will consume all of time.",
        "Loved the video had the same energy of an old video by Zalinki. Let us mourn the passing of Spooky Season",
        "We laugh now, but eventually Christmas will invade every month until we are left with nothing but nukes and Christmas music.",
        "LOL! Okay, that was great!",
        "The fact that no one cares about thanksgiving",
        "DAMMIT CHRISTMAS, I JUST WANTED TO SEE ECHO AND JO CUDDLE ADORABLY, WHYYYYYY",
        "When you hear that damned song, RUN!! XD",
        "HASHIRE SORI YO\nKAZE NO YOU NI\nTSUKIMIHARA WO\nPADORU PADORU!!!",
        "Well done for capturing exactly what  it's like. I like how the flood of Christmas just decimates everything in it's path.\n\nI also noticed that there's a sword hanging next to the coat and umbrella. Nice touch!",
        "Now it's cold  ",
        "We have 4 days of hollows eve",
        "Sad thing is my reality for once Halloween is over, straight to Christmas hell",
        "This is amazing! I genuinely laughed out loud :D",
        "Forgot to depict thanksgiving being utterly ignored in the rush. Otherwise perfectly accurate",
        "Tis the season, whether you want it or not!",
        "ITS LITERALLY NOVEMBER NOT DECEMBER ",
        "I’ve always hated that everyone just hops on the Christmas train when it’s BARELY NOVEMBER!- \n\nEven my own mother told me to get the Christmas decorations 5 days ago on the 10th of November. SHE DIDN’T EVEN TELL ME TO TAKE OUT ANY NOVEMBER DECORATIONS- AND SHE EVEN KNOWS MY FRUSTRATIONS ON CHRISTMAS BEING TOO DAMN EARLY BC IVE SAID IT IN FRONT OF HER MULTIPLE TIMES-  ",
        "\"Wait why do I hear boss musi-\"",
        "I've already been inside 2 house with the Christmas decorations up. What happened to the 2 week rule.",
        "I wish others enjoyed Thanksgiving as much as I do.",
        "is that a ms JoCat??? has our boy made a win for the boys??",
        "The fact that you guys weren’t seeing Christmas stuff in fucking August means you live in a better place than me.",
        "that good",
        "Marry Christmas, or else... - Robot Santa",
        "Yes and I hate that Christmas starts that early... I am more than happy to get into the Christmas spirit in December.",
        "I don't know the feeling we don't celebrate Halloween here",
        "New D&D move \"ELDRITCH CHRISMAS BLAST\"\nLvl 20 people:\"Eldritch Christmas blast test 1\"\nJocats house:No stop wait!Too late...",
        "It killed the turkey.",
        "My birthday is Halloween, so this hits harder :'(",
        "Witch girl so cute",
        "Another reason we fear the end of halloween is because of NNN",
        "bro I was getting christmas decorations at shopping centres BEFORE halloween",
        " The movie they’ll be bundling up and watching will be Christmas themed. Corpo Claus isn’t taking no for an answer on that one.",
        "Thanksgiving crying in the corner",
        "Mariah Carey is at the gates! Run! RUN!",
        "Mariah Carey does not respect the Sanctity of Día de los Muertos",
        "You enjoy Christmas, great, Christmas makes your year, I'm happy for you, honestly. But! BUT No other holiday sets up THREE, THREE holidays Prior!!! LET OTHERS ENJOY THEIR HOILDAYS!!!",
        "I am very happy we have a holiday prior to chistmass cause you know... 3 weeks of it is already way too much. you guys have to deal with it for a whole damn month.",
        "It really shouldn’t extend outside of December. I don’t want to already be thinking about what gifts to buy!",
        "That's it. Someone needs to make a horror movie about Mariah Carey.",
        "OH F-\nGosh it really felt exactly like that when I worked in retail. XD Just the DBZ laser beam of Christmas",
        "Mariah Carey claims yet another victim. o7",
        "At my work we started setting Christmas stuff up 2 months ago",
        "Usually corpos wait until december but this time I saw chrismas decoration DURING halloween. Nothing is sacred anymore...",
        "i stayed up on halloween, and midnight nov 1st, i got a christmas ad.\n\nthe only thing that keeps christmas from creeping up in july is halloween.",
        "Since we're more aware of Christmas than Halloween here (and we also don't make such a thing of Christmas itself that every other place starts blasting Christmas music and stuff), I really clicked this video not knowing what was going to happen. Had a nice laugh, I approve.",
        "Well, something has to keep the capitalism wheels turning (mourning doesn't quite do it) ",
        "Dawww the animation is super cute (^_^)",
        "Hahaha, 100% accurate.  Also can we talk about how adorable that \"Mmm Candy\" at the very beginning is?",
        "No no noooo...not the horrible modernChristmas music!! (Frantically puts on headphones like a COPD patient putting on oxygen)",
        "I keep on rewatching and It gets me each time on \"OH FU-\" ",
        "I love how you drew echo",
        "as a retail worker it do be like that",
        "True+",
        "Funny how it's a season about cheer and generosity but It feels more like a season  for over consumption, greed, and stress.",
        "The 2nd best time of year yields for the best time of year. No not Thanksgiving, that's called an ineffective speedbump.",
        "As a recovering retail employee, this exactly models the flavor of ptsd i get from that fucking song. -_-",
        "This just made me laugh out loud! (emphasis on the loud) This is so true!",
        "Christmas time in here like World of Light.",
        "I igree, my family builds the christmass tree the 1st of november",
        "IT'S NOT EVEN THANKSGIVING YET",
        "so you watched zalinki to",
        "Halloween ends, NNN begins and then it's 'PADORU PADORU' time kkkk",
        "Halloween is overrated.",
        "I know how we fix this: give Thanksgiving more songs and aesthetics.",
        "A+ work, SSR rank commentary on infernal xmas music being everywhere... even before Halloween had passed! Eff off xmas, I still have a ton of work to do this year!",
        "Fake and unrealstic; the snow and music should have come bursting in 3 weeks before Halloween.",
        "*equips drum stick * NOPE! NOT TILL AFTER THANKSGIVING!",
        "My favorite add on to this joke is SCP Foundation tweeting that they once again failed to contain Mariah Carey.",
        "So November is just basically a month and a half long Christmas Eve ",
        ":( it Alyssa hakin go to fast I CAN'T HALLOWEEN BE A MULTIPLE MONTH THING",
        "Bro wtf is that she-hulk",
        "Beware adventures.. of the banshee of wanting during November and Xmas times…",
        "\"I'm so excited for Halloween next week!\"\nCorporations; \"Oh, it's Christmas already?\"",
        "ALL I WANT FOR KRIMAS IS YOU!!!!",
        "I will say that in our blind hatred of Christmas, it's actually been improving in terms of general aesthetic",
        "Christmas carols can burn in hell, so glad I don't work in retail or listen to the radio anymore. Grocery stores are the only source of this cancer no one can escape",
        "get the gun",
        "November has come.",
        "Zalinki reference",
        "My friend Aaron and maybe like after Halloween Halloween is better",
        "This is why we need to make Thanksgiving more important! It gives you the time to recoup from Halloween and get ready for Christmas. It's a breather holiday with mostly healthy food!",
        "I know a lot of people love Christmas, I am not one of them. When you start seeing it in August, hearing it in October, mid November you are kind of sick of it, then Black Friday hits and everyone loses their mind for it. For me, by the time December actually does come around I am so sick of it and just want it to be over.",
        "Yay Christmas :) \nBut also, can it PLEASE wait until December?",
        "now i have to go find that video where the dude grabs his gun as shes singing on his roof",
        "i have a personal rule that i follow, no christmas anything until after the 11th.......baring eggnog",
        "AND THEY JUST SKIP OVER THANKSGIVING LIKE ITS NOT IMPORTANT,",
        "SHES COMING!!!\nTHE BRINGER OF CHRISTMAS!!!\nRRUUUUUUUUUUUNNNNN!!!!!!!",
        "Hashire sori yo...\n\nKaze no you ni...",
        "It really shows I never worked in retail because I unironically love that song ",
        "Pretty sure death by Mariah Carrie constitutes as cruel and unusual punishment.",
        "As a retail worker who had to start putting the Christmas merch out 2 weeks BEFORE Halloween because we were so afraid of running out of room in the back, I feel this in my very soul.",
        "I respect that you atleast waited till after remembrance day before posting xmas content, even if it's making fun of how quickly xmas content starts.",
        "Christmas used to be something I always looked forward to, now it fills me with fear",
        "I can't be the only one who heard \"It'll be a knife time\" right?",
        "You see it's not that I don't like Christmas... I'm just a little envious that Halloween doesn't get celebrated nearly as flamboyantly as Christmas, well besides the costumes maybe but you get what I mean",
        "LOL. So true. Christmas is my favorite holiday. However even I am annoyed by people hyping it up too early. I notice it in the stores. I think of the year as divided into eight sections based on the seasons. There is a special day to mark the beginning of each section. Halloween and Christmas are both such days. I would like to make it rule that each special days has to be hyped up after the previous one. I have seen Christmas stuff hyped in stores before Halloween. That is way too early. It isn't fair for Halloween. We should wait after Halloween until we do Christmas. There is Thanksgiving in between, but I am not worried about that. I have seen Halloween have the same problem as Christmas. September 21 is a special seasonal day, even if it isn't celebrated by the mainstream. There are times when Halloween is hyped up before that time. I still think it is too early.",
        "This animation is as 100% accurate to the holidays as a Carbot animation is 100% accurate to whatever game he's meming on at the moment. :3",
        "Please tutorial to draw gobbo",
        "O lawd she frostin",
        "The spookiest ghost of Halloween is the Ghost of Christmas About to Rise. Appears every Halloween season and chills me to the bone every single time.",
        "honestly gets me mad seeing christmas stuff up in october and november...stick to your own month christmas!!!!",
        "every. single. time.",
        "Taken Sic Basy Drops dmg to the ears",
        "I hate how Christmas tries to overpower the much more important nonstop-Nut-November celebration",
        "YES",
        "this is not wrong",
        "Let us all remember to give thanks to Halloween, the last bastion keeping Christmas from creeping further into the year like a cancer.",
        " i totally lost it. this is so good! ",
        "so i'm not the only one who feels this way...",
        "Why does this keep happening. every. Year?!",
        "Damn you, Mariah Carey!!!",
        "Played this on my trucks system...I can confirm that the bass hits hard.  ",
        "This year that happened before Halloween even ended.",
        "The Christmas Encroachment expands every year.",
        "Truuuuuuuuuuuueeee",
        "I was initially expecting this to end with someone trying to have all the candy for themself",
        "Man I love your animations, I would also love to see your overly edited or maybe some stream highlight stuff again",
        "Zalinki",
        "Christmas, the true eldritch horror of Halloween.",
        "I love that this cute little shit post is on trending",
        "Christmas is inevitable.",
        "And so it begins once again…",
        "I mean, I welcome it, but still, very funny",
        "All I want for Christmas is you unironically slaps and I refuse to change my mind or apologize",
        "this is way too real",
        "Dread it, run from it, she finds you all the same",
        "Basically just sat here and wondered, is this nnn or christmas",
        "i swear to fuck cant people let us have thanksgiving before they start throwing christmas shit at us? i straight up cant use one of my radio stations anymore because its 95% christmas music by volume ;-;",
        "You and Thomas Sanders both get this so right.",
        "There were stores playing that song BEFORE Halloween where I live",
        "Oh gods she escaped containment!",
        "Fun fact: Here in the UK we started seeing Christmas items in our local shops in F***ING AUGUST this year. They didn't just skip Halloween, they skipped the entire season of Autumn!",
        "nooooo......nnnnnOOOOOOOO........NNNNNOOOOOOOOO!!!!!!!!\"DEAD\"",
        "Merry x-mas",
        "stores the exact second its November 1st",
        "yes this is so fing true XD",
        "Hilariously sad, but true. I'll never forget the shops and grocery stores replacing all traces of Halloween... on Halloween... with Christmas junk. It's like a Peppermint Mocha Onslaught, rolling over the Pumpkin Spice Latte and Thanksgiving.",
        "Looks like the halls got decked",
        "People go balls to the wall with Halloween from august \nThanksgiving isn’t real and I will fight for my comfort holiday",
        "The fat man will retreat back behind the Thanksgiving Armistice line, or we the legions of the candy coma Halloween will carry our flag and be lead by our God Jack Skellington, and Storm the North Pole. He’s done it once don’t make us have to have him do it a second time!",
        "padaru moment",
        "every time you say \"Xmas is here\" in november, Santa kills an elf, think about the elves... and say it more often. (also last halloween was my b-day, as are all halloweens for some reason, so yeah, for my gifts I got \"older\")",
        "You know eventually there will come an age where Christmas stuff will be out year round, I mean it's already creeping it's way into September and who knows perhaps it'll stay out past January at some point. Where are we gonna draw the line people.",
        "Accurate, JoCat, very accurate",
        "Just the laugh I needed tonight, bless you ",
        "I’m one of the Christmas guys and we will conquer Halloween. Thanksgiving has fallen. Next year Halloween might fall to us as well. ",
        "This made me cackle so hard, as someone who really doesn't actually celebrate either Halloween or Christmas but enjoys watching other people's drama with the holidays this was just too real. ",
        "......where were the turkeys? why is everyone forgetting thanksgiving?",
        "\"Every Time Halloween Ends\"\n\nOne second after Midnight",
        "i absolutely love that cause that’s how my family is",
        "He just like me fr",
        "0:35\nTHE MUSIC LMAO!!!",
        "Me with a birthday just 8 days from Christmas\n\n\nAlso I have a  ad under this video advertising stockings",
        "Hahaha",
        "November who?? Nah, it’s straight to the bitter chill of joy!\n\nThis was really cute, it sounded like the two of you had fun with it ",
        "Once he realized what was coming..it was too late.",
        "I was Expecting the NNN Recruitment soldier to be at the door but this also is true",
        "Yeah, people just kinda ignore Thanksgiving.\n\nAt this point, the spooky skeleton army is the only thing holding back Christmas from taking over the rest of the year.",
        "As much as my wife loves Christmas she hates this concept because it skips over thanksgiving time now when he birthday is which used to have its own time to breath when we were kids. Christmas tree didn't go up till day after Thanksgiving lol",
        "Yas!\nIt's over now, it's dead.",
        "This is exactly how it is!!! All this year I’ve been waiting for the moment of Halloween, and there’s just Halloween ads, coupons, decorations EVERYWHERE. Where’s the love for Halloween gone?! I’m still over here wearing my Billy Butcherson sweater like:",
        "Legit how it feels",
        "Not gonna lie thought this wasgonna be an NNN video",
        "My two sisters (and now one of the elder's spawn) were born in the \"Christmas Zone\". JC's \"birthday\" has become a curse upon my wallet since my family has decided to compound gift giving on Christmas eve. This little skit feels very relevant in a weird way.",
        "Halloween sucks",
        "I hate how done dirty Thanksgiving gets",
        "i think She knew what was going to happen but just didn't have the heart to tell him",
        "I hate halloween",
        "He would have blocked it had he equipped the Sword and shield",
        "ef christsmas! Hallowed4life!!!!",
        "No time to mourn Halloween I guess. ",
        "LOL",
        "All I want for Christmas is you... \n\nTo be as happy and fulfilled as possible. And that goes for everyone!",
        "I hate when avalanches just sjow up unannounced.",
        "Lies, Halloween can be all year round!\nAlso day after halloween is a great time to grab discount candy.",
        "Joke's on y'all, we Dutch have a grace period of Sinterklaas first!",
        "Every year, we live in fear,\nBut joy is yet to come\nFor one sole night, \nWhat gleeful fright,",
        "Hate it when people celebrate Christmas in November. Stop forgetting Thanksgiving!",
        "OH SHIT, MY BOY JO GOT A GF\n\nGood job, king",
        "This is inaccurate. My store already has christmas stuff up before Halloween even begins.",
        "0:30 - \"You hear a certain holiday jingle through the door. It's getting closer. Roll for initiative.\"",
        "What always gets me is people who start preparing for Christmas when Halloween comes around.",
        "Rip JoCat and Echo",
        "Christmas censorship",
        "I'm sad because, for the longest time, the good people at Macy's were holding back the yuletide onslaught with their Thanksgiving Day parade.  We all knew the season begins when Santa rides through the end of the parade, after all the turkey is cooked and the balloons have floated down main.\nBut Macy's protections have faded with time, and we need heroes to take up arms against the coming war, before the Xmas army corrupts and consumes every calendar month.",
        "Lol",
        "I guess thanksgiving didn’t get the memo.",
        "Dread it, run from it, mariah carey always arrive",
        "I just realized that they're dressed as the Witch of the West and the Scarecrow. Elfaba and Fiero? :O",
        "So, on my way to work on Halloween morning, I stopped by a grocery store to see if there was any sales on candy. There were...for Christmas candy.",
        "My favorite primal, Mariah Carey",
        "I’m starting a petition, we need thanksgiving movies and music, the bird must have its month. Who’s with me?",
        "Every year I have  neighbor that has a full on Halloween display on their patio/yard for a month, and it is there at 11 PM (when i get home) on Oct 31, but Nov 1 before 8:30A.M. it is already 100% Christmas, compete with inflatables, lights, candy canes  and projectons outside and a fully decorated Christmas tree inside (you can see it through the sliding glass door.) This must be what happenned.",
        "It's about that time, also for Buble to appear.",
        "Can I just say how adorable both you and Echo are in this? ^_^ MORE ANIMATIONS WITH BOTH OF YOU PLEASE!",
        "Can I just say how much I wish I could find a relationship like what Jo and Echo have? They're so sweet and wholesome together and I really just wish I could find that special someone who I could make happy for the rest of their life. But seeing them also gives me the hope I need to keep trying. So thank you both for that. Hope you guys are having a wonderful time together and I wish you all the happiness in the world ",
        "Try celebrating \"Día de los muertos\" aka day of the dead, sugar skulls are a very nice treat, oh, and it happens right after Halloween. ",
        "For a sec I thought it was going to be a NNN joke.",
        "♪  I DON'T WANT A LOT FOR CHRISTMAS  ♫",
        "Im so fuckign hyped. Everyone hates it, but this time of year genuinely makes me so fucking excited and happy and cozy, goddamb I love it.",
        "If you start celebrating Christmas before Thanksgiving you're dead to me.",
        "We're still gonna eat candy and cuddle tho, right?",
        "It ain't be Halloween no mo\nIt december open beta\nc h r i m b a s t i m e",
        "I like when Halloween ends, because 3 days later it’s my birthday!",
        "\"Kids, it is November!\"",
        "Eh... I mostly hold it off until day after Thanksgiving. c.c",
        "110% accurate!\nCrap, they don't even let Halloween end! There's Christmas stuff up in stores by like, the end of September.",
        "Man Halloween lasts like 3 hours, and Christmas lasts like 3 months.\n\nThat's not fair...\nWait a minute. I can dress up on any day of the year. Everyday can be Halloween if we believe!",
        "The perfect summary",
        "Justice for Thanksgiving",
        "So true",
        "In Canada we get Remembrance day as a very somber buffer",
        "I’m a Christmas Fanatic, and and we will not stop until we overthrow Halloween and turn the -ber months into the Christmas Season.",
        "\"Live in ignorance and purchase your happiness \nWhen blood and sweat is the real cost \nThinking ceases, the truth is lost....\"\n~ Mariah Carey, I think",
        "Yup, The Capitalist X-Mas spirit has already vomited over every shop I walk into.",
        "It haunts us every year\nWe never expect it\nBut it happens every time",
        "check out the Christmas Can Can sometime. There's a couple of lines expressing this sort of thing.",
        "Agressive piano intro!",
        "Yes! THAT'S what my house needed, a sword hanger! Of course!\n\nThank you, JoCat!",
        "Jocat is such a sweet boy",
        "MARIA BREACHED CONTAINMENT!!!",
        "as soon as i started hearing it i was like \"run!\"",
        "Why",
        "From cute and wholesome to cursed. Nice.",
        "OMG thank you JoCat, this nails it! Christmas don't give a holiday hoot about Thanksgiving, just rolls right over. heck it even overtakes Halloween now in some cases, which I hate.",
        "The truth though it that it slowly has been getting louder since September  ",
        "Mariah returns with a vengeance!",
        "I misses hallween because covid",
        "SHE'S ON THE ROOF!",
        "Relatable, I feel for every Walmart worker",
        "The silver-lining is it allows us to skip Thanksgiving, fuck Thanksgiving",
        "Me at 2:29 \n\n\nStop him!",
        "If ONLY this was true, at least we could enjoy Halloween to its fullest before Christmas muscles its way in- but NO, it keeps emerging earlier and earlier every year, I was seeing Christmas stuff up in MID SEPTEMBER.\n\nIf somebody could put a stronger lock on Christmas' cage and maybe tranq it a few times come New Years, I for one would be deeply thankful!",
        "This is too accurate.",
        "Bro I've been seeing christmas stuff in stores since mid October.",
        "ITS CHRISTMASSSSSSSS LETSGOOOOOOOOO",
        "F",
        "MARIAH CAREY NOOOOOOOOO-",
        "She's on the roof.",
        "At work we started getting Christmas stock before haloween stock. This was at the end of September.",
        "Can't even get a DAY past Halloween before... IT arrives in force.",
        "CONSOOM OR THIS WINTER WILL SPELL OUR ECONOMIC BUBBLE DOOOOOMMMM",
        "UGH, geez yes that's even more so this year!\nI swear like us Halloween lovers need a tiny bit more time \nI like both holidays but Halloween is my favorite so it hurts to seem them compete",
        "Mariah Carey Has Defrosted",
        "These whippersnappers today have it so bad.  Why, in my day Christmas had the common decency to wait until the day after Thanksgiving to start with its shenanigans.  I tell you, there will come a day when Christmas in July won't be a cute little joke anymore, and it drives me to tears just thinking about it.",
        "Mariah has emerged from the sea to let us know, once again, what time of year it is.",
        "We should get some groups and musicians together, have them make some new Christmas songs, and ban the old ones for a good couple of years.",
        "its funny cuz as a german i dont relate - for us this is wham with last christmas.",
        "it’s NOVEMBER",
        "This speaks to me on a spiritual level.",
        "This hits hard considering I just wanted to get some food and I get blasted with this song",
        "Seems pretty accurate.",
        "The 'Christmas Spirit' (read: desperate christmas marketing strategies by retailers) has zero chill.",
        "Halloween never dies. It just rests up for next year.",
        "Lmfao can't breathe    ",
        "so true",
        "Oh noo Echooo",
        "I loved the sword hung by the front door, but feel bad it didn’t have its best friend shield. Thanks for the video Jocat it was another bamger.",
        "AHHH ITS BACK!!!!",
        "I need more green witch echo",
        "See, it needs to stay BEHIND thanksgiving. Thank you.",
        "Fun fact: The SCP Fundation's official Twitter excused themselves for not being able to contain the SCP Mariah Carey this year.\nThe more you know.",
        "Strong summary",
        "Me to :,)",
        "Can confirm, that's how you hang up swords.",
        "Guess no one cares about the turkey",
        "Some of my neighbors have had Christmas stuff out since AUGUST",
        "0:35 That is without the doubt the face of someone who has resigned for the inevitability of Christmas if I have ever seen one XD",
        "I was expecting this to be an NNN meme, but I was pleasantly surprised. NNN memes annoy me.",
        "The true horror of Halloween...",
        "Oh no, I just realized there will be Christmas music playing in the supermarkets.",
        "Yep, that pretty much sums it up.",
        "In my country we don't really do halloween so we've been the victims of the SCP Mariah since october started",
        "I love this. It’s so silly. Christmas is an eldrich horror that keeps escaping earlier each year.",
        "WE NEED MORE CRAP GUIDE OF DND",
        "Man, feels bad that thanksgiving is always being stomped out",
        "anyone else remember Thanksgiving? man, I miss that...",
        "Mariah Carey comes for us all one day...",
        "Hell, the Christmas shit has shown up in stores before October's even halfway through in my experience.",
        "And this is why I start celebrating Halloween the moment June ends. Because I’m seeing Christmas stuff in October and the start on November it’s just everything.",
        "I don't wait for Halloween to be over. Christmas time is whenever the time feels right. I'll blast this song and every other song in the middle of June.",
        "Hell I hate that so much. I wish Halloween was on October 15th and October would be a 90 days month.",
        "Tis why I fervently beat the drums of Thanksgiving, something has to be holding back against the tide of Christmas, and November will break before the guard does. For the Turkey Pardon!",
        "Not sure how it is outside of Canada but literally before November, Christmas decorations were up. Whether or not I need to shake my fist at Capitalism again or not I don't know, could Halloween just have a low shelf life in the eyes of must people? I dunno.",
        "I was expecting padoru.",
        "LifeDM: Jocat, you hear a strange sound from the front door, roll a investigation check.\"\n\nJocat: \"1\"",
        "A target in my my city was already decorating for Christmas all the way back in September. Sure they kept a little Halloween themed place up front but the rest was Christmas.",
        "Who can relate?",
        "Yes about that terrible, TERRIBLE song in particular.",
        "Demon core Kun is feeling festive",
        "I dont want alot for christmas",
        "Like not even an exaggeration, the fact that people start pushing christmas stuff before december and more importantly even before thanksgiving, moreover most of the same nutters will leave up christmas stuff well after january, it really ruins that specific holiday for me.",
        "ooooooh your gf/Wife is cute",
        "We all feel like that, xmas does not have a shred of decency to let us mourn Halloween",
        "It do be like that",
        "I wish people Gave a Damn about Thanksgiving. Racist Backstory or not it's a Good Time to Spend with Friends and Family!",
        "You gotta love and hate Christmas.",
        "I have loved your videos for years. It started with Monster Hunter and now you have an amazing fanbase. I will support you forever. Keep up the amazing work. \n\nI love how distorted the song is, I hope copyright doesn't pick it up.",
        "It’s the spirit of NNN",
        "This why we need more THANKSGIVING DEFENSE FORCE members to help stave this off.",
        "Acurate",
        "When it hits 00:00 Nov",
        "Nobody cares about Thanksgiving.",
        "Padoru! Padoru!",
        "NNN",
        "The nightmare before Christmas was basically Halloween trying this in reverse",
        "every non-american country watching america go wild over a children's holiday like",
        "yknow I am just gonna start celebrating halloween all the way through thanksgiving so that I don't have to worry about that.\nI vote we all do that and just shift the idea of christmas further back so it feels more special and less annoying.",
        "Burger place near me went from its \"thanksgiving shakes\" to its christmas shakes...it hasn't been thanksgiving yet.",
        "So begins my season of ordering things as much as possible to avoid compulsory participation in a religion I despise.",
        "Cute video.\nI'm not a fan of either, but at least Halloween doesn't try to expand too much and occasionally produces a fun party.",
        "Mariah Carey will arise",
        "I feel like every year the sales of X-Mas themed stuff starts sooner.",
        "Started listening to the Magnus Archives. These are the vibes I get from “The Carey”. I enjoy Christmas, I do. But I don’t need to see decorations for it mid October through January.",
        "I wish it was a lie but.... everywhere changes their music to Christmas music because they just do... and it sucks, why can't we enjoy the after effects of Halloween for longer.... (or just enjoy the peace of not having Christmas shoved down our faces on the first day after Halloween)",
        "This is exactly just me to my friends. the christmas part I mean",
        "I like to think this is a sequel to Zalinki's \"A Christmas Miracle\". The Witch's curse is spreading ",
        "that is so accurate it scares me..... Yup",
        "And now I hide in my room even more than normal for the next 2 months.",
        "I am forever grateful towards Dia de Muertos for taking up enough of November that no store here hangs up Christmas decorations on the 1st.",
        "To anyone dealing with that terror that is that song, remember, it fits perfectly with Weclome to the Black Parade",
        "made me jump, but his reaction is mine EVERY YEAR, this is why I despise Christmas music, its bad enough I gotta practice chior songs a month or 2 in advance",
        "They started playing this song at the Grocery Store I work at in September, and guess what, it was on a loop. Damn retail radio glitched out and so I ended up crawling into the attic area and just unplugged the receiver for the store radio.",
        "Luckily in my area they keep the Halloween decorations up well into November, but I feel that.",
        "I'm both happy and depressed so many fellow retail workers know my pain\nI-I've turned off on Christmas and just have a little feast to myself for the solstice hoping Mr. Sun gets through his longest night alright...",
        "SCP HAS BREACH CONTAINMENT. CONTAINMENT LEVEL - CHRISTMAS",
        "I was expecting padoru ngl",
        "i knew this was coming from 10 miles away",
        "THE SCARECROW OUTFIT!",
        "Reasons I hate Christmas",
        "immediately returns to ash and brimstone",
        "Honestly I do Halloweeny type stuff for a good chunk of November",
        "Why does this feel so accurate?",
        "Padoru is coming...",
        "Christmas can come earlier and earlier. Nothing better than celebrating the baby Jesus",
        "At least be grateful it starts after Halloween, I swear almost everywhere in my town people get ready for Christmas before and during Spooky Season",
        "The joke I always like to make is that if there really is a War on Christmas, Christmas is winning by absorbing the other holidays.",
        "Poor Thanksgiving. The turkey barely stood a chance.",
        "Base is at dank levels",
        "why cant christmas wait till after thanksgiving it annoys me greatly",
        "As someone who really likes Christmas, I hate how \"Christmas time\" has essentially become a fifth of the year. It becomes even more overwhelming and stressful. It also completely overshadows thanksgiving, which it didn't really do in the states until recently.",
        "...This is how I feel every year at this point. Every single year halloween ends, it's Christmas. Thanksgiving? Noooo, it's Christmas now.\n\nNovember? Nope... it's Pre-December. There were Halloween directions here last week? Nope, never happened buddy.",
        "So what happened to thanksgiving?",
        "\"They do this every year...\"",
        "No it can't be Christmas time, I haven't eaten my turkey yet!",
        "All your goofy little videos are the best lol",
        "How it usually is",
        "It's gotten to the point where they start selling christmas stuff in September, and the Halloween stuff gets casually pushed aside only getting a small shelf at best.",
        "I feel ya... Except 1 thing I can forgive, is the german cookies Lebkuchen is the best, so sad that they only sell it this time of year, I could live off that shiz",
        "I didn't realize what was happening until the exact moment the music started kicking up and jocats character also realized as well.\nWhat a pay off.",
        "My workplace was completely covered in Halloween decorations, the day after our Halloween party all the decorations were gone, next day everything was covered in Christmas decorations. This cannot be ",
        "Mariah Carrey pretty much never has to work another day of her life again",
        "yep, they air the first Christmas commercials at 12:01am on November 1st. They are really on the ball with that stuff.",
        "If only it really did wait until Halloween was over...",
        "NOOOOO",
        "They literally had that damn song playing at 5pm on Halloween in my local walmart after having already removed all the Halloween stuff and put out christmas 3 days prior."
    ],
    "comments_disabled": false
}