{"video_id": "vXSxvuJAa8I", "comments": ["Makeship was kind enough to extend the deadline on the gobbo vinyl figure, last chance to grab it! - https://www.makeship.com/products/goblin-vinyl-figure", "I love how Christmas has evolved to the point it becomes this borderline Eldredge being that we all quietly fear", "I'm glad Jocat had the foresight not to open the door, but the Christmas spirit got a lockpick this year...", "Relatable, I feel for every Walmart worker", "As a retail worker who had to start putting the Christmas merch out 2 weeks BEFORE Halloween because we were so afraid of running out of room in the back, I feel this in my very soul.", "She's basically a raid boss at this point. The moment you've heard the music, the fight has begun.", "I love how a christmas song Mariah made years and years ago has stuck in our society's collective unconscious 1, long enough, and 2, significantly so; to the point where everyone associates it with the season SO HARD that most can recognize it from the opening piano notes.  And we are all terrified of what her song represents.", "It haunts us every year\nWe never expect it\nBut it happens every time", "Regardless of one's feelings for Halloween, this rings true. One holiday is over? NO! THE NEXT HAS BEGUN! No holding back, no concept of less than maximum overdoing it! You will PADORU NOW!", "The joke I always like to make is that if there really is a War on Christmas, Christmas is winning by absorbing the other holidays.", "Can I just say how much I wish I could find a relationship like what Jo and Echo have? They're so sweet and wholesome together and I really just wish I could find that special someone who I could make happy for the rest of their life. But seeing them also gives me the hope I need to keep trying. So thank you both for that. Hope you guys are having a wonderful time together and I wish you all the happiness in the world ", "Halloween might be a day for ghouls, ghosts, and devils...\n\nBut the true demon has awoken from her slumber and is now present in our lives for two months...", "Halloween being my favorite holiday this hits my soul. I probably would love Christmas more if people weren't so obnoxious about it.", "I’ve done worked at supermarkets for 8 years now, and I see this Christmas stuff seep in through the cracks as far as august. It’s only that the damn finally bursts on November first.", "Ah yes a classic. I actually walked into work blasting Collective Christmas. It’s Collective Consciousness from MGR but sung to the tune of All I Want for Christmas.", "Are you tellin' me Jocat keeps a sword hung on his coat hook but not a shield nearby??", "Every year, the Christmas beast creeps closer to the salt ring surrounding October 31st. I fear one day it'll breach that ring, but those of us who love Halloween must stay strong ", "As the singing started I simply went \"Oh no...\"\nThen the music.\nAs Jo approached the door all I could muster before the white mass of Holliday cheer flew out of my screen was \"MARIAH NO-\"", "The amount of fear i had when the first few seconds of the song came on was horrifying", "I love this. It’s so silly. Christmas is an eldrich horror that keeps escaping earlier each year.", "Man Thanksgiving is always left out of people's minds isn't it?\n\nfunny and wholesome JoCat hits us again <3", "I keep on rewatching and It gets me each time on \"OH FU-\" ", "This made me cackle so hard, as someone who really doesn't actually celebrate either Halloween or Christmas but enjoys watching other people's drama with the holidays this was just too real. ", "Dude, I WISH they'd wait till after Halloween to start Christmas.\nAt least around here, you'll start seeing Christmas taking up half the holiday section at most stores starting as early as August/September.", "From cute and wholesome to cursed. Nice.", "Man, feels bad that thanksgiving is always being stomped out", "The second I heard it I knew exactly where it was going, perfection.", "Fun fact: Here in the UK we started seeing Christmas items in our local shops in F***ING AUGUST this year. They didn't just skip Halloween, they skipped the entire season of Autumn!", "Hahaha  \n\nYep, literally that. On November 1st all the stores that had Halloween decorations on sale started selling X-mas decorations...it is scary how fast they can made this transition man ", "What always gets me is people who start preparing for Christmas when Halloween comes around.", "Hilariously sad, but true. I'll never forget the shops and grocery stores replacing all traces of Halloween... on Halloween... with Christmas junk. It's like a Peppermint Mocha Onslaught, rolling over the Pumpkin Spice Latte and Thanksgiving.", "THIS WAS PERFECT! Its so rewatchable, and relatable on all counts from the loss of Halloween to the Christmas Creep", "As someone who works in a grocery store I pray for me and my coworkers sanity", "To anyone dealing with that terror that is that song, remember, it fits perfectly with Weclome to the Black Parade", "I love how relateble it is. My father and I have to wait until the 1st December to sing Christmas songs. It's a rule from my mom 'cause she got fed up and we hate it.", "Shoutouts to Halloween. Our final champion after the defeat of Thanksgiving.", "can I just say I love your content, and I love Echo's content, and you both just seem like such great humans, and you're absolutely adorable together", "This animation is as 100% accurate to the holidays as a Carbot animation is 100% accurate to whatever game he's meming on at the moment. :3", "Completely accurate. The moment halloween ends, Christmas takes over everything.", "Christmas used to be something I always looked forward to, now it fills me with fear", "I didn't realize what was happening until the exact moment the music started kicking up and jocats character also realized as well.\nWhat a pay off.", "As someone who works in retail, this is PAINFULLY accurate", "Someone needs to popularize some Thanksgiving songs just so we can delay Christmas music by another month.", "I feel like Jocat is getting smaller and smaller every animation, but not entirely chibi yet.", "♫I've heard this song tweeenty times, and it's only Haaalloween!♫", "I don't wait for Halloween to be over. Christmas time is whenever the time feels right. I'll blast this song and every other song in the middle of June.", "i love people who show up their happy relationships to people who are forever alone!", "This might be the most wholesome thing I have ever seen", "Even hearing that song muffled through a door gives me chills.", "As someone who really likes Christmas, I hate how \"Christmas time\" has essentially become a fifth of the year. It becomes even more overwhelming and stressful. It also completely overshadows thanksgiving, which it didn't really do in the states until recently.", "Halloween is the only thing holding back Christmas' complete dominance of the calendar.", "This hits hard considering I just wanted to get some food and I get blasted with this song", "No little Jocat, don't go towards the door!\nOh mine got, she's thawed out too early!", "I was initially expecting this to end with someone trying to have all the candy for themself", "I had a joke like this in my mind for years and I'm glad to see someone pull it off.", "As soon as I heard the giant jingle, I knew exactly what was going to happen and I wasn’t disappointed.", "I like how Jocat has a sword at the door. Smart guy. Prepared.", "This is exactly how it is!!! All this year I’ve been waiting for the moment of Halloween, and there’s just Halloween ads, coupons, decorations EVERYWHERE. Where’s the love for Halloween gone?! I’m still over here wearing my Billy Butcherson sweater like:", "Christmas needs to stay in its own month, or at least wait until thanksgiving is over", "Funny how it's a season about cheer and generosity but It feels more like a season  for over consumption, greed, and stress.", "I miss people acknowledging Thanksgiving. It’s literally a holiday dedicated to being happy about all the good things in your life. People need to do that more.", "Rip Jo and other person who I was not able to identify (my apologies) they were crushed by the weight of an eerily accurate meme.", "*equips drum stick * NOPE! NOT TILL AFTER THANKSGIVING!", "I am forever grateful towards Dia de Muertos for taking up enough of November that no store here hangs up Christmas decorations on the 1st.", "Let us all remember to give thanks to Halloween, the last bastion keeping Christmas from creeping further into the year like a cancer.", "Not actually a Halloween fan but ... yeah, Xmas comes in hard and fast as soon as it ends regardless of one's will.", "I've seen Christmas sh-t in ads and in stores before Halloween before, with the absolute earliest being the end of September. It's the most wonderful fourth of the year. Christmas really is becoming an Eldritch horror that threatens to consume all other holidays.", "You always know it's coming, but you can't help but dread it.", "It's getting worse by the year, many stores started selling Christmas themed food, decorations and advent calendars way before Halloween already... And as many already said, now that Halloween is over and a bit of shelf space gets freed, the Christmas junk time is upon us again.", "My friend and I drove from California to Oregon on November 1st. We were both admiring the beautiful fall foliage before I saw, looming over us through the fog, a snow covered mountain. And before we knew it, BAM! SNOW EVERYWHERE! And if that wasn't the most perfect visual metaphor for that day, I don't know what is.", "JoCat, you are too freaking innocent for this world. Not to mention really funny.", "Halloween never dies. It just rests up for next year.", "Once you take off your Halloween costume, Christmas music is already playing and it drives me insane! ", "Forgot to depict thanksgiving being utterly ignored in the rush. Otherwise perfectly accurate", "Yes and I hate that Christmas starts that early... I am more than happy to get into the Christmas spirit in December.", "If it wasn't for Halloween, stores would be playing Christmas songs starting from July", "My takeaway of Christmas season is that the suspiciously cheap gingerbread is back in stores, so I’m happy", "Hahaha, 100% accurate.  Also can we talk about how adorable that \"Mmm Candy\" at the very beginning is?", "It’s sad that even before Halloween people start putting stuff out for Christmas.", "Man it do be like that. The greatest holiday is over, now we are subjected to two whole months of... Christmas. Shudders", "And this is why I start celebrating Halloween the moment June ends. Because I’m seeing Christmas stuff in October and the start on November it’s just everything.", "Make sure every time you see somebody with christmassy stuff, you aggressively remind them that it's still November.", "It's okay because once Christmas is over, we can started getting hyped for Halloween II", "It hurts how painfully relatable this is. Especially if you work in retail.", "Time for the next season of M O N E Y! Because that never gets old.", "Well done for capturing exactly what  it's like. I like how the flood of Christmas just decimates everything in it's path.\n\nI also noticed that there's a sword hanging next to the coat and umbrella. Nice touch!", "They started playing this song at the Grocery Store I work at in September, and guess what, it was on a loop. Damn retail radio glitched out and so I ended up crawling into the attic area and just unplugged the receiver for the store radio.", "Scariest part of Halloween is the coming of Christmas.", "So November is just basically a month and a half long Christmas Eve ", "I actually seized up when I heard the music in the background start. That’s how visceral of a reaction I have to THAT at this point. ", "This one hit too deep. I know that the rest of the world doesn't celebrate Thanksgiving so I can understand that as an American, but jesus christ that will never excuse blasting Christmas music at midnight on Halloween.", "Love the sword hanging on the coat rack! Just needs a shield to go with it.", "The spookiest ghost of Halloween is the Ghost of Christmas About to Rise. Appears every Halloween season and chills me to the bone every single time.", "I like to think this is a sequel to Zalinki's \"A Christmas Miracle\". The Witch's curse is spreading ", "At least be grateful it starts after Halloween, I swear almost everywhere in my town people get ready for Christmas before and during Spooky Season", "This speaks to me on a spiritual level.", "Legit got me cackling this morning. Great comedic short.", "We're lucky if they wait till after halloween", "Hell, the Christmas shit has shown up in stores before October's even halfway through in my experience.", "They literally had that damn song playing at 5pm on Halloween in my local walmart after having already removed all the Halloween stuff and put out christmas 3 days prior."]}