{
    "video_id": "wFloE26iUks",
    "comments": [
        "Te amo Louis eres lo mejor que me pasó en la vida",
        "VAMOOOS LOCOOOOOOO",
        "Estoy inmensamente orgullosa y feliz de q lou haya crecido demasiado como artista y este haciendo la musica q siempre ha querido hacer, la confianza q tiene ahora y vibra tan energica y positiva q transmite es demasiado linda.",
        "everyone deserves a person that could relate to these lines. I just LOVE THIS AHHHHH!!! We're so proud of you Lou!",
        "MI FLACO <3",
        "I am a big fan of you but my sister told me that you are a smoker and I  started crying like crazy because my dad had a tumor in his jaw because he was a smoker end it just got me to all those bad memorie",
        "Silver tongues",
        "mds eu to tão orgulhosa de você, obgd louis eu te amo tanto, obgd por ter salvo a minha vida, obgd mesmo.",
        "Omg",
        "es increíble lo que que es este álbum, estoy muy orgullosa de Louis, y como nos comparte un pedazo de él en sus canciones, te mereces lo mejor gordo",
        "Get recovery soon Lou, we love you ",
        "Trending #41 the time I'm watching this. Let's track it guys. Reply here.",
        "Louis is delivering banger after banger. ",
        "The fact that he tells whole stories with his music videos is amazing",
        "I love you Lou<3",
        "Que buena música haces Louis Tomlinson ",
        "Sounds like a 1D  song.  I like it, especially that beat.  So far, I like every song on this album.  Keeping it real, I don't listen to Louis' music, just decided to check  it out.  Well Done Louis. ",
        "This is so cool",
        "Te amo gordooo",
        "Otra cosita sus canciones",
        "You're amazing as always you are",
        "Que canción tan hermosa, te amo tanto Louis.",
        "Se nota el gran corazón y esfuerzo que le puso al hacer el álbum completo, los videos que han salido hasta hoy son muy buenos, estoy agradecida con la vida, el destino, con Dios o quien sea que haya sido quien me permitió vivir al mismo tiempo que este hombre que es el amor de mi vida y que mil de veces me ha salvado con sus letras y por el simple hecho de existir, gracias por tanto Louis, te amo infinitamente",
        "Never be tired to watch this mv. I love this so much. Louis, thank you!",
        "estoy tan orgullosa de todo lo que a logrado este hermoso hombre, lo admiro mucho y estoy agradecida con él por todo lo que hace para nosotros, no puedo explicar la manera en que me hace sentir cada que escucho su voz, una canción de él etc, me salvó cuando la estaba pasando de lo peor, este álbum fue como un abrazo al corazón, te amo louis gracias por todo",
        "I love you ",
        "faith in the future necesita todo el hermoso reconocimiento que se debe q álbum tan perfecto",
        "it's amazing",
        "Te amo Louis, gracias por todo,se que este video va a ser super epico como todo lo que haces, porque siempre lo haces con dedicación,está canción es muy genial y completamente te la dedico Lou<3",
        "With each song you can see how Louis is more and more confident. This style suits him. I love how free he is with his music. The whole album is one bomb after another. I can't pick one song as a favorite because with each listen it's the next.",
        "a coisinha mais linda do mundo inteirinho meu amor",
        "ok but the fact that I keep calling Silver Tongues my song bc it was dropped on my birthday and it is exactly how I felt since so many years ago. The feeling of not want to go back home because of how you feel with your people and how that keeps you in a happy state specially when everything seems bad except for that little and special part of your life.",
        "STOP I LOVE THIS SONG HELP HELP HELP",
        "Magic",
        "Lou estoy tan orgullosa de ti te amo más que a nadie <3, esta canción es arte, todo lo que haces. Felicidades mi sol",
        "When I watch this video, I picture myself in a parked car in the rain at night. Louis and I on board singing this song out loud, dancing a little sitting on the seats, with a beer and a cigarette...\nAm I the only one imagining such a scene?",
        "Me encanta como le queda este estilo, encaja perfectamente con su voz. Me da nostalgia, recuerdo aquellas  canciones rockeritas de los 2000's",
        "Mi Louis exitoso 100000/10",
        "No me conoces y aún así me salvaste, de maneras inimaginables llegaste desde que yo era una niña hasta ahora, te he seguido por 11 años y estoy orgullosa y feliz por ti, de saber que esto es lo que te gusta, por fin estás disfrutando tu carrera después de tanto. Estamos aquí por ti Louis, no hay otra razón, no estamos porque eres el ex miembro de una boyband SOLO POR TI",
        "Man we need  more louie ....this song hit hard i know everyone can relate to it  in some given point",
        "THIS SONG MAKES ME FEEL HAPPY ",
        "️‍️‍️‍",
        "Slay my Louis",
        "te amo louiss",
        "Bellooo chicken 0:22",
        "Joder tiene muchos sentimientos el oirla, motivación tristeza y felicidad,  love you louis. ",
        "pero que vocezon te cargas",
        "LO AMO JODER, SALE MUY LINDOO",
        "i love the album soooo much!!! I can't wait to hear it live, love you Louis <3",
        "Me encanta esta cancion, la escucho cada vez que puedo aparte del album que tambien esta grandioso. Pero esta hace que me olvide de lo feo de la vida.",
        "Faith in the future me salvó la vida, mejoró mi día, mi semana, mi mes, mi año, mi jodida vida. ️\nLou te amo con todo mi corazoncito",
        "Love this song \nLove Louis\nI have been a fan of him since 2010",
        "we're so much happier now",
        "So proud of my babe ️",
        "greatttttttttttttttttttttttttttttttttttttttttttt",
        "O mv conseguiu transmitir tudo que eu senti/sinto ouvindo a música, perfeito!!!!!!",
        "TE AMO TOMLINSON",
        "Me encanta no dejo de escuharla",
        "El orgullo que siento por Louis es algo indescriptible, a logrado tanto y cayó tantas bocas,ser Louie lo amo y le agradezco el no haber hecho caso a los demás",
        "3:23 \"can anyone hear the sound of running water??\"",
        "Clearly he and Niall have been making better music than the rest of them",
        "This album is such a good fit for movies, so good",
        "no es donde se grabo midnights memories??? 2:12",
        "Well, I tried what I read the other day and it was mind blowing to see her writhing with pleasure and ready for anything. It all started when I learned to last at least 30 minutes go’ogling the latest by Greyzar Drinbo and now she just can't have enough",
        "UNA DE MIS CANCIONES FAVORITAS DEL ÁLBUM <3 no entendi nada pero MUY ORGULLOSA DE TODO LO QUE LOUIS ESTA LOGRANDO callando la boca a los que lo minimizaban como artista ",
        "muy feliz por lo que louis hace",
        "Escucho esta canción y enseguida tengo una sonrisa en mi cara, no veo la hora de escucharla en vivo!!!",
        "Im in love",
        "1:23 isn't that the street where 1D shoot midnight memories?",
        "I love You sooo muche yous are My home",
        "sos grandioso louis",
        "LOUIS TE AMOOOOOO",
        "amo la producción que está poniendole a este álbum, se merece todos los premios del mundo, Te amo Lou ",
        "ART",
        "Loveee this Tommo!!",
        "remember forever that i love you",
        "come to Japan🇯🇵",
        "Este \"gratuito\" significa livre para usarmos, sem copyright?",
        "louis enserio tu voz es la más relajante que e escuchado se siente como un abrazo al alma uno que necesitaba",
        "This is the first band I've heard in 10 years plus that actually caught my ear",
        "Congrats on the UK #1 & successful surgery. Millions in love w/Louis & his work! ",
        "TENHO TANTO ORGULHO DE VOCÊ GATINHO ",
        "no puedo expresar todo lo que siento, estoy demasiado orgullosa por todo lo que Louis ha logrado y sobre todo estoy feliz, sin duda merece todo lo que tiene y muchísimo más, amo este nuevo álbum porque se nota  en cada una de las canciones que confía mucho más en él mismo, y eso me hace muy feliz porque Louis merece todo lo bonito del mundo, merece confíar en su enorme talento, él es una persona demasiado importante para mí, se podría decir que es mi ejemplo a seguir, también me atrevería a decir que es una de las persona que más quiero en el mundo, no saben lo feliz que me hace verlo triunfar, es inexplicable el enorme agradecimiento que le tengo a Louis, porque aun que el no me conozca me salvó desde hace mucho tiempo, él estuvo para mi cuando nadie más lo estuvo, y siempre estaré agradecida por ello, siempre estaré para apoyarlo en todo, en fin, gracias Louis, gracias por hacerme sonreír como tonta  cuando tengo un mal momento aunque sea a través de una pantalla.",
        "HAGAN STREAM !!!",
        "ONE DIRECTION>>>>>>>",
        "oque vc achou dos gols do richarlisson em lou vc que manja de fut",
        "This song makes me want to watch those old vids of them",
        "AAAAAAAAAAAAAAAAAAAHHHHHHHHHHHHHH Él siempre haciendo de la suyas! para que negarlo si me encanta todo  lo que Este hombre Hace. TE AMOOO LOUIS Y A TUS CREACIONES!!!!! Y poderlo ver en los vídeos  siendo él mismo y divirtiéndose y como yo soy muy especulativa, tratando de darnos su perspectiva de lo que lo hace sentir la canción o solo para que nosotr@s nos comamos la cabeza pensando que significado tiene el vídeo... pero, en fin  solo con estar su masiva presencia ya yo soy más que feliz <3 <3 <3",
        "Epic ",
        "Oaaaaaaaaa capo el Louis eaeaeaeae viva argentina carajo que le ganamos 5 a 0 a Arabia Saudita",
        "OMGGG",
        "I think that I understand this song! When the woman isn't around the men do drugs and alcohol party hard and other bad things, but when the girl is with the men, she helps them to not do really bad things!! This is a really good video Louis!!",
        "I love this song. Personally it gives me feeling of warmth and joy. Feeling of freedom and home at the same time. And the verse: “Those stupid jokes, only we know”, also represents a the same feeling of joy and comfort but in a person and i think its important for everyone to have a person who understands them,  jokes with them and also know when it’s time to be serious. This song is something special. I can’t stop listening to it. Thank you Louis and others who put this song together it really is a masterpiece, just like the rest of the album.",
        "FANTASTIC!!! ",
        "Gracias Lou por haberle callado la boca a todos los perdedores que no creían en ti ¡Estoy muy orgullosa de ti!",
        "PROUD OF U LOUUU, ILYY",
        "vamos por el 1millon",
        "Louis louis...you are the best",
        "ily sm lou :)",
        "Estoy muy orgullosa de Louis, ha crecido mucho como artista y que ahora se sienta seguro de si mismo para hacer la música que quiere <3",
        "I cant believe I 1st heard this over the loudspeaker at Coles last night while shopping. Used Google to listen and tell me the song lol",
        "Me encanto",
        "ESTA GENIAL COMO PARA HACER EJERCICIO",
        "Louis + louies until the end",
        "Abi niye az izlendi bu mv",
        "IM SO PROUD ",
        "louis tomlinson you're a fucking legend, one of the best lyricists and artist in general, since you started your career and now you have shown your great talent, and with this album you got to know more about the genre you wanted to do, I can't be more proud! // louis tomlinson eres una jodida leyenda, uno de los mejores letristas y artista en general, desde que empezaste tu carrera y ahora has demostrado tu gran talento, y con este album te has dado a conocer más con el género que quieres hacer, no puedo estar más orgulloso!",
        "Wonderful song, cool video too",
        "TE AMO MI AMOR",
        "te amo lou, nunca pierdas tu estilo ",
        "muito bom ser fã de Louis Tomlinson ",
        "The special surprise at the end was worth watching the full video without skipping the sponsor. Thank you pooderpe! And",
        "o clipe tá incrível!",
        "MAN THIS SONG IS AMAZING",
        "i think its about zayn",
        "No paro de escucharla, es una obra de arteeee",
        "Love you Love you Love you Love you Love",
        "I truly loved it",
        "Estoy tan orgullosa de todo lo que ha logrado y de como ahora está más seguro de si mismo y hace la música que quiere eso me hace tan feliz, I love u Lou. -S",
        "lindo vida",
        "LOU ERES TAN CREATIVO!!!",
        "He really can’t sing though lmao",
        "louis es de miru",
        "Not a fan... but this is so good... God...",
        "you know when I’m with you",
        "God him and is Burberry",
        "Fantastic song",
        "So proud 🫶🥹",
        "the way he gotta run in place so he can run in vr is so funny to me",
        "Hagamos que este mv obtenga las views que merece <3",
        "Can someone interpret the meaning of this video???",
        "Amo esta canción y cada vez q la escucho me hace acordar a una parte del video de 1D a ver si a ustedes le pasa igual cuando unas horas antes de un gran concierto ellos jugaban en un carrito (louis y liam ) zayn en la patineta se escapaba de Poul esos juegos de niños a pesar q tenían q salir a hacer tremendo concierto",
        "Love you as always Louis️",
        "So proud of louis",
        "0:22 bello chicken",
        "Es aue eres un genio",
        "\"Those songs we wrote\" part gave me Larry vibes lol",
        "You have an angelic voice that makes my soul peaceful ️ . I can't live without you️. বহুত ভাল পাওঁ️️️️.\nLove from India ️️️️.",
        "Sono sempre più convinta  questa canzone sia dedicata ad Harry Styles️",
        "I love it <3",
        "But I don't feel like going home ",
        "\"Those songs WE wrote, only we know\" \n\n\n\n\nI mean....not only you two.",
        "Tus canciones llenan el vacío de mi corazón",
        "Let’s get this to a million views ",
        "reizinho",
        "Te amo Louis Tomlinson!!!",
        "THANK YOU LOUIS!!!!!!!!",
        "escuchar a louis es como un abrazo al corazón",
        "great one lou!",
        "cada dia mas lindo esta louis",
        "He is so underrated. He deserves more .",
        "cada canción del álbum es perfecta y esta canción es perfecta, te amo mucho louis muy orgullosa de ti y todo lo que logras",
        "I can stand and look pretty too Louis hire me next time",
        "Te amo, mucho Louis, te mereces todos lo premios del mundo, estoy súper orgullosa de ti, Harry y tú me salvaron la vida, ustedes son mi lugar seguro, y no los cambiaría por nada ️‍",
        "amei a música",
        "Siento las canciones demasiado íntimas para mi, muy personales no se como explicarlo, pero siempre tiene las palabras correctas que necesito escuchar, Dios mío Louis me siento tan orgullosa de lo qué haces y de quien eres día a día. ️Este álbum es un abrazo increíble al corazón.️",
        "Yo pensando que era una canción sad: \nYo después del intro: ",
        "louis god man",
        "Louis es la única persona que hace sentirme inmensamente feliz ",
        "Louis we're so proud of you, this album is a masterpeace, thank you for sharing your music with us! We love you, get well soon",
        "Estoy orgullosa de todo lo que lograste y vas a lograr. Amo que de a poco puedas ser quién realmente sos y te sientas cómodo con tus canciones. Gracias por esta increíble música. Te amamos ️‍🇦🇷",
        "Louis, what you’ve done is incredible This music, the words and the music video make it all into a perfect whole. I think you’re the master and don’t let anyone tell you that what you’re doing doesn’t make sense. You are one of the few artists who can reach so deeply with their music the people of their mind, soul, heart and body. I’m so proud of you ",
        "The way he literally pronounced the first text, thought it was for lip readers to also understand ",
        "que el no me conozca me salvó desde hace mucho tiempo, él estuvo para mi cuando nadie más lo estuvo, y siempre estaré agradecida por ello, siempre estaré para apoya",
        "This is my favorite song in the album....... ",
        "me like you do",
        "Louis the guardian of the gays",
        "LOUIES comenten cada que vienen a ver el video interactúen con los comentarios den like",
        "Se convirtió muy rápido en mi canción favorita, no me canso de escucharla y ahora no me cansare de ver este mv increíble, gracias por tanto louis, te amo",
        "Me encanta louis",
        "Nao tem palavras pra descrever a perfeição q é o trabalho do Louis",
        "que buena cancionnnnn la concha de mi madreeee",
        "TENGO LA NECESIDAD DE ESCUCHAR ESTE TEMA EN VIVO PARA CANTARLE A LOUIS: YOU SMILE AT ME AND SAY IT'S TIME TO GO BUT I DON'T FEEL LIKE GOING HOMEEE Y DESGARRARME LA GARGANTA",
        "Mi Lou hermoso... Te adoro con todo mi corazón",
        "El orgullo que siento por Louis es impresionante, amo que se haya soltado tanto y haga lo que le gusta.",
        "ele tá imitando aquele outro cantor",
        "Lovely Song",
        "I was touched by your positive beautiful song!!!\ngreat songwriting!!!",
        "My friend said to me the other day that this song reminded her of One Direction, I don’t know if I agree or disagree ",
        "Que orgulho eu tenho de você meu louis ️",
        "I had to come here after Louis' performance on the Tonight Show. His live performance is even better.",
        "This one is a big hit",
        "it's been over damn 8 years of being his fan and so so proud of him",
        "que música boaa",
        "Woow",
        "IM CRYING ️",
        "i love u",
        "He's so underrated it hurts",
        "unbelievable growth here in the moment. Let's appreciate this before everything we love becomes memories ♡",
        "t amooooo louisss",
        "te adoro como no tienes idea<3",
        "He just warms my heart",
        "This song will be remembered as one of the best songs down in history\nNo wonder why Louis himself likes this song the most",
        "I swear this is a Zouis song.",
        "As someone who's never really \"fit\" into any group growing up, I felt this song and video so hard! The feeling when you find those who understand you and accept you is priceless and is truly liberating. Great song and a great album!",
        "Nunca me voy a cansar de ver cómo la cámara se acerca a Louis en la parte de \"you and me until the end\"",
        "VUELVE A MÉXICO TE EXTRAÑO ",
        "Keep stre@m!ng guys!!! We need to get to 1M as soon as possible!!!",
        "What a masterpiece you deserve more babe",
        "te amo lui",
        "louis no podes más de talentoso",
        "I was on Twitter a bit ago, and someone asked what band or musician are you thankful for. Many people said Louis Tomlinson. So, I came here to check out his music. This song is the first one I checked out, and I gotta say it's good stuff. The song has an 80s vibe to it, at least to me it does, and I like it.",
        "Same road as midnight memories or just me ",
        "so proud of everything you've achieved louis, the album is amazing, can't wait for the mv",
        "Louis pero que canción tan espectacular",
        "bravo",
        "te amo mi amor",
        "ESTOY TAN ORGULLOSA DE TÍ!!!",
        "Hermosoo te amooo",
        "This is masterpiece ️",
        "Louis , the best lyricist of our time ",
        "THIS IS GONNA BE SO GOOD, THE ALBUM IS SOOOO GOOD LOUIS I LOVE YOU",
        "oh Louis tu vos me trae paz en el Alma  el mundo te nesecita en estos momentos en que todos estamos tristes y con mucho miedo por todo lo que esta pasando gracias⚘",
        "FAVVVVV THINGGGGGGGGG",
        "Louis is magic ️",
        "Está canción me da una felicidad inexplicable",
        "this is so good!",
        "He visto este video más veces de las puedo aceptar y cada vez SIENTO QUE ES MÁS HERMOSO ",
        "If Louis got more radio play or media exposure I swear it would be over for everyone",
        "He's so good",
        "Está canción tiene toda tu escencia.... Es literal perfecta, me hace sentir orgullosa está canción y todo el álbum en general, te hace querer escucharla una y otra vez, para ponerla mientras haces ejercicio, tareas TODOOO es divina y me trámite algo bellísimo",
        "Louies demostremosle todo nuestro amor al Solecito..",
        "askim",
        "My new fav song",
        "song is the first one I checked out, and I gotta say it's good stuff. The song has an 80s vibe to it, at least to me it does, and I like it.",
        "Vamos por esos 3M!",
        "Louis the video was really really good. You created a masterpiece FITF.. ",
        "This song is so fit in for fifa 23 ",
        "Giving me AAR dirty little secret vibes",
        "te amo tanto tanto q increíble",
        "Sounds like a raveonette song ",
        "It's means love to Me ",
        "Acompanho o Louis desde 1980 ",
        "dioooos miooo cuanto te amoooooooooo",
        "ESTE ALBUM MERECE TODOS LOS PREMIOS DEL MUNDO",
        "Soy demasiado pesimista pero con el álbum siento que hay algo bueno en el futuro, se siente como un abrazo que te dice que todo va a estar bien y eso significa mucho",
        "I only started listening to Louis’ solo music literally TODAY. This morning I listened to “Always You” and fell in love, so I listened to the whole album and his other singles. I really love the whole Walls album and I’ve barely had time to process it, but it turns out there’s a whole new other album to start loving as well  I AM OVERWHELMED",
        "La canción, la letra, el ritmo, la voz de Lou, EL VIDEOOOOOOO ¿cuan mas perfecto puede ser?",
        "I have been your fan for a one month now. I am glad I stumbled upon you while wasting time on youtube.",
        "This is Louis breakout album to become a solo star in the states!",
        "Estoy tan orgullosa de Louis, de todo lo que esta logrando y de como ha crecido como artista , ador el álbum esta increíble y solo me queda estar jodidamente agradecida de haber nacido en la época donde tenemos a Louis Tomlinson.",
        "The beginning of the song is just so amazing. Lyrics are outclass. I like Louis' songs because they have got meaning in them, not just random lines. His angelic voice makes this song so good to hear",
        "LOUIS YOU KILLED AT THE DISCO!!",
        "NI ENTIENDO NADA PERO TE AMOO LOUISS",
        "i love you louis, you’re amazing!!",
        "te amo muchísimo louis",
        "Can we get this to at least 20M",
        "Silver tongues es de mis canciones favoritas del álbum, es demasiado perfecta!",
        "Love you",
        "OooookayI love what we are getting",
        "the clip is kinda similar to niall's ;too much to ask; song clip",
        "The one thing I love about him amongst the many is that he really knows himself, his so sure in what he says and how he feels. Everything he says about himself is so apt. We all know, from the afhf doc that he is insecure but he feels so confident with this and as he should. The songs are fucking fantastic. He brings so many emotions and concepts. Different tunes and feelings. He knows he grew from walls to fitf and thats beautiful. I am thankful I could be a part of it. Together we're the greatest. ",
        "TE AMOOO",
        "Gracias por un álbum tan increíble Lou, estoy muy orgullosa de lo que has logrado",
        "🇵🇾Always listening to you from Paraguay Greetings I love you I love your music very much",
        "Se siente como una caricia al alma su álbum♡",
        "A guy has to have awesome guts to like Louis when his girlfriend is in love with both of them  that’s the only reason less guys comments here  that’s my only explanation but still they listen to his music! Right guys!!!",
        "Vamos louies, por ese m1ll0n :)",
        "Louis's music always spits facts",
        "Louis es genial, amo sus canciones",
        "A WONDERFUL  SONG..BEAUTIFULLY  DONE..SINCERELY ROY LEONARDO DUKE YORK 2ND.....",
        "Lou siempre va a ser mi mayor inspiración y ver lo mucho que ha crecido como artista y como persona me enorgullece mucho",
        "\" you smile at me and say 'it's time to go' but I don't feel like going home\" \nmy friends are so happy when they can go home and here is me, who.. who scared to go home, I don't wanna more pain please, don't hurt me again and again my dear family. I can't do more thing, and you told me it's not enough, sorry",
        "I love you",
        "UR SONGS ARE SOOO GOOD THEY’RE MAKING ME CRY ALREADY!! ️🥹",
        "TE AMOOOOOOOOOOO",
        "te amo tanto",
        "Not me coming back to this video everyday in different devices This video>>",
        "️‍ Every fibre in my body is in an uproar of excitement....every damn time I hear this (& FITF)...I feel like 15 years are taken of my shoulders & I can conquer the world..again. Thank you a million times, Louis. ️‍️‍️‍",
        "Silver Tongues não é uma música é um sentimento",
        "Estoy muy feliz y orgullosa de ti Louis gracias por crear un álbum tan increíble y perfecto.",
        "Your songs are always so intimate to me, that's one of the thousand and one reasons why your music is my favorite. This video is very good, Lou. I hope you have a good recovery of your arm, I wish I could exchange our places, too bad not. I send you a kiss and a big hug, darling. My chest is full of pride for everything you are achieving. It's satisfying to see how you shut up those who once thought you couldn't.",
        "Te amooooooo, por ti en verdad le echo ganas a la vida",
        "Legit love his music so much",
        "His voice! I love that whiney raspy sound!!!",
        "TE AMO, GRACIAS POR EXISTIR, GRACIAS A VOS NO ME MATÓ, ESPERO CONOCERTE PRONTO TE AMO MUCHO MI SOLECITO HERMOSO DIVINO INCREÍBLE",
        "This whole album means so much to me, a new album after almost 3 years, created with so much love, emotions and beauty. The warmth it holds will save so many of us as and force us to have faith in the future. Louis' music is therapy for most of us and I love how we can support each other. And now, it's him who needs our support to get better quickly because there's so much awaiting him.",
        "No se por qué Louis tenía miedo de hacer la música que él quisiera, ahora lo hizo Y ES INCREÍBLE",
        "This song makes me feel emotional and energetic at the same time",
        "I love this song so much! I can just imagine how this song will sound with fans singing along during a concert. It would also sound so good on a fun scene in a movie.",
        "Louis se merece lo mejor, siento que el amor de las fans hacia el es recíproco, y que nos quiere hacer felices. Obviamente lo consigue. Gracias Louis ️",
        "#1 ALBUM IN THE UK BABYYYYY",
        "Louis nunca decepciona",
        "Ahhh! De verdad estoy tan orgullosa de Lou, sus mv’s son demasiado geniales y se que está recibiendo lo que merece y eso me hace muy feliz.",
        "Me encanta esta canción, i love youuuu Louis ",
        "Xx",
        "TE AMO LOUIS, ES MARAVILLOSO",
        "We have the masterpiece after a long time of waiting",
        "Louis is amazing person. ️",
        "Lyrics-",
        "Louis gracias por hacer las canciones que te gustan, te voy a escuchar siempre\nEstoy tan orgullosa de ti ️",
        "As one chooses to create the music they truly love and not the one that can potentially make them famous but doesn't match their personality and inner world, they're certainly stepping onto the right path. And Louis is gonna end up getting the recognition he deserves, I have no doubts of it (no wonder the album is called \"Faith in the Future\"). We're always here to support our sunshine <3",
        ";)",
        "Holy shit this is so good",
        "this song is aah, I am out of words and\nthe piano (maybe, sorry if I am wrong) is so good in this song.",
        "This is silver tongues ft. Befour zayn",
        "But i dont feel like going home",
        "ESTO ES COMO UNA MONTAÑA RUSA DE EMOCIONES\nAMO TODO",
        "“Mr Macbeth is a naughty man..doo..do…do do dadoo….he’d gone and killed another man..do do do dadoo”",
        "Hi babe",
        "Esse álbum tá incrível, que orgulho do nosso menino 🇧🇷🇧🇷",
        "nunca vas a ver este comentario, pero siento tantas cosas hermosas cuando escucho esta melodía, la letra y tu voz angelical. te amo infinitamente lou, ojalá verte así por siempre, así de contento y haciendo lo que te gusta, cariñitos",
        "las chicas ",
        "eres lo mejor",
        "who r these people",
        "I love when he includes a story in his videos, it makes them so much fun to watch. and the scenes of him singing and the band playing just makes the video incredible",
        "LGBTQ+ vibes are strong in this one fellas ️‍️",
        "No sabes lo orgullosa que estoy de ti Louis",
        "Ed mi video favorito",
        "The kind of music you listen to and instantly already feel nostalgic",
        "reminds me a lil of zayns BeFoUr ",
        "te amo con mi alma louis rockero",
        "Estoy tan orgullosa de ti Louis, de tu nuevo álbum, todo lo que te propones lo logras y de una maravillosa manera, gracias por tu música, con letras tan significativas en la vida, amando cada parte de ti y de tu carrera tomlinson",
        "0:44 caraca, eu achei que era o Liam na era careca KKKKKKKKKKKK",
        "So so good",
        "Congratulations for 1M views  \nLet’s go for more ",
        "Lou deserves so much more!",
        "te amo te amo",
        "Indie is my favorite genre and Louis Tomlinson singing this song makes it even better.",
        "Amazing... I love you",
        "AMOOOOOOOOO",
        "Can’t stop listening ️‍",
        "Am I the only one who can’t go a day or an hour without fift? I mean seriously",
        "I love Steve's energy!",
        "I love everything you create ️",
        "Needs a blooper/outtakes/bts reel, Louis.",
        "No sé por qué pero siento que mientras esta canción suene nada puede salirme mal",
        "AND NIGHTS LIKE THESE",
        "I love watching Ali react to Dhar Mann videos. Congrats on 10M subs, Ali! \nAlso, I cannot believe Jay wasn't even slightly terrified when he was kidnapped and that he only said \"Fortnite\" at 10:11.",
        "estoy muy orgullosa de tí Lou, este álbum es tan hermoso, esta es una de mis canciones favoritas,me encantó el vídeo<3",
        "Only we know",
        "Te amo lou",
        "hope you're doing fine with your arm, louis. take care love <3\np.s: can i get a birthday wish from you??? it'll make my life better",
        "Louis words canno explain how much I love you and how frickin’ proud I am of youYou’re such a talented gem and you’re just the best person ever",
        "Sesin çok huzur verici çok seviyorum seni",
        "Hello!!!! Louis\nI really like your videos and songs.\nYou're the best.\nGreetings!!!!! 🇲🇽🇬🇧️️️️️",
        "Todavia no escuche al álbum. Esa cancion deberia ser single o hay mejores?",
        "hey",
        "TE AMO SILVER TONGUES",
        "I love louis Tomlinson, silver tongues is one of my favorite songs on the album.",
        "dps vou ouvir seu álbum prometo",
        "Jesus Christ loves you bros",
        "3:12… Louis, don’t be shy, give us her ig.🫣",
        "Louis canta com o coração, consigo sentir muitas sensações só escutando suas músicas, muito bom trabalho Lou :)",
        "I'm so obsessed with this song! No, wait, I'm obsessed with all the album. Is perfect, I can feel all the work, the love, the heart that Lou used in this proyect. I'm so proud of the sunshine and everything that he does.",
        "I LOVE IT",
        "Este video es adictivo",
        "tremendo temazo",
        "Muy orgullosa de todooo lo que esté gran hombre ha logrado hasta ahora. \nTe conozco desde 2011 y eso me hace muy feliz\nLouis tu me haces feliz ",
        "I will remember",
        "I don't feel like going home <3",
        "Te amoooo",
        "bravo lou !!!!",
        "todo lo que hace lo hace demasiado bien, le pone todo el cariño del mundo, amé todo ",
        "herseyimsin",
        "Testimonio de la hija de una víctima\n\n\n\n\n\nJiang Li declaró sobre la experiencia de su padre, Jiang Xiqing.",
        "Best album of the year",
        "I Love You Louis ️",
        "Btm bir günde bin olmuştu",
        "Louis I can’t tell you how much this album has done for me I haven’t been this happy in a long time thank you",
        "una canción tan más espectacular,me hace sentir muy feliz,me pone a bailar !!!",
        "IN LOVE",
        "LOUIIIISSS EU TE AMOOOOOOOO",
        "no me canso de decir lo orgullosa que me haces sentir Louis, el esmero y trabajo que le pusiste a este álbum es increíble, gracias por esta obra de arte ️‍",
        "Realmente este álbum se siente como un abrazo, o mucho mejor que eso, la música de Lou me hace realmente feliz, él me hace feliz, lo he seguido desde que tengo",
        "dónde termina mi depresión: 0:33",
        "TE AMO LOUIIIIIS",
        "MI PAPÁ",
        "eu te amo Louis Tomlinsom, e meus dias são mais felizes com você ️🇧🇷",
        "My baby ",
        "Damn I love this song yasss it’s giving me the early 2000’a vibes",
        "oh my louis. you don't know how much i love this album. every track are masterpiece \nyou literary own my heart️️️\ni love you so much 🇧🇩️",
        "eres un capo",
        "Amooo, ya quiero cantarlas en vivo ",
        "love you",
        "a louis lo empecé a escuchar en pandemia y puedo decir que fue mi mejor decisión, lo amo y saber de el y de sus logros de cada día me hace muy bien ",
        "he is a great composer the lyrics are beautiful and the melody very good",
        "TENEMOS QUE HACER QUE FITF LOGRE LO QUE WALLS NO LOGRO,",
        "This is epic",
        "YOU KNOW WHEN IM WITH U IM SO MUCH HAPPIERRR AADKWKSOQ",
        "te amo hermoso",
        "Love hiiimmmmm",
        "I know no one will read this, there are several comments.\nBut I want to write it.\nMy identification with this song is enormous, my family doesn't want me to have a partner, especially my mom,  They want me to end my relationship.",
        "I love youuu ",
        "We love you",
        "Louies sigan haciendo Stream, interactúen en los comentarios y hagan q las canciones q tengan menos vistas suban. Hagámoslo por Louis q se lo merece<3",
        "We love you Louiiii️️️️️️️️️️️️️️️️",
        "Estoy tan jodidamente orgullosa de Lou, no hay duda alguna que es un artista espectacular y muy único, y me hace muy feliz ver y ser parte de su progreso, definitivamente existir en la misma época que Louis es una bendición increíble! Y el ver como va encontrándose y es feliz con lo que hace es increíble, te amo Lou bonito, tú nunca decepcionas ",
        "I'm so so sooo proud of you, Lou! \"Faith in the Future\" is a gorgeous album, every song is a work of art. Thank you for everything Lou, I love you sooo much, you deserve the best ",
        "LO BELLO QUE SE VEE",
        "I belong to this man.",
        "ÓTRÚLEGT",
        "This is my favourite song on the album! Songs about happiness and friendship are always so cool, and this one is by far the best. Louis’s really gone above and beyond with this album and I love everything about it",
        "Lou lou lou louuuuuu",
        "loueeehhhh, u're finally doing it!! i love you so much. please continue doing what your heart really desires. always follow the right path and you will be finally home. remember that home is where your heart is.",
        "Lalitas de Lali Esposito apoyándo a Louis Tomlinson silver tongues",
        "HINO DE MÚSICA, HINO DE CLIPE, HINO DE HOMEM. LOUIS, ENTENDA, EU TE AMO, HOMEM️️",
        "ME GUSTA XD",
        "I think the main point is to enjoy the moments with your friends  i love so much this song",
        "I watching this all day long..love you Tommo",
        "the best song",
        "this man never fails to surprise me",
        "I feel like this song has connection with the boyzz",
        "You are the best",
        "ААА, очень классная песня, обожаю:)",
        "I can’t even describe how proud I am of you in these lines. It really makes me so happy to see how you are keeping your mouth shut, how you grow day by day as a singer. Despite so many things that have happened, you always have a big smile for everyone, especially for us, your fans, you always manage to make us smile, and even save our lives. I really hope you are being very happy in this process, because every day you are much better, and that makes me proud more than anything. You are my life, Lou, thank you for being who you are and for giving us a great example that giving up is not an option. I love you like no one else, and I hope your recovery from your little arm goes well :(. I would give anything to be in your place, and that you could continue with the things that excite you so much, but I can’t. I send you lots of kisses on your little arm, I love you. ",
        "I love him so much",
        "Hace 1 año que lo sigo y no me arrepiento de nada. Tan orgullosa de lo que es, su estilo y creatividad sin dudar diría que silver tongues es mi tema favorito ",
        "I need to listen to this song everyday. It's such a masterpiece. This is my favourite song of this album",
        "Need a double \"like\" button for this one.",
        "His voice is so graceful, his style is so fresh, he's kind to his fans. He is a beautiful person.",
        "LOUIS TE AMO",
        "espero algún día escucharla en vivo",
        "te amo",
        "A voz dele é tão doce🥹️‍",
        "Louis la rompió y demostró a muchos otros que el talento que el lleva es enorme, tanto su equipo como el han hecho un trabajo increíble en el álbum, muchas gracias Lou por darnos tremenda joya ",
        "very interesting video but I love it more than Harry styles music videos lol",
        "QUIERO UNA NOVIA PARA PODER DEDICARLE LA CANCIÓN",
        "i love this album with my whole heart",
        "Les juro que es mi canción más personal ",
        "where was this music video filmed?",
        "OH MAN... As a fan of your work I can say I'm probably in the most proudest era, doing this such an amazing album you proves how you have growth as an artist, as a musician and personal really, you embraces yourself to do an album that no mather what people may or may not think, you always would be proud of... and that's exactly what success means to me, Louis.. man we are so freaking proud of you, your vocals are at their top!! I keep trying to overcome the mind-blowing sound this album has, the vibes and emotions it transmits, seriously I cant get over the possibility of hearing and enjoy it live, IT WOULD BE CRAZYYYYY I cannot waiiiit!",
        "oigan no entendi un choto del video pero q buena vibra la vdd, TE AMO LOUIS",
        "LOVE IT ️️️",
        "MI ROLA",
        "stream faith in the future!!!",
        "LOVE IT!",
        "temazo lou, tqm",
        "que orgulho de vc ",
        "Louıs this is wonderful I love you, and all very handsome the truth. That eye contact, wow. ",
        "Va a ser increíble, como todo lo que hace Louis",
        "I wish I could come to your Tour but I can’t because ‘em we can not afford it",
        "I love this song and added it to my daily playlist immediately it gives me a light feeling",
        "i love him so much",
        "Lou, you are pure talent. Very proud of you, and to be your fan!!!",
        "Te amo mi amor,siempre orgullosa de todo lo q haces.♡",
        "parabéns louuuu",
        "I’m here to support u",
        "Este álbum está que arde , is the best ",
        "kiviä",
        "Every time I hear this it's better. So good on so many levels.",
        "Love this. Pure and simple   ",
        "Todas las canciones del álbum sos hermosas pero esta es mía me encanta gracias Louis por hacer arte",
        "SCREEEEAM IT KIIING!!!!!!!!",
        "te amo maldita canción hermosa",
        "ES QUE ES BUENÍSIMA",
        "Por dios, todo esto es tan perfecto, Louis es tan perfectamente cuidadoso con todo, por eso y más que orgullo todo lo que mi bebé está logrando después de años, ay no, lo amoooo🥹🫶",
        "پدر گوربه ای",
        "THIS IS SO GOOD",
        "Everybody looks so british",
        "si se pudo vamos por mas",
        "Te amamos louis espero que todo lo que te propongas lo sigas  logrando y  sigas teniendo muchos exitos en la musica y en todo lo que quieras lograr  ",
        "My heart is already melting ️",
        "I really love this song",
        "It's so nice!!!",
        "I don't feel like going home",
        "Esto es increíble, es una de mis canciones favoritas y enserio estoy muy feliz por el nuevo álbum, Louis se merece muchísimo reconocimiento por tremenda joyita que nos está dando.  \nI LOVE YOU LOUIS<3",
        "La música de Louis Tomlinson no tiene comparación con la de ningún artista actual, simplemente es lo mejor de la industria musical",
        "\"Bello chicken\"",
        "Maravilloso como siempre Lou, por favor sigue haciendo la música que desees",
        "Louis te amo",
        "I LOVE IT LOUIS IS AWESOME",
        "Te amo tanto, me encanto!!",
        "Reminds me of arctic monkeys. Cool ",
        "Anyone want to help me with drawing a rainbow flag on pixel planet over a hakenkreuz in Germany?",
        "I'm so proud of you Louis!! You deserve all of the attention you're getting and all the good that's coming out of this. The album is amazing and I love hearing all the songs <3 I love you so much and you make me smile every single day! Love you forever !!! <3",
        "COME ON ENGLANDDDDDDDDD",
        "Tan lindo mi vida ",
        "Demostremos todo nuestro amor a Louis, es increíble. Sin duda es un gran artista.",
        "No dejo de verlooo",
        "ele quebrou o braço dps de sair do show ️️ melhoras",
        "Estoy tan orgullosa de Louis y como el solo esta destacando, superando todo , te amo Louis, orgullosa de ser una Louie <3",
        "Vamos hay que subir los numero",
        "We are all so proud of you Louis. You’ve come so far and you’ve made some of the best songs ever. I just know this is gonna be amazing because your so amazing. We love you",
        "Louis said it was bigger than him, but I'm actually not sure anything in this world could be bigger than him... He is the best, hope, Lou knows how much we love him ♡",
        "wow nice track :)",
        "musica perfeita",
        "Uy",
        "youknowwhenimwithyouwearesomuchhappier ",
        "The next Boy Wonder of song writers and proformers out of Great Britain. ",
        "Getting high on the amber wave\nEntorpecidos na onda do âmbar\n\nGoing deep for the ones who do the same",
        "Love u ️",
        "amo este tema",
        "Mi canción ",
        "nn entendi qual foi a do cara depressivo louis ",
        "larga vida a louis",
        "Louis es mi lugar seguro. Es mi persona favorita en el mundo y me siento muy orgullosa de él, también de mi y lxs louies que estamos viviendo esta nueva etapa con su nuevo álbum <3",
        "En días como estos, en dónde me siento que no se que hacer con vida y estoy demasiado triste por ello, vengo a mi lugar seguro que es Lou  y recuerdo que debo tener fe en el futuro ️️. TE AMOOOOO, LITERAL POR TÍ LE ECHO GANAS A LA VIDA.",
        "Louis is like a quiet hurricane for you never knew how he blew you away",
        "Masterpiece ",
        "Omg- He's so damn adorable.",
        "SUBE SUBE PPK",
        "Louis  so proud of you ",
        "Me encanta, el nuevo ritmo de las canciones y la energía es tan mágica, te amo Lou <33",
        "Tengo una adicción por esta canción",
        "Would love to see louis bring his solo music to nz I am sure the kiwis would love it over here  louis forever",
        "Flamengo",
        "Teamo",
        "KEEP STREAMING THE ALBUM ON SPOTIFY !!!\n\nKEEP STREAMING THE VIDEOS AND AUDIOS HERE ON YOUTUBE !!! SUPPORT LOUIS <3",
        "omg, isso está perfeito"
    ],
    "comments_disabled": false
}