{"video_id": "wFloE26iUks", "comments": ["True fact: Everyone agrees that Louis Tomlinson is melting everyone's heart with his songs", "La música de Louis Tomlinson no tiene comparación con la de ningún artista actual, simplemente es lo mejor de la industria musical", "Simplemente me encanta", "I just have to say how extremely proud I am of you. Being a fan since 1D means sm for me because you saved my life by your music and I'm so happy that you did. You're amazing and I'm so happy for how successful you've become ️️ ily sm", "Realmente este álbum se siente como un abrazo, o mucho mejor que eso, la música de Lou me hace realmente feliz, él me hace feliz, lo he seguido desde que tengo", "KEEP STREAMING THE ALBUM ON SPOTIFY !!!\n\nKEEP STREAMING THE VIDEOS AND AUDIOS HERE ON YOUTUBE !!! SUPPORT LOUIS <3", "I'm sure this music video will be too personal for Louis as it's his favorite song on the whole album, I'm grateful to be able to see it and that Louis gives us the opportunity to see further. // Estoy seguro de que este video musical será demasiado personal para Louis, ya que es su canción favorita de todo el álbum, estoy agradecido de poder verlo y que Louis nos dé la oportunidad de ver más.", "a louis lo empecé a escuchar en pandemia y puedo decir que fue mi mejor decisión, lo amo y saber de el y de sus logros de cada día me hace muy bien ", "Siento las canciones demasiado íntimas para mi, muy personales no se como explicarlo, pero siempre tiene las palabras correctas que necesito escuchar, Dios mío Louis me siento tan orgullosa de lo qué haces y de quien eres día a día. ️Este álbum es un abrazo increíble al corazón.", "Can't get over the fact how great FITF is! One of the best albums I've ever heard. I'm so happy for Louis, he's found the sound and the space that suits him perfectly. That's his time to shine ♡", "As someone who's never really \"fit\" into any group growing up, I felt this song and video so hard! The feeling when you find those who understand you and accept you is priceless and is truly liberating. Great song and a great album!", "Beautiful song ", "Soy demasiado pesimista pero con el álbum siento que hay algo bueno en el futuro, se siente como un abrazo que te dice que todo va a estar bien y eso significa mucho", "Eu amo como a voz do Louis sempre foi fofinha assim, não conheço nenhum cantor com a voz parecida com a dele.", "It’s been a long time since I listen to one direction and I’m aware of these boys solo but Louis??? My guy I’m so proud of you!! This is brilliant and suits him so well. I’m tuning in!", "I'm so so sooo proud of you, Lou! \"Faith in the Future\" is a gorgeous album, every song is a work of art. Thank you for everything Lou, I love you sooo much, you deserve the best ", "escuchar a louis es como un abrazo al corazón", "This whole album is literally a breath of fresh air, a soothing presence through my earphones. I can never thank you enough for this masterpiece Louis. I love you", "OH MAN... As a fan of your work I can say I'm probably in the most proudest era, doing this such an amazing album you proves how you have growth as an artist, as a musician and personal really, you embraces yourself to do an album that no mather what people may or may not think, you always would be proud of... and that's exactly what success means to me, Louis.. man we are so freaking proud of you, your vocals are at their top!! I keep trying to overcome the mind-blowing sound this album has, the vibes and emotions it transmits, seriously I cant get over the possibility of hearing and enjoy it live, IT WOULD BE CRAZYYYYY I cannot waiiiit!", "ok but the fact that I keep calling Silver Tongues my song bc it was dropped on my birthday and it is exactly how I felt since so many years ago. The feeling of not want to go back home because of how you feel with your people and how that keeps you in a happy state specially when everything seems bad except for that little and special part of your life.", "I am so freaking proud of you Lou and the album is amazing ", "Esta canción siempre me pone de buen ánimo ️ la amo ", "Louis's best album to date.  Luv the fact that he hasn't tried to tone down his Doncaster accent.  He's kept it real.  Thanks heaps, Louis and congrats to you and your team. Luv your work and dedication to your craft. ", "This was absolutely amazing, and the album is so incredible!! The cinematography, your vocals, the acting, it's all amazing!! We are so proud of you Louis, and we all love you!!", "Joder tiene muchos sentimientos el oirla, motivación tristeza y felicidad,  love you louis. ", "One of my many favourite songs on the album  such a dancey vibe", "Muy orgullosa de todooo lo que esté gran hombre ha logrado hasta ahora. \nTe conozco desde 2011 y eso me hace muy feliz\nLouis tu me haces feliz ", "With each song you can see how Louis is more and more confident. This style suits him. I love how free he is with his music. The whole album is one bomb after another. I can't pick one song as a favorite because with each listen it's the next.", "I love this song so much! I can just imagine how this song will sound with fans singing along during a concert. It would also sound so good on a fun scene in a movie.", "este chico cada vez la rompe más, AMO ESTE ALBUM CON LOCURA!!", "this song is the kind of song that makes you dance from the first time you hear it. i'm really having a blast. this song is hella good... this is literally a masterpiece <3", "This entire song just screams HOME! It's so great to have a person with whom you could be yourself, talk about anything and everything without giving a care and do all kinds of silly things like dancing at midnight or screaming songs while midnight driving. Love everything about this song! This is fooking incredible! \n\"Those stupid jokes, only we know\" everyone deserves a person that could relate to these lines. I just LOVE THIS AHHHHH!!! We're so proud of you Lou!", "His voice is so graceful, his style is so fresh, he's kind to his fans. He is a beautiful person.", "Que buena música haces Louis Tomlinson ", "The fact that he tells whole stories with his music videos is amazing", "I only started listening to Louis’ solo music literally TODAY. This morning I listened to “Always You” and fell in love, so I listened to the whole album and his other singles. I really love the whole Walls album and I’ve barely had time to process it, but it turns out there’s a whole new other album to start loving as well  I AM OVERWHELMED", "Thank you Louis for your great music, your angelic voice, your touching lyrics, your immense talent, your kindness, your sassiness.... for being born in this lifetime. We love you from the bottom of our hearts", "Louies sigan haciendo Stream, interactúen en los comentarios y hagan q las canciones q tengan menos vistas suban. Hagámoslo por Louis q se lo merece<3", "gracias louis por hacer tremendo temazo, mi canción favorita del álbum, sin duda, te amooo", "Just imagine how many people in just a couple of years will be jealous of us for living this incredible FITF era with Louis. We are so fortunate to know him and to witness his unbelievable growth here in the moment. Let's appreciate this before everything we love becomes memories ♡", "Me encanta esta canción, i love youuuu Louis ", "As one chooses to create the music they truly love and not the one that can potentially make them famous but doesn't match their personality and inner world, they're certainly stepping onto the right path. And Louis is gonna end up getting the recognition he deserves, I have no doubts of it (no wonder the album is called \"Faith in the Future\"). We're always here to support our sunshine <3", "UNA DE MIS CANCIONES FAVORITAS DEL ÁLBUM <3 no entendi nada pero MUY ORGULLOSA DE TODO LO QUE LOUIS ESTA LOGRANDO callando la boca a los que lo minimizaban como artista ", "nunca vas a ver este comentario, pero siento tantas cosas hermosas cuando escucho esta melodía, la letra y tu voz angelical. te amo infinitamente lou, ojalá verte así por siempre, así de contento y haciendo lo que te gusta, cariñitos", "Silver tongues es de mis canciones favoritas del álbum, es demasiado perfecta!", "lo amo tanto, estoy tan orgullosa y feliz de que él se sienta bien consigo mismo y con la música que ahora hace, que haya encontrado ese estilo que lo haga sentir cómodo,", "El orgullo que siento por Louis ahora mismo es enorme, todo lo que esta logrando por su cuenta por que cree en si mismo y sabe que es bueno, me siento super feliz de que este haciendo la música que desea y que siente nuestro apoyo. TE AMO LOUIS, MUY ORGULLOSA DE TI.", "Louis es de los artistas que sacan una canción y es buena, demasiado buena y hace que se te pegue el ritmo al punto de aprenderte la canción completa.", "Es un poema hermoso ️ me hace extremadamente feliz", "I love it sooo goood", "He visto este video más veces de las puedo aceptar y cada vez SIENTO QUE ES MÁS HERMOSO ", "Alright imagine it... \nIn the car with your best friend or partner blasting this full volume with the sun setting on country roads\nAhhh perfection", "Gracias Lou por haberle callado la boca a todos los perdedores que no creían en ti ¡Estoy muy orgullosa de ti!", "perfeição tem nome e se chama louis tomlinson", "sí pudiera ir a un concierto de él, no lo dudaría", "Me voló la cabeza este video es hermoso full producción amo que le estén dando el trato que corresponde porque es un tremendo artista integral te amo lou por tu cerebro por tu talento ", "AAAAAAAAAAAAAAAAAAAHHHHHHHHHHHHHH Él siempre haciendo de la suyas! para que negarlo si me encanta todo  lo que Este hombre Hace. TE AMOOO LOUIS Y A TUS CREACIONES!!!!! Y poderlo ver en los vídeos  siendo él mismo y divirtiéndose y como yo soy muy especulativa, tratando de darnos su perspectiva de lo que lo hace sentir la canción o solo para que nosotr@s nos comamos la cabeza pensando que significado tiene el vídeo... pero, en fin  solo con estar su masiva presencia ya yo soy más que feliz <3 <3 <3", "I'm so proud of you Louis!! You deserve all of the attention you're getting and all the good that's coming out of this. The album is amazing and I love hearing all the songs <3 I love you so much and you make me smile every single day! Love you forever !!! <3", "Louis said it was bigger than him, but I'm actually not sure anything in this world could be bigger than him... He is the best, hope, Lou knows how much we love him ♡", "Maravilloso como siempre Lou, por favor sigue haciendo la música que desees", "ALMOST 1 M!! WE CAN DO IT LOUIES!!", "tanto a letra quanto o clipe me fazem lembrar da tour de walls e das madrugadas que eu perdia assistindo live SAUDADES", "Está canción me da una felicidad inexplicable", "Dios es increíble, realmente estoy orgullosa de Louis y ver la confianza q ha empezado a tener, ya sea con el tema de explorar nuevos géneros o el hecho de ver como ahora se atreve a hacer notas más altas y arriesgadas. Estoy tan orgullosa de él, lo amo demasiado, q bonito saber q él tmb a nosotros ", "Louis nunca decepciona con su música ", "eu te amo Louis Tomlinsom, e meus dias são mais felizes com você ️🇧🇷", "Esse álbum tá incrível, que orgulho do nosso menino 🇧🇷🇧🇷", "Amazing song ️️️", "This song makes me feel emotional and energetic at the same time", "This single and the whole album already own my entire heart. Louis, I can't thank you enough for making music. You are a light in all our lives and I cannot put into word how grateful I am for you and your music. It gets me through a lot. The optimistic tone of the album is truly uplifting and exactly what I need right now, a glimmer of hope. I love you so so much. The music video is amazing, it's already one of my favourites. It's well thought out and you can tell how meaningful the song is. <3", "Gracias por inspirarme cada dia a ser la persona que siempre soñe, te amo demasiado. We love you Louis.", "Me encanta no dejo de escuharla", "uma das melhores do álbum!", "No sé por qué pero siento que mientras esta canción suene nada puede salirme mal", "Silver Tongues não é uma música é um sentimento", "Definitivamente esta canción está en mi top de favoritas, simplemente tiene una vibras tan hermosas<3. Muy orgullosa de todo lo que Louis ha logrado hasta ahora.", "Louis nunca decepciona, siempre supera mis espectativas, todo el álbum es espectacular, y no puedo esperar para escucharlo en vivo....", "I normally don't really comment, but I just wanna say that I love this song!!", "TENGO LA NECESIDAD DE ESCUCHAR ESTE TEMA EN VIVO PARA CANTARLE A LOUIS: YOU SMILE AT ME AND SAY IT'S TIME TO GO BUT I DON'T FEEL LIKE GOING HOMEEE Y DESGARRARME LA GARGANTA", "mds eu to tão orgulhosa de você, obgd louis eu te amo tanto, obgd por ter salvo a minha vida, obgd mesmo.", "Super proud of the man you've become Louis,this song is everything i need now, thank you for these masterpiece", "Este álbum esta increíble, la escencia de Louis, la letra, las emociones que transmite, estoy muy orgullosa de lo que has logrado Louis, te amamos!", "Inspiração vem dos outros e motivação vem de dentro de nós.", "This is such a an amazing song I'm so proud of you Louis", "This song makes me feel nostalgic and remember all the happy times. Lou has created a masterpiece", "I like the new style of music. Its exactly the kind of stuff I love to listen to. I loved walls but this is absolute perfection", "o clipe tá incrível!", "Louis, I'm so proud of you, you deserve this all in fact you deserve more than this. Love you ", "️‍ Every fibre in my body is in an uproar of excitement....every damn time I hear this (& FITF)...I feel like 15 years are taken of my shoulders & I can conquer the world..again. Thank you a million times, Louis. ️‍️‍️‍", "ААА, очень классная песня, обожаю:)", "Never be tired to watch this mv. I love this so much. Louis, thank you!", "oh Louis tu vos me trae paz en el Alma  el mundo te nesecita en estos momentos en que todos estamos tristes y con mucho miedo por todo lo que esta pasando gracias⚘", "Amo esta canción y cada vez q la escucho me hace acordar a una parte del video de 1D a ver si a ustedes le pasa igual cuando unas horas antes de un gran concierto ellos jugaban en un carrito (louis y liam ) zayn en la patineta se escapaba de Poul esos juegos de niños a pesar q tenían q salir a hacer tremendo concierto", "No me conoces y aún así me salvaste, de maneras inimaginables llegaste desde que yo era una niña hasta ahora, te he seguido por 11 años y estoy orgullosa y feliz por ti, de saber que esto es lo que te gusta, por fin estás disfrutando tu carrera después de tanto. Estamos aquí por ti Louis, no hay otra razón, no estamos porque eres el ex miembro de una boyband SOLO POR TI", "que canción tan hermosa, la amo demasiado", "no te imaginas lo orgullosa que estoy de vos lou, demostraste que ya no sos solo un cantando de una banda, sos un genio", "This song is amazing! Love you Louis, I'm so proud of you! ", "Nao tem palavras pra descrever a perfeição q é o trabalho do Louis", "Louis nunca decepciona, Silver tongues es una de mis canciones favoritas de FITF<3", "I can’t even describe how proud I am of you in these lines. It really makes me so happy to see how you are keeping your mouth shut, how you grow day by day as a singer. Despite so many things that have happened, you always have a big smile for everyone, especially for us, your fans, you always manage to make us smile, and even save our lives. I really hope you are being very happy in this process, because every day you are much better, and that makes me proud more than anything. You are my life, Lou, thank you for being who you are and for giving us a great example that giving up is not an option. I love you like no one else, and I hope your recovery from your little arm goes well :(. I would give anything to be in your place, and that you could continue with the things that excite you so much, but I can’t. I send you lots of kisses on your little arm, I love you. "]}