{"video_id": "wV6kWL5WU78", "comments": ["Cities: Skylines is free to try Nov 10-14! Don't delay, those cities are just waiting to be destroyed: https://play.citiesskylines.com/LGIO", "The fact that Josh’s save is still playable is a testament to how amazing the programmers at Coffee Stain are at optimization.", "19:31 that Lizard Doggo slowly backing off with a terrified expression on its face makes me want to cry", "I like how the game makes it literally so easy to move supplies from one point to the next, with multiple options from conveyor belts to automatic trucks to drones, and Josh still has to find a way to make it extremely difficult for everyone involved.", "This guys is that one friend that can get annoying to play with, but you can never take him serious enough to actually get mad, and you keep wanting to play with him because he's just a cool guy", "Josh's PC when he boots up Satisfactory: \"Why do I hear boss music?\"", "\"These trees are gonna be no match for all these explosives,\" That was the entire strategy for bombers in the Vietnam War", "Abusing innocent bridges to advertise a videogame!? This won't be forgotten Josh...", "I love how you can progressively hear him get more and more tired", "Seeing a day old video at 2 million views is beautiful. You totally deserve it. Good work, Josh.", "you know its a good meal when you have josh's video in the backround", "I love how with every new video Josh sounds more and more dead inside", "the jump pads failing only when Josh starts thinking he's got it made me laugh so hard", "Josh slowly losing his patience over his long-lost sanity is honestly a treat", "\"And then send them all across the map, and pretend you're in Top Gun.\"\nI like this already.", "I didn’t expect another episode of this masterpiece", "The train to have over 150 carts and to load 1 and then deciding that it was not intended but keeping it that way\n\nThis absolutely killed me", "If there's one thing I find educational in Josh's videos, it's the patience man", "Let's have a moment of silence for Josh's computer.", "I love the chaos Josh brings to stuff. I wonder if he'll make a pair of jump pads that just infinitely bounce a truck back and forth", "we appreciate you man. I know it takes hours of effort, and we love the result. the save file for this game must be getting insane.", "There's nothing like getting up for work, dragging myself out of bed, sitting down to eat breakfast half asleep and then seeing there's a new Let's Game It Out video! Just gets the day going right every time ", "\"Who wants to do landscaping with your hands?\"\n\nAs a landscaper, this does bring a smile to my face.", "Building the jump pads was the only time I've ever heard Josh sound defeated. A rare phenomenon indeed", "josh is the real life incarnation of chaos ", "This is no longer satisfactory, but “oh god please help what is happening im having a stroke-factory” very fitting name", "Words can never describe how Cory makes our sad days better with just one video :/", "...I hope someday they add a feature to this game where the lizard doggos take revenge if you abuse them too much, specifically because of Josh.", "It's great to see more people recognize technoblade's amazing story telling and personality. Rest in Peace brother. :-", "0:45 the fact Josh acknowledges that he’s actively making things worse shows he’s not a deranged maniac unaware of his actions, but actually a psychopath who is actively making these decisions", "The theme of this video is Josh accidentally building the Snow Piercer on an alien world. ", "it’s always a good time when josh uploads", "Can’t believe this was kind of a Throwback Episode back to 2016 when this series started", "Your channel is nothing but joy. Honestly brings me so much more happiness than even the best TV.", "The reason Satisfactory is still in early access is because of this man.", "Every time Josh has to name something I remember lunch time snd starts laughing", "I actually bought the game & played it quite a bit after watching the earlier videos.\nActually playing the game makes you appreciate the scale of the mayhem in a very different way :'D", "Thank you for making my day once again. I couldn´t stop laughing with all this chaos you created", "This man is unintentionally one of the best playtesters. Man finds glitches and shows how he achieved them, and how to abuse them.", "It's honestly impressive his save file even loads up at this point.", "Real ones know, Sigils's humor is high tier B-)", "The idea of Nihilego being a Headcrab is terrifying, yet accurate to the lore.", "\"You could make it beautiful in your own way\"\n\n- Josh's description for the ruination he brings to every game.", "The joy that your videos brings me is beyond words", "honestly the pure fact that he literally got more than he wanted just shows how much dedication he has to the videos damn O:-)", "Josh boots up Satisfactory\nJosh’s computer “Somethings wrong I can feel it”", "I just have one thing to say : Josh always do quality over quantity", "I just imagine the poor souls who are going to find this planet in a couple hundred years and their confusion and horror at all of Josh's creations", "Can we just appreciate how much josh wants to break the games he plays", "Great job getting #2 on trending Josh! Your content is worth it!", "The voice acting in this game is phenomenal. That frustration in Atreus' voice when he says \"great, I guess everyone's against me now\" sounded so realistic.\nAnd Mimir saying \"something bad did happen! LOOK AT ME! At Freya, at Tyr! Odin did this to us!\" was so well delivered ", "Josh is the definition of: oh no I let the intrusive thoughts win", "okay i discovered you like some hours ago, and now i have to ask just how much years do you spend on game, trying to breaking it to every single thing you found. Well as for me, i appreciate this entertainment a lot, so i hope you'll continue :)", "the sheer dedication of this guy is unreal", "We already know whats gonna happen when josh sees a update or a new game", "Josh is the definition of “mining off camera”", "The four horsemen of \"Uh oh\"\n\n\"Let me give you the grand tour\"", "Josh: \"We're playing Satisfactory again today.\"\nLizard Doggos: \"What is this ominous feeling I sense???\"", "I went back and watched the entire series for this it was worth it :)", "these are very well made i'm hyped for finale gl everyone", "One of the best QA testers of all time.  No joke.  It must be a 'blessing' to have Josh destroy your game.", "every time he cuts back and he sounds just a bit more dead inside is very funny. but also concerning, you dont have to do this to yourself", "Your videos are what I go to when I feel anxious and can't sleep, they always help. I appreciate it :)", "10:20 “this will be easy to do and take no time at all!”\nGiven the time he usually spends on his whims ,2 hours is actually pretty short", "Congratulations speed you have worked hard for everything and have created something that no one can replicate!! Continue striving !", "Every time I watch these videos it always puts a smile on my face", "Well done hitting trending Josh!! Me and my bro have been watching the vids for years, and can never wait for a new to come out :P", "Josh:\"Let's have fun and build ton of swirly lines again\"\nAlso John:\"Why does this always take so long?! \"\n\nMeanwhile editor John:\"I HATE YOU\"", "The Satisfactory videos are my absolute favorites. It's been a bad day, so this will help", "When I hear \"This is Josh, from let's game it out\" it's like a balm on my soul.", "Josh's schedule shows that he is doing more chaos then we can imagine.", "You should upload more often josh because you are hilarious especially on satisfactory", "I really hope she blesses us with another video this month like last month", "Josh’s satisfactory series is the definition of “everywhere”", "I love how the attempted automation immediately turned back into Josh manually delivering the supplies again, heh heh", "you can really hear the joy and wonder in josh's voice fade", "At this point I am absolutely convinced Josh has access to a quantum computer.", "The content no one deserves, but so desperately needs. Can’t wait for the next one!", "The only thing josh has never played \"is there a limit?\" on is his patience and i love it", "This series is by far my favourite on the channel\nPlease don't stop playing Satisfactory!", "Techno: as long as nobody looks to closely at me no one will notice\nRanboo: proceeds to look at him intently", "I literally said \"Oh Josh, you're  a monster\" when you started pushing all the cargo off of the rails.", "Horror movie idea: a regular factory worker goes to his job one morning but then hears \"Hello, it's Josh, welcome back to Let's Game It Out\" from inside the building", "Josh and his slow descent into permanent depression and insanity", "Josh: \"it's another train station!\"\nJosh's computer: \"I'm tired boss...\"", "Should we continue to push this man doing this of his time ?", "when the music kicked in and mark was completely silent but clearly screaming on the inside I was crying of laughter", "It isn't until I watch his videos that I remember why he only uploads 1-2 videos a month. This man puts more time into 1 video than some youtubers do for dozens of videos.", "Josh u put so much effort and time into these videos just to entertain us. Thanks man", "I’m glad that he decided to resume this series", "7:35\nsomething about josh just watching hours of his life pass by before his eyes and just saying 'things are going great' is just such a mood", "Apparently Satisfactory has not yet been satisfied seeing Josh destroy the game further.", "Josh boots up his computer.\nComputer: \"Oh no, NOT AGAIN!!!\"", "I love how he actually advances in the game while traumatizing the developers ...", "i swear josh makes the best vids well done :)", "The supplies made it to the destination...  but are completely inaccessible.\nGood thing that is not something Josh worries about", "its great how he sounds progressively more tired as the video goes on", "When the viewers need him most, he finally returned.", "I appreciate the sheer amount of time this video must have taken to make.", "This video reminds me of my marriage. You think running a train will save it, but the real loads being dropped were the friends we made on the internet along the way. <3"]}