{
    "video_id": "wV6kWL5WU78",
    "comments": [
        "could you please play cities skyline that would be wonderful",
        "These videos r amazing I love satisfactory",
        "How is Anthony doing, last time I have heard of him was in the goodbye video",
        "this was about 17 minutes too long",
        "Gameranx did a video that included Satisfactory, and the fact that the static image for a base was Josh's base says something.",
        "Dude has to be using some future graphics cards like geez I know if I did this on my 2080ti my PC would turn into a thermonuclear bomb",
        "I thought I was the spaghetti king but you definitely out did me, Good job sir, Good Job !!!",
        "Josh. What did you do now.",
        "Wow\nWow",
        "Pls more grace",
        "so when is the yami likethis merch dropping",
        "2:50 bosnia simulator",
        "I highly doubt my comment a couple months ago with a list of questions (including if we could ping pong ourselves and other things off of the launch pads) influenced this at all but I'm incredibly happy for that one to be partially answered!!",
        "3:14 This would be Perfect od Josh started singing \"how bad can i be\" from lorax",
        "I missed u man I haven't seen u in 2years",
        "I feel like Josh has his sponsors pay for better parts to his pc, or getting new pc’s",
        "Please break raid shadow legends",
        "Can’t believe this was kind of a Throwback Episode back to 2016 when this series started",
        "Dude whenever I see a new upload I'm always happy your videos are very funny I love the content what you make please be funny",
        "The true hero of this video? The frame rate.",
        "When you play satisfatory i expect nothing less than absout mayhem.",
        "Very interesting game",
        "Josh u put so much effort and time into these videos just to entertain us. Thanks man",
        "These games aren’t even safe",
        "i remember before Josh had 1m followers..",
        "If i'll ever have a chance to make a game, you'd be one of the first to try it out xD",
        "i would love to see him play cities skyline",
        "try scrap mechanic pleaseee!!",
        "Play Jurassic world evolution 2 you make your own Jurassic park (it was also mad by the people who made frontier) edit: people can die in it to",
        "YESSS",
        "Let's Train It Out",
        "I always wonder why it sometimes takes a while for josh to upload, then he uploads a video and I remember why",
        "everything you do pains me and yet i cant stop watching",
        "If you're ever making a game, and you can't afford a bugtester, just send it to LGIO, He'll play it in the wrong way, find a lot of bugs, and release a video about it, problem solved, you have a good way to find bugs!",
        "for every upload josh pushes out, the more insane he gets. as this video shows",
        "Woohoo 1b views congrats if only anthony was here",
        "1.2 million views a day",
        "Mans forgot the Naraka Battlepass spans five generations",
        "I loved the moment when he just said \"why.\"",
        "Looks like Josh its questioning his life choices",
        "“Hold please”\nTwo words I love when watching Josh. You know it’ll be epic!",
        "i think this is the run that jaiden can finally say LOOK WHO HAS ALL THE BAD LUCK NOW ^_^",
        "OH GOD HE’S BACK",
        "not much of a spoiler, we all know you were only going to make it worse. It's why I love watching you.",
        "Beems also work on jump pads",
        "But I already bought city skielines",
        "Josh is slowly losing patience because his long lost sanity is really a treat\n\nBuilding dance pads was the only time I heard Josh being defeated. A rare phenomenon indeed",
        "yess satisfactory",
        "I like to pretend every time he gets a sponsorship he buys some weed and cracks it out on his days off.",
        "These videos are amazing",
        "hello️",
        "The Satisfactory videos are my absolute favorites. It's been a bad day, so this will help",
        "Coffee Stain cringes when he calls in for tech support!",
        "Your factory looks like the rollecoaster on planet drool",
        "i was born too late to explore the world, and i was born to early to explore the universe. but i was born at the perfect time to enjoy technoblade's legacy. rest in peace.",
        "\"I bought two tickets to paradise!  Pack my bags and leave tonight!  Oh yeah two tickets to paradise!\"",
        "you actualy have a talent hahaha",
        "Lmao his sense of humor is something out of this world ",
        "Miss You Josh !",
        "i would love to see joshes steam account with all the hours he has on each game",
        "Animal abuse",
        "This reminds me of my anxiety . \nIt kinda helps",
        "But will it donkey?",
        "19:07 A true 'Not my job' moment:\n\n\"Delivered the materials, Boss.\"",
        "Every time Josh has to name something I remember lunch time snd starts laughing",
        "I HAVENT SEEN ONE OF HIS VIDEOES IN SO LONG, IM GLAD TO SEE ANOTHER ONE",
        "Alternative title: i used trains to add onto the absolute chaos in satisfactory.",
        "you know its a good meal when you have josh's video in the backround",
        "When you've had 3 drinks and you take out your boredom on your save game",
        "Every time I see Josh playing Satisfactory, I can’t help but wonder what he’ll do next to top the prior train wreck.",
        "You know things are about to turn for the worst when josh says “Hold please!”",
        "Every now and then i wonder if the game developers see how much time Josh spends in the game, and just question what he might be up to now",
        "Knowing you Josh I don't know how you look at a perfectly fine family and think I want to destroy this family",
        "Make more Planet zoo",
        "Your factories certainly are NOT satisfactory, but I love them because they’re chaotic.",
        "You can get access to a vehicle that looks like a Cybertruck in the AWESOME Shop by putting 1 coupon into the Sink and then you get the rights to purchase the truck, and the truck is fantastic on jump pads, would've been great to use one on the jump pads instead of the Tractors",
        "The train to have over 150 carts and to load 1 and then deciding that it was not intended but keeping it that way\n\nThis absolutely killed me",
        "Dear Josh, \n\nwe need more Sims 4 videos.    ",
        "Hi Josh!!!!\nPlease upload more on YouTube then on Twitch!",
        "\"You could make it beautiful in your own way\"\n\n- Josh's description for the ruination he brings to every game.",
        "Why?",
        "Oh lord I’ve been waiting for this chaos",
        "Not the video we want but the video we deserve",
        "Now you just need to add more trains and see how fast I will go who knows maybe it will replace the cannon",
        "Do you support the people that react to your content? (There is a lot)",
        "Brok is a comic relief character without actually sacrificing his character to be that type of person in the story. He's great.",
        "I love how with every new video Josh sounds more and more dead inside",
        "that's what i get for saying that ",
        "if its not to hard can u try creatures of sonara????????????? Tysm if u do <3",
        "MORE SATISFACTORY UPDATES ! (and yes i did copy paste and google this)\n\nSatisfactory Update 6 focusses on “world exploration and combat, bringing players four body equipment slots, and plenty of ammo equipped with a swapping system, visual overhauls and expansions to the world, as well as a new Map Marker system with the Map unlockable from Tier One, and a special new boombox with music tapes to discover and play in-game”.",
        "1:39 ohio simulator",
        "Your save file has lasted longer than both of my relationships.",
        "The fact that this factory is more creative than others is insane",
        "i really appreciate everytime Cory posted a video, it will make my day even more better ! love you Cory",
        "yayey",
        "play minecraft and destroy ur computer",
        "You and Kibitz need to do a satisfactory collab!",
        "hi",
        "The volume is too loud!",
        "yami like this indeed",
        "Wooooo more satisfactorily! And great video!",
        "I felt so bad for the little red dragon lizard dogs LOL",
        "I am dying to see your playtime on all these different games",
        "Dude if mister josh do that in my old computer it will litterly explode ",
        "Is your real name don",
        "This was certainly satisfactory",
        "WARNING \nA LOT OF AIR WAS POLLUTED IN THE MAKING OF THIS VIDEO",
        "Actually, I think this is all covered in the Federal Express Ground Transportation Procedures Manual.",
        "I fell of a cliff while watching this “I’m fine”",
        "All your content just starts to feel the same after a while",
        "Josh playing Satisfactory = Digiconstipation",
        "Did this guy used to have a different gaming channel?  I swear his voice sounds SO familiar, lol.",
        "Let Josh pull a city of Paul (City planner plays) and ... MESS IT UP !  ",
        "Interesting that physics stops when the player is not near.",
        "wonderfull",
        "Your videos are what I go to when I feel anxious and can't sleep, they always help. I appreciate it :)",
        "This video gave me a major burnout",
        "he's just a cool guy",
        "Hey Josh, 1,000,000 hours into that save????",
        "I wanna request a amazing game for u to play its called Roblox you can make your avatar the ugliest and after you make your avatar you can play any game you want there are also very cringe games you can play so please read this and play the game thank you!",
        "The way you game is ridiculous it's great. Imagine working hours on end at your job and come home to game like this. It's great.",
        "@Let's Game It Out please play Dyson Sphere Program. It is really fun, and can (Probably) be broken...",
        "I would say you should share your save (if that's possible, idk if you can do that in satisfactory) but I'm not sure who's computer could actually run it",
        "Play scream park",
        "You are like a all in one biohazard",
        "I'm still waiting for him to beat his 9 hour raft build",
        "Not only is Josh's game breaking skills legendary, also his problem solving skills!",
        "Love the work",
        "Imagine being a game developer and seeing someone make a video of your game but it's let's game it out",
        "Do the paparia games",
        "\"And then send them all across the map, and pretend you're in Top Gun.\"\nI like this already.",
        "I'm still waiting for you to do a full Cities Skylines video!!!",
        "I love how you say linkie in the Description",
        "I’m glad that he decided to resume this series",
        "Bro god",
        "I wonder if Anthony ever watches Josh's video's like WTF Man and then thinks to himself \"Yah on second thought, I seen this coming\" ",
        "josh plays games like how the US government handles governing. as stupidly and inefficiently as possible until everything breaks. the only difference is that he doesn't blame the devs.",
        "Warning: no animals got hurt during this video",
        "1:53 Hiroshima",
        "Words can never describe how Cory makes our sad days better with just one video :/",
        "Josh when you post a video I immediately get high and just binge watch all your videos, your voice does something to my head that just relaxes me... Yes I am kinda relaxed while writing this",
        "am i the only one that used the link within the time limit that gets it with a black friday deal rather then a free to play?",
        "I never thought I'd see Josh make a freighter version of Snowpiercer in Satisfactory.",
        " you have really too much time",
        "The truck automation is kind of hit and miss but typically when you get the path once even if it's not possible by the time you finish it, like if someone puts a building in the way, it'll teleport it's way to the end",
        "llllllooooooooool",
        "I’m watching us all the last day the city skylines is allowed for free lol",
        "Most Satisfactory videos: “Hey guys! Today I’m going to give you a tour of my hyper-optimized base and discuss pros and cons of Manifold vs Load Balancing strategies.”\n\nThis factory: Order is the blindfold humanity dons to shield itself from the burning truth of chaos. Train go VROOM!!",
        "Can't wait for Bitz's reaction to this. His pain is my pleasure.",
        "Yo Josh you should play a game that’s called Roblox it’s a awesome game and you can make your own games it’s like a game in the game",
        "I’ve always wondered why you never play a game properly. ",
        "When that one guy says \"i like trains\"",
        "Josh is the definition of “mining off camera”",
        "Hey Josh I absolutely love your videos man! Keep up the awesome work  \nno matter how bad of a day I have, your videos are giving me at least a smile :D",
        "He's back",
        "Is the game growing more resistant? XD",
        "Have you thought of playing Minecraft you beautiful man?(and if you call me a beautiful creature, trust me I’m not)",
        "More sims content pls!!!!",
        "Techno isnt dead, hes simply flying to heaven. Rest In Peace.",
        "You should really try Rimworld. It has organ harvesting, bear traps, flamethrowers, exotic drugs, gene splicing, party bongs, killer robots, pet bears, people named Grace... the list goes on.",
        "I think your satisfactory-line is my most loved of your archs. I can't stress enough how good, entertaining, funny and blessed/cursed your content is. It is still the channel I dig the most and I am most hyped up about whenever you upload something new. Josh, you are amazing and will forever be my fav content creator on youtube. Thank you for your hard and long work on these videos, it is simply just amazing how good it all is. Thank you!",
        "I really enjoy that the ad in this episode is like its own mini-episide of Let's Game It Out.",
        "Bitz is going to have an aneurysm when he reacts to this ",
        "š9įč",
        "When the viewers need him most, he finally returned.",
        "You could automate this if there were pre-fabs in this game. You shouldn't repeat it from the very start though. It will be years faster to iron out if you have something drop you directly down into a pad. Or just walk into it because the trajectory is the same lol.",
        "I love how soulless he sounds",
        "I like to imagine the corporate overlords that sent you to this planet to begin with are just feeling emotions watching from afar",
        "play terratech. youd love it. trust",
        "Or",
        "nice top gun refrence",
        "Thank you for making my day once again. I couldn´t stop laughing with all this chaos you created",
        "y am I like this indeed",
        "can you make a zoo and if the animals dont do what they should do you bomb them",
        "Finally! I've been waiting for this ",
        "OMG.. The craziness",
        "i like to think josh is related to postal dude\n\ni also like to think the music in his videos is the only music he ever listens to",
        "You should Fr become a game tester and get paid lol and also make money from YouTube you’d be rich",
        "This must’ve been a long number of days for Josh",
        "whish he post more, been with this chanel for ever now lol",
        "I don't know what I enjoy more, Josh's excitement when interacting with lizarddoggos, or the thought of how Kibitz's gona react to said interaction. XD",
        "There's nothing like getting up for work, dragging myself out of bed, sitting down to eat breakfast half asleep and then seeing there's a new Let's Game It Out video! Just gets the day going right every time ",
        "josh: i like my women how i like my framerates. to studder and give me headaches at the same time.",
        "the olny reason this is trending is cause of the first link in the description",
        "Josh do you remember smartphone tycoon theres a laptop tycoon try play it its the same",
        "Instead of choosing to sleep, I choose to see this madness",
        "Hes back hell yea",
        "\"Ah, yes, Josh, our stress-test guy.\" -Game Developers",
        "this whole video feels like a deranged physics lesson.",
        "My two favorite chaotic YouTubers are gray still plays and this guy",
        "Hey Josh, do you have a playlist with all of your Raft videos? I don’t see one.",
        "Damn build me your computer please  lol",
        "I found out about goat simulator, its fun but cursed",
        "They added nukes to statisfactory",
        "I feel like he is slowly losing his mind over the years.... Like in his older videos he sounded more sane and grinded for less hours.",
        "I wonder, what happens when you drive a train through a bunch of tractors?",
        "This entire series is just airport loading/unloading simulator",
        "You should play planet base. It’s a colony game where you make a colony on a different planet.",
        "Love this series!",
        "At this point I am absolutely convinced Josh has access to a quantum computer.",
        "What happened to Johnny Hotbody?",
        "Can you do one on planet zoo",
        "Yami like this\n\nWhat does it mean? That's the question",
        "It's great to see more people recognize technoblade's amazing story telling and personality. Rest in Peace brother. :-",
        "Play my summer Car plis ️",
        "Josh recreates FedEx's process for shipping your most valued goods.",
        "I love how josh is just questioning his disastrous gameplay life in the middle of the video",
        "Josh needs to make a video on the chaos gun cooking simulator DLC",
        "\"What if i send another train in\"\n* plays recording of the same train crash *\n16:15",
        "Let's game it out is the only type of person that will make you watch the sponsorship and not skip it",
        "YES HE UPLOADED YAY",
        "I mean I get that you're doing things like this because it's goddamn hilarious but...the container won't be picked up by the cargo station unless it's on the traincar.  Also, you need one cargo station per traincar; one station can't load an entire train.  Finally, the reason the train stopped is literally just because it needed another locomotive coupled to the train.",
        "Josh I would like to see you nuke everything and try to nuke the frame rate in satisfactory plz",
        "My Thomas train setup be like",
        "This channel is the definition of 'worth the wait'",
        "Id like to challenge you to do bannerlord bc i enjoy bannerlord and your way of game play",
        "Я вчера первую АЭС поставил и заснул как убитый\nА сегодня я понял как мало это значит ",
        "Only one way to find out",
        "It's always a day when Josh posts!",
        "I wonder what would happen when josh plays factorio...\nWorse spaghetti intensifies\nBiter death sounds intensify",
        "josh is the only person that can say 79 hours later and we will believe it",
        "After a year, the man with a thought process that should not be questioned is back to torment a game in which he created nothing but pure insanity. Respect.",
        "Can you please play roblox and I subscribe and liked.",
        "Goat simulator",
        "Mother every thing this guy spends more time on his games than family he has not touched grass in3 years or more",
        "Josh has a beautiful mind",
        "I'm just waiting for when Josh starts  playing with the new weapons",
        "Josh: \"it's another train station!\"\nJosh's computer: \"I'm tired boss...\"",
        "And he gets paid for this",
        "just knowing that I built citys in the same place that you did this video make me want to vomit",
        "Let's have a moment of silence for Josh's computer.",
        "It's a shame they don't have radiation-based damage to plants. It'd be trippy to see a swath of brown dead plants following your rail line of death.",
        "Sand Cesspool Station",
        "Review your PC.",
        "Could you imagine a ball pit of train cars like the tractor ball pit? I wonder if it would gain sentience?",
        "I love violence and adventure patience",
        "Thank you for dying for our sins Josh",
        "Bet the city from josh in city skylines is called ohio.",
        "The supplies made it to the destination...  but are completely inaccessible.\nGood thing that is not something Josh worries about",
        "Interesting.. what about jonny hotbody?",
        "Josh has the hardest working graphics card in history",
        "Well now I'm just waiting for the Cities Skylines videos.",
        "I feel like you need to work with kbitz  for some optimal parts to help your crazier ones",
        "bro literally just made houston 1:24",
        "Josh on Satisfactory? Oh yes, today is a good day.",
        "You know, its much better at 1.75 speed. Same experience, but that way you can watch more lets game it out! Yay!",
        "I really want to see more videos of josh playing(causing mayhem and doing stupid but satisfying and funny stuff in)  satisfactory",
        "He, he, I knew a one crane station was only going to load the first flat car before it even happened in the video.",
        "You know your day is perfect when you see a new let’s game it out video.",
        "has he already played Rimworld? could be interesting what he can do with that world.",
        "I struggle just to get a coal power plant operation going smoothly, and then I see this running without a hitch...",
        "just wait until he discovers mods",
        "Just imagine young Josh playing with toys and how much catastrophic insanity he must have caused.",
        "Finally josh after one month",
        "We need a new raft vid",
        "I like how everytime Josh uploads it gets top 3 trending",
        "yay",
        "Can you make another planet coaster video I love those",
        "OHHHH YYYEEEEAHHHHH!!!!! i love when he uploads",
        "babe wake up , josh just posted a video",
        "If you make a less convoluted track, you could fill the entire track with a single train and it's attendant freight cars.  One complete loop full of freight cars.",
        "Vehicle bouncing has to become the new trend.",
        "Hear me out... Train through hyper cannon...",
        "Das erste Video von dir, dass mir echt nicht gefallen hat! Na ja kann mal passieren.",
        "Every time you open this game, you look around, and proudly say \"mmmh, not enough property damage\"",
        "You are, hands down, the funniest gaming channel I watch. I get some good laughs out of the streamers I watch and the let's play style videos, but you are the only one that I consistently lose my mind and start cackling like a madman because of. Don't ever stop being the beacon of beautiful insanity that you are.",
        "10:35\nyes. Yami indeed like this video",
        "First i thought, wait how can you cause mayhem with trains?\nThen i remembered that Josh is a true maniac in 99% of all Games He plays",
        "\"I think you care for your dad so much you can't conceive a world where you'd let him get hurt\" this video game is full of one liners that hit you where the feels are. =(",
        "Oooooh",
        "you can haul the cargo with more than one train",
        "hey josh did you know that coffee stain added nukes to satisfactory",
        "How long does it take you to load into this.",
        "My first thought was \"How did he use trains??\" now I know.....",
        "Josh, you should try terraria there are lots of dumb things you can do in there!",
        "Josh boots up his computer.\nComputer: \"Oh no, NOT AGAIN!!!\"",
        "I love this.",
        "Ahh, yesssss, Spaghettiopolis grows!",
        "oh please lets game it out play cities skylines so many opportunities to mess with people :)",
        "finally another satisfactory video. I love these videos",
        "\"This is the farthest we've ever- never mind.\"\n\nShould be your channel's motto or something",
        "I’m so happy he’s back",
        "Josh should reck a city in city skylines",
        "I want him to play eat the rich ( dantdm played it)",
        "I logged 200hrs in this game and got a herniated disk from sitting in a chair because I don't play games. Anyways I blame you.",
        "damnm josh really sold that sponsor quite well, im already downloading!! ",
        "what's your setup?",
        "love your videos",
        "Lol \"Spoiler, we're going to make it worse\"  \nAlso, did anyone else catch Josh giving subtle shoutouts the youtubers doing reaction videos to his content?\nEdit: I had forgotten about the train shenanigans when I wrote this comment... ",
        "11:45 \"y am I like dis indeed\" had me done . Don't know how he's still able to add more and STILLL run the damn game ???",
        "when the music kicked in and mark was completely silent but clearly screaming on the inside I was crying of laughter",
        "I love this ",
        "I like how no matter what problem shows up, Josh somehow makes it worse. While setting everything on fire like a maniac",
        "Ha",
        "All I can think of is the Futurama news show \"Don't worry! I'm sending in more trains!\"",
        "nobody tell him about dyson sphere... program... ",
        "At least josh knows how to test his PC",
        "Gotta love Josh's enthusiasm to torture himself",
        "The theme of this video is Josh accidentally building the Snow Piercer on an alien world. ",
        "yes",
        "ISHOWHACKED, this stream changed my life. My entire view of everything that exist in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience. :-/ :-(",
        "Talking about destroying frame rate, too many billboards can cause serious lag \n\nIn addition, standing on a large truck’s wheels does unspeakable things. Me and a buddy got one stuck in the stratosphere for eternity, after which he bugged out and was invisible and his graphics turned the landscape into a really tall spiky forest",
        "you know it's going to be a good day when josh posts a satisfactory video.",
        "you've just made sonic frontiers in satisfactory. Amazing.",
        "There is a game called Prehistoic planet and it's kinda like Planet zoo but with dinosaurs",
        "Wouldn't it be awesome if graystillplays and josh do a video together!!  ",
        "Got cities skylines, got most of the dlc while i was at it too. Its actually pretty solid once you figure things out, lot of depth do it without being too complicated",
        "Thanks to the YouTube algorythm, I was able to save 70% of the game and that's only because your video made it there. Take my Sub, for as it is your reward from me",
        "14:09 \"why\"",
        "Satisfactory is the game series that made me your fan, but i really want to see your madness on cities skyline too.\nAlso loved the zoo and park simulators.\nWish i could delete it from my brain to watch it the first time again.",
        "Josh, you sadistic mother..........................YOU ARE DOING GOD'S WORK!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\n(I've not laughed like this in quite a long time....thank you kindly.......yes, I'm a terrible person....yes, I'm ok with that ;-) )",
        "I love how Josh could’ve easily gotten rid of all the freight cars and it probably would’ve started moving. But no this man went the insane route LOL",
        "Fun fact: At 17:29, the g-forces were around 7330",
        "you either do no videos each month or 2 videos each month why even do a 4 day timer that basically means almost noone will get the game free",
        "I've been dying for another video from this series, my stomach has been needing some definition, and the ab workout from this is exactly what was needed",
        "Astroneer's train track twist much better",
        "Now what is the best way to launch doggos?",
        "I do need to say this last update screwed my entire factory because my main storage center is now in a rock face",
        "God I wish there was a video of JUST the train journey in it's entirety",
        "Everytime the game gets updated the devs fear this channels next  upload.",
        "5:54 You can hear in his voice that he has clearly given up on life",
        "Astro colony. Let's game it outtttttt!!!",
        "yay more chaos :D",
        "In a year of chaos and despair, Jaiden has single handedly made the year the best one in a while",
        "there are nuclear bombs now so if you want to make the hug-master 3001... well have fun",
        "Holy shmoley its been month or 2 since last upload I bet this one is a doozy!",
        "Should we continue to push this man doing this of his time ?",
        "Play Jurassic World Evolution 2",
        "No man's sky has some interesting and funny glitches. The developers tend to prioritize content over bug fixing, so most free updates come with new glitches and funny content. For example, feeding a sentient humanoid character \"iced screams\" and being thrown by a tornado are part of the game intentionally. Not to mention base building, including glitch building.",
        "You sound a bit tired at the start\n\nyou need to stream more marbles",
        "Batman died on this day",
        "Congratulations speed you have worked hard for everything and have created something that no one can replicate!! Continue striving !",
        "Guess we know how three mile island came about.",
        "We need to see Josh create an absolute monstrosity of a city in Skylines",
        "big fan",
        "Despite everything he manages to destroy games in the minutes he plays them",
        "Welcome to Lets Game It Out where the points dont matter and every video melts a gpu lol",
        "So close to 15Mil Cory, so amazing watching you and your sub count grow through out the years. I think these constant uploads are everyone heres dream. Love it Cory keep it up and congrats",
        "What videogame you will play in next video?\nLike in some 1-2 months",
        "i pray for this man's PC every single day.",
        "I went out my way to steal data so that I can watch your content",
        "ㅋㅋㅋㅋ 준위드립 이해 못하고 준위 있다고 진지빨고 얘기하는거 겁나 웃기네 ㅋㅋㅋ 준위 있는거 누가 모름 ㅋㅋㅋㅋㅋㅋㅋ",
        "Part of me is impressed by the absolute dedication you have... the other is utterly petrified by your patience.",
        "I only need to do the final Space Elevator milestone and i'm done with this game. My main issue is powering my factory so i've finally set up nuclear power, mostly. All the things related to it are done off-site from my main base but i need to get some resources over to the nuclear area. I tried drones but feeding them batteries is a faff so i may try trains. Of course i could just use belts but that would look horrible.",
        "This and Smii7y are the funniest Youtubers out there Keep up the great work Josh!",
        "Make a giant ouroboros train that is basicallly a giant loop of freight wagons",
        "play no man's sky",
        "id like to see josh play subncatia theres alot of stuff in there that he could mess around with.",
        "The dedication to make something impossible into possible is really amazing...   Josh just build with different and unique mind",
        "Just why",
        "OMG, we get more?! Love you, Josh! This series never gets old!",
        "josh is the type of guy to commit war crimes for a country he's not even part of",
        "“Spoiler: We are going to make it worse” We know Josh and we love you for it.",
        "Josh's contents are non 144hz monitor friendly",
        "LoL",
        "Ahh, another Satusfactory video. I can hear ImKibitz's aneurism from here~\nKeep up the awesome work!!!!",
        "3:40 Minecraft Phantom",
        "Ah yes, as Twitter is imploding, we get to sit back and relax, enjoying the most Vanoss nostalgia weve seen in years >:-O",
        "Josh slowly losing his patience over his long-lost sanity is honestly a treat",
        "17:37 \n𝑩𝒐𝒐𝒑️",
        "Let’s game it out: back",
        "17:50 I don't know why but adding the train horn makes any train shenanigans 10x funnier.",
        "Josh PC POV.\n\nFans start to throttle",
        " Can you please bring back planet zoo to the channel and make 1 million giraffe hydras",
        "Thank you for your continued Greatness Vanoss, you make our lives much more enjoyable with your videos.",
        "This is madness.",
        "God these videos make my days weeks months years better there my favourite YouTube videos ever thanks",
        "The only thing josh has never played \"is there a limit?\" on is his patience and i love it",
        "you should play goat simulator 3",
        "Follow the 10 commandments Christian’s and ask for forgiveness!!",
        "pls play out of ore",
        "So this is why it took a month  Josh is too wild for this world",
        "Broo your sponsor is Soo helpfull now I can play cities skylines for free on steam and not on epig..thx a lot",
        "Josh needs to collab with JayzTwoCentz and light some 4090's on fire...",
        "It never ceases to amaze me that this dumpsterfire of a save still loads",
        "in the ad of cities skylines i think this guy is the guy who ohio the way it is",
        "Finally another one.",
        "It's always a good day when Josh upload a new masterpiece",
        "Finally, the next episode in continuation.",
        "I like how the game makes it literally so easy to move supplies from one point to the next, with multiple options from conveyor belts to automatic trucks to drones, and Josh still has to find a way to make it extremely difficult for everyone involved.",
        "Now i know what those time stamps between each 10 minutes are ",
        "I literally said \"Oh Josh, you're  a monster\" when you started pushing all the cargo off of the rails.",
        "It's been so long, now we can experience the madness again",
        "Great video..thought for the first half of video \"what if you combine jump pads and trains will they jump\" them u did it",
        "\"or as i like to pronounce it yami like this!\"had me on the floor.",
        "0:40 damn this looks like DNA",
        "Its been so long I never thought I see josh play this can't wait till he finds out about nukes",
        "ANXIETY",
        "ı think pc on fire",
        "Honey wake up Let's Game It Out made a new Satisfactory video",
        "Here’s a challenge: try to get through at least one of Josh’s videos without crying in pain",
        "Hey, play BTD6 day ( day 72)",
        "what you do to videogames has to be sacrilege to something somewhere",
        "Josh's mind is truly something else, every video turns into chaos given enough time",
        "\"Pharah hard counter junk hard\"\nAqamarine enter the chat",
        "FINALLY!!! OUR MACHINA LORD HAS RETURNED TO CREATE ARCHANGELS OF LAG AND GLORY!!!",
        "why would you hurt the little things that are those alien dogs",
        "No,.not now.josh",
        "Finally!!a content/steamer not trying to make the most perfect map!but something for the players like me ",
        "I wonder how much time he spend on this game",
        "This series is by far my favourite on the channel\nPlease don't stop playing Satisfactory!",
        "you should play the ads game, show us some mayhem there",
        "that chain explosion chef kiss",
        "The fact that josh didn't even use the nukes disappoints me",
        "I await the time he discovers nuke nobelisks",
        "I thought let's game it out and gray still plays where the same person untill I realized they have different names, I WASANT even paying attention, I don't even care I love them both",
        "My OCD anxiety watching this:",
        "You have to try it out",
        "This man is the only person that will be able to make laggy things funny",
        "i knew you had someone else build this give amir more credit for the 4 houurs it took him",
        "Actually you CAN automate the tractor jumppad route! But it needs to be a loop (so the return route must be done). Simply you must record a single succesful loop with the tractor. The good thing it need to be done only once and then it can be loaded. Don't know what it will do in practice but only one way to find out!",
        "I like how this ENTIRE video is just to get SOME materials on the other side of a hill for some reason. All that work to [somewhat] legitimately try to find an \"efficient\" solution, only to end up desperately physically push a box to where you want it to go. Amazing. ",
        "10:10 for most people, waste is the byproduct of product\n\nfor josh, product is the byproduct of waste",
        "Id love to see you ruin black and white 2.",
        "Please make a part 2 I love this",
        "Are you interested in a Space engineers series? Would seem fun",
        "Can you imagine this guy as a barista or something?\n\n\"OK sir here's your large late with extra whip. And by extra whip I mean an extra 9 cups worth with enough caramel drizzle to clog a sumo wrestlers arteries. Enjoy!\"",
        "7:30 Listening bored Josh is even more hillarious. I have no idea how does he do that.",
        "Hey dying light two is out why not play it?",
        "Josh was the first creator I actually watched, without skipping, the play troughs. He made me buy Satisfactory and no regrets wathsoever, although I'm more of the \"trying to make it cute\" builder. But none the less, this merchan worked and I'm sure not just for me. ",
        "when i tell my friends about you\n they say who is he?  \nand i say: you dont wanna know...",
        "He always makes me smile :)",
        "Give us a new raft video now",
        "Something I noticed when playing is that, even if the truck's path goes wrong at some point and it falls of or something like that, if you take distance and after a while look the truck again it managed to magically get back in action somehow, so Josh's first automation plan with trucks might had actually worked",
        "im only saying this because i know you wont but i DARE you to orginize EVERYTHING in that world.",
        "it’s always a good time when josh uploads",
        "I think Josh is a play tester that makes more money from YouTube. Think about it, he pushes games to their absolute limits and then puts it on YouTube. It's Just good business",
        "I love how he actually advances in the game while traumatizing the developers ...",
        "Idk why, but I can't get enough of this game, maybe it's just cuz of the way Josh plays it.",
        "Lol he made snowpiercer",
        "Just imagine you prank your friend just by using a head mob and a note block",
        "Is it just me or does he kinda sound like graystillplays ️️",
        "The idea of Nihilego being a Headcrab is terrifying, yet accurate to the lore.",
        "I enjoy all of your content. You have the ultimate contagious laugh. The quality of your dialogue is superb. Not only do you have a way with words, but your delivery is hilarious. Keep it up, and thank you for being a light in a world that needs it.",
        "Best fitting cooperation I's on whole YouTube lately",
        "My guy I just bought cities skylines ",
        "He is back.",
        "\"There's always room to improve.\" -Josh️",
        "I appreciate the sheer amount of time this video must have taken to make.",
        "You said its free to try nov 10-14 its the 12th but it says it cost 8.99",
        "This is just peak capitalism",
        "I don't think that there has ever been a YouTube channel that I love SO MUCH that literally makes me say \"Oh no, what has he done now\" every time I see a new video",
        "I think I know how to describe this. It's inefficiently efficient",
        "i swear josh makes the best vids well done :)",
        "Do more video",
        "Hey let’s game is out could you play there is no game : wrong dimension",
        "He always comes back at the right time, kind of suspicious",
        "I live for your humor. \nI wait for your next video......",
        "Could you imagine what if this was real and the CEO drops down and says WTH is this!?",
        "I literally missed the city skyline deadline by 45 minutes, witch is when I watched this",
        "we appreciate you man. I know it takes hours of effort, and we love the result. the save file for this game must be getting insane.",
        "That's not a tractor...",
        "I would pay to see you break VR games.",
        "so i just checked and throughout ALL the games you have NEVER played teardown",
        "I think you should do a Collab with graystillplays! He goes to an unrealistic level in games just like you!  I think you guys would make good friends because I love both of you guys!",
        "WHere da nukes",
        "Your train tunnel somehow reminds me of the Panama Canal.",
        "Josh: “Oh wait, we can!”\n\nUh oh.",
        "It's honestly impressive his save file even loads up at this point.",
        "I think Josh playing this game is the antagonist in Avatar sequels. At least I wish he was.",
        "oh my God, his voice before and after the jump pads he sounds so dead inside",
        "I wonder what Josh's train of thought was as he created this.",
        "YESSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSS",
        "16:57 I didn't know I was watching Josh play planet coaster",
        "I voted for you first round....but I'm not sure about winning swc =3:)",
        "The four horsemen of \"Uh oh\"\n\n\"Let me give you the grand tour\"",
        "You should play city skylines I want to see how bad and laggy you can make it",
        "One of the best videos you've ever created. Thank you Josh.",
        "The rails remind me of a level in Rachet & Clank: Rift Apart where you slide on some rails in a canyon",
        "I love broken games",
        "poor lizzard dogoos... :(",
        "There are nuclear bombs, hope thats handy",
        "Hey Josh there's nukes",
        "Rent plz it is torcher to pepol",
        "I like this game\nWho likes this game like this comment",
        "The track is kind of cool, might as well  make one misled ;)",
        "You should play some free games. I just don't really have to much money and I want to find some good games to play. Cause sometimes random Steam games have problems.",
        "try linking a train to another train the give your transporting service more speed",
        "It genuinely alarms me that this factory of all factories needs to find ways to waste electricity.",
        "Would love to watch some roller coaster tycoon with openrct2",
        "A million views a day",
        "How is your game not crashing or atleast constant on 5fps looking  like its about to  crash xD",
        "I've been sad this past year especially losing both my grandparents, Josh has been my outlet where I can take a break and have a laugh. Thanks Josh and please keep it up you demon",
        "I really hope she blesses us with another video this month like last month",
        "After every skip he sounds more and more dead inside and it kills me every time ",
        "Train no roller coaster",
        "LETSSS GOOO NEWVIDDD",
        "Congratulations,    for getting this video to the top 10 trending! ",
        "I am surprised you haven't found the nukes yet....",
        "My favorite part about these videos is how he sounds increasingly dead inside as the video progresses, and that by the end he sounds like the 13 year old girl who has been listening to billie eilish for a month and thus acts depressed.",
        "make more videos!!! your videos always make my day ive watched every video 5x thank you for making such enjoyable content!!!!",
        "Josh goat simulator 3 is out what are you waiting for",
        "lol",
        "Conspiracy theory: Josh and GrayStillPlays swap ideas for videos",
        "If josh is a god, we are just mere puppets / test subjects.. ",
        "U must really try game out Minecraft",
        "God the factory is so laggy but cool video lets game it out keep your chaos continue",
        "I would be content watching an entire season of all the Hermits just making an entire tower.",
        "If josh was a song he would be crazy=genius",
        "Pls make a vid on destroying Jurassic world (more like Jurassic hell)"
    ],
    "comments_disabled": false
}