{
    "video_id": "Y9A4Zm2MY8U",
    "comments": [
        "Get well soon Jay, we love you! From Maine.",
        "",
        "Only “know” Jay through his videos and tv, but I am impressed by the outpouring of love and concern for the man.  Not one negative comment!  Take care Jay, get well soon and we all are pulling for you and your crew!",
        "I've had lit gasoline in the face, took awhile but 100% recovery (30 years ago), positive vibes sent, take care Mr. Leno",
        "Hang in there Jay.",
        "Wow, never knew",
        "I'm very happy to hear he is going to recover.",
        "Praying for you Jay. I know I'm one of countless others.",
        "Thanks for the update on Jay's condition. Like thousands of other people, I wish him a speedy recovery. I have been lucky enough to meet him a few times.  He is the most likeable and sincere celebrity that I have ever met. Get well soon, Jay!",
        "Thanks, George, for the update and for being a good friend to Jay.  Jay is very respected, probably more so than the vast majority of Hollywood stars.  He's humble, kind and very good-natured.  Prayers for a fast recovery and healing.",
        "Get well soon Jay, we are all wishing you well. Thank God you will soon be back and about, best wishes.",
        "Hope he recovers well, thanks George for the update",
        "Praying for Jay Leno’s full recovery. God bless you Jay",
        "Get well Jay",
        "Who cares!",
        "Wishing Jay a speedy recovery. We car guys hang tough.",
        "Any kind of burn is very painful we all know get well soon Jay . We love you.",
        "Speedy recovery Jay!!",
        "Why couldn’t this happened to biden",
        "George is Jay's lead shop mechanic and the second in charge of the entire shop.",
        "what kind of car are you driving?",
        "If you watched Jay’s Garage, you know George. Glad he will be okay. Get well soon, Jay.",
        "Poor Jay.",
        "Get well, Jay... Thoughts and Prayers...",
        "Good to hear he's doing better.",
        "Anyone saying \"Thoughts and Prayers\"  please look up Anthony Jesslenik",
        "I hope he comes back and do the cars get well Jay Leno!!!",
        "Jay always said, that steam guys dont have eye brows:)\nHope its just the eye brows though..",
        "Uh oh one of the Steamers",
        "Get well soon Jay!",
        "\"How's his ear ? \" , \" well,  his glasses might be wonky from now on \"  ",
        "Hope for the best for Jay.",
        "I hope this doesn't put him off working on and driving his own collection of cars.\n\nWhen you think Jay Leno, you think CARS (at least I do)",
        "Everyone should know George!",
        "My thoughts are with the Lenos.",
        "Get well Jay, we need you",
        "Hoping for a full recovery",
        "In our Prayers Jay .",
        "I'm glad nothing happen to Jay. Thank God he's tough, get well love.",
        "God bless you Jay",
        "I got burnt to hang in there they can do amazing things now (ps love your show) ",
        "You want to make Jay Leno feel great, you tell him that he's as tough as those old Formula One drivers from the 70s, like Niki Lauda who drove for Ferrari..... that seriously would boost that man's spirit",
        "Leave it to the media trying to twist it turn it anyway they can",
        "Burns are the worst.  I hope Jay is doing okay.",
        "God give this great man relief and healing.",
        "here's to a swift recovery, take care Jay",
        "Guess Jay Leno got carried away..!? Thinking he knows all about cars!?next time...he should leave it to a professional!",
        "Fans know of the car in question. GWS Jay.",
        "Prayers are with you as you recover.",
        "Get well soon Jay, thinking of you and sending you all the best.",
        "Thank you George for the update on Jay. The Car world cares about him very, very much.",
        "Love Jay ,  I hope he is home soon .  Best wishes from Massachusetts.",
        "God be with you Jay. Praying for a speedy recovery",
        "Told my mom wen she called to tell me, it was probably one of his steam cars.  So so thankful he’s going to be ok!!",
        "thanks George for the update , millions are pulling for you Jay ,we know you,ll hurry up and heal ,see you on the road. God bless you.",
        "Thanks for the info, we'll be praying for your full recovery Jay! \n  Ciao Ciao",
        "You don’t play around with gas ",
        "Wow first time hearing if this .... Prayers to jay for a speedy recovery\n\nEvery car guy needs Jay weather they know it or not",
        "Is he a Targeted Individual they do burn you with directed energy weapons",
        "Prayers for your complete recovery, Jay. May God bless you and continue with you all of your days.",
        "Thinking about you often jay, this too shall pass. Much love.",
        "Horrible you get well jay",
        "Give yourself time. Rest Jay. I'm praying for you to be well. God Bless you.",
        "Prayers for you! Jay!",
        "My prayers are with Jay.",
        "Stay strong, Jay. ",
        "Thoughts and prayers for you and your family, Jay!  Hang in there buddy.",
        "Jay Leno an auto legand an ANYBODY who likes old cars/trucks has nothing but respect for jay an we all hope for a speedy recovery",
        "best wishes from Chicago, Jay. \n\nsend him all the Mr Beef on Orleans.",
        "Best wishes and get well soon Jay.",
        "Good ole George — I like him. Seems like a nice guy to have for a friend. Best wishes to Jay. ",
        "EVERYONE'S body language is telling.... they can't hide it.",
        "Jay wishing you the best",
        "Oooo I hope the worst",
        "Prayers for Jay..... the Ultimate Car Guy.",
        "How long you worked for jay? Not much longer after talking to random media",
        "Ozric Tentacles",
        "Asked the Lord to heal you Jay.",
        "Would not wish those on anyone….. that’s a lie, Trump!!!",
        "Jay is likely worried it will take longer to fix the car",
        "I put a lighter near a car battery \nONCE.  ️",
        "Love to Jay from USAF veteran.  Get well soon.",
        "Thank You George.....Wishing you a painless recovery Jay ..",
        "I had a truck 8D battery blow up in my face. Still have the scar on my nose.",
        "side burns?",
        "Prayers.",
        "Hopeing Jay has a speedy recovery, God Bless him.",
        "Please tell Jay that his fans & car family is praying for him.",
        "I wish jay well. Very scary situation.",
        "How badass is that he was on fire but he still was able to use the phone call his friend George and wait for the fire department Jay Leno is the s*** man",
        "Thank you George .",
        "Too nosy, Sport.",
        "What a typical news vulture.",
        "Glad he's recovering",
        "Thank you.  Didn’t know that this happened, but glad to hear that he’ll be okay.",
        "That’s good news that he will recover and he’s at a burn unit! Prayers for Jay ",
        "Get well soon, Jay. Greetings and Regards from Sweden!!",
        "Get well jay number 1 fan",
        "Poor guy! 1st Anne Heche, now this?! Damn! ",
        "Jay you have no idea just how many people in this country love you man !   Get well soon !!!",
        "Get well Jay . Prayers for a complete and speedy recovery.",
        "Hope for a speedy recovery Jay. ",
        "George, thanks so much for the update on Jay.  I'm so glad he's going to be okay.  He's a good guy and was one of my favorite late night hosts.  Get well soon, Jay!",
        "Hey who is Jay Leno drunk like the rest of Hollywood?",
        "Jay's been a comedian for years, he can handle a burn or roasting no sweat!",
        "How wonderful of George to give us information we all wanted Jay is a friend I've never met I think the world of them and I hope for the best for him he's a tough guy he'll be fine",
        "Jay is one of the Hollywood \"good guys\". Treats others as equals.",
        "The GOOD news is he STILL has 179 cars that are working!!!",
        "OMG I didn't know about this. Godspeed recovery. It doesn't sound too bad but stuff happens we had the same thing happen at our shop luckily everyone's fine now",
        "All the TDS finally caught up to him via Karma ️",
        "Feel better jay from Philly",
        "Prayers for this down to earth man.",
        "All my best to you Mr Leno,Get well soon.",
        "Praying for Jay ️",
        "Oh gosh, I wish a very speedy recovery Jay.  You are the best, love you",
        "Get well  Mr Jay...glad you're okay and healing. From a real fan.",
        "get well soon,Jay!",
        "Them old turn of the century cars are death traps ... glad Jay and the garage is gonna be OK ... also hope he's at cedars Sinai ... best burn center in the world ...",
        "Hate to hear this.  I love Jay Leno.  Such a great guy.  The last good talk show host too.",
        "I always felt like I knew him..even though we never met. So, it seems like this happened to a friend. I hope he recovers completely and quickly.",
        "Batteries blow up and can cause facial burns.",
        "I pray that Jay Leno gets well real soon.",
        "I feel it for Jay. Hopefully he makes best possible recovery. Tough injury but the way he handled it is classic.",
        "Get well Jay!",
        "He's only rich because Johnny Carson handed the tonight show over to him. Otherwise he would be as poor as everyone else.",
        "Prayers for Jay. I am a big fan.. love this dude... I know he is going to be ok. ️",
        "On the plus side..he never had to depend on  good looks.",
        "God bless you speedy recovery Jay!!",
        "I hope that he is not in a lot of pain",
        "Jay is about to give George a talking to for talking too much glad to hear Jay is ok",
        "You hang tough, Jay.\nAll the people around you got your back.\nTake your time, heal; and get back to us when you can.\nI'm just glad that you are getting better.",
        "Praying for a full recovery Jay.!! ",
        "Jays right hand man is seeing to him all is good soon enough.  Get well soon jay",
        "Let me guess he put his head over the carburetor and some idiot started it you ever heard of backfire out a carburetor",
        "Love and Prayers ",
        "omg these reporters are annoying",
        "Jay rules. Good luck man!",
        "Very glad he is going to be okay. Get well Jay!",
        "Your a good soul, Get well Jay your in my prayers.",
        "Best wishes and get well",
        "maybe some one else can take over the show till hes better i love the show hate to miss it get well soon jay",
        "Prayers to Jay..",
        "Can we all take time to notice how this employee looks like Jeremy Clarkson",
        "Leno is a guy that gets ultimate respect.",
        "Mr. Leno get well soon ! So sorry for your accident an injury . Gods speed with your recovery !",
        "Why didn’t Jay wear a face shied? Safety first.",
        "Get well soon, Jay Leno God bless you",
        "Prayers for him",
        "Hang in there Jay. You can turn this into comedy gold. ",
        "Jay we all love you...I watched every episode on the Tonight Show then the Jay Leno Show and Jay Leno's Garage along with his newest show copied after the old Groucho Marx show. Jay I am about your age, perhaps a bit older and have loved your comedy since you took over the Tonight Show.  Please get well...Tony Boos",
        "Jay is a tough guy, he will be back with a story and a battle scar or two.",
        "Sending love and best wishes for a speedy recovery",
        "Grossmens will fix him up",
        "Thank you George for the update. Really happy that Jay will be fine. Prayers  for Jay to keep getting better .",
        "Jay.",
        "I had a radiator blow up on my face so I know the horrible pain and I know he will get through this, God bless Jay",
        "Whew--Get Well Jay.",
        "Thanks for the update.\nYou know, when Jonny retired, I was skeptical. Turned out to be just as good. Even after NBC let him go.\nHe's more enjoyable  in his own garage than any NBC studio set. Lol.\nGet well soon Jay.",
        "Burned by a Stanley steamer?",
        "i wish Jay a speedy recovery. Thanks George for the update.",
        "Prayers for Jay!",
        "Get better soon Jay !",
        "Why ask 1 question when you can ask the same/similar question a 1K times.",
        "Prayers going out to Jay.",
        "Well, we all know his CHIN made it through.   ",
        "Love Jay\nGet better my friend",
        "Thank god ",
        "Leno got some of is own jokes on his skin...",
        "I'm confused,  how does steam ignite like Gasoline..",
        "Get well soon, Mr Leno. I wish you a speedy recovery.",
        "I'm truly sorry that something this personal is so public. I'm also sorry George got put on the spot like that, it was incredibly insensitive and rude.",
        "I knew he was lighting off a steam car when this happened.  He warns about it every steam car video.",
        "Jay Leno is one of the good ones. Get Well Soon.",
        "I was thinking it was a steam car, speedy recovery to Jay.",
        "The nicest man associated with automobiles and motorcycles.  He has stopped numerous times on the side of the road to assist friends of mine when they broke down.  He has been great to my Sons over the years when we would visit him at the garages and the Rock Store.  They don't come any better.",
        "Just don't blame Conan",
        "You are in our heart & prayers",
        "Great news !",
        "Omg Mr. Leno I'm so sorry.  I hope you have a speedy recovery.",
        "It’s good that he’s gonna make a recovery. Best of wishes to him. He’s a strong dude for not even losing consciousness in that incident",
        "Thanks George and wishing Jay a full and speedy recovery.",
        "Bring back Leno and Conan! \nCurrent “Late Nate” is killing comedy!",
        "When I heard about it I was like omg I bet it was a steam engine",
        "god speed Jay, and be more careful!",
        "Get Well ️‍ Brother Jay Leno…!!!",
        "Hey George why are you talking to the press..?",
        "Get well soon jay. Were praying  for you . Amen ",
        "I don't know about you but money fame and fortune can't replace your life, come on guys use a mechanic",
        "Aww man, not Jay, if you love cars, you by default love Jay..speedy recovery Mr Leno.",
        "Be STRONG Jay we are praying for you!!!️",
        "Friend in car looks like Drew Peterson!  Get well soon Jay.",
        "Our prayers are with you Jay. Hope you recover quickly !",
        "Will be praying for you daily Jay. Lighting your face on fire for new material is pretty intense....I guess your next comedy routine is going to be....fire....",
        "Jay's a beloved guy and personality. Sending well wishes to him, family and friends.",
        "Thanks for the update, Get well Jay we are all praying for you!!!!!!",
        "Stay strong guys! I’m glad he will be OK. You all do an important job",
        "Get well Jay , we all send you our love ! Thanks George for your update.",
        "Jay a strong person and I know he will be ok.\nThank god !",
        "God please help jay hope he is doing well",
        "Very well stated didn't tell too much but let us know what need to be known to hush any rumor mills",
        "Oh man, I love Jay and his garage show! Get better soon, Jay!",
        "Omg I am shocked to hear this! I hope he recovers well.",
        "Jay Leno is who you would want for a friend and neighbor.",
        "Face burns are the WORST. I had one a while ago. Superheated liquid is real.  My sympathies.",
        "I guessed it was either the White or the Stanley steamer.  He made a film a few years back of how hard they were to get going, including a flash fire lighting the pilot flame that engulfed his hand.",
        "I was heart broken  to hear this happen to Mr. Leno. I pray he makes a full recovery.",
        "Hey Jay.  Do you need me to smuggle a Whopper and a Chocolate shake in there?  Hospitol food sucks!  Get well soon.",
        "When an old boiler hits you in the face, you know about it...a few of us have experienced that ",
        "prayers for Mr. Jay Leno hope for speedy recovery",
        "Who cares",
        "He is a tough guy!",
        "So glad to here your doing ok Jay,  get well soon !   Thanks for letting us know George !!",
        "Prayers and best wishes for a speedy recovery.  ",
        "Hope and pray that Jay heals well and quickly.  He's a truly great guy!",
        "He burned doing what he loved ",
        "I hope a fast recovery for Jay.",
        "Repent to Jesus Christ “Nations will come to your light, and kings to the brightness of your dawn.”\n‭‭Isaiah‬ ‭60‬:‭3‬ ‭NIV‬‬\nY",
        "Jay's an awesome person, hope he gets well soon! Such a terrible thing to have happen to him...",
        "Our prayers are with Jay from all.",
        "I like George \nGlad Jay is going to be ok. But.\nBurns on the face?\nYIKES! ",
        "Jay!! Your moma told you not to play with fire!! Yah,, I've been severely burned,,hurts way more than broken bones or bad cuts!! Heal well!!",
        "Iron Jay..",
        "They arent saying much of anything!",
        "Leno, wishing you all the best and a speedy recovery. \n\n P.S Love watching Leno' Garage.",
        "get well soon   JAY",
        "To my favorite car and motorcycle enthusiast. Get Better Jay!",
        "Hanks George….I figured Jay will be alright. He’s tough and used to busted knuckles and stuff. Burns are painful, I’ve had some good ones. Do what the doctors tell you!!!!\nPrayers to you Jay, looking forward to your next video.",
        "Prayers for you Jay!\nStay strong and get well soon!!",
        "Oh.....good recovery Jay!",
        "I Pray Jay Leno you will be ok and back in your garage and on the show, Take care of yourself at the hospital.  We will pray for a swift recovery for you.",
        "Damm jays not paying his guys enough. He's out driving rare gas powered steam cars and his people of 10 years rolling around a mid 00s Nissan",
        "Get well Jay ...",
        "Hope all is well with Jay. Such a great auto expert… hmmm can’t help but ask if he’ll switch his collection to electric in light of the nature of this accident? Just kidding …. Good luck jay!!",
        "I had a radiator spew on me once, but I was quick and dodged it. It was like a bad sunburn . . . Hope Jay is OKAY.",
        "He's greedy all of those cars you can only drive one who in the he'll needs over hundred cars come on now that's greed",
        "Wow. I feel awful for Jay. From what I’ve read, he seems to be in good humour and should be back in a week or two. Burns are typically the most painful thing a person can go through and I’m sure it would be particularly bad when the burn is to the face.",
        "As a car guy this makes me really happy to hear he is ok . He is a automotive icon for me",
        "Thank you George and AH for sharing about Jay Leno. Love and prayers to him during his recovery.",
        "Thank you for the update George. We love you Jay, get well soon",
        "Wishing you a full and speedy recovery Jay.",
        "I can just imagine having gas sprayed on your face, be painful and scary as hell! Thanks to George for letting it out. All the best to Jay.",
        "We love you Jay! Get well soon! Thoughts and Prayers for you and family",
        "He's gonna be ok",
        "We motorheads love you; Jay. God speed to a quick recovery.",
        "God bless you Jay... Speedy Recovery!",
        "Prayers for his healing, sorry to hear this",
        "Love Jay Leno . Honest and has kept us laughing for years .  Love you Jay .",
        "cool guy stopping to answer a frenzy of questions",
        "Jay should not be playing\" with fire\" he's no certified mecanic and  should let his professional team do these dangerous repairs on old cars !!  Hope he  gets better and we love him!!",
        "Prayers and blessings go out to Jay Leno and his chin.",
        "those steam cars ive watched him fire up always looked dangerous wonder how many fires were started back in the day",
        "Surprised he gave out that much info, because that's not usually the case in instances similar to that. What I got out of it, is that \"not life threatening\" means he's burned pretty bad. SUCKS !",
        "He should come back and replace terrible biased Fallon who turns out, ISN'T FUNNY.",
        "What ?when! Is he okay? Prayers to, for Jay!!!!!",
        "Thank you for the update, I'm praying for Jay.",
        "All my prayers for Mr. Leno. Here's to a speedy recovery.",
        "Fast Recovery Jay God Speed !",
        "Prayers for healing. God bless him. Speedy recovery.",
        "Jay the Great, hang in there.",
        "I had a hot radiator blowup in my face many years ago. Fortunately I was wearing face shield  and wasn't injured. It still scared the he'll out if me!!! Sure hope his injuries aren't to serious!!! Cheering for you to make a full recovery!!!",
        "Jay Leno's the man pray for speedy recovery",
        "Hope he makes some jokes about himself when he gets better.....like richard pryor did",
        "Good on you George - and Access - for giving us this info. We care about Jay very, very much.",
        "Get well Jay!\nWe're for a speedy recovery!\nGOD BLESS YOU!",
        "Thanks George.",
        "The last one i can proudly say \"don't judge a book by its cover\"",
        "Praying  for a quick recovery.\nWe still need people like him to make us laugh in this cruel world.",
        "Hope Jay will be alright, love this guy. Best wishes and fast recovery!",
        "Was he driving with Anne Heche? Too soon?",
        "I'm really sorry to hear this. Jay Leno is a very nice guy. My wife and I met him at a gas station and he's just as personable in real life as on television, even to complete strangers. Recover quickly, Mr. Leno!",
        "If J needed skin he could have some of mine ..it will be a darker patch.. puerto rican color.",
        "Jesus a steam car... That sounds awful",
        "I'm sorry to hear this Jay",
        "Hope Jay is going to be fine.He's a nice man who people love and I have always enjoyed his humor and I love his car show.",
        "praying for Jay...Hope he does well.. thanks for George. Sorry this kind of thing could happen to such a nice guy. #PrayersforJay",
        "It’s payback for burning Conan , out of \ngetting The Tonight Show!!!",
        "All the best Jay. Get well soon",
        "I hear electric Spark",
        "When I first heard this I figured it was a damn steam car. Hope he recovers well.",
        "Thank you George. You know we love Jay and are worried for him. God Bless ️",
        "I hope both his wife and Jay will be back to good health ",
        "Shouldny left stuff in there becateful jay",
        " for Jay",
        "Is George driving an Infinity G convertible with a Nissan steering wheel?!",
        "I  love you Jay, praying for a quick recovery .",
        "George, thank you for the update. Jay, take your time and recover. Don't worry, we will be here waiting for you. With all that has happened to you, there must be a joke in there somewhere. Anyhow, get better. From The Frozen North.",
        "Thanks George. Hoping Jay gets well soon.",
        "Get well soon Jay, hope you are doing well, we are thinking of you.",
        "Bless Jay I wish him the  best, he is my hero.",
        "Get well soon Jay. ",
        "Payback for Conan",
        "I worked on steam cars back in the 90's and they are very dangerous, good luck Jay",
        "Thank God Jay is doing well….🇨🇦🇨🇦️",
        "Thank you for breaking it down!!With everything going on right now, the best decision to be on any creative man's heart is having a profitable investment strategy",
        "Jay! Take care! Cant loose the self proclaimed, President of the more money than brains club!!!",
        "Letterman sent Jay 5 gallons of gas and a card saying- \" Hope you get back to your garage soon\"",
        "Sending good vibes",
        "Get well Jay and praying for you. ",
        "Just get better Jay!",
        "I hope best wishes to kuik can back to dear friend leno",
        "Good luck Jay 🇨🇦🇺🇸",
        "I remember watching the Tonight\nshow years ago and I looked behind\nme and my sister flashed me from\nthe couch like WTF man.",
        "Love Jay's Garage videos and his sense of humor. He's a true car guy. So...after seeing he would be OK, my first question was what car was he working on. Does that make me a bad person :) ? George cleared that up. Good example of why we drive IC instead of steam cars. Heal fast, Jay. You are one of the few celebrities I would actually like to meet.",
        "How dare you ppl push and pry like that. Reporters are so disgusting, let the man recover for and speak for himself for christ sake. This clip sickens me. You ppl should be ashamed.",
        "Praying for a speedy recovery for Jay, Thank You Lord for sparing his life now we ask You to give him miraculous recovery with little to no scarring from the burns in Jesus Name, Amen",
        "That was actually rather good reporting by the reporter.  Rarely hear that type of effective Q&A by reporters anymore.",
        "Damn, thats hardcore. Get well soon Jay.",
        "Jeez I just heard. Get well soon Jay.",
        "little prayer coming your way , kick ass Jay",
        "Thank you George for the update. My prayers go out to him and his wife. I'm sure he'll be well taken care of and look forward to seeing him soon. God Bless  ",
        "Oh gosh, hadn't heard. Get well soon Jay.",
        "Get well soon, Jay.",
        "be well jay prayers 4 u\n\nmy niece  is best  friends with his niece  and school mates here in Westchester  county ny ",
        "I’m glad J is Ok!",
        "Was the car ok?",
        "Thank much George for giving us an update. Get well Jay!",
        "Steam burns are Horribly painful.  Get well soon.",
        "Wish Mr. Leno the best. Full and speedy recovery. He is such a nice gentleman.",
        "Feel better Jay. You are one of the good guys. ⚘️⚘️",
        "BUT HOW IS THE CAR!",
        "Yeah, we all know George.  Thanks for the update, George.  My best to Jay.",
        "My best to Jay. Glad he'll be OK. He'll still be my prayers for recovery. ",
        "Who doesn't know George ?",
        "More prayers  coming from Canada,  for Jay’s rapid recovery. Thank you George for the information.",
        "Superheated steam (water vapor) can ignite paper. There are videos here on youtube showing this. Quick recovery to Jay Leno.",
        "Luv ya Jay since you hosted The Tonight  Show after Johnny Carson. We loved your monologues.  Get well soon. You are in our thoughts and prayers.",
        "For Sale; Stanley Steamer low mileage, call and ask for Jay.",
        "Prayers to you Jay . I hope you recover quickly .",
        "Be well Jay we love ya",
        "Wait till Mavis finds out he's smoking again in the garage. Those eyebrows will grow back fast at his age, but that denim really burns. Hope for a quick recovery.",
        "Jay is such a good human being..  being the comedian he is I'm guessing he'll be making some Richard Pryor type joke about this unfortunate incident.",
        "Get well soon ",
        "Thank you George for the update! I know this is a hard time. And we want to give Jay his privacy. We care a lot about him!",
        "Glad Jay's gonna be okay.",
        "Unlike many Hollywood stars Jay Leno is the most down to earth person you will ever meet. I've been lucky enough to speak with him on a number of occasions & came away with a great feeling for the man. Speedy recovery Jay!",
        "Damn i hate what happened.  Wish and hope the best",
        "Hope and pray that Jay heals well and quickly. He's a truly great guy!",
        "sorry jay get better",
        "God speed in healing Jay ️",
        "I thought it was a steam vehicle. Get well Jay ",
        "Listen I've always thought Jay was an absolute tremendous guy I even started like the guy more when I found out you know he was in the cars he's one of the best people and I'm a major car guy myself God bless Jalen on that I'm praying for you",
        "Definitely need to see a side mission episode, could connect a lot of dots and just make the story better as a whole",
        "Sorry that Jay got hurt. Get better soon man.",
        "Prayers for Jay Leno's speedy recovery. Thanks for the update George.",
        "Speedy recovery Jay! We love you and wish for speedy recovery.",
        "Get better Jay!",
        "Jay always commented in his videos on the dangers of steam cars because of the process of lighting the boiler to heat the water. Speedy recovery Jay and thanks for the joy that you have given car people with Jay Leno's Garage",
        "So sorry to hear that ....wishing Jay a speedy recovery.",
        "Oh shit ... best wishes jay!",
        "Prayers for Jay",
        "Best wishes for a speedy and full recovery!",
        "Get well Mr. Leno. See you soon Sir.",
        "Jay got burned?\nhope he's okay.",
        "Such a sad thing to happen to anybody but I am so happy to hear it isn't life threatening. Burns are no joke so I'm sure he will have quite the recovery ahead of him :(",
        "Best wishest to a great man Jay Leno is!",
        "Respect George kept it basic and informed us with enough.kudos George",
        "Being a car guy myself I think it's an insult to Jay to not ask if any cars got seriously hurt.",
        "Thoughts and prayers Jay!",
        "This is someone who does more good for more people than we'll ever know. Be well, Jay! (We can stand a few JLG re-runs on youtube!)",
        "Heal quickly Jay.  You are loved by MILLIONS.",
        "What about his hair !",
        "My Dad met Jay a few times when my dad worked in catering parties and events. Said he was a good guy.",
        "Jay gets hurt (unfortunately) doing what he loves and at the same time as always teaching us about the dangers of a steam engines...  a true legend ",
        "Prayer out for Jay for a fast recovery.  \n\nA while back I watched him on an episode lighting one of these steam cars and a blow back of flame. They are great cars, but are extremely temperamental. Jay is an expert with steam cars, but anything can happen. Again thoughts and prayers for Jay.",
        "Omg  so sad  prayers   my buddy  Jay on a full recovery",
        "As a former mechanic, get well Jay. Had a radiator burn one time from hot water. Get well soon",
        "jay leno is the nicest guy, hope for speedy recovery",
        "Failed blood sacrifice from hollyweird",
        "Love Jay Leno's garage get better Mr Leno",
        "Thank you George! I know it was difficult to do this interview. We ALL love Jay and will be praying for him as well as for you. I'm guessing it was the Stanley. He joked about the dangers of running that car as a potential scalded or burned trying to light it.",
        "I hope you are ok. Have great day.",
        "We wish Jay a speedy recovery!",
        "Oh man , get well soon. I really enjoy Jay. The first time I saw him on tv was in an episode of \"GoodTimes\" and now I am watching him on the reruns of \" Last man standing\".  God bless you and everyone attached to you.",
        "I don’t care when rich people get hurt He can afford the hospital bills so who cares!",
        "May God heal Jays' burns and rebuild his spirit during this painful time.   Please give him strength to recover quickly.",
        "Hope he gets beter",
        "God speed Jay  ",
        "Best wishes to you, Jay Leno.",
        "Thank you, George, for letting us know how Jay is doing and how it happened.\nHe is lucky to have you working with him.",
        "IN MY VIEW \nThis is refreshing hearing the truth about a story straight from the source. No lies. No hype. No sensationalism. Pleasant reporter.",
        "Speedy recovery ",
        "I absoolutely love Jay Leno, he is a good man, prayers for your swift recovery.",
        "So glad he's gonna be okay! We all love you JAY !!",
        "Burns are the worst and extremely painful. Fire is the number one fear among race car drivers and pilots alike.\n\n I wish you a speedy recovery because we all need you, Jay. Take your time healing because we're not going anywhere.  G.",
        "I love how she gets inspired by movies, anime, and all types of popular tv shows to just keep us entertained. We love you Jess",
        "man hope he dint jynx himself that one video he mentioned he hadn't been seriously hurt in all his years.. heal quickly son, get back in the saddle soon as possible we dont mind bandages, we all been there..",
        "Best Wishes For Jay     ",
        "Godspeed for your journey to a full recovery Mr. Leno.",
        "How in the world could they decide which car to drive him to the hospital in?",
        "Thank God . Jays an incredible person and my mom met him when he did stand up and he bought an Indian motorcycle from a neighbor of ours in Illinois. I wish his recovery is fast and that he will be happy as well as healthy",
        "Sorry to hear  Lucky he doesn’t have to rely on his tonight show for an income as obviously he’s face will be disfigured and may need plastic surgery , I wish him well ️",
        "Get well Jay, we love you.",
        "To one turbine car lover to another, so happy you're going to be okay. I know it's super painful, but don't let them get you hooked on morphine or any thing else. After getting shot I made them take me off morphine after one day. Just too over counter stuff. Good luck Jay we think a lot of you.",
        "That doesnt sound good :( I was burned in a workplace fire a year and a half ago, the fire started in a dust colector and was about the size of a small fireplace fire when I went with an extinguisher to try and out it out, even 10 feet away I got 2nd degree burns on my arms and scalp- my hair sort of melted. I wound up getting skin grafts on one arm- the one closer to the heat holding the extinguisher. The radiant heat did that kind of damage in seconds, getting sprayed with gasoline and ignited is going to be as bad if not worse.",
        "Prayers for a quick recovery Jay",
        "Rough day look in the eyes.",
        "Best wishes Jay. Get well.",
        "Thanks George for being up front and letting us know how he is.  Cheers 🇨🇦",
        "Praying for you Jay!",
        "Get well soon Jay,  we love you brother. Just rub some dirt on it and get back to work old man, lol.\nSeriously though, take your time and get healthy again,  hope to see you back in the garage when you are ready. ",
        "Jay should get George a nicer car. He seems like a good dude.",
        "Thanks George, Jay has always been my favoriate comedian. I was sad to see him got replaced by Jimmy Falon due to his age. I literally stopped watching the tonight show for a couple of years. It wasn't because of Jim that I disliked. It was the fact that I missed Jay's humor. Leno is so different from another hollywood star. He is humble and down to earth. I hope Jay has a speedy recovery. I will always be your fan.",
        "We love you Jay! glad your ok. Thanks George,",
        "I bet ANYTHING, access and others like TMZ are salivating at any possible video or pic of Jay freshly injured. #sickbastidcompanies #noprivacynorespect #moneyfirstforthem",
        "Never liked that fucking steamcar",
        "Jay's on  but not in a good  way \nLooking forward to some Richard Pryor ️   and Pepsi MJ jokes about this maybe Jay needs another  Roast overdue ",
        "Rest in peace Jay",
        "Sorry to hear about your accident today love you hope you're feeling better.",
        "Does anybody know where Conan was the night of the incident?",
        "God's Speed Mr. Leno, recover well.",
        "Love Jay Leno!  Need him back on his Garage show!  Get better soon Jay!",
        "Somehow I knew it was a steam car that was the offending vehicle........ Especially using gasoline to fire the boiler .....kerosene or  diesel is a much safer fuel source",
        "Of course he's getting the best care meanwhile dozens of poor Mexicans have to wait in line to see a doctor while he gets preferential  treatment. He's so selfish",
        "Nothing but good vibes for Jay for a fast recovery, he is a true American treasure.",
        "Wishing you a speedy recovery. God Bless you.",
        "Thank you for the update. My thoughts and prayers are with Jay for a speedy recovery. ️‍️‍,,,,,(((( Hugs))))",
        "Feel better soon jay",
        "Glad to hear that Jay is going to be OK.",
        "As soon as I heard the news I don't know why but I had a really good feeling it was that steam car that caused the injury to Jay",
        "its not like an Ann Hesch burn? that was awful",
        "When bad things happen to good people we all feel helpless.  Best of luck in your recovery, Jay.",
        "So Jay decided to have a cheap facial  praying for quick and safe recovery ️‍ We love ya! Comedy forever!",
        "I love cars, particularly Porsches. I have my whole life. And I love laughter. Appreciate everything you do, Jay, and your humility doing it.\nMy family was deeply affected when we heard the news. We are glad to hear the positive updates, our prayers are with you, and we know you'll pull out of it just fine. Quit showing off.",
        "As a burn victim myself from a car accident I know how he feels.\nBurns suck they are extremely painful and I wish Mr Leno the best.",
        "Here's a small suggestion for guy asking questions about a man's health, EMPATHY.",
        "This guy with his cars, why not crash or roll over, but he gets hurt while in his garage while looking at his antique cars.",
        "Hang in there Jay. Best wishes get well soon.",
        "It's great to hear Jay is doing well, speedy recovery Jay.",
        "This interviewer was terrible. Intrusive.",
        "Thank you, George for the information.  Prayers for Jay.  God bless you.",
        "Rest up Jay",
        "I've had flames shoot at me before, but nothing compared to having fuel shot at you then ignited. That's tissue burn for sure but glad Jay has a good medical team by his side",
        "heal up joke about it later. your part of the fantastic four now. human torch. just say flame on. i’m kidding of course humor is good for healing. watch the movie while you heal. Get Well JAY. your Fan Mark Lockwood wrench  on.",
        "Not a big leno fan but prayers and best wishes to a fellow car lover and a fellow American.",
        "15 years he worked with Jay...neat wow.  Like George talking about this nice",
        "Prayers",
        "Thanks for the update.",
        "Steam comes from water, not gas...",
        "He Scot / Italian-American, Get Well Soon.",
        "Lord we pray Leno get well soon",
        "That was a great interview ",
        "Such a relief to hear Jay is doing okay. Much love and prayers for a speedy recovery. Jay is the real deal, coolest guy ever. God bless!",
        "As a burn survivor, what they don't tell you is that there are long term psychological consequences to the disassociation that you have to learn to survive the pain. Invisible scars.",
        "Obviously George was upset and kind of traumatized about the accident.  I wish the reporter hadn't asked him about Jay.\n\nMy prayers go out to Jay, his wife, Mavis, and his family. ",
        "He fine he’s alive all jay cars about ! He be back messing with cars soon.",
        "George needs a raise. Mans a good friend if jay called him first",
        "One of the absolute nicest people walking this Earth. Jay Leno. Get healed up asap jay. Wishing you a speedy recovery.",
        "Get well soon Jay",
        "He didn't get those burns from a car accident, he got them from years of Conan roasting his ass.",
        "As a burn victim myself I can tell you from personal experience  Mr Leno is in a lot of pain and will take time to heal . Our  thoughts  and prayers are with you  ️  Jay .",
        "What did they punish Jay for? He's on their team.",
        "Rare for anyone to give a statement that detailed. Thanks for the interviewer being respectful-some times you've got more than enough answers and should just let the person go his way.",
        "o only remember him making a career off bullying Monica Lewinsky and all the bad jokes",
        "Thank you for the update George. Get well soon Jay",
        "H Town Búho sending prayers for Jay. Hoping for a quick recovery.  "
    ],
    "comments_disabled": false
}