{"video_id": "Y9A4Zm2MY8U", "comments": ["Thanks George for being up front and letting us know how he is.  Cheers 🇨🇦", "Thanks, George, for the update and for being a good friend to Jay.  Jay is very respected, probably more so than the vast majority of Hollywood stars.  He's humble, kind and very good-natured.  Prayers for a fast recovery and healing.", "If you watched Jay’s Garage, you know George. Glad he will be okay. Get well soon, Jay.", "Prayers to you Jay . I hope you recover quickly .", "I had a radiator blow up on my face so I know the horrible pain and I know he will get through this, God bless Jay", "Thank you, George, for letting us know how Jay is doing and how it happened.\nHe is lucky to have you working with him.", "Jay's a beloved guy and personality. Sending well wishes to him, family and friends.", "Hope Jay will be alright, love this guy. Best wishes and fast recovery!", "Unlike many Hollywood stars Jay Leno is the most down to earth person you will ever meet. I've been lucky enough to speak with him on a number of occasions & came away with a great feeling for the man. Speedy recovery Jay!", "I'm really sorry to hear this. Jay Leno is a very nice guy. My wife and I met him at a gas station and he's just as personable in real life as on television, even to complete strangers. Recover quickly, Mr. Leno!", "Nothing but good vibes for Jay for a fast recovery, he is a true American treasure.", "Thank you George for the update! I know this is a hard time. And we want to give Jay his privacy. We care a lot about him!", "As a burn victim myself I can tell you from personal experience  Mr Leno is in a lot of pain and will take time to heal . Our  thoughts  and prayers are with you  ️  Jay .", "Thank you George for the update. My prayers go out to him and his wife. I'm sure he'll be well taken care of and look forward to seeing him soon. God Bless  ", "One of the absolute nicest people walking this Earth. Jay Leno. Get healed up asap jay. Wishing you a speedy recovery.", "The nicest man associated with automobiles and motorcycles.  He has stopped numerous times on the side of the road to assist friends of mine when they broke down.  He has been great to my Sons over the years when we would visit him at the garages and the Rock Store.  They don't come any better.", "Praying  for a quick recovery.\nWe still need people like him to make us laugh in this cruel world.", "As a car guy this makes me really happy to hear he is ok . He is a automotive icon for me", "Such a relief to hear Jay is doing okay. Much love and prayers for a speedy recovery. Jay is the real deal, coolest guy ever. God bless!", "I feel it for Jay. Hopefully he makes best possible recovery. Tough injury but the way he handled it is classic.", "It’s good that he’s gonna make a recovery. Best of wishes to him. He’s a strong dude for not even losing consciousness in that incident", "My best to Jay. Glad he'll be OK. He'll still be my prayers for recovery. ", "Thank you George for the update on Jay. The Car world cares about him very, very much.", "Thanks for the update on Jay's condition. Like thousands of other people, I wish him a speedy recovery. I have been lucky enough to meet him a few times.  He is the most likeable and sincere celebrity that I have ever met. Get well soon, Jay!", "Thank you, George for the information.  Prayers for Jay.  God bless you.", "You hang tough, Jay.\nAll the people around you got your back.\nTake your time, heal; and get back to us when you can.\nI'm just glad that you are getting better.", "Prayers for Jay Leno's speedy recovery. Thanks for the update George.", "Such a sad thing to happen to anybody but I am so happy to hear it isn't life threatening. Burns are no joke so I'm sure he will have quite the recovery ahead of him :(", "Yeah, we all know George.  Thanks for the update, George.  My best to Jay.", "All my prayers for Mr. Leno. Here's to a speedy recovery.", "Hope and pray that Jay heals well and quickly.  He's a truly great guy!", "Feel better Jay. You are one of the good guys. ⚘️⚘️", "Thank you for breaking it down!!With everything going on right now, the best decision to be on any creative man's heart is having a profitable investment strategy", "thanks George for the update , millions are pulling for you Jay ,we know you,ll hurry up and heal ,see you on the road. God bless you.", "More prayers  coming from Canada,  for Jay’s rapid recovery. Thank you George for the information.", "This is someone who does more good for more people than we'll ever know. Be well, Jay! (We can stand a few JLG re-runs on youtube!)", "As a former mechanic, get well Jay. Had a radiator burn one time from hot water. Get well soon", "Only “know” Jay through his videos and tv, but I am impressed by the outpouring of love and concern for the man.  Not one negative comment!  Take care Jay, get well soon and we all are pulling for you and your crew!", "It's great to hear Jay is doing well, speedy recovery Jay.", "I  love you Jay, praying for a quick recovery .", "Thoughts and prayers for you and your family, Jay!  Hang in there buddy.", "I love cars, particularly Porsches. I have my whole life. And I love laughter. Appreciate everything you do, Jay, and your humility doing it.\nMy family was deeply affected when we heard the news. We are glad to hear the positive updates, our prayers are with you, and we know you'll pull out of it just fine. Quit showing off.", "So glad he's gonna be okay! We all love you JAY !!", "George, thanks so much for the update on Jay.  I'm so glad he's going to be okay.  He's a good guy and was one of my favorite late night hosts.  Get well soon, Jay!", "Jay always commented in his videos on the dangers of steam cars because of the process of lighting the boiler to heat the water. Speedy recovery Jay and thanks for the joy that you have given car people with Jay Leno's Garage", "I'm very happy to hear he is going to recover.", "Prayers for you Jay!\nStay strong and get well soon!!", "Wish Mr. Leno the best. Full and speedy recovery. He is such a nice gentleman.", "Jay gets hurt (unfortunately) doing what he loves and at the same time as always teaching us about the dangers of a steam engines...  a true legend ", "Jay Leno is one of the good ones. Get Well Soon.", "Prayers going out to Jay.", "We love you Jay! Get well soon! Thoughts and Prayers for you and family", "Jay you have no idea just how many people in this country love you man !   Get well soon !!!", "I always felt like I knew him..even though we never met. So, it seems like this happened to a friend. I hope he recovers completely and quickly.", "My prayers are with Jay.", "Thank you George and AH for sharing about Jay Leno. Love and prayers to him during his recovery.", "Our prayers are with you Jay. Hope you recover quickly !", "Praying for Jay Leno’s full recovery. God bless you Jay", "Thanks for the update, Get well Jay we are all praying for you!!!!!!", "Thank you for the update George. We love you Jay, get well soon", "Jay's an awesome person, hope he gets well soon! Such a terrible thing to have happen to him...", "So glad to here your doing ok Jay,  get well soon !   Thanks for letting us know George !!", "How wonderful of George to give us information we all wanted Jay is a friend I've never met I think the world of them and I hope for the best for him he's a tough guy he'll be fine", "Godspeed for your journey to a full recovery Mr. Leno.", "I was heart broken  to hear this happen to Mr. Leno. I pray he makes a full recovery.", "That’s good news that he will recover and he’s at a burn unit! Prayers for Jay ", "Speedy recovery Jay! We love you and wish for speedy recovery.", "Hope and pray that Jay heals well and quickly. He's a truly great guy!", "Love Jay Leno . Honest and has kept us laughing for years .  Love you Jay .", "Stay strong guys! I’m glad he will be OK. You all do an important job", "Praying for a speedy recovery for Jay, Thank You Lord for sparing his life now we ask You to give him miraculous recovery with little to no scarring from the burns in Jesus Name, Amen", "Wishing Jay a speedy recovery. We car guys hang tough.", "I've had lit gasoline in the face, took awhile but 100% recovery (30 years ago), positive vibes sent, take care Mr. Leno", "Very glad he is going to be okay. Get well Jay!", "Prayer out for Jay for a fast recovery.  \n\nA while back I watched him on an episode lighting one of these steam cars and a blow back of flame. They are great cars, but are extremely temperamental. Jay is an expert with steam cars, but anything can happen. Again thoughts and prayers for Jay.", "Obviously George was upset and kind of traumatized about the accident.  I wish the reporter hadn't asked him about Jay.\n\nMy prayers go out to Jay, his wife, Mavis, and his family. ", "Oh gosh, I wish a very speedy recovery Jay.  You are the best, love you", "I absoolutely love Jay Leno, he is a good man, prayers for your swift recovery.", "Thanks George and wishing Jay a full and speedy recovery.", "Prayers for a quick recovery Jay", "Thank much George for giving us an update. Get well Jay!", "Leno, wishing you all the best and a speedy recovery. \n\n P.S Love watching Leno' Garage.", "Hope for a speedy recovery Jay. ", "Get well soon Jay, thinking of you and sending you all the best.", "Thank you George for the update. Really happy that Jay will be fine. Prayers  for Jay to keep getting better .", "Thank you.  Didn’t know that this happened, but glad to hear that he’ll be okay.", "Hope Jay is going to be fine.He's a nice man who people love and I have always enjoyed his humor and I love his car show.", "Thank You George.....Wishing you a painless recovery Jay ..", "Get well Jay . Prayers for a complete and speedy recovery.", "Prayers for this down to earth man.", "Our prayers are with Jay from all.", "Get well Jay , we all send you our love ! Thanks George for your update.", "Thank you George! I know it was difficult to do this interview. We ALL love Jay and will be praying for him as well as for you. I'm guessing it was the Stanley. He joked about the dangers of running that car as a potential scalded or burned trying to light it.", "Prayers for your complete recovery, Jay. May God bless you and continue with you all of your days.", "Thanks for the update.\nYou know, when Jonny retired, I was skeptical. Turned out to be just as good. Even after NBC let him go.\nHe's more enjoyable  in his own garage than any NBC studio set. Lol.\nGet well soon Jay.", "Thank God . Jays an incredible person and my mom met him when he did stand up and he bought an Indian motorcycle from a neighbor of ours in Illinois. I wish his recovery is fast and that he will be happy as well as healthy", "praying for Jay...Hope he does well.. thanks for George. Sorry this kind of thing could happen to such a nice guy. #PrayersforJay", "Hopeing Jay has a speedy recovery, God Bless him.", "little prayer coming your way , kick ass Jay", "I Pray Jay Leno you will be ok and back in your garage and on the show, Take care of yourself at the hospital.  We will pray for a swift recovery for you."]}