{"video_id": "YhsNinzPEb8", "comments": ["Use this link to save $5 at Magic Spoon today!  https://magicspoon.com/wendigoon\nThank you to Magic Spoon for sponsoring the video!", "I remember hearing about a little girl being kidnapped. These 12-14 year old boys decided to ride their bikes around their neighborhood. One actually found her & literally chased the car on his bike far enough they shoved her out to him. \nShe wouldn't let go of the boy until her parents got there. He had to sit in the ambulance with her. The boys & especially that boy were true heroes that day.", "My parents used to tell me that if I didn't drink all my milk at breakfast I would be in greater danger of potential abduction. As a kid this sounded sort of crazy. But all these decades later, having always finished my glass of milk as a child, I can attest to the fact that I was never abducted. Thanks mom and dad for the sound advice. Sorry I doubted you.", "I was a child of the 80s. I remember being uneasy seeing the photos of missing kids on milk and orange juice cartons. I would lose my appetite seeing the kids faces on a pizza box. It was a macabre practice indeed. My worst memory from that era though, is seeing my classmates’ picture on an orange juice carton a few days before they found his body in a deep ditch. He was found next to his mangled bicycle, apparently killed by a hit and run.", "My sister was trafficked in the early 90s. The few times she was left alone in public and tried to get help from strangers no one believed her. Being dismissed by normal people which allowed her to fall back in the hands of monsters was the most traumatic thing because the other abuse she can just block out.", "As a 43 year old, between the missing children on milk cartons, the satanic panic of the 80’s, and the challenger exploding on tv while we all watched in classrooms across America in ‘86, we 80’s kids are truly warped a bit.", "Growing up as a millennial, my mom always was terrified of me being randomly kidnapped and constantly gave me speeches about it. Now I understand.", "I am currently 28 years old. When I was 6-8yrs old, a man I had never seen before approached me at a place I was familiar with and said my parents were looking for me. He offered to drive me back to my parents. Even being a child, I still said \"no I'll ride my bike back home.\" After years(almost 10 yrs) of not thinking anything of that incident, I told my mother. She cried. Never would she ask for a stranger to pick me up. I think back to that moment often. I joke now, but I could've been another one of these children. Missing forever.", "I was almost kidnapped once as a child. I was about 5 years old, but I still remember it vividly. I was on vacation in a small town in Maine & my family took me to a local restaurant that we had visited many times. \n\nMy parents gave me a quarter to go play on the PacMan machine in the other room, and an older man (approximately in his 60s) approached me & started chatting with me. He eventually said “come here, I wanna show you something” and with my wild imagination I thought he was going to show me some magical secret room in the restaurant. ", "I was raised in the \"stranger danger\" era. Maybe I was overly sensitive, but it absolutely ruined my childhood. I was terrified of everyone, thought everything was poison, and believed that couples without children had simply murdered them. I was even afraid that my wonderful, caring parents would kill me. It wasn't good.", "When I was younger, back in like 2008, a friend of my mother’s pulled up next to me in a car. I didn’t recognize her, since we were visiting my mom’s hometown (where I didn’t live) at the time, but apparently this woman used to babysit me and my parents were very close. Anyways, she rolls her window down and says “want some candy kid?” Before unlocking the back door. My mom told me I threw my scooter on the side of her door and ran back into the house ", "A child of the Mtv Generation, it wasn't milk cartons, but the music vid to Soul Asylum's Runaway Train that haunted my dreams. Nearly 3 decades later, I still think about those people from time to time and wonder what happened to them... ", "There was this case where a highschooler was drinking milk and saw her face on the cart from when she was very young. Turns out, her \"mom\" stole her, gave her to her grandma and dipped", "imagine asking to put your missing dad on a milk carton after he said he’s going to get milk but never came back", "Early 2000s kid, I was taught the stranger danger thing. My fiancé, was never taught any of it. It’s shocking how he just goes up to strangers and speaks to people where I just assume everyone is out to get me. I think it’s interesting how this inherently changes your reaction to strangers even as an adult now.", "I had a man come up to my grandparents back yard fence . I was about 4/5? He literally pulled the whole “I’ve lost my puppy can you help me look for him “ even at 4 that was off to me . I said my mom was calling me and I ran inside . Very creepy . Why would you ask a 4 y/o to help you look for something if there wasn’t ill intention?", "I was extremely paranoid when I was a child. There was a big missing case involving a girl my age (she was found, as you might expect, desecrated and dead), and since then I feared even close relatives (someone close to her was the culprit)", "I'm surprised there was no bringing up of the fact that because of Johnny or more specifically his mother is the reason we now have the center for missing and exploited children.  Her story is long heartbreaking and inspiring all in one.", "When I was little, my oldest sister threatened me by saying “You’re not too young to have your face end up on a milk carton!” and I replied to her “Unlike YOU, my face won’t turn the milk to cheese!”.  I had to run for it.", "It's depressing that Jonny Gosch (the first child talked about here) went missing on the first day that he decided he didn't need his father to supervise him, as well as the Etan Patz abduction being on the first day he went to the bus stop alone.", "Hearing that someone your age is missing is scary. I just now heard that a girl from my school who went missing on Nov 1st’s body was found in the next county over. I didn’t know her, but just hearing this makes me feel broken", "My mom ran away at around 14 years old and was gone for nearly a year. My grandmother put her on milk cartons and fliers everywhere, they didn't work. She did get false reports about my mom being in California from people coming back from spring break, people saying she was lured into the woods near her home, etc... but in reality, she was just hiding out with her friends.", "As a kid I had 3 things forced into my head.\n1: Strangers our lurking at every street corner. 2: random kids are gonna offer you drugs. 3: At any moment you could catch on fire.", "It may have left a mental scar on the friends of those boys. Your best friend is missing, no way of knowing what happened to him, and you are eating your cereal with the picture of him looking at you every morning, also reminding you that once you make it to school he won't be there", "The sad part about stranger danger is that most of the time the kidnapper isn’t a stranger to the kids,even if the parents are divorced,they’ve known them their hole life, examples of missing people from non strangers are Elizabeth Fritzl who was kidnapped by her father when she was 18 for 24 years from 1984-2008, and Michelle Knight,Gena Dehesues, and Amanda Berry was kidnapped by the same man but all 3 knew him in some way as a nice man,one of them even knew him because she was friends with his daughter, Michelle was kidnapped in 2002,Amanda was kidnapped in 2003,Gina was kidnapped in 2004,they all knew him because he was a nice man in their community,Gina was the one who was friends with his daughter and were all found in 2013 because he forgot to lock Amanda’s door and their next door neighbor helped her get out and got the other two out", "When I was a kid, my mom would just scar me with stories about women going missing in her hometown in Mexico. Then she would make it worse by pointing at a random person in public and would say “if you don’t behave, they’re gonna take you like they did them.” And it would scare the hell out of me. Thanks Mom.", "The band Soul Asylum’s music video of “Runaway Train” found 21 of the 36 missing kids, just from watching MTV!!  I’ve heard they update pictures for the video every few years…. I’m sure more have been found, hopefully. (Just a fun fact, in a kinda sad way️", "i remember going to walmart and seeing “have you seen me?” posters, with lots of kids on them. some of them had been missing for a very long time, and they used some software to approximate what they would look like in the present day and put that next to the photo of them from when they went missing. it was very disturbing", "The being kidnapped by a parent thing is beyond true. Boyfriend’s nephew was taken out of school early by his mom and my boyfriend’s family has not seen him since. The police said there was nothing they can do, despite the fact that she only came back into his life a few months ago after leaving when he was a baby, having a felony charge against her for attacking the kids dad, and her family having a history of drugs and drugging children to get them to behave. My heart hurts for him and I know his dad and the rest of the family misses him. We can only hope his dad is able to get full custody in court some time soon", "When my mom was a little girl (around 6-8), her and my grandmother was walking in a airport to come back to the states. A lady started walking alongside them, grabbed my mother's hand, and tried to guide her off in another direction. Thankfully, my grandma was quick to notice this and stop her", "my parents often told me to not trust strangers, but even at a young age I knew family members and relatives were the worst offenders. i saw many parents and relatives who were addicts of various vices or just plain loose in the heads and were neglecting and beating their kids to say the least. this was only considering what they did in public.", "'The missing kid who ate breakfast with them every day' is a very powerful line.", "The whiplash I would experience seeing my own face on the back of a Milk cartoon, props to the girl who cut it out and played with it.", "I remember my parents hammering in the whole \"stranger danger\" thing all throughout my childhood (it basically boiled down to 'There's always someone in public who will try to kidnap you, but you can't tell who they are so you are never safe in public because there are strangers everywhere'). Even as an adult now that message is still ingrained in my mind to the point I have developed severe social anxiety because I still have that fear of \"what if there's someone here that wants to kidnap or hurt me and is just waiting until I'm alone?\" It messed me up big time.", "I'm 21, and I always remember growing up being panicked when I saw a car drive down my road, even if it was just my neighbor. My parents were always all about stranger danger.", "Insightful video. Saw lots of parallels with the helicopter parenting style I was raised with as a child in the 2000s. Undoubtedly remnants from that scare culture had lots of influence.", "My parents were pretty awesome with us. We had a huge back yard. It was a horse property in AZ with plenty of room to ride bikes, chase the dogs, try to dig a hole to China…also a big old pool. Looking back, I realize the genius of having a home like that. We didn’t know our neighbors too well. But we always had friends from school, kids of family friends, cousins, etc. We were NEVER bored and never strayed while we lived there. ", "As a child of the 80s we made \" kids on milk cartoons\" a meme before memes existed. The 80s was all about fear mongering. We had Stranger Danger, Mr Yuk stickers, DARE, Just say No, MADD, McGruff the Crime dog , Satanic panic,  holes in the ozone layer and acid Rain , oh and the Soviets and Nuclear destruction was still a thing . It was wild time.", "What I love about Wendigoon's videos is that the video itself is like 50% of the experience. The other 50% is reading the many comments of people sharing all kind of stories and info, and I love how in this video's case the stories vary from really interesting to outright scary.", "It's so morbid to realise that a lot of the children who were missing died before their face even showed up on the milk cartons.", "I just realized from listening to the story that I almost got kidnapped as a kid.\n\nI was in middle school running the presidential fitness test which went around my middle school. 2 guys in a work van/truck with a ladder pulled up as I was running by myself (I was a slow runner) and asked if I knew the directions to a major supermarket in the middle of town, which was dumb because it was literally in the center of town. They thought it was by my school on the edge of town and I said it's obviously in town.", "I am 15 years old. When I was 3-6 years old I had been attempted to be kidnapped many times. I lived in a worse part of the city. My entire childhood was (and still is) making those passwords you mentioned, looking at missing children, the don't-take-candy-from-strangers actions, etc. Ever now and then my school would force a group of kids (and adults) to look around the place for missing people, or rather for their bodies. I have, during the 11 years I've been going to those searchings, found a remnant of two bodies. One was a thigh bone and some muscle (I was 14 at the time), another one was a skull i dug up on a beach near a forest where I found the leg bone (i was  about 7 to 8 years old). We didn't get much information but a friend if a friend had told me that the thigh bone was of an adult and the skull was of a child about the same age I was at the time. Terrifying", "I live in Australia, if someone goes missing in my local area, I get an SMS message from the police. Sometimes it's a missing child, but more often it's old people who go missing.", "The worst part about the Bonnie case is that it completely goes against the whole “stranger danger” aspect of the missing children. Bonnie wasn’t kidnapped by a stranger, but by her own mother. Not even the one milk carton success story lines up with the expectations set by it.", "What’s really sad is that Johny and Etan just wanted to be older,do what older kids do but the first time they did it they were kidnapped", "I was one of those kids on a milk carton.. I went to my friends slumber party without permission in 87 to for two days. Weeks after I was already \"found\" my picture and info was on the little cartons they gave us at school.. the torment of the other kids making fun of me for being a milk carton kid was horrible. Strangers stopped me on the street twice walking home to call police..some kids who were \"found\" were traumatised greatly by the end because we'd never actually been in danger.. we were just being kids.", "When I was a kid, my family and I lived in a homeless shelter. During this time, I was befriended by a young couple whom seemed pretty intent on separating me from my family, so my mother never trusted them, and always sent my older brother to check up on me. One day, they were gone, and soon after, the FBI came to the shelter looking for them. My mother told me to say nothing, and offered no information to the authorities. As it tuned out, they were wanted in connection with the disappearances of several children spanning several states. ", "The \"Stranger Danger\" stuff has prevented my mom from letting me out of the house except for school and family trips. They even have bells on the door to prevent me from leaving. I live in a massively low-crime area, nothing has ever happened around my house. I'm barely 2 years from being a legal adult. I'm legally allowed to get a driver's license, and yet I'm not allowed to walk less than a mile to the grocery store.", "Im in my 30s and  I draw a parallel between stranger danger and my social anxiety because it was engrained into our minds not to trust anyone except our parents, teachers, cops, and religious leaders.", "so glad Wendigoon survived exploring Brown Mountain Lights 2 weeks ago, all this time I thought he was a sitting entity with no legs", "The whole “Dad never came back from getting milk” joke takes on a whole new dark meaning.", "I remember overhearing a classmate of mine talking about her boyfriend in his 20s. She was 15 or 16, it was sophomore year. She suddenly stopped coming to class and I saw her face on a missing sign plastered on the wall of an ice cream shop. I don't even remember what her name was or if she was ever found. It still haunts me.", "As a child of the 70's and teen of the 80's, I definitely remember being told by my mom about stranger danger. I can tell you that as a child less than 6, a strange guy in the neighborhood asked me and a friend to come with them. Don't remember what reasoning he used, but I do remember running inside my house to tell my mother. However, I feel like this is only anecdotal evidence.", "This has its harmful consequences even today, where kids are taught that child abuse / abductions and even sexual assault is committed by strangers, when the vast majority is committed by friends, family, trusted members of the community etc", "According to my nana, a large group of new york mothers in the 70s-80s would wear pins with their children's faces on them. I'm not sure if it was so that if missing, others could connect the mother and child again, or if it was just a social statement. Found out about the whole missing children milk carton issue when I saw her use the pin as a Christmas ornament!", "I remember watching a video years ago that tested if missing kid posters did anything at all. They posted a picture of a girl in front of a mall with a big ol' \"MISSING\" on it, then put the girl on a bench in the busiest part of the mall. She sat there for a long time, all by herself. Nobody recognized her as the \"missing\" kid. Nobody really even paid attention to her.", "Wendigoon has a talent for presenting the most obscure yet interesting topics", "As a former Des Moines, IA journalists that Johnny Gosche story is still a big deal to the community. I reported on a few different missing kids in my time in Des Moines two of which were found dead. That among many other stories is why I couldn’t keep working in the industry. Don’t forget to support your local news reporters the details we can share often can’t even compare to the details we can’t. (Details that are graphic and aren’t necessary for the public or the family doesn’t want shared.)", "My parents grew up during this time and passed that fear onto me when I was a child. I was so afraid of being kidnapped that I stopped going outside.", "34:58 I grew up in the 80s, so it was interesting looking back on this as an adult. My parents taught us about stranger danger, but we also walked a mile home from school from the bus stop when the weather was good. (We lived at the end of a dead-end road in the countryside where all the neighbors knew each other). Then I hit this point of the video and the girl on the right was missing from my hometown, when I was 6 years old....", "The Johnny Gosch story is an interesting rabbit hole.  There's a lot more to it.  Worth checking out if any of it is still on YT.", "22:00\nThat was always my issue with this. If a kid was legitimately kidnapped, by the time the face makes it onto the milk cartons, that kid is almost surely dead. It is very rare for a child to be kidnapped by a stranger (so not just a divorced parent taking the kid) to be found alive. As depressing as it is, almost always, the kid is already dead before the week is over.", "Congrats on 2M subs Wendigoon, it's been a blast watching your channel grow. My favorite youtuber and one of the most wholesome guys on the internet. Thanks for all the work you put in to bring us this quality entertainment, keep it up!", "Being from the UK (Where we never had such a program, but often saw it presented in the mostly American content we were watching through the 80s) I was always curious about this and thought it strange the UK had never adopted it. Noting what you say about the anxiety it caused everybody (Both parents and kids) perhaps this was why it never became a practice here.", "I'm genuinely convinced that Wendigoon isn't even sponsored by magic spoon, he just really loves it.", "I can't believe how much this channel has grown!\n\nKeep it up man!", "My mom literally traumatized me due in part to this whole era. She once made me watch a documentary on stranger danger when I was about 5. She then put her finger to my head like a gun and asked me what I should do in that situation. I tried to answer, I think with running away, she just said, \"bang, you're dead. You can't run from a gun.\" And I started crying. I wasn't even allowed to cross the street alone until I was about 13. Saying I was sheltered would be an understatement.", "When I was 5 my mom lost me in the mall due to my inability to listen, and id go around the store out of her sight. When I realized i couldnt find her i cried in a corner, and only one woman noticed. She actually took me to mall security, where my mom was crying and explaining how she lost me. That could’ve ended so differently and I am grateful to that woman who took care of me out of the kindness of her heart.", "In Mexico during the 90s we had the equivalent of the milk carton program in the form of a public service ad on television broadcast in the middle of the evening cartoons. It had the same emotional impact in us kids.", "These fear campaigns probably saved a lot of lives. I was scared of strangers as a kid but maybe that saved me. I was followed by some van one time riding my bike home. Luckily I was prepared because I had thought so much about it.", "Miss children cases are always the saddest and most haunting to me.", "I remember two instances from my childhood where a stranger attempted to lure me.  Once when a car drove up to me and said they had candy, and once a man tried to lure me into his apartment when I was playing outside.  Stranger danger is a real thing.", "I will say that the whole stranger danger initiative, while perhaps overblown, instilled some good habits. For instance, it’s common knowledge among kids that you don’t get into cars with strangers and they’re able to recognize luring attempts (“I have some candy in my van” or “wanna come see my puppy?”).", "I find the whole thing pretty morbid (as you explained about a child sitting at the breakfast table seeing the face of a kid their age), I don't want to be reminded of tragedies when I'm buying milk. So it was pretty surprising to me that it was started by the relative of a missing child.\nYou explained very well how the stranger danger myth was harmful, it was a very informative video!", "to think I stumbled upon your scary movie iceburg at 40k subs, appalled that you weren't bigger, months later an here we are at over 2 mil subs, upgraded gear and clearly more confidence, super glad I get to witness all of it, keep it up man", "I remember I'd gotten an amber alert once in January about a child that had gone missing in October. It honestly hurt to see.", "Thinking about seeing a missing poster of your child on every milk carton feels like it is begging for trauma to form for the parents involved", "I grew up in the late 80s and 90s and I very much remember Stranger Danger and having to remember passwords and stuff for strangers. I don't think I ever actually had to use one of them...\n\nThough, side note, I was, on several occasions, one of those \"missing but not really missing\" kids due to a tendency to wander off on my own when out with the family. Though I always got either picked up by police or returned home before the end of the day.", "I remember being told “you wanna end up on a milk carton?” As a kid and not really understanding what that meant. Now we just post them on the wall at walmart. Keep up the great work brother.", "The stranger danger thing really harmed the trust people should hold on their community. While people should be wary of individuals with bad intentions, most people are genuinely good and open to help. It really is tragic how leyends and myths superced actual statistics", "I was a 90s kid and I'd argue that the stranger danger thing fueled a lot of the fear monger style of education that I experienced. They taught us useful stuff like how to be safe around trains but there was a lot of \"be careful, you could DIE\" stuff. Like I had a weird fear of fireworks because they showed us a video of a little girl just hanging out on her balcony when a firework landed in the collar of her shirt. I had to watch the video on industrial accidents 4 times during high-school. It was all very doom and gloom.", "I remember reading a book as a kid called the girl on the milk carton about a kidnapped girl who was found years later and reunited with her family and how it screwed up her whole life and psyche, and i told myself if i ever found a milk carton kid i wouldn't turn them in.  Oddly i think that might even have been based on a true story.", "This was so fascinating! I was an 80s teen and the fear of strangers was everywhere. There were “special episodes “ of popular TV shows and TV movies that played on that fear.", "Been binging your content lately and I just wanna say thank you for describing in great and funny detail all these conspiracies and events. These stories will always be in my soul buddy", "Here's a funny childhood story my dad likes to remind me of every now and again. When I was little, \"stranger danger\" was implemented far too heavy-handedly in my schools. So much so that one day, at the store to get groceries, I apparently asked this random lady outright 'Are you a good stranger or a bad stranger?' ", "not old enough for the milk carton era but i remember being really young, five maybe, and my mom left me with my baby brother in an aisle of the store to grab something and a random woman came up to me and told me to watch out because someone could easily steal him…i don’t know why she would do this but it scared the hell out of me lmao", "This program was one of the factors that made Very paranoid. Even though the pictures weren't that common over here the stories were and having those same stories drilled into my head every week as a child kinda built a habit of always looking over my shoulder when walking, even subconsciously.", "I was born in '88 and thought that was something that only happened on TV, like people delivering milk to houses. No idea it continued into the '90s, but we always got gallon jugs so the only milk cartons I had were those small cartons of sour milk that came with school lunches.", "OMG THANK YOU! I remember watching a documentary about the johnny incident when I was younger. I've tried finding it for years, but to no avail since I had forgot all the names. The only thing I remembered fondly was the red wagon.", "As someone who grew up in the early 2000s, I always wondered about this.\nI watched a lot of old cartoons, so I knew about missing people on milk cartons, but I never saw it on a real milk carton, so I just assumed it was something cartoons and TV made up.\nIt's kinda interesting hearing about its history.", "I remember feeling bad whenever I saw the missing kids and my mom grew extremely paranoid of strangers. I was the type of kid that ran off in the store a lot and you better believe I got chewed out by my mom a lot. She always told me that there were bad people who pretended to be nice, so I had to stay by her side at all times. I remember being too anxious to play outside because our house was by a busy street. And now I'm a grown adult with moderate social anxiety. I was one of those kids that as I grew older, the anxiety around stranger danger grew more. I always did wonder what happened to the milk carton missing children ads, so I'm glad you got my back, Wendigoon. lol", "This topic is definitely something worth discussing, I know I was in great danger and went missing, my mom went to the cops but because I was an adult they just told her that they can’t do anything because I’m an adult , something has to be done but what would actually be appropriate , I still don’t know , the fact my mom couldn’t find me because I was 19 is absurd I wish she did or the cops could have …this is definitely a topic worth discussing about people missing who aren’t kids, every second is worth a life", "i grew up in hungary and the missing children on the milk cartoon thing was still alive and well in the early 2000s or even the early 2010s and i still remember how those low quality images of children scared me for my entire childhood, like i would just stay up all night and think about them and be paranoid about being alone in public", "I’m 38, I’ve heard the stories over the decades. I’m OK with my nine year old son hurting a strangers feelings, by not talking to them, or responding to them. Yes the stranger danger might be overreacting sometimes, but it’s better safe than sorry.", "I love to watch these videos as a foreigner who is not even in the US. It seems like I'm accessing a part of american culture that is not just thrown out there lol Love the channel, keep it up :)", "I’m glad that I didn’t witness any of the milk carton kids. I was born in ‘97, so a year after Amber Alerts got created. But it’s crazy to me that even with Amber Alerts they showed that girl on a milk carton in 2000. \n\nI have generalized anxiety disorder and I’m pretty sure I’ve had it my entire life, so those milk cartons would’ve 100% made me paranoid.", "The real problem with the whole stranger danger panic is that it’s completely untrue. Absolutely, don’t get into cars with strangers, but a vast majority of the bad things that happen to kids happen in the home. The vast majority of people who hurt kids are people the kids know, or even relatives like parents, uncles, siblings, etc. A lot of stranger danger rhetoric focused on very rare instances and told kids that the people they knew were safe, to go to your priest, parents, teachers, etc for safety any time you need. Those people were the ones most likely to take advantage of kids, in reality. Also that most missing childrens cases are unresolved custody disputes or runaways that show up within a week or so.", "The missing children/stranger danger situation dovetailed a lot with the \"Satanic Panic\" of the same time.", "They also used to send out flyers in the mail. Those also got faces out WAAAAAAYYYYY to late. By the time we randomly received one with my sister's face on it she had already been found and it was 2 or 3 years after she had disappeared. In 1992 when she disappeared too many people were worried about the \"white vans with scary men\" to realize the real monster was just a few doors down.", "I grew up in the early 2,000's missing children on milk cartoons showed up often in cartoons. If I remember it was shown in Courage the Cowardly Dog. Just goes to show how things change with time."]}