{
    "video_id": "YhsNinzPEb8",
    "comments": [
        "TV SHOW SUGGESTION\nDan browns the lost symbol is not only an interesting show with good acting, it has subjects and myths that would be fun to dive into. \nAt the beginning of the first episode it states a fact saying \"in 1991, a document was locked in the safe of the director of the CIA. Cryptic text includes references to an ancient portal and an unknown location. It also contains the phrase: its buried out there somewhere.",
        "Surprised the \"Runaway Train\" music video wasn't discussed. Something like 30 kids shown, 21 found",
        "I wonder if they had put poor Wendigoon's face on some milk cartons could they have perhaps gotten him out of that cave?",
        "First time I heard of this thing was through a Trollhunters fanfic ",
        "gotta say, a cereal company is a depressingly good fit as a sponsor for a video about milk",
        "watching this while drinking milk. Thank you.",
        "Mr Wendigoon pls make vid on Skinamarink \nI swear you will love movie\nMandela catalogue and wendigo ",
        "My mom literally traumatized me due in part to this whole era. She once made me watch a documentary on stranger danger when I was about 5. She then put her finger to my head like a gun and asked me what I should do in that situation. I tried to answer, I think with running away, she just said, \"bang, you're dead. You can't run from a gun.\" And I started crying. I wasn't even allowed to cross the street alone until I was about 13. Saying I was sheltered would be an understatement.",
        "The south park episode about this was hilarious",
        "I'm surprised there was no bringing up of the fact that because of Johnny or more specifically his mother is the reason we now have the center for missing and exploited children.  Her story is long heartbreaking and inspiring all in one.",
        "How about those missing kid posts they did on TBS at the end of a episode \nWatching rips from vhs makes the end of e very Beverly hillbillies a little creepy now \nMakes you wonder if anyone knows what happened to those particular children and if it helped at all",
        "I remember reading a book as a kid called the girl on the milk carton about a kidnapped girl who was found years later and reunited with her family and how it screwed up her whole life and psyche, and i told myself if i ever found a milk carton kid i wouldn't turn them in.  Oddly i think that might even have been based on a true story.",
        "I hope you never stop sharing these random topics you find interesting! Your channel covers so much peculiar stuff that I haven't seen elsewhere.",
        "On the note of paranoia developing in kids, I often wonder how much of the stranger danger PSAs of the early 90's resulted into my anxiety. Because let me tell you, those were terrifying to watch. ._.",
        "I'm surprised the milk carton program continued all the way up to 2000. All this time I've thought that the milk carton program ended no later than the 1960s.",
        "It’s crazy seeing you at almost 2 mil! I only started watching you at the beginning of last year and I think you only had about 15-20k subscribers. I’m so happy to see how much you’ve grown, you deserve every last bit of your success, congratulations man :)",
        "It literally feels as if all the good that it could obviously do was put into a gray area that honestly and truthfully doesn't exist in reality while all the bad it could potentially do was expanded in order to end this program.... Because literally this could do like no harm.... Literally at one point even though it was properly disgusting the video and dismissed but the comfort of one child should not even be considered on the other end sits just the HOPE of saving another.... Basically it sounds like a lot of excuses to stop something that only could do good and trying to make it look like it was doing something bad in order to stop an awareness for an issue that is not taken serious when it's more serious today than it was in the 90s and eighties and seventies because now we have film and this film paints a completely different picture of what these incidents may have been going down like back in the past... My issue with taking away the milk carton is that when you took away the milk carton you took away the community's ability to actively be a part of healing itself and it must now rely completely upon a chance encounter or the government doing its job correctly which both have very slim chances",
        "Can’t watch you unless I put it on 1.25 speed. You. Talk. So. Slow.",
        "The sad part about stranger danger is that most of the time the kidnapper isn’t a stranger to the kids,even if the parents are divorced,they’ve known them their hole life, examples of missing people from non strangers are Elizabeth Fritzl who was kidnapped by her father when she was 18 for 24 years from 1984-2008, and Michelle Knight,Gena Dehesues, and Amanda Berry was kidnapped by the same man but all 3 knew him in some way as a nice man,one of them even knew him because she was friends with his daughter, Michelle was kidnapped in 2002,Amanda was kidnapped in 2003,Gina was kidnapped in 2004,they all knew him because he was a nice man in their community,Gina was the one who was friends with his daughter and were all found in 2013 because he forgot to lock Amanda’s door and their next door neighbor helped her get out and got the other two out",
        "Wendigoon please do a book review of brothers karamazov, plenty of people would love to hear your interpretations of Dostoyevsky's message.",
        "Anyone else find it suspicious that alot of these cases share one common theme, they all or almost all just so happen to be the first time they walk to school alone, deliver papers alone and so on. To me this puts the target squarely on the parents, maybe some falsely said they usually were with them trying to not look like a neglectful parent but does seem odd",
        "I'm glad our family was too big to buy milk cartons and we got gallon jugs instead",
        "So, a kid went missing near my hometown in fruitland Idaho and he didn’t get an amber alert. Somehow he didn’t “qualify”. \nI’ve seen his name on billboards, on semi trucks, and even pizza restaurants and written “find Michael Vaughan”. ",
        "It can be anyone that’s whats scary about it if you see something say something it’s good to be aware and paranoid than clueless.",
        "114/800,000? Does anyone for a second believe that number.",
        "It reminds me of Tom and Jerry",
        "Actually the other chap who said he knew Johnny Gosch as he was kidnapped by the same ring, his story has never been proven to be a lie, he also took a documentary team to a ranch where they were held and showed the team the carvings of their initials in the posts in the cellar! It was pretty compelling actually. And Johnny Gosch's mum and the other man said the ring had connections as high up as The Whitehouse! No wonder they shot it down quick!",
        "Good content bad time. This video is 8 years long so it’s not worth it. Do better next time.",
        "Dontai coming In clutch when Im bored scrolling through YouTube",
        "Everytime I watch this series I'm always so impressed by Techno's creativity, ruthlessness, and dedication to achieve his goals. Even after his passing his ingenuity continues to have an impact on Youtube and its creators. Rest easy, King. TECHNOBLADE NEVER DIES:_TechnoSalute:",
        "I actually benefited from this mania. There were like 3 different instances in which one of my neighbors (I live in an urban area) ended up on a list when I got older. I was a tiny afab kid who couldn't walk and suffered from moderate paranoia, so I never talked to any neighbors.",
        "One time my mother rode up beside me while I was biking around town and as a joke she said \"Hello little girl, would you like some candy??\" I thought this was hilarious but the diligent police officer parked down the road really got into gear to try and save the day ",
        "So glad you covered this topic, I was just talking about this with my mom a few weeks ago. I clearly remember seeing missing children’s faces in a pizza shop on the tip jar & on the pizza boxes. Even now I’m almost certain they still have a missing child image shown on the tip jar on the counter. It always makes me sad seeing the date when they went missing, some of them in the early 2000s & I remember some being from the late 90s. I truly do wish that all of them were just runaway kids or a parent or family member just taking them in the heat of things to then return them to safety, it’s such a sad thought to think that they’ll never be back home. Great video Wendigoon, thank you",
        "My sister was kidnapped a few year ago because of accepting a ride, not even from a stranger. Some of you might even know about it, it was pretty recent. Teen from NC got kidnapped and taken all the way to Mexico before she was found. Thankfully beyond all measure my sister miraculously was found but still.",
        "the blue dog mascot in the thumbnail looks like a pokemon",
        "I also note that we don't have square paper cartons anymore, either.  Milk comes in plastic jugs.",
        "Did anyone else hear that at 21:11? What the hell was that? Was it just from the music?",
        "My! The second child to disappear in Des Moines did so just two days after my birth!",
        "I was a kid in the 70's and 80's , we were so worried about being put on a milk carton.  There were so many children going missing!! Thank you for all your stories!!!",
        "HE PUT A AD FOR CEREAL ON THE VIDEO ABOUT MISSING MILK KIDS!!!!!!!!$!!!!!!",
        "The first case you talked about. There's a whole story about that. From what the mother has gathered he was put into a trafficking ring and some of the neighbors lied about what they saw",
        "Didn't this guy get lost in a cave recently?",
        "Is that a filter or makeup how's did you get your skin looking that soft and smooth",
        "ISHOWKISS, this stream changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience :'( :(",
        "Johnny gosh and eugene  Martin look them up eugene  was my cousin  but I never got to know him",
        "My parents grew up in Central Iowa and so did I, I definitely heard about Johnny Gosh. My mom sat my brother and I down one night and read us a book on stranger danger, and ironically we were just talking about it earlier tonight. She said my brother and I were polar opposites when it came to this kind of thing. She knew she didn't ever really have to worry about me trusting or talking to a stranger because she could hardly get me to talk to anyone but her and I ran from any unfamiliar situation ",
        "or as Jeffrey Epstein calls it, 'Tinder'",
        "this doesn't really relate to the subject but i would love it(and i bet a ton of others would to) if you could start posting your videos on Spotify again:)",
        "It’s so crazy to hear Eugene and Johnny’s story and A&E in one of your videos! It’s well known A&E lore locally so I’m glad it made it in!",
        "I love that Wendigoon always covers stuff I never really thought about. Like I knew kids were on milk cartons and suddenly they're not. So these videos are so interesting to me. And I love how he tells it. Also his sponsorships are hilarious so I don't skip them lol",
        "This topic is definitely something worth discussing, I know I was in great danger and went missing, my mom went to the cops but because I was an adult they just told her that they can’t do anything because I’m an adult , something has to be done but what would actually be appropriate , I still don’t know , the fact my mom couldn’t find me because I was 19 is absurd I wish she did or the cops could have …this is definitely a topic worth discussing about people missing who aren’t kids, every second is worth a life",
        "The film Summer of 84 has made missing children photos on milk cartons so incredibly sinister and creepy to me.",
        "As an old 80's kid, I can confirm. We were simultaneously panicked over & left completely unattended ",
        "This is the exact video that I was looking for. A video essay that is… so useless and so monotone, that I can fall asleep watching. Thank you so much for making this. You are appreciated",
        "It should exist now.",
        "Congratulations on 2 million subscribers!  ",
        "Can you talk about senpaku eyes?",
        "I'm very curious to learn about how and why a child was abducted by their Aunt's Girlfriend. Like... That's so specific but they added it to the chart so it's obviously happened more than once.",
        "glad to know I’m not the only one that just rips the top off like some ferral goblin",
        "not old enough for the milk carton era but i remember being really young, five maybe, and my mom left me with my baby brother in an aisle of the store to grab something and a random woman came up to me and told me to watch out because someone could easily steal him…i don’t know why she would do this but it scared the hell out of me lmao",
        "I was actually kidnapped by drugdealers when i was 3. My parents found me and we had to live in another state out of a car for a long time. I kinda blocked that out for a long time, and i developed ptsd and brainshocks and it took years to realize what was wrong with me but im told it was form years of sustained trauma. This whole thing lead to me just growing up with anxiety and depression and fucking brainshocks. As a kid i thought i was just getting dizzy, like super dizzy, cuz brainshocks make you feel like your soul is wobbling one way, your body another and your brain in a 3rd pattern at once. It can happen from turning too fast, running, trying to balance. My dad thought I was a pussy because i gave up trying to ride a bike and i couldn't climb the tree house ladder he built and i didnt like doing all the physical activities he liked to do.  The milk cartons did not help. I would get nightmares with the kids on the cartons. The panic culture of the 80's just left me damaged and broken and unable to get any real help because psychiatrists were seen just like strangers too, and i lived where i saw crime and shit so i knew how real the dangers were and I was paranoid about it happening and i made sure to learn to talk like adults so they dont see me as just another kid.  I never learned to relax or let my guard down. Lead to me getting bullied for being weird and not wanting to go outside and play in the places where parents cant watch.  My mom thought i was a bit of a stickler and a buzzlkill all my life, like how did she raise such a square.",
        "I’m surprised you didn’t go into the disappearance of Juanita Estaves, especially since you showed her picture.",
        "Bella Goth in the Sims 2 on a milk carton got me very intrigued about that whole scenario and I've always wondered why it doesn't happen anymore.",
        "So much AK Guy.",
        "15:52 so my parents were too old for the PSAs to effect them, and my brother and I were just a hair too young. Cell phones became commonplace for teens when I was in high school, but I got my first cell phone in middle school because my sister is disabled and if there was any emergency my mom could call me and let me know what was happening or I could call her if she was late to find out her ETA or find out if I needed to call my aunt who lived fairly close to the school to pick me up instead. I have a very vague memory of having a password for pick ups. But I'm talking early elementary school. My hometown was very safe. A quick Google search shows no known missing person cases involving kids from the town and the only adult cases were elderly people from a local old folks home, all of which have a high return rate because the police in that town get the exciting job of giving parking tickets at all the overpriced parking lots. Sometimes they have to handle break ins or package theft. But crime there is really rare.",
        "8:45",
        "Yeah the Johnny Gosch situation is still pretty decently talked about in Des Moines. Our news station ran a story about how police haven’t officially closed the case and that they still will go back and sift through the boxes of evidence they have.",
        "Americans put adverts on their milk cartons? \n\nSeems a bit dystopian.",
        "The fact that Sean killed Heimdall in one go with low heath was one of the most satisfying things weve all wanted to see.",
        "I was growing up in the late 70s through the 80s in the Bay Area California. I remember stranger danger and the Kevin Collins case that is still not solved, and the milk cartons. In 1980 a little girl went missing in Antioch California and she was found dead in a ditch on James Donlon Blvd. In Antioch just up the road from my house. I remember all the kids in school after that no longer has their names on their lunch pales or on their clothing tags etc. Also parents and grandparents began picking their kids up from school religiously. Stranger danger went \"viral\" as they say now. Come to find out years later, her neighbor next door to her in her apartment complex the guy who even was her baby sitter several times is the one who took her and killed her. Not a stranger.",
        "I remember I'd gotten an amber alert once in January about a child that had gone missing in October. It honestly hurt to see.",
        "I was born in '88 and thought that was something that only happened on TV, like people delivering milk to houses. No idea it continued into the '90s, but we always got gallon jugs so the only milk cartons I had were those small cartons of sour milk that came with school lunches.",
        "For a long time I've thought most of our pop stars are kids seen on milk cartons",
        "A lady tried convincing me to enter her vehicle back when I was 8 in the early 2000s in a small town in Northern Ontario. I was close enough to home that I assured her I didn't need a ride. She even tried telling me that she knew the secret password my parents gave her, even though we didn't have one. When I wouldn't get in she started to panic/grumble and drive away. When I got home my parents didn't say anything to me about getting a ride, so I just put it out of my mind. Over a decade later, while watching a documentary about a child abduction, I connected the dots. It is very surreal to think about.",
        "As a kid, my mother would put a milk carton on the table at dinner time. She liked to believe that a big glass of vitamin D milk was the perfect beverage to compliment, well, anything. I could not even put a number on the amount of dot matrix printed faces of kids my age that I looked at while eating my dinner each night. I haven't thought about it much, but now that you mention it, that was pretty weird. You can get used to anything, I suppose. Personally, I think that it made have made me less aware because it normalized the fact that kids go missing all the time by building an association with something as regular as my family dinner time. Business as usual.",
        "this just confirms a theory me and my friend had the other day:\nthe Nasa and big governments have knowledge about aliens and other weird stuff that we, the public, could never learn about. because if we did, it would cause a mass hysteria across the globe.",
        "I was born in 1984 and I currently get up at 5:45 in the morning COINCIDENCE????",
        "Dude, you got pretty lips... :)",
        "Damn it! Now I know my birthday is fucking missing children day",
        "I remember reading a book in school (it was fiction) about a girl who found out she was a missing kid when she saw a photo of herself on a milk carton. I wonder if I could find it again.",
        "The saddest stories are the ones where rebellious kids disobey their parents thinking they’re gonna be okay despite having ignored the warnings, only for the worst possible scenario to happen to them shortly afterwards. Like imagine being in their shoes, you just want to discover yourself and try to be a little more independent and you’re punished for it, you find out the warnings made sense but you’re not going to live to learn. These stories sound like fabricated cautionary tales for how quickly things go wrong.",
        "You know Jack's having fun when's he's banging out so many games at once good lord. I haven't even started Ragnarok yet >:O",
        "chicago, i keep forgetting in those days it wasn’t ghetto trash. what a shame people can turn beautiful areas into when they are given the chance to live there.",
        "When my mom was a little girl (around 6-8), her and my grandmother was walking in a airport to come back to the states. A lady started walking alongside them, grabbed my mother's hand, and tried to guide her off in another direction. Thankfully, my grandma was quick to notice this and stop her",
        "Useless information? Depressing? Golly! That's all you had to say to sell me on watching this video!",
        "what a sincere apology! i am so certain this will not backfire at any point in time at all",
        "Etan Patz is sadly dead. In 2012,Pedro Hernandez confessed to luring Etan into the basement of a bodega and began attacking him. His remains were never found and another culprit named Jose Ramos had a relationship with a woman who was hired to walk Etan home from school. He was basically considered a suspect for a long time. I don't know much more but that's all I know.",
        "Having clear, healthy skin, that's just the beginning. There are some forgotten home remedies that can help you get rid of shingles within as little as 3 days. Kaena Ramingler's latest stuff exposes one of these remedies, maybe try go'ogling her to see if it can help you as well.",
        "Whoa, was that a real desert eagle or was that an airsoft?",
        "I cant belive that someone made an add entering",
        "He’s laughing and joking about this... I hope it’s never his child that goes missing! A little respect goes a long way...",
        "Want to freak out as a parent, keep watching.",
        "My mom ran off with me in one of those domestic disputes, we were gone for a few years. I still have my missing child postcard somewhere lol. It’s cool to hear about all these things surrounding the milk carton phenomenon",
        "You should look into Thomas Ligotti. He’s a lovecraftian author who also writes philosophy. His book “The Conspiracy Against the Human Race” was one of the basis for the tv show “True Detective”.",
        "Not very happy about this memory popping up, but when I was a child, we used to go to Christian camp against my will, and we learned about stranger danger there around the campfire from our pastor, who made us terrified to walk back to our tents",
        "Vikk slaying milk but falling to Danny. Quite the turn of events.",
        "One of the best things is that he never takes credit for himself when he achieves something. He always respect us, the audience, and his team, and he is always polite in all of his videos. We congratulate ourselves on this achievement. More to come and everything to come",
        "Damn will that cereal bring my dad back from the store too? ",
        "As someone old enough to grow up during this. In theory it's a good idea especially before the internet to get the faces out there but in practice I guess not so much due to everything stated in this video",
        "Good video",
        "Growing up as a millennial, my mom was always terrified of me being randomly kidnapped and constantly gave me speeches about it. Now I understand.",
        "My dad (born in 67) once told me a story about a time he hitched a ride home after school. The guy drove him out of town and dropped him off on the side of the road as a lesson to not hitchhike (this was the 70s, it was a bit more acceptable at the time)",
        "While on holiday in Washington (state) when I was seven we were on a ferry when I got separated from my dad. I wandered about and at one point a man asked me where my parents were and I said I didn't know so he said he'd take me to them. We ended up going down (I vividly remember reaching the level where all the cars were parked) when suddenly another man appeared on the stairs below. The man I was with just abruptly turned and walked off and the new guy was confused as to how I managed to get so far down on my own, but he took me back upstairs to the nearest shop to call my parents over the intercom. To this day my family only know of the 2nd guy finding me. As a kid I didn't think much of the first one, but as I grew older realization dawned that he'd been taking me AWAY from the crowd, down to storage levels, and that he ran off to avoid getting caught, and it scares the living daylights out of me. I never will tell my parents about it because I don't want that What-If weighing on them.",
        "As someone who got to know Wendigoon's face through Internet Historian's Hole video...I am having a very indescribable type of intrigue watching him talk ",
        "Skip to 4:08 to get the the part of the video you actually clicked for",
        "I grew up with the missing children pics on mail, milk cartons, and billboards. I can confirm it was weird and traumatizing.",
        "I was born in the early 90s and remember this being a thing when I was young.",
        "My parents used to tell me that if I didn't drink all my milk at breakfast I would be in greater danger of potential abduction. As a kid this sounded sort of crazy. But all these decades later, having always finished my glass of milk as a child, I can attest to the fact that I was never abducted. Thanks mom and dad for the sound advice. Sorry I doubted you.",
        "I distinctly remember our \"stranger danger\" class when I was about 6 or 7. The whole day was blocked out and each class brought in to a room to get taught on how to stay safe. It was very weird as a child.\nEta: I just remembered they took our fingerprints too, in case we went missing.",
        "This video is dumb and downright absurd. I think these YouTube creator run out of ideas and out of shocking videos like this. The issue isn’t the program of putting kids on milk cartons. The problem is the crime. Kidnapping young kids is a crime most kids won’t survive. 99% of kids kidnapped and not recovered in the first 48 hours are never recovered. The kids put on these milk cartons are kids that were missing for months or years so the odds of finding them were always low. Just finding one kid from a milk carton would be like winning the power ball. Still it’s better to post the pictures on milk cartons than not. The argument that it desensitized people is literally absurd. Do these people think it’s better to not look for the kids? I don’t get the argument here. This might be the dumbest argument of all time. Putting a kids picture on a milk carton doesn’t guarantee they will ever be found. It does in tease the odds tho and nobody would argue this even if you hated milk. I can’t even believe a video like this exists.",
        "Hey just so you know, Etan Patz’s name was pronounced ee-tahn pate-s!",
        "Children paranoid about missing kids on milk cartons: oh shit we better shop\nChildren with severe paranoia, fear, and trauma from shooter drills, guns, and shooters: eh",
        "They also use to have them in junk mail in the entrance at Walmart  UT have notice if they still do it",
        "Really interesting video. My dad actually has a few story's of seeing his own face on milk cartons as a kid. Apparently really awkward .",
        "Just found your channel thanks to ‘the algorithm’ your shirt in the sponsor portion earned me a sub. Don’t disappoint!",
        "It’s better to be paranoid then to be kidnapped",
        "your skin is actually amazing please drop your skincare routine",
        "Hearing about missing kids always terrified me. Especially cases where there were no clues or evidence. They just disappeared and were never seen or heard from again.",
        "I had a man come up to my grandparents back yard fence . I was about 4/5? He literally pulled the whole “I’ve lost my puppy can you help me look for him “ even at 4 that was off to me . I said my mom was calling me and I ran inside . Very creepy . Why would you ask a 4 y/o to help you look for something if there wasn’t ill intention?",
        "Wendigoons ads are getting more and more fun and i love it! It makes me much more inclined to listen even if I can't buy them.",
        "How is it skin so clear",
        "Honestly \"stranger danger\" has made so many people needlessly terrified of letting their kids go out into the world and now all these sheltered children are adults who freak the fuck out when interact with them in public.",
        "Wow",
        "Dude either has perfect skin or really excellent lighting... or both.",
        "It can't just be me that is Soooo tilted bc he keeps saying \"milk Cardons\"......🇺🇸",
        "god i live for the \"thank you for watching.\"",
        "I would LOVE for you to do a video on the Johnny Gosch case. It's one that has fascinated me for years and leaves so many unanswered questions. Would be cool to see you dig into it!",
        "K y s",
        "Lmao had to get that “minority kids went missing worse” white knight",
        "My Auntie was one of many adults who taught me stranger danger. It doesn't matter how nice someone is, if they have sweeties, whatever, so not talk to a stranger. Flash forward to 20 years later she is in the bank and a little girls comes up to look at her sparkling bag. The mother sees her speaking to a stranger and pulls her away telling her do not speak to strangers. My Auntie was very offended by this because she doesn't 'look like a kidnapper'. Crazy.",
        "I remember going to the grocery store and being anxious about seeing the creepy conspiracy magazines. Like batboy. And for some reason the missing children flyers were at perfect level with kids on the side of the checkout counter and doors.",
        "I grew up in that era. It's specifically why, years later, my buddy bought an unmarked white windowless van (used work van with decals removed). \"Wanna come aboard the Stranger Danger?\" Was one of his many cheesy pickup lines in college, dunno if it ever worked (probably not because he would've bragged). What I do know is it served us well tailgating at metal shows. Also: GWAR!",
        "There was a whole YA series back in the day built on the idea of \"what if you looked at a milk carton and saw your own face?\" (except that it went on to get a whole lot weirder from there ) But yeah it was unsettling as a kid to imagine that scenario, of having to ponder whether or not your entire life was a lie.",
        "I love how proud Wendigoon is of his well deserved accomplishments. It's nice to see a content creator who truly appreciates his audience.",
        "To me Johnny Gosh looks exactly like a young Jim Bob Duggar",
        "i think i've seen this guy somewhere, hes so familiar. must be in a cave or something.",
        "Did you shoot that buck wendi?",
        "W",
        "If the milk carton kids scared you when you were a kid, ill bet you got bullied pretty bad didnt u?",
        "we were kids in the 2000s, but my partner grew up in the city in a pretty rough neighbourhood and his whole life his mother would tell him horror stories about kids being abducted, would regularly tell him that \"people want to hurt you\", and though he wasn't allowed to watch anything PG-13, she would show him true crime cases (and fake ones) all the time. His street was blocked off one night with helicopters overhead pointing lights at the bushes in his yard where a suspected murderer was hiding. He's had strangers walk directly into his house while he was home alone... Today he has major anxiety, and the first thing he does when he gets home every day is check the bathroom, shower, balcony, and behind the doors to see if anyone is waiting there for him. Doesn't matter that he is 6ft tall now and covered in tattoos, no one's gonna scoop him up, it's still on his mind. ",
        "The whole “Dad never came back from getting milk” joke takes on a whole new dark meaning.",
        "Amazing, the statistical anomaly that this comment section is - so many 'almost abducted' people!",
        "Man I grew up with the stranger danger lessons in school and I’m a late teen! Was this really outdated for me to learn in the mid 2000s?",
        "Hearing that someone your age is missing is scary. I just now heard that a girl from my school who went missing on Nov 1st’s body was found in the next county over. I didn’t know her, but just hearing this makes me feel broken",
        "The Eugene and Johnny situation makes Family Guy's Herbert the pervert even worse",
        "Have you considered making an indepth video on the book roadside picnic? It's really good and I don't have the capability to understand the themes.",
        "simpsons, millhouse",
        "Woah, sweet. A hidden video. Love your channel man!",
        "I mean, it's not bad that the milk cartons encouraged kids to go home",
        "The Johnny Gosch story is pretty wild. The way they treated missing children was to assume they were just runaways, the police force seemed pretty corrupt, there was this whole child trafficking ring going on and Johnny actually visited his mom later (to essentially tell her that he's okay but will have to go into hiding) and was never seen again. She still makes it a point to put up his missing poster, she's also the reason missing child cases are treated differently today.",
        "I felt/feel so bad for Evelin. If I remember RE7s story correctly she was just a girl who had her life taken away by an evil corporation. She rapidly aged due to their experiments and couldn't get that life back. It was so cruel to her, so I can see the resentment and anger, although unjustly aimed at Rose, I understand why she's so mad.",
        "Wendigoon seems like he’s not a parent yet. Becoming a parent changes you things you thought silly or things you’ll never do or say to your children one day. Once that baby is born you immediately understand things that you thought were weak or overprotective, for example a lady wanted off work to take her kids to school the first day and I thought that was just crazy. A year later as a new father of twins I went back and told her that I was sorry I just didn’t understand and I’d gladly eat my crow and admit my ignorance lol .",
        "Magic spoon is depressing though'",
        "Bro 3 minutes talking about cereals on a missing children video",
        "One of my classmates at LMU told me that you're an LMU alum! I've watched you for years, so that's pretty cool! :)",
        "This guy is sus",
        "if this was still being done nowadays then i'd ask my mom to report me as missing, and then buy multiple cartons of milk with my face on it",
        "My mom remembers the first milk carton kid. It'll be nice, in a way, to learn more history of that time- and maybe I can share this video with her, too.",
        "Wendigoon, you forgot to mention why AMBER Alert exists in the first place. On January 13th, 1996, 9 year old Amber Hagerman was kidnapped while riding her bike in Arlington, Texas. Two days later, she was brutally murdered and her body was later found. After the tradegy, her parents were so grief strickened, they never wanted something like this to ever happen to other parents. Along with law enforcement, they established AMBER Alert and states began adopting the system because it was so effective. Although her death was a tradegy, we can thank Amber Hagerman along with her family for AMBER Alert so that her legacy, memory, and that her death has led to a system that saves many missing children so that hers may never be repeated for most children gone missing reported by the AMBER Alert system.",
        "You definitely shouldn't downplay the issue just because it was a smaller number than you were expecting. All it takes is one good opportunity to a predator and your child is gone forever. I used to ride bike trails by myself as a child; while my parents didn't care, they should not have been letting a 13 year old girl biking by herself.",
        "I was born 1988 and my sister in 1990. Our mom taught us a whole phrase instead of a password. I'm grateful to have grown up in safe places.",
        "I remember the first time I was allowed to go to a cashier by myself in a Walmart, directly across from me was a giant wall of missing children and it scared the hell out of me",
        "Yeah I was a missing kid once. Parents split and I was taken. My father literally became a private investigator for awhile just to find me and he succeeded!",
        "Keep on making  those amazing videos........love you guys!!!!!",
        "I get that some children may have been scared but isn't the program worth it even if only a few kids are rescued because of it? Plus, if it helped make parents more careful with their children then it's a win-win scenario in my view. Amber Alert seems to be much more helpful though.",
        "Idk, I grew up in the 80's and I was nearly kidnapped  three times..so perhaps the stranger danger thing was legit.",
        "I have a recommendation, you should do a video on 2Pacs murder and the conspiracies with and Suge knight and Biggie Smalls.",
        "I was just talking to my husband about this and why it’s not a thing anymore. I’m reading a book (Imaginary Friend by Stephen Chbosky) and there’s a little girl that’s missing and she’s on the milk carton. Not sure how that ties into the main plot yet but we’ll see. TLDR: Great timing posting this! ",
        "If Bonny's step dad probably wasn't so over confident bonny wouldn't be saved .",
        "Much to my mom's chagrin, I was never abducted.",
        "Can you make a video on that time the Philadelphia police department bombed the US in 1985?",
        "i remember when i was like 6 at the waterpark, 2 suspicious women asked if i wanted face paint, i ran as fast as i can to my dad in the mens restroom. maybe it was actual facepaint but they were at a random corner very far from my dad",
        "Oh yuh Wendigoon hit 2 Mil",
        "8:02 Walter white",
        "Wendigang about to hit 2M, such a GIANT monument for our humble storyteller",
        "Concerning those 115K “stereotypical” abductions:\n•The peak population of the U.S. during the '80s was between 230M – 250M.\n•The proportion of children aged 14 and below in the U.S. was between 15% – 22% of the general population.",
        "Magic Spoon is gross af.",
        "My dad actually lived somewhat near Johnny Gosch in Des Moines. He was also a paperboy and after he disappeared my grandpa followed him in his car. My grandma still tells stories about what happened afterwards.",
        "Can you do one about Hands Across America that happened in 1986 I believe. I haven't found much on that but know that it didn't turnout the way everyone thought it would.",
        "I am currently 28 years old. When I was 6-8yrs old, a man I had never seen before approached me at a place I was familiar with and said my parents were looking for me. He offered to drive me back to my parents. Even being a child, I still said \"no I'll ride my bike back home.\" After years(almost 10 yrs) of not thinking anything of that incident, I told my mother. She cried. Never would she ask for a stranger to pick me up. I think back to that moment often. I joke now, but I could've been another one of these children. Missing forever.",
        "This is torture. My longing for magic spoon grows with every video but they don't ship to germany",
        "Even if it worked,I doubt it would be a thing today even if it worked because of technology and Amber Alert created in 2000",
        "I remember being told “you wanna end up on a milk carton?” As a kid and not really understanding what that meant. Now we just post them on the wall at walmart. Keep up the great work brother.",
        "I'm honestly, legitimatelly surprised they don't have themes for when you drop in. I may be a sucker for CoD speaking from nostalgia, but those fucking themese are so iconic to me, they gave so much character to the factions and let you put yourself in the mood for waging (a tiny) war.",
        "The crazy thing about this is that this entire mindset literally NEVER went away afterwards. I grew up in the country and then moved to a suburban area in the late 90s. There was always this weird, unsubstantiated fear of kids getting plucked up and abducted by some mega creep murderer or something. I've tried to be more realistic with my kids, but my concerns usually lie in other kids rather than adults. I don't think a ton of adults are really going out to attack or abduct kids. There are some, of course. But kids are much more likely to be hurt, exploited, or worse from other kids in the peer group preceding their own (high school kids tend to prey on middle school kids and so on.) It's hard to calm yourself down when your kid's gone longer than they should be when they're just starting to gain independence. But it's also worth remembering that sheltering or stifling then will do far more harm developmentally than the miniscule likelihood that they're targeted by some panel van driving predator. Plus, you can always teach your kids to defend themselves. I teach my eldest the use of pepper spray, knives, and the people around them to help ensure he knows what to do if something bad should happen. But when I think back to the things I had to deal with and all the horrifying situations I've found myself in, I definitely understand the instinctual protectiveness.",
        "I was kidnapped by my mother and her boyfriend at a young age and I didn’t even realize what was going on. I nearly starved to death. She’s very mentally unwell and I was adopted prior by my grandparents",
        "That was a neat topic.",
        "Anyone else coming back to rewatch all the old videos and him somehow still making you laugh while you're crying?\nTechnoblade, the myth, the man, the legend, will never truly be gone in our hearts. Rest in peace king  8-)",
        "Milk cardon",
        "My sister has actually had several instances where she's had to run from people who have jumped out of a van to get her. There was also a time where an officer offered her a ride home late at night and then asked for a sexual favor outside of our house. Yeah they're not around every corner but the danger is still around. Keep your head on a swivel and keep your children safe!",
        "Wedigoon looks like the AK Guy",
        "I grew up on stranger danger as a kid and whenever I would go out with my parents to the grocery store or something I would be terrified of everybody around me and whenever somebody would walk past us, I would immediately grab the nearest thing so they wouldn’t take me. I’m still kinda paranoid of being at home alone.",
        "i still remember the “password” my parents gave me, they forgot to give it to my grandpa once and it caused a scene at my church",
        "In Mexico during the 90s we had the equivalent of the milk carton program in the form of a public service ad on television broadcast in the middle of the evening cartoons. It had the same emotional impact in us kids.",
        "Reminds me of those facebook missing person posts that encourage you to share it. Most of those are made by abusers where the victim managed to run away and change name and those fake missing person posts kept ruining the victim's life. This is why no one should share those where they give a random phone number instead of telling to call the police.",
        "This is my favorite kind of Youtube content! One of my new favorite channels for sure.",
        "While it is unfortunate that these kids went missing I was going to suggest that you move to Florida so that when you are arrested the news headline would be \"Florida man steals cereal\"",
        "I like that there was a warning about the video being depressing right before the Magic Spoon advert- depressing indeed",
        "it was all a bunch of bullshit!!! i live in Connecticut and always wondered why the milk companies or the carton makers never showed images of kids missing from Connecticut or the surrounding states, always kids from the west and southwest, then i saw a childhood friend on the back of one so i called long distance to tell his mother how sorry i was to hear of his disappearance and my supposedly missing friend answered the phone, it is and always has been a false flag idea to place the fear of missing children into the minds of americans to keep them home keep them off the streets",
        "I feel like this highlights the problem with stranger danger. It seems like it’s basically illegal to let kids play in the yard nowadays even with parent/guardian knowledge. So basically terrify children out of playing outside, and every stranger is a murderer or something. And this is the problem with John Walsh. He encourages this fear and false stats on missing kids",
        "i think another important point to make about the decline of missing children on milk cartons is the fact that most milk nowadays comes in plastic jugs that usually don't have anything else printed on it besides the label. sure there's still some brands of milk that are sold in paper cartons but at least for me growing up in the 2000's, my parents always bought milk in plastic jugs. so while amber alert was like the main reason why missing children on milk cartons declined, the rise of milk in plastic jugs sorta sealed the deal",
        "I adore how much more crazy Wendigoon is in his ads. Like the \"ethically sourced\" as he holds up a pistol and quickly puts it away killed me the first time",
        "All fun and games until you see your child’s name on the milk carton",
        "Ending up on the side of a milk carton was a legit threat when I was a kid..! \nI remember reading a book in middle school called “the face on the milk carton” about a chick that sees her younger self on one while eating lunch in high school. Chaos and angst ensued- it was great when I was 11!!",
        "My town's newspaper still has something similar in every issue - a small banner at the bottom of the back side, with information on a child in the NCMEC system, typically accompanied by an age progression photo. I wasn't around for the milk carton kids but I still remember the newspapers having that banner when I was younger",
        "This video landed you a new subscriber because random history facts like this is up my alley",
        "A girl my age went missing in our neighborhood when I was little. My mum never let me out of her sight, and told me terrifying stories of what ~could~ happen to me. I believe the perpetrator was discovered a few years ago, may he rot.",
        "Keep goin with the content its very good and Ive always been happy when you post",
        "did you seriously buy all those boxes and eat them all ",
        "I'm actually one of Etan Patz's relatives, he would have been my second cousin (I was born exactly 16 years after he disappeared, May 25 1995). So imagine my surprise to see a youtuber I subscribe to talking about this! To correct your pronunciation of his name, it is actually pronounced ay-tahn paytz. Other than that, thank you for accurately portraying his story and informing people about this topic! It took 38 years, and inadvertently brought down an unrelated child molester along the way, but finally in 2017 we were able to convict the man who killed Etan. His disappearance is still sad though especially for his parents and our older family members, but we are grateful for all the good that has been done through increased awareness in the years since, even if some efforts didn't go as well as planned.",
        "Now they show missing kids on the back of the newspaper.",
        "Missing Kids on Milk \nCartons, I Saw that in \nOld Movies, And Shows, \nIts so Creepy,",
        "To be honest the stranger danger thing was kind of useful to me living (sometimes homeless) in Eastern Europe after the collapse of the Soviet Union, a lot of really bad people out there",
        "My newspaper still has a small tab for missing people (mainly teens)\nI questioned the actual effectiveness of it due to some of the gone missing dates being from the 90’s \nPretty sad to be honest",
        "I would listen to a podcast if you had one",
        "I’m an age where I remember hearing a lot of jokes about kids on milk cartons, but I never remember actually seeing a milk carton with one. It was interesting to actually hear the history of it.",
        "Bonnie: sees her own face on a missing carton milk advert I just think they're neat.jpg",
        "i remember going to walmart and seeing “have you seen me?” posters, with lots of kids on them. some of them had been missing for a very long time, and they used some software to approximate what they would look like in the present day and put that next to the photo of them from when they went missing. it was very disturbing",
        "i remember back when i was in grade 6 i believe (currently grade 11), i would bike to school with a friend or walk to school every (about 10-15 minutes, just a straight line on a very active road, lots of kids did it).\ni was walking alone with my ipod touch or my mp3 player, when someone who i didn’t know pulled beside me. it was a middle aged woman, all of her windows were blacked out",
        "I was raised in the \"stranger danger\" era. Maybe I was overly sensitive, but it absolutely ruined my childhood. I was terrified of everyone, thought everything was poison, and believed that couples without children had simply murdered them. I was even afraid that my wonderful, caring parents would kill me. It wasn't good.",
        "Side note: I can't imagine how the parents of these children feel when their child does something without them just once and they are gone. So heartbreaking",
        "It's GOSCH. Not Gorsh. Smh.",
        "3:35 hehe very radical love ya as always wendigoon",
        "Wendigoon, your channel has helped me battle crippling alcoholism and depression. I've lost the battle but I am entertained and informed.",
        "so glad Wendigoon survived exploring Brown Mountain Lights 2 weeks ago, all this time I thought he was a sitting entity with no legs",
        "They also used to send out flyers in the mail. Those also got faces out WAAAAAAYYYYY to late. By the time we randomly received one with my sister's face on it she had already been found and it was 2 or 3 years after she had disappeared. In 1992 when she disappeared too many people were worried about the \"white vans with scary men\" to realize the real monster was just a few doors down.",
        "i had stranger danger so deeply ingrained in me that one time at costco when my mom was buying us pizza after shopping, i LITERALLY screamed “bloody murder!” repeatedly at a lady who sat at a table next to ours  i thought anyone i don’t know getting anywhere near me was call for yelling in fear ",
        "I mean I think it’s actually a bit important to speak to kids about stranger danger and also trafficking maybe even incite a bit of fear. I myself and family members have almost been kidnapped before as children and also pre adolescents. I think it can very well happen to anyone and that people should be very afraid and always prepared.",
        "23:25",
        "@17:36  this sounds eerily similar to what they did with C-19",
        "Will there be a video about the MFP announcement?",
        "Can you do a video on Skinamarink? Or anything made by Kyle Edward Ball? I haven't really seen many people talk about it and I am mostly interested on your take.",
        "Partway through: just gotta say the first kids story sounds like some horseshit in one way or another: you're telling the the very second the dad isn't specifically watching over the kid he gets abducted? Next you're going to tell me the very first person to think to drink and drive killed 17 kids in the first two blocks. ",
        "The thumbnail look like it came from mandalas catalog ngl",
        "What facetune software do you use?",
        "Personally I grew up deathly afraid & paranoid that I would be kidnapped and it's affected me to this day with my own kids.",
        "When your child disappears, you as a parent always hope that he or she is fine, will be found and will return to you unharmed. However, the reality is often quite different, the idea of sharing the picture of the missing child everywhere is good, but if the child is already dead, such an action is useless. Wendigoon addresses the issue a bit, especially it took a while for the pictures to be printed on milk cartons and circulated in stores.",
        "Imagine being a parent of one of the missing children, going to get some milk and just seeing the face of your child on a carton of milk.",
        "I can't believe the majority of the comments section and even the uploader of the video are saying that you shouldn't do anything to help missing children. you're all terrible people.",
        "Aside from the milk carton thing, I ALSO remember, on television, the — “It’s Ten O’Clock.  Do you know where your children are?”",
        "I wonder if this was the inspiration for Stranger Things?",
        "I remember the good old days when they did this. Too bad I can't use the cartons as keepsakes of children I had in the basement.",
        "This is legit stolen from the 99% invisible podcast.",
        "Please don’t ruin my depression with your upbeat sponsor ad.",
        "I shouldn't have watched this just before bed",
        "I'm a child of the '80s, so I remember that era of fear. I grew up in Chicago and had a couple of paper routes in the late '80s through the early '90s. I started just before a turned 8 years old and my mother never let me deliver them alone until I got a little older. Even then, I was allowed to carry my buck knife with me, and on a couple of occasions I had creepy guys try to call me over to their cars. Each time I told them to f*ck off, but one was very insistent, so I brandished my knife and told him not to f*cking try me and he peeled out.",
        "has anyone pointed out that he always says “whenever” instead of “when” for some reason",
        "@wendigoon please make a video about The cremaster cycle!!!!",
        "I’m glad Jon snow could teach me so much about milk children today",
        "Useless information is why I'm here at 3 am",
        "I was just talking to my friend about how affected and fucked up i was as a kid reading the face on the milk carton i was so scared of being a kidnap baby despite looking like a computer generated version of a mash up of my parents faces. But still what if",
        "This definitely makes me want to put a tracking chip or something in my kid now and never let him do anything alone. Ever.",
        "The podcast You're Wrong About has a good episode on the stranger danger panic.",
        "I love that sponsor deal lol",
        "I remember one day we were at my Mum's best friends house, and I was playing tag with my sister and her kids. They ran away, and I tried to follow but lost track of them. I then realised I didn't know where I was. I was wondering around the area for about an hour trying to find my way back home, my Mum was raised during the 'stranger danger' epidemic and had always instilled in me never to talk to strangers or go anywhere with them. These kids my age were on scooters and offered to help me when I told them I was lost. But I freaked out and said no because of the 'stranger danger' my Mum had instilled in me",
        "I turn off amber alert. Freaking annoying.",
        "Bro can you do full tank Volibear Jungle ? =:-*",
        "\"Everything around you-\"\nRANDOM 50CAL\n\"has been ethically sourced\"",
        "i'm in my 20's and my mom still gets the \"have you seen me\" sections on the mailed ads. very much still a thing in mailed ads in the midwest",
        "The only lie this man has ever told me is that Magic Spoon isn't useless and depressing.",
        "my dumbass would try and collect them like pokemon cards",
        "I wouldn't be surprised if racism was at play, but also remember that this was the 80s. We're talking about the USA when it was overwhelmingly white.",
        "Hey Wendigoon could you do a video on Bruno Antony from “Strangers on a Train”? He’s one of my favorite villains and peculiarly disturbing. Love your videos!",
        "I feel like I remember hearing the story of a missing child that involved the captor raising the child and being a parent refused custody or something. Saw the kid on the carton, thought they'd lose custody and get caught and killed both themself and the kid and that it was a morbid example used to justify the program shutdown. Now I wonder if it was just morbid copypasta from an edgy place or a real event among the tragic tales of the milk carton kids that never came back.",
        "2 million+ views in 10 days with 2 million subs is a great sign of a genuine healthy channel. Way to provide GOOD content that isn't reaction content. You deserve it.",
        "growing up, my cousins and i would stay at my grandparents house while our parents worked. the backyard was up against this somewhat busy road, and i remember one day while we were playing, a man pulled over and started talking to us. i thought i recognized him as my uncle’s brother in law, so i was friendly back to him, but then my cousin (mind you, i was the oldest) shouted “stranger danger!” and we all ran away into the garage, screaming and laughing like it was a game. it struck me though, that i might not have known that man at all and he could have had ill intentions. luckily my cousin remembered what we learned and possibly saved our lives",
        "them magic spoon best make me trip !",
        "my parents often told me to not trust strangers, but even at a young age I knew family members and relatives were the worst offenders. i saw many parents and relatives who were addicts of various vices or just plain loose in the heads and were neglecting and beating their kids to say the least. this was only considering what they did in public.",
        "Insanely interesting video. Thanks.",
        "After being in charge of safety for over 6 years, I can assure you that no one actually reads signs.",
        "My mom used to tell me about stranger danger, not to follow people in vans.\nWhat she would tell me and explain were the strategies used to lure children.\n\nWhat she told me that was most effective however, was her own experience.",
        "There's a book called \"the face on the milk carton\" where the main character sees her face on a carton while at school. It's a good read",
        "So pretty much the amber alerts of the 90s",
        "Watching this while working on an essay about alcohol and drug addiction. :)",
        "That stranger danger thing never went away, it just became a vague cultural paranoia.  I've heard stories of parents having police and cps called on them because their children were playing alone in their own yards.",
        "The truth",
        "Thank you for saying Des Moines correctly ",
        "my parents grew up in the 1980s. i was never allowed to go trick or treating unless my they were walking with me, i couldn't play outside without them supervising me, i couldn't even take my dog for a walk in the neighborhood until i was like 15. the reason? not because they thought i would get lost or hit by a car, but for fear of abduction. now it makes a lot of sense. but hey, at least they care!",
        "I grew up in the 90s. My mom would buy milk by the gallon in jugs so I don't remember ever actually seeing pictures on milk cartons, but I was aware of it. And yes, we were constantly made to think there were tons of people everywhere that wanted to kidnap us. But at the same time we lived in a really small town where that stuff \"didn't happen\", so we still ran the streets all the time. Actually, it didn't happen. I don't think anyone in my home town ever went missing. Or at least not any kids when I was growing up. It was a small town so all the kids went to school together and we all were aware of each other if we didn't actually know each other personally so we would have heard of a kid disappearing.",
        "Great episode, have you heard of Ghostwatch? I think it would make for some good content",
        "I always wonder why I never saw them in real life but I've seen them everywhere on cartoons.",
        "The Missing Children Milk Carton Program should become the Missing Dads Milk Carton Program.",
        "I wouldn’t go down the milk section of the store when I was a child.",
        "the johnny gosch story is a very interesting one and i’d love to see a video by you explaining the whole case and everything that went down",
        "As morbid as these videos usually are they always make my day a little bit better",
        "my parents both grew up in the 80s, so when they had me in the 2000s it was hammered into my head to never talk to or go anywhere with anyone who wasnt my immediate family. \ni remember not being allowed to go to a playground with other kids down the road or go to classmates houses in elementary school and as a result, i was basically isolated from my peers in school. i wasn't even allowed to be in the backyard or garage by myself unless someone was monitoring me. my classmates were always surprised when i told them.",
        "I think the stranger danger generation is why my generation will not answer the door unless we are expecting company and will not answer phones or emails unless we are anticipating a call or email. It's definitely overly paranoid but I do wonder how many door to door salesmen we removed from employment.",
        "Wild to me that I didn't get kidnapped as a kid lol\n\nLike apparently I loved hiding in the racks of clothes at Walmart and I did it one day and my parents started to panic and run around the store looking for me, but I didn't know this and thought they just left me. So I slipped my hand into some woman's and asked her to be my new mommy bc I liked her sweater. ",
        "I remember them. I was in my 20's in the 80's.",
        "I would see them on my milk at school in like 4th grade :')..",
        "We going to talk about how we needs more than 12 cereal boxes a month ",
        "Growing up, I remember Walmart had a huge bulletin board (usually near the washrooms / customer service desk area)\n\nIt was a big compilation of missing kids-when they went missing, what they may look like now. Etc, etc. It scared the absolute crap out of my tiny self. Most of them had been missing since the 70s, 80s, or mid 90s, and while I was young I wasn’t too young to understand they were probably never coming back at this point. ",
        "It would help a lot if you could also put some sources or links from where you compiled such interesting information! Great video as always",
        "\"This is Bobby Lawton\"\n\nThe fact you were one letter off from my name is eerie",
        "Hi Wendigoon!\n\nI found a book you might be interested in covering someday. It's an old puzzle book from the 40's called Cain's Jawbone. The idea is that the 100 pages are printed out of order and you have to put them back in order and figure out the 6 murders that take place in the book.",
        "Watch Skinamarink! It kinda gives me Mandela catalogue vibes (though not exactly)",
        "Dude, \"Stranger Danger\" saved my life! \n\nWhen I was 12 or so, I was at a local creek swimming with my father and sister. My father and sister wandered off, and this short, skinny guy came up to me in the water and asked if I could come to his van to help with his \"puppies\". Like any kid in the 80's, I was paranoid of strangers and this was the classic \"Guy with a Van\", so I raised my voice and said, \"Hey Dad, this guy wants me to go to his van\". My father wasn't around to hear this (go figure) but that guy freaked out and took off. ",
        "Are you certain the White communities didn't just care for their missing more, and organize efforts using a different cultural paradigm?  And which ethnicities and income brackets are we talking about?  The 'blame whitey' schtick is a bit old.",
        "My grandma really instilled the fear of strangers in me. I remember someone pulling up in front of my home and stopping. They didn't call out to me or anything, they were just looking at the house, probably knew someone that lived there before. But it scared the shit out of me and I ran inside and hid under the table. \nMy grandma used to always say \"If someone tries to kidnap you, kick and scream as loud as you can and try to kick them between the legs\" I remember that sticking with me for a long time. Funny enough, whenever I'd say something along the lines of \"what if I get kidnapped?\" my mom and dad would always just say \"they'll bring you back.\" because I was so annoying hahahaha",
        "Lowkey this guy is hot?",
        "Related to the topic, ghislaine maxwell is the first person convicted of trafficking children to apparently nobody in particular.",
        "I'm not American, but I did always see the milk cartons in american media and wonder about it, so thanks for satisfying my curiosity  Unfortunately, while the stranger danger is still real, you're correct. Whenever something bad happens to a kid, it's far more likely that it came from someone the kid already knew: their family, the family's friend, that one guy from dad's work, etc. And yeah, there's a very small window before their chances of survival plummet completely, and it probably took too long to print those milk cartons for that :( But strangely enough, I've always kinda been under the impression that the milk program was for all kinds of missing people, not just children. I wonder if it'd be more helpful if they went with adults instead; not that it matters at this point though.",
        "The \"Stranger Danger\" stuff has prevented my mom from letting me out of the house except for school and family trips. They even have bells on the door to prevent me from leaving. I live in a massively low-crime area, nothing has ever happened around my house. I'm barely 2 years from being a legal adult. I'm legally allowed to get a driver's license, and yet I'm not allowed to walk less than a mile to the grocery store.",
        "Imma be honest, as a Brit who was only exposed to america through American YouTubers and tv shows as a kid, I genuinely thought these were still around and just people bought box cartons less nowadays because big plastic cartons/jugs were more efficient, cost affective, and lasted longer",
        "I grew up in the early 90s so this wasn't a thing when I was a kid. However, my mom instilled the fear of God in me when it came to missing children. Every time we went to Walmart she would take me to a wall before you went in the store. It was a wall of missing children posters. She told me I'd end up like them if I ever wandered away. This terrified me and affected me more than she knew. I became so paranoid and that parinoia stayed with me into adulthood.",
        "U didn’t have to call me out for liking content about depressing useless information",
        "As a child in the 80s,  I was abducted by circus clowns entertaining at a mall in Toledo and throughout the ensuing decade was regularly featured on the side of milk cartons in the midwest. I spent my formative years traveling around in a VW Beetle with a dozen buffoons crammed inside. I was trained in juggling, balloon animals, playing the ukelele and picking pockets. I eventually escaped while we were working a mall in rural West Virginia and found a job as a coal miner. The dirt and dust were a welcome relief from the clown make-up and it was nice to go to work wearing footwear (steel tipped work boots) that wasn't four sizes bigger than my shoe size. And a coal mine is far less claustrophobia inducing than a '67 Volkswagen crammed with stinking greasy clowns with yellow teeth and bloodshot eyes. The VW had an 8 track and the only type of music the clowns played was  Death Metal (and of course occasionally Sondehim's \"Send in the Clowns,\" when they decided to mellow out  for awhile.  /s /s /s",
        "Who else heard the screaming at 21:12 ?",
        "Sindri's actor's range is incredible! Kudos to everyone involved. :-D",
        "Ultimately it was a great idea to attempt to find these kids and bring them back home, but they didn’t know enough about child abduction to know it wouldn’t help much. We now know that you basically have to make progress within the first 24-48 hours if you want to find an abducted child. Great video as always!!",
        "I'm here because of GWAR's song/video \"Have You Seen Me.\"",
        "i really hope you see this but can you make a video about Theodore John Kaczynski",
        "Over all I’d say the Milk Cartons showing missing kids was a good act and hey if even only a handful were saved through this I’d say it was a job well done.",
        "Ive seen kids confusingly just follow orders,  and thats the scariest part",
        "That was an incredible segment. I was a teen in the 80s, and remember the milk cartons with their not-so-sharp photos of children on the side. I DO think it was a step in the right direction, even if it had some issues.  I wish there was a way with Amber Alert to separate the custody-dispute-parent-abduction cases from the-child-is-in-real-danger abductions.  I know that some parents do present a real danger, but as with the milk cartons, the more cases (especially those that turn out to be \"Mom has the kids\") the more people will tune it out.  Our problem here in Texas, too, is that you might get an alert for somewhere hundreds of miles away.  The alert may be for El Paso, or Lubbock, or Houston when the hearer lives in Uncertain.  Familiarity may not always breed contempt, but it can make people more ho-hum about the alerts.",
        "A few notes on this video: The Johnny Gosch conspiracy theories go deeper and wider than what is mentioned here. Also, the theory of kids being kidnapped at sporting events- that was probably due in part to the abduction of Morgan Nick in Alma, Arkansas in the 1990’s at a little league baseball game. It freaked out nearly every Arkansan mother for sure that their kid would be next. In Arkansas, the amber alert is actually called the Morgan Nick Amber Alert in her memory; she was never found. Also, this shows my naïveté as a child- I can recall my mother always telling me to NEVER accept candy from strangers. She told me it was poison in disguise. It didn’t dawn on me until I was about 19 that it was potentially drugs like GHB or some kind of sedative. Derp on me. Personally I never knew any kids to be abducted, but it seemed like almost every year some kid would run away from home or school but was usually found that same day. In high school we had a girl take off to go see her “internet boyfriend” several states away circa 2000-2001. That was a huge fiasco. IIRC, she actually made it there but his mom called the cops on her and that was the end of that. That was THE TALK and gossip all school year.",
        "The whole thing came across as having good intentions but not going the way they wanted it to go sort of feel.",
        "Didn’t John Gosch die at the bohemian grove à la Franklin Scandal?",
        "the 2 million missing kids statistic is kinda funny to me, because i believe that’s roughly the population of maine.",
        "history is repeating itself with this type of social panic, only it's not about children this time, but over protection, over prevention of everyone and everything on a global scale, with no signs of slowing down, all while ignoring actual problems that are coming out of this behavior.",
        "Boy it’s a good thing a well organized and funded human trafficking organization with members in the media and justice system do not go around falsely debunking claims of witnesses and the victims families or else people would get real confused about all this and believe the missing kids stuff is an unsolvable problem that will always be there.",
        "Etan Patz is pronounced, \"Ay-tahn Paytz\".",
        "wow who knew that something so ingrained in pop culture had such a short lifespan",
        "what a useless, deppresing, yet intriguing and super interesting piece of information. You always do an amazing job of researching and telling a bizzare story. And not everyone can just do this. Millions of subs well deserved.",
        "It's so morbid to realise that a lot of the children who were missing died before their face even showed up on the milk cartons.",
        "8:03 a Walter with a w for a last name huh",
        "Someone here has probably already mentioned it but (being too young for both the milk cartons and MTV) remember reading about the music video for Runaway Train and how a few of the missing kids featured were actually running away from abusive parents... and being returned to them... And also one was actually murdered by her mother and buried in the backyard.",
        "Every time you thank the audience for watching, it warms my heart haha. It's a healthy balance between spooky content and just hanging out with a friend. Keep going buddy, all the best on your movie!",
        "Idk if it's wendigoons fault or not but I'm getting two unskippable ads every five minutes and it's REALLY really annoying :/",
        "ISHOWGHANA, this stream changed my life. My entire view of everything that exists in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience.",
        "William Afton \"my time has come\"",
        "I still see those pictures of missing people in the newspaper; it always depresses me to see them, especially the ones who have been missing from as late as the seventies. Families still holding out hope that maybe someone will be found. The scary thing is, something definitive happened to these people, but we will likely never know what it was.",
        "didn't experience the milk carton thing..but Unsupervised Internet Access as a child did the stranger danger effect and some pretty well ..",
        "And an episode of small wonder where the little girl who visits the family turns out to be on the milk carton they pour milk from and it ends as a very special episode would",
        "I just finished watching Xs episode before coming here and I gotta say, Rens reaction to seeing Hermitopia and Hermit Tower was absolutely hilarious",
        "That parody was fire as hell bro",
        "like a mouth ago an amber alert got like sent out doing my english class and so everyone got this little beep \"weird guy in your neighborhood\" and started to freak out and make a lot of noise witch was kinda funny but i'm autistic so the noise was frustrating",
        "I was reported missing once I up and just started driving from nj to NM I didn't think anyone would care or kinda knew I just went on an adventure since I lve just gone camping without saying anything well after the 6th day. I got stopped by a park ranger and he ran my name and said I was missing it was funny he asked me like did anyone force you to leave blah blah. I was wrong my entire immediate family reported Me missing I was 25 lol. So I stayed an extra week without ever calling home or answering phone.",
        "I believe Bonnie's story also birthed the banger Caroline B. Cooney novel, \"The Face on the Milk Carton\" and its follow ups.",
        "Nice job in \"Man in cave\"",
        "im confused so they bought the milk, the cashier swiped the milk,  saw the family including the girl, and thought nothing of it? and no one else in the store saw the girl???",
        "So that's why my dad went to get milk... to go figure out who was missing!",
        "Hey Wendigoon, way to come in clutch. I get to watch a new video by you the night before my wedding! Thanks for putting out consistently awesome content",
        "I remember growing up I used to see references and jokes involving missing people on milk cartons, yet never saw that in real life. At the time I figured it was just a reference to something people used to do that I had been born too late to experience first hand, like the milkman, or the \"30 minutes or its free\" gimmick from Domino's.",
        "This is the most convincing advertisement ever",
        "Been binging your content lately and I just wanna say thank you for describing in great and funny detail all these conspiracies and events. These stories will always be in my soul buddy",
        "Wendigoon has a talent for presenting the most obscure yet interesting topics",
        "Being from the UK (Where we never had such a program, but often saw it presented in the mostly American content we were watching through the 80s) I was always curious about this and thought it strange the UK had never adopted it. Noting what you say about the anxiety it caused everybody (Both parents and kids) perhaps this was why it never became a practice here.",
        "I’m from Des Moines. Anderson-Erickson dairy slaps. Haven’t had anything better.",
        "The missing kids is now on the walmart billboard. Still missing. So the milk carton is irrelivant",
        "I was extremely paranoid when I was a child. There was a big missing case involving a girl my age (she was found, as you might expect, desecrated and dead), and since then I feared even close relatives (someone close to her was the culprit)",
        "I grew up with this.\nAs a kid before i could read i just thought it meant milk for kids...\nLater it was just creepy",
        "I think regardless if it was effective to the degree they claimed any possibility of getting these children back should be explored.",
        "My parents grew up near the Lindbergh house and were the age of the kidnapped/murdered Lindbergh baby. They terrified me and basically allowed us  kids to play primarily in our basement and backyard only. So when I had my own kids in the 80's I was primed to pass on that fear. Crap!",
        "Too long didn’t watch someone please summarize",
        "Not talking to anyone was my  motto as a kid.  Whenever anyone would try to talk to me, I'd turn away and run.  It worked for me.  I have never been kiddie diddled.  Although I guess for a lot of kids in the 70s and 80s and even 90s, it was their parents who were the ones that they were in danger from.",
        "I hope you're cutting ties with established titles as they've been proven to be a scam",
        "I read a book in middle school called The Face on the Milk Carton. It was about a teenage girl who found out she was kidnapped from seeing her face on a carton at school.",
        "I knew a kid in my old neighborhood who wound up on one of those.  We never found him.  I think he was lost while on a hike with his Boy Scout Troop.",
        "the video starts at 4:10\nThank me later lads",
        "Is this why millennials are like that?",
        "Born early 1990s, I feel fortunate to have been in one of the last UK generations allowed to ever play outside unsupervised.\n\nBeing kidnapped is an unfortunate but small possibility, the benefit of going outside and exploring is huge.",
        "Bros a serial killer  2:37",
        "I always thought Etan Patz was the first child.",
        "This dudes promotion is literally Mr. Ballens promotion for the like button style ",
        "You should make a video about Christiana the commune in Europe or the Serbian bottle incident.",
        "I’m 38, I’ve heard the stories over the decades. I’m OK with my nine year old son hurting a strangers feelings, by not talking to them, or responding to them. Yes the stranger danger might be overreacting sometimes, but it’s better safe than sorry.",
        "Man, this makes me so grateful to be a large, 27 year-old man. I literally celebrated when I realised I was too big to be attractive to pædōs.",
        "is it just me or does he look like brandon herrera",
        "Thought my school alone only knew about safety pup",
        "i actually enjoy/love watching your ads  ethically sourced made me lolllll",
        "I'm glad my mother tended to buy milk gallons instead. I got to enjoy a normal childhood while only knowing the milk carton thing through parody.",
        "It's glad to see you back again after the Appalachian lights video. Whenever I'm sick, doing a task, or just bored for whatever, your videos are always entertaining️",
        "YouTube is really starting to understand my preferences. Great video, automatic sub️",
        "Looks like spooky black person/monster behind him",
        "I went on a dating app and one woman told me I looked like the “Mexican Version of Wendigoon” I looked you up and here I am. I can tell now that it was a compliment ",
        "A child of the Mtv Generation, it wasn't milk cartons, but the music vid to Soul Asylum's Runaway Train that haunted my dreams. Nearly 3 decades later, I still think about those people from time to time and wonder what happened to them... ",
        "I remember the video for Runaway Train by Soul Asylum did this and apparently did some good.",
        "I would get separated from my mom frequently as a child. I have a memory of me at a free outdoor concert in a park, losing track of my mom per usual.  I went up to a random guy sitting on the end of a beach, climb into his lap, start bending his fingers back and forth and explain that I can't find my mom, or I'm lost. He helps me find her obviously, but I'm just imagining what was it like from his perspective? Without any warning whatsoever, a strange small blonde child has climbed into your lap and in your personal space, calmly asking for help. Stranger Danger? I think I found Strangers will help.",
        "I really enjoyed the part where you talked about how missing children programs have advanced, and how Amber Alert probably wouldn’t exist without the milk carton program. It was overall not a great solution, but nothing back then really was. I’m glad we can look back on it and recognize the mistakes people made and move forward with new and effective techniques. Hindsight is 20/20, seriously",
        "My mother (born 1975) once lectured me about stranger danger after I took a <1 minute ride with my friend and her mom to my car across a school parking lot. I got so mad at her for it when she said \"those closest to us are most likely to hurt us\". I never really understood why she would overreact like that until this video",
        "the milk carton kids...this was before the internet so that was a very good way to spread the word",
        "literally 1984",
        "The Johnny Gosch story is a whole other wormhole unto itself.",
        "I remember a Tom & Jerry movie with one of the main characters having their face on the milk carton.",
        "If I had a nickel for every time a paperboy got kidnapped, I'd have two nickels. Which isn't a lot, but it's weird that it happened twice.",
        "What nods you rocking my man?",
        "The being kidnapped by a parent thing is beyond true. Boyfriend’s nephew was taken out of school early by his mom and my boyfriend’s family has not seen him since. The police said there was nothing they can do, despite the fact that she only came back into his life a few months ago after leaving when he was a baby, having a felony charge against her for attacking the kids dad, and her family having a history of drugs and drugging children to get them to behave. My heart hurts for him and I know his dad and the rest of the family misses him. We can only hope his dad is able to get full custody in court some time soon",
        "neat video, I'd like to see mr wendigoon explore topics like DHMIS since it'd be similar to the salad fingers video he has done in the past.",
        "Very interesting deep dive as always, but I got really hung up on the ending comment of hearing about the program in a video about cartoons. I realized I'd seen either something similar or exactly what you saw and had to scrub through my watch history. Discovered it was a small bit in Jordan Fringe's video on Invader Zim. Not saying \"I know where you heard it from\" or something like that, just felt really weird that I'd also heard about the program recently in the same way.",
        "When my little brother was, I wanna say 8-ish, he came running into the house from playing outside and told us an unknown man had walked onto our property from the street and was approaching him silently from behind. He said he felt like something was behind him so he turned around and noticed the man then took off running towards the house. He said as he was looking back outside from a window he saw the man walking towards a van on the street side. My parents reported the incident to the police. ",
        "imagine being a killer getting one of these missing kid utility bills of a kid you killed with the common \" have you seen me \" phrase and it triggers a episode or su get paranoid or something",
        "Early 2000s kid, I was taught the stranger danger thing. My fiancé, was never taught any of it. It’s shocking how he just goes up to strangers and speaks to people where I just assume everyone is out to get me. I think it’s interesting how this inherently changes your reaction to strangers even as an adult now.",
        "This dude just convinced me to buy some cereal. ",
        "When I was a kid, my mom would just scar me with stories about women going missing in her hometown in Mexico. Then she would make it worse by pointing at a random person in public and would say “if you don’t behave, they’re gonna take you like they did them.” And it would scare the hell out of me. Thanks Mom.",
        "Not even 3 minutes into the video and Wendigoon has pulled out a gun. This is gonna be awesome!",
        "I can relate, the majority of my random teammates play like this. I always end up dead trying to revive them. and if I go down, u can forget it, ain't no help coming. That just makes me appreciate good team mates even more.",
        "A recent horror film has come out called Skinamarink directed by Kyle Ball and it's extremely interesting. If you like the mandela cataluoge series or any analog horror then this movie is definitely up your alley, I'd love to see you make a video on it!",
        "If you dont talk to strangers than how do make friends???",
        "Dude, ALL OF YOUR VIDEOS ARE GOOD! I can’t think of a single video that didn’t interest me. Keep up the good work!",
        "I'm confused, what parent doesn't watch their kids walk out and wait for the bus for at least the first few dozen times?  That seems a little fishy to me.  I know you should let your kids do things on their own but in this instance watching them wouldn't diminish the accomplishment in any way.",
        "This is insane. When I found your channel you had under 100,000 subs. Congratulations man.",
        "Thank you for pronouncing Des Moines correctly. Lol.",
        "4 min and 20 seconds in and the vid still hasn’t really started damn dude speed it up",
        "I wonder how many comments on here are generated by ai",
        "This video could of easily been 12 minutes long. But no, you had to try and milk it.\n\nHow many times is he gonna repeat himself? My god, this is impossible to listen to.",
        "I wonder how many parents didn't buy milk because they didn't want to traumatize their kids like that.  I wonder how many parents repackaged their milk for the same reason.",
        "It took 4 whole minutes to get started",
        "Will wendigoon cover the other mcr albums?",
        "I actually still very worried for the child when I see it’s a so called “custody spat”.  Like you noted, kids are most likely hurt or killed by their family.",
        "Raise your hand if you're parents bought 1 Gallon jugs of milk. Yah, never saw these cartons....",
        "My mom told me about a time she was being followed in a grocery store when I was about 5 and my sister was a newborn. Two men in suits followed her around the store and she was sure nobody would help her so she ran out with us and left the cart. I always wonder what their intentions were. \nI also remember being 12 and hanging out by the pool with friends and an older man jogging around the apartment complex stopped and asked if we would like ice cream, everyone declined politely but my curiosity of stranger danger overtook me and I said sure. I followed him back with another girl my age who was urging me not to go the entire time. We got to his apartment at the very end of the complex and he pulled out a cooler with otter pops. We thanked him and went back to our friends. Nobody else ate the popsicles but me. I truly let the intrusive thoughts win ",
        "It was common for strangers to walk into people's homes and take their children back in the day. It happened to my great grandparents, grandparents, my dad and his siblings as well. I would be interested to see you do a deep dive into Residential schools and the couple thousand dead children they found at most if not all schools searched so far",
        "Man I'm 47 years old bro and you like to keep it real and I I dig it I really dig it thank you sir for being an honest man and calling it like you see it we need more people like you around educate the Young folks and myself keep it up I'm behind you",
        "And I question your logic. Yes, conventional wisdom says the likely hood of finding a missing person of any age after 48 hours goes down dramatically, never being found, and being murdered are not the same thing. How many of them were stolen for other reasons? We don't know, so to just blanket say the pictures have no value, it dubious at best. At least as dubious as their effectiveness.",
        "Thanks for another video man. I'm going through a nasty breakup (15 years) and your stuff always helps me get through. Keep it coming man",
        "Epic video wendigooch",
        "i live in a small province in canada, we had our very first amber alert ever a few months ago, i cant still feel the chills as i read the real time updates through the emergency alrts",
        "Maybe you could mount the wendigoon to your door on the other side because it’s kind of taking up a lot of space with the limited amount of space that you have in frame.",
        "It’s interesting to hear this connected to child custody battles - 1981 was the all-time peak in U.S. divorce rates - a massive spike in divorces in the late 70s and early 80s  because of the backlog of divorces women wanted that had been prevented by restrictive divorce laws and married women not having their own jobs, bank accounts, and property.",
        "If I can make a video request I think a creepy pasta iceberg would have a lot of potential",
        "You said magic spoon after depressing trying to turn it around. Not going to lie crippling depression tastes better than that magic spoon trash.",
        "The only reason I knew about this program is cuz of The Sims 1",
        "I'm a 90s kid and I think the whole Stranger Danger fear was extremely useful back then, not so much now. I played in empty fields with my friends, rode my bike to school, went to the grocery store on my own, etc. No cell phones and no internet, so communication was done with a post-it note on the fridge. As a kid before the 2000s, you were almost always on your own, especially if both your parents worked. Having a healthy paranoia of strangers was a lifesaver when it came to being a kid. I think now it's not as useful since that paranoia has kinda transferred over to parents and adults who won't even let their kids play in the front yard, and are convinced the kid will be murdered if they're allowed to walk to school on their own.",
        "There was this case where a highschooler was drinking milk and saw her face on the cart from when she was very young. Turns out, her \"mom\" stole her, gave her to her grandma and dipped",
        "22:00\nThat was always my issue with this. If a kid was legitimately kidnapped, by the time the face makes it onto the milk cartons, that kid is almost surely dead. It is very rare for a child to be kidnapped by a stranger (so not just a divorced parent taking the kid) to be found alive. As depressing as it is, almost always, the kid is already dead before the week is over.",
        "I thought I was looking at Brandon Herrera for a  moment.",
        "this stuff better not be more than $10 smh",
        "Hey I don't know where to put this but some of Wendigoons videos are being ripped off on other channels. I found one called \"project land\" that uses the serial killer iceberg. I don't know how this is handled but felt the community should know. I love your content and feel like you work hard to make it so good so seeing someone steal your stuff makes me mad.",
        "I would’ve thought the reason for the removal of milk carton photos was that the majority of households and companies switched to plastic milk containers…which would be sad because nearly everything is worse about plastic compared to cardboard/glass",
        "Sad, but not depressing- I am glad to hear how efficient & effective the Amber Alerts are. Grew up in the 80’s, but I never knew why it stopped. Thanks for all these history lessons!",
        "Only a predator would call this controversial",
        "It'd be WAY more helpful if it went by a state by state basis and not a national one.",
        "Wendi, I'm begging you- please do a collab with J.J. McCullough. This kind of thing is right up his alley, and I'd love to see you each bring your own energy discussing the history of American cultural icons.",
        "The Johnny Gosch story is so messed up and creepy.",
        "Is there any kind of archive for old milk cartons? I think it’s be cool to look at not  just the missing person ones but also the various ads & stuff!",
        "These fear campaigns probably saved a lot of lives. I was scared of strangers as a kid but maybe that saved me. I was followed by some van one time riding my bike home. Luckily I was prepared because I had thought so much about it.",
        "the spoon looks delicious, cant wait to eat that shit",
        "Not a fan of it taking 4 minutes for the video to actually start",
        "Insightful video. Saw lots of parallels with the helicopter parenting style I was raised with as a child in the 2000s. Undoubtedly remnants from that scare culture had lots of influence.",
        "I'm not from the USA, so we didn't have pics of missing children on milk carts, but I remember a show called \"Csellengők\" (basically 'missing kids') that showcased missing kids and used Soul Asylum's Runaway Train song. The scene, where the mom is running after her baby, taken by human trafficers is forever burned into my mind and now as a mother, I understand that scene even more.",
        "Use this link to save $5 at Magic Spoon today!  https://magicspoon.com/wendigoon\nThank you to Magic Spoon for sponsoring the video!",
        "i think its a far point to say that the milk carton program was not the best idea, but at the same time i know for sure that people get taken all the time, so high statistics for it don't surprise me in the slightest.",
        "I toured the A&E milk factory when I was in middle school ",
        "The real problem with the whole stranger danger panic is that it’s completely untrue. Absolutely, don’t get into cars with strangers, but a vast majority of the bad things that happen to kids happen in the home. The vast majority of people who hurt kids are people the kids know, or even relatives like parents, uncles, siblings, etc. A lot of stranger danger rhetoric focused on very rare instances and told kids that the people they knew were safe, to go to your priest, parents, teachers, etc for safety any time you need. Those people were the ones most likely to take advantage of kids, in reality. Also that most missing childrens cases are unresolved custody disputes or runaways that show up within a week or so.",
        "My sister and I were two of the kids featured on the milk cartons. Our birth father kidnapped us during a custody dispute. He held my sister, who was 18 months old at the time, hostage with a gun to her head for 5 hours. He verbally, emotionally and mentally abused our mother. He punched our maternal grandmother in the face and repeatedly threatened to kill us. But the Utah family court system still gave him unsupervised visitation and in October 1983 he drove us to the airport and we boarded a flight to Texas, and from there drove over the border to Mexico. We spent the next year in the sole custody of a violent, psychotic, delusional man who emotionally, verbally and mentally abused us and also sexually abused me. Custodial interference is not a laughing matter, it's not something that should be dismissed. The assumption that parents are by default safe people for their children has resulted in Gods only know how many children being abused, raped, tortured and killed. Please don't make light of this. Also, Pete was dangerous because he was his mother's golden child. So he was entitled, spoiled and had no self control and took no responsibility for his own actions. Combine that with mental health issues he was born with and then being drafted and sent to Vietnam? You have an extremely volatile mix. Mental illness itself doesn't make someone violent or dangerous.",
        "\"They don't do that anymore\" \nbecause it worked?",
        "Here's a funny childhood story my dad likes to remind me of every now and again. When I was little, \"stranger danger\" was implemented far too heavy-handedly in my schools. So much so that one day, at the store to get groceries, I apparently asked this random lady outright 'Are you a good stranger or a bad stranger?' ",
        "I really love that he gave a release date for his Onlyfans and then followed up with saying he's going to the Emmy's right after. Real \"Fast Smart Mark\" move, if you ask me.",
        "This dude looks like if Brandon Herrera was from north california",
        "Honestly, if it ever even found 1 missing kid, it’s a success. If you put yourself in the kids parents shoes, you’ll do absolutely anything you could to find them.",
        "So glad to see that Magic Spoon is still feeding Wendigoon’s addiction to delicious breakfast cereals.",
        "I think the biggest, most depressing myth regarding child abduction, child abuse, etc. is that it is almost always not a stranger, but someone the child knows; and that that person is almost always a family member.  No one wants to deal with the fact that the biggest threat to a child is their father, because what do you even do with that information?",
        "Who else wants plushies of Aphmau and her friends as merch?!",
        "\"It's just a prank bro\"",
        "Also, weird side note, while I still really really don't approve of any embellishing of guns whatsoever (for gods sake Americans, would you please finally get it? gun license. Only if there's a proven need. That's freedom.) I do love the subtle increase of entropy in regard to breakfast cereal over the last couple of months. Shame they don't ship affordably overseas, I am at the point where I'd try xD",
        "Man I am so happy a creator like you exists, God Bless you Wendigoon.",
        "No, mr. Goon. Thank YOU for giving us this cool content. In my 10 years online, I have seen people rise to fame only for fame to reduce them to shells of their former selves, whether by jumping a few sharks or no longer being able to provide a honest view of the situation for fear of biting the hand that feeds them.",
        "Remind me of Poofy Pops lmao",
        "A 40 min video about useless information. Yep, here’s a like, and a subscribe.",
        "Im watching this video on my phone and JUST got an amber alert for a missing 5 year old in my area  wild.",
        "I literally just found the weird history playlist and thought this was some old videos, never in my life have I been this early for anything! Thank you for the great content you put out and much love from a Bulgarian village boy!",
        "I was a paperboy in Sgt Bluff Iowa a few years after those boys went missing. I did it alone. Remembering to be careful. \nI went out with a missing person there. Forgot about it and she brought it up. She was a Runaway. My other friends little brother was abducted by the police taking the trash out there. His parents were pissed, and immediately moved away. ",
        "Cuz it was bullshit and never found a kid contrary to what they try and say oh we found a couple no you didn't but it makes good publicity ",
        "My mom gave me a lot of anxiety because of Johnny gosch. We grew up around 15-20 mins away from where he was taken and my mom was terrified of the “Iowa underground child trafficking ring” fun times",
        "2:37 Ooo… I didn’t take you as the Desert Eagle type.\nNice.",
        "My man, your skin always looks so fucking smooth. Your beard is even, hair looks clean, white teeth, a little chest hair. I just want to pet you.",
        "You look like Freddy Benson from I Carly",
        "Fuck me I'm 4 minutes in and the video hasn't even started yet",
        "In Iowa, Jonny Gosch still gets brought up every once in a while. He has never fully left the public consciousness. And you are adding an R for no reason, it's pounced \"Gosh\", as in \"Gosh, gee golly willikers\"",
        "It actually found several kids so it wasn't a failure in my opinion. Now people order up strangers and leave with them and don't understand why they are victims? Welp it's because \"stranger danger\".",
        "80's baby.. 90's kid. My mom and I had a secret passcode if anyone ever claimed they knew my mom or me and were to pick me up, etc. the password was BINYA BINYA POLLYWOG ...  iykyk",
        "Long story short in elementary school we had those cartoons, grew up in a small town in Alabama, which meant alot of our stuff was outdaated and since the 90s had just started no one really minded) and so we all joked that nobody in our city could ever be abducted. In about 5th grade a kid in my class found a picture of himself on a milk carton and it scared us all. We ended up not being told until much later but his parents(who we all knew bc once again small town = no secrets) took him in and ended up moving without telling his birth parents who werent able to get back in contact with them. It shook our town for years and we were no longer allowed those cartons of milk. Apparently many of the adults in our city knew and just were fine with it! I ended up moving away at 16 but that kid never looked at his parents the same, heard recently he actually got in contact with his real family and is doing good.",
        "With the release of the Friend of the Family series on Peacock— which dramatizes the real life story of Jan Broberg’s kidnapping and abuse by a friend of her parents, it has made think a lot about how the Stranger Danger movement overshadowed the fact that statistically, these things are more likely to happen because of someone you know. Stranger danger is important but it also led to a lot of “oh no ‘Jim’ would never do that to our child because we trust him”- familiarity and trust are a predator’s best friends. A better message would be to let children know there are certain things no one is allowed to do to them, no matter who that person is. And there’s way to do that without traumatizing the children— teaching kids to have a sense of consent and bodily autonomy will help them understand when something is inappropriate or dangerous. That when they feel endangered or scared of someone, they are right in speaking up.",
        "I was so, so scared and paranoid about strangers when I was a kid in the 90s. I remember reading that exact Berenstain Bears Learn About Strangers book. There were always so many terrifying warnings about strangers back then, in books and videos and just seeing the missing kids' pictures on mail and stuff. I feel like it was helpful despite being terrifying, because I remember very quickly getting away from a couple of suspicious situations due to the intense fear from all the warnings. I wonder if the milk carton program as an unintentional warning ever helped to prevent any abductions during its run, just by scaring kids into a greater awareness of potential danger. I know there's no way to get solid numbers on that, but it would be interesting to ask people who grew up with missing kids on their milk cartons how (or if) it affected them in any significant way or specific situation.",
        "Bro I was wondering where I recognized your face… Internet Historian: The Cave",
        "Hey man Established Titles turned out to be a scam, figure you might already be aware but here's a heads up. As you've had sponsorship with them a couple of times, you might need to do a bit of editing out",
        "",
        "It's really funny to me that you referred to the \"poster child\" cases of the milk carton program without realizing that, in this case, they're all poster children ",
        "There are multiple reason for the declining birthrate, but the lack of trust in society as a whole combined with this and other, creepier realities make having children essentially mom viable. Godspeed to those of you with little ones.",
        "Hey, it's the guy that got stuck in the cave.",
        "I was in a lot of day homes and daycares as a kid, so the whole stranger danger thing never really sunk in for me. The only reason I never accepted care rides from people was not because I was afraid of being kidnapped, but because I was given the ingrained fear of disobeying my mother. Sort of funny since the only times I’ve been offered rides was from a classmate I lived near and walked home with offering me a ride to school in a blizzard and a couple times the father of one of my friends offered to drive me home (with my friend and all of their siblings in the car) which they had already done before with my mothers permission. Alas, blizzard walking and otherwise was my fate.",
        "When I was a kid in elementary school I was told that strangers would pretend to be our friend’s parent saying that our friend couldn’t come meet us, they’d kidnap us, have a gun/knife if we screamed in the vehicle, and then would take us out to the woods, skin us, then bury our bodies. And since then I’ve been paranoid of strangers and don’t trust anybody.",
        "For the most part, this flew under my radar growing up — we always bought gallons. \nPretty sure my only grasp of the concept was from pop culture...",
        "Ads? Milk used to have ADS?!?",
        "This dude is really just Brandon Herrera’s cousin lol",
        "In hindsight, the general ineffectiveness on the milk carton program makes the trope of them appearing in movies kind of creepier. Like,  \"that's not even really going to help...\"",
        "You should do an episode on the JFK assassination since you did one on MLK.",
        "Ok so I know I’m late for this vid so I’ll comment this again on your next post but you should check out the Southern Reach Trilogy by Jeff VanderMeer. There are 3 books (obviously) and apparently he’s writing a 4th one soon. But if you really like analog horror I think you’d really like it (especially the first 2 books in the series) the 3rd one is the weakest of the three in my opinion but there are parts of it that are really great. The genre is weird fiction and horror.",
        "My mom ran away at around 14 years old and was gone for nearly a year. My grandmother put her on milk cartons and fliers everywhere, they didn't work. She did get false reports about my mom being in California from people coming back from spring break, people saying she was lured into the woods near her home, etc... but in reality, she was just hiding out with her friends.",
        "Video starts 4:09",
        "Just wanted to say you have become one of my favorite youtubers. Your way of telling stories is something special.",
        "it's sad that media portrays kidnappings as such a rampent thing too even though it's not as near as common as people think",
        "Magic spoon sucks unlike what you said, and it's disrespectful to the victims",
        "The berenstain book gave me PTSD from another timeline, Berenstein..",
        "My “kidnapping” story is embarrassing because I was far to old to be so stupid. \n\nI was, eh 13/14. Went to a introductory snowboarding class which included about 10 others ranging in ages 10-25. The instructor was a handsome middle aged guy. Not someone you’d be think to be wary of. ",
        "I'm too young to have seen missing cartons first hand, but I do recall watching a tv program on I think Saturdays simply called \"Missing\" back in the mid 2000's (evidentally it still airs to this day). It was a morbid curiosity kind of watch for 7ish year old me, I can't remember if it was on a channel I was watching for cartoons, or if I just stumbled upon it one day, I definitely watched the program several times though",
        "I was in elementary school in the early 2000s and I definitely remember thinking it was incredibly common for kids to be kidnapped and was something I was nervous about",
        "Honestly, I'm surprised I survived the 90's. I do not recall ever having seen missing children on milk or juice cartons or on pizza boxes or anything that came from the store or was picked up or delivered from a restaurant, no, they appeared in the mail and that happened at least once a week. Along with coupons and ads, there was always a section on the junkiest of junk mail items dedicated to missing children. Still happens these days and I still hadn't seen any of them. How that relates to me, I turned 10 in 1996, just a few months after the first Amber Alert and well before the advent of stranger danger, and yet even with missing children appearing on milk cartons, I was still given enough leeway to play outside or go around with my older siblings when such situations arose. As a matter of fact, when going over to my dad's house, it was common for us to walk as far as a park across the street from the hospital in town, the very same hospital I was born at if you care to know that, and never once before Amber Alerts or after did anyone ever try to get us to get into their car. Far more likely, we could have been hit by a car or fell into the river and drowned or something like that. Still, the possibility for someone to have tried to abduct us was there, but we had safety in numbers, I suppose.",
        "I think the worst assumption here is that strangers are always dangerous and have intentions and that parents are always good and care about their kids when neither of those things are true in all cases. My mom is great and my dad tries his best, but I know a lot of people who had abusive and neglectful parents who did not care or even purposefully hurt their child. I also know now that I am adult there are so many adults who would help a child and that assuming ever adult that you don't know is going to hurt you just creates unnecessary panic for all parties involved. Most kids get kidnapped by people the child already knows. What should be addressed is not who to look out for, but what behaviors and actions kids should expect from the people around them and what should never be tolerated. Teach kids that they should respect themselves and the people around and that they should expect the same behavior from the people who they interact with. Tell them what to do when a person mistreats them, whether that's a bully their own age or an adult. Believe kids when they report being mistreated. Teaching kids they shouldn't get in the car with people they don't is not a bad idea, because you don't know who a stranger is by the very nature of them being a stranger so you don't know what they want. It's not enough to keep kids safe though. We need to do better"
    ],
    "comments_disabled": false
}