{"video_id": "YIbDOR0L48U", "comments": ["han being offended when everyone ghosted platforms \"LOOK AT YOUR SHOES\" lmfaooo he's not wrong tho all of skz constantly wear platforms", "I love that Felix gets more talkative in English interviews, usually he's pretty quiet. And Han - oh my gosh, a natural-born comedian", "post it or ghost it with these eight is both hilarious and soooooo chaotic ", "Han flirting with Felix and Felix indulging it will never not be funny. Also anything Lee Know does in tiny makes my heart burst  And Felix emphasising he NEVER takes off his matching rings only for Hyunjin to flash his \"couple rings\" is literally the sweetest thing ever. It really is a symbol of their friendship ", "I love their english interviews because han, changbin and seungmin always spurt out random stuffs  they're so funny", "I love when they were talking about oversized jackets and explaining why Changbin doesn’t like them, they twisted Seungmin’s words and he’s just sitting back there like                    “that is not what I said”", "Han jisung swooning over Felix's accent out of nowhere is such a bro  moment. Dude's literally me", "4:33  where seungmin says ‘I like it’ and ‘the photo is cool I.N’ melted my heart - he’s so quick witted and will rip into the other members but he doesn’t hesitate to stand up for Jeongin and make him feel appreciated 🫶🫶", "Han's comedic timing and reactive humour is RIDICULOUS. Like I'm falling in love. STOP BEING SO FUNNY AND CHARMING HAN. I AM AT EMOTIONAL CAPACITY!", "Lee Know being in the center and looking comfortable in an English interview makes me so happy ️ I’m so proud of him!!!", "Chan making sure he gets lino to talk at least just a few words never fails to make me feel touched", "I love how Jisung's accent just gets more and more aussie lmao", "THEY GHOSTED THE PLATFORMS SHOES BUT THEY WEAR THEM ALL THE TIME BECAUSE THEYRE SMALL", "I honestly adore the way Changbin does everything He looks so effortlessly good at anything he wears. His physic is so slay. His body portions are on point which makes him look so good. I am pretty sure he can pull off even a sack and make it a trend. I love you so much binnie <333", "This was so lovely - they all looked like they were having fun - no one looked unhappy \n\nHan - my overhyped little sunshine soulmate (I’d be the same) \nFelix and Chan - keeping it chill ", "The editing on this is perfection. The cuts to Han insisting on posting, Changbin on ghosting, the tiny cut to Lee Know cuz he was rocking cutely…. ", "I feel so bad about the oversized jacket confusion. I think what they were going for was that the jacket being oversized and loose wouldn't show off Changbins muscles that he's worked so hard to get.", "I love how Han always does his best to entertain in these interviews.", "loving jisung isnt just a hobby anymore its a daily routine!", "Hann should be given award fr always making interview fun", "HAN JISUNG IS HAN JISUNG nobody can beat his standards! He can do everything  even he is a part time IDOL & full time COMEDIAN because he can bring smile someone's face easily", "Han jisung being a damn mood and a relatable person once again", "I’m just living for Han yelling out post it. He has such an adorable personality! That’s why he’s my bias wracker", "I love their energy. han flirting with felix, felix speaking the most, changbin getting excited, chan asking everyone about their thoughts, seungmin making jokes (he meant changbin was muscular, y’all took it very wrong), hyunjin and minho not participating much but still smiling. they all look amazing as well. love you guys!", "Han: bucket hats are perfect if you havent washed your hair in weeks\nSkz: ........\nHan, sweating: not me tho! NOT ME", "4:58 Minho's tiny cactus dance it's the cutest thing ive ever seen, he looks just confortable between the members", "Hannie’s aggressive post it. POST IT. P.O.S.T. I.T.  we love the passion ️‍", "Changbin and Seungmin together is my favorite at the moment, they are so cute together! When Seungmin tried to hug him from the back", "Mom i love Han sm. Han always stand out  and interesting to watch in every iv. I just love han energy and humor so witty and funny. Han is han jisung no one can be like him.", "BINNIE looks great in everything let's stop making him the butt of the joke please LMAO", "i love how they used their own photos ", "The reason why seungmin is my ult is one bc of his talent 2 bc of his savagess(aka personality that is caring but savage)and 3 ofc his beautiful heart and his visuals bc he’s handsome and has a amazing heart!", "5:53 I like the way everyone raised their hand to give their opinion but Hyunjin is staying like a diva with his legs crossed. And he flips his hair like \"I don't even bother to give my fashion advice, b*tches\" ️", "pls jisung is just so effortlessly funny", "Han Jisung is effortlessly funny.\nFelix showing up with crossbag but I thought he was wearing a cast.\nAnd, chanbin vs oversized jacket episode with panic Felix and Seungmin featuring hyunjin's \"It's not my idea\"", "CHANGBIN wanting to ghost scarves so bad killed me ", "seungmin saying literally anything is bias wrecker material", "03:17 Seungmin saying \"fry tag\" got me haha bc I'm german and \"Freitag\" means friday but he pronounced it so english-y haha so cute", "Changbin when he wanted ghost something was hilarious, he was so vocal about it I loved it", "Changbin we love you forever and you are the muscle king.", "Assistir ao Stray Kids sempre vai tornar o dia de todos muito melhor!!!!!!!!", "han just needing to take a second to appreciate felix's accent is so relatable", "They get finer day by day", "Whoever edited this is a whole mood. Whenever Changbin said ghost it, the zoom edit on his face appeared ", "Lee Know look so much more comfortable in this English interview, I hope that he genuinely enjoys it. I just wish he would start trying to say something in English in one of these interviews. ", "0:39 Hannie me define, no hay que explicar jaja las plataformas se quedan si o si", "I loved their vibes in this video. \nOften in these English only videos it's mostly Chan and Felix talking, but Han definitely made sure he was heard.\nAlso Changbin looking somewhat possessed trying to ghost the scarves made me lol.", "Hyunjin and Felix always point out their couple rings So Sweet Hyunlix Friendship", "Changbin is so right for not hiding his muscles in oversize clothing ", "i loved how Han was so cheerful and talkative hahahahaa", "SKZ interviews are always so chaotic and I love it. They are always either teasing or complimenting each other. I can't with how cute LK is in this interview, he smoll! Hannie is so out there, amazing how he keeps improving in everything.", "Lee Felix being in a real commitment with his Couple rings and Hyunjin...  and the fact Hyunjin just reinforces that they are couple rings \nAlso,  the only thing that Hyunjin takes a solid opinion on.... ", "han is so good at being engaging and participating. if there was no han, this would've been a quiet interview. HAN FIGHTING <3", "Changbin's and Han's energy in this video gave me the energy I needed for the rest of the day.", "I don't have a bias but Han keeps elevating himself. Love how he promotes himself, preferences, and humor, especially when he uses his humor to point out Felix's adorable Aussie accent.", "Changbin's English is getting better and better and he's so eandering to hear ️ And my Hyunebun who looks so gorgeous even though he's calmly participating. I love them both ️", "I'm in LOVE with the editing! This video was so much fun and had me laughing the whole time. Thanks Seventeen for having Stray Kids in another of your videos!", "Lee Know melted my heart away with his smile. The way he showed in tiny thumbs up was just too cute to handle. ", "Binnie saying post it to leather jackets was super adorable. Also I agree that wearing leather jackets, especially in the fall, is great.", "minho is such a calm and peaceful soul <3 i love watching him in interviews", "6:36 Felix putting so much weight into his words is so endearing :3 he \"NEVER takes it off\"", "Jisung is so relatable I love him \nYou know when you haven't washed your hair? Bucket Hat", "Seungmin is sincere and very tender. I LOVE YOU MINNIE", "2:23 someone plz add this as Changbin's iconic moments", "Hahaha the way Binnie acting he’s upset and shoving Seungmin’s arm was soooo cute!!! My bias and biased wrecker ", "I have said this many times but i will never get tired of saying it. SEUNGMIN IS ALWAYS A FREAKING MODE. Like he would stay silent the whole time and then boom here comes that sentence out of his mouth that lives everyone rolling on the floor laughing out loud like its the end of the world ", "Binnie was so adamant about ghosting the scarf ", "STRAY KIDS ARE SO CUTE WHAT THE HECK\nOur Dwaekki Changbin might seem tough, but is so adorable-\n\"POST IT! POST IT!\"", "3:02 han saying to Felix your accent is sexy. i like that.\n3:53 chanbin is likes fit and food....so cute...chan is saying if they have oversize jacket give it to chanbin and seungmin is disagreeing. Its so hilarious \n Stays eight visuals and amazing artist called stray kids please don't miss out on them.", "Minho: so cute\nChangbin: being my favorite loud baby <33", "basta, es que a los kids todo les queda bien y ni quien me lo niegue\nKFJDGSFKSGDFKJGD la parte de Seugmin y Changbin KJGDSGFKG AYUDA\nYa, pero nunca puedo dejar pasar me Minho no habla T-T-T-T-T-T  solo hizo como dos o tres moviemientos en toda la entrevista, Hyunjin y Jeongin igual, ellos si hablaron pero se quedaban callados T-T-T-T basta", "Changbin is so angry about so many things in this interview  adorable", "Minho is the only one who didn't talk, because he can't really speak in English, but I love how the members put him in the middle of the frame, so that he's not alone on a corner, not speaking. SKZ is one big family, and I love them so much", "Changbin is the CUTEST! Like a little kid with mood swings ", "Mano amei isso\nEles estao tao animados, todos interagindo, e o lino parece mais confortável (ta ate dançandinho TT fofo)\nE ainda usaram fotos deles kkk\nPerfeito", "I wish I could pick one of them as my Bias. But I think it's 3racha as a whole man. Without Channie we wouldn't have SKZ so, he has to be in there. Changbin is just too badass not to be included in my bias and I think his personality is so goofy and laid back. Han is just charisma and energy in the form of a person, he is so funny, and always makes sure to up the energy and get everyone hyped and involved in the convo. He's also the most adorable Quokka I know of. <3 Hannie and 3Racha", "3:44 this had me so dead, WHY!!  and I.N. gets plaid is a classic \n5:10 - 5:30 THIS is just peak comedy, Changbin insisting in GHOST IT with a straight face ", "It’s always a joy watching these guys, they’re so entertaining and so likeable ", "I love how Seungmin sometimes say savage stuff out of habit and then tries to pacify it with an innocent face and explanations..\nHan shines in english interviews..\nAnd leeknow's cuteness is too much for me to handle now...", "why is jisung so funny?? and the british english accent he has makes everything funnier lmfao", "I’m alwaysss floored by how great and clear their English is  (minus Felix & Chan lol they’re a given). Especially Seungmin and Han. I love when they speak in English lol ", "Came from twitter to see this full moment myself 3:43  I feel like Seungmin was taken out of context here cause the second they laughed he realised he worded it wrong and tried to correct himself and when Changbin says I like it to fit he agreed and said yeah as in that’s what he meant ( Changbin would rather show his muscles in more fitting clothes). You could see him panic and try to  correct himself. Literally was fidgeting with his hand and stuttering and saying no no no that’s not what I said. I hope this is a learning moment for all of them because Changbin clearly looked uncomfortable as well as other members. (I know some people will disagree but this is how I saw this moment)", "It was so cute to see Seungmin compliment jeongin’s fit and then putting one hand up so he wouldn’t get lonely ️️️", "We can always count on Han to make the atmosphere a little bit awkward, love him", "It's cute how comfortable Lee Know looks even though it's an Englisch interview.", "This is the most lively i've seen all of them being in an English interview. Love the ever growing confidence. Love SKZ. Love the interview!", "Seungmin being the main character as usual", "If I try to quote every good thing Han says I'd just have to write the transcript of this whole video  he's so funny", "aww man I wish these videos would last longer I love you Stray Kids, you are so funny and beautiful!", "you can see changbin visibly upset after the “big” jokes and the entire rest of the interview he’s much quieter. even Han shakes his head and looks disappointed after they finish joking about him. ", "Han is really a genius n has a good leadership. He gave a witty, entertaining and articulate speech. Although English is not his native language,I love how he always tries to speak in English interview either in English or Korean language (because he knows there must be subtitles later). He always gives input during their interviews/contents so that we can learn more about them. Han was really so energetic and present throughout the interview. It makes the interviewer's job a lot easier. ", "Minho said \"Go Go Go\" and he ate that and slayed this video with his presence", "7:16 lee know’s little “byee” ", "Changbin being the antagonist of this video in his adorable baby boy English", "The way changbin said no 6:19", "5:47 just wanted to say that I absolutely love and appreciate Chan for being such a great leader here for giving an opportunity for Lee Know to speak even if it was just one word. Lee Know obviously doesn't feel very comfortable speaking English since his speaking isn't the best although he understands it well, and Chan still made a way for him to interact and Lee Know looked like he appreciated it. Love him so much <3", "Dios mío amo estas entrevistas porque Seungmin se desata JAJAJA", "I’m happy that Lee Know felt more comfortable with this interview though it was in English, the little dances he made, so cute ", "the way that human quokka is so persistent about the platform shoes just so hilarious ", "I love seeing Minho getting more confident in English interviews ️"]}