{
    "video_id": "YIbDOR0L48U",
    "comments": [
        "2:14 han and chan are making me laugh soooo much ",
        "What is this video even  aghhhhhhh skz thank you for existing",
        "STAY VOTE ON MAMA!!! ",
        "3:15   Hyunjin lookin a bit jealous there ",
        "I love lino here even though he didn't talk much but his reaction with  or  is so cute. And hyunjin's english in tiny is also cute ",
        "all of their english skills have improved so drastically it’s very impressive, even lee know that doesn’t speak much looks like he can understand the conversation more these days.",
        "They are so funny especially Han yelling post it...don't forget to vote for Stray Kids on Mnet plus for MAMA",
        "Changbin saying ghost it 9x’s to Chan’s pic made me cackle",
        "Cuando hablaban de lo grande que es changbin, quería arreglar lo q dijeron, perp solo lo embarrraban más ",
        "Whatever straykids’ fashion style is, they can always 𝐬𝐥𝐚𝐲 it ",
        "Question: why is it too cute and funny?!\nAnswer: because it's Stray Kids <3",
        "They.. got.. couple.. rings??? ",
        "3:50 ??? 3:55 wth cmon is not the first time that they say sh!t and funnyless things about changbin's body. chan saying \"okay, so if we wear an oversized jacket and we give it to changbin, then it fits\" bro u are the leader you have to protect and respect your members and stays. he talks a lot on his live about respecting each other but then he says something like that. honestly felix, jeongin and hyunjin laughing i'm so disappointed. seungmin the only one who tried to fix him saying \"i didn't say it\". they obviously knows about the fatphobic cases but they persists in continuing, it's ridiculous. i'm glad that jisung remained quiet with a closed face he probably learned and is improving.",
        "STAY, KEEP VOTING ON M4M4, WE ARE REALLY CLOSE TO GET THE DAESANG FOR STRAY KIDS ️",
        "2:23 someone plz add this as Changbin's iconic moments",
        "Other members:post it ghost it post it ghost it posst ittt.\n************Meanwhile*************\nLee know:",
        "Han is so funny. I love him ",
        "oh my gosh lee know looks a lot more comfortable and happy this time  that makes me really happy",
        "Man, pulling a Puffer in this game probably is a real mood killer.",
        "The couple ring getting a mention, han pointing out felix’ aussie accent and just everyone’s reaction when a new pic would be revealed were my favorite things ",
        "los amo",
        "Han: “POST. IT” Bangchan: “why?” Han: “Why not?”",
        "Absolutely adore Han, he’s so funny ",
        "Amo lo enfático que es Felix que NUNCA, NUNCA, realmente NUNCA se quita los anillos de pareja que tiene con Hyunjin. \n\nY Hyunjin recordándonos que son los \"couple rings\" para que no quepa duda de que NUNCA se los quita. ",
        "this is so fun, i love how stray kids is confident with their english",
        "han is just so funny",
        "Hyunjin being beside of Felix make me happy.",
        "They r acting like Felix and hyunjin r married",
        "i feel bad for seungmin bc felix and chan made him look like he was the one fatshaming changbin when at the end it was them. this makes me so upset, i love them but this is just getting out of hand. do better boys fr.",
        "If Han doesn’t laugh the joke isn’t funny alright, that all I’m going to say. I expected better ngl ",
        "I love Han's energy in this video so much",
        "Han's aggressive post it at the platforms had me rolling ",
        "I was just wondering \nIT IS ABOUT WHICH FASHION WILL YOU PREFER TO POST A PIC WITH\nor are they talking about everyday use/fashion… ??\nCuz everyone saying - I won’t wear it the whole the day… like- that’s not the question right?",
        "0:40 I FELT THAT IN MY SPIRIT, HEART n MIND! same Han sameeeee.. POST IT!",
        "I love how Hyujin and Lee Know were so chill",
        "OMG",
        "The part where they laugh at changbin ,surprised me because i admire felix a lot,(,i have learnt many things from him) especially the way he show's his love towards changbin is different. He was the one who never left changbin in many situations.but i don't know what happened here.",
        "5:15 lee know bub you ok?",
        "Lee Know looks so cute here",
        "“Why not” is such a valid reason. You’re so right Jisung.",
        "Not them violating changbin  im crying",
        "STRAY KIDS PALESE DEI MARANZA SONO",
        "Changbin just angrily pouting for half the interview made my day lol. My baby prefers practical clothing, obviously. Also, Han randomly fanboying over Felix's accent and Minho looking more comfortable than in past English interviews  this was very fun to watch.",
        "Binnie wanting a tight fit to show off his muscles. Also him saying ghost it repeatedly while everyone wants to post it is such a mood. \nThis was so much fun to watch",
        "03:17 Seungmin saying \"fry tag\" got me haha bc I'm german and \"Freitag\" means friday but he pronounced it so english-y haha so cute",
        "I CAN'T BREATHE HAN JISUNG ",
        "they literally ghosted me whole ",
        "Arjun Kumar",
        "Seungmin's English has gotten so well, he's so cute..",
        "omg Jisung and Changbin were on something else that day lmao. Also love a savage Seungmin. Everyone's reactions to \"He's big\" got me laughing so hard hahaha",
        "Just 2:51. I agree with Han, even when he said pull straps.. ",
        "Me who wears chokers everyday to uni🥹",
        "Мне нравится, насколько настойчив Феликс, что он НИКОГДА, НИКОГДА, действительно НИКОГДА не снимает парные кольца, которые у него есть с Хёнджином. И Хёнджин напоминает нам, что они являются «парой колец», так что нет никаких сомнений в том, что они НИКОГДА не снимаются. Они прекрасны",
        "Felix was doing too much saying wallet I love han pointing that out ",
        "3:55 when jisung is not laughing the joke isn't funny",
        "5:47 حبيت كيف تشاني دخل لينو في الحوار بسرعه عشان مايحس انه مو معهم وتشان يعرف كيف انه لينو مايحب المقابلات اللي تكون بالانجليزي لانه يحس انه مو معهم بس تشان حاول يخليه يتكلم ولو حتى كلمه بسيطه أثمن فرقة بالعالم",
        "Wait what I read it as post it or roast it where is the verbal violence",
        "How did Hyunjin's hair grow so fast.. I'm a girl nd my hair takes soooo long to grow so I darent cut em ",
        "regarding the oversized jacket situation. skz themselves clarified that they will not do something that make any member uncomfortable but if they did they will resolve it among themselves. they will talk about it among themselves. So, us fans should just stay within the boundary of a fan. there is no need for us to \"represent\" a certain member to talk about him being uncomfortable around his brothers when the joke around. they are a grown man. us fans should not act like we know them better then the members. alright",
        "minho just nodding is so cute ",
        "one thing about hyunjin and felix is they’re going to bring up their couple rings at every chance they get",
        "Seungmin is so cute in this I’m- my heart bro",
        "can they stop laughing at changbins body type?? what's funny about looking bigger??",
        "I.N sighing when a fashion faux pas is commited.  I stan them all, and this interview counts as a complete reason in itself.",
        "Hahaha the way Binnie acting he’s upset and shoving Seungmin’s arm was soooo cute!!! My bias and biased wrecker ",
        "100% this was one of the 1st interviews of the day and they were freshly pumped on caffeine",
        "Changbin was clearly uncomfortable",
        "Lee Felix being in a real commitment with his Couple rings and Hyunjin...  and the fact Hyunjin just reinforces that they are couple rings \nAlso,  the only thing that Hyunjin takes a solid opinion on.... ",
        "Stay v●te on MAMA AWARDS  and Spotify",
        "lee know literally what are you doing",
        "No one is talking about the misunderstanding \nSkz know and love each other very well \nChangbin my dear there is nothing about you that you should be insecure about \nYou’ve always been perfect in skz in stays eyes don’t worry",
        "Binnie said ghost the scarf 6 times boi  respect",
        "skz need to stop thinking it’s funny to joke about changbin’s weight all the time in name of fun and games",
        "hyunlix couple rings \n\nkinda jealous tho, not for me but for seungmin and jeongin ksbsksbns",
        "Jisung was the only real one when he posted the platforms, like he knows is part of them",
        "I love when Felix talked about that he never takes of his matching ring with Hyunjin! They are literally the cutest thing ever",
        "Hyunlix and their Couple ringsis never ending story",
        "4:53 \"hOoDiEs FoR dAyS\"  Felix, stop",
        "felix talking that he never take off his couple rings with hyunjin ",
        "Them saying ghost platforms as if we haven’t literally seen them in platforms regularly I’m sorry guys but those converse are still platforms you can say ghost it all y’all want but we know the truth",
        "why does han always carry their english interviews",
        "they're so funny i cant",
        "I love the photo of I.N wearing the plaid shirt! Plaid clothes are a big thing where I live.",
        "They broke my heart ghosting the chokers… I wear chokers literally every day. ",
        "STAYYSS DONT FORGET TO VOTE FOR SKZ FOR MAMA WERE SO CLOSE TO THE TOP AND WE HAVE 3 HOURS LEFT PLEASE HURRY",
        "Han>>",
        "han ur accent was sexy\nhyunjin:",
        "Han is so over the top, i love it ",
        "HYUNLIX AT IT AGAIN",
        "I love how we still got a hyunlix moment\nFelix stressing how he NEVER takes off his couple ring is so cute",
        "This was so cute",
        "couples ring? Never take off.....I must of missed something.",
        "not them ghosting platform boots meanwhile that's mainly all what I wear ",
        "?",
        "4:54 Hoodie hoodie negan shim toga ji boogie boogie iepon kogo dance groovy groovy! ️🥹",
        "Whoa! Seungmin with his Casey Kasem radio dj voice ",
        "skz everywhere all around the world!!1",
        "Leeknow 4:29",
        "it was CHAOS before the thing even started wtf",
        "Lino, why is he like this, his mind is not with them, I do not like to see him like this. I wish him happiness. Lino, be happy. I wish you happiness and psychological comfort, and that the smile does not leave your lips. You know that if you laugh, everything becomes beautiful 🫰🫰🫰️️️️️️️",
        "Is no one going to talk about Lee Know’s little dance ",
        "0:56 the fear in Hans eyes  Felix you know he has bad ankels and poor balance ",
        "3:44 hm… lix didn’t need to drag it like that, binnie looked genuinely upset n uncomfortable afterwards :/",
        "His why not is so cute",
        "6:38 Lix loves his couple rings",
        "Lol they are so handsome, I like Felix’s voice so cute and I like how all of them speaks English well, so cuteee",
        "NAHHHH they ghosted the platforms but not the skinny jeans... I fear they may never beat the straight kids allegations.",
        "Love these guys",
        "I'm getting such an \"over this\" vibe from Changbin",
        "Han repeating “POST IT” three times and Chan asking him why and him saying why not ",
        "If you are that sensitive get out of the social media",
        "0:41 OMG i was on the ground",
        "After the whole situation with enhypen and sunoo, I can’t help but feel kinda “uhhh ” after the way skz is constantly saying something ab changbin, I mean yeah they are friends and they know each others boundaries but sometimes idk it just feels wrong when they say stuff.",
        "THE FIRST JEONGIN'S OUTFIT WAS SO GOOD WHY GHOST IT for me that's post it!!",
        "YESSSSSSSSSS FINALLYYY ",
        "OMG this made me so happy yaaayy we love SKZ content ",
        "BINNIE looks great in everything let's stop making him the butt of the joke please LMAO",
        "Eventho I know they are joking, I just don’t like it when they joke about Changbin being big, in contrary, he’s healthy and strong and not to mention overly cute. It’s annoying joking with half the planet watching, unconsciously promoting the image of a skinny unhealthy idol. \nChangbin you are handsome and strong and fit.",
        "I love them so much",
        "skz just like me fr w these trends <3",
        "Wallet",
        "Kesayangan akuu,,\nSelamat 3jt copy untuk MAXIDENT ",
        "Han is such a vibe 🫶",
        "5:53 I like the way everyone raised their hand to give their opinion but Hyunjin is staying like a diva with his legs crossed. And he flips his hair like \"I don't even bother to give my fashion advice, b*tches\" ️",
        "Lee Know look so much more comfortable in this English interview, I hope that he genuinely enjoys it. I just wish he would start trying to say something in English in one of these interviews. ",
        "I love them ",
        "5:21 The repeat of Changbin’s “ghost it” had me dead",
        "Минхо на протяжении 7 минут пытается делать вид, что понимает о чём говорят",
        "️STAY VOTE FOR SKZ ON MAMA AND STREAM MANIAC ON MAMA SPOTIFY PLAYLIST️",
        "Amo a skz pero estoy harta de los comentarios que hacen respecto al cuerpo de Changbin. Ya fue suficiente",
        "binnie we love you just the way you are ️",
        "LETS STOP THIS JOKES ABT BINNIE, he looks incredible, healthy and fit ",
        "Seungmin escaping from the mess they made by messing with Changbin being big 3:58\n\n\"i.. i.. didn't say it..\"",
        "im never getting over felix's and hyunjin's bff rings ",
        "Just please respect Changbin more PLEASE",
        "poor changbin️",
        "Hyunjin hurry up health to your hand ️️",
        "Seungmin: talking abt changbin\nAussie line: joking\nChangbin: •_•\nMeanwhile Hyunjin: I- I don’t know, this is not my idea",
        "It’s the way Seungmin never fails to violate a member literally out of nowhere and act casual that gets me dying",
        "Savage editor The context is more funnier after adding cute and funny shortcuts.",
        "Omg Lee know is just so cute, I'm glad he felt comfortable with this interview and I melted at the way Seungmin complimented I.N's photo.\nI love straykids so much",
        "03:09 HJAJDJSHAHA Hannie tan tierno",
        "Although Minho can't really speak English but the little \"yeah~\" he whispered made me go nuts ",
        "This was so lovely - they all looked like they were having fun - no one looked unhappy \n\nHan - my overhyped little sunshine soulmate (I’d be the same) \nFelix and Chan - keeping it chill ",
        "the oversized jacket part of the video has a lot of stays divided and all i have to say is what chan said i do not think it was meant to sound rude because in recent chan rooms he has said he wanted to catch up with changbin in the sense of getting bulky and it still sounded quite bad",
        "2:59 & 3:15 Han \"your accent was sexy\".. \nHyunjin's reaction was like\n \"processing...\" \n\"What did I just hear?\"",
        "because he's BIG? hyunjin and innie why r u laughing- what did u think",
        "Han repping stays with how whipped for Felix he is ",
        "I.Ns English has gotten so much better! You can totally tell he understands what the others are talking about and he was even engaging in the convos. So proud <3",
        "The fact that felix said his matching ring with hyunjin is the one he NEVER removes is so cute  this friendship is so wholesome and you can’t say no",
        "Changbin we love you️",
        "3:39 Hyungin  was my exact reaction when Seungmin did Binnie (our visual and aeygo King) like that .  Seungmin and Felix trying to save it only for Chan to resurrect the violation .",
        "Haha omg that face when Felix said \" SuffoCatiN\" haha I die",
        "this is so lovely",
        "5:47 just wanted to say that I absolutely love and appreciate Chan for being such a great leader here for giving an opportunity for Lee Know to speak even if it was just one word. Lee Know obviously doesn't feel very comfortable speaking English since his speaking isn't the best although he understands it well, and Chan still made a way for him to interact and Lee Know looked like he appreciated it. Love him so much <3",
        "I love that Felix gets more talkative in English interviews, usually he's pretty quiet. And Han - oh my gosh, a natural-born comedian",
        "The oversized jacket thing I feel quite bad about look at the discomfort and Felix kept going.... ",
        "0:24  go go \n0:42  aggressive quokka\n1:20  seungmin teasing han \n2:04  \"not my story ️\" hahahah",
        "Se puso re serio Han",
        "Changbin. That's all I have to say",
        "0:40 1:13 1:53 2:56 3:38 5:20 6:21",
        "poor seungmin, his words were taken out of context.. and he was trying to justify himself\npoor guy, felt bad afterwards",
        "I love Stray kids ",
        "It's very fun  post it ㅋㅋ",
        "I love seeing Felix talking in his 1st language.\nHe usually doesn't talk much on interviews, but here it was so satisfying to see him was involved more.",
        "1:24 not Felix trying to say that he'd wear chokers, just not chokers w rings...",
        "Please...I can listen to Felix talk about literally anything for 10 hours straight ",
        "6:32 :))))",
        "“You was like wallet and I was like Oooouuuu” ",
        "\"...Stray kids just wearing leather jackets...\"   (Bang Chan) ",
        "I'm not a stay I'm a bit there by chance but wow is there an off button on Han I've never seen someone so talkative  and right next to it there is Hyunjin who is just like an INFP It's really funny",
        "Changbin said dapdaphae about the scarf but the cc saying dapdap bad made it sound adorable :(((",
        "Mano amei isso\nEles estao tao animados, todos interagindo, e o lino parece mais confortável (ta ate dançandinho TT fofo)\nE ainda usaram fotos deles kkk\nPerfeito",
        "why is jisung so funny?? and the british english accent he has makes everything funnier lmfao",
        "this is the quietest hyunjin has ever been",
        "0:40 Stan Short KINGs",
        "Felix kept dragging this bro :/, while SEUNGMIN was tryna explain himself he literally just kept talking over him. WHO does that!? And Chan making the oversized hoodie joke was so unnecessary, you can clearly see changbin was so uncomfortable, they needa let changbin alone fr he’s perfect the way he is. You can also notice no one’s laughing right? Yeah if han doesn’t laugh, means it’s not funny. Before any start defending this please think how changbin felt",
        "FINALLY AN ENGLISH INTERVIEW WHERE MINHO SEEMS HAPPY AND COMFORTABLE ",
        "I know they always tease each other....but they do it to Changbin all the time and always only about one thing...you can always tell that it hurts him...teasing is fun but they should take the time to notice that the go to hard...if it hurts it's not teasing anymore...we should all be aware of that...",
        "I'm just start watching Stray Kids and I'm in love with this cute guy, he is so funny and so entertaining to watch",
        "Does anyone know where I can buy the same or similar platforms Han is wearing in this video?",
        "STAY REMEMBER VOTE ON MAMA FOR SKZ PLEASEEEE ",
        "Han made himself the main character in this interview",
        "5:01 my boyyyyy<333 also ANY THING HAHAJSJS SO CUTE",
        "han jisung in this video, that's it. that's the comment.",
        "who has the other couple ring that felix wears??",
        "the british in han jisung is getting bigger and funnier day by day",
        "I feel bad for that man at the back",
        "I love how Chan is always watching out for Lee Know ",
        "I like how they keep mentioning the couple rings. Especially Felix emphasizing he never take off that ring ever.",
        "Bro Changbin literally be hatin on scarves ",
        "Lmao savage seungmin in the building!!\n Lee know ain't saying anything but the way he's moving in tiny is so adorable sksks \nAnd han jisungs new iconic lines :\nHan:Post it POST IT POST IT",
        "I wish I could watch their full unedited interviews. I’m sure it would be hilariously chaotic and I need it in my life.",
        "Seventeen not covering Felix‘ freckles is the best thing ever",
        "Changbin's grudge against scarves is a whole mood.",
        "Just accidentally paused at 1:30 and can’t stop laughing",
        "Ngl, at 6:06 it sounded like Hyunjin said “Toast it” instead of “Post it” ",
        "I'll say this for as long as I'm alive, BANG CHAN BEST LEADER. The way he's mainly observing everyone, although he could easily carry out this whole interview with his English. Especially around 4:37 and 4:41, instead of taking the lead and answering, he's encouraging the kids to voice their opinions and that's parenting 101. Sir. Mad respect.",
        "2:55 lee know was jealous..",
        "No one:\nLiterally no one:\nBut han: (to lix) your accent is sexy.. man he is sexy..",
        "Respect Changbin pls",
        "Idont know how theres people hate han ...he is such amazing person and so funny!",
        "Chan: Han why?\nHan: why not",
        "0:40 I LOVE HAN JISUNG",
        "I love skz soo damn much but sometimes they cross lines with Changbin",
        "I love their chaoticness, it's so refreshing in some way and lifts everyone's mood",
        "Lee know saying bye in tiny at the end was the cutest thing. Glad to see him look alittle bit more comfortable in English interviews ️",
        "hyunjin is awfully quiet in this video",
        "I love how Jisung's accent just gets more and more aussie lmao",
        "first time I saw lino smiling at a english interview. thanks jisung and chan",
        "Seungmin panicking during the \"changing is big\" conversation is my new reason to live lol",
        "7h ago",
        "seriously, not a stay, but these boys are just born entertainers. so much meme material in 7 minutes! put a camera in front of them, they'll deliver. no wonder they're part of pretty much every type of kpop compilation.    they have a well balanced comfortable dynamic. some jokes, some teasing, some bromance, some tmi, some sincere answers, they always give a well-rounded performance. han is hilarious and has a comeback for everything and bang chan keeps them on track and makes sure everyone is included. i don't follow them a lot but i'm always happy to check out their content when it gets recommended.",
        "right out of the gate Han had me rolling in laughter with his post it Platform shoes, then the compliment of Felix's accent way to adorable.  hahahaha.  Bennie and him repeatedly saying Ghost it, ghost it ghost it on the scarf.  He really doesn't like a scarf covering up his beautiful chest muscles. LOL  Then poor I.N and his plaid shirt... I would post it too baby... Felix..... I never take my rings off. They mean the world to him. Hyunjin smiling and looking like picture perfect and laughing at Seugmin's joke about not liking Han's photo.  Seungmin always the sassy comedian we love.  Lee Know looking so cat perfect you just want to hug him he is so precious.  Bang Chan the best leader as always.  I do have a bias but i prefer OT8!!!!  All 8 are the most beautiful chaotic lovable mess when they are together and you just can't help but feel happy after watching them.....",
        "I.N speaking English is so adorable",
        "Stray Kids ",
        "6:40 couple ring <3\nliterally, these two take every opportunity to remind us of their couple rings I LOVE THIS",
        "if skz couldnt wear platforms anymore they wouldnt have shoes, literally all their shoes are platform",
        "fashion icons of SKZ: Hyunjin, Felix, I.N. as we know ",
        "6h ago",
        "I love han",
        "PLS I THOUGHT I.N LOST HIS CRANIUM UNTIL I SAW HIS BEANIE",
        "Minho just  he's so cute",
        "Han was so aggressive with his opinion on this video.",
        "Chan just sat there being proud of his kids' English, but also keeping an eye on Minho",
        "4:18 Han being whipped by Felix'a accent  and suddenly praise him is just so me, like bruh I can't blame him",
        "Changbin had no business being that adorable",
        "HYUNLIX COUPLE RINGS ",
        "Felix never taking off his couple ring to Hyunjin ",
        "Siempre con comentarios tan divertidos xd",
        "I think these guys are weird I respect the culture but there's something off I won't get into details but looking forward to something new and better then this",
        "SLAYYYYY",
        "나한테는 우리창빈이가 세상에서 제일 멋지고 사랑스런 ",
        "Changbin was such a mood I love him! dap dap baad~",
        "3:01 han again flirting with the members ",
        "hyunlix again made my day",
        "Changbin's and Han's energy in this video gave me the energy I needed for the rest of the day.",
        "Lmao the excitement Changbin had at the leather jacket and Han commenting on how Felix says wallet, forever flirting. They're having so much fun in this video!",
        "5:08 Binnie INSISTING on ghosting scarves had me cracking up \nCan someone translate his reason for not liking them though? 5:28 I need to know haha",
        "I’m happy that Lee Know felt more comfortable with this interview though it was in English, the little dances he made, so cute ",
        "Jisung is so hyped here. I wanna get whatever he's on.",
        "1:02 killed me. Seungmin, wth, i can't-",
        "This is the first time I’ve seen Seungmin double back on something he said to tease like NAW buddy you already said it ",
        "1:22 I am SO weak for him (╥ω╥)",
        "“Your accent was sexy” - Han 2022\n\nAlso Lee Know putting his smol paw on Innie shoulder was so cute ",
        "4:15 omg I.N is so cute, we must protect him ",
        "Lee Know: I'mma just wiggle.",
        "seungmin obviously meant changbin is big because of his biceps. damn why did felix and chan had to add those unnecessary jokes",
        "0:44: post it!!! post Itttt POST!! IT!!! \nhan, why-why? WHY NOT???",
        "COUPLE RINGS THEY SAID.",
        "stray kids please stop being fatphobia let changbin do what he wants",
        "I love lee know is enjoying these interviews little by little more. More love to him ️️",
        "Han & the platform shoes.. makes me giggle tho!!! Han really a funny guy indeed.. and the bucket hat.. you guys didn’t wash your hair?? Lol..",
        "not them trying to body shame changbin again. yikes ",
        "No see-through plastic pants? I’m disappointed ",
        "the way they can get off topic SO easily sjkdfghj i love them sm",
        "Why does Hyunjin look so tired of everyone",
        "I.N screaming post it as soon as it's a picture of him is adorable",
        "seeing lee know happy in an english interview just made my whole year",
        "I’m just living for Han yelling out post it. He has such an adorable personality! That’s why he’s my bias wracker",
        "Hyunjin was very quiet.",
        "WHAT IS WITH CHANGBIN'S VIVID HATRED FOR SCARVES LMAO",
        "han jisung is so real HAHAHHA ",
        "3:46 what was that laugh about Hyunjin and Jeongin ??? ",
        "They are the cutest little girls I've ever seen!",
        "Lee know giggling and smile at 4:59 made my day so much betterr!!\nHow can someone be that cute while giggling?!?!(⁠￣⁠ヘ⁠￣⁠;⁠)",
        "Please i need some han energy in my life that Boi is just amazing",
        "hyunlix what are you doing to me",
        "\"Wait come on. Look at your shoes!\"  I love Han sm",
        "Stray kids …. Should be placed up for adoption ",
        "pls jisung is just so effortlessly funny",
        "So sad Felix and chan literally started ignoring changbin and seungmin after bodyshaming changbin bro like the audacity :/",
        "Lee Know being quiet :/",
        "Hannie took the platform comment personal lol I mean he has a point their all wearing platform's  I can't wear platform's because I trip easily with my own feet.",
        "hes big.....i see",
        "Imma rewatch this with full volume when my kids are awake later.",
        "1:45Chan sounded like he was rapping \n\nMe: aggressively bobbing my head",
        "I laugh each second of this video! Love them so much!!",
        "SKZ",
        "This video added years to my life. God knows we all needed this. Thank you skzzzzzz",
        "Han jisung you freaking adorable adorable adorable",
        "Lee know ",
        "invisible na naman pi si lee knaur T^T HASHAHASHA",
        "Han has a point. They do wear platform shoes. Maybe not those in the picture but they still wear platform shoes",
        "When hyunjin and Felix say couple ring Oh my Gosh",
        "3:50 what was their point here...? Very uncomfortable to watch tbh",
        "If I try to quote every good thing Han says I'd just have to write the transcript of this whole video  he's so funny",
        "Hanjisung is ur  so funny",
        "*Platform Shoes~*\n\"post it\"\n\"post it.\"\nLOL",
        "theyre so fun",
        "everyone but hannie ghosting platform shoes lmao he really likes them",
        "There's not a day that goes by without Han flirting with Felix",
        "The couple ring I love them",
        "Poor Changbin. I feel like every english interview there’s someone that brings up “he’s big” in some way shape or form when he’s not like at all.\n\nI know it’s just friends joking around or whatever but still if they think Changbin is big, what do you think Stays might think how they perceive us? Come on now…",
        "han is way too funny in these english interviews, also changbin is so cute",
        "My boys in green, lookin' hello fine  I was simping throughout this, I almost melted ",
        "I personally feel that Seungmin's comment towards Changbin was misinterpreted since Seungmin is known to not have a good command of English, The problem is that Chan and Félix make jokes to lighten the atmosphere that don't go well and the atmosphere is even more uncomfortable.I hope that people point out that mistake to the boys and that this doesn't turn into a circle of hate because that's not the idea either.",
        "Han: post it. Post it. post it. POST IT",
        "Han's thoughts when Chan asked him why on the platforms:\n\nWE'RE BOTH 5'6 DUMBASS TF YOU MEAN WHY??",
        "Every time the camera cuts to Lee Know and he is just wiggling about in his seat, he is so tiny and precious",
        "I love how Minho is getting comfortable in this English interview. He is so adorable ",
        "If they actually showed the converse platforms instead, that would be a definite Post It",
        "I love this video sm",
        "Assistir ao Stray Kids sempre vai tornar o dia de todos muito melhor!!!!!!!!",
        "BANG CHAN",
        "I loved their vibes in this video. \nOften in these English only videos it's mostly Chan and Felix talking, but Han definitely made sure he was heard.\nAlso Changbin looking somewhat possessed trying to ghost the scarves made me lol.",
        "Felix putting so much meaning to simple words . Like the \"ring\" he Never takes off, i mean he can be the next Taylor Swift.",
        "han saying post it is too funny lmao",
        "Why so cute",
        "Wait hyunjin's hair?  it was short before !",
        "1:02 ONE MINUTE IN AND THEYRE ALREADY CALLING OUR FUN SIZE BOYS OUT",
        "00:23 lee know is such a serotonin boost ",
        "Poist it or ghoist it",
        "The reason why seungmin is my ult is one bc of his talent 2 bc of his savagess(aka personality that is caring but savage)and 3 ofc his beautiful heart and his visuals bc he’s handsome and has a amazing heart!",
        "I love their energy. han flirting with felix, felix speaking the most, changbin getting excited, chan asking everyone about their thoughts, seungmin making jokes (he meant changbin was muscular, y’all took it very wrong), hyunjin and minho not participating much but still smiling. they all look amazing as well. love you guys!",
        "Changbin is so cute haha",
        "Can we talk about seungmin english? it sounds good",
        "Felix I give u my hearthyunlix",
        "Han telling felix that his accent is sexy was a beautiful moment but Lee Know really owned it, the way he was grooving in his seat the whole time.",
        "️STAYS PLEASE VOTE ON MAMA ️\nWE CAN REALLY WIN THAT ONE ️",
        "'I don't like the photo!' Savagemin strikes again.",
        "Not them ghosting flannels but posting vests.  I can not stand by and let this happen",
        "look at your shoes everyone ",
        "4:58 Lee Know so cute",
        "私もお揃いのリング、ずっとしてるよ",
        "HAN‘S ENGLISH IS SO GOOD AND HE‘S SOOOO CUTE IN THIS VIDEO",
        "Of course the short king is gonna say post it for platforms ",
        "CHANGBİNİN KOLLARİ COK İİ",
        "I'm in LOVE with the editing! This video was so much fun and had me laughing the whole time. Thanks Seventeen for having Stray Kids in another of your videos!",
        "1:46 Felix's beautiful freckles <3 <3",
        "Han was fighting for his life with those platforms",
        "« Your accent was sexy. He was like “wowllat” »\n- Han, 2022",
        "The editing on this is perfection. The cuts to Han insisting on posting, Changbin on ghosting, the tiny cut to Lee Know cuz he was rocking cutely…. ",
        "Please tell me I’m not the only one who felt the tension when “ he is big” came up. And the way Changbin smirked tho. ",
        "Lee Know melted my heart away with his smile. The way he showed in tiny thumbs up was just too cute to handle. ",
        "Love it ",
        "All I'm gonna say is usually when no one else is laughing, it's because the joke isn't funny, and you should drop it. Anyways...",
        "han saur relatable abt lix's accent omg ",
        "I just went \"ooh wait I can see some of felix's freckles. let me see the freckles, I want to see more of the freckles\" I basically said that like 3 times",
        "My Love STRAY KIDS ",
        "Han Jisung is funny as always.... I really love his personality....",
        "Guys (Stay) go and vote for stray kids in mama 2022 we are losing go and vote.",
        "jisung is fighting for his life over the platform shoes lmao",
        "I love how people who don't really know them may think Lee Know is quiet... He's quiet in english.",
        "Those tiny thumbs up of lee know ",
        "Changbin we love you forever and you are the muscle king.",
        "OH HI",
        "Los amo mucho jajajajaja",
        "Seungmin ilysm",
        "Yang ternyaman buat kalian aja yaaaa,,\nKarena itu hidup kalian,kalian senang STAY pasti juga senang ",
        "y'all have to admit it, han jisung is everyone's bias wrecker at these interviews. \njust being beautiful, funny and perfect all the time, stOp man",
        "in my heart i just wanna feel like when they were calling binnie big they were also referring to muscle-wise and they just didn't deliver it like they should have",
        "they are funny by default but the editing just elevated that  thanks for inviting them ",
        "3:44 this comment was not nice...",
        "WHY ARE THEY SO FUNNY I'M SCREAMING",
        "The highlights for me Han saying Felix accent being sexy and Hyunjin pointing out the couple rings ",
        "Han telling Felix he had a sexy accent was the highlight of the game for me. ",
        "Han just complimenting himself\nMe: Yes you look very beautiful Han ",
        "They ghosting platform, when they literally wear that style all the timeI love them",
        "i love how much seungmin loves hoodies  he always gets so excited and loves hoodie season it’s cute",
        "2:59",
        "Changbin and Seungmin together is my favorite at the moment, they are so cute together! When Seungmin tried to hug him from the back",
        "i felt soo uncomfortable when they started joking about changbin's body.. they just never quit it do they?",
        "Lee know just having no idea tf is going on ",
        "Los quiero tanto, espero que tengan su buen descanso después de tanto trabajo. me alegran mi existencia ",
        "4:00",
        "Hyunjin and Lee know so quite but damn their visual ",
        "STAYS PLEASE VOTE IN MAMA NOW!! IF WE WONT CATCH UP NOW, THEN IT WILL BECOME IMPOSSIBLE TO GET #1 IN THE FUTURE!! PLEASE DROP UR VOTES NOW! STR34M MANIAC IN BOTH YT N SPOTIFY!! WE DESERVE THE DAESANG!! OUR BOYS NEVER CHOSE TO GIVE UP! WE ARE FIGHTERS!!",
        "Los amo",
        "3:44 I can’t with Hyunjin’s snickering ",
        "I have said this many times but i will never get tired of saying it. SEUNGMIN IS ALWAYS A FREAKING MODE. Like he would stay silent the whole time and then boom here comes that sentence out of his mouth that lives everyone rolling on the floor laughing out loud like its the end of the world ",
        "Han flirting with Felix over his accent being the most replayed part is so on point",
        "Omg why him say this for chanbim?? he looked uncomfortable",
        "Once again, Han is such a MOOD.\nHan: Post it. Post it. POST. IT.\nEveryone: Why?\nHan: why not?",
        "Han yelling to Post the platform boots is sending  ",
        "WTF felix ️️️",
        "ghosted silliness",
        "3:58 SEUNGMIN PLEASE- \"I-I didn't say it.\" *puts hands up * LMFAOO ",
        "Seungmin...... \"Throw it away\"!!!",
        "SEUNGMIN HAS SUCH CUTE ENGLISH! I STAND BY THIS!",
        "Han is so defensive here hahaha",
        "Jisung has me rolling as usual ",
        "Lee know just chilling and having fun with the swivel chair is the kind of good vibes I needed to see",
        "Why did that kid fall 2:52",
        "Skz kings out here making us feel more comfortable and confident. Spread love and sassiness. Yassss ",
        "I love Stray Kids they're so hilarious \nLook at lee know he looks so tiny I can't ️‍",
        "I love the way IN says omaigosh",
        "Lee know is so adorable:)",
        "Hyunjin just be sitting cool and looking hot. No. WORD. Silent.",
        "lmao han's as whipped as us over felix's aussie accent",
        "I love these dorks. Why do they always get crazier (especially han) in the English interviews though ",
        "Happy Minho raising his hand, laughing and shaking his head aaaaaa he's so cute ",
        "The joke was too much.",
        "I like seeing Lee know more invested and interactive in this interview",
        "3:00 totalmente de acuerdo",
        "Changbin being the antagonist of this video in his adorable baby boy English",
        "Han Jisung is effortlessly funny.\nFelix showing up with crossbag but I thought he was wearing a cast.\nAnd, chanbin vs oversized jacket episode with panic Felix and Seungmin featuring hyunjin's \"It's not my idea\"",
        "how the hell did hyunjins hair already grow back help",
        "0:39 Hannie me define, no hay que explicar jaja las plataformas se quedan si o si",
        "Hyunjin didn't say anything like the whole time I feel bad",
        "Changbin is hot, don't talk about her body. He is perfect!!!!!! ",
        "5:00 ka ino uget uget LUCU BGT",
        "Is Changbin okay? He seems kinda upset     :(",
        "Innie is sooo cute ",
        "jisung was WILDING lmaooo that's my baby",
        "Hyunjin is just... there ",
        "Honestly kinda tired of them making jokes about Changbin's body",
        "Worthless civization based on them  they will die first in nady times",
        "how is felix literally the opposite of commitment issues",
        "somehow skz never cease to be the funniest people on the planet",
        "Changbin is so cute, stoppppp!!TT",
        "Minho is so cute just sitting and smiling and nodding and swaying left and right ",
        "why hyunjin so quiet",
        "I am so disappointed. Like you two are grown men and saying that shi-. I really hope you will apologise.",
        "Han is sooo funny in this! I was dying the whole time",
        "Was searching up for kids channel…. And somehow skz is here. Not complaining.",
        "Han in English interviews adds years to my life ",
        "\"GHOST!!!! IT!!!!\" ️ \"GHOST!!!! IT!!!!\" \n--Seo Changbin, discussing either scarves or Supernatural, we're not sure",
        "The English is so good. Like fluent. I don't know why I'm surprised Stray Kids are just awesome in general.\nI can't wait for the concert in Melbourne in February ",
        "After watching this I am going to buy all the POST It clothes that Stray Kids voted for",
        "Jisung is so relatable I love him \nYou know when you haven't washed your hair? Bucket Hat",
        "There’s your everyday dose of hyunlix flexing their couple rings",
        "Hyunjin, my love why are u so quiet",
        "I don't have a bias but Han keeps elevating himself. Love how he promotes himself, preferences, and humor, especially when he uses his humor to point out Felix's adorable Aussie accent.",
        "VOTE IN MAMA PLEASE!!!",
        "I love them. But it terrifies me to see that they discriminate against people based on their body :(",
        "Lee Know being in the center and looking comfortable in an English interview makes me so happy  I’m so proud of him!!!",
        "We love u changbin",
        "1:11 chan: alright ghost it\nHan: wae come on look at their shoes ",
        "I.N was so sad when they ghosted his photo :( thank got he got redeemed\nBinnie is not having the scarf :D",
        "It was so cute to see Seungmin compliment jeongin’s fit and then putting one hand up so he wouldn’t get lonely ️️️",
        "Han is getting funnier day by day, he is truly everyone's happy pil",
        "6:24 i understand you binnie, big rings suck at gym",
        "Not me who did a project about Stray Kids in front of my class ",
        "When changbin doesn’t like something, he really doesn’t like it",
        "POST IT",
        "5d ago",
        "Lee know looked so adorable and cute throughout the interview just wanna squish him",
        "0:44 i love him",
        "skz <3",
        "i'm surprised they know freitag cause that's like THE bag brand in austria and germany",
        "Changbings continuous “post it” had me laughing so hard (at 5:22)",
        "3:22 Jeongin is soooo cuuute pleaaase",
        "Seungmins English ",
        "han just needing to take a second to appreciate felix's accent is so relatable",
        "5:29 \" Dap Dap baaaad :(\" \nhow. can. he. be. so. cute.?! ",
        "Don’t forget to vote for Skz for MAMA",
        "JEONGİN",
        "i loved how Han was so cheerful and talkative hahahahaa",
        "Nesecito más contenido de stray kids",
        "HELP WHY CHANGBIN WANTED TO GHOST CHANS SCARF PIC SO BAD ",
        "Everyone finally agreeing whether to post it or ghost it and then there's changbin with his \"dap dap bad\"",
        "nane hame bts fnaro gaiidam",
        "Lee know is adorable  i think it's so cute that they put him in the middle to make sure he feels included ",
        "I agree with changbin in the scarves, dislike them greatly, even if it’s like -25 out I’ll till try to avoid them haha",
        "Han jisung being a damn mood and a relatable person once again",
        "One of the only English interviews i have seen that Minho looks comfortable in! My soul has gained happiness",
        "ТАКИЕ МИЛЫЕ",
        "SEUNGMIN ",
        "Platform? POST. IT.",
        "Han just like us Fr ",
        "i love how han is saying post it with our hesitation on the platforms\nand changbin saying ghost it every second on the scarf",
        "Thanks for having them on again Seventeen! ️",
        "han had a couple of fantas before shooting huh? ",
        "Aww Lee Know is sooo cute",
        "Felix: “i have more hoodies than ANYTHING”\nMe:”…..can i have one then?”",
        "Changbin:(he's amazing honesty",
        "not senugmin and Felix dissing Han",
        "VOTE MAMA PLEASE",
        "Jisung representing us every time Felix says something",
        "oh boy i haven't been on twitter in a while but i just know the whole oversized jacket segment must've caused huge drama on there",
        "Changbin was very passionate about ghosting scarves I don’t blame him tho",
        "THEY GHOSTED THE PLATFORMS SHOES BUT THEY WEAR THEM ALL THE TIME BECAUSE THEYRE SMALL",
        "changbin look uncomfortable during loose fit jacket talks️️️",
        "the jacket thing was really not funny and unnecessary :(",
        "LOVE YOUU FELİX",
        "POST IT!",
        "0:39 our very tall stray kids ",
        "Ight now han we get it you like Felix get in line man ",
        "skz need platforms to look tall",
        "I LOVE HOW UNIQUE THEIR STYLES ARE",
        "Justice to I.N's shirt !! What a disrespect to the best piece of clothing to ever exist ",
        "Felix and Hyunjin couple ring ",
        "The couple ring is the best \nMy hyunlixxxxxxx ️️",
        "I was just chilling, watching a cute video until Felix pulled up with the 'oh really?' and I saw myself fold like clothes",
        "4:38 \"Photo's cool, I.N!\" - Seungmin in tiny",
        "Post it.. Post IT... POST!!  IT  ",
        "the editor tho >>>>>",
        "Wow, being a plus sized stay sucks if that’s what they think of changbin",
        "3:44 ¿?¿?¿?¿? ¿La necesidad? Que incómodo de ver",
        "Seungmin speak eng why so sexy ",
        "VOTE FOR STRAY KIDS ON MAMA !!!!!",
        "Han is really the cutest human on the planet. He just is",
        "Thank you Seventeen for this interview!",
        "6:39 THATS SO CUTEEEEEE",
        "Han and Changbin infuriate each other for 7 minutes and 19 seconds.",
        "I love how Hans English accent is ever changing. u can hear a lil French accent when he says bucket hat. 1:57",
        "han is so real for the accent thing",
        "Did anyone else catch Seungmin's \"Hawaii five oh\"? Lol so cute",
        "jisung is so funny "
    ],
    "comments_disabled": false
}