{"video_id": "YkZvwVf7F9k", "comments": ["SLAYC GIRLS ITS GOING DOWN", "STAYC arrasando con su debut en japón. Vamos Swith a darle bastente apoyo !! STAYC GIRLS ITS GOING DOWN", "STAYC NUNCA DECEPCIONA, APOYEMOSLO SE LO MERECEN.", "Sigamos apoyando a las chicas están de numero#2 en los chart", "This comeback perfectly repackages their bubblegum pop aesthetic to look more fresh and Japanese market -friendly! The choreography is live vocal friendly and the background track is so danceable  Plus the use of POPPY as a pun for puppy love is so cute ", "essa música é tão viciante, amei! acho que foi o primeiro single japonês da 4 geração que eu gostei kkk", "i’ve seen people hating on the chorus, but the girls that get it get it. this whole song is a bop & stayc doesn’t disappoint as always!", "Deep inside I wished this was a Korean release it's so G♡♡D and so refreshing I love the sound and STAYC makes it a 100 times better with their beautiful voices, their visuals an their performance. The choreo is just so cute and fun I love love love it I hope we get a performance version! ♡", "Esse MV me trouxe lembranças do Kpop de alguns grupos de 2 geração, misturada com a 4 obviamente, essa câmera bem focada nos rostos com esses figurinos e locações super coloridos. E música com estética única, STAYC não erra nunca.", "Yet again STAYC makes an AMAZING song. Not just \"good\", not just \"nice\", phenomenal. They DO NOT FAIL! STAYC JJANG!!!!", "Even in Japanese tracks, STAYC never disappoints ", "6 DANCERS\n6 RAPPERS\n6 VOCALS\n6 VISUALS", "The chorus will indeed be stuck in my head for a while! But like when J rapped, I literally got goosebumps. SLAYC GIRLS ITS GOING DOWN", "fico feliz que a Sumin tenha ficado com o refrão junto da Sieun. combinou muito!!! amei os vocais da Isa como sempre, e os vocais da Seeun são muito agradáveis também. a nota alta da Yoon veio no momento perfeito e também foi linda, e a J no último refrão foi o fechamento perfeito pra mim. MUITO BOM!!! <3", "STAYC NUNCA DEJA ENTREGARNOS PERFECCIÓN CHICOS DISFUEN EN EL FUTURO VOLVERÁ CON MUCHAS CANCIONES ICONICAS", "É impressionante o quanto essa música é boa!", "Nunca mais tinha ficado empolgado com um comeback de grupos de kpop para o Japão, e esse ta muito bom! StayC é perfeito", "Esse M/V está lindo! Adorei a camiseta da Hatsune Miku que a Sieun está usando.", "What I love most on every STAYC's song is the fact that their music is not just catchy and addicting but has so many bright colours surrounding it. Besides, the best part is that they can perform it live and no other groups are doing it better and consistently like them.", "Amo la canción! Me da felicidad saber que tambien hacen canciones japones! Esta canción es un temazo!", "as a Japanese omg I'm so happy to hear this song. I feel like a lot of groups change the sound of their Japanese songs but this sounds like Kpop but in Japanese! I love it", "日本語曲はクオリティが落ちてしまうイメージが強かったけれども、そのイメージを崩してきたSTAYCは、本当に「若者文化を導くスター」だと確信しました", "MVみる度に涙こぼれる…日本語で歌ってくれてることが未だに信じられんし、こんなに素敵な曲で日本デビューを飾って、スウィに贈ってくれてほんとうに感謝しかない…ステイシー愛しています。", "Stayc arraso con esta canción tienen todo nuestro apoyo las amamos ", "STAYC continue to have no bad title tracks. I didn't expect it to slap so hard but it indeed slaps.", "Amei a música stayc vocês são demais", "STAYC yet again proving to be one of the most versatile groups in Kpop \n\nThey went full Jpop and it works. Imma replay tf outta this 100%", "E não é que as meninas STAYC foram down de novo? Sempre entregam tudo e mais um pouco, rainhas da coreo simples porém marcante", "yoon sounds so good in Japanese, I'm amazed. this song is a bop too", "Mano como conseguem fazer só hit??? Incrível eu estou viciado em um single japonês", "Stayc never disappoints. Even if the comeback is in another language. They make it sound so good + charisma<3 \n\nYoons high note killed me! I’m glad she got to show her vocals off! ", "Wow, emocionante ver a STAYC promocionando para Japón🇯🇵", "Tiene todo lo que un grupo femenino necesita, son tan cute^^", "彼らはとても才能があります。私は彼らが達成したことをとても誇りに思っています。日本でのデビューを応援します", "Stay C nunca decepciona con su música.", "this is Sumin's era and you can't change my mind. So happy for her, she never had that much highlight before", "STAYC is true to their vision of not releasing a single bad song. Sieun and Sumin's visual is serving  extra on this MV and Yoon goes high on that note. They simply never miss! Absolute ", "STAYC is one of my top girlgroups. They're literally perfect", "Me encanto el grupo, y la canción se apoya a STACY Team México 🇲🇽🇲🇽🇲🇽🇲🇽", "elas foram tão longe que chegaram a perfeição. que música boaaaaaa ", "adoro conceito colorido e cheio de glitter!!! amei o debut japonês delas <333 tão muito lindas, a música é ótima, o MV é lindo, a formação tá perfeita e os vocais maravilhosos!!! espero que o debut seja bem recebido! <3", "STAYC is a very talented group, POPPY is very addictive, it's art!", "STAYC hasn’t made a song that hasn’t been a banger and I love that for them! They have their own unique sound and they’re so charismatic how can we NOT stan? ", "STAYC AT IT AGAIN I NEVER GET TIRED OF THEIR SONGS", "This music video is so aesthetically pleasing to look at", "STAYC vocês sempre serão famosas!!", "I JUST LOVE STAYC SO MUCH  Honestly my current favorite girl group because they are just amazing & this song was needed~ Been singing it & streaming it like crazy.", "I CAN'T STOP LISTENING THIS MASTERPIECE SLAYC KILLED IT", "whoever designed the set, chose their outfits, styled their hair, wrote the song, produced the song, did their makeup, choreographed the dance, filmed the mv, AND GAVE YOON A GUITAR??? deserves a big wet kiss on the cheek", "Excellent ", "Me encanto la canción, ame el debut japonés con vibras de la segunda generación, escuchando esta canción me recordó la canción de lollypop de bigbang & 2NE1, me gustaría que retomaran este concepto en un próximo comeback, les queda perfecto, una buena combinación de voces y ritmo muy similar a las canciones de 2da generación del kpop", "With STAYC being successful girl group I feel they're gonna last for 10 years or more.\n\nSTAYC fighting!!!!", "OMG¡!!, esta es la primera canción en Japonés de las chicas¡!!-... SLAYYYYYC jamás decepciona¡!!!-... y dioooos, la nota alta de Yoon¡!!  :''D", "STAYC GIRLS NEVER MISS! BOP AFTER BOP NOBODY CAN DO IT LIKE THEM ️", "SIEUN ATE IT UP, SHE WAS BORN TO BE A JPOP SENSATION WITH THAT VOICE LOL", "これ絶対みんな好きでしょ！！STAYCのコンセプトはやっぱり外れない\n日本人気獲得できますように！！", "i was so scared for their japanese debut because I thought it was gonna be one of these japanese kpop songs that have more English lyrics than japanese, I'm glad it's not like that and it's actually an amazing song and the mv is amazing too, stan stayc!!", "Esta canción me encanta ️ Stayc siendo iconica como siempre <3", "Spanish \n\nSTAYC SIEMPRE ARRASANDO CON SUS HERMOSAS CANCIONES NUNCA DECEPCIONAN LAS AMOO VAMOS POR LOS 3M DE VIEWS", "日本語曲なのに歌詞がちゃんと頭に入ってくる…すご…", "SEEUN'S SOFT LIGHT AND FLUFFY VOICE BLESSING US HERE YET AGAIN\nI THOUGHT I WAS IN HEAVEN", "¿Cómo dejo de obsesionarme con las canciones de STAYC? POPPY es muy adictiva", "O STAYC ARRASANDO COMO SEMPRE, TÁ PERFEITOOOO AMOOOOO", "now they are going to be slaying us in TWO languages?!?!?! im shaking", "Las amo stayc!!!  \nLa cancion y baile es muy tierna ^^", "SLAYC NUNCA DECEPCIONA, QUEENS DMS!!", "Damn !! Seeun Visual & Vocal slaying hard in POPPY ! LET'S GO SLAYC", "AMOOOOO, es super pegadiza y me encanta. StayC siempre me alegra con sus canciones.", "可愛すぎる……\n日本語も自然で、日本での曲も力を入れてくれてるのが伝わる楽曲\nほんとーに可愛い……！MVもstacyらしいティーンぽさがあってめちゃめちゃ可愛いし、ビジュも輝いてる･.｡*", "Omg STAYC never disappoints", "Las reynas de la 5ta generación ", "this song is so addictive omg. the synths, i knew it, the producers have to be from korea. stayc owns this bubblegum girly concept. pd-nim thank you for producing such a catchy song! i hope they keep producing for stayc. good job to the members for executing the concept so well", "Things I loved:\n-SUMIN LINES!!!\n-J CHORUS!!! she slayed that\n-They all look so cute", "out of all the j-pop songs i've heard from k-pop girl groups (of 4th gen), this song feels more like a j-pop vibe than most. the chorus is so catchy and captivating, stayc really know how to bring it!", "One thing i must said about stayc is, i can put high expectation on them and they still did wayyyyy betterrrrrrr than my expectation. Something about their music makes me think that they never gave us a disappointment 🫶", "THEY ARE LITERALLY SO PRETTY AND SO CUTE AND SO TALENTED, LOVE THEM SM !!! STAN STAYC <3<3", "um dos melhores lançamentos do ano", "This song is perfect for suckers for the 00s Eurobeat sound it's so nostalgic but also refreshing, I'll never stop loving them", "O MAIOR DEBUT JAPONÊS DA HISTÓRIA", "I can't remember the last time I loved a Jpop song from a Kpop group. This is  ️", "DIOS ESTA CANCIÓN ME ENCANTA TANTO, ESTA TODO EL DIA EN MI CABEZA", "POPPY still feels fresh to me even 3 days after its release", "lets keep going swiths!! for our girls first jp debut <3 FIGHTING STAYC AND SWITH", "AHHH QUE PERFEIÇÃO", "EVERYTHING JUST SEEMS SO RIGHT LIKE THE VIBES THE VOICES THE CHOREO THE COLORS AS ALWAYS SLAYC GIRL IT’S GOING DOWN", "I'm so inlove, ilysm STAYC bcs all of your releases are absolute BOPS!", "OK BUT THE CHORUS COULD BE A TREND- ITS SO GOOD", "the chorus is stucked in my head 24/7", "SLAYC NEVER DISAPPOINT", "ITS THE BEST SONG EVEER MY HEADPHONES MUST BE DYING FOR HOW MYCH I LISTEN TO IT", "I’ve heard that if you stan STAYC, you’ll be rewarded with clear skin and good things will come to you. Having a bad day? Listen to STAYC. Need to study? Listen to STAYC while doing so, you’re guaranteed a good grade. Want your crush to like you back? Send them songs from STAYC and they’ll instantly reciprocate your feelings.", "Stayc não tem música ruim", "STAYCの曲って何回も聞きたくなる！\nMVかわいすぎる", "I don't usually pay too much attention to the makeup unless it's really out there, but the eyeshadow and lashes in this are so pretty! the makeup artist deserves a raise", "STAYC NEVER DISSAPOINTS! I looove this song uhh.. what a jam!! ", "STAYC's no skip discography is alive and kicking.", "VOCAL:100%\nDANCE:100%\nCUTENESS OVERLOAD:100%\nRAP:100%", "la canción es muy pegadizaaaa, las amo stayc, siempre sacando canciones buenas", "this chorus is soooo catchy damn", "THEY JUST NEVER MISS"]}