{"video_id": "YO8QFfIOrGM", "comments": ["Chris's comedic timing and rapping skills has drastically increased through the vids lately. Gotta give that man his props", "Are we just gonna ignore how Kai literally had the chef eat some food off the floor? ", "Chris and Kai fighting is probably the funniest thing I have seen today ", "This man is a walking inspiration", "Chris: comedic timing on point \nKai: always bring the hilarious negativity \nFanum: the guy that don’t even gotta try and he still funny", "Fanum took being built like a Lunch Lady to a WHOLE NOTHER level", "fanum getting riled up over the idea of bacon and cheese egg rolls is too funny", "The fact that Kai fanum and Chris is over here having a food fight and the rest aren't paying it no mind is funny lmao", "It’s not an AMP video without Chris talking to the camera alone at a corner AHAHAHAH", "I wish I was as excited about anything as fanum was about the cheeseburger egg roll ", "One thing about AMP…they never going to disappoint us, they always giving great content that we been asking for! really my motivators on YouTube ️‍", "Duke in the corner “ Ion want nobody saying I started shit” I’m crying ", "Can we get an AMP Bootcamp pt 2? Still the funniest video ever", "I’m still confused on how Chris stole the salad and still lost ", "This is the closest to Monday we going to get boys ", "Agent is such a “just happy to be here” friend and I love it, 10/10", "The way Chris was able to make tears come out in the end during his motivational speech is crazy ", "S/O to AMP For Letting Me Judge Their Hell’s Kitchen 2!!  Chef D The Real Goat!", "Even when he's shouting at us he's being wholesome, this man is a walking inspiration", "This group is the best on YouTube I swear man, the laughs and the energy can't be found like this anywhere else these guys set the standard <3", "It's crazy to see how much AMP has grown as a channel, I remember nearly 2 years ago when y'all had 600k, and now y'all at 2.5 mil, to me, that's crazy, I love y'all, and keep making these bangers. This one had me dead man", "Can we just take time to appreciate how much time and work they put into these videos for us w Kai and fanum", "Charlie is determined to never fail to entertain us every day", "love the childish energy and different personalities really mesh well together everyone feel included. good job on the staff keeping cool and calm during the food fight cause they know the memo of a good video.", "fanums laugh gotta be the most contagious thing bro", "One of the best things is that he never takes credit for himself when he achieves something. He always respect us, the audience, and his team, and he is always polite in all of his videos. We congratulate ourselves on this achievement. More to come and everything to come", "Duke using a wooden spatula while frying food taught me everything I needed to know. ", "Watching Chris get bricked up over Kai’s reaction eating the egg roll has me ", "this was the funniest amp vid yet kai and chris and fauna and Davis got me dead whole time and dukes adlibs in the back of every argument is hilarious", "38:40 Duke had me CRYING this whole part ", "Fanum started clappin hard af for them egg rolls ", "chris has always been the funniest his humor is on a different level", "3:05 Record for Fanum: we’ve never seen him clap so fast and enthusiastically before, rumor has it that he increased his claps per second on this one because he was clapping something else at the same time ", "I never thought he would pass on. it seemed like he would never die, and would continue to make us all laugh and smile. rest in peace, techno  :[", "one of the best thing about dude is that he never takes credit for himself when he achieves something. He always respect us the audience and his team, and he is polite in all his video's we congratulate ourselves on this achievementvh   8-)", "Chris been hilarious love how he's getting more screen time", "Chris crying in a corner the most funniest shit ", "There is so much wonder and pain this episode. The trauma from losing a child is heart breaking and the voice actors have done a phenomenal job portraying the anger, hur", "Chris has become the funniest member of amp, every time he’s on camera it’s must watch ", "Chris acting skills on point. Mans really had tears dropping down his face at the end", "Lemme tell y’all something I’ve been having an absolutely shitty week and this specific video is about to brighten my entire day right now", "Looking back, appreciating how good of a person and how much of a blessing he is to the community", "Only time I see Fanum happy in a full video is when it’s food", "There will never be enough appreciated for the actions that Amp  has taken. Such some good guys.", "I’m so proud of you the dedication determination & motivation you  have to constantly post is everything and entertain your audience at the same time  especially when you are juggling multiple different platforms !!! You make it look so easy and effortless", "I feel like Chris just keeps getting funnier and funnier man", "If we being honest, whatever team Fanum on.. they winning Fanum can chef downnnnn!!! He does ts for real", "Man we gotta appreciate this group while we have em they truly are one of a kind️️", "Chris is the main character. So funny", "davis character development gives me hope. I need to work on my  charisma", "Lets be honest- Ian and Sigils are an awesome team- they make up like two of the brain cells out of the three that the group gets when they put their brain cells together.", "You guys don’t understand how much I love y’all videos and it makes me feel better", "I love how he can never disappoint us with his content", "I swear Chris is lowkey the funniest", "I love howdelivers aggressive positivity to get the message across everyone, to do something good for those who need it", "They way duke looked at Fanum being so happy about the food killed me", "Chris ever seems that cypher u have become my favorite amp member, I’m glad u are in the spot that you are with all ur homies and that the content just keeps on coming for as long as god has planed. Hope nothing but the best for the team and the fam️", "Nah Fanum laughing after Kai said he can’t see out his right eye got me crying ", "Chris literally makes everything better!!!", "I juste woke up and I am so happy to see that you are back! I am starting to watch so I can’t say much but thank u everyone for the nice comments! It’s a real pleasure to come back here with positive people", "Chris had me in tears how he steal a salad and still loose is beyond me ", "Chris is such a mood ", "Chris had me rolling with the Peter Griffin reference. He is the funniest one of them all", "Chris made me damn near choke while I was eating at 6:18 \nAMP never fails to make me laugh", "Seeing Kratos be kinder to his allies and friends makes my heart happy. Also him calling Mimir by his name instead of just 'head' as well and sort of kind of bantering with everyone? Ya love to see it. Also A SPEAR, YEESSSS PLEASE!!! Gods I want this game so bad.", "I just want to says thanks for the long-standing community of nerdfighteria because I’ve probably heard this story at least three times, but it’s always wonderful. It’s very much like hearing the stories your friends and family tell again and again", "Bro Chris going crazy over the egg rolls is comedic genius", "I love how Fanum made Chris look like a side character", "To whoever is reading this keep going, you’re doing fine! No matter how slow your progress, each new week is filled with tiny steps forward. Be proud of yourself you got this", "Amp is missing the guys like Omar , Low, Aim  they just make the videos more organized it's hard to determine what's going on now at least if it wasn't organized the way chris use to edit was easy to follow", "Yall always come thru with the laughs ", "This is even funnier than the first one, I wished that Chris be thier editor again, the should do another AMP survivor", "bruh AMP videos are straight up good laughs and vibes. yall boys killin it fr", "WOW!! this was actually a good ass inspirational story lmao Chris went from being no help and being at his lowest mental point in life due to his lack of culinary skills, but flipped the script when he decided to instead double down on his strengths, team morale, keeping the guys together, providing the laughs, and ultimately the victory for the Black Team all while earning MVP for the team. Absolutely inspirational.", "No matter how mad these guys get mad each other for the things they do at each house they get I’m glad there able to come back together I love this group", "Cameraman Chris congratulating AMP Chris is the Chris’est thing I’ve ever seen Chris’d ️", "Bruh! If we dont start giving Chris his flowers, homie is pure comedy", "Lol amp gonna be lit every time never disappoints", "Can we just take a moment to appreciate that he does the extra side missions and shows off extra unlockable gear and moves instead of rushing through the story", "Fanum we were definitely missing your presence in these AMP videos", "Well there's one thing that is now undisputed,  Mick is a composer of more than just music. Good to see him branching out", "Chris: \"we get to eat their art\"\nAgent: \"Mhm\"\nChris: Then we get to shit that shit out\"", "That's bold af when @19:47 Kai is straight up holding a kitchen knife when Davis messes with him ", "We all gotta appreciate the actions of these guys do for us to have a great video. AMP are such good guys.", "Duke randomly screaming f*ck always gets me", "Why does Kai look like he gonna say” welcome to good burger home of the good burger CAN I GET YA ORDER”", "Am I the only one that loves Fanum’s laugh? ", "Part 1 is one of my favorite AMP videos we finally getting part 2", "chris was the most funniest on thisi died when bro said \"what it taste like\"", "I’m happy people are realizing how funny Chris is", "fanum's laugh is literally contagious", "This was cool but I’m still waiting for a not rigged AMP cooking challenge", "Love your coverage for these games, would love a video covering the \"blank places\" in your spreadsheet (maybe after release) and any chance for a FAQ video for things like if date change affects spawns, how Terra raid dens work, I know that sandwich vid is coming  super excited and maybe a video for each different way the game is played (the school challenge, treasure hunt, cooking challenge and the gym challenge)", "The boys have been real consistent I love to see it", "That \"I'm free\" quote at the end really hits different after his passing. Rest in peace, Techno. You will be missed dearly. >:-O :-o", "so we just gone ignore the fact that they let that man eat the salad that kai picked off the floor........that man gone be sick in the morning ", "Chris at 6:17 killed me with laughter", "great vid boys , bringing smiles to even the darkest of places", "This man Chris said \"Duke just told me to hit the Dougie\" then Duke said \"one of his weaknesses is life'", "THE FOOD FIGHTY WAS CRAZYYY LMFAOOO yu guys gotta stay together for as long as possible"]}