{
    "video_id": "YO8QFfIOrGM",
    "comments": [
        "fanum the ",
        "They gotta keep doing amp hell's kitchen ",
        "KAI SHOULDA SAID \"Welcome to Good Burger. Home of the Good Burger. Can I take your order?\"",
        "I've been hyped for this one!!! Keep up the good vids AMP!",
        "Fanum brafood don’t slap it smackkkk",
        "@12:36 fanum is definitely me when it come to these type of situation ",
        "Is this a new editor?",
        "They should’ve stopped the food fight shit they kind of messed the video up with that.",
        "Duke Dennis just good at everything and win everything. Duke Dennis just be winning at life just 4 existing fr.",
        "Trail mix ",
        "What the fuck is up with Chris and being in corners ",
        "S/O to AMP For Letting Me Judge Their Hell’s Kitchen 2!!  Chef D The Real Goat!",
        "Why ruin that kitchen and be immature like that these guys gotta learn to mature up especially Kai Chris and Fanum",
        "No way Kai let him eat that shit️",
        "The fact that Fanum started bussin up when Kai said he can’t see through his right eye  @20:37",
        "Chris has become the funniest member of amp, every time he’s on camera it’s must watch ",
        "If Chris don’t drop song 1 and 3 I might get upset",
        "Hmmmmmmmm",
        "i know this boutta be fire",
        "“This is Chris he’s with us” is crazyyyy",
        "They all look fried ",
        "amp>> Spanish class",
        "Nahhh fanum said how did duke win he can barley speak English",
        "Hell nah they paid the chef off ",
        "“What would peta say about this” \n“He talkin about griffin?” -Chris ",
        "Hi all I just wanted to share something very important. If you don't have a relationship with Jesus Christ as your Lord, here is your sign to turn to Him!   This is the most important thing you'll ever hear in your life. Jesus is coming back soon! God sent His only Begotten Son into the world, that whosoever shall believe on Him shall not perish but have eternal life. Those who do not believe will be condemned. (John 3:16-18). Jesus died for our sins, and to set us free from our sins and condemnation (John 8:36, Acts 13:39). Jesus rose from the the grave 3 days later after His death, defeating death. He now lives forevermore, and seeing we have saving faith in Him,  we too will live eternally with Him! Jesus is the only way to Heaven (John 14:6). Following Him is the best decision to make in life. Though the Christian life isn't a life absent of difficulty, despite any circumstance Jesus gives true peace and fulfillment, a peace and fulfillment this world cannot give (John 14, John 16).",
        "Chris is like the friend in the group of 4 when the teacher says groups of 3",
        "No matter how mad these guys get mad each other for the things they do at each house they get I’m glad there able to come back together I love this group",
        "The hint at the dwarves being shocked to see Brok was brilliant, since he's supposed to be dead.",
        "davis so fine brooooooooooooooooooo",
        "nobody talking bout how good davis been looking recently",
        "wtf is wrong wit yall lmfaooo when yall started poppin in yalls sentences ",
        "this wakanda add bro......",
        "Chris dramatically falls on the floor at some point in every episode bro  somebody needs to make a compilation of his dramatic falls ",
        "Duke so fine foreal though like gawdamm \nDuke the finest \nFanum and Kai the funniest most goofey ones \nAgent the brains",
        "Its not my fault I didnt wear protection is now my #1 Delirious Quote of all time",
        "“That sh*t look like trail mix” ",
        "This video so unorganized",
        "Chris always gone be in the corner crying  am dead",
        "Ah ah ah y’all cameraman is not it, dub buddy word !!!",
        "They really  know how to cook?",
        "Hi",
        "Chris nd u stole it  nd chef still said it an’t make da cut ",
        "Davis got a new cut and tried to turn into a hardass",
        "I’m kinda triggered that he’s using oil to cook bacon… do you know how much oil comes out of BACON????",
        "The energy is not the same it all seems forced and that makes it hard to enjoy. Forced laughs, forced jokes, and a forced smile",
        "Duke laughing like someone uncle",
        "Seeing Kratos be kinder to his allies and friends makes my heart happy. Also him calling Mimir by his name instead of just 'head' as well and sort of kind of bantering with everyone? Ya love to see it. Also A SPEAR, YEESSSS PLEASE!!! Gods I want this game so bad.",
        "It’s cuz Duke was on that team",
        "Duke and Chris funny asf ",
        "47:44 Fanom doing d your honour \n\"Im better than yew\"\n\"Mi souce better than urs\"",
        "12:39  ",
        "Chris is the main character. So funny",
        "6:21 Chris funny af ",
        "Every time kai speaks I got to lower the volume back down",
        "nah they really top dawgz on this youtube shit ",
        "chris is funny asf",
        "Chris has gained the respect of all he is officially the leader of amp",
        "Shorty I ain’t stop laughing since I clicked on this video ️",
        "inshallah Alha guides Kai Ameen",
        "6:18 this had me rolling",
        "12:00 why did he have TJ cut Kai off like that his bars was fire",
        "Yall can literally drop anything anyday and more than EVERY MONDAY! and it still wont miss! ️ #imlicense",
        "20:37 fanum laugh took me out ",
        "This is literally Hell's kitchen ",
        "One of his weaknesses is LIFE ",
        "11:21 ate .",
        "Who tf say slap? Food don’t slap. Food shmack. Music slap ",
        "Duke: Chris You Deserve This\n\nKai : Aw Thas Some Bullsh-",
        "MashAllah brother Kai looking out for Agent ",
        "Mamadukes deadass be making those cheeseburger egg rolls for lunch sometimes ️",
        "Bruh really said everybody ain’t good at everything and one of his weaknesses is “Life” ",
        "Group is to young to stop now",
        "They got Riodayoungog as the chef",
        "7:24\nI love the attention to detail! His arms go right through the text.\nGive your editor a raise, Jimmy!!",
        "Duke looks like Tyrese Gibson FR ",
        "Camera man’s are instigators ",
        "It's so crazy how I literally just watched the other one yall did 2 years ago then y'all drop thisgreat video gangy️",
        "Y’all should do a video of y’all making seafood and eating it",
        "Let’s gooo been waiting",
        "11:55",
        "Need a full version of “Sizzle” ",
        "so we just gone ignore the fact that they let that man eat the salad that kai picked off the floor........that man gone be sick in the morning ",
        "chef was tired of them man",
        "they said fuck the video and started a food fight",
        "Davis: You know how wide your throat has to be ? \nAgent: That’s not a problem for you… ",
        "$20 for oneee?? Ya bugging",
        "Can we just take a moment to appreciate that he does the extra side missions and shows off extra unlockable gear and moves instead of rushing through the story",
        "kai saying fanum  can u do something for me is to funny",
        "This might’ve been the most annoying I’ve ever seen Kai, he almost made the video unwatchable.",
        "amp really up bruh the quality is so fye and everything bruh",
        "17:11 Wait dare I say it but davis is up there with funniest AMP member these days",
        "Only Davis would begin the video with a throat joke ",
        "“Of the bus n*gga” ",
        "Duke using a wooden spatula while frying food taught me everything I needed to know. ",
        "yooooooooooooooooo",
        "Fanum a professional eater",
        "Kai just steal they joke and say it louder",
        "The amount of cringe I got in this video is equal to the laughs but its str8 tho cuz I laughed plenty of times",
        "FIRE VIDEO W AMP taking over on GOD",
        "When did Mark aka WARK/LARK join AMP??? Oh wait that's DAVIS! LOL!",
        "50:47its time to wrap up fanum still cooking",
        "10:35by the time la was halfway done Fanny was already done with the whole thing",
        "Thanks for posting boys",
        "I don’t know why, but I mostly be here because of Chrisbro funny asl",
        "walid so messy i love it lmaooo",
        "my man davies looks like 50 cent tho",
        "Chef couldn’t get a word in",
        "Chris finally becoming a main character",
        "duke,agent, and davis was drawn the whole video ",
        "duke, “yk everybody ain’t good at everything, one of [chris’s] weaknesses is life” ",
        "Chris is just Greatness and Hilarious.",
        "Bro kai gettin to crazy, like can we tell this nigga chill sometimes like not every video gotta be you cuttin off the chef guest or makin the content go left! I get your young but damn",
        "38:52 LMAOOOOOOOOOO! Davis done got soo wild on cam",
        "Chris is too funny lol",
        "\"Thats stuffforelive he cant eat that\"",
        "38:42 duke got me cryin",
        "Nigga fanum funny as fuck",
        "thought duke said he leaving amp",
        "I’m still confused on how Chris stole the salad and still lost ",
        "L Kai for letting him eat that Shii",
        "bruhhhh chris upload on mondays niggaaaa",
        "Phantom soo big don’t even fit in the parking spot",
        "Fanam thincs dat the egg role will chang the game",
        "If you enjoy this kind of content CONSIDER Subscribing! <3",
        "Kai says “nah he might be talkin Parker “i said nah that’s crazy",
        "38:00 duke turned into Kevin gates",
        "I love it",
        "33:01",
        "I might be in the minority but I feel like a lot of this could’ve been edited out",
        "Watching Chris get bricked up over Kai’s reaction eating the egg roll has me ",
        "audios messed up around 20min",
        "Proud of Chris fr ",
        "Not Kai saying ASTAGHIRFULLAh",
        "10:12 nah chris sendin us back 300 years for that bruh",
        "W video. I laughed all the way through the video. I really appreciate the laughs your videos give me AMP! Never stop making great content ",
        "“Aye Duke why you in the corner?” \nDuke: Ion want nb to say I started it  the shadddddddeeeeeeeeeeee",
        "Agent about to commit haram and fanum too excited about food ",
        "Yooo go crazy love what you guys are doing!!!! You guys give me motivation to make more money and do better just from these, all love",
        "chris mvp of the vid lol",
        "“Who would have the most lucrative onlyfa-“ \n“Duke Dennis”",
        "️️️️️",
        "Chris is Hella funny",
        "36:54 LMFAOO",
        "God loves yall",
        "W video gang , Chris was really the mvp lol",
        "Davis puts garlic powder in somebody face then acts surprised when it burns",
        "no way the white team gonna lose when they was late.",
        "Believe in our Lord. \"For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life\" (John 3:16).",
        "Fanum said “I get first bite” ",
        "Mm yes tasty tradition I do miss me some classic and TRUE trolling",
        "LMAOOOO Kai describing the food got me hungry asl",
        "14:48",
        "Yall always come thru with the laughs ",
        "is the audio messed up for anyone?",
        "‘’Look at the cheese ‘‘",
        "You can only like this if you didn't come from Tiktok",
        "Bruh Kai always about a “after that”",
        "All the raps go hard",
        "Duke: whatever you don’t eat I will. Lol",
        "It's the \"Mmmmmmm\" after anything somebody said in the beginning of the video for me lmao ",
        "Duke said davis shit look like trail mixxx!!! Im screamingg",
        "Agent gonna leave and imma be pissed ",
        "Lmaooo Kai and Agent are literal sore losers. They hate taking L’s. Davis is the only one who took the L and still laughing. Kai and Agent can’t stand losing so I love watching them lose lol",
        "Chris is stealing the show these days",
        "am i the only one who think duke dennis looks like future",
        "you really let chef eat Kais salad after he picked it up off the floor.. grimey",
        "Why the Marines ad at every video constantly tryna recruit blacks",
        "This dayum video was everywhere ",
        "I like daviss wayyy more with his new haircut… he look good",
        "duke still tight",
        "Kai cenat  the silent kid with the stare down to fanum ",
        "seems like everyone enjoyed making this one",
        "Chris always crying at the end lmaoooo",
        "First part wasn't cool ngl, glad Kai ran out of energy by second half saved the video",
        "Davis takes these from professional to immature. I know he’s young but still",
        "Cnt Stand Duke . 25:57 ",
        "Is it just my screen or is the video and audio aren't lined up",
        "Every time I see Davis he gets finer",
        "Where the thanksgiving vid",
        "Chris funny asf lmaoooo",
        "\"one of his weaknesses is life know what im saying\" lmfaoooo",
        "We know whatever team Fanum on they gonna win everytime ",
        "You guys use the N word too often. You're intelligent to have put this show together, but you will limit yourselves if you don't have professionalism.",
        "So we not gonna talk bout how Kai n fanum only niggas worried bout the food n errbody else just rapping n shit ",
        "Nobody \nThem:Mmmmmmmmmmm",
        "Y’all was fried making this video ",
        "hahahaah",
        "Woooaaahhhh y’all heard that nigga Chris farted 48:45 bro he gotta be the funniest one",
        "Kai be playing too much",
        "8:20 ",
        "The audio is messed up for fire sticks ",
        "AYEEEE HOW U OPEN THIS SHYYYT LMAO THIS WHOLE SHIT GOT ME ROLLLLLLLIN ON",
        "The way Chris was able to make tears come out in the end during his motivational speech is crazy",
        "Johns getting wild!",
        "This was cool but I’m still waiting for a not rigged AMP cooking challenge",
        "@12:42 kai what did you say? She wanna be ya wattttt?",
        "I see why Duke be gone 75 % of time  but I’m old",
        "Chris was the highlight throughout this entire video ",
        "This definitely fanum favorite vids to film",
        "Them cameramen starting to think they in AMP or sum, why the hell these niggas got so many lines",
        "AMP sleepover would be a fire video",
        "Gotta love AMP ",
        "World Cup. Argentinia. Speed is so humble. Bless him.",
        "Them chairs in the stream with adin was compromised huh fanum",
        "Ima meet y’all one day soon when i blow up gang ",
        "Random guy in the food fight need to chill",
        "25:58 duke: that shi look like trail mix !",
        "Hii people’s I’m new to YouTube I just posted my fists skit on YouTube",
        "chris has always been the funniest his humor is on a different level",
        "Editor went crazy on this",
        "can we pls have 8:20 on spotify ",
        "We needed that lil Chris confessional  , great video!",
        "Chris needa leave that dope alone ",
        "Palito de grane 🇩🇴",
        "Chris deadass kills me with laughter with that emotional shit he gat on fr fr ",
        "Praise God!",
        "Chris crying in a corner the most funniest shit ",
        "That dead drowzee trade for a moltres with a revival herb is just lore.",
        "CHILDREN VS ADULTS PRETTY MUCH ",
        "15:55 the finger lmaooo",
        "nahh this was pure comedy ",
        "I see what duke be saying now",
        "We got a special sauce here…. How special is it. Yoooo ",
        "Consistent AMP ??",
        "fanum's laugh is literally contagious",
        "Peta griffin is crazy ",
        "Nah Fanum laughing after Kai said he can’t see out his right eye got me crying ",
        "I had just rewatched hell’s  kitchen 1 yesterday and I was like “what if they finna post another Hell’s Kitchen that shii would be ” and it happened",
        "Can you do something for meee",
        "yea we cookin in this bih i said sizzle",
        "They WAS LOWKEY SPITTIN",
        "He couldn’t do it ",
        "kai struggling to open a can\n\nkai - how tf you open this shit ",
        "22:06 W bully",
        "Only time I see Fanum happy in a full video is when it’s food",
        "Yo y'all is down bad for this video",
        "This one of da funniest amp videos I watch bro  top 5 fasho",
        "Lemme tell y’all something I’ve been having an absolutely shitty week and this specific video is about to brighten my entire day right now",
        "Kai is doing to much for the vids now",
        "“Astagfirullah bro he can’t eat that” ayeee",
        "Vibes feel like we all boys right neow",
        "28:54 LMOAOAOOAAAAA",
        "This is the best group on YouTube like if you agree if not we know we’re you stand",
        "Kai Naruto ran from Chris ",
        "44:53 ️️️️️️️️️️",
        "The boys have been real consistent I love to see it",
        "agent not supposed to eat pork but he also not supposed to use profanity.. might as well just eat that bih a sin is a sin ",
        "\"GIVE SHAWTY A BACKON HAMBURGA EGG WHOAAS\" THESE NIGGASSS LMAOOO",
        "Chris is becoming my favorite person on the internet lmfao ",
        "DAVIS IS A WHOLE DIFFERENT PERSON",
        "This vid all over the place ️️",
        "Have a good day God’s love you",
        "bruh for some reason I thought they were high the whole vid",
        "Hmmmm dread grew a lil to long kc3",
        "This very tasty burger",
        "Fanum dancing was ma funny",
        "Yo",
        "DID SOMEONE PEEP THE ASMR IN THE BACK 21:25",
        "Chris is hilarious",
        "kai’s inches went in the wrong spot",
        "Y'all dangerous Fr tho, too many big knive in the kitchen for all that playin!",
        "Fanum got a different type of energy for these videos ",
        "I didn't know I missed them til this video ",
        "This video went left…i didn’t know what I was watching after a while.",
        "Kai, And Quit Guy Is The Best Combo IN AMP them 2 are genuis ",
        "Chris madddddd funny",
        "IM WIT DA BLACKS BABY... HE SAID BLACKIDYBLACK YEA IM BLACK YALL FACTUALL",
        "amazing video",
        "There is so much wonder and pain this episode. The trauma from losing a child is heart breaking and the voice actors have done a phenomenal job portraying the anger, hurt, and pain. Freya, choosing restraint despite her own grief is powerful. The grandmother rejecting her granddaughter because shes scared to love anyone else because they might be taken away from her again ?",
        "Chris's comedic timing and rapping skills has drastically increased through the vids lately.  HA HA ",
        "19:25",
        "Chris over here like he won a championship…congrats to you my boy ",
        "who tf davis think he is now",
        "When we go get a new video wth",
        "Video funny Asf! \n\nUnpopular opinion:",
        "FOOD DONT FUCKING SLAP IT SMACKS OR IS SMACKING \n@fanum",
        "i never seen fanum so fascinated ",
        "I stg kai n fanum’s energy is unmatched",
        "kai n chrome hearts",
        "fine",
        "That free style hard af boy ",
        "Duke face @7:39",
        "I see why Duke don’t wanna be at the house…",
        "32:23 thought fanum was the girl him for a sec",
        "They should do an Amp Big Brother video. They do comps and vote each other out with the video confessionals. That shit would be comedy",
        "get a new camera man asap !!",
        "Chris literally makes everything better!!!",
        "Fanum’s excitement over the eggroll is me ",
        "Boy, Ain’t no way boy, Kai let him eat his salad after getting it off the floor ",
        "Chris is gonna make it big",
        "I'm confused, what did Chris actually do ",
        "Not good at life is crazy ",
        "A FOR Effort !!! LMAO ",
        "Chris is the highlight of every vid looool",
        "Can AMP go to space? ",
        "Amp is missing the guys like Omar , Low, Aim  they just make the videos more organized it's hard to determine what's going on now at least if it wasn't organized the way chris use to edit was easy to follow",
        "I don’t think Fanum meant “He’s with us.” In a bad way. He’s just so used to being Kai’s duo",
        "Davis got a cut",
        "Make sure u get sum kiwi see it  “duke”",
        "I crack up so hard watchin duke DIE at chris. Duke may got unspoken rizz but chris got unspoken comedy CAN I GET A AMEN. (dont glaze just drop a amen)",
        "This is a banger video",
        "I love Chris",
        "Chris at 6:17 killed me with laughter",
        "It's crazy to see how much AMP has grown as a channel, I remember nearly 2 years ago when y'all had 600k, and now y'all at 2.5 mil, to me, that's crazy, I love y'all, and keep making these bangers. This one had me dead man",
        "One of the best things is that he never takes credit for himself when he achieves something. He always respect us, the audience, and his team, and he is always polite in all of his videos. We congratulate ourselves on this achievement. More to come and everything to come",
        "Amp falling apart",
        "Nooo why did Kai let him eat the food that fell on the ground  I love AMP tho 🫶",
        "Fannum laughing at Kai for not being able to see out of he’s right eye got me dead",
        "The fact most of them was cookin w straight knives ",
        "Never forget God loves you and is our lord and savior",
        "Is this sidemen 3.0? Sidemen 2.0 is beta squad",
        "ASMR COOKING WITH CHRISS LOL",
        "I'm dedd Davis said how df u get line by a btch at 17:19 outa no where",
        "“Fanum can u do sum fah me” killed me",
        "WHY DID FANUM CLAP SO HARD FOR THE BACON CHEESEBURGER EGGROLLS? LMAOO 3:05",
        "Nah ya gotta pay attention to Chris dum funny!",
        "This is why we watch AMP !",
        "This is very good video",
        "Icl Kia acting like he bigger den everyone , I don’t f wid that icl",
        "Davis got ROCKS in his ear !",
        "Chris nyc instigating be killing me like shut up bro",
        "Shout out to Baldwin Wallace",
        "chris bodied that freestyle like worddddd.",
        "Please bring another AMP Bounty Hunter video!!!!",
        "Agent is a lame",
        "I love Chris too funny",
        "bro's weakness is life",
        "WAVIS coming outta that lil reserved shit I love it",
        "FUNNIEST VIDEO ONG, THE FOOD FIGHT HAD ME DYING AND SPEARING FOOD ALL OVER THEY SHIRT WAS FUNNY ASF",
        "fanum getting riled up over the idea of bacon and cheese egg rolls is too funny",
        "Kai foul",
        "Yoooo what’s the song that Kai was humming , like “ duh duh dada duh duh dada duh “",
        "38:22",
        "This is the closest to Monday we going to get boys ",
        "This this very funny video ",
        "Fanny funny asl He like blue clues you know why she like where ya height omgaaaaahhh ",
        "I juste woke up and I am so happy to see that you are back! I am starting to watch so I can’t say much but thank u everyone for the nice comments! It’s a real pleasure to come back here with positive people",
        "Lmaowhy that 80s porn music start playing when Duke introduced himself hahaha",
        "#2 TRENDINGGG YESSIRRR",
        "3:00 \"type shit\"",
        "Yo chris be having me dying",
        "AMP didn't even make it past the appetizer",
        "I miss the free roam videos of yall doing random stuff  :)",
        "They have cheeseburger egg rolls at Cheesecake factory lmao",
        "I love davies bullying other people now he finnaly grew up ",
        "Real ones know, Sigils's humor is high tier",
        "TOUR DE BROWARD LMAOOOO",
        "\"he talkin bout griffin?\"",
        "Agents face when the head chef said \"bacon\" ",
        "Watching Kai dull out the knife In begging pains me",
        "This video is hilariously unpredictable ",
        "Ah",
        "i swear this how i imagine all my nieces and nephews will be when they get older. bunch of bad ass kids but hilarious",
        "He talk about griffin LMAOOOO",
        "I love your videos soooo much and they make me  happy every time, thank you aphmau",
        "Davis just looks zesty",
        "We got two amazing Hells Kitchens by AMP and SomeBros",
        "Ain’t no waythis dude Chris really started shedding tears",
        "Fanum tasted everything with his eyes before it was even prepared ",
        "how duke remember abt pangea that was like 20 years ago when he learned abt that ?",
        "Bruh the chef really ate Kai’s floor salad ",
        "Nice video",
        "Yall trippin makin dese long ass 1080 videos yall got money up dhat bit to 4k",
        "Fanum and Kai were chaotic lmao",
        "The REST OF THE INCHESSS….. \n\nWhatttt!!!",
        "Bruh Kai is a gremlin he always up to no good lmfaooooo",
        "I just saw a marines ad with the quote “any means possible” they made it",
        "31:07",
        "4:10 BECAUSE TONIGHT WILL BE THE NIGHT THAT I WILL FALL FOR YOUU .",
        "Part 1 is one of my favorite AMP videos we finally getting part 2",
        "20:32 gotta be the funniest of the year yo ",
        "I really would have liked to see them take it a little serious bc the chef looked like he wanted to really teach them lol",
        "25:55” dat shit look like trail mix”",
        "That one Cameraman is literally the devil on your shoulder ",
        "5:32 NO LICENSE ?",
        "Am I the only one that loves Fanum’s laugh? ",
        "\"One of Chris's weaknesses is life\"  got me ",
        "davis had a unexpected glowup, he look cuter now",
        "ART IS ART LITERACY",
        "Why he say it so hard 30:14 ",
        "Aye chris Talm bout broward county he better tighten up  Yeen from here woe",
        "Dukes adlibs were heat ",
        "i love fanum",
        "I watch the old amp Hell’s Kitchen every month",
        "Thank you for such great content guys! I really appreciate it.",
        "W agent",
        "Walid is a producer fr, always instigating drama on the low. ",
        "I noticed that Duke got a lil serious in the past few AMP vids. Like he's to mature correct me if i'm wrong.",
        "We all know there will be rage and we love it. :*",
        "Smh y’all childish sometimes over do it y’all funny and all I hope y’all picked up y’all mess lmao",
        "\"Parsley is make-up for food\" this is a legit explanation of a garnish XD i love duke lmao",
        "Ngl Agent wasn’t mad enough for me about the oil ",
        "AMP Drag racing?\nFanum vs KC3000\nDuke vs Chris\nAgent vs Davis",
        "Kai can yu do sumn for mehhhh",
        "I was literally thinking about a Hell’s Kitchen 2",
        "this was by far the most chaotic haha love it",
        "3:16 this scene is screaming back when KAI accidentally gave Agent Pork",
        "“The Lord is not slow in keeping his promise, as some understand slowness. Instead he is patient with you, not wanting anyone to perish, but everyone to come to repentance.”\n‭‭2 Peter‬ ‭3:9‬ ‭NIV‬",
        "1:04:27 this is why proximity chat is good",
        "Nobody - Chris trying to be funny \n\nMe : ",
        "19:36 you can tell agent a peaceful guy but they be testing his patience ",
        "yea AMP has officially fell off",
        "davis character development gives me hope. I need to work on my  charisma",
        "Did them so dirty w the winner reveal ",
        "Just wanted you all to know that Jesus loves you and died for you on the cross..have a great day",
        "Okay but Kratos trying to show affection towards animals is the single best cutscene I've ever seen.\nKratos: \"Do not...be afraid.\"\nKratos: \"Good...boys.\"\nFreya: Girls-",
        "Full blown Karen at the end ",
        "AMP is a family, there is no other squad on yt with real legitimate chemistry",
        "20:35 hahahah im dead fanum is a mood",
        "Ever since duke got dreads he switched up. He boring now",
        "I wish these niggas had a solid upload schedule whether it’s every week or every two weeks just sumn we can count on and look forward too  the uploads be so random  dope vid tho",
        "Fire content ",
        "Bruh! If we dont start giving Chris his flowers, homie is pure comedy",
        "This video made my whole week bro 🥹 gotta love AMP ️",
        "lmaoo chris got bullied whole vid bruhhh #stopchrisabuse",
        "Bra fanum said “you put her personal sauce on this nigga”",
        "W Chris",
        "Chris high? Lol",
        "Duke couldn't resist KC3000's hug",
        "Chris is funny!",
        "Yk what will be fire if amp and RDC have a cook of",
        "21:30 yall hear that",
        "Duke: I am just minding my own business “type shit”. (In a corner)",
        "Fanum ain’t missing this one lol it got some to do with food",
        "so the chef gone just jack OY?",
        "37:43",
        "@netflix @hulu give these boys a ",
        "Chris made me damn near choke while I was eating at 6:18 \nAMP never fails to make me laugh",
        "Chris is the funniest ",
        "Very interesting video bro. Just go ahead. Wish you all the best.",
        "Fanum was like \"SALAAAAAD??!!!!\"",
        "Duke's humour is underrated asf I swear he one of the funniest in amp lmaoooo",
        "Chris had me in tears how he steal a salad and still loose is beyond me ",
        "Can't trust kai with a knife",
        "fanum is me when it come to food lol",
        "ayoooooo",
        "Throw a car meet",
        "Saying Chris not good at life is CRAZY LMAO",
        "Everybody does their part ",
        "Fanum look like a highscool lunch lady!!",
        "Kai before the egg roll:this $10 \nKai after the egg roll: this $20",
        "These guys were on cloud 9 in this vid",
        "Duke got 80 belts ",
        "we will be the next AMP one day on god!!! tbh i just want chris to join us one day! top tier actor!!!!!",
        "Chris the real MVP",
        "8:10 I ain’t peep Davis banging that shit sounded like it was in my room I got scared",
        "fanum the most enthusiastic person i seen w food",
        "Duke said he know one of Chris weaknesses is life so imma take him under my wing, but naw Chris the MVP… Great Video",
        "31:49",
        "Fanum was too fascinated with his cooking lmaoooo",
        "Duke brooo 38:24",
        "Agent was lowkey getting mad the whole vid ",
        "Chris almost makes these unwatchable now. Duke needs to pack him up",
        "died when they started acting like they in a musical..",
        "I haven't even watched the video but they gave Fanum two handicaps because he's the only one here that can cook fr ",
        "the camera man be instigating",
        "Wow",
        "COOKIN IN DIZ BITCHH AYEEEEE️",
        "“how you open the shit” from fanum will forever get old ",
        "34:04 Fanum HOW I MAKE IT STOP BREATHIN’? Had me Exasterflimped",
        "Look like trail mix ",
        "Davis look so good with his new hair cuttttttt",
        "“ ima move this, cause I don’t want you to get nothing on that, just in case I gotta eat that right there” duke hilarious ",
        "Ataghfirullah thats haram LMFAOOOO i love kai",
        "Y'all gotta start putting some respect on Chris's name, he might be carrying right now",
        "Kai with these knives gave me pure anxiety",
        "Kai saying astagfurallah is too funny  we love a educated king ",
        "nah chris crying in the closet is crazyyy",
        "To all my brothers and sisters in Christ advancing God's Kingdom, please know that God sees your work for His Kingdom. Don't let anyone discourage you. What you're doing is right and good. Just make sure that your spreading of the Gospel is in love, no matter what. Y'all will be in my prayers. Jesus Bless ️",
        "4:35 new AMP video comin soon!!!…",
        "32:58i love how something little turns into a whole musical",
        "2:43 Chris agreeing in the background ",
        "Fantum, please stop saying food slaps. Food SMACKS music SLAPS",
        "Seeing them use those knives were freaking me out. Lbs ",
        "when Kai start speaking patwa ",
        "ahhh yea W",
        "Nah Walid a bad influence ",
        "bra them letting the chef eat that shit off the grown triflin as hell on folks",
        "good inspiration",
        "This Really should have been called AMP FOOD FIGHT  W VIDEO",
        "Amp is most definitely splitting up after the whole food fight scene",
        "I have said once and I will say it again. AMP is the only place where the sequel can consistently be as good or better than the original.",
        "Chris carried im so proud ",
        "We all gotta appreciate the actions of these guys do for us to have a great video. AMP are such good guys.",
        "I already knew Kai cuz couldn’t be trusted with a knife before the first 3 minutes of the video",
        "Agent looks so good",
        "The camera man started all the bs then tried to talk shit after everything was started",
        "Poor chris he like the odd ball in the group lol..just quite and humble till you piss him off he probably would go off",
        "@6:20 ",
        "Agent is such a “just happy to be here” friend and I love it, 10/10",
        "Davis let his 1 earring get to his head this episode",
        "Chris so damn funny ",
        "want does it mean when they smack there lips",
        "38:27 Kali? ",
        "Bro I thought duke left",
        "This is Chris, he’s with us ",
        "Ngl Davis got me dead laughing after he said let's go and he didn't even get picked ",
        "great vid boys , bringing smiles to even the darkest of places",
        "hey amp big fan no cap big wish i could meet in be a amp but ik im just want big fan im turn 20 in 12/14/22 i like look up yall in everytime im sad in hurt so think you for be amp"
    ],
    "comments_disabled": false
}