{
    "video_id": "yruMoo7wRPM",
    "comments": [
        "Never underestimate the underdogs.\nCredit to England for a crack of a game. But our boys 🇼🇸🇼🇸🇼🇸 went to the next level with this one.\nWin or lose in the grand final doesn't matter, we are more than proud of what you boys have done for our small nation.️️️ GO TOA.",
        "One of the best world cup games ever,, Samoa  just to good",
        "Raiders from the South Pacific",
        "All the Polynesian teams have made this World Cup much more exciting and this is the time that one of the big three is going to miss out of getting a MEDAL fukkin good job.",
        "Most heartwarming comment section I’ve seen in awhile! ",
        "Kagby",
        "0:51 one of the greatest fcken tries ever",
        "Great contest! Thank you SAMOA!!!️from 🇵🇬",
        "Against all odds 🇼🇸",
        "Bravo les Samoas pour cette magnifique prestations de très haut niveau, je me suis régalé.",
        "Toa Samoa 🇼🇸",
        "What a sensational game \nBoth teams play amazingly well \nUnlucky for the English but a huge congratulations to the Samoans \nGood luck in the final",
        "We smoking that queen packkkkkk 🇼🇸",
        "England players should be embarrassed, losing to these guys in such a big game. Bunch of bottle jobs",
        "CHEEEEHOOOOO!!!! 🇼🇸🇼🇸🇼🇸🇼🇸",
        "fugkn ay!!! what a worldcup and what a team!!!",
        "Hopefully Israel adesanya does the same lol",
        "The greatest semifinals ever 🇼🇸 well done England youse made your nation proud 󠁧󠁢󠁥󠁮󠁧󠁿",
        "This Blue team looks really cool, i like them.",
        "Great match  on both sides gotta stick with my Poly brothers ALWAYS",
        "Bruh that kick missed 🇹🇴",
        "Damn, that play and eventual try around the 1:00 mark was amazing!! 🇼🇸",
        "Let's go usos. Proud Fijian supporting y'all.",
        "They doubted us from the jump after that 60-6 loss. But against all odds the boys showed out every week and played their hearts out  SAMOA THE DAY HAS FINALLY COME",
        "The blocked field goal should have been a highlight to..",
        "Wow just wow ,Congrats Samoa .I really thought the Kiwis would beat Australia and England beat Samoa boy was I wrong !",
        "well we've done weel so far. 2 world cups. no wins.  f... shit.",
        "Most of the Samoans play in the NRL which is on another level compared to the English Game.",
        "Told England fans, it won't be the same spirit like in the open humiliating match. Samoa will be totally different side in this game. \n\nWell done Samoa, you've made your country proud and pacifica standby you come GF. Cheers from PNG",
        "The whole city of Apia in Samoa is going berserk, and Samoan fans worldwide are losing their minds. A historic win for Samoa and for all small South Sea island nations in the Pacific.",
        "As a Papua New Guinean I'm so proud of the performance. Bring the cup home all Islanders are bihind in full support of the Grand final. PNG Fiji and Tongan fans are behind Samoa 100%..",
        "Samoa on behalf of fiji we fcken love yous rn!!!...685 for the pasifika🇫🇯🇳🇿🇵🇬🇳🇺🇹🇴🇼🇸",
        "what a fxcken game, cheeeehooooo.. 2 classic semi finals for THE AGES .. Congrats Samoa  .. Rugby League - \"It's In The Game\" .. alright, off to the TAB with my wheelbarrow, cash out, thank you TOA ",
        "I’m kiwi! But Samoan todaysoooo good brother uces",
        "As a Bronco. I'm so proud of Herbie.",
        "Now that was an awesome game manu Samoa manu Samoa 🇼🇸 take it home manu Samoa you can do it man congratulations",
        "",
        "And that’s why England should have taken penalty goal at the start of the game. I say it every game. It’s so frustrating. ️",
        "I have no words 🇼🇸",
        "well done Samoa enormous respect for the Samoan nation. well done hope you win the final. most of the England fans will be supporting you good luck.",
        "LOVE IT!! England V's Samoa (Australia Res team) Karma at it's best !!!   YES!!",
        "Im a kiwi maori.. Fuck yeah my usos  samoa brothers we are behind you all the way.. all the pasific brothers get behind our samoan bros.. Smash them aussies lets go!!",
        "Let's go samoa  whole of Pacific is behind you",
        "Andrew Johnson tipped this a year or 2 ago.",
        "Players smashing into ad panels is silly, s@#t ref as always by sutton, hopefully Klein does finals\nGood luck Samoa",
        "There's only thing left for this Samoan Team to do when they play Australia next week --BELIEVE!!!",
        "Am I the only Asian who watch this?",
        "Lets goo Samoa",
        "Let's go Samoa!\nLove from PNG🇵🇬",
        "BRAVO SAMOA. BRAVE AND FULL OF FLARE. England stepped up their game. RESPECT TO SAMOA.",
        "Kefe convicts 🇼🇸",
        "Malo TOA SAMOA our people is proud of u guys u guys out done ur selfs and we are so grateful to have u guys to play for samoa keep it up never give up and we’ll keep supporting * NO MATTER WHAT* we stand together 🇼🇸🇼🇸🇼🇸🇼🇸🇼🇸🇼🇸🇼🇸",
        "Two awesome semi finals the whole of aotearoa behind the warriors in blue \nGood luck for the final",
        "England shud never host another RLWC",
        "Australia will smash Samoa",
        "Go Samoa",
        "Pacific island pride",
        "Take that!!",
        "What a great history for samoa, I woke up this morning on my Fiji time and notice that I miss out this Game Samoa and England ....Congrats...boys",
        "Congratulations to Samoan Team despite the poor calls from the reffs you made it.",
        "Im in NZ... Samoans going crazy on the streets. Final in 10 hours time.",
        "To all my Polynesian people around the world & that supported our beloved Samoa team 🇼🇸 that one for all of use Tongan,Fijian,Cookisland,PNG when one wins we all win  United we stand. To every other nation who backed us up much love to use as well.685 all day history has been made I’m so proud of the boys  It’s home stretch now ",
        "What an absolute brilliant outcome for Samoa...what Samoa has done not only amplifies the athleticism of the Pacific Nations...absolutely awesome and well deserved Samoa",
        "Revenge is a dish best served cold ON YA BOYS ",
        "Congrats 🇼🇸!    Peter Streiff from 🇨🇭",
        "Juuuuusshhuuuuu WHAT A RESET For Our Beloved SAMOA What a Victory Congratulations Boys Win or Loose next week we are Still proud of you Boys but knowing Our Samoan people They are Not Gonna Go Down without a Fight LET'S GO TOA SAMOA ALL THE WAY Cheeeehoooo🇼🇸🇼🇸🇼🇸🇼🇸🇼🇸🇼🇸",
        "how about the obstruction in Englands first try?? the score line should not have been as close as it was.  those weird penalties that contributed to that english scoreboard.  only try that was englands based on the play was their runaway try",
        "Some great play.",
        "Awesome Toa Samoa! Congrats and enjoy the parties! 🇼🇸",
        "England: Invent sport\nAlso England: Lose to a country of 200k",
        "GO SAMOA FROM U.S. !!!! 🇼🇸 🇺🇸",
        "Vicious Samoa 🇼🇸",
        "🇼🇸 Lesgooooo usos",
        "cheeehoooo.....crichton thats my famz",
        "Love u uso Critttttta! N They said you couldn’t kick uce! 🇼🇸🇼🇸🇼🇸 England daddy is back  POLYSUP",
        "This is a miracle.  I can't believe England lost oh ny word",
        "As Tongan, my brother from another mother but one father makes me PROUD....POLY ROOTZ.. ofa atu to my uso and to all poly famz...Samoa on Top",
        "English referees have been awful throughout the tournament. Fortunately Gerard Sutton was in charge of this game. English referees would have won it for England at all cost.   \n\nCongrats Samoa! Good luck the the final one.",
        "CHOO HOOOOO!!! ",
        "Brilliant turnaround",
        "The best thing about this win is Samoa made plenty of mistakes themselves, the ref was clearly biased…I mean, how do Samoa get tackled in midair by England a bunch of times and nothing is called, yet Samoa does it once and concedes a penalty for the exact same thing?\nThe ref should’ve just worn an English jumper in the first half, his bias was that blatant.",
        "The organisers of this tournament deserved nothing more than this result bahhhhhhh 1 more to go!!!!!",
        "Let's go Samoa..Love from Fiji.🇫🇯",
        "How many Panthers made the world Cup final too now? Jeeeeesus.",
        "What a game!!!! Nice try England, best team won tonight.",
        "SAMOAAAAAAAAAA 🇼🇸 🇼🇸🇼🇸🇼🇸🇼🇸",
        "it hits differently when you know the sacrifice these boys made for our country. they were criticized, judged and thrown in the dirt by the media. First game they lost to England by 60 and was made fun off, they met another powerhouse MMT in the quarters and came out successful But today they created history . They did not just play a game of rugbyL, they played for their small nation, they played for their people, they played for the pacific, they played for their families, they played with their hearts… one of not the greatest rugby league game I have ever watched!! 685 to the world ",
        "Congratulations Samoa! Super proud as a Pacific Islander!!! Love from PNG  🇵🇬🇼🇸",
        "What a gameeee🇼🇸 SO PROUD OF THE BOYZ",
        "That offload from Paulo was freakish. For a guy his size to do something like that is sensational. Fantastic game today and well done Samoa!",
        "Here's why I think Aus vs Samoa will be the last World cup final in history!!\nhttps://youtu.be/iwMQTlY60f0",
        "Am I the only one who doesnt want Samoa to win because of the one guy in the team....",
        "God with you brothers, you believe that,,, I pray for you USO.",
        "Fantastic win to Samoa.....the final against Australia will be awesome.",
        "All the way Samoa..... supporting from Fiji",
        "Faar love that the under Dawgs come up with the Dub",
        "Rlwc now not so boring. Go Samoa",
        "CHEEEHOOOO HOOOOOOO PROUD OF THE USO'S 🇼🇸🇼🇸🇼🇸",
        "Wow Samoa Wow!!",
        "Put sum RESPECT on OUR names #samoaFINALSbound",
        "Samoa 🇼🇸🇼🇸🇼🇸🇼🇸🇼🇸🇼🇸",
        "Absolutely brilliant go TOA SAMOA...from PNG",
        "What a fantastic game of RL. Well done Samoa on a famous victory.",
        "Am a🇵🇬 but I cheered on Samoa fm kick off to the field goal by Crichton. They were passionate, inspirational and just watching Paulo and the Toa Samoans play for their beloved tiny nation thus inspire the smaller Pacific nations including 🇹🇴, 🇫🇯, 🇵🇬, 🇨🇰 plus Jamaica, etc..Go Toa Samoa 🇼🇸 to win the 2022 RLWC, Yes!!",
        "Go Samoa bring the World Cup to the shores of the Pacific. We can create history nothing is impossible.",
        "Nice one Samoa..Pay back they thought there'll easily beat you guys and make it in the finals. Proud of you guys.   ",
        "Tell the commentators go ai the fua of the queen smh",
        "Lucky home is just around the corner for the english team ",
        "Go usos. Full support from your brother in PNG 🇼🇸🇼🇸🇼🇸",
        "🇼🇸🇼🇸🇼🇸",
        "Where’s the “Luai is nothing without Cleary “ people at? ",
        "Fk that win or loose.. We go all the way never back down... To the end",
        "TC - Samoa All the way",
        "True blue Aussie but wouldn't be too unhappy if Samoa pull of a monumental win.\nPlay well boys!",
        "Too good. Samoa. ️️.. \n\nYour win is whole Pacific Region's win. Good luck in Grand Final against Australia.",
        "O AI LE TOA!!!! SAMOA!!!",
        "What a match!",
        "Maori / Samoan here I was hoping for a Kiwis vs Samoa because either way I could have cheered for both, so good  let's Go Samoa",
        "Revenge is best served cold. And that, lads… was icy. Mālō le tau, USO’s!! Mālō le finau…. Finals baby, here we go!",
        "Well done Samoa 🇼🇸  each 0ne of you have Eched your names in the history books on that semifinal performance!!.. All the best in the final   cheering you on from F1 J 1🇫🇯",
        "Haha Englands to good  if it wasn’t for that last kick from samoa",
        "Great game, great result. Go Samoa, played like champions.",
        "If only Samoas Union team could play like this kio!",
        "I'm samoan. And congrats on both teams giving there best that day.",
        "Too good Samoa!",
        "England lost to a better team, simply outclassed",
        "My word England were absolute garbage today but at least it made for a competitive / exciting game.\n\nI really hope Samoa put up fight next week and I think it'll need a very good Samoan performance to keep Australia to a winning margin no more than 30 points (and maybe score 1 or 2 themselves). Still I will pray for a miracle, given that I have tickets and would really like to see a competitive match. I just bought a Samoa scarf ",
        "Congratulations Samoa being the first Pacific country to enter the grand final ️️.",
        "Now to lose by 50 to the aussies",
        "That kick at the end was cold ",
        "Let's go Samoa 🇼🇸 congratulations   \n️  from 🇵🇬..come GF day! All pacific will be Samoan for the day ",
        "Kumuls Supporter here 🇵🇬Thank you so much Somoa ️️",
        "What a historical win made by the Samoan team. Such a masterpiece game of play, well done and u all deserve the victory. The courage and strength u Guys showed in your game cannot be described by any word, seriously. . The game played showed that u weren't only playing to win it for the Samoan Nation, but to win it for the all other Pacific Islands. Thank you poly brothers️. All the world's best in your finals game with Aus. Much love from PNG🇵🇬.",
        "I came back to the greatest minecraft series on this platform after hearing the news today, and I find myself almost forgetting that it all happened. Nothing has had time to sink in. Across many accounts and over many years Ive watched Techno go from 2k to 2m, to 10m. This mans amazing humor and personality carried me from elementary to high school, and always made me feel better when my own life got rough. If I look back through the years, even to the days of the Blitz parody, Techno has a place in my life in every time period and every one of those years, and was truly a source of comfort. We love you Technoblade, and well always be here. Rest in peace, and thank you for all the years.",
        "685 on ya speakers , 685 on ya radiooo",
        "We could had NZ v Samoa finals .  Ahh well let's go Samoaa!",
        "Get some brothers get some get some! 🇳🇿 you got this mauri oraaaaaaaaa!",
        "PNG here, Talofa to our PACIFIC BROTHERS, SAMOA you made us all proud..Congratulations.",
        "I thought the Kangas vs Kiwis would be the best game of the tournament.  Nope.",
        "well done Samoa..",
        "England refs tried to cheat there way again to the finals AGAIN",
        "What a game this was. Congrats to Samoa . Was betting for England to win the WC this year but unlucky.",
        "Luai vs Cleary next week.",
        "Can I get a hooooyyyyeaaah? 🇼🇸",
        "Finals  :  Aus  60. Samoa 0 ",
        "That's first loss against England was a glitch..bad game plan but they turned it around... and now in final.",
        "Leeeeesgo mr Australia to Brisbane. MVP 🇼🇸🇼🇸🇼🇸",
        "We fkn counted us outwhere them haters at???!!!To the finals we go🇼🇸🇼🇸🇼🇸",
        "hahahaha shame to all those english fans who were cocky after round 1",
        "Goodluck for finals",
        "the last score for England was unsucessfully converted, can we all look at it again ..",
        "My neighbours knows where im from 🇼🇸 That was a game ill never forget!!",
        "  Because of  love. God sent His Son Jesus Christ to die in our place. Three days later. Rose him  from the dead.   Now. By Jesus Christ alone. God has granted us the free gift of eternal life. He will save and heal you.  If you confess with your mouth the Lord Jesus and believe in your heart that God has raised Him from the dead He'll give you eternal life",
        "Im English sad and now got to watch them in the final",
        "Had tears in my eyes watching the final moments so proud of the Samoan brothers representing there People! Have your moment and glory samoa! You make me proud to be Polynesian! As a cookislander and NZ MĀORI! You have our full support usos!I’ll be rocking my toa shirt and flying y’all flag come final game! Cheeehooooooo!🥹🇼🇸🇼🇸🇼🇸🇼🇸🇹🇴🇹🇴🇹🇴🇨🇰🇨🇰🇨🇰🇳🇺🇳🇺🇳🇺🇳🇺",
        "Crichton is the new intercept king. Doing it in big games, grand final and semi final of a wc!! Samoa 🇼🇸  ",
        "What happened england",
        "Samoa absolutely awesome love the players in the Samoan team should be a great final",
        "Congrats Toa SAMOA! x ",
        "so proud of you Samoa you have done the whole Pacific proud an amazing accomplishment bungling England out of the world cup. Im Kiwi but this is an amazing accomplishment. One for the ages against all odds with a low budget.",
        "well done samoa did the pacific proud. good luck with the finals all the best will be cheering for yous",
        "LESSSSGOOOO TOA HAMOA \nCHEEEEEEEEHHHHOOOOOO MY BROTHERS",
        "Where was England’s ruthless attitude \nShould’ve put 50 on em",
        "shame england",
        "Thank you Samoa. Pacifika represent. Full support from PNG.",
        "Hopefully ozzie smash Samoa \nBut let's be thankful the poms can't win it unbearable nation of people when they win anything",
        "They're currently 4.5 hours into the stream and have reached 88% of the goal amount.  Good on Charlie for caring and doing this for Lance and his family.  Looks like they'll make the goal easily.",
        "As a Tongan. Samoa deserve all the hype rn. Made history ma usos🇼🇸🇹🇴",
        "I thought Fiji was playing 3am this morning as everyone was cheering for Samoa....1 Love from Fiji, that one for the Pacific Islands",
        "samoa on top caitahhhhhhhhh",
        "Pacific made it to the Grand Final. We ALL made it. Thank you Samoa 🇼🇸 🇵🇬 🇹🇴 🇫🇯 🇨🇰",
        "Well done for Toa Samoa and England for the wonderful match...Malo le fa'aea atunu'u faapea aiga...xox amah sing glory to the highest today at church lol...yeah Sunday better be  Good game xox respect for the Englands...Malo Toa xo",
        "when you step in there f m up boys.I was a really proud POLY early hours today.Damn Samoa u make us proud.Respect and bula from your brother Fijian.Let the ground do the talking.Samoa you got it bud",
        "MInd blowing stuff that a country of 200,000 can beat one of 50,000,000",
        "685 on ya speakers",
        "Jerome Luai, King of the Pacific!",
        "Crazy how no one’s taking back their comments on our Coach  🇼🇸🇼🇸🇼🇸",
        "As a Fijian I'm so happy for Samoa. After our narrow loss to NZ I lost interest in the RLWC but seeing Samoa win like this just brought me back. Thank you Samoa.  Pacific Island brothers. Win this for all of us. 🇼🇸 🇫🇯 🇹🇴 🇵🇬 🇨🇰  🇳🇿",
        "Too off the best semi,off all time.their two team took us ,as well as yesterday took us to Rugby league heaven,their was nothing negative,even those we lost ,they were just unreal rugby league. games",
        "Sending support from PNG🇵🇬",
        "Well done Samoa🇼🇸🇫🇯\nCheering from Fiji",
        "I was thinking the whole RLWC was a bit of a Mickey mouse competition considering it's only really Australia who takes league seriously,but when you see how much it means to other countries you have to take your hat off to Samoa and smaller countries players and supporters taking it up to the bigger countries. It's something Aussies like with supporting the underdog ,so it'll be a strange feeling watching the final as an Aussie wanting the fairytale to continue but just not against us🇼🇸🇦🇺",
        "to press forward and persevere. So proud of you boys. Malo Le Tau🇼🇸 lesssss go Toa. Looking forward to the finals",
        "Shame that mighty England could not dispatch a country the size of Norwich",
        "Yeah babyyyyy!!! Juuuuhuuuuu!!! O ai le Toa???!!!!!",
        "Level up! 🇼🇸🇼🇸🇼🇸🇼🇸🇼🇸🇼🇸🇼🇸",
        "Bravooo, Samoa! But, my heart is with the Aussies!",
        "How Good,,Shot Samoa,Shot Boyz,,  this Kiwis fan loved that ",
        "This is the greatest sporting achievement this year!!! Samoa were incredible today!! So glad I was there today!! Chhheeeehhhhoooo!! 🇼🇸",
        "when the boys just look and hope that the kick is good...and it did...that feeling of joy...priceless! Great one Toa Samoa! @2:40",
        "Fn good game..well done TOA SAMOA,",
        "Awesome to see a nation that was basically still in the stone age a hundred years ago show such sporting prowess... from grass skirts and wooden spears to this",
        "Awesome game Samoa 🇼🇸 ",
        "PNG is with Samoa for the Grand final",
        "🇼🇸🇼🇸🇼🇸🇼🇸🇼🇸🇼🇸",
        "Haha ",
        "Fair play to Samoa they  deserved it.",
        "Cheeehoooo!!!!",
        "As hosts of the tournament they were handed the most easiest of draws to get into the final and epic failed it lol. Solid Samoa!!!! Lessgo",
        "It is actually fitting that an actual Samoan-born player, Stephen Crichton, clinched the win! Only two players were born in Apia, Stephen Crichton and Kelma Tuilagi. The rest were born in NZ and Australia. So let us all just appreciate and praise the Samoan Heritage! Let us not overdo the \"a tiny little dot in the middle of the pacific\" talk like Matt Parish did. We all know all the players speak English with either an Australian or NZ accent... they're not Tagata Māo‘i out there harvesting taro, bananas, breadfruit, and fish for their respective villages. It is a proud moment for those with Samoan Heritage regardless of where in the world you are, and I will be barracking for Samoa when they play the Kangaroos (and I pray that the officials, esp. the bunker, don't spoil it),",
        "Shocking defending by England.",
        "What a game. Congratulations Samoa.",
        "That try via Lua’i to Paulo then the offload and finish from Critta was  absolutely disgusting.\n\nNever knew Cody Walker was playing for 󠁧󠁢󠁥󠁮󠁧󠁿.",
        "Love from Papua New Guinea proud at least one of the pacific nation is going into the semi finals.",
        "Game was riddled with errors. Exciting yes. Best game ever not even slightly.",
        "It’s a great day to be Samoan, I’m not but it would be.  Well done Samoa and good luck for the final.",
        "As a Papua New Guinea, we say 'Gutpla tru na upla winim ol, samting blo Wan solwara mas kambek lo yumi yet.'",
        "Terrible day for England sports, lost a world cup final and kicked out of their own tournament. Hopefully the cricket goes better",
        "congratulations my Pacific brothers, PNG are with you all the way,  You have took us into the final, we a proud and also celebrating your win. SAMOA ",
        "This is the craziest game I’ve ever seen. It could’ve went both ways. It was all down to that last kick. Beautiful end to the game. I’m not part of the Polynesian community but I am super hyped to see how far Samoan is going to go in this. They have all of the Pacific on their backs. Show the world that we could ball too. ",
        "now that's a Finals",
        "Solid usos what a cracker of a game thank you Jesus",
        "Great game",
        "Yesss Cheeehooo🇼🇸🇼🇸🇼🇸🇼🇸 We're coming for you Kangaroo Aussie",
        "Che sport meravoglioso",
        "England didn't even turn up after last weeks hyped game which I said was a one off as England should play like that every week and this week England reverted to type as losers who were too slow, couldn't tackle for toffee and were always chasing the game and making mistakes. League is so over hyped since turning pro, preferred the amateur game which was miles more exciting with plenty of mismatches of players.",
        "Awesome Samoa..!!! Great win, just about getting tired of Aus,Eng & Nz always dominating the Rugby League world cups. Be rooting for you in the final too in the hope you create new history in rugby league. Go Samoa.!!",
        "hahahahahahaha hahahahahaha haere tonu , kia kaha tonu e Hamoa",
        "I’m TONGAN but man I cheered loud n proud for our SAMOAN brothers all morning!!!They carrying us polys on their shoulders n they ain’t got nothing but our support!BRING HOME THE CUP!",
        "THIS IS FOR OUR PEOPLE 🇼🇸 AND ALL OF POLYNESIA !! Don’t sleep on our nations 🥹🇼🇸",
        "Bring home the cup Samoa.... Support from Fiji 🇫🇯🇼🇸",
        "I’m pre sure criton missed that kick at the end watch the end ️",
        "So proud of Samoa!!!!!! Great Win!!!!",
        "Samoa can do the same to Aussie...hands down. Go manu!",
        "As a Tongan I am lost for words rn ",
        "FCKKKKKKKKKKKKKKKKKKKKKKK",
        "Yes !",
        "Thank you Samoa on behalf of PNG. History for all pacific nations.",
        "Redemption from samoa,",
        "England didn't lose. They already had their name engraved on the trophy",
        "Chehoooo History I  the making for a small Nation proud Samoan",
        "Congrats Samoa, \nLets do it for the Pacific.",
        "brouu the ref cheating he missed that kicked at the end",
        "Let's go Samoa ,, all the way from Fiji🇫🇯🇨🇰🇵🇬🇹🇴",
        "History is made on the 13th November 2022, when a small Pacific Island Nation in Samoa beat England to reach the RLWC final with Australia. 10q Samoa for making all our hearts pounding in joy. To be honest, I gave up watching this world cup when the bunker made a controversial decision saying that Kikau striped the ball off from Manu when in fact Manu lost it cold.",
        "I’m TONGAN but man I cheered loud n proud for our SAMOAN brothers all morning!!!They carrying us polys on their shoulders n they ain’t got nothing but our support!BRING HOME THE CUP!🇼🇸",
        "I was mocked online for suggesting that Samoa were dark horses to go all the way. No-one is laughing now - what an achievement for a small island nation!",
        "Congratulations  Samoa 🇼🇸 from PNG 🇵🇬",
        "Huh? Forward pass from England",
        "The crisis in the British game continues. The humiliation of GB in PNG, the decline in quality and financial problems in Super League, only England getting out of the groups but regularly losing against tier one and high tier two opposition… where is the game going? That said I’ll still be at the finals day next week and cheer on Samoa and hopefully England women. The Samoans play with flare and passion but the Aussies are a machine - should be a really good game.",
        "Well done Samoa ",
        "Yes. Samoa going to the finals. Good work USO.",
        "Thank you Samoa. RIP England",
        "Go Samoa!",
        "Cheering Samoa from 🇮🇶 iraq so the final Is Australia v Australia",
        "Best game I ever seen 2022 from Tonga 🇹🇴 Love you guys team work is the truth ",
        "Wtf is wrong when a country of 60 mil. who invent a sport but can’t dominate a former island colony of a few thousand?",
        "Congratulations He Toa Samoa 🇼🇸. I really hope your team takes out the comp. Good luck and all the best you deserve it this is your time to make a stand.!!!!",
        "AGAINST ALL THE ODDS --- SAMOA CAME UP ON TOP! 685BABBYYYYYYYYYYY CHEEEHOOOOOO",
        "I'll be 100% honest here and say that as an Australian I now want to see Samoa win the tournament. What an amazing accomplishment that would be.",
        "Daddy 🇼🇸 loves you Eng  lol",
        "Samoa great comeback after 60-6 loss. Good luck for final vs australia .",
        "Cheeeeeehhoooo  🇼🇸",
        "Well done SAMOA 🇼🇸!!\nMuch love from FIJI ",
        "I'm fijian but was cheering 3am in the morning for our pacific brothers",
        "Go Samoa love from PNG🇵🇬",
        "The best is yet to come. Good for rugby league. Well done Samoa.",
        "That's it lavalava peu Samoa, well done",
        "Good effort from Samoa to snatch the win even with the sin bin/injury and soft calls from the refs but the next week they need to isolate cleary and Munster and not give any room for their outside backs and not give away cheap penalties early in the tackle count cause that's what killed them last night",
        "Sirens going off everywhere in NZ at 3 am all go the boys🇼🇸🇼🇸️",
        "What a game, well done Samoa. Would’ve been an injustice if we won that. We only turned up in the last 15 minutes. Will be cheering you on against the Aussies at Old Trafford ",
        "Congratulations our Pacific brothers.. Love from Papua New Guinea ",
        "Thank you for this series, an insane amount of effort has been put into this to make possible. Truly gives nostalgic vibes.",
        "Absolute A+ game from Samoa. Great S/F from both game. All the best Manu in the final. Love from Fiji 🇫🇯",
        "OGO VALU LIMA to the  🇼🇸",
        "The last rugby league match i watched was possibly on BBC Grandstand in the 1990s. Back then i felt it was a lot more exciting than RU, and the rules much easier to follow. \nIt was brilliant entertainment today, and i wasn't too bothered that England lost.  \nMy only gripe is why the match was played in London, in a half-empty stadium ",
        "Stephen Crichton missed the field goal if you watch properly ",
        "What a game! Thank you to both Nations for a solid display of footy! 685 to the world baby!!",
        "It was more like Samoa vs England, Ref, crowds, commentators..",
        "Many thought it was gonna be an easy game for England, but England played their absolute best and still fell short. This Cinderella story for the dark horse of this world cup keeps getting better",
        "Sweet Caroline! Cheeehooo! 🇼🇸🇼🇸🇼🇸",
        "Charrr the USO USO USOSSS!!!",
        "take on the raging seas.🇵🇬",
        "Fa’afetai Samoa 🇼🇸 Thanks for making us all proud!  Onto the next game 🇼🇸 vs 🇦🇺",
        "Thanks to those who aren't samoan getting behind the boys that support really mattered. This ones for the whole pasifika community. 685 all day",
        "woohoo! great game",
        "Samoa - too good you are!",
        "Support from Papua New guinea lets go brothers .rattle them Aussies",
        "By best try of the series by Samoa just WOW. Absolute skill ",
        "A lot of missed tackles by both teams. Samoa won't have that luxury against Australia but hey! it's great to see Samoa in the Final",
        "Sensational match.. well-done to the pacific brothers-Samoa. With yous\n all the way.",
        "Crichton pulled a johnny wilkonson haha",
        "Ahhhhhh shame englin..thort yous had it in the bag. Already had eye on next week",
        "Luai still your Daddy",
        "So proud!",
        "Glad england lost ",
        "Thankyou Samoa, as a Papua New Guinean, I was all emotional when I saw that winning kick. We all the Pacific Islanders are behind you brothers. Full support ",
        "Australia vrs penrith next game :)",
        "Hahaah well done Samoa 🇼🇸",
        "Awesome SAMOA what a epic game..give us SAMOA",
        "Thank you Samoa, you done us Pacific Islanders proud ",
        "Wicked Chaaaaahoooo",
        "That was clever how Samoa duped England with that final dropkick.",
        "Bianca's dad wasn't trying to get her to stay home to protect her, but to protect the world FROM her.",
        "2meke Samoa 2meke",
        "Congrats to Samoa. What an excellent turnaround from that first game ",
        "Even worse when you can't book a flight out in your own country lol",
        "The last Pacific Island stronghold",
        "Good luck Samoa!",
        "England was trying their best too low key rig the game like a few calls from the bunker and ref was off just absolutely embarrassing they are I’m glad Samoa pulled thru and sealed it and I hope England never hosts a rugby World Cup again every game was like high school rugby actually high school rugby pulls more people to the seats and the organisers was a shithousese",
        "Penrith versus Penrith in the final.",
        "All Nations shoud be proud of all that has been achieved through this tournament, progress on an international scale is excellent, Huge respect to Samoa and Australia for the finals!!",
        "Bruh they didn’t even make it 🇹🇴",
        "Samoa that was amazing!",
        "Toa vS the Refs all day!!",
        "Gonna see heaps of Samoan flags around Auckland tomorrow! Awesome stuff.",
        "different code I know, but kind of nice to see England lose by a kick after extra time, 20yr later a la Jonny Wilkinson",
        "TOA SAMOA 🇦🇸🇼🇸",
        "Well played Samoa. Tough to swallow for us English but the semi final was no time to let our levels drop. Wane's emotion shows he's still the right man for the job, even though I'm a Saints fan! Bring on the world club challenge...",
        "Thank you Samoa 🇼🇸 we kanakas behind you all the way. 🇵🇬🇫🇯🇨🇰🇹🇴\nThank you for winning this one! What a cracka of a game this was",
        "Dammnn Samoa did it...wooww cobgrats to them",
        "ALL SAMOANS ACROSS THE WORLD NEED TO GO FOR BROKE AND PACK UP THE FLAGS AND CATCH A FLIGHT TO ENGLAND AND SUPPORT OUR BOYS FIGHTING FOR THE HOMELAND VS AUSTRALIA!!! WAR ISNT OVER YET!!",
        "ENGLAND WHO'S YOUR DATTY NOW,",
        "Congratulations Samoa on the awesome victory",
        "Congratulations Samoa. All Pacific Island Brothers are with you..From PNG.",
        "Aw yeah, go Samoa",
        "Repent your sins and accept Jesus Christ as your lord and Saviour God is merciful and he will forgive you",
        "What day to be Samoan fuck 🇼🇸",
        "Toa Samoa",
        "What a fkng game, samoa scored the try of the tournament off load from paulo",
        "This tournament was setup for England to walk into the RLWC GRAND FINAL. And they lost to a 3rd World Country ",
        "is there anybody...anybody out there I need the biggest fua to carry around ",
        "Haha even the T e fe@ the start of siva tau couldn’t stop the usos from the win nice one manu boys need some luck for this week against the kangaroos as  everything else matches up stat wise Penrith forwards an backs halves7 vs 6can’t wait",
        "Very disappointed with the Match Officials for their obvious cultural biassed decision making against the Samoans. A inocuous vertical lift which resulted in a 10 minute rest for Junior Paulo followed by an actualy serious injury to the spine of a Samoan player when an English player did a crusher tackle on him, the result was only a penalty against the English player. The offense should have resulted in a more serious sanction including a time in the bin. Then the Junior Paulo late charge on an English player who decided to do a Soccer player theatrics with a wee bump off by Junior when he was already committed to the tackle and was merely attempting to retract from the contact but his large mass of a Prop couldnt stop his momentum from making contact with the kicker, the Referee should have ignored the English players theatrics and milking it for all its worth....The result was an 8pt try bringing the English back into the game.....Samoa were almost robbed of their victory because of the Australian Referee's very biassed Refereeing decisions. An 8pt try nearly cost Samoa the game....the 10 minutes sin bin for the inocuous vertical upending of the English player should only have been a penalty because he was brought down safely. The crusher tackle was by far more serious and could subject the player to a more serious spinal injury in which the English player was only penalised for it...He should have been sent from the field for malicious intent. There is a need to review the quality of Referees officiating games, even the NRL have doush bags and this Bloke is one of the biggest doush bags around. We need more Pacific Islander Referees in the world cup. There is too many cultural biassed officialdom that needs to be stamped out. Such biassed officialdom historically has costed many Pacific Island Nations sorely in game results and it needs to be changed. We need unbiassed and culturally neutral officials.",
        "What a soft penalty 1:38",
        "Man England have scored a lot of tries off forward passes this last month and their first one was no exception.",
        "Yo congrats to both teams superb shows both side  much luv to all my sole out there",
        "as a welshman i remember losing to samoa in the union world cup in 91 and 99 and how the english all laughed at us - well they aint laughing now",
        "good riddance Samoa! we Islanders with y'all all the way... let's check this Oz defence out!",
        "Good shit Samoa! No smash them aussies",
        "Where those doubters at chooohoooo",
        "superbe performance des samoans, bien joué ! un match qui fait parti de la légende !",
        "Shot Samoa well played",
        "Great game all !!! Samoa for the win, churz ",
        "LUAI was right. The 60- 6 score helped samoa, first because it humbled them, all the talk about their star studded team, and second it made them feel on the ground and train hard and concentrate on their work they needed to do to get the team to work together as one.",
        "TOA BABYYYYY 🇼🇸🇼🇸",
        "im niuean lol but i cheered for samoa and Tonga and fiji pacifika represent",
        "The refs need to be investigated for match fixing england was basically awarded a free try by the ref was so biased towards england but Samoa still pulled through what a team and what a comeback victory Samoa all credit to them.",
        "My wife is samoan. Happy for Samoa!",
        "that english coach was absolutely shocked by the Samoan.Well done boys.Wishing you success in the final",
        "Now you gotta deal with the aussies. Good luck",
        "The drop goal didn’t not go through the post",
        "Ya kidding with that push. He decided to jump himself. 685 babyyyyyy🇼🇸🇼🇸🇼🇸🇼🇸",
        "Weas all the england fans that called themselves samoas daddy",
        "England thought they would win as easily as they had in the first game, and they paid the price.",
        "What a match!!! In the history books!!!",
        "Australia ",
        "🇼🇸  🇼🇸",
        "Hahaha goodbye england build ups",
        "England was playing a dirty game. Im proud Samoa boys kept their composers and kep playing to win! Go Manu!!! Best revenge",
        "luai was taking the piss out of that english defence all afternoon. class player",
        "16 players, 1 sin bin & the ref against them the lads said hold my  ",
        "How on earth can a 123kg body fall to the ground and execute that pass. Even physics can't explain that. It must be a 685 thing",
        "CCHHHEEEEEE HHHOOOOOO!!!! 🇼🇸",
        "SAMOAAAA O AI LE TOOAAAAA!!! 685 BABYYY🇼🇸🇼🇸",
        "I'm so happy for samoa!! Going out for a rain dance now in Fiji",
        "Thank you Samoa. We know you would win easily.\nA pacific island nation in the grand final. \nYou have all of our island support.",
        "All the best for finals boys🇼🇸️",
        "Vinaka vakalevu 🇼🇸 samoa. Support and love from 🇫🇯  Fiji",
        "So who’s still going church ",
        "I’m Egyptian and I love Samoan people. Congratulations",
        "Samoa Up!  Goodbye England ",
        "I am so disappointed Australia  beat the Aotearoans !",
        "well well done samoa for beating cheaters so proud",
        "Samoa got a yellow card and england still can't do the job.",
        "Faamalo Manu Samoa!!!!!",
        "Samoa on top 🇦🇸🇼🇸",
        "Heart of a WARRIOR.  TOA SAMOA.",
        "UNBELIEVABLE ",
        "I knew Crichton will still intercept the any at any time.",
        "Holey crap that was good ",
        "Toa Samoa is carrying the Pasifika people in the RLWC finale on Sunday. Good on you Brother's",
        "Mean Samoa",
        "This is literally a GF  BUT Ttz to England up the TOA",
        "685 on your speakers cheeehooooo🇼🇸",
        "Well done samoa, well deserved",
        "wow england from 60_ 6 to a loss, sucker punched hardrope a dope Styles, love it when a plan comes together!!!",
        "Shocking performance by England, gifted samoa the game. Wane out",
        "Congrats Samoa🇼🇸\nNow to beat the Aussies",
        "Samoa against all odds the ref, lines man, commentators, crowd and the whole country  #Samoa up 🇼🇸🇼🇸🇼🇸🇼🇸 Go the uso 🇵🇬",
        "685 to da worldd",
        "Saturday A.M - England RU Women supposed to just show up to beat New Zealand...Oooopps, oh well never mind the RL Boys only have to beat Samoa in the P.M.....Oh!!thank you Samoa for making Rugby fans in Wales, Scotland & ireland very happy",
        "I think when the island countries do the Haka England should be able to pull out imaginary guns to shoot them as their intimidation.",
        "Samoa we love you man️pasifika brothers",
        "Worst Officiating I've seen. Was like they wanted England to win. Shame!!",
        "What's with the empty seats for a semifinal? Quite pathetic",
        "What an amazing match. CHEEEHOOO. Samoa winning it all. 🇼🇸🇼🇸🇼🇸",
        "Investigation ",
        "Finding Nemo was the hardest one to hold my breath in man I barely made it through",
        "FROM ZERO TO HERO",
        "Samoa doing it for pasifika, faamalosi boys and best of luck in the grand final",
        "soft penalty just to put england back in the game. shame",
        "Congrats and great game Samoa, infact history has been made. The Luai MASTER CLASS was on show, absolutely ripped in. Chricton, a Legend already. #respect. ",
        "I am from Croatia and enjoyed this game well done to Samoa",
        "Go samoa",
        "Good luck vs Australia, watch them give you an English ref for that game ",
        "Toughest n bravery came from the islands ",
        "Sili ona Malosi toa samoa 🇼🇸 ",
        "Go England 🇬🇧 ",
        "Mean game",
        "Now that’s a real World Cup match. And yes sensational win Samoa ",
        "What an absolute belter of a match!!!",
        "im pretty sure the organisers change our flight bookings lol",
        "luai's kick didnt get in the goal  #tokousi",
        "As a Fijian I'm so happy for Samoa. After our narrow loss to NZ I lost interest in the RLWC but seeing Samoa win like this just brought me back. Thank you Samoa.  Pacific Island brothers. Win this for all of us. 🇼🇸 🇫🇯 🇹🇴 🇵🇬 🇨🇰",
        "Cheeeeeeeeeeehooooooo! ... Oh hold up?.",
        "Samoa winning is a win for all indigenous pacific islanders. Thankyou Samoa for making me take interest again in the world cup. Will be cheering loudly for you. Much love from PNG. 🇵🇬",
        "Karma is a bloody fantastic ",
        "That's the upset of the Century..!! The day this little Island nation slayed the dragon..!!",
        "Congrats to Somalia ",
        "I've heard, on pretty good authority might I add, that Makinson is very, very interested in the possibility of a move to Wigan.  Keep your eye's & ears open now the world cup is over with for us.",
        "I'm proud of samoa. You guys make us proud as islanders. Go for the trophy. Bring it across to island shores. Support from png.",
        "To all the English racists that talked racist smack...\nIa wa lelei\nTofa soifua",
        "Aussie will win  final",
        "Let's go Samoa",
        "Bloody good game the real winner is rugby league \nGood stuff Toa 🇼🇸",
        "Am from PNG cheering for my Samoan brothers",
        "wow the Samoan churches here in auckland will be pumping today !",
        "TOA SAMOA ",
        "Was at this game. It was incredible.\nOnly complaint is that going straight to golden point is a crap way to decide the outcome.\nYou might as well toss a coin.",
        "Wow . What a game . So many people wrote Samoa off . Good on you guys . The Pacific nations will be a force to reckon with in the coming years .",
        "Vamos Samoa!! ️",
        "This is what happens when our pacific uso are allowed to choose to play for their pacific island (instead of NZ or Australia). Many thanks to Jason Tanumalolo who led the way and show our pacific uso that they can represent Tongan, Samoa or Fiji on the world stage and be very successful.",
        "Well Done from PNG🇵🇬🇵🇬 to you Pacific brother's",
        "South Auckland every second car has been flying flags all weekend it's madness",
        "We all waiting for the cup to bring home to the heart of 🇼🇸 🇼🇸 Samoa.\n\nOTARA cheehoo",
        "USO ASO UMA 685 Boys lesgoooos",
        "Please Samoa must win the world cup",
        "PARADE TONIGHT AT CHRISTCHURCH BABY 685.K0K0 🇼🇸 🇼🇸 🇼🇸 🇼🇸",
        "Those panthers players making a big impact",
        "What a moment for Samoan’s world wide wow wow!! Well done they give so much heart and put their bodies on the line every week in the nrl! You deserve all the praise",
        "Go Samoa!!!\nAwesome game.",
        "vinkaaaa boys .....️",
        "Let's go Toa Samoa cheehoohoooo",
        "This game made me toot my horn and play with fireworks with the boys and I'm not even an Islander.",
        "Lol go samoa woo hooo ye ya",
        "Samoa....the whole Pacific will be cheering for you...rewrite the history books one more time against the OZ",
        "Kia Kaha Kia Toa Kia Manawanui Ngati Samoa. Well done our Pacific bros. So happy today for the cuzzies.\nI knew you could do it.\nYou can take Aussie too. Come on Toa.",
        "We 4rm Fiji are proud of u our Samoan brothers.they thought (england)they are the best,ha ha ha",
        "From PNG🇵🇬, congratulations Samoa.. proud Pacific Islander",
        "What a legendary game!! Much respect!! Go Samoa!! I’m Tongan and very proud of the boys, we as islanders should support our Island brothers \nLet’s Go Samoa!!!",
        "Well done from the Pacific.\nWell done Samoa",
        "Many thought it would be an easy game for Eng but Samoa did their best. Thanks for making the islanders proud Usos. Love from Fiji.",
        "Lol.\nUpda Samoa. The streets if South Auckland and Apia will be putting on a street parade.",
        "Lessssgo! Congratulations our pasific Brothers! Luai you're a magician! PNG In full support!",
        "Well done Toa Samoa and wishing you guys all the best on the finals much  love from 🇹🇴 let's go Samoa!",
        "Congrats Toa Samoa! One more hurdle. You guys can do it!!!",
        "Nice game Samoa Pacific Pride",
        "This game may just be the saving grace of this world cup. So many dead rubbers that it ain't funny. What Samoa do at times to keep the ball alive is unreal... As for England, well its not the first time they choked",
        "🇼🇸🇼🇸🇼🇸🇼🇸🇼🇸🇼🇸 regardless of how many trials and adversity the boys faced during each of their games(especially this one with poor bunker and ref calls) you all continued to press forward and persevere. So proud of you boys. Malo Le Tau🇼🇸 lesssss go Toa. Looking forward to the finals",
        "Crichton doing the Jonny Wilkinson on the England team lol",
        "Great game for both teams, but thank God for Toa Samoa win and genuine effort put in by the team..",
        "This was the real grand final ",
        "Great match.very interesting and entertaining match.Congratulations Samoa",
        "Let's go Samoa! Stick it to the Aussies! Support from PNG!!",
        "Beautifullllll easy win for the Aussies now ",
        "I know absolutely nothing about rugby league (or rugby at all for that matter) but how on earth can a team go from completely annihilating an opponent, to losing to them, within the space of a couple of weeks?",
        "Samoa 🇼🇸 ",
        "After beating Greece and France, we haven't beaten anyone of note they said...\n\nWe'll get smashed by MMT they said...",
        "Critta the goat but we’re make history  and critta‘s 1:46 ll 2:34 ll🇼🇸",
        "Samoa super game️ love stephen crichton and junior paulo",
        "You almost see the disappointment in Sutton face when Lafai scores his 2nd try",
        "NOTHING BUT SUPPORT AND Love from a KIWIS SUPPORTER LETS GO TOA SAMOA",
        "Who's Your Daddy Now England  \nGo Samoa cheering and supporting yous from Fiji ",
        "Gonna look back ND say \"I was alive during this magnificent era of polymovement\"... LASSSGOOOO Toa to the !! 🇼🇸️",
        "Toaaa!!!! Whose the daddy now 🇼🇸 ",
        "Rugby League played at this level is the best football game",
        "Who said little guys won't make it, I love the Underdog tags. Congrats Toa Samoa",
        "History made!! 🇼🇸",
        "Disgraceful most of Samoa's team were born in Australia",
        "What a match ",
        "Congratulations Samoa  that's was one of the greatest game to watch love from ur fijian uso 🇫🇯🇫🇯",
        "I am not suprised at all. How many Samoan players are playing for NRL teams?",
        "🇼🇸 SAMOA!! To bring that kind of performance after a hard defensive game against MMT! WELL DESERVED!! Let’s appreciate the huge monetary sacrifice our pacific brothers made to represent their family, their heritage 🇼🇸 🇹🇴 🇫🇯 !! This Samoa rugby league team will be loved for Genrations let’s TROT TOA!!!CHEEEEHHHHOOO!!!",
        "So it's Australia green versus Australia blue in the final. Fair enough.",
        "This game was awesome to watch. Both team gave it their all Good game 🇼🇸󠁧󠁢󠁥󠁮󠁧󠁿",
        "MASSIVE CONGRATULATIONS TO OUR PACIFIC BROTHERS, SAMOA, LOVE FROM PNG🇵🇬",
        "Malo le tau-malosi Toa. Faavae I le Atua Samoa ",
        "Congratulations Toa Samoa 🇼🇸 on this amazing, deserved win for the history books. And thank you England 󠁧󠁢󠁥󠁮󠁧󠁿 (except for Tomkins lol jk) for this epic battle.\n#Cheeeehoooo 🇼🇸🇼🇸",
        "KAU LE KĀUA🇼🇸️",
        "Congratulations Samoa. All the best from Fiji.",
        "Thats bonkers from 60 - 0 in early rounds to winning. Happy for Samoa but it will really be a miracle if they do it again agaìnst AUS",
        "Well done our fellow Pacific friends! Your neighbour from PNG is proud of you.",
        "The ref kept Egelagi in da game Toa Samoa outplay them as simple as that. Alu Le Toa Samoa Malo Samoa",
        "Samoa 🇼🇸 The USO  \nCongratulations  #Pacific_Brothers 🇫🇯",
        "Daddy loves you ️",
        "fa'amalo le Tau Malo USO TOA O SAMOA ua le ole Lea TOA ua e sii SAMOA I luga ole ma'a salafa. ole viiga male fa'afetai ile lo tatou ATUA ele fa'aititia... fa'afetai fa'afetai lava le talk mana'o...o Samoa ua lagona le fiafia.... onosai ileisi taua olea tapua'i atu Lou nu'u GB you all.   Outou mama na USO TOA O SAMOA.",
        "From an MMT.. enjoy it all Toa. Man what a scene it would be to beat the kangaroos next week.",
        "congrates to Samoa, see you next week :)",
        "685 baby 🇼🇸",
        "Great  That English  Shower  are Out...",
        "Fkkknnnn Leeessssshhhhhhggooo! Party up in Western Sydney! U know we all backing them Supersamaons!",
        "I'm an Ireland union fan, but I was cheering Samoa along the whole time. Sensational game, I'll be supporting you in the final!",
        "Whats with england choking in world cups this weekend. Womens rugby unbefeated since 2019 choke final. Mens league clean up game 1 of pool play choke semi. Must be pretty big whatevers making them choke over there",
        "Malo lava Toa Samoa, you did it! Well done boys - mālosi - Cheeeehooo!!!",
        "That was like a anime redemption arc.\nLike samoa was the main protagonist who lost his first fight and vows to never let It happen again by training non stop.",
        "5am woken up this morning by cheers, excitement and fireworks going off in my neighborhood  here in Manurewa . I don't follow rugby but I knew it was samoans and maybe there was a game. sure enough i Google search  and samoa vs England. just amazing our Pacific brothers finally made it to the finals. a day I will never forget. Vinaka boys ",
        "Best rugby league game ever!!🇼🇸",
        "Crichton the Smiling Assassin ",
        "Congratulations  Usos you all makes us Islanders proudonce again congratulations ...love from Fiji🇫🇯"
    ],
    "comments_disabled": false
}