{"video_id": "yruMoo7wRPM", "comments": ["They doubted us from the jump after that 60-6 loss. But against all odds the boys showed out every week and played their hearts out  SAMOA THE DAY HAS FINALLY COME 🇼🇸🇼🇸", "I’m TONGAN but man I cheered loud n proud for our SAMOAN brothers all morning!!!They carrying us polys on their shoulders n they ain’t got nothing but our support!BRING HOME THE CUP!🇼🇸", "As a Fijian I'm so happy for Samoa. After our narrow loss to NZ I lost interest in the RLWC but seeing Samoa win like this just brought me back. Thank you Samoa.  Pacific Island brothers. Win this for all of us. 🇼🇸 🇫🇯 🇹🇴 🇵🇬 🇨🇰  🇳🇿", "The whole city of Apia in Samoa is going berserk, and Samoan fans worldwide are losing their minds. A historic win for Samoa and for all small South Sea island nations in the Pacific.🇼🇸🇹🇴🇫🇯🇨🇰🇵🇬", "I'm an Ireland union fan, but I was cheering Samoa along the whole time. Sensational game, I'll be supporting you in the final!", "What a legendary game!! Much respect!! Go Samoa!! I’m Tongan and very proud of the boys, we as islanders should support our Island brothers \nLet’s Go Samoa!!!", "as a welshman i remember losing to samoa in the union world cup in 91 and 99 and how the english all laughed at us - well they aint laughing now", "This was literally a GRAND FINAL MATCH. both teams were super awesome. England did not give up & Samoa grabbed the win & they deserved it.  Let's go Samoa 🇼🇸 ", "Absolute A+ game from Samoa. Great S/F from both game. All the best Manu in the final. Love from Fiji 🇫🇯", "Many thought it would be an easy game for Eng but Samoa did their best. Thanks for making the islanders proud Usos. Love from Fiji.", "LUAI was right. The 60- 6 score helped samoa, first because it humbled them, all the talk about their star studded team, and second it made them feel on the ground and train hard and concentrate on their work they needed to do to get the team to work together as one.", "Congratulations Samoa! Super proud as a Pacific Islander!!! Love from PNG  🇵🇬🇼🇸", "Being a Tongan i give credit to Jason Taumalolo and Andrew Fifita for starting the Pacific Island movement to play for your hertiage and hope to inspire the cousins in the Pacific to do the same and now Samoa is at its best with best players in the league so proud of them our cousins Samoa they can go all the way!! 🇼🇸🇼🇸 I think of my Samoan Family loved ones who have passed and are still here today ", "Proud to be Samoan is all I got to say. Win or lose in the final they’ve done us all so proud Cheeeehoooo 🇼🇸 🇼🇸", "Wow , what a game. I haven't felt this excited about any sport in 20 years.  I am hooked on Rugby League.", "🇼🇸🇼🇸🇼🇸🇼🇸🇼🇸🇼🇸 regardless of how many trials and adversity the boys faced during each of their games(especially this one with poor bunker and ref calls) you all continued to press forward and persevere. So proud of you boys. Malo Le Tau🇼🇸 lesssss go Toa. Looking forward to the finals", "As a Union man for over 40 years, this was one of the finest games of rugby of either code that I have ever had the privilege of watching. Thank you to both teams for putting such a great show on.", "Many thought it was gonna be an easy game for England, but England played their absolute best and still fell short. This Cinderella story for the dark horse of this world cup keeps getting better", "I’m an Englishman and I can honestly say I wanted Samoa to win . \n\nNo messing about with these boys . Pure professionals", "Pacific made it to the Grand Final. We ALL made it. Thank you Samoa 🇼🇸  🇵🇬  🇹🇴 🇫🇯  🇨🇰", "I'll be 100% honest here and say that as an Australian I now want to see Samoa win the tournament. What an amazing accomplishment that would be.", "Incredible game down to the wire.  Malie Toa Samoa malie. History is rewritten today. You guys make us all Polys proud espescially us Tongans. POLY UP.TOKOUSO. You guys have the hunger and heart to take the championship from Australia and to keep repeating it for the next years to come.  Hats off to Toa Samoa malie e va'inga malie well deserved and rep the Polys and take that trophy next Saturday. 'Ofa Atu Poly Up TokoUso4Life", "Despite the loss to England, we salute our Pacific brother - Samoa for the tremendous challenge resulting in the win - congratulations - We are Islanders. We still find ways to take on the raging seas.🇵🇬", "I tell you what . That was a game and a half. Nobody left anything out there. I think England might have been thinking about the big defeat they inflicted on Samoa early in the tournament , but there was way too much class for that to happen again in the Samoan team. Now , unless you're Australian, EVERY single person in the world that follows rugby league is Samoan next week ( just for a day ). Just on another point, I really don't like the England jersey for this tournament. England, in my mind , have had some cracking jerseys they could have paid homage to.", "I was mocked online for suggesting that Samoa were dark horses to go all the way. No-one is laughing now - what an achievement for a small island nation!", "5am woken up this morning by cheers, excitement and fireworks going off in my neighborhood  here in Manurewa . I don't follow rugby but I knew it was samoans and maybe there was a game. sure enough i Google search  and samoa vs England. just amazing our Pacific brothers finally made it to the finals. a day I will never forget. Vinaka boys ", "well done Samoa enormous respect for the Samoan nation. well done hope you win the final. most of the England fans will be supporting you good luck.", "Congratulations Toa Samoa 🇼🇸 the first ever Pacific Team to reach the finals. I wish you guys all the best. Tonga 🇹🇴 will pray together with all the Pacific nation and support you to win the World Cup.", "Well done to my uso brothers  what an emotional moment that was. Tears was just streaming down my face as I witnessed history being made from your neighboring island in Fiji, a big congratulation and best of luck in the final. We'll be cheering throughout", "Bring home the cup Samoa.... Support from Fiji 🇫🇯🇼🇸", "I'm proud of samoa. You guys make us proud as islanders. Go for the trophy. Bring it across to island shores. Support from png.", "Let's go Samoa!\nLove from PNG🇵🇬", "Redemption has never been sweater, Congrats to Samoa!", "I wonder if Rugby Union would consider same arrangements to its players like Rugby League. It would make Rugby Union a bit more interesting to watch, like RLWC….well done Samoa. Toa Samoans were hungry enough to deserve this mighty win over England. How can a team changes from 60 down to win in less than 4 weeks!!!! Well done Samoa", "What a historical win made by the Samoan team. Such a masterpiece game of play, well done and u all deserve the victory. The courage and strength u Guys showed in your game cannot be described by any word, seriously. . The game played showed that u weren't only playing to win it for the Samoan Nation, but to win it for the all other Pacific Islands. Thank you poly brothers️. All the world's best in your finals game with Aus. Much love from PNG🇵🇬.", "What a moment for Samoan’s world wide wow wow!! Well done they give so much heart and put their bodies on the line every week in the nrl! You deserve all the praise", "Am a🇵🇬 but I cheered on Samoa fm kick off to the field goal by Crichton. They were passionate, inspirational and just watching Paulo and the Toa Samoans play for their beloved tiny nation thus inspire the smaller Pacific nations including 🇹🇴, 🇫🇯, 🇵🇬, 🇨🇰 plus Jamaica, etc..Go Toa Samoa 🇼🇸 to win the 2022 RLWC, Yes!!", "That was like a anime redemption arc.\nLike samoa was the main protagonist who lost his first fight and vows to never let It happen again by training non stop.", "Congratulations Samoa 🇼🇸 We your Pacific Island Brothers are so proud that you've made it into the Final.\n\nWe will be supporting you all the way 🇵🇬🇹🇴🇫🇯🇨🇰", "Painful loss for England. Great guts and skill from Samoa. Good luck Samoa for the finals to push the mighty Australian team all the way for the WC Trophy.", "To all my Polynesian people around the world & that supported our beloved Samoa team 🇼🇸 that one for all of use Tongan,Fijian,Cookisland,PNG when one wins we all win  United we stand. To every other nation who backed us up much love to use as well.685 all day history has been made I’m so proud of the boys  It’s home stretch now ", "Unreal try and heart by Samoa! Let’s go the Pacific ", "Well done Toa Samoa and wishing you guys all the best on the finals much  love from 🇹🇴 let's go Samoa!", "MAN WHAT A GAME  🇼🇸🇼🇸🇼🇸🇼🇸 was I the only one crying when we won ?🥹I’m sure my neighbours want to call noise control for the amount of cheeehooos were coming out", "Proud Samoan, supporting from Riyadh. Incredible passion shown! Loved the intercept try from Stephen and of course the golden point 🇼🇸 ", "Let's go samoa  whole of Pacific is behind you", "Congrats to Samoa. What an excellent turnaround from that first game ", "What a match!!! In the history books!!!", "Samoa's second try was magnificent   Go Samoa 🇼🇸", "Crichton is the new intercept king. Doing it in big games, grand final and semi final of a wc!! Samoa 🇼🇸  ", "Reaching the semifinal was a history to our nation and our people but reaching the final is a historical moment for us and our pacific brothers  God bless both Samoa and Australia win or lose you should be proud of yourself boys/ just bring it", "I was at the match yesterday supporting England... I've got to say congratulations to Samoa I think the best team won fair and square on the day... What an incredible game it was I've been to 9 matches so far but that was the best... Good luck in the final Samoa I'll be at the game cheering you on  ", "This is the greatest sporting achievement this year!!! Samoa were incredible today!! So glad I was there today!! Chhheeeehhhhoooo!! 🇼🇸", "Thank you for this series, an insane amount of effort has been put into this to make possible. Truly gives nostalgic vibes.", "You can’t help but admire that . Both teams never giving up . I really hope you stick it to us Aussies in the final and really have a red hot go . The world is so weird  at the moment that you never know what can happen , best of luck", "What an absolute brilliant outcome for Samoa...what Samoa has done not only amplifies the athleticism of the Pacific Nations...absolutely awesome and well deserved Samoa", "Well done to our pacific brothers samoa from this maori boy in nz.", "This is the craziest game I’ve ever seen. It could’ve went both ways. It was all down to that last kick. Beautiful end to the game. I’m not part of the Polynesian community but I am super hyped to see how far Samoan is going to go in this. They have all of the Pacific on their backs. Show the world that we could ball too. ", "Never underestimate the underdogs.\nCredit to England for a crack of a game. But our boys 🇼🇸🇼🇸🇼🇸 went to the next level with this one.\nWin or lose in the grand final doesn't matter, we are more than proud of what you boys have done for our small nation.️️️ GO TOA.", "Had tears in my eyes watching the final moments so proud of the Samoan brothers representing there People! Have your moment and glory samoa! You make me proud to be Polynesian! As a cookislander and NZ MĀORI! You have our full support usos!I’ll be rocking my toa shirt and flying y’all flag come final game! Cheeehooooooo!🥹🇼🇸🇼🇸🇼🇸🇼🇸🇹🇴🇹🇴🇹🇴🇨🇰🇨🇰🇨🇰🇳🇺🇳🇺🇳🇺🇳🇺", "Best rugby league game ever!!🇼🇸", "I from PNG and I'm proud of my pacific brothers making history in Rugby League. \nSAMOA 🇼🇸 ", "Well done Samoa🇼🇸🇫🇯\nCheering from Fiji", "Congratulations Samoa! A very fair referee which produced a very brilliant contest. This is very healthy for Rugby League as a sport.", "Congrats and great game Samoa, infact history has been made. The Luai MASTER CLASS was on show, absolutely ripped in. Chricton, a Legend already. #respect. ", "Thanks to those who aren't samoan getting behind the boys that support really mattered. This ones for the whole pasifika community. 685 all day", "Being Dutch I don't know too much about rugby. This semi against Eng was really tight, could have gone both ways at any point, I thought. But all match long, I was afraid Samao would lose due to the ref and Eng's home advantage. Some ref calls weren't too fair on Samoa's side, I thought?  Anyway, the last 3 Samoa games (France, Tonga and England) were really impressive with very spectacular and intense play. And the last 2 matches, espec this semi, were an absoute rollercoaster from beginning to end. Some of the best team sports I've ever seen. I wish them all the best in the final, I will be supporting them from the Netherlands for sure!", "Now that’s a real World Cup match. And yes sensational win Samoa ", "Two awesome semi finals the whole of aotearoa behind the warriors in blue \nGood luck for the final", "Pacific made it to the Grand Final. We ALL made it. Thank you Samoa 🇼🇸 🇵🇬 🇹🇴 🇫🇯 🇨🇰", "Bring the trophy home Samoa.  PNG rooting for you.", "As a Tongan. Samoa deserve all the hype rn. Made history ma usos🇼🇸🇹🇴", "Awesome Samoa..!!! Great win, just about getting tired of Aus,Eng & Nz always dominating the Rugby League world cups. Be rooting for you in the final too in the hope you create new history in rugby league. Go Samoa.!!", "when the boys just look and hope that the kick is good...and it did...that feeling of joy...priceless! Great one Toa Samoa! @2:40", "Malo lava Samoa. What a game. A team that got smashed in the first game has made it to the finals. Luai has silent the haters. Up the mighty Toa Samoa.", "What a game to watch our Pacific island neighbors Samoa playing their hearts out there.   Congratulations Samoa.   From Fiji ", "Wai toa wai toa SAMOA way to go the poly Brothers from  a Kiwis fan ", "Mighty Toa Samoa!  The Usos laid it down all on the line, gave it everything they had and then some.  One more to go to cap it for the history books!  Already an epically historical win to be first Polynesian nation in a RLWC championship final.  Surely erased that first round lopsided loss to England in that first round match weeks ago.  Proud of our Samoan blood and heritage.  My Tongan blood always knew it would be my Usos first to get to a RLWC championship game as we Samoans by nature are more communal than our Tongan brothers who tend to be more individuals as when we Usos see one another, it’s nothing but love whereas Tongans are more competitive with each other when they first meet.  That’s why when one of us Uso gets in a fight, we all fighting no matter how deep our numbers or the opposition!", "PNG here, Talofa to our PACIFIC BROTHERS, SAMOA you made us all proud..Congratulations.", "Samoa winning is a win for all indigenous pacific islanders. Thankyou Samoa for making me take interest again in the world cup. Will be cheering loudly for you. Much love from PNG. 🇵🇬", "As a Bronco. I'm so proud of Herbie.", "Congratulations our Pacific brothers.. Love from Papua New Guinea ", "Thank you Samoa on behalf of PNG. History for all pacific nations.", "MASSIVE CONGRATULATIONS TO OUR PACIFIC BROTHERS, SAMOA, LOVE FROM PNG🇵🇬", "Great game samoa big  blessing to the final vary proud of your guys Pacific power all the waybula from 🇫🇯🇫🇯🇫🇯", "Maori / Samoan here I was hoping for a Kiwis vs Samoa because either way I could have cheered for both, so good  let's Go Samoa", "Heart of a WARRIOR.  TOA SAMOA.", "16 players, 1 sin bin & the ref against them the lads said hold my  ", "History in the making. Good luck Samoa the world is behind you", "They're currently 4.5 hours into the stream and have reached 88% of the goal amount.  Good on Charlie for caring and doing this for Lance and his family.  Looks like they'll make the goal easily.", "Man, that was a master-class performance! Cheering from PNG", "The greatest semifinals ever 🇼🇸 well done England youse made your nation proud 󠁧󠁢󠁥󠁮󠁧󠁿", "History made!! 🇼🇸", "Wow . What a game . So many people wrote Samoa off . Good on you guys . The Pacific nations will be a force to reckon with in the coming years .", "wow , a great day  for the greatest  sport of all to go global . I supported every team . LONG LIVE THE GREATEST SPORT OF ALL RUGBY LEAGUE", "What a sensational game \nBoth teams play amazingly well \nUnlucky for the English but a huge congratulations to the Samoans \nGood luck in the final", "Lessssgo! Congratulations our pasific Brothers! Luai you're a magician! PNG In full support!", "Congratulations He Toa Samoa 🇼🇸. I really hope your team takes out the comp. Good luck and all the best you deserve it this is your time to make a stand.!!!!", "This is amazing for the nation of Samoa, just goes to show you, it doesn't matter the size of your nation, what matters is your determination.....it helps that they're a team of absolute monsters!! But talented monsters haha", "England had all the chances too what a game Samoa "]}