{
    "video_id": "Z02zptUN8gI",
    "comments": [
        "Swedeeen",
        "Long live Egypt",
        "la cancion de LA BICGOTA LA REPITO UNAS MIL VECES AL DIA TE AMO KAROL",
        "Karol se merecía Grammys.. pero a trabajar duro para ganarlos próximamente. Que nosotros apoyamos tú música, siempre.",
        "From Cairo \nLove this song so much ️",
        "n exito de musica te amo karol",
        "Vamos tenemos qué llevarlo a 120 millones el 13 de diciembre este temas tengo 73 años y la escucho echada media hora hagamoles pues a llevarlo a lo alto famila nosotros podemos ",
        "la mejor mi rena",
        "escutando pela, perdi até a conta, que música meu Deus, que vibe boa, linda letra",
        "Karol g sin duda alguna no necesita de nadie para brilla, ella es la luz! Brilla solo brilla Karol como solo tu lo sabes hacer ️️",
        "Solo le falta hacer plagio de la Quemona ajajajahaha",
        "2019:tusa\n2020:bichota\n2021:makinon\n2022:cairo",
        "La Reyna!!️",
        "Ami me encanta esta canción y todas las canciones de Karol g pero ese ritmo es para mi es diferente y me encanta simplemente me gusta, la verdad no me gustaría que isieren más canciones con este ritmo pq se perdería la magia de esta cancion",
        "Muy bonita canción",
        "WoW llegamos a las 5 millones de vistas #Cairo esta es una canción hermosa que he escuchado ️️️️️️vamos para las 10 millones.",
        "Temazoooo",
        "Me encanta karol g\n Tanto q mis vecinos ya abran aprendido la canción tanbien.",
        "Love you karol from cairooo🇪🇬🇪🇬🇪🇬",
        "Solo carol g , puede transmitir lo que quiera de tan buena manera, es un ser de luz,  su nobleza de mujer la lleva hacer la mujer que es, solo me resta enviarle mis más sincero respeto,  un abrazo y mil bendiciones",
        "Karol no falla una cancin, todas se convierten en un xito global.",
        "Demosle antes de que acabe el año a llegar a 100 millones puessss",
        "I'm Egyptian and this song was amazing we all love you and Egypt TOO !!!🇧🇷🇪🇬",
        "Hermosa canción. Me encanta.️️️",
        "soy yo o la voz que se escucha de fondo es de benito",
        "العربية احدى لغاتي المفضلة ",
        "Me ata ",
        "Yo reproduciendola a cada rato ",
        "El nuevo tema del Verano!!\nGracias Karol por esta joya ️",
        "Vamos a apoyemos a cairo es la mejor",
        "Jenifer",
        "O que hermosa dama",
        "Número #2tendecias wooo!!! ",
        "Hola una petición, podrías de dejar de pagar tanta pero tanta publicidad es un enfado tener que aguantarte 5 segundo cada ves que quiero ver un video, gracias bonita tarde",
        "Pareces (()) jajaja jajaja jajaja",
        "Te amo ️️️️",
        "Saludo d Nicaragua vichota ️🇳🇮",
        "Por que se escucha de fondo el bad bonny desde provenza, ¿será señal de colaboración?.",
        "Después de escuchar dos veces me gusto",
        "voy a escucharla hasta cansarme jajajsjsj",
        "7",
        "Tiene el mismo ritmo chileno el medio corte",
        "Otro himno \nMe encanta ",
        "gracias por sacar esta cacion \nhermosa ",
        "Come_to_Egypt",
        "caray mujeeeeeer eres un bombazooooo!!!!!! no existe, insisto no hay una como tú.",
        "Soy la única que escucha la vos del en el fondo ?",
        "En una parte de la música se escucha a Rosalía, no les pasa lo mismo?",
        "A mí me encanta Karol g Karol g es la mejor ya",
        "Quien más viene varias veces al día a escuchar este himno?! O solo yo? 🫣",
        "️",
        "La voz de Karol es muy adictiva joo ️",
        "The best \n\nNo sé si e' el alcohol\nLo que me tiene confesando esto ",
        "Carol G soy tu fan chica de 7 años me mandas un saludo",
        "Llegando a los 33M queda poco a los 35 ",
        "Familia Fandon las de Siempre  a seguir reproduciendo tenemos que cerrar el mes con 110 millones. Vamos que notros podemos al igual que GATUBELA tenemos que cerrar con 200 millones antes que termine el mes. Apesar de mis 61 años con mi maldita enfermedad, tengo la Fibromialgia y estoy con morfina no dejo de escucharla cada media hora siempre me desvelo por mis dolores y  la escucho  igual. Son temasoo que nos alegra el día a día.BENDICIONES! VAMOS PUES POR NUESTRA BICHOTA ",
        "Karol g eres mi inspiración por seguir mis metas te Amoooooooo  se que un día te conoceré en un concierto tuyo ",
        "Amo tus canciones Karol g te amo eres una reina !! Hermosa ",
        "Vamos para los 50 millones de vistas",
        "Te    amooooo",
        "Ya llegamos a #4 en tendencia vamos bichotas a seguir reproduciendo\nUpdate ya #1 en muchos paises #KarolG te amo",
        "Rumbo a los 100MILLONES EN 1 MES POR QUE KAROL SE MERECE ESO Y MAS VAMOOOSS! ️",
        "Sigamos no paren",
        "Meta: 35M antes del viernes. A reproducir vamos vamos ️️️",
        "que hermosa",
        "Lo me tiene confesando ️",
        "CAIRO-Letra\n\nNo sé si e' el alcohol\nLo que me tiene confesando esto que estoy sintiendo desde hace rato",
        "Genio me encanto el tema la música. Karol g Reina total Bella por dentro y por fuera. Con una gran Sencillez y un henorme️. Te Amamos desde Mi querido Paisito Uruguay 🇺🇾",
        "Eres el mejor ovy on the Drums y con la bichota un hit mundial. Esta cancion es otro nivel!",
        "Así mismo  #JohnpyJohnner \nDEJA TU OPINION\nMientras que tod@s L@s #Bichotasempoderadaos reproduscamos su música  y seamos fieles el tiempo y la constancia lo dirá todo ",
        "Los verdaderos fans vamos a llevar esto  más y más lejos...así que a seguir reproduciendo este hermoso himno ️",
        "hermosa cancion de la bichota",
        "NO SE SI ES EL LO QUE ME TIENE CONFESANDO ESTO QUE ESTOY  SINTIENDO DESDE HACE RATO\n#Bichotasempoderas  comenten su parte favorita de la copla \n#KarolG",
        "karol  g    tee amo  mucho  pero  nose  cuando  sera tu  prosimo  consieto",
        "Igualmente kim",
        "Ya casi los 10 millones, sigamos reproduciendo esta joyita ",
        "A hora mi meta es reproducir para los 40 millones, me encanta  ",
        "Ya quiero un remix con bab bunny ",
        "Pareces (()) ,,, jajaja jajaja jajaja",
        "Estamos bajando en tendencia . Vamos vamos !️ A darleeeee",
        "Los verdaderos fanaticos se conocen aca apoyando a su artista",
        "Genial la traciooooon todo chevere",
        "Este será un himnooooo escuchen la letraaa ",
        "La amo",
        "Daniel Oviedo, mijo sos el mejor, que temaso tan tan tan HP mostro, por uds. Estamos en oidos de todo el planeta, de medallo pal mundo nos pusieron en el radar musical del mundo, FELICITACIONES Saludos a la paisana Karol la mejor, dios los bendiga, saludos desde Villavicencio, aca esta pegado el tema, dios los bendiga, sigan tirando palos y dejando a medallo en la cima",
        "A reproducir cada 30 minutos , nosotros somos muchos y esto lo ponemos en tendencias ya mismo ",
        "M so much addicted to this one that i listen it evrday",
        "Todos los días, Cairo by karolg y ovy mi duo favorito, los amooo",
        "A cocoyol y a la leche hoy me voy",
        "Puro exotiqueo ",
        "Temazo",
        "No me parece raro que este número 1 en España yo no dejo de escucharla ",
        "siempre pensé que la que cantaba en estas canciones era la Chimoltrufia de los programas de Roberto Gómez Bolaños.",
        "Ya volvi anduve reproduciendo wn spotify #losdesiempre",
        "Todos apoyando este gran tema... vamos hacerlo tendencia... karolG#1",
        "Bebesuki",
        "U look like a moon",
        "Este tema es una chimba como dice KAROL G",
        "No importa si bajamos la tendencia #1 lo que importa es el apoyo que le demos con cada canción que nos traiga, aquí los verdaderos fans",
        "Sigan escuchando esta joya",
        "Hola madrina karol soy renata tu ahijada   ",
        "Me encanta esta canción reproduciendo para llegar a los 30 millones",
        "Soy mujer pero como te almiro por tus triunfos y humildad la mejor chingona",
        "Amo ️Amo️",
        "5 millones en 1 día️WTF️ la que puede puede, sin necesidad de chismes, ni de colaboraciones, simplemente enfocada en lo tuyo y como siempre rompiendola a lo grande.",
        "🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷",
        "vamos por lo 40 millones ",
        "Con todo 40 M ",
        "Tiene 10.000 millones de seguidores en SPOTIFY pueden reproducir por YouTube cada media hora aunque se encuentren en el trabajo, lo ponen en silencio por nuestra 🇨🇴 seblo merece. Tenemos que llegar a los 30.000 millones.  Lo inmensamente feliz que la haríamos .A ponernos a full",
        "Este temazo está #1 en tendencias de música y ya lleva 5 M de visitas en un día. ¡Vamos por más! Karol rompiendo, cómo siempre.",
        "A karol g se le ve la humildad en la cara...",
        "#Team BICHOTA ",
        "Colombia",
        "Que tema, me encantaaaa. Provenza estuvo genial, gatubela tb y esto es un ritmo tb diferente. Y ella guapísima. Nunca me cansaré de karol g, esta mujer es incombustible. Ojalá tenga algo con Feid, se merece un tío a su altura. Pero sola brilla.",
        "Vamos mi gente a demostrar de lo que somos capaces los verdaderos fans de la bichota. A reproducir pues!!!!.️️️️",
        "BIENVENIDOS A LA ESTADIA DE CAIRO MIENTRAS UD DISFRUTA DE ESTE NUEVO TEMA,  UD PUEDE ENTRENERSE LEYENDO LOS COMENTARIOS DE BECKY G FANS , SELENA QUINTANILLA (QUIEN REVIVIO PROXIMAMENTE ,MICHAEL JACKSON, Y QUIEN VIENE DEL MAS ALLA PARA HABLARNOS DEL PLAGIO QUE SUPUESTAMENTE KAROLG  LE HACE A LOS MUERTOS.. AQUI SE ENCONTRARA CON LA MISMA PERSONA HACIENDOSE PASAR TAMBIEN POR  RBD GENERACIÓN... ARREBATADA , ANDRES URIBE, ANDRES LUJAN, ANDRES SANDOVAL ,JUSTICIA DIVINA   QUIENES LES ENCANTA LA CACA  , LAS BALLENAS Y LOS CERDOS TIRÁNDOLE HATE  A KAROL G 24 HRS AL DIA PARA QUE LA DENUNCIEN EN SU PASO POR CAIRO ",
        "Vamos todos a reproducir este rola en apoyo a nuestra Bichota ",
        "Hermosa calor ",
        "me gusta la cancion pero que tiene que ver ninos aqui ..esta hablando sexo ahaha lo que hacen para vender",
        "Exitos",
        "Hay que reproducir esta bajo cairo para que pueda llegar al mes a 100 como la demas a hecharle ganas ",
        "K rikaaa camcionnn",
        "Vamos Bichotas y Bichotes a reproducir este temazo, regalo que nos ha dado nuestra Reina hermosa @Karolg ",
        "Increíble el talento de esta mujer, siempre algo nuevo con sus canciones, y Ovy junto a ella hacen las mejores hits!! Nunca aburren, increíble Karol!!",
        "vamos .vamos a reproducir bichotas y bichotes somos los mejores fans que tiene la bichota a subirla a 40M ",
        "LO MAS HERMOSO ES EGIPTO THE MOST BEAUTIFUL IN THIS VIDEO IS EGYPT",
        "Señores tenemos que subir las vistas",
        "Morrrrrr",
        "Amo está canción todos los Días la escucho te amoooo Karol Dios te bendiga siempre",
        "Soy de Argentina y como se escucha  mucho a KarolG acá se valora más a ella que a las propias cantantes de mi país hay que admitir que KAROLG  es una artista completa es única en el mundo de la industria musical ",
        "https://youtu.be/byN2HE2rIxk KG, JAMAS NADIE LA VA APAGAR NUNCA ",
        "Cada minuto más cerca de los 100 M ️",
        "Eres una chingona mi @Karol ️",
        "Saludos desde El Salvador ",
        "Man dawn Rihanna",
        "Llega un niño a la escuela con un ojo morado y la maestra le pregunta:\n¿Que te pasó ?\nY el niño le responde:\n– Es que en mi casa somos bien pobres y dormimos en la misma cama: mi mami, mi papi, mi hermano y yo.",
        "اللي دخل عشان الاهرامات يجي جمبي",
        "No one told me Karol id coming home",
        "Otra canción que llenó mi corazón de amor por lo mejor. A lo largo de su carrera, ha demostrado que tiene la habilidad única de cantar canciones rápidas y lentas que se acercan a su hermosa voz. Cada nuevo lanzamiento de una canción nunca me ha defraudado y muchos otros ️‍",
        "La mejor",
        "llorona G ",
        "No se pero está canción tiene una letra muy boba",
        "Pensaron que en una 1 semana iban a tener 100M\n Ni comprando Kaká g vistas por qué ella misma sabe que se le caería la xd",
        "No me gustava dormi con nadie , e ahora sin el no me duermo ",
        "vamos ya esta en #1 tendencia en peru vamos con todo a compartir el video️",
        "En el minuto 8 :40 wow",
        "Le copio el ritmo chileno se llama perreo guaracha una mescla de regeton y electrónica eso es mucica chilena pake sepan",
        "100 por favorrr yaaa antes del mes",
        "TE AMO Karol g me encanta Toda tu musica",
        "Pareces (()),,, jajaja jajaja jajaja",
        "Perra la cancion ",
        "yo ahora se lo dedico a mi ex que me engaño con otra pero yo lo voy a superar como ala bichota",
        "Aki escuchando a Karol g desde los estados unidos",
        "Toda una diosa",
        "Yo pense que era la canción oficial del mundial de Qatar",
        "Brutal me encanta.",
        "MAESTRAAAAAAAAAA",
        "Karol ...  La verdadera reina. Del género ️ a romperla ... Y sigamos reproduccióndola     #1 En ECUADOR 🇪🇨",
        "Vamos por lo 30 millones hoy que la gente sepa que ella es la única reina",
        "Yo la amo más ",
        "Copy paste Rihanna  Man down! Why? She hates when somebody copy her!",
        "Hermosa canción..karol",
        "Te quiero.  Mucho Karol g yo estoy orgullosa de ti sube más canciones",
        "️️🫶🫶️️️️️️",
        "Los Angeles California ! ️️L.A CALI ",
        "Recuerdo cuando en el tema de Paulo, Paulo dijo que Ovy pedía siempre destacar lo más posible y ahora veo por qué. \nMientras escuchaba la canción esperaba la parte de Ovy y nunca apareció, y pues creí que salía por qué en el título del tema venía su nombre.",
        "Yo pensé que Luisa la cantaba pero como en TikTok eya dijo que  nuevo treen poreso pero no cagrolli g",
        "Me encanta te amo Karol g",
        "Chicos no dejen caer Cairo a reproducir masss hay que demostrarle nuestro amor a la bichota ",
        "Te Amo Karol G <3",
        "Such a beautifull video ",
        "llegamos a los 31 vamos por los 40 millones  ",
        "Gracias a todos los que hacen que esto sea mundial, los amo DESDE DONDE ESCUCHAS CAIRO?",
        "Ustedes se imaginan un Remix con bad bunny uuffff 🇨🇴🇨🇴🇨🇴🇨🇴",
        "La mejor Karol G ️️",
        "La reproduzco todos los días es la mejor canción la amo ️️️",
        " LOS DE SIEMPRE VENIMOS CADA MEDIA HORA A REPRODUCIR ESTE PALOOO  ",
        "Muy cerca de llegar a los 30M sigan reproduciendo, a mantener el #1 en tendencia de la bichota",
        "Amooo cada día más a esta rola",
        "NUESTRA KAROL JAMAS NOS DECEPCIONA POR ESO ES  LA UNICA REYNA DE LAS REDES",
        "Dejo mi comentario acá para que cuando a alguien se le ocurra dejar un \"me gusta\", me llegue una notificación y me recuerde que tengo que volver a escuchar ésta joyita ",
        "A reproducir pues",
        "No manches está canción está bien top no se pq no está pegando tanto como TUSA",
        "Dios está contigo Karol g amen️",
        "هاهاها لا أعرف ما إذا كان الكحول هو الذي جعلني أعترف",
        "Vamos por 100% sigamos dándole por mucho más se lo re merece ️️️️",
        "La mejor me encanta",
        "LOS QUE ESTAMOS APRECIANDO ESTA JOYA ANTES DE QUE LLEGUE AL MILLÓN !",
        "copiona de  la rosalia",
        "Si",
        "Guaaaoo 21 M. En 8 días, síganos perreando con la Bichota y Ovy...",
        "Q linda musica el ritmo",
        "Desde España bichota las 9.50 de la mañana otra vez escuchando la canción ️️️️️️️️️️️️",
        "Vamos por los 35M  y duro a SPOTIFY",
        "Hello from the land of Cairo ️",
        "Te amo KAROL G",
        "Adoroo",
        "Hermosa canción me encantó Karol te pasaste con esta cancion",
        "Ya tengo una hora escuchándola bastante pegajosa ",
        "ملاحظيين اقبال المشاهير لاراضينا العربية ودي خطوة حلوة عشان تنشال عننا افكار الارهاب وغيره",
        "te  amo karol g eres la megor",
        "Y seguimos en tendencia #2 en México 🇲🇽",
        "Hermoso",
        "Veo que algunos fans de nuestra reina estn como flojos vamos chicos que si podemos llegar a los 50millones de reproduccin nuestra reina selo merece  arriba CAIRO",
        "طلعوها ترند يا جماعه",
        "No nececitabas promocionarla ",
        "Número #1 en españa 🇪🇸vamos sigamos reproduciendo este temazo #cairo🇪🇬🇨🇴️",
        "Que temazo",
        "Porque será q la voz de fondo suena como la voz  de bad bunny?",
        "Karol g ven a aguachica",
        "te amo",
        "Karol no falla un tema, sin duda es la Reina del género!! ",
        "Hermosa bendiciones  muy bonita tu música la amo",
        "🇾🇪",
        "Espectacular como siempre mi Reina ",
        "Karol ️",
        "Me estoy enamorando solo un poquito.",
        "Adivina el siguiente color de pelo de Karol G\n2018 - Rubio\n2021- Azul\n2022 - Rojo",
        "️️¡¡Hago un llamado a todos los fans de la Bichota a reproducir Y eso es para todos los fan del mundo《con respeto》 ponganle play a Cairo no ignores este mensaje #karolG@lanumer1\n#Bichot@sempoderad@",
        "Vamos a seguir reproduciendo CAIRO esta en 4 tendencia,GATUBELA nro3 tenemos que llevarla nro1 mundial. Argentina nro1,República Dominicana nro1 Vamos que nosotros podemos  a darle duro por nuestra BICHOTA HERMOSA se lo merece ",
        "Te amo Karol g con mi corazón ",
        "Physical fit soc sing",
        "#TEAM #BICHOTAAA",
        "Si se pudo 30 millones",
        "uwu uhu",
        "Me gusta la nueva canción de Karol g ",
        "Todas las cansiones de karol son  hermosas",
        "Te pasa igual, yo te lo noto también. .️️️.",
        "BICHOTAS ️ vamos a reproducir al ",
        "Los de siempre apollando a la Reyna de Karol g  dios está contigo BICHOTA ",
        "Muy buena    canción   KAROL  G",
        "Ella cerrando por lo grande una reina no da menos, hay niveles COLOMBIA  🇨🇴",
        "Te amo mi reina hermosa mi bichota favorita ",
        "Te  c0nfieso que al final de esta cancion tiene un terno y si saca un terno con este rimo te vas a cordar de mi soy de republica dominicana  san cristobal nelly mejia",
        "Me encanta!!!",
        "Messi va a ganar el mundial",
        "Ayer me decidí a ver el vídeo y me gustó mucho, hoy vuelvo a verlo porque aunque no sea fan, debo reconocer lo bonito de este trabajo.",
        "Que buena la canción viva  Karol     ",
        "Rompiendo como siempre, junto a los de siempre mi Karol G este himno está ️‍️‍️‍🇻🇪",
        "Te amo karol",
        "Is this Egypt?  It is very different from my country, Japan.\nI want to see pyramid someday.\nI'm happy I can enjoy music in any places in the world♬",
        "Sigan escuchando esta joyita ️",
        "Súper activa  vamos por 40M",
        "Esto de no parar de escucharlo jajaja  lo ame ",
        "Aunque el video fue filmado en El Cairo, los medios egipcios no arrojaron luz sobre esta obra maestra. 🇪🇬",
        "Karol no falla una canción, todas se convierten en un éxito global.",
        "te amo muchísimo karol g te quiero mucho ️️",
        "Ven a guate mala",
        "Como queremos a la nena de Medellin en PR 🇵🇷🇵🇷🇵🇷️️️️",
        "No soltemos bichotas y bichotes apoyémos a nuestra reina  con Cairo, Gatubela ,y provensa a darle duro ella se merece eso y más",
        "Uffff Esas letras erizan, hacen mover fibras, qué magnífico ( nahhh puro sarcasmo)",
        "Vamos por eso 10,000,000 millones de visitas antes de 3 días apoyen quién está com migo",
        "Me encantocairo",
        "Ella siempre nos lleva a lo fantástico con sus canciones ️️",
        "Esta canción me pasa en la vida realestá muy buena, como siempre.",
        "Si esto empezó así, no me quiero imaginar cuando salga el disco 🥹🥹 Muchos mas éxitos para ti, Bichotaaaaa!!! Eres un ejemplo a seguir  🫶 Colombia y el mundo presente!! ",
        "Vamos todos a reproducir Cairo en Spotify también  ya mero entra a los 50 global",
        "Nunca vi a Karol tan feliz cantando...las tomas en el bus ..su sonrisa....",
        "Me encanta️",
        "De chile ",
        "karol g siempre rompiendo bendeciones desde republica dominicana",
        "@KAROL G Deberias hacer un video clip en Perú \"Machu Pichu\" Seria genial ",
        "Es mi imaginación o en una parte canta como la Rosalía en la parte q no se le entiende nada",
        "Amo esta canción",
        "Vamos para el billón",
        "40m hoy!!! Vamos",
        "PLAGIO",
        "Jaja.. Falta poquito",
        "Sexo una vez (niños corriendo) el cairo.... No tiene sentido el video con la cancion ",
        "Sigue así Karol g heres la mejor te admiro mucho ",
        "Estoy segura que esta canción va a lograr grandes cosas ",
        "Vamos por esos 40M se lo merece nuestra",
        "Me encanto el tono la rola todo",
        "Esta mujer tiene una Capacidad tan especial de hacer canciones La letra es demasiado ,Osea todo esta bien preparado es un Temazo   ",
        "Ella saca las músicas y nosotros las llevamos a lo grande hasta que todo el mundo entero las escuche",
        "KaRoL G se convierte en la primera artista latina femenina en superar los 30 Millones de seguidores en Spotify",
        "Vamos a escuchar este hit todas las veces que se pueda al día para subirlo ️ aún más ️️",
        "Me encanto esta joyita",
        "Aporar a nuestra bichota # 1 en tendencia asi sigamos a reproducir ",
        "30M casi casi , los de siempre reproduciendo al máximo ️",
        "vamos vamos vamos a seguir reproduciendo ️️️",
        "Te amooo",
        "eso es nuevo '''''",
        "Si voz es importante la sigo desde el 2015 y cada ves me impresiona más su talento te amoooo ️️ gracias por interpretar canciones para cada etapa de nuestras vidas orgullo colombiano 🇨🇴",
        "Chile tendencia.... 7, sigamos...",
        "Gracias mi reina!!! Por entregarnos está música!! Eres una artista mundial! Te mereces todo lo bueno que pase en tu vida ! Eres mi ídola",
        "Me  encantas  karol  eres  una  mujer   que  nunca se   rinde y  lucha  por  tus  sueños la verdad eres muy   humilde me  gusta  tu  manera  de  ser ere  única  eres  estupenda   cuando  escucho  tus  músicas   me   siento   más   fuerte   eres   una  guerrera",
        "Ya que en los gramys no la reconocieron nosotros lo haremos ella se lo merece vamos a reproducirla todos los dias sus canciones",
        "\"El amor no estaba en el contrato\" Jaja Carolina te amamos pero ya todos sabemos a qué se debe o mejor dicho a quien se debe xD",
        "Te amo bichotaaa unos de mis sueños es conoserte seria una esperiensia unica te amo ️️",
        "Ya llegamos a los 30 millones, vamos a seguir disfrutando este tema hermoso ",
        "Otro hit️\nVamos a reproducir,vamos a apoyar a la gran bichota️ \nTenemos que ser tendencia!!! Cómo siempre!!\n🇲🇽🇲🇽🇲🇽🇲🇽",
        "️️‍",
        "Estamos terminando noviembre con 30M y un poco.mas casi diciembre demosle con todo que se viene hey mor y hay si que se acaba el Internet vamos sigamos reproduciendo",
        "En todas las plataformas hay que reproducirlas, nosotros podemos #Sporify, Karol G se merece más reconocimiento.",
        "MARAVILLOSA, REINAAAA, UNICA, QUE TEMAZO, #1 EN EL MUNDOOOOOO\nescuchenla en Spotify cada 20 minutos vamos al top Global",
        "Me gusta micho.",
        "Esta mujer tiene la forma  para sorprendernos cada vez más ️",
        "No pego casi",
        "Karol no hace canciones hace himnos ️",
        "La verdadera bichota ",
        "arriba la bichota ",
        "Karol eres la mejor  cantante ",
        "Qué hermosa ️️",
        "LLEGAMOS A LOS 28 VAMOS A LOS 30M CON TODO!!!!!!",
        "Era hora, será un gran éxito esta canción, hay igual que yo existen muchas personas esperando cada una de tus canciones. Te deseo el mayor de las bendiciones Karol eres la mejor.",
        "Desde España otro día empezamos con esta preciosa canción bichota eres fantástica ️️️️️️️️️️️",
        "karol G  que cante en un  mundial  :)",
        "Karol últimamente ha sacado temas buenos, no como los de antes",
        "KAROL jamás nos decepciona, esta canción ya la tengo en repeat. QUE CHINBAAAA ",
        "Yo repitiendo mil veces la canción por que siento que no la disfrute como se lo merece ",
        "Karol grande",
        "Mamasita ️",
        "La amoooo",
        "Cairo lo escucho desde\nOAXACA ️",
        "cuando karol g dice que me falta poquito es que falta poquito para los 30 milloness ",
        "Me encanta esta canción , amo locamente a Egipto y ver sus monumentos con buena música de fondo es lo mejor ️️️ saludos desde Venezuela 🇻🇪️",
        "Deberían sacar una versión como el final con ese toque de electrónica",
        "Es mi hermano y todo pero perdió su talismán",
        "Es bonita",
        "Buenas noches fans de la BICHOTA,no paro de reproducir espero ver por la mañana que allá subido a #1 para que así vea ella que todo su esfuerzo nosotr@s lo valoramos poniéndola en lo más alto que es lo que se merece,ahora ya me voy a dormir desde que salió este tema no ago descanso con las reproducciones y leyendo me agote buenas nochescairit@s pues realmente es muy parecido asu nombre ",
        "Vamos reproducir como loc@s\nVamos por los 300millones.\nLa Bichota se merece eso y más.!! ",
        "Sigamos reproduciendo este temaso debe de llegar a los 100m  te amo Karol g",
        "Mi canción favorita, todas son mi favoritas  te amo KarolG",
        "La mejor Karol G",
        "Necesitamos llegar antes del mes a 100 millonesss",
        "MAMI COME TO TUNISIA ",
        "Llegamos al #1 en 2 días ️‍ a seguir reproduciendo por la bebesita ",
        "Te amo Karol G, pero esta canción pareció La Rosalía y creo que ambas esencias son totalmente diferentes, ps: Es solamente una opinión sin querer ofender a nadie, amo a la Rosalía también, solo no me gustó que tuvieran la misma onda siendo totalmente diferentes...",
        "Es linda la bichota   buena musica",
        "🇦🇷🇦🇷🇦🇷🇦🇷🇦🇷🇦🇷🇦🇷",
        "Aquí los qué pasan por acá a escuchar más de 5 veces está hermosura CAIRO ",
        "Apoyo bichota",
        "Los queremos ️",
        "Me suena a Paulo londra",
        "Son mi cancion favorita cairo, gatuvela, provensa, bichota y mami",
        "#TEAM #BICHOTAAAA",
        "Sigamos reproduciendo este temaso debe de llegar a los 100m  te amo Karol g ",
        "me encantaaaaa",
        "Aquí seguimos reproduciendo ayuden ps ",
        "La Reina del género 🇨🇴🇳🇬",
        "No sé que pasa que no apoyaron el tema",
        "Tendencia #4 en USA vamos a reproducir",
        "Esperaba más de Karol ",
        "El próximo video de karo va a ser en la nieve ",
        "Falta poquito para los 10 M, vamos a seguir reproduciendola cada Media hora ️",
        "Essa mulher nunca me decepciona!!! Perfeita.",
        "Felicidades Karol 13 días de lanzado y todavía #1 en tendencia",
        "Full apoyo",
        "que porquería",
        "No paremos de reproducir ",
        "Miles de éxitos Carol g y miles de bendiciones la chingona eres tú Reyna. ",
        "Meeeeeeee encanta su voz!!!",
        "Cada día estoy más orgulloso de ser latino ",
        "Matices de vocesita femenina que me encanta buen flow y sensuidad sutil eres mi amor semi platónico karol g",
        "Falta poquito jb",
        "️️️️️️️",
        "Vamos Para los 50 millones ya es tiempo despierten fans de nuestra bichota",
        "uffffffffffff puro fuego",
        "From Cairo and I love this song 🇪🇬️",
        "Te amo karol g eres la mejor cantante del mundooo",
        "CAIRO <3 2022 <3 :)",
        "Sin duda es la única mujer del género urbano que logró sobresalir... muy orgullosa de ella TODAS sin excepción alguna son lo mejor",
        "Hermosa ",
        "Que es esto ? JAAJA",
        "La BBsita..",
        "Vamos a reproducirla faltan muchas vistas para llegar mas alto animo ",
        "Grammy",
        "Esta canción me lleva a otro planeta muy, muy buenos vibes!!",
        "31Millones  a por los 40",
        "Vamos reproduzcan un chingooo vamos a apoyar ala Reyna del género la que sin necesidad de hacer escándalos ni colaborar se pone número 1 la verdadera bichotaaaaa",
        "Nos honraron en su segunda patria, Egipto⁦ Una elección muy acertada y una canción maravillosa, Espero que la hayan pasado muy bien aquí..Siempre son bienvenidos, mis seres queridos, en mi país.🇪🇬",
        "#cairokarolg",
        "Queda muy poco para que llegue a 1 en tendencia vamos!!!! Gracias a todos por el apoyo y las vistas que la hacen llegar a grandes premiaciones",
        "Te amooo karol eres la mejor cantas mejor que yailin,bueno no te comparo \"con esa \"como dices tú ",
        "Pero te pasa igual yo te lo noto también ",
        "Quien más escuchando de nuevo está belleza ️🇲🇽",
        "VAMOOOOOOOSS, SIGAN REPRODUCIENDO!! esta canción se merece mucho, fue un sueño que Karol ha cumplido, y así como ella lo quería, vamos familia, hagamos que esta canción sea tendencia mundial!\nTe queremos Karol G ",
        "sigamos reproduciendo \nya casi los 10 millones ",
        "Casi 5 millones en un dia y sin colaboración está mujer la admiro mucho definitivamente ella es un gran ejemplo que después de una caida una se puede levantar con más fuerza te amo karol eres una inspiración para las personas que hemos pasado momentos difíciles pero sobretodo para LAS MUJERES TUS BICHOTAS saludos desde🇪🇨 #teambichota",
        "El mejor tema del 2022 que chimba pues karolg ",
        "Esta canción ya es éxito trascendente y ascendente   es un auténtico lujo tener a una mujer en el  reggaeton cantando y no pujando como María becerra y la Rosalia o ru alejandro annuel y bad bunny de verdad que asco  pero ella siempre  va por diferentes ritmos y todo le acomoda ..\nFelicidades!!",
        "el video es perfecto me encantaaaaaaaaaaa",
        "Hola saludos desde medellin visita este link",
        "creo que esta cancion me hubiera gustado mas si el ritmo el outro era toda la cancion",
        "Vamos todos a reproducir esta joyita ",
        "Que bonita que es y que lindo canta ",
        "Lo más mundial es el talento y el orgullo que inspira está hermosa mujer todo lo que hace es increíble está canción es lo máximo ️",
        "Ya llevamos 3M subamos más like a poderla 1lugar tendencia ",
        "Conque era Ovy On the Drums. Siempre pensé que era ese reggaetonero argentino el que decía eso.jaja",
        "Les agradezco mucho por elegir Egipto para hacer esa canción tan bonita ️ Egipto tiene gran belleza que mucha gente no la conoce  Bienvenidos todos a mi tierra ",
        "it's not Cairo look like ",
        "Todos en algún momento prometimos  nunca volver a confiar en él amor , pero lo que es para ti siempre llega a cruzarse  en la vida...grande cairo️",
        "This is wonderful. I am proud to have you in Egypt, Carol️",
        "La amooooo️",
        "Me encanta la canción mi Bichota Dios te bendiga  a ti t todas ti familia sigue adelante",
        "Anuel: Tus amigas te aconsejan mal como si son la que te lo meten\nKarol: Mis amigas me dicen que eres medio perrito\n\nSe estan tirando",
        "️️️️",
        "Quien es la voz de fondo ??",
        "Veo que algunos fans de nuestra reina están como flojos vamos chicos que si podemos llegar a los 50millones de reproducción nuestra reina selo merece ️ arriba CAIRO",
        "Haciendo el proyecto de 5to año para poder graduarme.\nPero CAIRO 🇪🇬 de fondo no falta nunca ,,️",
        "La rompieron una ves más los duros del momento a ponerla # 1 otro palo mundial ",
        "Listening from 🇿🇲",
        "Bella  bendiciones ",
        "Esta en loop desde que solo tenia 1.2M de vistas. Ahora la hemos escuchado 3.6M, Karol disfruta tus logros Mami",
        "Si este tema es el 2 alguien link del numero 1",
        "🫶",
        "Me encanta esta canción",
        "Karol prometenos que vas a ganar los gramys. Confiamos en ti y en tu talento ",
        "Vamos para los 40 millones nueva meta .",
        "#1",
        "Hermosaaa canción eres la diosa de las canciones nuestra reina te amamos ️ esta letra de esta canción correrá por nuestras venas te amamos ️ Karol por siempre",
        "ME ENCANTAAAA LA MUSICA mi diosa te adoro karol G",
        "Ya tenemos los pasos de baile para Cairo... Tambien los vieron en los Latín Grammy",
        "BIENVENIDOS A LA ESTADIA DE CAIRO  MIENTRAS UD DISFRUTA DE ESTE NUEVO TEMA,  UD PUEDE ENTRENERSE LEYENDO LOS COMENTARIOS  SELENA QUINTANILLA (QUIEN REVIVIO PROXIMAMENTE ,MICHAEL JACKSON, Y QUIEN VIENE DEL MAS ALLA PARA HABLARNOS DEL PLAGIO QUE SUPUESTAMENTE KAROLG  LE HACE A LOS MUERTOS..",
        "Ésa niña que te pasas copiando fué la misma que té partió por el mismo medio en los Grammy 2022 ROSALÍA TÚ REINA ",
        "megutaria ver a feid y a karol  junto como parajas no se si ustedes se andado cuenta pero entre ellos hay una fuerte quimica   comenten ustedes si es asi o no",
        "Reina de las reinas !!!!  Te amooooo ",
        "Vamos por mas es un temazo que le quedó bien a  a nivel mundial Saludos desde mi isla del encanto 🇵🇷",
        "muy buena la cas\ncion",
        "Karol  tu ques en Dios",
        "Cada ves mas nos sorprender con algo mejor  cada día mas , sigue asi eres una gran mujer te admiro 𝕜𝕒𝕣𝕠𝕝 𝔾",
        "Vamos por esos 100 millonesssss",
        "Vamos a seguir escuchandola vamos hacer que suban las vistas a demostrar que los de siempre estamos apoyando cada tema que saca aqui escuchandola minimo 10 veces al dia 🇲🇽",
        "Vamos a reproducir cada media hora para q cuenten las vistas esto se tiene q ir top global vamosssss teambichotas #CAIROKAROLG",
        "Na na na que pista mas fresh, me encanto como termina, q7e flow el de la bichota",
        "Lo fresca que se ve Karol g montada en esa combi. Se ve feliz, plena, su rostro ilumina ️",
        "Esta chida la rola y la instrumental pero le falta sonoridad expancion mejor mastering  digo a comparacion de las anteriores que a sacado karol",
        "Es enserio saber que es la Reyna de estos tiempos aún no tiene los like que se merece, activence mi genteeee... Desde dónde se reportan.\nEl nuevo Hit mundial del verano 🇵🇪",
        "Parfaite comme toujours,",
        "YA LA HE PUESTO 5 VECES A TODO VOLUMEN EN MI CASA!!!! QUE TODO EL BARRIO SEPA QUE LA REINA TIENE NUEVA CANCIÓN ",
        "Buen ritmo y buena edición de video, envolvente y la voz de karol es un himno. Más canciones como esta, seguramente sera épica para el verano.\n️",
        "Diosa️",
        "Ahora la meta es llegar a 50M en menos de una semana, like si quieres que la bichota siga siendo #1 en tendencia en música",
        "Me gusta mucho esta oír Cairo",
        "El gran legado de Karol G, está sonando mucho. Gracias por esta canción, es un rolón, será otro hit como Provenza, gracias por darnos música y nunca nos dejes de dar.",
        "Soy de Brasil y me encantan las canciones de esta reina. Karol G eres increible 🇧🇷🇨🇴",
        "Te amo mi Karol ️",
        "Karol g ️te amo mi princesa ️️",
        "Te amo karol ",
        "No sé ustedes pero yo quiero que este tema llegue en un día a 3 millones de reproducciones 🥹",
        "Hola Karol como estas saludos desde Barquisimeto Venezuela conchale como deseo que pronto muy pronto vengas a mi país éxitos y bendiciones saludos",
        "Perreo Guaracha se llama el sonido es ritmo chileno pake sepan",
        "POV TODOS LOS COMENTARIOS : KAROL G MI IDOLA ETC\nLA REALIDAD KAROL G ES UNA ARTISTA MUY BUENA LA BICHOTA SIGUE SIENDO UN EXITO SIGO ESCUCHANDOTEE!!!!",
        "Desde España bichota las 7.18 de la mañana vamos a escuchar otra vez mas ️️️️️️️️",
        "salud de Egiptooo",
        "Me encanta es favulosa ",
        "🇵🇪",
        "Es la mejor canción",
        "10 reproducciónes la día y asta mas",
        "Letra \n\nNo sé si es el alcohol\nLo que me tiene confesando",
        "Karol y Ovi deberian premiar a los fans que mas reproducen la canción",
        "por más que la escucho mas la quiero oír ",
        "Esto sí que es melodía, letra, ritmo, calidad, contenido, locaciones...  Te pasaste BICHOTA! Felicidades ",
        "Vamos sigamos reproduciendo",
        "Welcome to the mother of the world, Egypt, civilization and history 🇪🇬",
        "Me encantan tus canciones GUAPETONA",
        "Karol es otro nivel de mujer es una persona hermosa no solo físicamente si no en sí su esencia  3s super tierna y humilde Dios la bendiga siempre",
        "Eres la mejor Karol ojalá y puedas hacer un concierto en Cuba Artemisa",
        "Que vibe boa essa música me trás, Karol,  linda como sempre!",
        "Ya casi 6 millones apenas en 1 día y vamos por mas ️ Karol la mejor ",
        "Te amoooo Karol G",
        "essa musica fisou muito top!",
        "Lyrics:\n\n\nNo sé si es el alcohol ",
        "Amé este tema de la primera vez que lo escuché. Llevo como 6 días escuchandolo. \n  Buena Karol g",
        "Y aquí tenemos otro hit, nunca nos decepcionas Karol G ️",
        "Alto tema !! ️",
        "Amo las canciones de Carol g",
        "Lo vi una vez y ya lo volví a reproducir, CAIRO ",
        "Karol G 🇲🇽",
        "Mirá ésa belleza",
        "Vamos por los 2 M vamos vamos en menos de 10 horas tenemos que hacer esto tendecia mundial️️️",
        "Dedicada a los que por alguna razón cerramos el corazón ️‍, que decimos que ya nadie cumpliría nuestras espectativas, pero de repente llega alguien que ya es imposible resistir, te da todo lo que mereces ",
        "Shakira a melhor",
        "Sigue. Que. Vas. Bien. Ala. Chingada ..los .fracasos.\nLa. Vida. Es. Una sola.   Carol. .la. Mejor. ..muy. Desente.. que. .valga. Madre.  Los. Fracasos...y. Borrarlo ..desde Venezuela .",
        "Cairo, Provenza y Gatúbela son mis hinos favoritos.🪩️",
        "Estamos llegando a Los 30M️",
        "DISLIKE ",
        "Te amo mi Reyna ️",
        "Cerrando el 2022 toda Latinoamérica escuchando esta rola en estas visperas del mundial de Qatar 2022 y visperas de navidad\n\nFeliz navidad y próspero año nuevo a todos",
        "No agas caso de la jente pendeja Eres la mejor te admiro mucho tus cansiones son las mejores",
        "Vamos no flaquiemos por nuestra artista",
        "Es increíble todo lo que le está pasando a KAROL, en solo meses te has convertido en una de las caras del genero, súper fan de tu trabajo, espero conocerte pronto, al igual que tú mi sueño es algún día vivir de la música, trabajo de 7am a 7pm librando un solo día a la semana e invirtiendo todo mi dinero en la música, y aunque no he sacado aún la mayoría de cosas que he hecho ya lo estoy empezando a sacar para así de esa forma cumplir mis sueños que es vivír de la música y callarle la boca a varios que no confían en mi, mientras tanto te felicito por lo que haces que sigan los éxitos ",
        "Letra \nNo sé si e' el alcohol\nLo que me tiene confesando esto que estoy sintiendo desde hace rato\nSé que el amor no estaba en el contrato",
        "اللاه ! ايه المفاجأه دى",
        "No one will ever see this thanks to you tuube algorithm but I hope to make it big one day ",
        "hola",
        "Los de siempre QUEEN",
        "Buahhhhh temazo",
        "Siempre la rompeeee!! me encantaaaa!!",
        "Pero te pasa igual yo te lo noto también.....",
        "Hay papy ",
        "No paro de escucharla ️",
        "Hagamos muchas reproducciones para que el día de hoy llegue a 11M",
        "Yo me lo aprendí a los 4 días q se estreno y ya lo sé todo",
        "Hermosa",
        "desde Colombia",
        "\"y aquí me tiene hablando bonito \" ufffff ame esa frase",
        "Sonho de valsa de brinde na música chocolate branco obrigado acabou de chegar",
        "Seamos honestos, Karol g nunca decepciona, sus canciones siempre son increíbles."
    ],
    "comments_disabled": false
}