{"video_id": "ZM5JmWD_OGQ", "comments": ["IF YOU READ THIS YOU HAVE TO SUBSCRIBE! :)", "AMAZING VIDEO GOGY! My fav parts were when I was in it! :D", "george did all that work to get on the plane first... just to get on the plane last LMAO", "I felt so bad for George he lasted so long, but he defeated so many on his way and I'm proud of him ", "George's reaction when he realized he hadn't won was priceless\n\nEven though you didn't win it, we are all proud of you, George", "The collab we didn't know we needed, but is so very welcome- George and Jimmy.", "Even if George didn't win, his level of dedication for that 2.5 Million Private Jet is absolutely insane.", "George's reaction when he realized he hadn't won was priceless ", "i know george hates editing, but he's genuinely so good at it!!! can't wait for more george vlogs :D", "Seeing george in the recording room at the dream team house is just; oh man\n\nI never thought we’d get here hut we are!", "Charlie is an actual saint. So glad we have people like him helping others out when they need it.", "the fact that george was so dedicated the whole time- props to him", "I can't help but feel sorry for George, he worked so hard trying to get that plane only to lose at the end", "I love how George narrates his videos, makes me laugh and feel so happy with his words ", "Did Dream actually just succumb to helping George edit so quickly ", "George's reaction when he realized he hadn't won was priceless", "We're still proud of u George<33 even though you didn't win. Your dedication throughout is incredibly amazing.", "I already knew how it ended but it still hurt to watch. George went so far, great job ", "Even if he didn't won, I was impressed with how far he went, that ending hurts.", "George: gone for 17 hours \nDream and SapNap: You think he fell asleep ?", "GEORGE!!! this video is so well put together, i really really enjoyed watching it, i’m super proud to see how far you’ve come, you deserve the universe <3", "Poor George, he tried so hard just to get into the plane last but he put in a great effort.", "It's incredible that has been able to go that far because the strength you must have in your arm to keep it up that long is incredible. Still amazed every time I see how long people can last in these videos", "I love yall’s content.  It always helps even during rough times so thank you and I know it hasn’t been easy for you. thank you for the work you’ve put into making others feel loved.  God bless and Jesus loves y’all <3", "props to George for surviving so long in the challenge, he almost got it, love to see you upload", "Lol, I can't get over how small George looked compared to the other 2 when he had to have his hand up, he looked like he had to really stretch to keep  his hand above the tape   ", "“I must win Mr Beast’s $10,000 Refrigerator” and “I must win Mr Beasts $2,500,000 Private”. Something seems awfully similar here.", "The fact that this is the same title like techno's fridge video shows how much gogy is still respecting that man", "THE GUY SAYING “George is struggling I can see it in his face” cutting to George’s face, eyes wet a teary at 4:10 is the funniest shit ever", "I’m so proud of you! You did this really good!", "Even though you didn't win it we're all still proud of you George <3", "Good job Gogy! You stayed strong through the end and you still won in our hearts :) you, and Karl always make me smile", "i NEVER would've thought i'd see speed and george next to each other ", "george did way better than some of us expected. him having that jet would have been a big advantage with his friends and them zooming everywhere:,) but so proud at how long he has stayed in the challenge>:)", "\"I think you care for your dad so much you can't conceive a world where you'd let him get hurt\" this video game is full of one liners that hit you where the feels are.", "Editing George while watching George is another type of happiness", "Niko and Lazarbeam holding hands made me feel some type of way I can't lie", "Lets all appreciate the effort and hard work George puts into his videos for our entertainment", "Ya hate to see the slow roll at the end but congrats on the performance you had it the hardest and endured the most i gotta say", "I didn't think George would make it far,  he did amazing ", "George's reaction when he realized he hadn't won was priceless  indeed!", "Man I love Harry. Such a nice guy even asking Mr beast to check if he took it off. Genuinly hope to see George and harry in  future videos together", "Dream and George have alot in common, they both lost a Mr Beast challenge", "Honestly loved seeing this group of YouTubers coming together like this, pretty good chemistry and never would’ve expected to see Speed screaming at George like that lol", "Can we all just admire the fact that he is THIS dedicated to making us happy? >:(", "I just like how intense George makes his videos because of his british accent. It's like a quest ", "George did so much better than I thought, I fully believed he won  16 hours is huge congratulations George you were soooo close", "like literally George looks really cute and hoping that he's gonna win and he has held out for a long time and he was absolutely amazing!! he never fails to be always perfect, still a winner in our hearts <33", "George becoming a full-time YouTuber is what we need for the end of the year", "ISHOWVIRUS, this stream changed my life. My entire view of everything that exist in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience.", "gogy will always be a winner in my heart", "Man i felt bad \nMy arms already hurt just from watching this but congratulations :)", "George your vlogs are so well put together, please do more of them! ", "idk if anybody noticed this but I love how George titled this vid similar to technoblades’s “I must win mr beast’s 10,000 refrigerator” it’s really wholesome :D", "Congratulations George for surviving that long ... I would have passed out in the middle of the challenge", "I honestly knew george wouldnt win, BUT OMG 16-7 HOURS??! thats grate af!!", "george never fails to entertain his fans. he makes all of our days good.", "I never thought I’d see george interact with speed after the charity match but here we are", "The dedication is incredible. \nProps to you George!!", "very proud that you made it so far gogy. love the irl content keep it up", "Dont worry George has his pro strat, he uses it all the time especially in the most important events like Lore streams, sleeping", "Lets be honest, we all smiled when we saw the notification", "That's so sad. But im still proud that he went so far into the challenge. He was so close to winning the jet. I actually thought George won the jet.", "loved ur editing+storytelling in this video george!!! so exited for your next vids always<3", "It's incredible that George has been able to\ngo that far because the strength you must\nhave in your arm to keep it up that long is\nincredible. Still amazed every time I see how", "I'm so proud!!! THIS EDITING IS AMAZING GEORGE!!", "that was amazing! you did so well, great video as always.", "Congratulations on the jet man! It was insane!!!", "The ending really hurted for george LMAOO\nprops to george", "Even tho he lost, he still did good, he made it this far :>", "Mad respect for coming second and beating niko", "Ah yes, Jimmy definitely needs more subscribers than George", "This feels so much like Techno's refrigerator video with the title and the editing/commentary style ", "man george honestly went  the hardest bro tried to go first in the plane just to get screwed over and go in reverse not only did he get a bad seat in the plan when he was planning to get the best seat  but he did it twice impressive", "you did so good George!!! You won in our hearts <333", "You are the best George. Your videos makes me happy ", "Imagine walking by the hanger and seeing like 8 grown men just touching a jet ", "YOU DID AN AMAZING JOB <33", "funny how harry knew he took his hand off but still won LMAO", "I remember watching this live after starting to watch him for his bedwars/blitz videos. I thought he was hilarious and insane at PvP, so when I heard that he was going to be in a tournament with some of my favorite and biggest Minecraft creators, I instantly tuned in knowing that he was gonna be a force to reckon with. Little did I know that his previously small audience would multiply and his dream of 10 million subs would come true. I enjoyed every second of watching Technos channel grow. I always kept up with his content, even though admittedly I grew up and stopped watching as much minecraft content as I used to. However, Technos content always reminded me of watching his videos late at night, laughing my ass off at his witty jokes and dry humor. His jokes and mannerisms were more universal, and even as I became more mature his banter would always strike a chord with me.", "I'm so sorry you didn't win! They honestly fooled me too. You did so well! Congrats on 2nd place though!", "I love this so much George- I’m so excited for this new irl direction :D", "This was the most unexpected but needed colab on YouTube ", "You did so well george so proud of you!", "harry and george is a duo ive always wanted more of", "I was so sad when George lost, but i'm impressed that he went that far. Great video :)", "I love these vlogs!! So much fun", "Good job George! Even you got 2nd I’m still proud of you.", "It's incredible that George has been able to go that far because the strength you must have in your arm to keep it up that long is incredible. Still amazed every time I see how long people can last in these videos", "So cool to see goerge do such things now ", "He actually survived so long I’m proud of u gogy", "Skeppy, you have been avenged just shows the close relationship they share and how wholesome they are to each other hurt because of other videos and how close they seem and u can see the pure joy and happiness in their voices and actions", "The fact you kept your hand on the jet for so long is just surprising. I was shocked when you came 2nd", "George is clearly a master of strategy", "YOU DID A GREAT JOB. I WASN'T EXPECTING YOU TO LAST THAT LONG TBH ", "I’m proud of George I really thought he was going to get out in like 10 minutes", "I literally feel very sad after seeing George's face when he lost to second place", "Absolutely heartbreaking! You'll win next time!", "Cheer up George you did great even though you didn't win, atleast you do have sportsmanship to  accept that you loss, still there is still a opportunity waiting for you ️", "Gogy has a track record of being unlucky involving being allowed to fly places, so this was no surprise in the end XD"]}