{
    "video_id": "ZM5JmWD_OGQ",
    "comments": [
        "I thought he would be the first to go.\n\nI have faith in my streamers, Just not in George,  so congrats for getting as far as you did. I truly thought that he had won tho. lmao good vid",
        "If you won I will sub to you but you did not win",
        "HARRY LITERALLY ADMITTED TO IT LMFAO",
        "Mr beast just said “that’s a nice 6 inches” ",
        "As he said Harry took his finger of but they couldn’t see it so it should be yours !",
        "Gogy has a track record of being unlucky involving being allowed to fly places, so this was no surprise in the end XD",
        "I want to f the Mr beast, he's the one who has chills.",
        "Probably would have chosen my middle finger rather than my pointer. It naturally presses against the surface so you don't have to manually apply pressure, just have it near the plane.",
        "People that notice the title is inspired by techno blade",
        "This is like the best behind the scene video thanks George!",
        "George you have to win this!",
        "Hi George",
        "I’m proud of George I really thought he was going to get out in like 10 minutes",
        "from the beginning i wanted you to win man",
        "GG",
        "george you did very good job,you survived for that long  and you almost got it",
        "Big Dub for Harry <3",
        "12:05 NOOOO ARE YOU KIDDING ME GEORGE NOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO",
        "“I was rewarded for having no friends”",
        "Wow you did it",
        "Is Dream uploading soon?",
        "So close!!",
        "0:38 karl’s face is so funny lol and its true ",
        "Me going to the chat me looking at the pined comment ",
        "George never disappoints us ",
        "i want a george and willne collab",
        "even if george did win the jet, it would have been very difficult to keep the jet running, keeping it in hangers is expensive",
        "Wow I have never seen that title before so crazy",
        "This video reminds me to his video...\nRIP king",
        "But you did't",
        "YOU DIDNT POST A VIDEOS FOR LIKE 1 MONTH",
        "If I was Mr beast I would have faked somebody winning to see if they would take their finger off to look who won ",
        "This video reminds me of Dani",
        "George lost for 12 minutes",
        "please always film your pov for collabs like this!!! they never film you enough i need more george content than they give ",
        "Nice title. Love it, seems somewhat familiar.",
        "NOOOO GEORGE",
        "SPEED?",
        "Mad respect for surviving as long as you did",
        "Of course",
        "I'm surprised he let you in even when your leaked video was everywhere lmao",
        "The way Speed lost was peak comedy right there",
        "subscribe:2 years ago",
        "the referance:(",
        "5:18 took his right hand off anyway saw it a few times",
        "You still did great!!",
        "Yes",
        "Ya hate to see the slow roll at the end but congrats on the performance you had it the hardest and endured the most i gotta say",
        "Well George you got close. You just shouldn't have moved that finger. But you literally lasted till the very end so if anything that's something to be truly proud of",
        "I wanted to cry, I was very happy when they said Harry, but it was a joke....",
        "George i wish your arm will be better soon ",
        "I want dream's comment sayn' its alright goggy!",
        "no one is going to talk about what happened to the camera when MrBeast dropped it",
        "The best thing is watching them turn into the legends of Minecraft as for the jet I'm gonna live on it till last man gives up",
        "The collab we didn't know we needed, but is so very welcome- George and Jimmy.",
        "George, I'm subbed and I think you deserved that jet! Ps. Pls make more content with Dream.",
        "The reference in the title ",
        "Did anyone else notice how much lower George's red tape was compared to the others? LOL",
        "I'm so sorry you didn't win! They honestly fooled me too. You did so well! Congrats on 2nd place though!",
        "Do you have merch",
        "Lol, I can't get over how small George looked compared to the other 2 when he had to have his hand up, he looked like he had to really stretch to keep his hand above the tap",
        "obviously yes",
        "THAT WAS SO CLOSE so fun to watch tho lmaoo",
        "George's reaction after he realized that he lost the challenge is so crazy. But anyways, you did very well to come all the way until the end of the challenge. I'm still proud of you, dude. ",
        "But u lost lmao",
        "This feels so much like Techno's refrigerator video with the title and the editing/commentary style ",
        "ok, i know this is pretty far fetched but one of technos old videos (R.I.P king) was called \"i must win mr beasts $something dolar fridge,so mybe just maybe george is trying to carry his legacy ",
        "I watched this video well my hand is completely numb after surgery this made me feel so much better :D",
        "Ahhh yes Nolan's first words \"ummmm\"",
        "Mr. Beast’s self-promo at the end though ",
        "Nice to see Mr Beast Collab with UK YouTubers.",
        "Can we all just admire the fact that he is THIS dedicated to making us happy? >:(",
        "F for my boy George",
        "I'm so glad you lost",
        "YOU LOST",
        "I don’t even need to watch this to know he doesn’t win ur late",
        "George your so close",
        "Top 10 saddest anime betrayals right here",
        "Don’t worry George, I subscribed but you did AMAZING! I couldn’t believe my favourite YouTuber actually was second last!!! ",
        "Title rip off of Technoblade's, \"I Must Win Mr. Beasts $100,000 refrigerator\"",
        "George literally took off his right hand off the plane while sitting at the back of the plane.. 5:10",
        "2:48 speed man ",
        "His only video this year is a re release of Mr beast",
        "Do more videos with dream or clay",
        "Since Dream face revealed, I feel like he should've tagged along with you",
        "george choked",
        "GG George",
        "Top 10 saddest anime endings:",
        "Technically Mr beast accidentally got Harry to take his hand off the plane when George's was still there- so like-uhm\n\nAwkward moment? ;-;",
        "aww it's ok George",
        "i hope to see dream in the next mrbeast video",
        "I am already subed. But for you I'm buying your shirts.",
        "the title seems deeply inspired from something...",
        "I like how the title is a lot like Techno's \"I must win Mr. Beast's $10,000 refrigerator\"",
        "george did way better than some of us expected. him having that jet would have been a big advantage with his friends and them zooming everywhere:,) but so proud at how long he has stayed in the challenge>:)",
        "Techno blade title?",
        "8:14 ah hell naw what is laser doing",
        "Ou lost",
        "Rip George ",
        "The title looks very similar to Techno’s video for when he competed for the $10,000 fridge",
        "I feel so bad for george.",
        "Gogyyyy is back",
        "you did a good job george :D",
        "I am in Birmingham ",
        "I will not watch Mr beast videos again",
        "respect for the reference to technoblades vid love u and congrats on 10mil",
        "Amazing video GOOD JOB IN THE HARDWORK I wish u won it:)",
        "Noooooo",
        "NOOOOO GEORGE WORKED SOOOO HARD!!!!!!",
        "Ah yes, Jimmy definitely needs more subscribers than George",
        "LOL SPEED SUCKS HAHAHA",
        "I know George can buy his own private jet :D",
        "Okay but where would he keep the jet if he did win it? Also would he let Dream and Sapnap on it?",
        "Oof so close",
        "drop the skincare routine pls goergenotfound",
        "I love this vlog man<3 GOOD VID JORGE",
        "I wish i could send $2,500,000 to you! And a private jet!",
        "You deserve 1M Pounds for getting that close",
        "This Guy Is Simply A Legend Who Saw Dreams Face Before Us!",
        "Why George hacked by roblox",
        "watching this after mr beasts video",
        "2nd place RIP",
        "Funniest moment 5:35",
        "George needs to make more IRL content!",
        "NOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO!!!!",
        "Even though you didn't win you did a great job George! You're my favorite YouTuber ",
        "Poor speed ;(",
        "This is simular to technos vid to win a fridge thank you for bringing on his legacy.",
        "HALLO GEORGE",
        "The ending is just so good",
        "I really wanted you to win ",
        "Goofy ahh Georgenotfound the meat riding is crazy",
        "props to George for surviving so long in the challenge, he almost got it, love to see you upload",
        "George this is my idea you can do with dream and sapnap. I commented on Dream’s face reveal vid but idk if he’ll answer so I commented here to get 2times the chance: \n\nPlz DReEeEEAm. Do this before Christmas: The Home alone challenge is a game that u play with the boys (just sapnap and George.) You have to make a house or spawn one in and you have to set traps and the boys have to break in and murder u without u dying. You aren’t allowed to actually hit them and u can only win if u successfully survive within one hour or if u successfully call the police without dying (u can’t call the police until 1 hour passes) You pick how u win but that’s the rules. Plz PlzPlz do this PLZ. OHHHH DREEEEEEEEAAAMMMMM!",
        "Spoiler:",
        "harry and george is a duo ive always wanted more of",
        "I almost cried at the end",
        "Whoever's reading this, I pray that whatever you're going through gets better and whatever you're struggling or worrying about is going to be fine and that everyone has a fantastic day. Stay safe and stay alive.",
        "I was so mad when you lost",
        "You did your best !",
        "LOL",
        "noooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo he was so close",
        "5:14 your hand",
        "Dude tho how did the Doors update trailer surpass him?",
        "I’m cried more about this than I did when my bird died",
        "That's so sad. But im still proud that he went so far into the challenge. He was so close to winning the jet. I actually thought George won the jet.",
        "it's one thing to drop out first, but another to be last. George held on so hard, it's a shame he lost.",
        "like literally George looks really cute and hoping that he's gonna win and he has held out for a long time and he was absolutely amazing!! he never fails to be always perfect, still a winner in our hearts <33",
        "Bro George got the worst treatment",
        "2nd place nooo",
        "Can we appreciate the subtle technoblade reference in the title",
        "ยินดีด้วยที่ได้เครื่องบิน",
        "AMAZING VIDEO GOGY!! Damn, u did all of that work, you almost won.",
        "LMAOOO",
        "Imagine George had breathed or something which caused his finger to lift off the jet for 0.000001 seconds. That ending was heartbreaking. Well done George",
        "Title of this video is like one of Techos titles ",
        "Georg I know how to get all tha money from  Mr beast  take and buy all tha money",
        "Ha",
        "This gotta be my new favorite gnf video",
        "I feel like the title of this video is like a hidden nod to techno, but I might be thinking too much.",
        "i watched this video and saw you lost you were 2nd place but it was still good",
        "You pot your hand of plain in 5:17 becase you have to had your righ hand on the plain",
        "He said 10 minutes at 10:00",
        "the violin though",
        "‘GeOrGe DoNt PaSs OuT’ ",
        "im glad harry won. he deserved it",
        "Poor George ️",
        "Bro look at 2:37",
        "hahaha lol",
        "he lost and still had his finger on the plane",
        "Title reminds me of techno :.)",
        "Come to think of it you and dream look similar",
        "Guess what, he didn't",
        "2:28 \"IShowShame\" ",
        "The techno title",
        "The title reminds me of one if Techonoblades videos",
        "Bro George was pallid at the end of the video.",
        "Yo vi el video en español de mr beast xd",
        "I’m feeling some slight title theft from other youtubers",
        "Rip George’s hand",
        "Techno title go brr",
        "Georges hight was a serious disadvantage tbh",
        "George looks so done standing there with his half put on hoodie",
        "I jas so that guy take his hand of",
        "too bad lol",
        "nice",
        "Oh god, does Nolan realize how hot he is",
        "GROERE! ",
        "WILL's shirt seid Mr. Beats",
        "I was like: YESSS!!! HE WON!!!!!!!!!!! and when they said tHiSiS nOt yOuR hAnD I was like crying and I was like NOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO HE WAS SO CLOSE",
        "You almost won it ",
        "Vau",
        "i feel bad for george he looked so happy that he won but he didn't. still well done george!",
        "At this point, I don't see why Smii7y and Co. CANNOT be the Chaos personified.\nAt least they are having a blast at it.",
        "i will subcribe",
        "BRUH",
        "George your vlogs are so well put together, please do more of them! ",
        "Is that ishowspeed",
        "Why does this title seem so... familiar...",
        "No one asked lmao",
        "aww, man! appreciate your dedication.",
        "If techno was alive he will be here to :(",
        "so sad lol ",
        "Will you be uploading soon because I really want to see you In your new house!!! Also how is dream doing?",
        "I would probably spend a decade doing this challenge",
        "Every Smitty video is a banger 3:-)",
        "sad):",
        "the world biggest youtuber is T sereis",
        "Dream: OKAY NAH IM GETTING GEORGE A PRIVATE JET!",
        "Mrbeast: \"thats what she said\"\nMe: wait what GEORGE IS GAY!?",
        "I had faith in george but hey, im proud of him, he stood there for 16 whole hours omg️",
        "When are you coming to New Orleans we need some of that money down here you give away",
        "GEORGE NOOOOOOOO",
        "Still so heartbreaking today that technoblade is dead ",
        "Technoblade inspired title",
        "Good job george, you almost won! But atleast the plane was given away.",
        "I literally screamed justice for George right after finishing me beasts video",
        "1:30 i folded. i love hands",
        "GEORGE!!! this video is so well put together, i really really enjoyed watching it, i’m super proud to see how far you’ve come, you deserve the universe <3",
        "If I was George and was tricked like that thinking I’d won I’d just kms atp",
        "I was rooting for you the whole time and was so sad to see you lost!! still a great video tho and I love to new editing style!!! keep it up <3",
        "We saw it on mr beast Channel already",
        "sob",
        "Props to George for not falling asleep",
        "It's fine dream will buy him another one",
        "George almost won",
        "I feel sad for u George :(",
        "2nd place is the worst. I would rather be last place than 2nd",
        "aphmau makes boys look bad and makes girls look way better but their actully the same and aphmau just wants to be special",
        "honestly feel bad for george",
        "amazing vlog george :D love youuuu",
        "the violin really added to the last part )': You did amazing George!!!",
        "🇧🇷 mano coitado do George perdeu um jato ️\n🇺🇸 Poor George bro missed a jet ️",
        "Nahh its fine dream can just buy him one",
        "Hiii",
        "They got you so good  I was convinced you were going to win but knowing Mr beast I wasn't surprised lmfao",
        "I was gonna cry bc he lost",
        "I fell so bad",
        "I feel soooo bad for him",
        "George, I never subscribed but today I will because I feel bad for you truly",
        "He did all the work to get second",
        "This was the most unexpected but needed colab on YouTube ",
        "are you good bro i fell kinda bad to you",
        "\"he just tricked me\" welcome to America",
        "This brings back memories to, \"I Must Win MrBeast's $10,000 Refrigerator\" -Technoblade",
        "I love this so much George- I’m so excited for this new irl direction :D",
        "The fact that Harry was like ” i took my finger off, it was me!” Was just so funny to me",
        "I was rooting for you to win!!",
        "Minute 7:33 and 8:11 are the cutest",
        "dw george dream can get u a priv jet",
        "you have very much swag george",
        "ISHOWVIRUS, this stream changed my life. My entire view of everything that exist in this world, in fact, even in the entire universe. I can never look at anything I know the same way again. This stream represents emotions that most humans could never understand. But I can. Thanks to this stream I was awakened to many things previously considered unimaginable. Thank you for this exquisite stream, I will never forget this experience.",
        "George is now a teacher with his smacking stick ",
        "U can ask, can i change hands? Easy lol",
        "Lol what a waste of time",
        "bro the title reminded me of technoblade> :(\nTECHNOBLADE NEVER DIES",
        "I Just Watch That One On MrBeast Vids",
        "The title sounds familiar, pigishly familiar",
        "you lasted longer than i expected im proud",
        "bro sold",
        "I heard 2.5million and my mind went straight to taxes lol",
        "Mr.Beast should do another video with George and give him another shot. One like if you agree .",
        "I ACTUALLY THOUGHT HE WON FOR A SECOND I WENT SCREAMING",
        "well when u get into another mrbeast challenge and u win u can buy ur own private jet",
        "gogy will always be a winner in my heart",
        "george was so smart lmfaooo you did so good ! it mustve been tiring being in that position for a long time ",
        "Bro are we not gonna talk abt how he's not in Florida anymore-?",
        "Flying, ..  on a jet plane,",
        "Good job Gogy! You stayed strong through the end and you still won in our hearts :) you, and Karl always make me smile",
        "Question how was it a spike Island?",
        "My sister has the biggest crush on Georgenotfound but idk why",
        "GOGYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY",
        "can't believe george did all that just to be fooled in the end, lmao. also this title reminds me of techno's; but well done for getting so far gogy! <3",
        "noooooooooooooooooooooooooooooooo you were so close",
        "5:41",
        "Let's just appreciate Jimmy aka Mrbeast for inviting George! Thank you George for this video, we really enjoyed it!",
        "I love your vlog editing style George! Props to you for holding on for 16 hours??? that's sounds brutal, it was very entertaining though, ILY ",
        "I laughed so hard when speed said it was not a real camera because in the mrbeast video it doesn’t show that he said  that",
        "Lazer plays fortnite",
        "Dude I really thought George won ",
        "George:the world's biggest YouTuber MRBEAST PewDiePie walks in PewDiePie:are you sure about that?",
        "Do better",
        "But ya didnt",
        "Bruh, Harry literally admitted to having taken his hand off first...",
        "I love the technoblade title reference. True fans know what I mean.",
        "unsubs and resubs to make George happy",
        "Imagine walking by the hanger and seeing like 8 grown men just touching a jet ",
        "Hola mister beast soy Cindy Ahumada de Barranquilla Colombia mi hijo de 8 años es tu fans #1 me gustaría que lo llamaras sería el mejor regalo de cumpleaños ya que cumple el próximo 5 de Diciembre \nGRACIAS",
        "This video is very familiar to another certain youtuber we knew…",
        "I feel bad about George's lose",
        "that was amazing! you did so well, great video as always.",
        "THE GUY SAYING “George is struggling I can see it in his face” cutting to George’s face, eyes wet a teary at 4:10 is the funniest shit ever",
        "Uhm George, this is my airport! I live in Southend on sea!!! Sutton rkad, am freaking out omg i feel so luckyw.",
        "george i love you!! you finally uploaded i’m so happy!!",
        "I am such a big fan of you George",
        "At least you were close to winning. Great job at staying 16 hours though, idk if I could do that",
        "Aww u were close ",
        "You should’ve heard that jet you were the strongest one in the most competitive one there you should’ve learned it",
        "Oofff painnnnn after hoursssss goshhh",
        "It's okay George if you didn't win, you did great! We love you George! :)",
        "Also technoblade without 4months",
        "Harry's gonna be having loads of fun with his new baby ",
        "I felt bad but then realized George made like 10 mill last year lol",
        "Man i felt bad \nMy arms already hurt just from watching this but congratulations :)",
        "Speed got done dirty lol ",
        "george do a stream with dream please",
        "I do think that other than the first island there are no invisible walls without context and the only one past that, is to block you from a boss fight at the very end of the game. Overall 6.5/10",
        "Everyone get George to 100 million subscribers in the next 2 years!",
        "Pls tell dream to continue uploading I’m sad and I love you guyes videos so continue uploading and it will make me feel better",
        "Out of ALL the people who would steal your kids, I never suspect someone like KC to steal them, Im ashamed of her, she should know better",
        "I Judy watch it",
        "Y’all is that ishowspeed",
        "george 0:55 already had me laughing with his stupid stick ",
        "I did subscribe to make u feel better lol. I was rllyy rooting for u :(((",
        "Mrbeast subscribe for him",
        "George good rider ",
        "george is MILKING that magic wand lmao",
        "hahaha i love george's commentaries ",
        "this was a great video - i do love george's solo videos but also kinda wanna see him in more mrbeast challenges.. more content please! :D",
        "nice technoblade inspired title, glad to see our ping king still reigns supreme from the sky ️",
        "This is a technoblade reference because of the fridge video titled “i must win mrbeasts £10,000 fridge”",
        "hi george! you’re awesome and you make me feel better after im upset",
        "9:52 ",
        "Lmao",
        "karl is so pretty my god",
        "You did good George ️ good job so chair up *Cheer up*️️",
        "Aaaa",
        "And at the end the sad violen music ",
        "Lazerbeam is so funny",
        "NOO i thought you were actually going to win ",
        "\"I think you care for your dad so much you can't conceive a world where you'd let him get hurt\" this video game is full of one liners that hit you where the feels are.",
        "I was with you the whole time :/",
        "Only 1 hour after the video released u do not fail to disappoint!",
        "RIP Gogy",
        "SEMANGAT BUAT KONTEN AJA BANG",
        "Bro went out like techno blade and me beast’s fridge",
        "poor george TT first place was so close",
        "I feel so bad !",
        " you Lost",
        "i was so hooping you will win",
        "I love yall’s content.  It always helps even during rough times so thank you and I know it hasn’t been easy for you. thank you for the work you’ve put into making others feel loved.  God bless and Jesus loves y’all <3",
        "hey GeorgeNotFound uhm in Minecraft Bedrock edition in [lifeboat] which is a SERVER in, and someone is named AGeorgeNotFound",
        "Is it me or is GeorgeNotFound really fun to watch in general",
        "I am subbed",
        "Speed ",
        "And the winer wines one million dollars forom MRBEAST!!!!",
        "I founded ishowspeed",
        "George I wanted you to win!",
        "SO CLOSE.",
        "I feel bad for George ",
        "what is he gonna do with that jet??",
        "Bruh he was rlly close TvT",
        "i NEVER would've thought i'd see speed and george next to each other ",
        "The disappointment on his face when they had him for a sec",
        "NOOOOOOOOO",
        "Turn your friend into a lama",
        "Looks so weird seeing George in Dreams room ",
        "No",
        "George’s storytelling skills>>>>>>>",
        "George, you never disappoint me",
        "I feel so bad for George he worked so hard",
        "The technoblade tribute in the title",
        "I Know this is off topic but just a Minecraft suggetion- Beating Minecraft but Minecraft is getting scarier every minute",
        "You did good :)",
        "George:ITS VERY LONG VERY LONG \nMr.Beast:Thats what she said\nMy face before:\nMy face a",
        "Finally George uploaded a new video after 1 month",
        "even though you didn’t win props for you you survived 16 HOURS. ",
        "Don’t translate \nпод во моментов и ако не ми се доверите, ќе ја имате под проклетството",
        "Technoblade: I must win Mr.Beasts refrigerators",
        "i love the irl stuff hes so good at it",
        "I'm so proud!!! THIS EDITING IS AMAZING GEORGE!!",
        "You still did great tho!!! 16 hours!?!? I can't even stay awake that long!",
        "Unsubscribe mrbeast",
        "GOGY Bro The collab is amazing",
        "I just like how intense George makes his videos because of his british accent. It's like a quest ",
        "Spoiler: He was second.",
        "George’s right hand is literally off the plane at 5:18 ",
        "Did you have any gamer sweat when Jimmy said \"Come here George\", after 20 manhunts of Dream yelling that phrase psichoticly.",
        "great vid george!\nu r soooo good at making IRL vids!",
        "You were soo close that I can feel Ur pain through the screen! But you did good! :)",
        "I I’m also subscribed",
        "Bro tought he had plot armor",
        "Although not the final winner, but still stick to the end, has been great! Love you!",
        "Technoblade: I must win Mr. Beast's $10,000 Refrigerator\nGeorgenotfound: I must win Mr. Beast's $2,500,000 Private Jet\n\nBoth are great videoes.",
        "Nice try George lol",
        "Well you failed",
        "NOOOOO GEOOOORRRGEEEEEE",
        "Trolled",
        "I'm shocked he lasted that long it must be so hard to stay awake let alone keep ur hand on a jet",
        "This title sadly reminds me of technos refrigerator mrbeast video :(",
        "Ty for putting this on twitter or I would have never seen it",
        "Ñ ",
        "so close, still very exciting to see you in a huge event like this and proud of how far you got!!",
        "lol ishowspeed",
        "He lost.",
        "Aw you were so close George! Good job! I was wondering why you had a camera lol",
        "george did all that work to get on the plane first... just to get on the plane last LMAO",
        "That did not work",
        "I just wached it on mr beast video",
        "I’m so proud of you! You did this really good!",
        "am i the only one who noticed the reference the technoblades refrigerator video",
        "I already knew how it ended but it still hurt to watch. George went so far, great job ",
        "Way is dream ?",
        "I can't help but feel sorry for George, he worked so hard trying to get that plane only to lose at the end",
        "Lol, I can't get over how small George looked compared to the other 2 when he had to have his hand up, he looked like he had to really stretch to keep  his hand above the tape   ",
        "Absolutely heartbreaking! You'll win next time!",
        "My day just gets so much better when George uploads",
        "title reminds me of \"I Must Win Mr. Beast's $10,000 Refridgerator.\" r.i.p Techno",
        "Your hand must be HURTING right now",
        "his reaction is priceless",
        "I'm so sorry Gogy, I really thought you were going to win (now im crying)",
        "If we all pitched in enough we could buy Gogy his own private jet with no beast needed",
        "I know Cory was dying of laughter when he was doing that \"think about it\" edit hahaha hilarious",
        "I'm pissed that WTS won.",
        "im so proud of you george :)",
        "tranquilo jorge yo también me ilusione ",
        "English:\nWell, in Poland, the challenges are only up to 1M, so it's boring, but at least there's something to watch...\n\nI'm dying of boredom here. xD",
        "1:51 \"That's a nice 6 inches!\" ",
        "2nd place, well done!",
        "Rip George",
        "well done George u did good ",
        "oh you were Soooo close",
        "Techno blade ripoff go brrrrrrr",
        "the technoblade reference in the title 🥹🥹",
        "LLLLLL GEORGE YOU WERE SO CLOSE",
        "NOOOOO George you almost made it",
        "Love this",
        "Yea Karl Georgnotfound will say your dum hahahaha jk",
        "Let’s just give a momment to be great full for George for trying.",
        "Mrbeast ",
        "You almost win aw",
        "You almost did",
        "George you did very good! I know you're going to win the next MrBeasts challenge!",
        "You got ansolutely violated and i love it",
        "Nice haircut",
        "The title reminds me of Technoblade’s “I must win Mrbeast $10,000 fridge” \n\nWe will always remember this legend",
        "sorry NDL needs this one",
        "they did you real dirty george XD",
        "The dedication is incredible. \nProps to you George!!",
        "That is a massive oof",
        "Poor George, he tried so hard just to get into the plane last but he put in a great effort.",
        "Just hearing the sheer terror in TapL's voice as he screamed \"ITS HIM\" is PURE joy. They don't even need to refer to him as Techno, they just scream \"its him\" at the top of their lungs and EVERYONE KNOWS WHO IT IS",
        "5:17 right hand?!",
        "this reminds me of when techno tried to win the $10,000 refrigerator ",
        "This is inpossible ofc Gogy was sopostu to win it was definently harrys finger",
        "I just realised mrbeast passed pewdiepie",
        "Beautiful",
        "अपने 🇮🇳🇮🇳 भारत को कोण लाईक करता हे",
        "he has stayed in the challenge>:)",
        "so proud of u george!",
        "I feel the pain with George, R.IP. man, i like that everybody was against George all the time in the video to",
        "Poor george",
        "I love how there were random Dream songs mixed in.",
        "That was a big oof for ya George!",
        "I love the technoblade inspired title",
        "I just realised george's thumnail and the topic is similar to technoblade's fridge video with mrbeast",
        "5:54 gorge took him hand off to get the camera but no one noticed",
        "George I need your help I need to get in contact with dream because I really want to join the s&p I'm a very small YouTuber I think people would honestly like me but I just I want to become a YouTuber like you guys I just don't have the materials to do it so I don't have like I don't have a Minecraft that I need I just want to contact with him and ask him if he can join some time because I really want to be a YouTuber like all of you guys which in reality would never happen I just want to be in like one episode you guys don't have to if you guys don't want to I just wanted to ask and I hope you guys even see this I've just been through a lot and I want to help you guys out while also helping myself out",
        "Will you go to Heaven when you die ? Have you ever Lied, stolen, used Gods name in vain (such as OMG), Had sex outside of Marriage ? Truth is...We have all sinned and broke Gods laws. And sin is what sends us to Hell. But even though we broke Gods laws, God being rich in mercy sent his son Jesus born of a virgin. He lived a sinless perfect life something we could not do. He willingly went to the cross and took the punishment we deserve by dying on the cross for our sins. Then 3 days later rose from the dead and was seen by hundreds of eye witnesses and then ascended into Heaven where he sits at the right hand of God. So please today put your Faith and trust in Jesus before its too late.",
        "You did a great job george!!!",
        "Love this editing",
        "GEORGE WON CUZ HARRY SAID HE TOOK IT OFF SO HE TOOK IT OFF BEFORE HIM GEORGE WON BUT THE TEAM DIDN'T CATCH IT",
        "Last one to stop live streaming challenge",
        "Geoooorge Ur so aaah!",
        "oof\n\ni feel for gogs",
        "Wow nice collaboration. Love you both. Thanks both of u",
        "Did anyone notice that title of video is inspired by Techno? ",
        "I love Jimmy ",
        "I felt bad for George all that effort but im still happy that he was so close at winning we're proud of you George",
        "Dang, the title really remember Technoblade's \"i must win Mrbeast's 10.000 dollars refrigerator",
        "Good try my man!",
        "Biggest youtuber is CocoMelon he have 140+ Million subscribers",
        "hes just a little cat",
        "Is it just me being reminded of techno's refrigerator title by this title? RIP",
        "That’s not a cameraman, that’s Tariq!",
        "Here within 2 days",
        "U lost at the last one",
        "I love the ending",
        "You did a great job bud  :)",
        "So... what's someone supposed to do with the jet if they can't afford it?",
        "Imagine speed screams",
        "George you let your own fans down",
        "Cold blooded mr beast cold blooded",
        "2nd rip",
        "the title reference to techno made my heart melt",
        "I tried so hard and got so far but in the end it doesn't even matter",
        "NOOOO GEORGE :'(",
        "hmmmmm... this title seems... familiar. Its almost like Technoblade uploaded a video titled  \"I must win MrBeast's 10,000 dollar refrigerator.\"",
        "Is IShowSpeed is on this video cool",
        "The way PROFESSIONAL george fell",
        "George: gone for 17 hours \nDream and SapNap: You think he fell asleep ?",
        "Vikkstar: We Are Logical People.  Immediately raises hand off jet.",
        "GEORGE HES SHORT MR BEAST WHY DID YOU RAISE THE RED TAPE?",
        "What mrbeast could have done he put therr first letter name on the finger",
        "The fact that Tommy does the Lucky Block Mod with his friends gives me some nostalgia to it, glad to see him and his friends messing around with the Lucky Block Mod B-) :-/",
        "Lets all appreciate the effort and hard work George puts into his videos for our entertainment",
        "George, I seen you in Mr Beat video. So cool! New subbie here!!",
        "You should have brought some super glue",
        "thank you for the video, it was really good!",
        "GOREGE NOOOOOO"
    ],
    "comments_disabled": false
}